{
    "title": "My SD broke my heart 💔",
    "post_id": "e72ijj",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/e72ijj/my_sd_broke_my_heart/",
    "author": "sugarbaby991",
    "body": ".",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/e72ijj/my_sd_broke_my_heart/",
    "score": 134,
    "upvote_ratio": 0.94,
    "created_utc": 1575657129.0,
    "num_comments": 112,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "This is really a nightmare scenario :( I'm sorry",
            "author": "tenmillionplus",
            "id": "f9uuuge",
            "parent_id": "t3_e72ijj",
            "score": 79,
            "created_utc": 1575658110.0,
            "replies": [
                {
                    "body": "It's probably not that you are not \"good enough\" but rather in his perverted brain no great SB would accept and care for him. Therefore , you must be flawed.  \n\nDoesn't sound like there is a takeaway lesson other than that some men are insecure dogs who believe any woman who accepts them must be flawed to the point of condemnation .",
                    "author": "pinotandsugar",
                    "id": "f9w0o9l",
                    "parent_id": "t1_f9uuuge",
                    "score": 29,
                    "created_utc": 1575684840.0,
                    "replies": [
                        {
                            "body": "damn girl, weirdly accurate.",
                            "author": "RB-L",
                            "id": "f9wfcch",
                            "parent_id": "t1_f9w0o9l",
                            "score": 4,
                            "created_utc": 1575691748.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Update to the thread: Sorry, forgot to mention that my friend is strictly looking for a platonic arrangement and she said no to the intimacy part. She sent me the chat, he got really mad after she told him this and cursed her out. I was shocked when reading. The main reason why I like him so much is that I thought he is the most chill and sweet person I’ve ever met. But the things he said to her were childish insults, rants how she is not attractive enough compared to the girls he is taking to atm! I’m feeling sick just reading that",
            "author": "sugarbaby991",
            "id": "f9v5dl7",
            "parent_id": "t3_e72ijj",
            "score": 96,
            "created_utc": 1575663432.0,
            "replies": [
                {
                    "body": "Aw dude that's the fuckin worst. I judge people way more based on how they treat others as opposed to how they treat me, so I would be very very wary knowing someone I had any form of relationship with spoke to other women that way :(",
                    "author": "spoiledbratcat",
                    "id": "f9vhfsw",
                    "parent_id": "t1_f9v5dl7",
                    "score": 37,
                    "created_utc": 1575670591.0,
                    "replies": []
                },
                {
                    "body": ">The main reason why I like him so much is that I thought he is the most chill and sweet person I’ve ever met. But the things he said to her were childish insults,\n\nIts sad, but look at the positive side of things, you learnt two important things from this:\n\n- He doesn't like you back as much as you think, so he's looking.\n\n- He's not the kind of person you thought he was.",
                    "author": "4adomme",
                    "id": "f9vksl7",
                    "parent_id": "t1_f9v5dl7",
                    "score": 28,
                    "created_utc": 1575672899.0,
                    "replies": []
                },
                {
                    "body": "Clearly this guy has issues if he’s getting upset over the internet all because she stated she didn’t want intimacy. Move on then, instead of acting like a big baby who needs to throw tantrums when they don’t get what they want. 🙄\nUnfortunately you never truly know someone, sure you have an idea of them but when the true colours come out that’s when your eyes are a little more open and that idea of them shatters. Hoping you will be okay, I know feels don’t just vanish overnight but you both are better off not talking to this twat any further. Like Tupac said, girl keep ya head up ❤️",
                    "author": "sugasuga24",
                    "id": "f9vwpv2",
                    "parent_id": "t1_f9v5dl7",
                    "score": 7,
                    "created_utc": 1575681813.0,
                    "replies": []
                },
                {
                    "body": "Don't feel sick, feel lucky ..... that you got to understand what he was before further damage was done.",
                    "author": "pinotandsugar",
                    "id": "f9w0rcx",
                    "parent_id": "t1_f9v5dl7",
                    "score": 7,
                    "created_utc": 1575684909.0,
                    "replies": []
                },
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "f9y5iv5",
                    "parent_id": "t1_f9v5dl7",
                    "score": 7,
                    "created_utc": 1575723728.0,
                    "replies": [
                        {
                            "body": "You raise excellent points, especially your last sentence.",
                            "author": "formfunctional",
                            "id": "f9ymm0f",
                            "parent_id": "t1_f9y5iv5",
                            "score": 4,
                            "created_utc": 1575730754.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Sounds like you dodged a bullet there.",
                    "author": "mmedamdom",
                    "id": "f9wgwbt",
                    "parent_id": "t1_f9v5dl7",
                    "score": 5,
                    "created_utc": 1575692448.0,
                    "replies": []
                },
                {
                    "body": "Did he find out that you know her?",
                    "author": "tenmillionplus",
                    "id": "f9vige2",
                    "parent_id": "t1_f9v5dl7",
                    "score": 3,
                    "created_utc": 1575671284.0,
                    "replies": [
                        {
                            "body": "Not yet, I still haven’t replied to his last message about our next meeting. I think he suspects that I know something as normally reply straight away.. still not sure what to say to him",
                            "author": "sugarbaby991",
                            "id": "f9vkg7w",
                            "parent_id": "t1_f9vige2",
                            "score": 12,
                            "created_utc": 1575672657.0,
                            "replies": [
                                {
                                    "body": "I would reply to him with one of the comments he made to your friend... but I'm petty.",
                                    "author": "spoiledbratcat",
                                    "id": "f9wwn6d",
                                    "parent_id": "t1_f9vkg7w",
                                    "score": 8,
                                    "created_utc": 1575700250.0,
                                    "replies": []
                                },
                                {
                                    "body": "I guess the question is do you have any interest in continuing or not?",
                                    "author": "tenmillionplus",
                                    "id": "f9vkthe",
                                    "parent_id": "t1_f9vkg7w",
                                    "score": 9,
                                    "created_utc": 1575672916.0,
                                    "replies": []
                                },
                                {
                                    "body": "I hope you send him one screenshot of the conversation with your friend. Preferably a part where he is being particularly terrible to her.\nAnd nothing else.",
                                    "author": "LurkingViking555",
                                    "id": "f9w2bw7",
                                    "parent_id": "t1_f9vkg7w",
                                    "score": 10,
                                    "created_utc": 1575685809.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": ">I just found out that my SD of 5 months has messaged my friend on Seeking offering her twice as much allowance as gives me. He agreed to give it to her on the first date.\n\nIt's so bad. Does he know that the girl was your friend at first?\n\n&#x200B;\n\n>he got really mad after she told him this and cursed her out\n\nShould you feel like you dodged a bullet?\n\nBoys are boys. If you have feelings for him, it maybe dangerous for you.",
                    "author": "freeyaman",
                    "id": "f9wvnjt",
                    "parent_id": "t1_f9v5dl7",
                    "score": 5,
                    "created_utc": 1575699716.0,
                    "replies": []
                },
                {
                    "body": "Take notes from your friend, she knows what she's doing.",
                    "author": "Allthatjasmine",
                    "id": "f9vsqcz",
                    "parent_id": "t1_f9v5dl7",
                    "score": 7,
                    "created_utc": 1575678732.0,
                    "replies": []
                },
                {
                    "body": "Oh wait so she knows ?? No cool",
                    "author": "mariposakb",
                    "id": "f9wr5nj",
                    "parent_id": "t1_f9v5dl7",
                    "score": 1,
                    "created_utc": 1575697369.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I am sorry to hear that hun :/\nIt is not your fault, so don't blame yourself. \nI know this is hard for you and don't take this the wrong way, but maybe he offerred her more because she asked for more to begin with? Have you talked to him about switching to an allowance ?\nEither way, try your best not to take it personal.",
            "author": "himynameis--76324675",
            "id": "f9uu0bb",
            "parent_id": "t3_e72ijj",
            "score": 19,
            "created_utc": 1575657680.0,
            "replies": [
                {
                    "body": "Yes, you’re right, she demanded for it, in quite a rude way too (I saw the screenshot) but he agreed.\n\nI was very awkward when he asked what do I want and said for him to suggest it and accepted his offer with no negotiation. I never asked to switch to allowance either, I feel like it should be initiated by him. I feel like him still giving me ppm is unfair as i’m exclusive to him and haven’t even been talking to other men since we started an arrangement. Also, we text everyday throughout the day and I share my photos, vids with him..",
                    "author": "sugarbaby991",
                    "id": "f9uv97g",
                    "parent_id": "t1_f9uu0bb",
                    "score": 18,
                    "created_utc": 1575658319.0,
                    "replies": [
                        {
                            "body": "Well I think the reason that he was giving her more was because she asked for more. So it’s not at all a reflection of her being worth more. I think you have to take your emotions out of things in these situations. But I am sorry that happened to you. I hope you find someone better:)",
                            "author": "strippersugarbaby23",
                            "id": "f9uzsqy",
                            "parent_id": "t1_f9uv97g",
                            "score": 31,
                            "created_utc": 1575660623.0,
                            "replies": [
                                {
                                    "body": "will you be my sugar baby ?",
                                    "author": "davec259901",
                                    "id": "fgf6vjf",
                                    "parent_id": "t1_f9uzsqy",
                                    "score": 1,
                                    "created_utc": 1580727674.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "Oh sweetie, take this lesson and learn from it, you need to know your worth and charge accordingly. \nExclusivity costs!!",
                            "author": "Allthatjasmine",
                            "id": "f9vozck",
                            "parent_id": "t1_f9uv97g",
                            "score": 15,
                            "created_utc": 1575675918.0,
                            "replies": []
                        },
                        {
                            "body": "If you want something, you should ask for it. Ask him about allowance if it would make the situation better for you. \n\nIf it would not, end things and find someone else.",
                            "author": "NoBromo3213",
                            "id": "f9v06a4",
                            "parent_id": "t1_f9uv97g",
                            "score": 13,
                            "created_utc": 1575660814.0,
                            "replies": []
                        },
                        {
                            "body": "It's ultimately a business transaction, and expecting it to follow the hearts rules just because you would prefer it to, and not because you've said anything, doesn't seem like it's likely to work out.",
                            "author": "Sugarbeggar",
                            "id": "f9v1s5q",
                            "parent_id": "t1_f9uv97g",
                            "score": 12,
                            "created_utc": 1575661621.0,
                            "replies": []
                        },
                        {
                            "body": "i think after finding out what you found out - stop sending free pics and vids to him, start replying slowly to him, start pulling away so he can either chase you like the dog he is or stop talking to you so you can find a better sugar daddy. Men are weak as piss and fowl sugar daddies like this dont deserve to be treated kindly at all. I'd personally become the baddest bitch and make him wish he never fucked with my heart. \n\nIt's time to do you sis, get all the dick you can for money and flaunt in that dumb pigs face! \n\nYouve got this! Youre the one with the pussy - youre the one with he power. No guy can enter your heaven unless you allow him to and you can stop trash guys from entering when you want. \n\nDont let ANYONE treat you like this, hes a scumbag and i know how shit it feels. You can get through this boo, trust me! You are beautiful, kind, intelligent, sweet, sexy, to die for - dont EVER let any man think youre less than or treat you like youre less than! \n\n<3",
                            "author": "luckylillola",
                            "id": "f9w198f",
                            "parent_id": "t1_f9uv97g",
                            "score": 10,
                            "created_utc": 1575685265.0,
                            "replies": [
                                {
                                    "body": "Translated ...... take no prisoners. \n\n\"  - dont EVER let any man think youre less than or treat you like youre less than!\"      translated   be treated as the gift that you are or say goodbye.... perhaps with a few small body parts in you pocket.",
                                    "author": "pinotandsugar",
                                    "id": "f9w2rmv",
                                    "parent_id": "t1_f9w198f",
                                    "score": 4,
                                    "created_utc": 1575686023.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "Allowance wise I always ask what a POT is looking for. I do admit that years ago I would use it as a negotiating point, now I use it to gage if the POT is really looking for an arrangement or just a side gig. Personally I’d rather do allowance, with an agreed minimum and maximum amount of meets. I do split the allowance in half when starting out.",
                            "author": "OffhandCut",
                            "id": "f9yrh6o",
                            "parent_id": "t1_f9uv97g",
                            "score": 1,
                            "created_utc": 1575732848.0,
                            "replies": []
                        },
                        {
                            "body": "I empathize with you. I don't know how to demand more for myself in relationships and I always end up feeling used. not even a sb",
                            "author": "smocks",
                            "id": "f9vgccb",
                            "parent_id": "t1_f9uv97g",
                            "score": 1,
                            "created_utc": 1575669848.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "If the friend is a friend, she'll turn him down.",
            "author": null,
            "id": "f9uukdz",
            "parent_id": "t3_e72ijj",
            "score": 47,
            "created_utc": 1575657968.0,
            "replies": [
                {
                    "body": "I am curious if the friend is going to move forward with this or not",
                    "author": "tenmillionplus",
                    "id": "f9uuv97",
                    "parent_id": "t1_f9uukdz",
                    "score": 16,
                    "created_utc": 1575658122.0,
                    "replies": []
                },
                {
                    "body": "The best hits will be the new friend taking the offer and helping her to improve her profile to attract that type of offer.\n\nProfit maximization",
                    "author": "Lilipuss25",
                    "id": "f9vpiku",
                    "parent_id": "t1_f9uukdz",
                    "score": 2,
                    "created_utc": 1575676308.0,
                    "replies": [
                        {
                            "body": "In a true best of worlds.\nBut it's not easy to be THAT cooperative when self-image and money are at stake.",
                            "author": null,
                            "id": "f9vt0or",
                            "parent_id": "t1_f9vpiku",
                            "score": 3,
                            "created_utc": 1575678956.0,
                            "replies": [
                                {
                                    "body": "When it comes sugaring, work, we need to have a se;f improvement mindset and be capable of putting our ego aside.\n\nHère it’s just the ego. And even if she stay with SD and the friends don’t accept, she will resent him for lowballing her, the only way will be him matching the offer, and even if he match the offer she still could resent him.\n\nIt’s a lose lose situation",
                                    "author": "Lilipuss25",
                                    "id": "f9w83p6",
                                    "parent_id": "t1_f9vt0or",
                                    "score": 2,
                                    "created_utc": 1575688559.0,
                                    "replies": [
                                        {
                                            "body": "We have to think of everyone.\nSomeone posts to a forum to say “My SD broke my heart.”\nSome fellow wants a sugar baby.  That means young.  Young means most likely fragile.  It comes with the territory.\nOf all the girls in the world, going to original SB's friend is a douchy move.\nSD's had it w/original SB?  Okay.\nBut approaching her friend?  Yeah, it may not be illegal.  But it's not a nice thing to do.",
                                            "author": null,
                                            "id": "f9wdowe",
                                            "parent_id": "t1_f9w83p6",
                                            "score": 2,
                                            "created_utc": 1575691004.0,
                                            "replies": [
                                                {
                                                    "body": " I never said it was nice. We all agree on that.\nPlus nothing here show that the SD she was her friend. Maybe he just went for the new hot girl.\n\nI’m just responding to people who think the friends shouldn’t take the offer for the sake of OP ego. I disagree with that and I think it’s a lose lose situation.\nI also know it’s easier said than done as yˋshe is apparently in live with him",
                                                    "author": "Lilipuss25",
                                                    "id": "f9xd49m",
                                                    "parent_id": "t1_f9wdowe",
                                                    "score": 1,
                                                    "created_utc": 1575709229.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "That's not true. You should praise your friend for making more money. Turning him down isnt going to give the first girl money. Cant be mad at her or him for their arrangement. Every relationship is different and shouldn't judge others arrangement. She should just find another one. \nI have one SB I give allowance to, and one I only spoil when they are physically with me.",
                    "author": null,
                    "id": "f9uy1rh",
                    "parent_id": "t1_f9uukdz",
                    "score": -4,
                    "created_utc": 1575659740.0,
                    "replies": [
                        {
                            "body": "Lmao in what kind of world would OP praise her friend? I'm not sure what kind of friendships you have, but if a friend knew doing something would be hurtful to me and yet she did it anyway, that's a blatant disregard of my trust and my feelings. And that's not a real friend.",
                            "author": "agavebabe98",
                            "id": "f9v9efr",
                            "parent_id": "t1_f9uy1rh",
                            "score": 32,
                            "created_utc": 1575665436.0,
                            "replies": [
                                {
                                    "body": "Tag team and bleed him 😆 (I joke, of course)",
                                    "author": null,
                                    "id": "f9vgm8g",
                                    "parent_id": "t1_f9v9efr",
                                    "score": 14,
                                    "created_utc": 1575670031.0,
                                    "replies": []
                                },
                                {
                                    "body": "You just answered your own question. And if you read my comment it also answered your questions. OPs friend turning him down will not help OP out. I don't have time to argue with kids. You either know or you don't. Instead of being spiteful, look at the positives. She isnt fucking her friends husband. Its a SD SB relationship and each one is different. Grow up or get out of the lifestyle (if you are really in it which is highly doubtful)",
                                    "author": null,
                                    "id": "f9w7xd0",
                                    "parent_id": "t1_f9v9efr",
                                    "score": -1,
                                    "created_utc": 1575688479.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "> You should praise your friend for making more money.\n\nNot sure if joking or tone deaf af.",
                            "author": "Ranger3752",
                            "id": "f9vk5we",
                            "parent_id": "t1_f9uy1rh",
                            "score": 8,
                            "created_utc": 1575672455.0,
                            "replies": [
                                {
                                    "body": "You are probably gone definitely? Idk if you are insulting or agreeing with me. As a SD you should understand what I'm saying. Unless you are one of these fake \"online\" SD that just sit on the internet all day and never have sex or travel. 🤷🏼‍♂️",
                                    "author": null,
                                    "id": "f9w8l99",
                                    "parent_id": "t1_f9vk5we",
                                    "score": -3,
                                    "created_utc": 1575688770.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "My perception is different from yours.\nI do not find yours false.",
                            "author": null,
                            "id": "f9vt61u",
                            "parent_id": "t1_f9uy1rh",
                            "score": 2,
                            "created_utc": 1575679071.0,
                            "replies": [
                                {
                                    "body": "Okay. As long as you understand. This new age SB shit is getting ridiculous. Remember SB and SD. Facts and your feelings are different. This life style is just that A LIFE STYLE. If you cant handle it then dont do it!",
                                    "author": null,
                                    "id": "f9w8v8o",
                                    "parent_id": "t1_f9vt61u",
                                    "score": -1,
                                    "created_utc": 1575688893.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "If the friend dont secure that bag some other girl will so I agree she needs to go for it. SA is not a Im looking to fall in love dating site so why treat it as such?",
                            "author": "CareFreeWorld",
                            "id": "f9vffai",
                            "parent_id": "t1_f9uy1rh",
                            "score": 2,
                            "created_utc": 1575669247.0,
                            "replies": [
                                {
                                    "body": "Oooooh my gooood it's not all about securing the fucking bag. If y'all wanna prioritize money over real, meaningful friendships that's a lonely fucking life. I'm done here 😭",
                                    "author": "agavebabe98",
                                    "id": "f9vgx6g",
                                    "parent_id": "t1_f9vffai",
                                    "score": 13,
                                    "created_utc": 1575670236.0,
                                    "replies": [
                                        {
                                            "body": "Hère op isnt only sad because he hit on her friend but also because and mostly because he’s willing to give her double what she is getting",
                                            "author": "Lilipuss25",
                                            "id": "f9vpvck",
                                            "parent_id": "t1_f9vgx6g",
                                            "score": 3,
                                            "created_utc": 1575676571.0,
                                            "replies": [
                                                {
                                                    "body": "and she been having to serve it up too, friend was like nah bruh lmao and got double!",
                                                    "author": "Alawa2000",
                                                    "id": "f9w3tni",
                                                    "parent_id": "t1_f9vpvck",
                                                    "score": 2,
                                                    "created_utc": 1575686553.0,
                                                    "replies": [
                                                        {
                                                            "body": "Good for the friend. Why be spiteful and jealous 🤷🏼‍♂️",
                                                            "author": null,
                                                            "id": "f9w8683",
                                                            "parent_id": "t1_f9w3tni",
                                                            "score": 1,
                                                            "created_utc": 1575688597.0,
                                                            "replies": [
                                                                {
                                                                    "body": "exactly",
                                                                    "author": "Alawa2000",
                                                                    "id": "f9w8j16",
                                                                    "parent_id": "t1_f9w8683",
                                                                    "score": 2,
                                                                    "created_utc": 1575688745.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "body": "Money doesn't matter because every relationship is different! Ffs",
                                                    "author": null,
                                                    "id": "f9w84hg",
                                                    "parent_id": "t1_f9vpvck",
                                                    "score": 1,
                                                    "created_utc": 1575688570.0,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "body": "Not that it matters, but I agree that prioritizing money here seems wrong. We are talking about people, not products-- and people have real feelings.",
                                            "author": "justaguyhereyeah",
                                            "id": "f9wdtcy",
                                            "parent_id": "t1_f9vgx6g",
                                            "score": 2,
                                            "created_utc": 1575691061.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "There aren’t friendship involved here. \nOp doesn’t meet SD complete need or sold herself cheap.\n\nHe’s looking for a new girl he will be spending more. Either he spend that 2*allowande on her friend or he’ll give it to someone else",
                                            "author": "Lilipuss25",
                                            "id": "f9vppt3",
                                            "parent_id": "t1_f9vgx6g",
                                            "score": 3,
                                            "created_utc": 1575676458.0,
                                            "replies": [
                                                {
                                                    "body": "Exactly",
                                                    "author": null,
                                                    "id": "f9w8aj8",
                                                    "parent_id": "t1_f9vppt3",
                                                    "score": 2,
                                                    "created_utc": 1575688646.0,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "body": "👏",
                                            "author": "lakoreanita",
                                            "id": "f9vjt0p",
                                            "parent_id": "t1_f9vgx6g",
                                            "score": 2,
                                            "created_utc": 1575672207.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "Lmbo your dilusional AF. You want a meaninful friendship relationship join a church or match.com not a pay for play dating site. Because at the end of the day thats all it is. \nWelcome to teality kitten😯",
                                            "author": "CareFreeWorld",
                                            "id": "f9vuv7r",
                                            "parent_id": "t1_f9vgx6g",
                                            "score": 2,
                                            "created_utc": 1575680379.0,
                                            "replies": [
                                                {
                                                    "body": "Wow cool. So I guess all the times my SD told me he loved me and that I changed his life and sent me money without going on any extra dates was all just meaningless. If you wanna treat sugaring like escorting than cool, love that for you 😉",
                                                    "author": "agavebabe98",
                                                    "id": "f9w840v",
                                                    "parent_id": "t1_f9vuv7r",
                                                    "score": 4,
                                                    "created_utc": 1575688564.0,
                                                    "replies": [
                                                        {
                                                            "body": "SD-SB relationships are not just financial deals, imho. Like you say, that sort of emotionless deal sounds more like escorting.",
                                                            "author": "justaguyhereyeah",
                                                            "id": "f9welq0",
                                                            "parent_id": "t1_f9w840v",
                                                            "score": 3,
                                                            "created_utc": 1575691411.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "body": "For real. I agree",
                                                    "author": null,
                                                    "id": "f9w88dv",
                                                    "parent_id": "t1_f9vuv7r",
                                                    "score": 0,
                                                    "created_utc": 1575688621.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "I agree. That other redditor crying is obviously not cut out for this life style and is delusional",
                                    "author": null,
                                    "id": "f9w820d",
                                    "parent_id": "t1_f9vffai",
                                    "score": -1,
                                    "created_utc": 1575688537.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "FYI: Sorry that you feel hurt but rule mumber 1. You do not fall in love with a SD period! That type of relationship has a expiration date my dear. Yes a handful will actually turn into long lasting relationships even marriage but that is so far and in between.\nSo Im very sorry to break it to you but it was either going to be your friend or some other girl. And as far as your friend she should get that money why not?\nDon't beat yourself up over this gf that man was not and will never be your life partner.\nUse this as a learning curb and next time save your 💗for your future husband that Im sure you will not meet on SA. \nGood luck",
            "author": "CareFreeWorld",
            "id": "f9vf90j",
            "parent_id": "t3_e72ijj",
            "score": 11,
            "created_utc": 1575669131.0,
            "replies": [
                {
                    "body": "In my case dating a sugar daddy just ends up in poor unequal power dynamics. The sugar daddy i dated stopped paying me and just used me to feel better about himself - cheated on me, manipulated me, isolated me, lied to me.. Keep all money dealings STRICTLY PROFESSIONAL is what I've learned so far lol",
                    "author": "luckylillola",
                    "id": "f9w6ov7",
                    "parent_id": "t1_f9vf90j",
                    "score": 1,
                    "created_utc": 1575687889.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I love how this guy is a jackass and some of you are chastising her for developing feelings for him. It absolutely amazes me that his actions are being justified. What he has done is disgusting. I don't care if the sugar bowl is about materialism and hot girls, we are still human beings and should try our best to not treat people like shit. \n\nDo most of you SD's get together and congratulate each on how you act and how you treat women like toys ? I don't care if the SB is being paid , still doesn't deserve to be treated in such a way. \n\nAnd this bull about not developing feelings , please. Most of you bitch about being treated like an ATM but then bitch if the girl develops feelings. \n\nJust because you can be a scum bag doesn't mean you should be. \n\nOp, you have every right to feel hurt and be upset. He's a douche canoe ..and if your friend moves forward with him, she is a douche canoe as well and I'd be done.",
            "author": "nellybelle1984",
            "id": "f9vvsgc",
            "parent_id": "t3_e72ijj",
            "score": 10,
            "created_utc": 1575681095.0,
            "replies": []
        },
        {
            "body": "“Comparison is the thief of joy”",
            "author": null,
            "id": "f9uwbuo",
            "parent_id": "t3_e72ijj",
            "score": 34,
            "created_utc": 1575658867.0,
            "replies": [
                {
                    "body": "Well said.",
                    "author": "zztop1999",
                    "id": "f9uwx3m",
                    "parent_id": "t1_f9uwbuo",
                    "score": 3,
                    "created_utc": 1575659167.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I’m so sorry for you and wish I had some magic words to make you feel better!  \n\nThis is not a reflection on you ... just him.",
            "author": "Beloit1414",
            "id": "f9utk70",
            "parent_id": "t3_e72ijj",
            "score": 6,
            "created_utc": 1575657451.0,
            "replies": []
        },
        {
            "body": "My SB did the same to me when we did our first M&G and asked me to make a suggestion.  To my surprise, she accepted my first offer with no hesitation or negotiation.  After a few months, I could tell she was researching this topic and approached me very amicably (so much so that I wonder if she's posted and received advice on here, haha).  Nonetheless, I like her a lot, so happily agreed to her request.  It was very high, nearly double!  But she's beautiful, young and sexy so I do not mind at all.  I just can't see her as often, but it's okay as I savor those days anyways.\n\nI only say this to suggest that you may want to do the same.  And if he acts childish to you as he did to your friend, I highly suggest you move on.  You can find someone that will adore and cherish you.  Though I hate to admit, that it's a LOT harder now with so many false expectations of findom, platonic relationships, frauds, salt daddies, etc...\n\nI wish you the best of luck and hopefully this sour experience can turn into lemonade!!!",
            "author": "PinyTheElder",
            "id": "f9v7uhi",
            "parent_id": "t3_e72ijj",
            "score": 8,
            "created_utc": 1575664656.0,
            "replies": [
                {
                    "body": "Fantastic response!",
                    "author": "ewwitsjessagain",
                    "id": "f9yn2vc",
                    "parent_id": "t1_f9v7uhi",
                    "score": 1,
                    "created_utc": 1575730947.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Don’t cry over money. It wont’t cry over you.",
            "author": null,
            "id": "f9vvct0",
            "parent_id": "t3_e72ijj",
            "score": 4,
            "created_utc": 1575680759.0,
            "replies": []
        },
        {
            "body": "Oh man, that’s awful! I’m so sorry",
            "author": "mraspencer",
            "id": "f9uuofv",
            "parent_id": "t3_e72ijj",
            "score": 7,
            "created_utc": 1575658025.0,
            "replies": []
        },
        {
            "body": "So sorry this happened... that sounds rough",
            "author": "NoBromo3213",
            "id": "f9v0cxn",
            "parent_id": "t3_e72ijj",
            "score": 3,
            "created_utc": 1575660912.0,
            "replies": []
        },
        {
            "body": "Did you have an exclusive arrangement with your SD?  Why not reach out to him about your feelings on this?",
            "author": "Aigean333",
            "id": "f9v4f5u",
            "parent_id": "t3_e72ijj",
            "score": 3,
            "created_utc": 1575662950.0,
            "replies": [
                {
                    "body": "Yes, it was supposed to be an exclusive arrangement. However, after this situation, tomorrow i’m booking the appointment to get a full STI screening test 😒",
                    "author": "sugarbaby991",
                    "id": "f9vadcc",
                    "parent_id": "t1_f9v4f5u",
                    "score": 13,
                    "created_utc": 1575665977.0,
                    "replies": [
                        {
                            "body": "Probably not a bad idea.  Sorry you had to experience this, but look for the lessons involved.  That's the best you can do at this point.",
                            "author": "Aigean333",
                            "id": "f9vcud8",
                            "parent_id": "t1_f9vadcc",
                            "score": 7,
                            "created_utc": 1575667565.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Take it as a sign and be glad. Now you can keep your feelings in check. Be it Vanila/Sugar, there’s are certain dick moves you are not supposed to do. It’s just cruel. \n\nAlso none of this is your fault, also not your friend’s. Just wish him luck and move on. \n\nPlus never put down yourself by comparing yourself to someone.",
            "author": "Want2bSB",
            "id": "f9v7c8k",
            "parent_id": "t3_e72ijj",
            "score": 3,
            "created_utc": 1575664407.0,
            "replies": []
        },
        {
            "body": "This is way too much to unpack.",
            "author": null,
            "id": "f9vhfbp",
            "parent_id": "t3_e72ijj",
            "score": 3,
            "created_utc": 1575670583.0,
            "replies": []
        },
        {
            "body": "Rude",
            "author": "Mopsydoll",
            "id": "f9v3i28",
            "parent_id": "t3_e72ijj",
            "score": 2,
            "created_utc": 1575662487.0,
            "replies": []
        },
        {
            "body": "First, I’m sorry that this happened to you.  While many feel that you shouldn’t be in arrangements that can result in being heart broken, I disagree.  It seems to me that you developed feelings for your SD, and see his behavior as a betrayal.  This emotion, and frankly no emotions we have are “wrong”.  It’s unfortunate, and likely no going back from here.\n\nWhen you are ready to search again, be up front that you are looking for an SD that is a one SB type of man.  It’s likely that he will be looking for exclusivity, which is something that you will need to consider.  There are SDs like this, and even some that don’t ask for exclusivity as well, so hopefully you find one.",
            "author": null,
            "id": "f9v71t3",
            "parent_id": "t3_e72ijj",
            "score": 2,
            "created_utc": 1575664259.0,
            "replies": []
        },
        {
            "body": "I've had all kinds of diff arrangements. I understand the feeling of thinking wow thus is a great arrangement then getting dissed. I had one guy think that because I did like him he could drop the price. He was married that's why I stuck to the price. Lol. You will find some good SD and some bad ones. Sorry for the tough love talk in my post before. You will find a good one sometimes it just takes a few bad ones with a kinda good one in between. Good luck. Just stay positive. \n\nP.S. I feel like seeking is a bunch of bullshit guys on there are bullshit. I had some luck but most the guys on there said  one thing and meant another. I had better luck when I worked in a club or went out to places guys I wanted to attack hung out.",
            "author": "sodapopulation13",
            "id": "f9vmk54",
            "parent_id": "t3_e72ijj",
            "score": 2,
            "created_utc": 1575674151.0,
            "replies": []
        },
        {
            "body": "Pick yourself up and dust your crown off, you are too good for him.",
            "author": "Cdnmaple75",
            "id": "f9vt822",
            "parent_id": "t3_e72ijj",
            "score": 2,
            "created_utc": 1575679114.0,
            "replies": []
        },
        {
            "body": "Take this as a lesson doll, never get attached to your SD. If I were you, I would demand a higher allowance and start looking for another SD.",
            "author": "Billionbabe",
            "id": "f9xost4",
            "parent_id": "t3_e72ijj",
            "score": 2,
            "created_utc": 1575715504.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "f9v6drt",
            "parent_id": "t3_e72ijj",
            "score": 3,
            "created_utc": 1575663934.0,
            "replies": [
                {
                    "body": "Haha we were just joking about this but she is not willing to have intimacy with him. This probably wouldn’t work just during a public meeting",
                    "author": "sugarbaby991",
                    "id": "f9v7g6l",
                    "parent_id": "t1_f9v6drt",
                    "score": 3,
                    "created_utc": 1575664462.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "How close is said friend? If she’s your best friend that’s really touchy. Does she know you have feelings for the guy? If so, dump her ass. I think it’s pretty screwed up that she’s not only snagging your favorite boy toy, but your game too? Yeahhh If she goes a long with it I would honestly lose my shit on her but that’s just me...BUT I always say never let a dumbass man come between inseparable best friends, but it does depend on how “severe” the situation is. Go with your gut. ♥️",
            "author": "lexamroseee",
            "id": "f9v0j98",
            "parent_id": "t3_e72ijj",
            "score": 2,
            "created_utc": 1575661000.0,
            "replies": [
                {
                    "body": ">  I think it’s pretty screwed up that she’s not only snagging your favorite boy toy, but your game too? \n\nIf he's looking that hard chances are it would be some other SB if not her friend.",
                    "author": "Sugarbeggar",
                    "id": "f9v25nv",
                    "parent_id": "t1_f9v0j98",
                    "score": 2,
                    "created_utc": 1575661812.0,
                    "replies": [
                        {
                            "body": "But wouldn’t it be easier and less painful if it were some random girl and not her friend?",
                            "author": "lexamroseee",
                            "id": "f9wmfkj",
                            "parent_id": "t1_f9v25nv",
                            "score": 1,
                            "created_utc": 1575695032.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "This particular subspecies of hominidae are called dicktus erectus ,and are incapable of forming normal interspecies relationships that resemble human interaction. In other words he is a dick,abd if it is any consolation is probably runninng a scam on your friend. Promise too much and deliver too little.\n\nI know you are hurt and I am sorry for you. But the bright side is you are free from this deeply flawed DE. As a parting stab say \"(John) ,I saw that you offered my friend an arrangement deal much higher that mine. We had a good laugh about it. I assure you my next SD will be abetter man in many respects.\" \n\nDon't fall for whatever BS excuse he has,for sure he will have one. Move on. Once hurt- shame on him, twice----you know the drill.",
            "author": "GSSD",
            "id": "f9v7xib",
            "parent_id": "t3_e72ijj",
            "score": 2,
            "created_utc": 1575664699.0,
            "replies": []
        },
        {
            "body": "You still have all the power and you don't even know it.  Sex with a woman who has those feelings for you is ***way*** better than a woman just in it for a business transaction.  Before your friend meets your SD for the M&G, arrange a date with your SD and let your feelings really come out in your intimate time -- kiss him passionately, pull him in as far as you can, moan with delight... really go for it.  And *afterwards,* lay naked on his chest, kissing him all over, and say you want to go on an allowance relationship.  Both heads will be low on blood and he'll do anything to keep what he just got from you going.\n\nHe found your friend because he was still shopping on SA.  He's intrigued by the friend, agreed to the price, but just wants the lay and then will dump her.  \n\nYou need to figure out what was missing that he was out shopping for, and reclaim the power within you --  any other woman couldn't possibly beat you on this because they don't know your SD like you do.  Make him know it.",
            "author": "SugarDaddy4SugarBait",
            "id": "f9vbmhh",
            "parent_id": "t3_e72ijj",
            "score": 2,
            "created_utc": 1575666779.0,
            "replies": [
                {
                    "body": "The Coolidge Effect. Nothing was missing, it may have been a perfect relationship. He just wanted fresh tail.",
                    "author": "oh_too",
                    "id": "f9xplvy",
                    "parent_id": "t1_f9vbmhh",
                    "score": 1,
                    "created_utc": 1575715994.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Unfortunately you're negotiating skills are in need of some fine tuning,  maybe your friend can teach you.",
            "author": "justicehavey",
            "id": "f9uyj36",
            "parent_id": "t3_e72ijj",
            "score": 0,
            "created_utc": 1575659984.0,
            "replies": []
        },
        {
            "body": "I think it’s a good thing for you to learn. Don’t develop feelings for people in the bowl. It’s all temporary, how temporary is the only variable",
            "author": null,
            "id": "f9v7xmc",
            "parent_id": "t3_e72ijj",
            "score": 1,
            "created_utc": 1575664701.0,
            "replies": []
        },
        {
            "body": "Omg hunny I feel bad but sweetie look were u met him.\nNO ITS NO EXCUSE ON HIS PART.\nSo step back gorgeous! Take a deep breathe \nit IS HIS LOSS\nBLANK HIM HUNNY",
            "author": "EastCoastCompanion",
            "id": "f9w53sd",
            "parent_id": "t3_e72ijj",
            "score": 1,
            "created_utc": 1575687149.0,
            "replies": []
        },
        {
            "body": "Just tell your friend! And then tell him. Did you get your friend involved into this ? How is it you both met the same guy? If you talk to her about it tell her that he is yours ! < 3",
            "author": "mariposakb",
            "id": "f9wqwty",
            "parent_id": "t3_e72ijj",
            "score": 1,
            "created_utc": 1575697242.0,
            "replies": []
        },
        {
            "body": "Now you know how wives feel",
            "author": "Airlinefap",
            "id": "fc4d4n8",
            "parent_id": "t3_e72ijj",
            "score": 1,
            "created_utc": 1577413206.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "f9v3osz",
            "parent_id": "t3_e72ijj",
            "score": 1,
            "created_utc": 1575662577.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "f9v7jnp",
                    "parent_id": "t1_f9v3osz",
                    "score": 3,
                    "created_utc": 1575664508.0,
                    "replies": [
                        {
                            "body": "You must have played a lot of telephone as a kid.",
                            "author": "Zero2Tiger",
                            "id": "f9vu35m",
                            "parent_id": "t1_f9v7jnp",
                            "score": 4,
                            "created_utc": 1575679777.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": " i'm sorry you are suffering. it's a mistake to become attached emotionally to SR.\n\nit should be regarded as half friendship, half business deal. I know that's difficult to do",
            "author": "doctorcoolpop",
            "id": "f9v7s95",
            "parent_id": "t3_e72ijj",
            "score": 1,
            "created_utc": 1575664625.0,
            "replies": []
        },
        {
            "body": "It's a business transaction .. that's why he who holds the gold calls the shots",
            "author": "bellagiodreams",
            "id": "f9vm9pj",
            "parent_id": "t3_e72ijj",
            "score": 1,
            "created_utc": 1575673948.0,
            "replies": [
                {
                    "body": "So having money means you can treat people however you want and it's ok ? It means it's ok to hurt people ? Alrighty then 👍",
                    "author": "nellybelle1984",
                    "id": "f9vw4dy",
                    "parent_id": "t1_f9vm9pj",
                    "score": 2,
                    "created_utc": 1575681353.0,
                    "replies": [
                        {
                            "body": "No but she's using him for money.. It's very simple she's just not worth as much as her friend in the guys eyes",
                            "author": "bellagiodreams",
                            "id": "f9vyklo",
                            "parent_id": "t1_f9vw4dy",
                            "score": -1,
                            "created_utc": 1575683234.0,
                            "replies": [
                                {
                                    "body": "Again, that justifies treating people like shit and hurting them ?  So if I'm not a perfect 10 and I'm in an arrangement, it's ok for my SD to sneak around and lie because A) I'm not as pretty as the other girl B) He gives me money. That means I'm just using him and his actions are \"getting me back\" and totally ok. \n\nUnbelievable.",
                                    "author": "nellybelle1984",
                                    "id": "f9vz6ep",
                                    "parent_id": "t1_f9vyklo",
                                    "score": 3,
                                    "created_utc": 1575683693.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "The problem is u developed feelings \nI have had a SBs friend contact me, trying to poach me from her \"friend\"\n\nMany people approach this as an \"arraignment\", i see plenty of So Called SBs talking about multiple SDs... \n\nIf i can afford more than one SB  why not?\n\nI am really sorry for u, and u will have to discuss this with him, obviously he is looking for more and can afford more than one SB.\n\nIt sucks, but its about what is mutually beneficial.\n\nMy SB is totally \"kept\" and well cared for and loved.....IF I WASNT exclusive AND because i care for her SHE WOULDN'T FIND OUT.\n\nMany men have affairs and,  BECAUSE HE LOVES HER AND HIS FAMILY..the wife never finds out.\n\nHe could of done this in a way YOU NEVER KNEW WHAT WAS GOING ON..... IF HE HAD THE SAME FEELINGS....as u obviously do...\n\nHe buys your time.... thats the hard cold truth",
            "author": "SpaceGuy1968",
            "id": "f9vsudq",
            "parent_id": "t3_e72ijj",
            "score": 1,
            "created_utc": 1575678819.0,
            "replies": []
        },
        {
            "body": "This has to be a troll post.\n\n\nAlthough I had a SB w a super hot GF that I offered 2x her ppm.\nEnded up having a threesome.\nSo maybe put on your big girl pants or in this case take em off😂\n\nEdit: my SB was bi and was trying to close the deal on this smoking hot chick. Out of both of our leagues. I helped her with that. \nShe ended up being a bit of a dead fish but my SB was horny as hell that night.",
            "author": "inafishbowl17",
            "id": "f9wedp2",
            "parent_id": "t3_e72ijj",
            "score": 1,
            "created_utc": 1575691313.0,
            "replies": []
        },
        {
            "body": "Twice as much?  When he already has you?  Don't be surprised if he is just playing around with her with no intention to meet.  It's not about you.  He probably is just needy and wants more attention.'\n\n Have her set up a M&G in a very public place.  Make sure he gets there first.  And walk in with her.   The look on his face should be priceless.  Then walk out.",
            "author": null,
            "id": "f9v3taz",
            "parent_id": "t3_e72ijj",
            "score": 0,
            "created_utc": 1575662639.0,
            "replies": [
                {
                    "body": "Yes, he could be playing her judging by the fact that when we first met I was promised lots of extras I have yet to receive..",
                    "author": "sugarbaby991",
                    "id": "f9v5lvx",
                    "parent_id": "t1_f9v3taz",
                    "score": 3,
                    "created_utc": 1575663543.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "If your heartbroken he was never your sugar daddy in the first place. There are more out there you just have to search. If you had feelings for him maybe you should rethink being a SB. I'm not trying to sound mean. You can grow to have feelings for them, but there is a cutoff. If you felt heartbroken you wanted a relationship not a SD. I know that sometimes a SD can become a BF or even Husband. But 90% of the time it's just an exchange of services.",
            "author": "sodapopulation13",
            "id": "f9va6nr",
            "parent_id": "t3_e72ijj",
            "score": 0,
            "created_utc": 1575665861.0,
            "replies": [
                {
                    "body": "We met on Seeking and he provides me financial support because of that I call him my SD. Even though I assume he is more than that. Yes, feelings are involved in this arrangement but that’s what he said he wants, as well as ideally it to turn to something more serious just with him always taking care of me. We’re always in touch throughout the day, more than I ever been with my boyfriends. I’ve trusted him being honest but I guess I was played",
                    "author": "sugarbaby991",
                    "id": "f9vboy8",
                    "parent_id": "t1_f9va6nr",
                    "score": 4,
                    "created_utc": 1575666824.0,
                    "replies": []
                },
                {
                    "body": "> If your heartbroken he was never your sugar daddy in the first place\n\nWhat a ridiculous thing to say. It's hardly uncommon for SRs to involve feelings on either or both sides.",
                    "author": "Ranger3752",
                    "id": "f9vkhxv",
                    "parent_id": "t1_f9va6nr",
                    "score": 3,
                    "created_utc": 1575672693.0,
                    "replies": [
                        {
                            "body": "You took what I said out of context. Did you read about her saying he messaged her friend and offered her more money. Who else is he messaging and offering more money. You do develop some kind of feelings I'm not denying that. SD don't belong to anyone. Unless they say they are exclusively seeing you. That wasn't the deal obviously cause he was messaging other SB's. I think she may have been more upset he offered her friend more money. But these are my opinions from my own experience. Just like that was yours.",
                            "author": "sodapopulation13",
                            "id": "f9vmz1x",
                            "parent_id": "t1_f9vkhxv",
                            "score": 2,
                            "created_utc": 1575674451.0,
                            "replies": [
                                {
                                    "body": "If you read more above she also says that yes it was supposed to be exclusive that they had agreed to that.",
                                    "author": "Zero2Tiger",
                                    "id": "f9vuben",
                                    "parent_id": "t1_f9vmz1x",
                                    "score": 2,
                                    "created_utc": 1575679958.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Well girls, it’s time to face the harsh reality if you want to play the money game.  You are a depreciating asset.  You will only get older and less better looking and there will always be a younger girl to replace you.  And sometimes guys just get bored.  When we want a new car we trade the old one in for something newer, shinier, and faster.  Something to think about as you try and shake these guys down.  They didn’t get rich by throwing their money around like the average person did they?",
            "author": "tallnfun89",
            "id": "f9wkze1",
            "parent_id": "t3_e72ijj",
            "score": -2,
            "created_utc": 1575694333.0,
            "replies": []
        },
        {
            "body": "My questions is - how pretty are you and your friend looking.  \n\nI assume every SD has own assessment for each different SB, and offer the amount he thinks is right. Maybe your friend fits his taste better and generated more chemistry from your SD. This dose not mean you are inferior, just mean he may not be the best fit for you.  I will consider either accept it if you like him, or let him go and move on. Don’t get too hang upon the amount of allown someone else getting.   Good luck.",
            "author": "jclizard2001",
            "id": "f9vpalg",
            "parent_id": "t3_e72ijj",
            "score": -3,
            "created_utc": 1575676147.0,
            "replies": [
                {
                    "body": "Her looks have nothing to do with him being a sleaze bag. Even if she isn't a 10, it's not a justification to be a jack ass.",
                    "author": "nellybelle1984",
                    "id": "f9vvzzv",
                    "parent_id": "t1_f9vpalg",
                    "score": 6,
                    "created_utc": 1575681259.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "It's probably not that you are not \"good enough\" but rather in his perverted brain no great SB would accept and care for him. Therefore , you must be flawed.  \n\nDoesn't sound like there is a takeaway lesson other than that some men are insecure dogs who believe any woman who accepts them must be flawed to the point of condemnation .",
            "author": "pinotandsugar",
            "id": "f9w0o9l",
            "parent_id": "t1_f9uuuge",
            "score": 29,
            "created_utc": 1575684840.0,
            "replies": [
                {
                    "body": "damn girl, weirdly accurate.",
                    "author": "RB-L",
                    "id": "f9wfcch",
                    "parent_id": "t1_f9w0o9l",
                    "score": 4,
                    "created_utc": 1575691748.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Aw dude that's the fuckin worst. I judge people way more based on how they treat others as opposed to how they treat me, so I would be very very wary knowing someone I had any form of relationship with spoke to other women that way :(",
            "author": "spoiledbratcat",
            "id": "f9vhfsw",
            "parent_id": "t1_f9v5dl7",
            "score": 37,
            "created_utc": 1575670591.0,
            "replies": []
        },
        {
            "body": ">The main reason why I like him so much is that I thought he is the most chill and sweet person I’ve ever met. But the things he said to her were childish insults,\n\nIts sad, but look at the positive side of things, you learnt two important things from this:\n\n- He doesn't like you back as much as you think, so he's looking.\n\n- He's not the kind of person you thought he was.",
            "author": "4adomme",
            "id": "f9vksl7",
            "parent_id": "t1_f9v5dl7",
            "score": 28,
            "created_utc": 1575672899.0,
            "replies": []
        },
        {
            "body": "Clearly this guy has issues if he’s getting upset over the internet all because she stated she didn’t want intimacy. Move on then, instead of acting like a big baby who needs to throw tantrums when they don’t get what they want. 🙄\nUnfortunately you never truly know someone, sure you have an idea of them but when the true colours come out that’s when your eyes are a little more open and that idea of them shatters. Hoping you will be okay, I know feels don’t just vanish overnight but you both are better off not talking to this twat any further. Like Tupac said, girl keep ya head up ❤️",
            "author": "sugasuga24",
            "id": "f9vwpv2",
            "parent_id": "t1_f9v5dl7",
            "score": 7,
            "created_utc": 1575681813.0,
            "replies": []
        },
        {
            "body": "Don't feel sick, feel lucky ..... that you got to understand what he was before further damage was done.",
            "author": "pinotandsugar",
            "id": "f9w0rcx",
            "parent_id": "t1_f9v5dl7",
            "score": 7,
            "created_utc": 1575684909.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "f9y5iv5",
            "parent_id": "t1_f9v5dl7",
            "score": 7,
            "created_utc": 1575723728.0,
            "replies": [
                {
                    "body": "You raise excellent points, especially your last sentence.",
                    "author": "formfunctional",
                    "id": "f9ymm0f",
                    "parent_id": "t1_f9y5iv5",
                    "score": 4,
                    "created_utc": 1575730754.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Sounds like you dodged a bullet there.",
            "author": "mmedamdom",
            "id": "f9wgwbt",
            "parent_id": "t1_f9v5dl7",
            "score": 5,
            "created_utc": 1575692448.0,
            "replies": []
        },
        {
            "body": "Did he find out that you know her?",
            "author": "tenmillionplus",
            "id": "f9vige2",
            "parent_id": "t1_f9v5dl7",
            "score": 3,
            "created_utc": 1575671284.0,
            "replies": [
                {
                    "body": "Not yet, I still haven’t replied to his last message about our next meeting. I think he suspects that I know something as normally reply straight away.. still not sure what to say to him",
                    "author": "sugarbaby991",
                    "id": "f9vkg7w",
                    "parent_id": "t1_f9vige2",
                    "score": 12,
                    "created_utc": 1575672657.0,
                    "replies": [
                        {
                            "body": "I would reply to him with one of the comments he made to your friend... but I'm petty.",
                            "author": "spoiledbratcat",
                            "id": "f9wwn6d",
                            "parent_id": "t1_f9vkg7w",
                            "score": 8,
                            "created_utc": 1575700250.0,
                            "replies": []
                        },
                        {
                            "body": "I guess the question is do you have any interest in continuing or not?",
                            "author": "tenmillionplus",
                            "id": "f9vkthe",
                            "parent_id": "t1_f9vkg7w",
                            "score": 9,
                            "created_utc": 1575672916.0,
                            "replies": []
                        },
                        {
                            "body": "I hope you send him one screenshot of the conversation with your friend. Preferably a part where he is being particularly terrible to her.\nAnd nothing else.",
                            "author": "LurkingViking555",
                            "id": "f9w2bw7",
                            "parent_id": "t1_f9vkg7w",
                            "score": 10,
                            "created_utc": 1575685809.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": ">I just found out that my SD of 5 months has messaged my friend on Seeking offering her twice as much allowance as gives me. He agreed to give it to her on the first date.\n\nIt's so bad. Does he know that the girl was your friend at first?\n\n&#x200B;\n\n>he got really mad after she told him this and cursed her out\n\nShould you feel like you dodged a bullet?\n\nBoys are boys. If you have feelings for him, it maybe dangerous for you.",
            "author": "freeyaman",
            "id": "f9wvnjt",
            "parent_id": "t1_f9v5dl7",
            "score": 5,
            "created_utc": 1575699716.0,
            "replies": []
        },
        {
            "body": "Take notes from your friend, she knows what she's doing.",
            "author": "Allthatjasmine",
            "id": "f9vsqcz",
            "parent_id": "t1_f9v5dl7",
            "score": 7,
            "created_utc": 1575678732.0,
            "replies": []
        },
        {
            "body": "Oh wait so she knows ?? No cool",
            "author": "mariposakb",
            "id": "f9wr5nj",
            "parent_id": "t1_f9v5dl7",
            "score": 1,
            "created_utc": 1575697369.0,
            "replies": []
        },
        {
            "body": "Yes, you’re right, she demanded for it, in quite a rude way too (I saw the screenshot) but he agreed.\n\nI was very awkward when he asked what do I want and said for him to suggest it and accepted his offer with no negotiation. I never asked to switch to allowance either, I feel like it should be initiated by him. I feel like him still giving me ppm is unfair as i’m exclusive to him and haven’t even been talking to other men since we started an arrangement. Also, we text everyday throughout the day and I share my photos, vids with him..",
            "author": "sugarbaby991",
            "id": "f9uv97g",
            "parent_id": "t1_f9uu0bb",
            "score": 18,
            "created_utc": 1575658319.0,
            "replies": [
                {
                    "body": "Well I think the reason that he was giving her more was because she asked for more. So it’s not at all a reflection of her being worth more. I think you have to take your emotions out of things in these situations. But I am sorry that happened to you. I hope you find someone better:)",
                    "author": "strippersugarbaby23",
                    "id": "f9uzsqy",
                    "parent_id": "t1_f9uv97g",
                    "score": 31,
                    "created_utc": 1575660623.0,
                    "replies": [
                        {
                            "body": "will you be my sugar baby ?",
                            "author": "davec259901",
                            "id": "fgf6vjf",
                            "parent_id": "t1_f9uzsqy",
                            "score": 1,
                            "created_utc": 1580727674.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Oh sweetie, take this lesson and learn from it, you need to know your worth and charge accordingly. \nExclusivity costs!!",
                    "author": "Allthatjasmine",
                    "id": "f9vozck",
                    "parent_id": "t1_f9uv97g",
                    "score": 15,
                    "created_utc": 1575675918.0,
                    "replies": []
                },
                {
                    "body": "If you want something, you should ask for it. Ask him about allowance if it would make the situation better for you. \n\nIf it would not, end things and find someone else.",
                    "author": "NoBromo3213",
                    "id": "f9v06a4",
                    "parent_id": "t1_f9uv97g",
                    "score": 13,
                    "created_utc": 1575660814.0,
                    "replies": []
                },
                {
                    "body": "It's ultimately a business transaction, and expecting it to follow the hearts rules just because you would prefer it to, and not because you've said anything, doesn't seem like it's likely to work out.",
                    "author": "Sugarbeggar",
                    "id": "f9v1s5q",
                    "parent_id": "t1_f9uv97g",
                    "score": 12,
                    "created_utc": 1575661621.0,
                    "replies": []
                },
                {
                    "body": "i think after finding out what you found out - stop sending free pics and vids to him, start replying slowly to him, start pulling away so he can either chase you like the dog he is or stop talking to you so you can find a better sugar daddy. Men are weak as piss and fowl sugar daddies like this dont deserve to be treated kindly at all. I'd personally become the baddest bitch and make him wish he never fucked with my heart. \n\nIt's time to do you sis, get all the dick you can for money and flaunt in that dumb pigs face! \n\nYouve got this! Youre the one with the pussy - youre the one with he power. No guy can enter your heaven unless you allow him to and you can stop trash guys from entering when you want. \n\nDont let ANYONE treat you like this, hes a scumbag and i know how shit it feels. You can get through this boo, trust me! You are beautiful, kind, intelligent, sweet, sexy, to die for - dont EVER let any man think youre less than or treat you like youre less than! \n\n<3",
                    "author": "luckylillola",
                    "id": "f9w198f",
                    "parent_id": "t1_f9uv97g",
                    "score": 10,
                    "created_utc": 1575685265.0,
                    "replies": [
                        {
                            "body": "Translated ...... take no prisoners. \n\n\"  - dont EVER let any man think youre less than or treat you like youre less than!\"      translated   be treated as the gift that you are or say goodbye.... perhaps with a few small body parts in you pocket.",
                            "author": "pinotandsugar",
                            "id": "f9w2rmv",
                            "parent_id": "t1_f9w198f",
                            "score": 4,
                            "created_utc": 1575686023.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Allowance wise I always ask what a POT is looking for. I do admit that years ago I would use it as a negotiating point, now I use it to gage if the POT is really looking for an arrangement or just a side gig. Personally I’d rather do allowance, with an agreed minimum and maximum amount of meets. I do split the allowance in half when starting out.",
                    "author": "OffhandCut",
                    "id": "f9yrh6o",
                    "parent_id": "t1_f9uv97g",
                    "score": 1,
                    "created_utc": 1575732848.0,
                    "replies": []
                },
                {
                    "body": "I empathize with you. I don't know how to demand more for myself in relationships and I always end up feeling used. not even a sb",
                    "author": "smocks",
                    "id": "f9vgccb",
                    "parent_id": "t1_f9uv97g",
                    "score": 1,
                    "created_utc": 1575669848.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I am curious if the friend is going to move forward with this or not",
            "author": "tenmillionplus",
            "id": "f9uuv97",
            "parent_id": "t1_f9uukdz",
            "score": 16,
            "created_utc": 1575658122.0,
            "replies": []
        },
        {
            "body": "The best hits will be the new friend taking the offer and helping her to improve her profile to attract that type of offer.\n\nProfit maximization",
            "author": "Lilipuss25",
            "id": "f9vpiku",
            "parent_id": "t1_f9uukdz",
            "score": 2,
            "created_utc": 1575676308.0,
            "replies": [
                {
                    "body": "In a true best of worlds.\nBut it's not easy to be THAT cooperative when self-image and money are at stake.",
                    "author": null,
                    "id": "f9vt0or",
                    "parent_id": "t1_f9vpiku",
                    "score": 3,
                    "created_utc": 1575678956.0,
                    "replies": [
                        {
                            "body": "When it comes sugaring, work, we need to have a se;f improvement mindset and be capable of putting our ego aside.\n\nHère it’s just the ego. And even if she stay with SD and the friends don’t accept, she will resent him for lowballing her, the only way will be him matching the offer, and even if he match the offer she still could resent him.\n\nIt’s a lose lose situation",
                            "author": "Lilipuss25",
                            "id": "f9w83p6",
                            "parent_id": "t1_f9vt0or",
                            "score": 2,
                            "created_utc": 1575688559.0,
                            "replies": [
                                {
                                    "body": "We have to think of everyone.\nSomeone posts to a forum to say “My SD broke my heart.”\nSome fellow wants a sugar baby.  That means young.  Young means most likely fragile.  It comes with the territory.\nOf all the girls in the world, going to original SB's friend is a douchy move.\nSD's had it w/original SB?  Okay.\nBut approaching her friend?  Yeah, it may not be illegal.  But it's not a nice thing to do.",
                                    "author": null,
                                    "id": "f9wdowe",
                                    "parent_id": "t1_f9w83p6",
                                    "score": 2,
                                    "created_utc": 1575691004.0,
                                    "replies": [
                                        {
                                            "body": " I never said it was nice. We all agree on that.\nPlus nothing here show that the SD she was her friend. Maybe he just went for the new hot girl.\n\nI’m just responding to people who think the friends shouldn’t take the offer for the sake of OP ego. I disagree with that and I think it’s a lose lose situation.\nI also know it’s easier said than done as yˋshe is apparently in live with him",
                                            "author": "Lilipuss25",
                                            "id": "f9xd49m",
                                            "parent_id": "t1_f9wdowe",
                                            "score": 1,
                                            "created_utc": 1575709229.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "That's not true. You should praise your friend for making more money. Turning him down isnt going to give the first girl money. Cant be mad at her or him for their arrangement. Every relationship is different and shouldn't judge others arrangement. She should just find another one. \nI have one SB I give allowance to, and one I only spoil when they are physically with me.",
            "author": null,
            "id": "f9uy1rh",
            "parent_id": "t1_f9uukdz",
            "score": -4,
            "created_utc": 1575659740.0,
            "replies": [
                {
                    "body": "Lmao in what kind of world would OP praise her friend? I'm not sure what kind of friendships you have, but if a friend knew doing something would be hurtful to me and yet she did it anyway, that's a blatant disregard of my trust and my feelings. And that's not a real friend.",
                    "author": "agavebabe98",
                    "id": "f9v9efr",
                    "parent_id": "t1_f9uy1rh",
                    "score": 32,
                    "created_utc": 1575665436.0,
                    "replies": [
                        {
                            "body": "Tag team and bleed him 😆 (I joke, of course)",
                            "author": null,
                            "id": "f9vgm8g",
                            "parent_id": "t1_f9v9efr",
                            "score": 14,
                            "created_utc": 1575670031.0,
                            "replies": []
                        },
                        {
                            "body": "You just answered your own question. And if you read my comment it also answered your questions. OPs friend turning him down will not help OP out. I don't have time to argue with kids. You either know or you don't. Instead of being spiteful, look at the positives. She isnt fucking her friends husband. Its a SD SB relationship and each one is different. Grow up or get out of the lifestyle (if you are really in it which is highly doubtful)",
                            "author": null,
                            "id": "f9w7xd0",
                            "parent_id": "t1_f9v9efr",
                            "score": -1,
                            "created_utc": 1575688479.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "> You should praise your friend for making more money.\n\nNot sure if joking or tone deaf af.",
                    "author": "Ranger3752",
                    "id": "f9vk5we",
                    "parent_id": "t1_f9uy1rh",
                    "score": 8,
                    "created_utc": 1575672455.0,
                    "replies": [
                        {
                            "body": "You are probably gone definitely? Idk if you are insulting or agreeing with me. As a SD you should understand what I'm saying. Unless you are one of these fake \"online\" SD that just sit on the internet all day and never have sex or travel. 🤷🏼‍♂️",
                            "author": null,
                            "id": "f9w8l99",
                            "parent_id": "t1_f9vk5we",
                            "score": -3,
                            "created_utc": 1575688770.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "My perception is different from yours.\nI do not find yours false.",
                    "author": null,
                    "id": "f9vt61u",
                    "parent_id": "t1_f9uy1rh",
                    "score": 2,
                    "created_utc": 1575679071.0,
                    "replies": [
                        {
                            "body": "Okay. As long as you understand. This new age SB shit is getting ridiculous. Remember SB and SD. Facts and your feelings are different. This life style is just that A LIFE STYLE. If you cant handle it then dont do it!",
                            "author": null,
                            "id": "f9w8v8o",
                            "parent_id": "t1_f9vt61u",
                            "score": -1,
                            "created_utc": 1575688893.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "If the friend dont secure that bag some other girl will so I agree she needs to go for it. SA is not a Im looking to fall in love dating site so why treat it as such?",
                    "author": "CareFreeWorld",
                    "id": "f9vffai",
                    "parent_id": "t1_f9uy1rh",
                    "score": 2,
                    "created_utc": 1575669247.0,
                    "replies": [
                        {
                            "body": "Oooooh my gooood it's not all about securing the fucking bag. If y'all wanna prioritize money over real, meaningful friendships that's a lonely fucking life. I'm done here 😭",
                            "author": "agavebabe98",
                            "id": "f9vgx6g",
                            "parent_id": "t1_f9vffai",
                            "score": 13,
                            "created_utc": 1575670236.0,
                            "replies": [
                                {
                                    "body": "Hère op isnt only sad because he hit on her friend but also because and mostly because he’s willing to give her double what she is getting",
                                    "author": "Lilipuss25",
                                    "id": "f9vpvck",
                                    "parent_id": "t1_f9vgx6g",
                                    "score": 3,
                                    "created_utc": 1575676571.0,
                                    "replies": [
                                        {
                                            "body": "and she been having to serve it up too, friend was like nah bruh lmao and got double!",
                                            "author": "Alawa2000",
                                            "id": "f9w3tni",
                                            "parent_id": "t1_f9vpvck",
                                            "score": 2,
                                            "created_utc": 1575686553.0,
                                            "replies": [
                                                {
                                                    "body": "Good for the friend. Why be spiteful and jealous 🤷🏼‍♂️",
                                                    "author": null,
                                                    "id": "f9w8683",
                                                    "parent_id": "t1_f9w3tni",
                                                    "score": 1,
                                                    "created_utc": 1575688597.0,
                                                    "replies": [
                                                        {
                                                            "body": "exactly",
                                                            "author": "Alawa2000",
                                                            "id": "f9w8j16",
                                                            "parent_id": "t1_f9w8683",
                                                            "score": 2,
                                                            "created_utc": 1575688745.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "body": "Money doesn't matter because every relationship is different! Ffs",
                                            "author": null,
                                            "id": "f9w84hg",
                                            "parent_id": "t1_f9vpvck",
                                            "score": 1,
                                            "created_utc": 1575688570.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "Not that it matters, but I agree that prioritizing money here seems wrong. We are talking about people, not products-- and people have real feelings.",
                                    "author": "justaguyhereyeah",
                                    "id": "f9wdtcy",
                                    "parent_id": "t1_f9vgx6g",
                                    "score": 2,
                                    "created_utc": 1575691061.0,
                                    "replies": []
                                },
                                {
                                    "body": "There aren’t friendship involved here. \nOp doesn’t meet SD complete need or sold herself cheap.\n\nHe’s looking for a new girl he will be spending more. Either he spend that 2*allowande on her friend or he’ll give it to someone else",
                                    "author": "Lilipuss25",
                                    "id": "f9vppt3",
                                    "parent_id": "t1_f9vgx6g",
                                    "score": 3,
                                    "created_utc": 1575676458.0,
                                    "replies": [
                                        {
                                            "body": "Exactly",
                                            "author": null,
                                            "id": "f9w8aj8",
                                            "parent_id": "t1_f9vppt3",
                                            "score": 2,
                                            "created_utc": 1575688646.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "👏",
                                    "author": "lakoreanita",
                                    "id": "f9vjt0p",
                                    "parent_id": "t1_f9vgx6g",
                                    "score": 2,
                                    "created_utc": 1575672207.0,
                                    "replies": []
                                },
                                {
                                    "body": "Lmbo your dilusional AF. You want a meaninful friendship relationship join a church or match.com not a pay for play dating site. Because at the end of the day thats all it is. \nWelcome to teality kitten😯",
                                    "author": "CareFreeWorld",
                                    "id": "f9vuv7r",
                                    "parent_id": "t1_f9vgx6g",
                                    "score": 2,
                                    "created_utc": 1575680379.0,
                                    "replies": [
                                        {
                                            "body": "Wow cool. So I guess all the times my SD told me he loved me and that I changed his life and sent me money without going on any extra dates was all just meaningless. If you wanna treat sugaring like escorting than cool, love that for you 😉",
                                            "author": "agavebabe98",
                                            "id": "f9w840v",
                                            "parent_id": "t1_f9vuv7r",
                                            "score": 4,
                                            "created_utc": 1575688564.0,
                                            "replies": [
                                                {
                                                    "body": "SD-SB relationships are not just financial deals, imho. Like you say, that sort of emotionless deal sounds more like escorting.",
                                                    "author": "justaguyhereyeah",
                                                    "id": "f9welq0",
                                                    "parent_id": "t1_f9w840v",
                                                    "score": 3,
                                                    "created_utc": 1575691411.0,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "body": "For real. I agree",
                                            "author": null,
                                            "id": "f9w88dv",
                                            "parent_id": "t1_f9vuv7r",
                                            "score": 0,
                                            "created_utc": 1575688621.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "I agree. That other redditor crying is obviously not cut out for this life style and is delusional",
                            "author": null,
                            "id": "f9w820d",
                            "parent_id": "t1_f9vffai",
                            "score": -1,
                            "created_utc": 1575688537.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "In my case dating a sugar daddy just ends up in poor unequal power dynamics. The sugar daddy i dated stopped paying me and just used me to feel better about himself - cheated on me, manipulated me, isolated me, lied to me.. Keep all money dealings STRICTLY PROFESSIONAL is what I've learned so far lol",
            "author": "luckylillola",
            "id": "f9w6ov7",
            "parent_id": "t1_f9vf90j",
            "score": 1,
            "created_utc": 1575687889.0,
            "replies": []
        },
        {
            "body": "Well said.",
            "author": "zztop1999",
            "id": "f9uwx3m",
            "parent_id": "t1_f9uwbuo",
            "score": 3,
            "created_utc": 1575659167.0,
            "replies": []
        },
        {
            "body": "Fantastic response!",
            "author": "ewwitsjessagain",
            "id": "f9yn2vc",
            "parent_id": "t1_f9v7uhi",
            "score": 1,
            "created_utc": 1575730947.0,
            "replies": []
        },
        {
            "body": "Yes, it was supposed to be an exclusive arrangement. However, after this situation, tomorrow i’m booking the appointment to get a full STI screening test 😒",
            "author": "sugarbaby991",
            "id": "f9vadcc",
            "parent_id": "t1_f9v4f5u",
            "score": 13,
            "created_utc": 1575665977.0,
            "replies": [
                {
                    "body": "Probably not a bad idea.  Sorry you had to experience this, but look for the lessons involved.  That's the best you can do at this point.",
                    "author": "Aigean333",
                    "id": "f9vcud8",
                    "parent_id": "t1_f9vadcc",
                    "score": 7,
                    "created_utc": 1575667565.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Haha we were just joking about this but she is not willing to have intimacy with him. This probably wouldn’t work just during a public meeting",
            "author": "sugarbaby991",
            "id": "f9v7g6l",
            "parent_id": "t1_f9v6drt",
            "score": 3,
            "created_utc": 1575664462.0,
            "replies": []
        },
        {
            "body": ">  I think it’s pretty screwed up that she’s not only snagging your favorite boy toy, but your game too? \n\nIf he's looking that hard chances are it would be some other SB if not her friend.",
            "author": "Sugarbeggar",
            "id": "f9v25nv",
            "parent_id": "t1_f9v0j98",
            "score": 2,
            "created_utc": 1575661812.0,
            "replies": [
                {
                    "body": "But wouldn’t it be easier and less painful if it were some random girl and not her friend?",
                    "author": "lexamroseee",
                    "id": "f9wmfkj",
                    "parent_id": "t1_f9v25nv",
                    "score": 1,
                    "created_utc": 1575695032.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "The Coolidge Effect. Nothing was missing, it may have been a perfect relationship. He just wanted fresh tail.",
            "author": "oh_too",
            "id": "f9xplvy",
            "parent_id": "t1_f9vbmhh",
            "score": 1,
            "created_utc": 1575715994.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "f9v7jnp",
            "parent_id": "t1_f9v3osz",
            "score": 3,
            "created_utc": 1575664508.0,
            "replies": [
                {
                    "body": "You must have played a lot of telephone as a kid.",
                    "author": "Zero2Tiger",
                    "id": "f9vu35m",
                    "parent_id": "t1_f9v7jnp",
                    "score": 4,
                    "created_utc": 1575679777.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "So having money means you can treat people however you want and it's ok ? It means it's ok to hurt people ? Alrighty then 👍",
            "author": "nellybelle1984",
            "id": "f9vw4dy",
            "parent_id": "t1_f9vm9pj",
            "score": 2,
            "created_utc": 1575681353.0,
            "replies": [
                {
                    "body": "No but she's using him for money.. It's very simple she's just not worth as much as her friend in the guys eyes",
                    "author": "bellagiodreams",
                    "id": "f9vyklo",
                    "parent_id": "t1_f9vw4dy",
                    "score": -1,
                    "created_utc": 1575683234.0,
                    "replies": [
                        {
                            "body": "Again, that justifies treating people like shit and hurting them ?  So if I'm not a perfect 10 and I'm in an arrangement, it's ok for my SD to sneak around and lie because A) I'm not as pretty as the other girl B) He gives me money. That means I'm just using him and his actions are \"getting me back\" and totally ok. \n\nUnbelievable.",
                            "author": "nellybelle1984",
                            "id": "f9vz6ep",
                            "parent_id": "t1_f9vyklo",
                            "score": 3,
                            "created_utc": 1575683693.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Yes, he could be playing her judging by the fact that when we first met I was promised lots of extras I have yet to receive..",
            "author": "sugarbaby991",
            "id": "f9v5lvx",
            "parent_id": "t1_f9v3taz",
            "score": 3,
            "created_utc": 1575663543.0,
            "replies": []
        },
        {
            "body": "We met on Seeking and he provides me financial support because of that I call him my SD. Even though I assume he is more than that. Yes, feelings are involved in this arrangement but that’s what he said he wants, as well as ideally it to turn to something more serious just with him always taking care of me. We’re always in touch throughout the day, more than I ever been with my boyfriends. I’ve trusted him being honest but I guess I was played",
            "author": "sugarbaby991",
            "id": "f9vboy8",
            "parent_id": "t1_f9va6nr",
            "score": 4,
            "created_utc": 1575666824.0,
            "replies": []
        },
        {
            "body": "> If your heartbroken he was never your sugar daddy in the first place\n\nWhat a ridiculous thing to say. It's hardly uncommon for SRs to involve feelings on either or both sides.",
            "author": "Ranger3752",
            "id": "f9vkhxv",
            "parent_id": "t1_f9va6nr",
            "score": 3,
            "created_utc": 1575672693.0,
            "replies": [
                {
                    "body": "You took what I said out of context. Did you read about her saying he messaged her friend and offered her more money. Who else is he messaging and offering more money. You do develop some kind of feelings I'm not denying that. SD don't belong to anyone. Unless they say they are exclusively seeing you. That wasn't the deal obviously cause he was messaging other SB's. I think she may have been more upset he offered her friend more money. But these are my opinions from my own experience. Just like that was yours.",
                    "author": "sodapopulation13",
                    "id": "f9vmz1x",
                    "parent_id": "t1_f9vkhxv",
                    "score": 2,
                    "created_utc": 1575674451.0,
                    "replies": [
                        {
                            "body": "If you read more above she also says that yes it was supposed to be exclusive that they had agreed to that.",
                            "author": "Zero2Tiger",
                            "id": "f9vuben",
                            "parent_id": "t1_f9vmz1x",
                            "score": 2,
                            "created_utc": 1575679958.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Her looks have nothing to do with him being a sleaze bag. Even if she isn't a 10, it's not a justification to be a jack ass.",
            "author": "nellybelle1984",
            "id": "f9vvzzv",
            "parent_id": "t1_f9vpalg",
            "score": 6,
            "created_utc": 1575681259.0,
            "replies": []
        },
        {
            "body": "damn girl, weirdly accurate.",
            "author": "RB-L",
            "id": "f9wfcch",
            "parent_id": "t1_f9w0o9l",
            "score": 4,
            "created_utc": 1575691748.0,
            "replies": []
        },
        {
            "body": "You raise excellent points, especially your last sentence.",
            "author": "formfunctional",
            "id": "f9ymm0f",
            "parent_id": "t1_f9y5iv5",
            "score": 4,
            "created_utc": 1575730754.0,
            "replies": []
        },
        {
            "body": "Not yet, I still haven’t replied to his last message about our next meeting. I think he suspects that I know something as normally reply straight away.. still not sure what to say to him",
            "author": "sugarbaby991",
            "id": "f9vkg7w",
            "parent_id": "t1_f9vige2",
            "score": 12,
            "created_utc": 1575672657.0,
            "replies": [
                {
                    "body": "I would reply to him with one of the comments he made to your friend... but I'm petty.",
                    "author": "spoiledbratcat",
                    "id": "f9wwn6d",
                    "parent_id": "t1_f9vkg7w",
                    "score": 8,
                    "created_utc": 1575700250.0,
                    "replies": []
                },
                {
                    "body": "I guess the question is do you have any interest in continuing or not?",
                    "author": "tenmillionplus",
                    "id": "f9vkthe",
                    "parent_id": "t1_f9vkg7w",
                    "score": 9,
                    "created_utc": 1575672916.0,
                    "replies": []
                },
                {
                    "body": "I hope you send him one screenshot of the conversation with your friend. Preferably a part where he is being particularly terrible to her.\nAnd nothing else.",
                    "author": "LurkingViking555",
                    "id": "f9w2bw7",
                    "parent_id": "t1_f9vkg7w",
                    "score": 10,
                    "created_utc": 1575685809.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Well I think the reason that he was giving her more was because she asked for more. So it’s not at all a reflection of her being worth more. I think you have to take your emotions out of things in these situations. But I am sorry that happened to you. I hope you find someone better:)",
            "author": "strippersugarbaby23",
            "id": "f9uzsqy",
            "parent_id": "t1_f9uv97g",
            "score": 31,
            "created_utc": 1575660623.0,
            "replies": [
                {
                    "body": "will you be my sugar baby ?",
                    "author": "davec259901",
                    "id": "fgf6vjf",
                    "parent_id": "t1_f9uzsqy",
                    "score": 1,
                    "created_utc": 1580727674.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Oh sweetie, take this lesson and learn from it, you need to know your worth and charge accordingly. \nExclusivity costs!!",
            "author": "Allthatjasmine",
            "id": "f9vozck",
            "parent_id": "t1_f9uv97g",
            "score": 15,
            "created_utc": 1575675918.0,
            "replies": []
        },
        {
            "body": "If you want something, you should ask for it. Ask him about allowance if it would make the situation better for you. \n\nIf it would not, end things and find someone else.",
            "author": "NoBromo3213",
            "id": "f9v06a4",
            "parent_id": "t1_f9uv97g",
            "score": 13,
            "created_utc": 1575660814.0,
            "replies": []
        },
        {
            "body": "It's ultimately a business transaction, and expecting it to follow the hearts rules just because you would prefer it to, and not because you've said anything, doesn't seem like it's likely to work out.",
            "author": "Sugarbeggar",
            "id": "f9v1s5q",
            "parent_id": "t1_f9uv97g",
            "score": 12,
            "created_utc": 1575661621.0,
            "replies": []
        },
        {
            "body": "i think after finding out what you found out - stop sending free pics and vids to him, start replying slowly to him, start pulling away so he can either chase you like the dog he is or stop talking to you so you can find a better sugar daddy. Men are weak as piss and fowl sugar daddies like this dont deserve to be treated kindly at all. I'd personally become the baddest bitch and make him wish he never fucked with my heart. \n\nIt's time to do you sis, get all the dick you can for money and flaunt in that dumb pigs face! \n\nYouve got this! Youre the one with the pussy - youre the one with he power. No guy can enter your heaven unless you allow him to and you can stop trash guys from entering when you want. \n\nDont let ANYONE treat you like this, hes a scumbag and i know how shit it feels. You can get through this boo, trust me! You are beautiful, kind, intelligent, sweet, sexy, to die for - dont EVER let any man think youre less than or treat you like youre less than! \n\n<3",
            "author": "luckylillola",
            "id": "f9w198f",
            "parent_id": "t1_f9uv97g",
            "score": 10,
            "created_utc": 1575685265.0,
            "replies": [
                {
                    "body": "Translated ...... take no prisoners. \n\n\"  - dont EVER let any man think youre less than or treat you like youre less than!\"      translated   be treated as the gift that you are or say goodbye.... perhaps with a few small body parts in you pocket.",
                    "author": "pinotandsugar",
                    "id": "f9w2rmv",
                    "parent_id": "t1_f9w198f",
                    "score": 4,
                    "created_utc": 1575686023.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Allowance wise I always ask what a POT is looking for. I do admit that years ago I would use it as a negotiating point, now I use it to gage if the POT is really looking for an arrangement or just a side gig. Personally I’d rather do allowance, with an agreed minimum and maximum amount of meets. I do split the allowance in half when starting out.",
            "author": "OffhandCut",
            "id": "f9yrh6o",
            "parent_id": "t1_f9uv97g",
            "score": 1,
            "created_utc": 1575732848.0,
            "replies": []
        },
        {
            "body": "I empathize with you. I don't know how to demand more for myself in relationships and I always end up feeling used. not even a sb",
            "author": "smocks",
            "id": "f9vgccb",
            "parent_id": "t1_f9uv97g",
            "score": 1,
            "created_utc": 1575669848.0,
            "replies": []
        },
        {
            "body": "In a true best of worlds.\nBut it's not easy to be THAT cooperative when self-image and money are at stake.",
            "author": null,
            "id": "f9vt0or",
            "parent_id": "t1_f9vpiku",
            "score": 3,
            "created_utc": 1575678956.0,
            "replies": [
                {
                    "body": "When it comes sugaring, work, we need to have a se;f improvement mindset and be capable of putting our ego aside.\n\nHère it’s just the ego. And even if she stay with SD and the friends don’t accept, she will resent him for lowballing her, the only way will be him matching the offer, and even if he match the offer she still could resent him.\n\nIt’s a lose lose situation",
                    "author": "Lilipuss25",
                    "id": "f9w83p6",
                    "parent_id": "t1_f9vt0or",
                    "score": 2,
                    "created_utc": 1575688559.0,
                    "replies": [
                        {
                            "body": "We have to think of everyone.\nSomeone posts to a forum to say “My SD broke my heart.”\nSome fellow wants a sugar baby.  That means young.  Young means most likely fragile.  It comes with the territory.\nOf all the girls in the world, going to original SB's friend is a douchy move.\nSD's had it w/original SB?  Okay.\nBut approaching her friend?  Yeah, it may not be illegal.  But it's not a nice thing to do.",
                            "author": null,
                            "id": "f9wdowe",
                            "parent_id": "t1_f9w83p6",
                            "score": 2,
                            "created_utc": 1575691004.0,
                            "replies": [
                                {
                                    "body": " I never said it was nice. We all agree on that.\nPlus nothing here show that the SD she was her friend. Maybe he just went for the new hot girl.\n\nI’m just responding to people who think the friends shouldn’t take the offer for the sake of OP ego. I disagree with that and I think it’s a lose lose situation.\nI also know it’s easier said than done as yˋshe is apparently in live with him",
                                    "author": "Lilipuss25",
                                    "id": "f9xd49m",
                                    "parent_id": "t1_f9wdowe",
                                    "score": 1,
                                    "created_utc": 1575709229.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Lmao in what kind of world would OP praise her friend? I'm not sure what kind of friendships you have, but if a friend knew doing something would be hurtful to me and yet she did it anyway, that's a blatant disregard of my trust and my feelings. And that's not a real friend.",
            "author": "agavebabe98",
            "id": "f9v9efr",
            "parent_id": "t1_f9uy1rh",
            "score": 32,
            "created_utc": 1575665436.0,
            "replies": [
                {
                    "body": "Tag team and bleed him 😆 (I joke, of course)",
                    "author": null,
                    "id": "f9vgm8g",
                    "parent_id": "t1_f9v9efr",
                    "score": 14,
                    "created_utc": 1575670031.0,
                    "replies": []
                },
                {
                    "body": "You just answered your own question. And if you read my comment it also answered your questions. OPs friend turning him down will not help OP out. I don't have time to argue with kids. You either know or you don't. Instead of being spiteful, look at the positives. She isnt fucking her friends husband. Its a SD SB relationship and each one is different. Grow up or get out of the lifestyle (if you are really in it which is highly doubtful)",
                    "author": null,
                    "id": "f9w7xd0",
                    "parent_id": "t1_f9v9efr",
                    "score": -1,
                    "created_utc": 1575688479.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "> You should praise your friend for making more money.\n\nNot sure if joking or tone deaf af.",
            "author": "Ranger3752",
            "id": "f9vk5we",
            "parent_id": "t1_f9uy1rh",
            "score": 8,
            "created_utc": 1575672455.0,
            "replies": [
                {
                    "body": "You are probably gone definitely? Idk if you are insulting or agreeing with me. As a SD you should understand what I'm saying. Unless you are one of these fake \"online\" SD that just sit on the internet all day and never have sex or travel. 🤷🏼‍♂️",
                    "author": null,
                    "id": "f9w8l99",
                    "parent_id": "t1_f9vk5we",
                    "score": -3,
                    "created_utc": 1575688770.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "My perception is different from yours.\nI do not find yours false.",
            "author": null,
            "id": "f9vt61u",
            "parent_id": "t1_f9uy1rh",
            "score": 2,
            "created_utc": 1575679071.0,
            "replies": [
                {
                    "body": "Okay. As long as you understand. This new age SB shit is getting ridiculous. Remember SB and SD. Facts and your feelings are different. This life style is just that A LIFE STYLE. If you cant handle it then dont do it!",
                    "author": null,
                    "id": "f9w8v8o",
                    "parent_id": "t1_f9vt61u",
                    "score": -1,
                    "created_utc": 1575688893.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "If the friend dont secure that bag some other girl will so I agree she needs to go for it. SA is not a Im looking to fall in love dating site so why treat it as such?",
            "author": "CareFreeWorld",
            "id": "f9vffai",
            "parent_id": "t1_f9uy1rh",
            "score": 2,
            "created_utc": 1575669247.0,
            "replies": [
                {
                    "body": "Oooooh my gooood it's not all about securing the fucking bag. If y'all wanna prioritize money over real, meaningful friendships that's a lonely fucking life. I'm done here 😭",
                    "author": "agavebabe98",
                    "id": "f9vgx6g",
                    "parent_id": "t1_f9vffai",
                    "score": 13,
                    "created_utc": 1575670236.0,
                    "replies": [
                        {
                            "body": "Hère op isnt only sad because he hit on her friend but also because and mostly because he’s willing to give her double what she is getting",
                            "author": "Lilipuss25",
                            "id": "f9vpvck",
                            "parent_id": "t1_f9vgx6g",
                            "score": 3,
                            "created_utc": 1575676571.0,
                            "replies": [
                                {
                                    "body": "and she been having to serve it up too, friend was like nah bruh lmao and got double!",
                                    "author": "Alawa2000",
                                    "id": "f9w3tni",
                                    "parent_id": "t1_f9vpvck",
                                    "score": 2,
                                    "created_utc": 1575686553.0,
                                    "replies": [
                                        {
                                            "body": "Good for the friend. Why be spiteful and jealous 🤷🏼‍♂️",
                                            "author": null,
                                            "id": "f9w8683",
                                            "parent_id": "t1_f9w3tni",
                                            "score": 1,
                                            "created_utc": 1575688597.0,
                                            "replies": [
                                                {
                                                    "body": "exactly",
                                                    "author": "Alawa2000",
                                                    "id": "f9w8j16",
                                                    "parent_id": "t1_f9w8683",
                                                    "score": 2,
                                                    "created_utc": 1575688745.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "Money doesn't matter because every relationship is different! Ffs",
                                    "author": null,
                                    "id": "f9w84hg",
                                    "parent_id": "t1_f9vpvck",
                                    "score": 1,
                                    "created_utc": 1575688570.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "Not that it matters, but I agree that prioritizing money here seems wrong. We are talking about people, not products-- and people have real feelings.",
                            "author": "justaguyhereyeah",
                            "id": "f9wdtcy",
                            "parent_id": "t1_f9vgx6g",
                            "score": 2,
                            "created_utc": 1575691061.0,
                            "replies": []
                        },
                        {
                            "body": "There aren’t friendship involved here. \nOp doesn’t meet SD complete need or sold herself cheap.\n\nHe’s looking for a new girl he will be spending more. Either he spend that 2*allowande on her friend or he’ll give it to someone else",
                            "author": "Lilipuss25",
                            "id": "f9vppt3",
                            "parent_id": "t1_f9vgx6g",
                            "score": 3,
                            "created_utc": 1575676458.0,
                            "replies": [
                                {
                                    "body": "Exactly",
                                    "author": null,
                                    "id": "f9w8aj8",
                                    "parent_id": "t1_f9vppt3",
                                    "score": 2,
                                    "created_utc": 1575688646.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "👏",
                            "author": "lakoreanita",
                            "id": "f9vjt0p",
                            "parent_id": "t1_f9vgx6g",
                            "score": 2,
                            "created_utc": 1575672207.0,
                            "replies": []
                        },
                        {
                            "body": "Lmbo your dilusional AF. You want a meaninful friendship relationship join a church or match.com not a pay for play dating site. Because at the end of the day thats all it is. \nWelcome to teality kitten😯",
                            "author": "CareFreeWorld",
                            "id": "f9vuv7r",
                            "parent_id": "t1_f9vgx6g",
                            "score": 2,
                            "created_utc": 1575680379.0,
                            "replies": [
                                {
                                    "body": "Wow cool. So I guess all the times my SD told me he loved me and that I changed his life and sent me money without going on any extra dates was all just meaningless. If you wanna treat sugaring like escorting than cool, love that for you 😉",
                                    "author": "agavebabe98",
                                    "id": "f9w840v",
                                    "parent_id": "t1_f9vuv7r",
                                    "score": 4,
                                    "created_utc": 1575688564.0,
                                    "replies": [
                                        {
                                            "body": "SD-SB relationships are not just financial deals, imho. Like you say, that sort of emotionless deal sounds more like escorting.",
                                            "author": "justaguyhereyeah",
                                            "id": "f9welq0",
                                            "parent_id": "t1_f9w840v",
                                            "score": 3,
                                            "created_utc": 1575691411.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "For real. I agree",
                                    "author": null,
                                    "id": "f9w88dv",
                                    "parent_id": "t1_f9vuv7r",
                                    "score": 0,
                                    "created_utc": 1575688621.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "I agree. That other redditor crying is obviously not cut out for this life style and is delusional",
                    "author": null,
                    "id": "f9w820d",
                    "parent_id": "t1_f9vffai",
                    "score": -1,
                    "created_utc": 1575688537.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Probably not a bad idea.  Sorry you had to experience this, but look for the lessons involved.  That's the best you can do at this point.",
            "author": "Aigean333",
            "id": "f9vcud8",
            "parent_id": "t1_f9vadcc",
            "score": 7,
            "created_utc": 1575667565.0,
            "replies": []
        },
        {
            "body": "But wouldn’t it be easier and less painful if it were some random girl and not her friend?",
            "author": "lexamroseee",
            "id": "f9wmfkj",
            "parent_id": "t1_f9v25nv",
            "score": 1,
            "created_utc": 1575695032.0,
            "replies": []
        },
        {
            "body": "You must have played a lot of telephone as a kid.",
            "author": "Zero2Tiger",
            "id": "f9vu35m",
            "parent_id": "t1_f9v7jnp",
            "score": 4,
            "created_utc": 1575679777.0,
            "replies": []
        },
        {
            "body": "No but she's using him for money.. It's very simple she's just not worth as much as her friend in the guys eyes",
            "author": "bellagiodreams",
            "id": "f9vyklo",
            "parent_id": "t1_f9vw4dy",
            "score": -1,
            "created_utc": 1575683234.0,
            "replies": [
                {
                    "body": "Again, that justifies treating people like shit and hurting them ?  So if I'm not a perfect 10 and I'm in an arrangement, it's ok for my SD to sneak around and lie because A) I'm not as pretty as the other girl B) He gives me money. That means I'm just using him and his actions are \"getting me back\" and totally ok. \n\nUnbelievable.",
                    "author": "nellybelle1984",
                    "id": "f9vz6ep",
                    "parent_id": "t1_f9vyklo",
                    "score": 3,
                    "created_utc": 1575683693.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "You took what I said out of context. Did you read about her saying he messaged her friend and offered her more money. Who else is he messaging and offering more money. You do develop some kind of feelings I'm not denying that. SD don't belong to anyone. Unless they say they are exclusively seeing you. That wasn't the deal obviously cause he was messaging other SB's. I think she may have been more upset he offered her friend more money. But these are my opinions from my own experience. Just like that was yours.",
            "author": "sodapopulation13",
            "id": "f9vmz1x",
            "parent_id": "t1_f9vkhxv",
            "score": 2,
            "created_utc": 1575674451.0,
            "replies": [
                {
                    "body": "If you read more above she also says that yes it was supposed to be exclusive that they had agreed to that.",
                    "author": "Zero2Tiger",
                    "id": "f9vuben",
                    "parent_id": "t1_f9vmz1x",
                    "score": 2,
                    "created_utc": 1575679958.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I would reply to him with one of the comments he made to your friend... but I'm petty.",
            "author": "spoiledbratcat",
            "id": "f9wwn6d",
            "parent_id": "t1_f9vkg7w",
            "score": 8,
            "created_utc": 1575700250.0,
            "replies": []
        },
        {
            "body": "I guess the question is do you have any interest in continuing or not?",
            "author": "tenmillionplus",
            "id": "f9vkthe",
            "parent_id": "t1_f9vkg7w",
            "score": 9,
            "created_utc": 1575672916.0,
            "replies": []
        },
        {
            "body": "I hope you send him one screenshot of the conversation with your friend. Preferably a part where he is being particularly terrible to her.\nAnd nothing else.",
            "author": "LurkingViking555",
            "id": "f9w2bw7",
            "parent_id": "t1_f9vkg7w",
            "score": 10,
            "created_utc": 1575685809.0,
            "replies": []
        },
        {
            "body": "will you be my sugar baby ?",
            "author": "davec259901",
            "id": "fgf6vjf",
            "parent_id": "t1_f9uzsqy",
            "score": 1,
            "created_utc": 1580727674.0,
            "replies": []
        },
        {
            "body": "Translated ...... take no prisoners. \n\n\"  - dont EVER let any man think youre less than or treat you like youre less than!\"      translated   be treated as the gift that you are or say goodbye.... perhaps with a few small body parts in you pocket.",
            "author": "pinotandsugar",
            "id": "f9w2rmv",
            "parent_id": "t1_f9w198f",
            "score": 4,
            "created_utc": 1575686023.0,
            "replies": []
        },
        {
            "body": "When it comes sugaring, work, we need to have a se;f improvement mindset and be capable of putting our ego aside.\n\nHère it’s just the ego. And even if she stay with SD and the friends don’t accept, she will resent him for lowballing her, the only way will be him matching the offer, and even if he match the offer she still could resent him.\n\nIt’s a lose lose situation",
            "author": "Lilipuss25",
            "id": "f9w83p6",
            "parent_id": "t1_f9vt0or",
            "score": 2,
            "created_utc": 1575688559.0,
            "replies": [
                {
                    "body": "We have to think of everyone.\nSomeone posts to a forum to say “My SD broke my heart.”\nSome fellow wants a sugar baby.  That means young.  Young means most likely fragile.  It comes with the territory.\nOf all the girls in the world, going to original SB's friend is a douchy move.\nSD's had it w/original SB?  Okay.\nBut approaching her friend?  Yeah, it may not be illegal.  But it's not a nice thing to do.",
                    "author": null,
                    "id": "f9wdowe",
                    "parent_id": "t1_f9w83p6",
                    "score": 2,
                    "created_utc": 1575691004.0,
                    "replies": [
                        {
                            "body": " I never said it was nice. We all agree on that.\nPlus nothing here show that the SD she was her friend. Maybe he just went for the new hot girl.\n\nI’m just responding to people who think the friends shouldn’t take the offer for the sake of OP ego. I disagree with that and I think it’s a lose lose situation.\nI also know it’s easier said than done as yˋshe is apparently in live with him",
                            "author": "Lilipuss25",
                            "id": "f9xd49m",
                            "parent_id": "t1_f9wdowe",
                            "score": 1,
                            "created_utc": 1575709229.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Tag team and bleed him 😆 (I joke, of course)",
            "author": null,
            "id": "f9vgm8g",
            "parent_id": "t1_f9v9efr",
            "score": 14,
            "created_utc": 1575670031.0,
            "replies": []
        },
        {
            "body": "You just answered your own question. And if you read my comment it also answered your questions. OPs friend turning him down will not help OP out. I don't have time to argue with kids. You either know or you don't. Instead of being spiteful, look at the positives. She isnt fucking her friends husband. Its a SD SB relationship and each one is different. Grow up or get out of the lifestyle (if you are really in it which is highly doubtful)",
            "author": null,
            "id": "f9w7xd0",
            "parent_id": "t1_f9v9efr",
            "score": -1,
            "created_utc": 1575688479.0,
            "replies": []
        },
        {
            "body": "You are probably gone definitely? Idk if you are insulting or agreeing with me. As a SD you should understand what I'm saying. Unless you are one of these fake \"online\" SD that just sit on the internet all day and never have sex or travel. 🤷🏼‍♂️",
            "author": null,
            "id": "f9w8l99",
            "parent_id": "t1_f9vk5we",
            "score": -3,
            "created_utc": 1575688770.0,
            "replies": []
        },
        {
            "body": "Okay. As long as you understand. This new age SB shit is getting ridiculous. Remember SB and SD. Facts and your feelings are different. This life style is just that A LIFE STYLE. If you cant handle it then dont do it!",
            "author": null,
            "id": "f9w8v8o",
            "parent_id": "t1_f9vt61u",
            "score": -1,
            "created_utc": 1575688893.0,
            "replies": []
        },
        {
            "body": "Oooooh my gooood it's not all about securing the fucking bag. If y'all wanna prioritize money over real, meaningful friendships that's a lonely fucking life. I'm done here 😭",
            "author": "agavebabe98",
            "id": "f9vgx6g",
            "parent_id": "t1_f9vffai",
            "score": 13,
            "created_utc": 1575670236.0,
            "replies": [
                {
                    "body": "Hère op isnt only sad because he hit on her friend but also because and mostly because he’s willing to give her double what she is getting",
                    "author": "Lilipuss25",
                    "id": "f9vpvck",
                    "parent_id": "t1_f9vgx6g",
                    "score": 3,
                    "created_utc": 1575676571.0,
                    "replies": [
                        {
                            "body": "and she been having to serve it up too, friend was like nah bruh lmao and got double!",
                            "author": "Alawa2000",
                            "id": "f9w3tni",
                            "parent_id": "t1_f9vpvck",
                            "score": 2,
                            "created_utc": 1575686553.0,
                            "replies": [
                                {
                                    "body": "Good for the friend. Why be spiteful and jealous 🤷🏼‍♂️",
                                    "author": null,
                                    "id": "f9w8683",
                                    "parent_id": "t1_f9w3tni",
                                    "score": 1,
                                    "created_utc": 1575688597.0,
                                    "replies": [
                                        {
                                            "body": "exactly",
                                            "author": "Alawa2000",
                                            "id": "f9w8j16",
                                            "parent_id": "t1_f9w8683",
                                            "score": 2,
                                            "created_utc": 1575688745.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "Money doesn't matter because every relationship is different! Ffs",
                            "author": null,
                            "id": "f9w84hg",
                            "parent_id": "t1_f9vpvck",
                            "score": 1,
                            "created_utc": 1575688570.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Not that it matters, but I agree that prioritizing money here seems wrong. We are talking about people, not products-- and people have real feelings.",
                    "author": "justaguyhereyeah",
                    "id": "f9wdtcy",
                    "parent_id": "t1_f9vgx6g",
                    "score": 2,
                    "created_utc": 1575691061.0,
                    "replies": []
                },
                {
                    "body": "There aren’t friendship involved here. \nOp doesn’t meet SD complete need or sold herself cheap.\n\nHe’s looking for a new girl he will be spending more. Either he spend that 2*allowande on her friend or he’ll give it to someone else",
                    "author": "Lilipuss25",
                    "id": "f9vppt3",
                    "parent_id": "t1_f9vgx6g",
                    "score": 3,
                    "created_utc": 1575676458.0,
                    "replies": [
                        {
                            "body": "Exactly",
                            "author": null,
                            "id": "f9w8aj8",
                            "parent_id": "t1_f9vppt3",
                            "score": 2,
                            "created_utc": 1575688646.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "👏",
                    "author": "lakoreanita",
                    "id": "f9vjt0p",
                    "parent_id": "t1_f9vgx6g",
                    "score": 2,
                    "created_utc": 1575672207.0,
                    "replies": []
                },
                {
                    "body": "Lmbo your dilusional AF. You want a meaninful friendship relationship join a church or match.com not a pay for play dating site. Because at the end of the day thats all it is. \nWelcome to teality kitten😯",
                    "author": "CareFreeWorld",
                    "id": "f9vuv7r",
                    "parent_id": "t1_f9vgx6g",
                    "score": 2,
                    "created_utc": 1575680379.0,
                    "replies": [
                        {
                            "body": "Wow cool. So I guess all the times my SD told me he loved me and that I changed his life and sent me money without going on any extra dates was all just meaningless. If you wanna treat sugaring like escorting than cool, love that for you 😉",
                            "author": "agavebabe98",
                            "id": "f9w840v",
                            "parent_id": "t1_f9vuv7r",
                            "score": 4,
                            "created_utc": 1575688564.0,
                            "replies": [
                                {
                                    "body": "SD-SB relationships are not just financial deals, imho. Like you say, that sort of emotionless deal sounds more like escorting.",
                                    "author": "justaguyhereyeah",
                                    "id": "f9welq0",
                                    "parent_id": "t1_f9w840v",
                                    "score": 3,
                                    "created_utc": 1575691411.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "For real. I agree",
                            "author": null,
                            "id": "f9w88dv",
                            "parent_id": "t1_f9vuv7r",
                            "score": 0,
                            "created_utc": 1575688621.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I agree. That other redditor crying is obviously not cut out for this life style and is delusional",
            "author": null,
            "id": "f9w820d",
            "parent_id": "t1_f9vffai",
            "score": -1,
            "created_utc": 1575688537.0,
            "replies": []
        },
        {
            "body": "Again, that justifies treating people like shit and hurting them ?  So if I'm not a perfect 10 and I'm in an arrangement, it's ok for my SD to sneak around and lie because A) I'm not as pretty as the other girl B) He gives me money. That means I'm just using him and his actions are \"getting me back\" and totally ok. \n\nUnbelievable.",
            "author": "nellybelle1984",
            "id": "f9vz6ep",
            "parent_id": "t1_f9vyklo",
            "score": 3,
            "created_utc": 1575683693.0,
            "replies": []
        },
        {
            "body": "If you read more above she also says that yes it was supposed to be exclusive that they had agreed to that.",
            "author": "Zero2Tiger",
            "id": "f9vuben",
            "parent_id": "t1_f9vmz1x",
            "score": 2,
            "created_utc": 1575679958.0,
            "replies": []
        },
        {
            "body": "We have to think of everyone.\nSomeone posts to a forum to say “My SD broke my heart.”\nSome fellow wants a sugar baby.  That means young.  Young means most likely fragile.  It comes with the territory.\nOf all the girls in the world, going to original SB's friend is a douchy move.\nSD's had it w/original SB?  Okay.\nBut approaching her friend?  Yeah, it may not be illegal.  But it's not a nice thing to do.",
            "author": null,
            "id": "f9wdowe",
            "parent_id": "t1_f9w83p6",
            "score": 2,
            "created_utc": 1575691004.0,
            "replies": [
                {
                    "body": " I never said it was nice. We all agree on that.\nPlus nothing here show that the SD she was her friend. Maybe he just went for the new hot girl.\n\nI’m just responding to people who think the friends shouldn’t take the offer for the sake of OP ego. I disagree with that and I think it’s a lose lose situation.\nI also know it’s easier said than done as yˋshe is apparently in live with him",
                    "author": "Lilipuss25",
                    "id": "f9xd49m",
                    "parent_id": "t1_f9wdowe",
                    "score": 1,
                    "created_utc": 1575709229.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Hère op isnt only sad because he hit on her friend but also because and mostly because he’s willing to give her double what she is getting",
            "author": "Lilipuss25",
            "id": "f9vpvck",
            "parent_id": "t1_f9vgx6g",
            "score": 3,
            "created_utc": 1575676571.0,
            "replies": [
                {
                    "body": "and she been having to serve it up too, friend was like nah bruh lmao and got double!",
                    "author": "Alawa2000",
                    "id": "f9w3tni",
                    "parent_id": "t1_f9vpvck",
                    "score": 2,
                    "created_utc": 1575686553.0,
                    "replies": [
                        {
                            "body": "Good for the friend. Why be spiteful and jealous 🤷🏼‍♂️",
                            "author": null,
                            "id": "f9w8683",
                            "parent_id": "t1_f9w3tni",
                            "score": 1,
                            "created_utc": 1575688597.0,
                            "replies": [
                                {
                                    "body": "exactly",
                                    "author": "Alawa2000",
                                    "id": "f9w8j16",
                                    "parent_id": "t1_f9w8683",
                                    "score": 2,
                                    "created_utc": 1575688745.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Money doesn't matter because every relationship is different! Ffs",
                    "author": null,
                    "id": "f9w84hg",
                    "parent_id": "t1_f9vpvck",
                    "score": 1,
                    "created_utc": 1575688570.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Not that it matters, but I agree that prioritizing money here seems wrong. We are talking about people, not products-- and people have real feelings.",
            "author": "justaguyhereyeah",
            "id": "f9wdtcy",
            "parent_id": "t1_f9vgx6g",
            "score": 2,
            "created_utc": 1575691061.0,
            "replies": []
        },
        {
            "body": "There aren’t friendship involved here. \nOp doesn’t meet SD complete need or sold herself cheap.\n\nHe’s looking for a new girl he will be spending more. Either he spend that 2*allowande on her friend or he’ll give it to someone else",
            "author": "Lilipuss25",
            "id": "f9vppt3",
            "parent_id": "t1_f9vgx6g",
            "score": 3,
            "created_utc": 1575676458.0,
            "replies": [
                {
                    "body": "Exactly",
                    "author": null,
                    "id": "f9w8aj8",
                    "parent_id": "t1_f9vppt3",
                    "score": 2,
                    "created_utc": 1575688646.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "👏",
            "author": "lakoreanita",
            "id": "f9vjt0p",
            "parent_id": "t1_f9vgx6g",
            "score": 2,
            "created_utc": 1575672207.0,
            "replies": []
        },
        {
            "body": "Lmbo your dilusional AF. You want a meaninful friendship relationship join a church or match.com not a pay for play dating site. Because at the end of the day thats all it is. \nWelcome to teality kitten😯",
            "author": "CareFreeWorld",
            "id": "f9vuv7r",
            "parent_id": "t1_f9vgx6g",
            "score": 2,
            "created_utc": 1575680379.0,
            "replies": [
                {
                    "body": "Wow cool. So I guess all the times my SD told me he loved me and that I changed his life and sent me money without going on any extra dates was all just meaningless. If you wanna treat sugaring like escorting than cool, love that for you 😉",
                    "author": "agavebabe98",
                    "id": "f9w840v",
                    "parent_id": "t1_f9vuv7r",
                    "score": 4,
                    "created_utc": 1575688564.0,
                    "replies": [
                        {
                            "body": "SD-SB relationships are not just financial deals, imho. Like you say, that sort of emotionless deal sounds more like escorting.",
                            "author": "justaguyhereyeah",
                            "id": "f9welq0",
                            "parent_id": "t1_f9w840v",
                            "score": 3,
                            "created_utc": 1575691411.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "For real. I agree",
                    "author": null,
                    "id": "f9w88dv",
                    "parent_id": "t1_f9vuv7r",
                    "score": 0,
                    "created_utc": 1575688621.0,
                    "replies": []
                }
            ]
        },
        {
            "body": " I never said it was nice. We all agree on that.\nPlus nothing here show that the SD she was her friend. Maybe he just went for the new hot girl.\n\nI’m just responding to people who think the friends shouldn’t take the offer for the sake of OP ego. I disagree with that and I think it’s a lose lose situation.\nI also know it’s easier said than done as yˋshe is apparently in live with him",
            "author": "Lilipuss25",
            "id": "f9xd49m",
            "parent_id": "t1_f9wdowe",
            "score": 1,
            "created_utc": 1575709229.0,
            "replies": []
        },
        {
            "body": "and she been having to serve it up too, friend was like nah bruh lmao and got double!",
            "author": "Alawa2000",
            "id": "f9w3tni",
            "parent_id": "t1_f9vpvck",
            "score": 2,
            "created_utc": 1575686553.0,
            "replies": [
                {
                    "body": "Good for the friend. Why be spiteful and jealous 🤷🏼‍♂️",
                    "author": null,
                    "id": "f9w8683",
                    "parent_id": "t1_f9w3tni",
                    "score": 1,
                    "created_utc": 1575688597.0,
                    "replies": [
                        {
                            "body": "exactly",
                            "author": "Alawa2000",
                            "id": "f9w8j16",
                            "parent_id": "t1_f9w8683",
                            "score": 2,
                            "created_utc": 1575688745.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Money doesn't matter because every relationship is different! Ffs",
            "author": null,
            "id": "f9w84hg",
            "parent_id": "t1_f9vpvck",
            "score": 1,
            "created_utc": 1575688570.0,
            "replies": []
        },
        {
            "body": "Exactly",
            "author": null,
            "id": "f9w8aj8",
            "parent_id": "t1_f9vppt3",
            "score": 2,
            "created_utc": 1575688646.0,
            "replies": []
        },
        {
            "body": "Wow cool. So I guess all the times my SD told me he loved me and that I changed his life and sent me money without going on any extra dates was all just meaningless. If you wanna treat sugaring like escorting than cool, love that for you 😉",
            "author": "agavebabe98",
            "id": "f9w840v",
            "parent_id": "t1_f9vuv7r",
            "score": 4,
            "created_utc": 1575688564.0,
            "replies": [
                {
                    "body": "SD-SB relationships are not just financial deals, imho. Like you say, that sort of emotionless deal sounds more like escorting.",
                    "author": "justaguyhereyeah",
                    "id": "f9welq0",
                    "parent_id": "t1_f9w840v",
                    "score": 3,
                    "created_utc": 1575691411.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "For real. I agree",
            "author": null,
            "id": "f9w88dv",
            "parent_id": "t1_f9vuv7r",
            "score": 0,
            "created_utc": 1575688621.0,
            "replies": []
        },
        {
            "body": "Good for the friend. Why be spiteful and jealous 🤷🏼‍♂️",
            "author": null,
            "id": "f9w8683",
            "parent_id": "t1_f9w3tni",
            "score": 1,
            "created_utc": 1575688597.0,
            "replies": [
                {
                    "body": "exactly",
                    "author": "Alawa2000",
                    "id": "f9w8j16",
                    "parent_id": "t1_f9w8683",
                    "score": 2,
                    "created_utc": 1575688745.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "SD-SB relationships are not just financial deals, imho. Like you say, that sort of emotionless deal sounds more like escorting.",
            "author": "justaguyhereyeah",
            "id": "f9welq0",
            "parent_id": "t1_f9w840v",
            "score": 3,
            "created_utc": 1575691411.0,
            "replies": []
        },
        {
            "body": "exactly",
            "author": "Alawa2000",
            "id": "f9w8j16",
            "parent_id": "t1_f9w8683",
            "score": 2,
            "created_utc": 1575688745.0,
            "replies": []
        }
    ]
}