{
    "title": "Can I just say... This is hard",
    "post_id": "ic9xsy",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/ic9xsy/can_i_just_say_this_is_hard/",
    "author": "cleanevergreen",
    "body": "Ladies, this one is for you. \n\nI have what many aspiring SBs might consider a dream SR in terms of gifts/support. Divided out, my guy provides me with my area’s average monthly allowance worth of gifts and support each week. I stopped keeping track months ago. Thinking about it actually blows my mind a bit. Sitting with that thought actually makes me somewhat uncomfortable...\n\nBecause I love him.\n\nWe spent the past week together packing and moving my stuff (and my kids’ stuff!) to a new apartment. It felt so normal, almost uncomfortably normal. By the time we were finished on the last night and too exhausted to even cuddle to sleep, I worried that I have no mystery left, no sex appeal. When he left in a hurry to go pick up his wife the next day, I cried. He didn’t see it, but I barely made it back into my apartment, because I know that due to the nature of how our relationship began, he could easily get bored and find a newer woman to have sex with. Someone to start fresh with all of the fun and none of the real life complications. \n\nNow, part of that was exhaustion, but I really miss him when he’s gone. It feels like he is supposed to be here, like there is a hole in my life when he’s out living his.\n\nI love him.\n\nI want him, but I know if that my personal trust issues don’t get in the way, familiarity will.\n\nI love him.\n\nI pay attention to how he likes to be touched and complimented and give it to him regularly. I let him know how much I appreciate everything he does, from writing a check to holding the door. I admire him for the man that he his, for the wisdom that he shares. And I cry, not often, but it does happen, because my man is not mine.\n\nHe knows how much I love him, that’s why he treats me so well.\n\n\n\n\nFor those of you who are new here, take time to read these posts and think carefully before joining the bowl. For every high, there is a low and it’s all a part of the game.",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/ic9xsy/can_i_just_say_this_is_hard/",
    "score": 113,
    "upvote_ratio": 0.95,
    "created_utc": 1597785371.0,
    "num_comments": 48,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "\"\"I want him, but I know if that my personal trust issues don’t get in the way, familiarity will.\"\"\"\n\nwas that supposed to be family.................\n\nA couple of pieces of advice......   \n\nDon't snatch defeat from the jaws of victory. .. Be joyous in what you have  if that's the way you feel.  Probably what he appreciates the most.  My guess is that he feels his investment in you is great  first for whom you are including being a good mother.  His helping you pack is a pretty strong validation. \n\nWhen you visualize disaster your feet will surely lead the way.",
            "author": "pinotandsugar",
            "id": "g21gjfx",
            "parent_id": "t3_ic9xsy",
            "score": 15,
            "created_utc": 1597790105.0,
            "replies": [
                {
                    "body": "I appreciate it. I’m usually very upbeat, my positivity is one of his favorite things about me, but I was feeling really low after he left. Felt it again today after he came by to help out with getting settled in.\n\nI did mean familiarity, meaning down the road, we could get bored with each other. Many couples do. I already know how easy it is for him to have an affair. I don’t want to question where he is or who he’s texting. I struggle sometimes with the line of our relationship. I have to keep expectations and future fantasies in check.",
                    "author": "cleanevergreen",
                    "id": "g21hmc4",
                    "parent_id": "t1_g21gjfx",
                    "score": 12,
                    "created_utc": 1597790657.0,
                    "replies": []
                }
            ]
        },
        {
            "body": ">Can I just say... This is hard\n\nAre we still doing phrasing?\n\nBut seriously, all relationships are hard - sugar does make them magically easy...\n\nI am glad that you chose to remind us all of how a great relationship feels like - thank you :)",
            "author": "GDarn",
            "id": "g217vbt",
            "parent_id": "t3_ic9xsy",
            "score": 10,
            "created_utc": 1597785773.0,
            "replies": []
        },
        {
            "body": "You and the Gemini guy should hangout.",
            "author": null,
            "id": "g219nqh",
            "parent_id": "t3_ic9xsy",
            "score": 14,
            "created_utc": 1597786667.0,
            "replies": [
                {
                    "body": "Hahaha, I thought something similar while reading his right after posting!",
                    "author": "cleanevergreen",
                    "id": "g21ab14",
                    "parent_id": "t1_g219nqh",
                    "score": 5,
                    "created_utc": 1597786989.0,
                    "replies": [
                        {
                            "body": "I'm only slightly mortified/embarrassed at this.  It wasn't easy reading the replies to said post, but hey, reddit therapy was what I was after and the internet delivered 😅",
                            "author": "Gemini-Fox",
                            "id": "g22nydu",
                            "parent_id": "t1_g21ab14",
                            "score": 4,
                            "created_utc": 1597815038.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I totally get it. I saw my SB cry when I had her take a cab home after our week long trip. (No I didn’t have my car. It was at the airport) I didn’t know she was going to miss me that much. It made me sad too. We have a great relationship but I wonder if it’s because it’s a fantasy. Like not having to deal with life’s ups and downs everyday. Still I get it and I’m sure he does too.",
            "author": "highjinx411",
            "id": "g21oa4q",
            "parent_id": "t3_ic9xsy",
            "score": 5,
            "created_utc": 1597794193.0,
            "replies": []
        },
        {
            "body": "In a perfect arrangement, at first the money is the reason the sb wants to be in the sr. Then as time passes the sd is the reason the sb stays in the sr. As more time passes, the money should act as a substitute for why the sd cant be there full time for her. It's not perfect, but it's the best we can do. All that being said, anything is possible, and sds do leave their spouses for their mistresses. Often times, we get in this game because we aren't happy. @cleanevergreen , enjoy it while it lasts. It's rare we find people we love.",
            "author": "dade_murphy1",
            "id": "g221z7d",
            "parent_id": "t3_ic9xsy",
            "score": 8,
            "created_utc": 1597801678.0,
            "replies": [
                {
                    "body": "I like the way you described it. That makes perfect sense!",
                    "author": "cleanevergreen",
                    "id": "g22603p",
                    "parent_id": "t1_g221z7d",
                    "score": 2,
                    "created_utc": 1597803853.0,
                    "replies": [
                        {
                            "body": "Oftentimes with affair partners, we see the very best of the them when we are together. You dont see him leaving his laundry all over the place. You dont see his shaved beard hairs in the sink. You dont see him not flushing the toilet everytime he goes #2, you dont see his spastic outburts when hes flustered or pissed. You dont see his bad habits. Lol. These relationships can be a very deceiving.",
                            "author": "dade_murphy1",
                            "id": "g227d9f",
                            "parent_id": "t1_g22603p",
                            "score": 8,
                            "created_utc": 1597804600.0,
                            "replies": [
                                {
                                    "body": "I agree, which is why I was so nervous to allow him to see me in the context of a move. It can be incredibly romantic to “overlook” someone’s flaws and say that we accept them, but dealing with it day to day is another thing entirely.\n\nI was worried he wouldn’t desire me anymore.",
                                    "author": "cleanevergreen",
                                    "id": "g22eg0i",
                                    "parent_id": "t1_g227d9f",
                                    "score": 2,
                                    "created_utc": 1597808638.0,
                                    "replies": [
                                        {
                                            "body": "Helping you move and seeing you everyday is 2 totally different things lol.",
                                            "author": "dade_murphy1",
                                            "id": "g22hf4y",
                                            "parent_id": "t1_g22eg0i",
                                            "score": 2,
                                            "created_utc": 1597810366.0,
                                            "replies": [
                                                {
                                                    "body": "This is true. It was a very small glimpse into our “best behavior” under pressure.",
                                                    "author": "cleanevergreen",
                                                    "id": "g22ioaz",
                                                    "parent_id": "t1_g22hf4y",
                                                    "score": 2,
                                                    "created_utc": 1597811182.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Does he love you? If so, why are you worried about him getting bored and leaving?\n\nThanks for the post.",
            "author": null,
            "id": "g21eeim",
            "parent_id": "t3_ic9xsy",
            "score": 5,
            "created_utc": 1597789038.0,
            "replies": [
                {
                    "body": "Yes, he does and we have talked and seen each other since, it’s still there. I just got really self conscious about my ADHD/disorganization and having him help so much. I don’t have many people come over because I consider it my biggest character flaw. He saw the depths of my closets and packed it all too. \n\nAlso, it was an exhausting weekend so, naturally, our flirtation had dwindled significantly by the end. \n\nHe went in feeling self conscious that I wouldn’t like him afterward because he would come off too direct and bossy. It’s exactly what I need in my life, now I appreciate him even more.",
                    "author": "cleanevergreen",
                    "id": "g21fh6f",
                    "parent_id": "t1_g21eeim",
                    "score": 9,
                    "created_utc": 1597789566.0,
                    "replies": [
                        {
                            "body": "Honestly, sounds wonderful. He and you are lucky.\n\nI am going to see my paramour today. We have not seen each other for a couple of weeks. I just want QUANTITY time with her. Domestic bliss I guess. We won't have intimacy as she has had surgery. I just want to be with her.",
                            "author": null,
                            "id": "g21gd3d",
                            "parent_id": "t1_g21fh6f",
                            "score": 5,
                            "created_utc": 1597790017.0,
                            "replies": [
                                {
                                    "body": "She stood me up. I feel like shit. No apology really, just \"I have to help my sister out\" I feel like a fool.",
                                    "author": null,
                                    "id": "g230c6m",
                                    "parent_id": "t1_g21gd3d",
                                    "score": 2,
                                    "created_utc": 1597826936.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "Sometimes it's our flaws that are attractive to other people.  He loves you for who you are not what  you think you should be.",
                            "author": "rjjr1963",
                            "id": "g222h7u",
                            "parent_id": "t1_g21fh6f",
                            "score": 2,
                            "created_utc": 1597801948.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "It is so hard. I once loved a married man. All I can offer is long distance hugs 🤗",
            "author": "Layla_Fox2",
            "id": "g21hpp8",
            "parent_id": "t3_ic9xsy",
            "score": 3,
            "created_utc": 1597790706.0,
            "replies": []
        },
        {
            "body": "Thanks for the post.  I enjoy posts like these because I want my SB to feel loved and love the same way!  Yes, even if it is hard and there are highs/lows.",
            "author": null,
            "id": "g218lu3",
            "parent_id": "t3_ic9xsy",
            "score": 7,
            "created_utc": 1597786143.0,
            "replies": [
                {
                    "body": "Great response. I agree, I think that any kind of relationship should be conducted to the fullest, even if it is temporary or an created illusion .",
                    "author": "TheGoddessWendy",
                    "id": "g22m79t",
                    "parent_id": "t1_g218lu3",
                    "score": 1,
                    "created_utc": 1597813664.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "In the midst of intense feelings, I'm going to make a cold, sober suggestion- don't tell him that you really, genuinely, like 'now-and-forever' L him.  You have the potential to lose a fabulous SR.  I'm *sure* you know that!  Just a Jiminy Cricket whisper in your ear.  All my love.",
            "author": "TY2022",
            "id": "g21oftj",
            "parent_id": "t3_ic9xsy",
            "score": 3,
            "created_utc": 1597794278.0,
            "replies": [
                {
                    "body": "You’re right! I don’t want to rock the boat. He has brought up marriage before, but I told him I don’t need that, I just want to be with him.",
                    "author": "cleanevergreen",
                    "id": "g21s4nl",
                    "parent_id": "t1_g21oftj",
                    "score": 1,
                    "created_utc": 1597796289.0,
                    "replies": [
                        {
                            "body": "Disagree - you should definitely tell him. He loves you and wants to marry you - why wouldn't you tell him you love him?",
                            "author": "blackberrydoughnuts",
                            "id": "g22989m",
                            "parent_id": "t1_g21s4nl",
                            "score": 2,
                            "created_utc": 1597805653.0,
                            "replies": [
                                {
                                    "body": "I tell him I love him all the time. He’s already married though, so as much as I have the “pick me, choose me, love me” fantasy, I’m not going to tell him to leave his wife. \n\n...now, if he chose to go his separate way, it sure would make it easier for us to date. 😅 But that’s a whole different post!",
                                    "author": "cleanevergreen",
                                    "id": "g22al1r",
                                    "parent_id": "t1_g22989m",
                                    "score": 1,
                                    "created_utc": 1597806408.0,
                                    "replies": [
                                        {
                                            "body": "I thought you said he brought up marrying you before?\n\nSounds to me like he'd leave her if he thought you were interested.",
                                            "author": "blackberrydoughnuts",
                                            "id": "g22axyx",
                                            "parent_id": "t1_g22al1r",
                                            "score": 1,
                                            "created_utc": 1597806612.0,
                                            "replies": [
                                                {
                                                    "body": "That’s true, he did and it does sound that way, but I don’t want to torture myself in the process. I don’t know that he would ever actually do it and I would feel awful if he and I crumbled under the pressure in the mean time.\n\nI’m not in a rush to re-marry, if ever again. It wouldn’t be impossible, but there are a lot things we would both need to take into consideration. We just haven’t known each other long enough at this point.",
                                                    "author": "cleanevergreen",
                                                    "id": "g22bxc5",
                                                    "parent_id": "t1_g22axyx",
                                                    "score": 1,
                                                    "created_utc": 1597807169.0,
                                                    "replies": [
                                                        {
                                                            "body": "Getting legally married is not the point. The point is that he wants to be with you, not her, and he doesn't think you're interested. And that hurts him. I just don't get why you wouldn't be honest with him. Right now he thinks you wouldn't want him.",
                                                            "author": "blackberrydoughnuts",
                                                            "id": "g22c4uj",
                                                            "parent_id": "t1_g22bxc5",
                                                            "score": 2,
                                                            "created_utc": 1597807287.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Are you my SD? 👀",
                                                                    "author": "cleanevergreen",
                                                                    "id": "g22cdpq",
                                                                    "parent_id": "t1_g22c4uj",
                                                                    "score": 4,
                                                                    "created_utc": 1597807427.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "Lol. Maybe.",
                                                                            "author": "blackberrydoughnuts",
                                                                            "id": "g22cin5",
                                                                            "parent_id": "t1_g22cdpq",
                                                                            "score": 3,
                                                                            "created_utc": 1597807507.0,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Yes to all of this! \n\nIt can be hard, especially when those super lows hit, but it is oh-so wonderful, too.",
            "author": null,
            "id": "g21yvsc",
            "parent_id": "t3_ic9xsy",
            "score": 2,
            "created_utc": 1597800011.0,
            "replies": [
                {
                    "body": "It is so wonderful 🥰",
                    "author": "cleanevergreen",
                    "id": "g221q3d",
                    "parent_id": "t1_g21yvsc",
                    "score": 2,
                    "created_utc": 1597801543.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I would love for my SB to feel the way you do. And in doing so you open yourself up to heartache. \n\nBut in spite of the dater crowd looking for love in all the wrong places, it is good to realize that with rare exceptions a SR is not permanent. Therefore it is worthwhile reminding ourselves that we are here for moments of pleasure,not a lifetime of joy and commitment.",
            "author": "GSSD",
            "id": "g23ikcy",
            "parent_id": "t3_ic9xsy",
            "score": 2,
            "created_utc": 1597842369.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "g217t97",
            "parent_id": "t3_ic9xsy",
            "score": 4,
            "created_utc": 1597785745.0,
            "replies": [
                {
                    "body": "SDs are more than welcome to contribute!\n\nMy hope was to give insight into one example of a real SR to help give more realistic expectations to the girls who think they can come in and “make easy money” then complain when no one bites. The thought of someone trying to take advantage of my sweet guy is really upsetting.",
                    "author": "cleanevergreen",
                    "id": "g218x22",
                    "parent_id": "t1_g217t97",
                    "score": 8,
                    "created_utc": 1597786299.0,
                    "replies": [
                        {
                            "body": "you sound like my SGF. we sugar date as a couple, which helps keep things fresh and exciting. but, she is very protective of me - her radar to spot girls that might try to take advantage of me is even more sensitive than mine.",
                            "author": "joc13",
                            "id": "g2299tk",
                            "parent_id": "t1_g218x22",
                            "score": 1,
                            "created_utc": 1597805677.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Every relationship ends one way or another. Every one. The feelings are what makes a relationship special. Relax. Enjoy your feelings. Let tomorrow take care of itself. And do not worry over the things you cannot control.",
            "author": "AFSMSgt",
            "id": "g21cgl3",
            "parent_id": "t3_ic9xsy",
            "score": 4,
            "created_utc": 1597788071.0,
            "replies": []
        },
        {
            "body": "That sounds hard, but if I were you I would cherish the time you have without focusing on the feelings of loss and lack and potential end.\nIt sounds like he gives you so much, if you can’t find a way to be satisfied within that then you probably have to let the relationship go.",
            "author": "Allordrien",
            "id": "g21hc20",
            "parent_id": "t3_ic9xsy",
            "score": 1,
            "created_utc": 1597790508.0,
            "replies": []
        },
        {
            "body": "Feel this a tremendous amount. Sending you lots of love",
            "author": "lawbabyesq",
            "id": "g21xyeu",
            "parent_id": "t3_ic9xsy",
            "score": 1,
            "created_utc": 1597799498.0,
            "replies": []
        },
        {
            "body": "Having feelings can be troublesome especially when we're in this business but I am learning that it is a part of life.. I thought SR was all about the serious business that only revolves around sex and money at first, but it's actually more than just that. I've come to realize that if we were to do it, make sure to do it with someone with the same wavelength as you.  You got a good thing going and it could be a great example for girls out there, like this is how you should do it, to give good things and receive good things. \n\nThank you for sharing this. It's an eye opener and with the help of  the replies, we sure will know what to do in case this happens to one of us (me).",
            "author": "JheneBebe",
            "id": "g226hwv",
            "parent_id": "t3_ic9xsy",
            "score": 1,
            "created_utc": 1597804118.0,
            "replies": []
        },
        {
            "body": "He loves you and wants to marry you - why wouldn't you marry him and be with him?",
            "author": "blackberrydoughnuts",
            "id": "g229aut",
            "parent_id": "t3_ic9xsy",
            "score": 1,
            "created_utc": 1597805694.0,
            "replies": []
        },
        {
            "body": "Okay but hear me out. If you were in his wife’s place who would inevitably be in yours? I tend to avoid married men for this reason but someone would say it’s better to be the other woman than the wife.",
            "author": "alifitzbarker",
            "id": "g22gvj1",
            "parent_id": "t3_ic9xsy",
            "score": 1,
            "created_utc": 1597810026.0,
            "replies": []
        },
        {
            "body": "I understand being so happy with the current situation that you are already hurting knowing it will end.",
            "author": "LotBuilder",
            "id": "g22nkte",
            "parent_id": "t3_ic9xsy",
            "score": 1,
            "created_utc": 1597814733.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "g21bvur",
            "parent_id": "t3_ic9xsy",
            "score": -7,
            "created_utc": 1597787787.0,
            "replies": [
                {
                    "body": "This is one of the only places that I can express any sentiment about my relationship, of course that is by my choice of relationship, but also there are many, many girls coming to this forum daily that are considering sugar and I want them to know the emotional toll it can take. I want them to make informed decisions. \n\nOverall, I do enjoy my relationship, but I feel that these new girls should be able to see all sides, know themselves, and decided what kind of lifestyle is or isn’t right for them.",
                    "author": "cleanevergreen",
                    "id": "g21oqqe",
                    "parent_id": "t1_g21bvur",
                    "score": 4,
                    "created_utc": 1597794444.0,
                    "replies": []
                },
                {
                    "body": "Gotta say I agree. If you go into a relationship, any kind of relationship, with someone who is attached, you will never be fully theirs, and they will never be fully yours. Feelings blossom regardless of attachments, and so when you have pre existing attachments + feelings, that = pain and suffering. It's not worth it for me, personally.",
                    "author": "little_bean_bun",
                    "id": "g21gsy8",
                    "parent_id": "t1_g21bvur",
                    "score": 3,
                    "created_utc": 1597790239.0,
                    "replies": []
                },
                {
                    "body": "You’re so pretentious. How do even sugar without sounding like a complete ass",
                    "author": "babylina",
                    "id": "g21h06m",
                    "parent_id": "t1_g21bvur",
                    "score": 4,
                    "created_utc": 1597790339.0,
                    "replies": []
                },
                {
                    "body": " Thanks for pouring boiling oil on an otherwise very pleasant post.  Maybe, we should just stick to orgasm and failed profile reviews to suit the narrow minded or those in self denial?",
                    "author": "Mnkyblunt",
                    "id": "g21ggxo",
                    "parent_id": "t1_g21bvur",
                    "score": 2,
                    "created_utc": 1597790070.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "That’s what she said",
            "author": "Color_Me_Blue",
            "id": "g21dkrl",
            "parent_id": "t3_ic9xsy",
            "score": 0,
            "created_utc": 1597788625.0,
            "replies": []
        },
        {
            "body": "Ouch!",
            "author": null,
            "id": "g21p8j0",
            "parent_id": "t3_ic9xsy",
            "score": 0,
            "created_utc": 1597794712.0,
            "replies": []
        },
        {
            "body": "I appreciate it. I’m usually very upbeat, my positivity is one of his favorite things about me, but I was feeling really low after he left. Felt it again today after he came by to help out with getting settled in.\n\nI did mean familiarity, meaning down the road, we could get bored with each other. Many couples do. I already know how easy it is for him to have an affair. I don’t want to question where he is or who he’s texting. I struggle sometimes with the line of our relationship. I have to keep expectations and future fantasies in check.",
            "author": "cleanevergreen",
            "id": "g21hmc4",
            "parent_id": "t1_g21gjfx",
            "score": 12,
            "created_utc": 1597790657.0,
            "replies": []
        },
        {
            "body": "Hahaha, I thought something similar while reading his right after posting!",
            "author": "cleanevergreen",
            "id": "g21ab14",
            "parent_id": "t1_g219nqh",
            "score": 5,
            "created_utc": 1597786989.0,
            "replies": [
                {
                    "body": "I'm only slightly mortified/embarrassed at this.  It wasn't easy reading the replies to said post, but hey, reddit therapy was what I was after and the internet delivered 😅",
                    "author": "Gemini-Fox",
                    "id": "g22nydu",
                    "parent_id": "t1_g21ab14",
                    "score": 4,
                    "created_utc": 1597815038.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I like the way you described it. That makes perfect sense!",
            "author": "cleanevergreen",
            "id": "g22603p",
            "parent_id": "t1_g221z7d",
            "score": 2,
            "created_utc": 1597803853.0,
            "replies": [
                {
                    "body": "Oftentimes with affair partners, we see the very best of the them when we are together. You dont see him leaving his laundry all over the place. You dont see his shaved beard hairs in the sink. You dont see him not flushing the toilet everytime he goes #2, you dont see his spastic outburts when hes flustered or pissed. You dont see his bad habits. Lol. These relationships can be a very deceiving.",
                    "author": "dade_murphy1",
                    "id": "g227d9f",
                    "parent_id": "t1_g22603p",
                    "score": 8,
                    "created_utc": 1597804600.0,
                    "replies": [
                        {
                            "body": "I agree, which is why I was so nervous to allow him to see me in the context of a move. It can be incredibly romantic to “overlook” someone’s flaws and say that we accept them, but dealing with it day to day is another thing entirely.\n\nI was worried he wouldn’t desire me anymore.",
                            "author": "cleanevergreen",
                            "id": "g22eg0i",
                            "parent_id": "t1_g227d9f",
                            "score": 2,
                            "created_utc": 1597808638.0,
                            "replies": [
                                {
                                    "body": "Helping you move and seeing you everyday is 2 totally different things lol.",
                                    "author": "dade_murphy1",
                                    "id": "g22hf4y",
                                    "parent_id": "t1_g22eg0i",
                                    "score": 2,
                                    "created_utc": 1597810366.0,
                                    "replies": [
                                        {
                                            "body": "This is true. It was a very small glimpse into our “best behavior” under pressure.",
                                            "author": "cleanevergreen",
                                            "id": "g22ioaz",
                                            "parent_id": "t1_g22hf4y",
                                            "score": 2,
                                            "created_utc": 1597811182.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Yes, he does and we have talked and seen each other since, it’s still there. I just got really self conscious about my ADHD/disorganization and having him help so much. I don’t have many people come over because I consider it my biggest character flaw. He saw the depths of my closets and packed it all too. \n\nAlso, it was an exhausting weekend so, naturally, our flirtation had dwindled significantly by the end. \n\nHe went in feeling self conscious that I wouldn’t like him afterward because he would come off too direct and bossy. It’s exactly what I need in my life, now I appreciate him even more.",
            "author": "cleanevergreen",
            "id": "g21fh6f",
            "parent_id": "t1_g21eeim",
            "score": 9,
            "created_utc": 1597789566.0,
            "replies": [
                {
                    "body": "Honestly, sounds wonderful. He and you are lucky.\n\nI am going to see my paramour today. We have not seen each other for a couple of weeks. I just want QUANTITY time with her. Domestic bliss I guess. We won't have intimacy as she has had surgery. I just want to be with her.",
                    "author": null,
                    "id": "g21gd3d",
                    "parent_id": "t1_g21fh6f",
                    "score": 5,
                    "created_utc": 1597790017.0,
                    "replies": [
                        {
                            "body": "She stood me up. I feel like shit. No apology really, just \"I have to help my sister out\" I feel like a fool.",
                            "author": null,
                            "id": "g230c6m",
                            "parent_id": "t1_g21gd3d",
                            "score": 2,
                            "created_utc": 1597826936.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Sometimes it's our flaws that are attractive to other people.  He loves you for who you are not what  you think you should be.",
                    "author": "rjjr1963",
                    "id": "g222h7u",
                    "parent_id": "t1_g21fh6f",
                    "score": 2,
                    "created_utc": 1597801948.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Great response. I agree, I think that any kind of relationship should be conducted to the fullest, even if it is temporary or an created illusion .",
            "author": "TheGoddessWendy",
            "id": "g22m79t",
            "parent_id": "t1_g218lu3",
            "score": 1,
            "created_utc": 1597813664.0,
            "replies": []
        },
        {
            "body": "You’re right! I don’t want to rock the boat. He has brought up marriage before, but I told him I don’t need that, I just want to be with him.",
            "author": "cleanevergreen",
            "id": "g21s4nl",
            "parent_id": "t1_g21oftj",
            "score": 1,
            "created_utc": 1597796289.0,
            "replies": [
                {
                    "body": "Disagree - you should definitely tell him. He loves you and wants to marry you - why wouldn't you tell him you love him?",
                    "author": "blackberrydoughnuts",
                    "id": "g22989m",
                    "parent_id": "t1_g21s4nl",
                    "score": 2,
                    "created_utc": 1597805653.0,
                    "replies": [
                        {
                            "body": "I tell him I love him all the time. He’s already married though, so as much as I have the “pick me, choose me, love me” fantasy, I’m not going to tell him to leave his wife. \n\n...now, if he chose to go his separate way, it sure would make it easier for us to date. 😅 But that’s a whole different post!",
                            "author": "cleanevergreen",
                            "id": "g22al1r",
                            "parent_id": "t1_g22989m",
                            "score": 1,
                            "created_utc": 1597806408.0,
                            "replies": [
                                {
                                    "body": "I thought you said he brought up marrying you before?\n\nSounds to me like he'd leave her if he thought you were interested.",
                                    "author": "blackberrydoughnuts",
                                    "id": "g22axyx",
                                    "parent_id": "t1_g22al1r",
                                    "score": 1,
                                    "created_utc": 1597806612.0,
                                    "replies": [
                                        {
                                            "body": "That’s true, he did and it does sound that way, but I don’t want to torture myself in the process. I don’t know that he would ever actually do it and I would feel awful if he and I crumbled under the pressure in the mean time.\n\nI’m not in a rush to re-marry, if ever again. It wouldn’t be impossible, but there are a lot things we would both need to take into consideration. We just haven’t known each other long enough at this point.",
                                            "author": "cleanevergreen",
                                            "id": "g22bxc5",
                                            "parent_id": "t1_g22axyx",
                                            "score": 1,
                                            "created_utc": 1597807169.0,
                                            "replies": [
                                                {
                                                    "body": "Getting legally married is not the point. The point is that he wants to be with you, not her, and he doesn't think you're interested. And that hurts him. I just don't get why you wouldn't be honest with him. Right now he thinks you wouldn't want him.",
                                                    "author": "blackberrydoughnuts",
                                                    "id": "g22c4uj",
                                                    "parent_id": "t1_g22bxc5",
                                                    "score": 2,
                                                    "created_utc": 1597807287.0,
                                                    "replies": [
                                                        {
                                                            "body": "Are you my SD? 👀",
                                                            "author": "cleanevergreen",
                                                            "id": "g22cdpq",
                                                            "parent_id": "t1_g22c4uj",
                                                            "score": 4,
                                                            "created_utc": 1597807427.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Lol. Maybe.",
                                                                    "author": "blackberrydoughnuts",
                                                                    "id": "g22cin5",
                                                                    "parent_id": "t1_g22cdpq",
                                                                    "score": 3,
                                                                    "created_utc": 1597807507.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "It is so wonderful 🥰",
            "author": "cleanevergreen",
            "id": "g221q3d",
            "parent_id": "t1_g21yvsc",
            "score": 2,
            "created_utc": 1597801543.0,
            "replies": []
        },
        {
            "body": "SDs are more than welcome to contribute!\n\nMy hope was to give insight into one example of a real SR to help give more realistic expectations to the girls who think they can come in and “make easy money” then complain when no one bites. The thought of someone trying to take advantage of my sweet guy is really upsetting.",
            "author": "cleanevergreen",
            "id": "g218x22",
            "parent_id": "t1_g217t97",
            "score": 8,
            "created_utc": 1597786299.0,
            "replies": [
                {
                    "body": "you sound like my SGF. we sugar date as a couple, which helps keep things fresh and exciting. but, she is very protective of me - her radar to spot girls that might try to take advantage of me is even more sensitive than mine.",
                    "author": "joc13",
                    "id": "g2299tk",
                    "parent_id": "t1_g218x22",
                    "score": 1,
                    "created_utc": 1597805677.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "This is one of the only places that I can express any sentiment about my relationship, of course that is by my choice of relationship, but also there are many, many girls coming to this forum daily that are considering sugar and I want them to know the emotional toll it can take. I want them to make informed decisions. \n\nOverall, I do enjoy my relationship, but I feel that these new girls should be able to see all sides, know themselves, and decided what kind of lifestyle is or isn’t right for them.",
            "author": "cleanevergreen",
            "id": "g21oqqe",
            "parent_id": "t1_g21bvur",
            "score": 4,
            "created_utc": 1597794444.0,
            "replies": []
        },
        {
            "body": "Gotta say I agree. If you go into a relationship, any kind of relationship, with someone who is attached, you will never be fully theirs, and they will never be fully yours. Feelings blossom regardless of attachments, and so when you have pre existing attachments + feelings, that = pain and suffering. It's not worth it for me, personally.",
            "author": "little_bean_bun",
            "id": "g21gsy8",
            "parent_id": "t1_g21bvur",
            "score": 3,
            "created_utc": 1597790239.0,
            "replies": []
        },
        {
            "body": "You’re so pretentious. How do even sugar without sounding like a complete ass",
            "author": "babylina",
            "id": "g21h06m",
            "parent_id": "t1_g21bvur",
            "score": 4,
            "created_utc": 1597790339.0,
            "replies": []
        },
        {
            "body": " Thanks for pouring boiling oil on an otherwise very pleasant post.  Maybe, we should just stick to orgasm and failed profile reviews to suit the narrow minded or those in self denial?",
            "author": "Mnkyblunt",
            "id": "g21ggxo",
            "parent_id": "t1_g21bvur",
            "score": 2,
            "created_utc": 1597790070.0,
            "replies": []
        },
        {
            "body": "I'm only slightly mortified/embarrassed at this.  It wasn't easy reading the replies to said post, but hey, reddit therapy was what I was after and the internet delivered 😅",
            "author": "Gemini-Fox",
            "id": "g22nydu",
            "parent_id": "t1_g21ab14",
            "score": 4,
            "created_utc": 1597815038.0,
            "replies": []
        },
        {
            "body": "Oftentimes with affair partners, we see the very best of the them when we are together. You dont see him leaving his laundry all over the place. You dont see his shaved beard hairs in the sink. You dont see him not flushing the toilet everytime he goes #2, you dont see his spastic outburts when hes flustered or pissed. You dont see his bad habits. Lol. These relationships can be a very deceiving.",
            "author": "dade_murphy1",
            "id": "g227d9f",
            "parent_id": "t1_g22603p",
            "score": 8,
            "created_utc": 1597804600.0,
            "replies": [
                {
                    "body": "I agree, which is why I was so nervous to allow him to see me in the context of a move. It can be incredibly romantic to “overlook” someone’s flaws and say that we accept them, but dealing with it day to day is another thing entirely.\n\nI was worried he wouldn’t desire me anymore.",
                    "author": "cleanevergreen",
                    "id": "g22eg0i",
                    "parent_id": "t1_g227d9f",
                    "score": 2,
                    "created_utc": 1597808638.0,
                    "replies": [
                        {
                            "body": "Helping you move and seeing you everyday is 2 totally different things lol.",
                            "author": "dade_murphy1",
                            "id": "g22hf4y",
                            "parent_id": "t1_g22eg0i",
                            "score": 2,
                            "created_utc": 1597810366.0,
                            "replies": [
                                {
                                    "body": "This is true. It was a very small glimpse into our “best behavior” under pressure.",
                                    "author": "cleanevergreen",
                                    "id": "g22ioaz",
                                    "parent_id": "t1_g22hf4y",
                                    "score": 2,
                                    "created_utc": 1597811182.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Honestly, sounds wonderful. He and you are lucky.\n\nI am going to see my paramour today. We have not seen each other for a couple of weeks. I just want QUANTITY time with her. Domestic bliss I guess. We won't have intimacy as she has had surgery. I just want to be with her.",
            "author": null,
            "id": "g21gd3d",
            "parent_id": "t1_g21fh6f",
            "score": 5,
            "created_utc": 1597790017.0,
            "replies": [
                {
                    "body": "She stood me up. I feel like shit. No apology really, just \"I have to help my sister out\" I feel like a fool.",
                    "author": null,
                    "id": "g230c6m",
                    "parent_id": "t1_g21gd3d",
                    "score": 2,
                    "created_utc": 1597826936.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Sometimes it's our flaws that are attractive to other people.  He loves you for who you are not what  you think you should be.",
            "author": "rjjr1963",
            "id": "g222h7u",
            "parent_id": "t1_g21fh6f",
            "score": 2,
            "created_utc": 1597801948.0,
            "replies": []
        },
        {
            "body": "Disagree - you should definitely tell him. He loves you and wants to marry you - why wouldn't you tell him you love him?",
            "author": "blackberrydoughnuts",
            "id": "g22989m",
            "parent_id": "t1_g21s4nl",
            "score": 2,
            "created_utc": 1597805653.0,
            "replies": [
                {
                    "body": "I tell him I love him all the time. He’s already married though, so as much as I have the “pick me, choose me, love me” fantasy, I’m not going to tell him to leave his wife. \n\n...now, if he chose to go his separate way, it sure would make it easier for us to date. 😅 But that’s a whole different post!",
                    "author": "cleanevergreen",
                    "id": "g22al1r",
                    "parent_id": "t1_g22989m",
                    "score": 1,
                    "created_utc": 1597806408.0,
                    "replies": [
                        {
                            "body": "I thought you said he brought up marrying you before?\n\nSounds to me like he'd leave her if he thought you were interested.",
                            "author": "blackberrydoughnuts",
                            "id": "g22axyx",
                            "parent_id": "t1_g22al1r",
                            "score": 1,
                            "created_utc": 1597806612.0,
                            "replies": [
                                {
                                    "body": "That’s true, he did and it does sound that way, but I don’t want to torture myself in the process. I don’t know that he would ever actually do it and I would feel awful if he and I crumbled under the pressure in the mean time.\n\nI’m not in a rush to re-marry, if ever again. It wouldn’t be impossible, but there are a lot things we would both need to take into consideration. We just haven’t known each other long enough at this point.",
                                    "author": "cleanevergreen",
                                    "id": "g22bxc5",
                                    "parent_id": "t1_g22axyx",
                                    "score": 1,
                                    "created_utc": 1597807169.0,
                                    "replies": [
                                        {
                                            "body": "Getting legally married is not the point. The point is that he wants to be with you, not her, and he doesn't think you're interested. And that hurts him. I just don't get why you wouldn't be honest with him. Right now he thinks you wouldn't want him.",
                                            "author": "blackberrydoughnuts",
                                            "id": "g22c4uj",
                                            "parent_id": "t1_g22bxc5",
                                            "score": 2,
                                            "created_utc": 1597807287.0,
                                            "replies": [
                                                {
                                                    "body": "Are you my SD? 👀",
                                                    "author": "cleanevergreen",
                                                    "id": "g22cdpq",
                                                    "parent_id": "t1_g22c4uj",
                                                    "score": 4,
                                                    "created_utc": 1597807427.0,
                                                    "replies": [
                                                        {
                                                            "body": "Lol. Maybe.",
                                                            "author": "blackberrydoughnuts",
                                                            "id": "g22cin5",
                                                            "parent_id": "t1_g22cdpq",
                                                            "score": 3,
                                                            "created_utc": 1597807507.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "you sound like my SGF. we sugar date as a couple, which helps keep things fresh and exciting. but, she is very protective of me - her radar to spot girls that might try to take advantage of me is even more sensitive than mine.",
            "author": "joc13",
            "id": "g2299tk",
            "parent_id": "t1_g218x22",
            "score": 1,
            "created_utc": 1597805677.0,
            "replies": []
        },
        {
            "body": "I agree, which is why I was so nervous to allow him to see me in the context of a move. It can be incredibly romantic to “overlook” someone’s flaws and say that we accept them, but dealing with it day to day is another thing entirely.\n\nI was worried he wouldn’t desire me anymore.",
            "author": "cleanevergreen",
            "id": "g22eg0i",
            "parent_id": "t1_g227d9f",
            "score": 2,
            "created_utc": 1597808638.0,
            "replies": [
                {
                    "body": "Helping you move and seeing you everyday is 2 totally different things lol.",
                    "author": "dade_murphy1",
                    "id": "g22hf4y",
                    "parent_id": "t1_g22eg0i",
                    "score": 2,
                    "created_utc": 1597810366.0,
                    "replies": [
                        {
                            "body": "This is true. It was a very small glimpse into our “best behavior” under pressure.",
                            "author": "cleanevergreen",
                            "id": "g22ioaz",
                            "parent_id": "t1_g22hf4y",
                            "score": 2,
                            "created_utc": 1597811182.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "She stood me up. I feel like shit. No apology really, just \"I have to help my sister out\" I feel like a fool.",
            "author": null,
            "id": "g230c6m",
            "parent_id": "t1_g21gd3d",
            "score": 2,
            "created_utc": 1597826936.0,
            "replies": []
        },
        {
            "body": "I tell him I love him all the time. He’s already married though, so as much as I have the “pick me, choose me, love me” fantasy, I’m not going to tell him to leave his wife. \n\n...now, if he chose to go his separate way, it sure would make it easier for us to date. 😅 But that’s a whole different post!",
            "author": "cleanevergreen",
            "id": "g22al1r",
            "parent_id": "t1_g22989m",
            "score": 1,
            "created_utc": 1597806408.0,
            "replies": [
                {
                    "body": "I thought you said he brought up marrying you before?\n\nSounds to me like he'd leave her if he thought you were interested.",
                    "author": "blackberrydoughnuts",
                    "id": "g22axyx",
                    "parent_id": "t1_g22al1r",
                    "score": 1,
                    "created_utc": 1597806612.0,
                    "replies": [
                        {
                            "body": "That’s true, he did and it does sound that way, but I don’t want to torture myself in the process. I don’t know that he would ever actually do it and I would feel awful if he and I crumbled under the pressure in the mean time.\n\nI’m not in a rush to re-marry, if ever again. It wouldn’t be impossible, but there are a lot things we would both need to take into consideration. We just haven’t known each other long enough at this point.",
                            "author": "cleanevergreen",
                            "id": "g22bxc5",
                            "parent_id": "t1_g22axyx",
                            "score": 1,
                            "created_utc": 1597807169.0,
                            "replies": [
                                {
                                    "body": "Getting legally married is not the point. The point is that he wants to be with you, not her, and he doesn't think you're interested. And that hurts him. I just don't get why you wouldn't be honest with him. Right now he thinks you wouldn't want him.",
                                    "author": "blackberrydoughnuts",
                                    "id": "g22c4uj",
                                    "parent_id": "t1_g22bxc5",
                                    "score": 2,
                                    "created_utc": 1597807287.0,
                                    "replies": [
                                        {
                                            "body": "Are you my SD? 👀",
                                            "author": "cleanevergreen",
                                            "id": "g22cdpq",
                                            "parent_id": "t1_g22c4uj",
                                            "score": 4,
                                            "created_utc": 1597807427.0,
                                            "replies": [
                                                {
                                                    "body": "Lol. Maybe.",
                                                    "author": "blackberrydoughnuts",
                                                    "id": "g22cin5",
                                                    "parent_id": "t1_g22cdpq",
                                                    "score": 3,
                                                    "created_utc": 1597807507.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Helping you move and seeing you everyday is 2 totally different things lol.",
            "author": "dade_murphy1",
            "id": "g22hf4y",
            "parent_id": "t1_g22eg0i",
            "score": 2,
            "created_utc": 1597810366.0,
            "replies": [
                {
                    "body": "This is true. It was a very small glimpse into our “best behavior” under pressure.",
                    "author": "cleanevergreen",
                    "id": "g22ioaz",
                    "parent_id": "t1_g22hf4y",
                    "score": 2,
                    "created_utc": 1597811182.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I thought you said he brought up marrying you before?\n\nSounds to me like he'd leave her if he thought you were interested.",
            "author": "blackberrydoughnuts",
            "id": "g22axyx",
            "parent_id": "t1_g22al1r",
            "score": 1,
            "created_utc": 1597806612.0,
            "replies": [
                {
                    "body": "That’s true, he did and it does sound that way, but I don’t want to torture myself in the process. I don’t know that he would ever actually do it and I would feel awful if he and I crumbled under the pressure in the mean time.\n\nI’m not in a rush to re-marry, if ever again. It wouldn’t be impossible, but there are a lot things we would both need to take into consideration. We just haven’t known each other long enough at this point.",
                    "author": "cleanevergreen",
                    "id": "g22bxc5",
                    "parent_id": "t1_g22axyx",
                    "score": 1,
                    "created_utc": 1597807169.0,
                    "replies": [
                        {
                            "body": "Getting legally married is not the point. The point is that he wants to be with you, not her, and he doesn't think you're interested. And that hurts him. I just don't get why you wouldn't be honest with him. Right now he thinks you wouldn't want him.",
                            "author": "blackberrydoughnuts",
                            "id": "g22c4uj",
                            "parent_id": "t1_g22bxc5",
                            "score": 2,
                            "created_utc": 1597807287.0,
                            "replies": [
                                {
                                    "body": "Are you my SD? 👀",
                                    "author": "cleanevergreen",
                                    "id": "g22cdpq",
                                    "parent_id": "t1_g22c4uj",
                                    "score": 4,
                                    "created_utc": 1597807427.0,
                                    "replies": [
                                        {
                                            "body": "Lol. Maybe.",
                                            "author": "blackberrydoughnuts",
                                            "id": "g22cin5",
                                            "parent_id": "t1_g22cdpq",
                                            "score": 3,
                                            "created_utc": 1597807507.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "This is true. It was a very small glimpse into our “best behavior” under pressure.",
            "author": "cleanevergreen",
            "id": "g22ioaz",
            "parent_id": "t1_g22hf4y",
            "score": 2,
            "created_utc": 1597811182.0,
            "replies": []
        },
        {
            "body": "That’s true, he did and it does sound that way, but I don’t want to torture myself in the process. I don’t know that he would ever actually do it and I would feel awful if he and I crumbled under the pressure in the mean time.\n\nI’m not in a rush to re-marry, if ever again. It wouldn’t be impossible, but there are a lot things we would both need to take into consideration. We just haven’t known each other long enough at this point.",
            "author": "cleanevergreen",
            "id": "g22bxc5",
            "parent_id": "t1_g22axyx",
            "score": 1,
            "created_utc": 1597807169.0,
            "replies": [
                {
                    "body": "Getting legally married is not the point. The point is that he wants to be with you, not her, and he doesn't think you're interested. And that hurts him. I just don't get why you wouldn't be honest with him. Right now he thinks you wouldn't want him.",
                    "author": "blackberrydoughnuts",
                    "id": "g22c4uj",
                    "parent_id": "t1_g22bxc5",
                    "score": 2,
                    "created_utc": 1597807287.0,
                    "replies": [
                        {
                            "body": "Are you my SD? 👀",
                            "author": "cleanevergreen",
                            "id": "g22cdpq",
                            "parent_id": "t1_g22c4uj",
                            "score": 4,
                            "created_utc": 1597807427.0,
                            "replies": [
                                {
                                    "body": "Lol. Maybe.",
                                    "author": "blackberrydoughnuts",
                                    "id": "g22cin5",
                                    "parent_id": "t1_g22cdpq",
                                    "score": 3,
                                    "created_utc": 1597807507.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Getting legally married is not the point. The point is that he wants to be with you, not her, and he doesn't think you're interested. And that hurts him. I just don't get why you wouldn't be honest with him. Right now he thinks you wouldn't want him.",
            "author": "blackberrydoughnuts",
            "id": "g22c4uj",
            "parent_id": "t1_g22bxc5",
            "score": 2,
            "created_utc": 1597807287.0,
            "replies": [
                {
                    "body": "Are you my SD? 👀",
                    "author": "cleanevergreen",
                    "id": "g22cdpq",
                    "parent_id": "t1_g22c4uj",
                    "score": 4,
                    "created_utc": 1597807427.0,
                    "replies": [
                        {
                            "body": "Lol. Maybe.",
                            "author": "blackberrydoughnuts",
                            "id": "g22cin5",
                            "parent_id": "t1_g22cdpq",
                            "score": 3,
                            "created_utc": 1597807507.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Are you my SD? 👀",
            "author": "cleanevergreen",
            "id": "g22cdpq",
            "parent_id": "t1_g22c4uj",
            "score": 4,
            "created_utc": 1597807427.0,
            "replies": [
                {
                    "body": "Lol. Maybe.",
                    "author": "blackberrydoughnuts",
                    "id": "g22cin5",
                    "parent_id": "t1_g22cdpq",
                    "score": 3,
                    "created_utc": 1597807507.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Lol. Maybe.",
            "author": "blackberrydoughnuts",
            "id": "g22cin5",
            "parent_id": "t1_g22cdpq",
            "score": 3,
            "created_utc": 1597807507.0,
            "replies": []
        }
    ]
}