{
    "title": "So you want to be a sugar daddy? The recipe",
    "post_id": "rbzcgg",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/rbzcgg/so_you_want_to_be_a_sugar_daddy_the_recipe/",
    "author": null,
    "body": "After 7 years in the bowl and 100+ meetings, I’ve finalized the steps to be a sugar daddy and sugar date attractive college-aged women.\n\nIf you’re a busy guy running a business, with a successful career, or with some fun hobbies you’re going to love this process. You’re paying money for this so it’ll be easy peesy, set and forget \n\nSteps \n1. sign up for SA. Pay your membership fee and start sending messages. Many of the women will be of lower attractiveness than you will match with on a vanilla dating app but still expect that spoiling. Spend your time sorting.\n\n2. Send likely 100+ back-and-forth messages every couple weeks to the few women you find attractive. Find that many of them created a profile on whim and never will login again. Find that many others have no idea how to have a sugar relationship or want platonic or online-only (“buy pics”?)\n\n3. Text to try to schedule a date. Find that many of them are impossible to meet up with or have no time in their schedule. It’s like they never even thought they’d have to meet up! Find that others are PROs and just want to meet in a hotel that very night. \n\n4. Schedule date, find that many ask you to send money to them even before meeting (rinsers). There’s apparently a shocking number that need fifty bucks to turn their cell phone back on so they can meet you \n\n5. Go on date with those that make it through the above steps. Expect for SBs to cancel last minute, be 30 min to an hour late, and sometimes show up completely under-dressed, not wearing makeup or otherwise putting minimal effort into the date. Expect to drive much of the conversation and for it to be like pulling teeth sometimes. Expect that many of them will also then ask (demand) for money at the end of the platonic date regardless if you are interested or not in them \n\n6. Of those that you like enough from the first date, try to start an arrangement and schedule another date with an allowance. Find that many of them are shocked at this stage that you wanted intimacy despite wanting an allowance and you being upfront about a needed mutual physical attraction. Find that many SBs feel this is too close to sex work for their liking \n\n7. Of those that get the dynamic, find that some of them are totally sexually boring and you’ll quickly lose the attraction. Others have terrible personalities that wear on you and make dates no fun\n\n8. Eventually land on one or two that you enjoy, you’re attracted to and who understand the dynamic. Success\n\n9. Spend up to tens of thousands on them plus gifts. \n\n10. Find that many of them are unable to keep a regular meetup schedule or even see you regularly. Find that others get too attached, have major personal life drama that bleeds into your life, or that they otherwise become a drain on the experience\n\n11. You or SB end things. You’ve maybe given her more than anyone else in her life (outside family).  You’ve hopefully gotten some great dates with someone gorgeous you became attached to. \n\n12. Repeat, go to number 1, because you had so much fun the first time\n\nThis is obviously snark and there are some great experiences to be had, but point is the bowl is really a shit show and really becoming barely worth it for any guy with other things in life",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/rbzcgg/so_you_want_to_be_a_sugar_daddy_the_recipe/",
    "score": 110,
    "upvote_ratio": 0.86,
    "created_utc": 1638992900.0,
    "num_comments": 130,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "Not one for the angry snark normally, but i admit I lol'd at this.  Nicely done",
            "author": "Gemini-Fox",
            "id": "hnrswd3",
            "parent_id": "t3_rbzcgg",
            "score": 13,
            "created_utc": 1638999911.0,
            "replies": []
        },
        {
            "body": "Congrats, I completely identify with your scheme. Even if it is a simplification and sometimes you save steps and filters, it is like that, exactly like that. And here in Spain it's the same: girls who disappear after two days, girls who after days of conversation don't dare to meet, girls who meet and you get a big disappointment because of their personality, girls who shortly before the date ask you for money in advance and if you tell them nicely no, they get offended or act aggrieved,... Girls that you get to bed with them and they suffer or are not at all participative, girls that seem wonderful but after three or four dates they \"don't feel ready\"... Uffffff, complicated world, and complicated job the one of Sugar Datting. But when you finnally get the girl... please don let her run away, my friend!!",
            "author": "Frederyc2",
            "id": "hnsqdi1",
            "parent_id": "t3_rbzcgg",
            "score": 11,
            "created_utc": 1639014324.0,
            "replies": [
                {
                    "body": "Your comment is really ruining my life plan to escape to the beaches of Barcelona or the Canary Islands and sugar until death.\n\nGuess these are just worldwide problems no matter where we sugar. You’re right it’s all worth it when you get a good SB though",
                    "author": null,
                    "id": "hnsrrcu",
                    "parent_id": "t1_hnsqdi1",
                    "score": 12,
                    "created_utc": 1639014932.0,
                    "replies": [
                        {
                            "body": "I legit lol’d at those first 8 words",
                            "author": "avibrator",
                            "id": "hnsva1g",
                            "parent_id": "t1_hnsrrcu",
                            "score": 5,
                            "created_utc": 1639016481.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Statistically speaking, the average number of dates a person needs to feel comfortable is 3. I mean, sexuality is definitely a big aspect of these relationships but companionship over and above that is too. So being that you’re not paying an escort for sex, you’re entering into a form of relationship and it’s understandable to take a few dates to build up that comfort level and connect a big before jumping into sex. Just my take on the matter anyways.",
                    "author": "Lucky_Ad3616",
                    "id": "hntnxoo",
                    "parent_id": "t1_hnsqdi1",
                    "score": 5,
                    "created_utc": 1639031656.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "It’s not been my experience but I’m sure there’s a lot of truth in what you said. I wouldn’t recommend sugaring to any man unless you’ve reached a point in your life where you have a fair bit of time on your hands and money is not really an object. Because it’s a _terrible_ investment in terms of both time and money.",
            "author": null,
            "id": "hnrkdit",
            "parent_id": "t3_rbzcgg",
            "score": 24,
            "created_utc": 1638996635.0,
            "replies": [
                {
                    "body": "Exactly, I think the thing I wasn’t prepared for was the time involved and the little games you have to watch out for. Many ways it can blow up in your face where you lose time or money",
                    "author": null,
                    "id": "hnrnnmq",
                    "parent_id": "t1_hnrkdit",
                    "score": 7,
                    "created_utc": 1638997891.0,
                    "replies": []
                },
                {
                    "body": "I dunno.  Once you understand the game, it can be kind of fun.  The chase and all, especially when you find someone worth spending time with.",
                    "author": "MrBuzzard",
                    "id": "hnrvqks",
                    "parent_id": "t1_hnrkdit",
                    "score": 7,
                    "created_utc": 1639001022.0,
                    "replies": []
                },
                {
                    "body": "I agree! I have had no such experiences.",
                    "author": null,
                    "id": "hnsdn85",
                    "parent_id": "t1_hnrkdit",
                    "score": 3,
                    "created_utc": 1639008634.0,
                    "replies": []
                },
                {
                    "body": "Sugaring is cheaper than vanilla dating from my experience. Well, maybe about the same. It will also drain far less of your time.",
                    "author": "AShatteredKing",
                    "id": "hntir7l",
                    "parent_id": "t1_hnrkdit",
                    "score": 1,
                    "created_utc": 1639028288.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "OP,  I have a queston on the \" show up completely under-dressed, not wearing makeup or otherwise putting minimal effort into the date. \"\n\nIn my personal experience -- not in dating per se, but just in meetings -- the more casually I dress  the more relaxed I am.  And this is very true for social situations. Though, if I dress better than usual, I'm more \"on\" and focused on selling my personality.\n\nFor students and creatives; as well as, really all of the the GenZ/youngest Milennial group, they might socialize dressed in a relaxed way.\n\nIf I could have everyone show up exactly as they dress normal, and no extra (and even no) makeup, I personally would like this best.\n\nSo -- the question: I know you were leaning into writing in an entertaining way (and succeeded,) but is there a formula reason for wanting the higher-caliber dress and makeup. Specifically, are you finding there is a correlation between this level of effort and the POT' internal processing that this SB /SD is getting real and that events are carrying them forward to a deal?",
            "author": "Hyceanplanet",
            "id": "hns18rp",
            "parent_id": "t3_rbzcgg",
            "score": 8,
            "created_utc": 1639003247.0,
            "replies": [
                {
                    "body": "You’re right, I was being a little hyperbolic for entertainment value. I honestly don’t need high class dress, heels, full make-up. I usually ask the girl what type of meetup she’d like though and if they chose “restaurant”, I’d expect them to not come in pajamas\n\nIn the last month I’ve picked up a girl who said she woke up 5 min before meeting me, threw on the first thing she could find, and kept apologizing for not brushing her teeth (I kissed her, it was true). Another girl showed up in sweats and slippers to a nice restaurant she helped pick. That’s the type of thing I want to avoid \n\nI shower, shave, make sure I smell nice and am dressed for the occasion for every date. I also often clean my entire house before a SB date just in case it ends at my place. I want to be attractive to the SB so it’s more that she put in some minimal effort too…like shoes instead of worn slippers. \n\nI like alt girls and all sorts so dress your style, but please just make a little effort to look like you want to be out in public. That’s it, bare minimum expectations",
                    "author": null,
                    "id": "hns5wn3",
                    "parent_id": "t1_hns18rp",
                    "score": 10,
                    "created_utc": 1639005200.0,
                    "replies": [
                        {
                            "body": "One reason why some commenters to your post seem to be missing the point -- or overlooking the point -- is that you seem to have high level sales experience.\n\nOne aspect I find immensely useful/clarifying is that you've structured the process into the sort of sales system that helps put the right context to the minute-by-minute ups and downs of what is a meandering, rejection-filled and circular process.\n\nWhat's not your point is whether X salesperson (SD) has Y or Z level of relative efficiency. Some salesperson in NYC with a grad degree from MIT will do better in tech device sales than another salesperson at the same company in Michigan with a state degree. These variances have nothing to do with whether the system design is good.\n\n\\--\n\nIf I can press a bit deeper on your casual vs dress reply (which was richly detailed and spot-on a direct response:)\n\n...And I realize there's no way you would have a solid answer for this ....so just intuitvely....:\n\nDo you find that how they dress -- even badly -- has any correlation to whether things work out with them? Young women have chaotic lives -- juggling so much stuff -- and their showing up, to my view (until you correct me, which I would appreciate) is their way of showing you that they really wanted to meet you. Otherwise they would have cancelled, realizing they just didn't have the focus/breathing room to get all the right pieces together....they don't have time to dress or brush their teeth.\n\nTo my view, the examples you give show someone who really wanted to meet you....hence I'm wondering if there is even a positivie correlation between the people who can barely pull it off to get there (making things work even though they are barefly above water.)\n\nThere's a cool scene in one of Will Smith's movies which underscores this point -- that, sometimes, if someone shows up to a stress meeting and they know they don't look their best, it's that they *really* want to be there. \n\n[https://youtu.be/UUDKEbX5OQw](https://youtu.be/UUDKEbX5OQw) (link to scene)",
                            "author": "Hyceanplanet",
                            "id": "hnsa196",
                            "parent_id": "t1_hns5wn3",
                            "score": 2,
                            "created_utc": 1639007007.0,
                            "replies": [
                                {
                                    "body": "I'm afraid I'd have to agree on OP with this one. While your counter argument is valid, showing up dressed so casually you may as well be wearing pjs, and have it reasoned as \"yes but she/they *really really* want to be there, because you're important!\" Just really isn't right. \n\nShowing up because you really want to be there is of course the truth. That is the point of the meeting. And yes, our lives do get chaotic. I will openly admit I've done similar things, (though not perhaps to such an extent where I showed up to an important meeting in slippers and sweats) where I prioritized comfort over aesthetic. \n\nBut if, as you say, this woman/person really and truly felt you as the POT were so important that they had to meet you no matter what, they should have still put in effort. \n\nI didn't memories which number this is under, but if the lady that OP mentioned in his earlier replies, woke up 5mins before their meeting, she could have called (hoping she did) to apologize for being tardy, and that she'd be there in XY minutes. \n\nGiving herself enough time to run some dry shampoo through her hair, put on some light make up, picked a nicer outfit, brushed her teeth, and met OP looking like she wanted to be there and *showing* that she wanted to be there. \n\nIt happens. Sometimes life is cruel to all your carefully laid out plans. \n\nBut regardless, meeting a POT for the 1st time is really more akin to a job interview (hence the stress). And I don't know about other women, but even if I didn't want to be there, I'd still show up, and be dressed appropriately. \n\nI never got to be an SB though I've always wanted to be one. I wouldn't have minded the intimacy, and honestly an allowance would have helped so many of my current financial issues. \n\nBut SB type relationships aren't really a thing in my country. Well, they are, but only with a very very specific looking type of woman, and sadly, I am not such a woman. And online SDs are majorly a scam, and not plausible anyway because of the long distance. \n\nBut I know that had I been lucky enough to have someone interested in me like that, I would have put in the maximum of all efforts. Because they chose me, and chose to help me. And the next best thing I can do to show gratitude is do my best to meet their expectations and make them happy and content. \n\nSo sad that some women take this chance for granted. \n\nSorry for the rant 😅",
                                    "author": "Rowan-the-Girlfriend",
                                    "id": "hnsx5ie",
                                    "parent_id": "t1_hnsa196",
                                    "score": 8,
                                    "created_utc": 1639017313.0,
                                    "replies": [
                                        {
                                            "body": "[deleted]",
                                            "author": null,
                                            "id": "hnuav78",
                                            "parent_id": "t1_hnsx5ie",
                                            "score": 2,
                                            "created_utc": 1639050272.0,
                                            "replies": [
                                                {
                                                    "body": "What I post is part of my part time job to get some influx of cash. That does not mean that I wouldn't like to actually meet someone and have them help me in such a way that what I do on the side is no longer necessary to help pay my bills, or buy a Christmas present for my little niece and nephews. \n\nMy \"exuberant\" photos don't correlate to what I was speaking of. So they shouldn't be used in your argument in the first place.",
                                                    "author": "Rowan-the-Girlfriend",
                                                    "id": "hnubeeq",
                                                    "parent_id": "t1_hnuav78",
                                                    "score": 2,
                                                    "created_utc": 1639050657.0,
                                                    "replies": [
                                                        {
                                                            "body": "[deleted]",
                                                            "author": null,
                                                            "id": "hnuclzm",
                                                            "parent_id": "t1_hnubeeq",
                                                            "score": 2,
                                                            "created_utc": 1639051520.0,
                                                            "replies": [
                                                                {
                                                                    "body": "I am not so fragile that a misunderstanding of flowery language will hurt my glass-like feelings. I also know what exuberant means. I grew up in North America, English is my first language. And though I now live back in my hometown, in the country of my birth here in Europe, I can assure you there is no cultural gap between us. \n\nI am accustomed to men believing certain things about what I currently do, and that's what your comment sounded like to me. Which is why I said what I do on the side shouldn't have had any bearing to what I was referring to in my previous comments. What I said stands. \n\nSuffice to say I write a lot in my day job too, as a freelance editor, among other things. But I prefer being clear with my words. \n\nAs one writer to another, perhaps take that as an approach, rather than diplomatically trying to bounce around from one flowery word to another, to avoid further confusions in future.",
                                                                    "author": "Rowan-the-Girlfriend",
                                                                    "id": "hnud9wq",
                                                                    "parent_id": "t1_hnuclzm",
                                                                    "score": 4,
                                                                    "created_utc": 1639051975.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Dude you need to screen better. I’ve had a couple of bad experiences but nothing this crazy.\n\n\nAnd yeah some people are hard to schedule with, I just find someone else /shrug\n\n\nI do agree on the whole not getting attached thing. I’ve done it / had it happen to me and doesn’t end well",
            "author": "sdthrowaway568",
            "id": "hnrf3ug",
            "parent_id": "t3_rbzcgg",
            "score": 14,
            "created_utc": 1638994659.0,
            "replies": [
                {
                    "body": "How long have you been doing this? I don’t encounter all these things every time I try to find a SB, but every one of these things have happened to me at least once before. I mostly go for girls under 25, many of which are new to being a SB, so that’s a big part of the issues. \n\nPerhaps I could screen better but many girls eliminate themselves during the above steps. In essence, that is screening",
                    "author": null,
                    "id": "hnrinjp",
                    "parent_id": "t1_hnrf3ug",
                    "score": 8,
                    "created_utc": 1638996005.0,
                    "replies": [
                        {
                            "body": "Girls under 25 who have no idea what they're doing? No wonder why you're experience is so bad...",
                            "author": null,
                            "id": "hns25p7",
                            "parent_id": "t1_hnrinjp",
                            "score": 12,
                            "created_utc": 1639003623.0,
                            "replies": []
                        },
                        {
                            "body": "Like 5 years. Yeah I did see that you go for under 25 which is my demographic too. I usually try to set up a meeting for same or next day after a few messages at semi nice restaurant or drink place. Obviously a lot can’t meet same day but those that do are usually legit. If I set up a meeting that isn’t same or next day, I accept that there is ~75% chance it won’t go through",
                            "author": "sdthrowaway568",
                            "id": "hnrj6uo",
                            "parent_id": "t1_hnrinjp",
                            "score": 3,
                            "created_utc": 1638996205.0,
                            "replies": [
                                {
                                    "body": "If they cannot get to my side of town then I cannot do anything for them.",
                                    "author": "Major-Editor-2016",
                                    "id": "hns9df2",
                                    "parent_id": "t1_hnrj6uo",
                                    "score": 3,
                                    "created_utc": 1639006710.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Agree with you... a couple of odd meets but 80% great ones. Sure I've never found Miss Perfect but had lots of fun along the way. All meets have been in Europe or Asia...never done this in America.",
                    "author": null,
                    "id": "hnucaol",
                    "parent_id": "t1_hnrf3ug",
                    "score": 1,
                    "created_utc": 1639051304.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "If it's so miserable, why do it for seven years...???",
            "author": "BarrierToEntry",
            "id": "hnrgj4j",
            "parent_id": "t3_rbzcgg",
            "score": 11,
            "created_utc": 1638995202.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "hnry7of",
                    "parent_id": "t1_hnrgj4j",
                    "score": 6,
                    "created_utc": 1639002004.0,
                    "replies": [
                        {
                            "body": "I just imagine this being said with the satirical personality of Brain from Pinky and the Brain",
                            "author": "avibrator",
                            "id": "hnsuiu6",
                            "parent_id": "t1_hnry7of",
                            "score": 2,
                            "created_utc": 1639016148.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "As I said “there are some great experiences to be had”. The point is that there is a lot of bullshit to deal with at every stage. \n\nI’ve encountered all these things and also met amazing women, fallen in love, and had the best sex of my life with model-level attractive women. It wasn’t always easy. New SDs especially shouldn’t think their money will buy them an easy experience",
                    "author": null,
                    "id": "hnrhvqz",
                    "parent_id": "t1_hnrgj4j",
                    "score": 13,
                    "created_utc": 1638995714.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "You forgot .... get stood up repeatedly at the scheduled M&G",
            "author": "AFSMSgt",
            "id": "hnrf5ik",
            "parent_id": "t3_rbzcgg",
            "score": 14,
            "created_utc": 1638994676.0,
            "replies": [
                {
                    "body": "Funny enough that happened to me this very week so I should add that too. Girl actually stood me up despite confirming 2 hrs before and helping choose a place",
                    "author": null,
                    "id": "hnri5oi",
                    "parent_id": "t1_hnrf5ik",
                    "score": 5,
                    "created_utc": 1638995817.0,
                    "replies": [
                        {
                            "body": "When I was first using SA, I was stood up 3 times by the same lady. In between, she apologized profusely and begged for another chance.\n\nThe rest of the story....a year later she contacts me and wants to meet. I say come to my home Sunday morning 8 AM, figuring no way. Damn if she doesn't show up and we had a 9 month SR.",
                            "author": "AFSMSgt",
                            "id": "hnrl30o",
                            "parent_id": "t1_hnri5oi",
                            "score": 9,
                            "created_utc": 1638996903.0,
                            "replies": [
                                {
                                    "body": "Whoa that’s a crazy story. Like I can’t believe she showed, especially since you made it the morning lol. I don’t know what it is with some SBs but sometimes they just need something to click so they show up and take it seriously. \n\nSimilarly I had a girl I messaged off and on  that never would make time to meet up. One day over a year later she did finally agree. I ended up having a 10 month arrangement with her. I have no idea why it worked then and not before",
                                    "author": null,
                                    "id": "hnro64u",
                                    "parent_id": "t1_hnrl30o",
                                    "score": 4,
                                    "created_utc": 1638998090.0,
                                    "replies": [
                                        {
                                            "body": "Bitches be crazy. The big bang theory mail man had it right.",
                                            "author": "AFSMSgt",
                                            "id": "hnsqspx",
                                            "parent_id": "t1_hnro64u",
                                            "score": 2,
                                            "created_utc": 1639014510.0,
                                            "replies": [
                                                {
                                                    "body": "Honestly sometimes it might just be that lol. They probably think we’re crazy ourselves",
                                                    "author": null,
                                                    "id": "hnsrbze",
                                                    "parent_id": "t1_hnsqspx",
                                                    "score": 1,
                                                    "created_utc": 1639014744.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "To borrow an old phrase \n\nSimplicity is the ultimate sophistication",
                                    "author": "pinotandsugar",
                                    "id": "hnrpbnd",
                                    "parent_id": "t1_hnrl30o",
                                    "score": 4,
                                    "created_utc": 1638998529.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "that is why I require them to get to my side of town and text or call when they are 20 minutes away.\n\nAnd then when they text at the 20 min mark I ask them to tell me what cross road or land mark they can see.\n\nEvery girl I drove a distance to meet had too many problems to be useful to me. (grossly inflated ego, unconscionable financial demand, no car, alcohol issues...) \n\nRemember: they are the ones with the time.",
                            "author": "Major-Editor-2016",
                            "id": "hns90ms",
                            "parent_id": "t1_hnri5oi",
                            "score": 4,
                            "created_utc": 1639006556.0,
                            "replies": [
                                {
                                    "body": "Smart, I’m honestly always offering to come to them with the hopes they will be more likely to not flake. \n\nSeems fair to ask them to come to me if they are actually invested and want it to work though",
                                    "author": null,
                                    "id": "hnsa6w1",
                                    "parent_id": "t1_hns90ms",
                                    "score": 2,
                                    "created_utc": 1639007077.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "This was funny. The only part i disagree with is when their life is a mess and it starts to bleed into yours. That's what you signed up for. If these girls had their shit together they wouldn't be on seeking. Just choosing which ones you'll help is the balancing act part.",
            "author": "No-Pin-9988",
            "id": "hnvbk0n",
            "parent_id": "t3_rbzcgg",
            "score": 4,
            "created_utc": 1639068130.0,
            "replies": [
                {
                    "body": "Good point. I’m willing to put up with some of their life drama but when I find out things like they have a drug problem or a jealous boyfriend (both have happened), I’m out. That’s more what I was referring to",
                    "author": null,
                    "id": "hnvyhuv",
                    "parent_id": "t1_hnvbk0n",
                    "score": 1,
                    "created_utc": 1639077098.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "This is great.\n\nSLF gets at least one post a day on \"How can I become a sugar daddy?\" and this is the answer.\n\nI will just start posting a link to this post whenever that happens.\n\n&#x200B;\n\nNow all we need is for some lady to make a post \"So you want to be a sugar baby? The recipe\"",
            "author": "LuckyINTJ",
            "id": "hnrch1o",
            "parent_id": "t3_rbzcgg",
            "score": 9,
            "created_utc": 1638993649.0,
            "replies": [
                {
                    "body": "Yes exactly. I am actually looking forward to a Sugar Baby version now!",
                    "author": "chemistryromance",
                    "id": "hns9dus",
                    "parent_id": "t1_hnrch1o",
                    "score": 5,
                    "created_utc": 1639006715.0,
                    "replies": []
                },
                {
                    "body": "I think we would be better off with the ladies offering their thoughts on  good and bad things SD's do .  \n\nWhile there are lots of ideas it's important to keep in mind that the approach to a 38 yo SB out of her second marriage should be very different than that appropriate for an aspiring SB with minimal social and sexual experience.",
                    "author": "pinotandsugar",
                    "id": "hnrnkug",
                    "parent_id": "t1_hnrch1o",
                    "score": 8,
                    "created_utc": 1638997860.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "This post convinced me to stick with hookers",
            "author": "oyxyjuon",
            "id": "hnrka70",
            "parent_id": "t3_rbzcgg",
            "score": 9,
            "created_utc": 1638996602.0,
            "replies": [
                {
                    "body": "Lol honestly they are a lot easier, especially if you just want sex.",
                    "author": null,
                    "id": "hnrn9kl",
                    "parent_id": "t1_hnrka70",
                    "score": 4,
                    "created_utc": 1638997735.0,
                    "replies": []
                },
                {
                    "body": "Can't sleep with hookers any more after trying sugar. The experience feels too impersonal.\n\nWith a SR she knows your name, your background, your favourite cocktail. She asks you what you find sexy and buys lingerie.\n\nWhen you fuck she's wet without lube, and actually wants to hang out afterwards rather than leaving.\n\nDifferent strokes for different folks",
                    "author": null,
                    "id": "hnxd8jq",
                    "parent_id": "t1_hnrka70",
                    "score": 2,
                    "created_utc": 1639098296.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "\\#4! Happens a lot!",
            "author": "AARCEntertainment",
            "id": "hns13fk",
            "parent_id": "t3_rbzcgg",
            "score": 3,
            "created_utc": 1639003185.0,
            "replies": []
        },
        {
            "body": "Spot on. Sad but true. \n\nSteps 2-5 are a huge time drain and can be exhausting. Step 7 often causes disappointment in the amount of effort put in to get that far (nothing worse than just laying there staring into space with a hurry and get it over with vibe). BUT, it’s Step 8 that makes it all worthwhile and keeps drawing me back in!",
            "author": null,
            "id": "hnsre79",
            "parent_id": "t3_rbzcgg",
            "score": 3,
            "created_utc": 1639014772.0,
            "replies": []
        },
        {
            "body": "It isn’t all that bleak.  It’s a typical sales funnel, with about 50% dropping out at each stage.  You just tune your process, work the numbers, and enjoy the experience",
            "author": "robhudsondfw",
            "id": "hnt1kvq",
            "parent_id": "t3_rbzcgg",
            "score": 3,
            "created_utc": 1639019318.0,
            "replies": [
                {
                    "body": "100% I always think of finding a sugar baby as a sales funnel where the entry point is a cold call",
                    "author": "sdthrowaway568",
                    "id": "hntjwuh",
                    "parent_id": "t1_hnt1kvq",
                    "score": 2,
                    "created_utc": 1639029001.0,
                    "replies": []
                },
                {
                    "body": "That’s very zen. I still had excited about the new gorgeous girls and then bummed when they are actually a scam or disappointment. All part of the chase I guess",
                    "author": null,
                    "id": "hnt1rw4",
                    "parent_id": "t1_hnt1kvq",
                    "score": 4,
                    "created_utc": 1639019410.0,
                    "replies": [
                        {
                            "body": "If you tune your process right, you can catch most of that.\n\n1st, schedule a M&G quickly.  That filters out people who have no intent on meeting or don’t look reasonably like their photos.\n\nTo filter out no-shows, either double-book the M&G or tell them to text you when they are on their way, and then don’t leave until you get the text.\n\nAt every point in the process, there are things you can do to filter out people who aren’t good candidates for SR.\n\nWhat you are left with is good candidates, and fun exploring the opportunities.",
                            "author": "robhudsondfw",
                            "id": "hnt2o3w",
                            "parent_id": "t1_hnt1rw4",
                            "score": 3,
                            "created_utc": 1639019825.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "hntkncq",
            "parent_id": "t3_rbzcgg",
            "score": 3,
            "created_utc": 1639029464.0,
            "replies": [
                {
                    "body": "Hmm well I wrote this as a SD but it’s hard for SBs too. There are lots of men hoping to use SA to pretend to be SD but who can’t afford it (salt daddies). There are also types of women that do well in the bowl. You can post a profile review here and people can give you input",
                    "author": null,
                    "id": "hnw5ai7",
                    "parent_id": "t1_hntkncq",
                    "score": 1,
                    "created_utc": 1639079807.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "This makes SB sound like normal dating",
            "author": null,
            "id": "hnui68h",
            "parent_id": "t3_rbzcgg",
            "score": 3,
            "created_utc": 1639054975.0,
            "replies": [
                {
                    "body": "I honestly think a huge number of SBs want to normal date their SD while also expecting an allowance. They don’t say it like that, but that’s what is expected. \n\nIf you’re a SD and you can vanilla date women you like for free, might as well since it’s arguably a similar amount of work while saving your cash",
                    "author": null,
                    "id": "hnw29aa",
                    "parent_id": "t1_hnui68h",
                    "score": 2,
                    "created_utc": 1639078610.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Honestly it's really not been worth the effort in my book.  I had to find a new hobby.",
            "author": "timmyj0044",
            "id": "hnvoqqm",
            "parent_id": "t3_rbzcgg",
            "score": 3,
            "created_utc": 1639073203.0,
            "replies": [
                {
                    "body": "I take regular breaks for this very reason. I tend to get an SA membership for a month and then need 3-6 months to recover from it (and enjoy the SBs)",
                    "author": null,
                    "id": "hnvpxvo",
                    "parent_id": "t1_hnvoqqm",
                    "score": 1,
                    "created_utc": 1639073697.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "This is 1000 pct accurate and couldnt have written better myself.",
            "author": "Buckeyechamp21",
            "id": "hnrhuaq",
            "parent_id": "t3_rbzcgg",
            "score": 5,
            "created_utc": 1638995700.0,
            "replies": []
        },
        {
            "body": "Controversial opinion: sometimes it’s a good (or great) idea to send a SB money before your first meeting. Examples: 1) she can’t afford the travel expenses to get to you. My first (and only) SD lived two hours away from me and the only way for me to get to him was a $40 bus ($80 round trip). So I asked for that money before going to meet him, even the first time. If you are going to do this just ask for photo proof that they are headed to you if you’re suspicious \n2) you want to prove to her that you are not a time waster/Splenda daddy. Maybe send her $25 for her weekly Starbucks or $60 to get her nails done.\nApparently there’s a lot of scammers on SA now but I remember how good and cared for this made me feel when my SD did this before we had even met :). Some of you might say that it was a rookie move but it sealed the deal for me and made me feel comfortable enough to take the plunge and go meet my first SD!",
            "author": null,
            "id": "hnslx6l",
            "parent_id": "t3_rbzcgg",
            "score": 7,
            "created_utc": 1639012354.0,
            "replies": [
                {
                    "body": "Really good points and I’m glad you shared as a SB. I honestly don’t have a hard “no money before ever” rule but many times girls have asked for it before and abused it by standing me up or likely never actually being a girl (a scammer) \n\nI usually pay for reasonable expenses to travel and a huge amount of whether I’m willing to do it beforehand is how cool the SB has been with me over text. If she shows zero interest in getting to know me, focuses on the money part of the arrangement, or doesn’t want to talk about the details that matter, then usually I won’t risk it. \n\nA girl that’s great to talk to, really attractive, and seems genuinely interested in me can get almost whatever she wants out of me, including money beforehand. If you’re a smart woman, I’d play that way and get me wrapped around your little finger and take 10K+ over a few months. Sadly women often chose scammy shortcuts instead",
                    "author": null,
                    "id": "hnsqski",
                    "parent_id": "t1_hnslx6l",
                    "score": 7,
                    "created_utc": 1639014508.0,
                    "replies": [
                        {
                            "body": "Yes I think it really helped that I was genuinely interested in my SD :). I kind of broke all the rules and started vanilla dating him and he has been my partner for two years now haha. My entire life is funded by him and I also love him very much, so needless to say sometimes sending ahead of time can benefit both sides, and isn’t always a scam.",
                            "author": null,
                            "id": "hnsroji",
                            "parent_id": "t1_hnsqski",
                            "score": 3,
                            "created_utc": 1639014898.0,
                            "replies": [
                                {
                                    "body": "Love this story and huge congrats for finding someone amazing through all the pitfalls I listed out. Things are so much better when you’re actually interested in your sugar partner enough for a relationship like that \n\nI have a rough time with monogamy and having just one girl, but what you have is kinda the dream after I settle down.",
                                    "author": null,
                                    "id": "hnsspub",
                                    "parent_id": "t1_hnsroji",
                                    "score": 2,
                                    "created_utc": 1639015358.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I haven’t bothered looking since summer 2020. It was so bad it turned me to vanilla. Turns out, I do rather well when I post pics. \n\nWhile part of me misses the nubile hot college girl sex, I won’t be going back to SA until my vanilla life quiets down *and* I see some indication of the bowl returning to its former glory. But with all the stuff that SA has done, I’m more pessimistic about that prospect.",
            "author": "sdthrowaway006",
            "id": "hnshk0s",
            "parent_id": "t3_rbzcgg",
            "score": 4,
            "created_utc": 1639010385.0,
            "replies": [
                {
                    "body": "Summer 2020 was rough for me too, largely because of COVID and the amount of girls who used that to push for online only (or who didn’t join in the first place). \n\nI’d say it’s better than that now, but not a huge amount. Now I think that many of the young SBs have seen the rise of onlyfans and other online money making opportunities that proliferated during COVID so they expect easy money with no work. They see this shit  on their social media feeds all the time. It’s made “mutually beneficial” go close to extinction \n\nIf you have that much vanilla success, I’d stick with that. It’s arguably not as much work and it’s also free",
                    "author": null,
                    "id": "hnsiovo",
                    "parent_id": "t1_hnshk0s",
                    "score": 1,
                    "created_utc": 1639010900.0,
                    "replies": [
                        {
                            "body": "That’s why I’m sticking with vanilla for now. Saved an extra ~60k since COVID began. It’s remarkable how much I used to spend in this lifestyle.",
                            "author": "sdthrowaway006",
                            "id": "hnt6av7",
                            "parent_id": "t1_hnsiovo",
                            "score": 1,
                            "created_utc": 1639021554.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I go for girls who present themselves well both physically and verbally. The idea of targeting \"college aged\" or under a certain age feels pretty creepy to me. Imho.",
            "author": "No-Reveal8042",
            "id": "hntisic",
            "parent_id": "t3_rbzcgg",
            "score": 4,
            "created_utc": 1639028310.0,
            "replies": [
                {
                    "body": "Personally if I go for older women, they are the women I can vanilla date because I’m not too much older for a SD\n\nTo be clear, I’m not just in it to fetishize younger women. I just find that both men and women generally don’t take care of their bodies. The accumulated damage adds up as people age and it effects their looks. A 20 year old can be eating fast food and smoking every day and look great, there has been no time for damage to accumulate. \n\nMy goal is to go for the most attractive people possible and just so happens if you want a girl with an amazing body, they are often younger (for reasons above). I do consider very attractive older women that have taken care of themselves, but usually for vanilla dating (if I can get them)",
                    "author": null,
                    "id": "hnw61it",
                    "parent_id": "t1_hntisic",
                    "score": 3,
                    "created_utc": 1639080101.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Yeah it sounds like you should save yourself some time and whining and find a lifestyle that better fits your needs. Perhaps escorts",
            "author": "c0rnstarr",
            "id": "hnrsw8r",
            "parent_id": "t3_rbzcgg",
            "score": 7,
            "created_utc": 1638999909.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "hnruwcj",
                    "parent_id": "t1_hnrsw8r",
                    "score": 5,
                    "created_utc": 1639000689.0,
                    "replies": [
                        {
                            "body": " thats interesting, i hadnt considered different lifestyles attracting different incomes.",
                            "author": "c0rnstarr",
                            "id": "hnrw04t",
                            "parent_id": "t1_hnruwcj",
                            "score": 2,
                            "created_utc": 1639001125.0,
                            "replies": []
                        },
                        {
                            "body": "[removed]",
                            "author": null,
                            "id": "hnsuncp",
                            "parent_id": "t1_hnruwcj",
                            "score": 2,
                            "created_utc": 1639016202.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Why escorts? I want an actual relationship, one that involves sex, but not just sex. \n\nAnd I kinda wish anytime someone complained about the process of getting a SB it wasn’t immediately “get an escort”. Escorts really aren’t the answer.",
                    "author": null,
                    "id": "hnsu9f6",
                    "parent_id": "t1_hnrsw8r",
                    "score": 2,
                    "created_utc": 1639016035.0,
                    "replies": [
                        {
                            "body": "It just sounds like you simply don’t like human aspects to women in this kind of dynamic, and honestly doesn’t sound like you want an actual relationship or enjoy this process. I think escorts would simplify everything you’re complaining about",
                            "author": "c0rnstarr",
                            "id": "hntb34l",
                            "parent_id": "t1_hnsu9f6",
                            "score": 6,
                            "created_utc": 1639024002.0,
                            "replies": [
                                {
                                    "body": " No, that’s not it and don’t get how you’re getting that interpretation. \n\nExample, step 4, why would you interpret that I don’t like human aspects of women or “this dynamic” when it seems pretty clear I’m complaining about rinsers specifically? I don’t like SBs wasting my time and asking for money before they’ve even met me. I don’t like scams. I’m sure you don’t like scammer SDs either and I’m not suggesting you find a “John”\n\nThere are good SBs that don’t do any of these things. I have a couple of them right now, we have a relationship. They didn’t try to scam me or waste my time so it works.\n\nIf you think the disrespect, wasting other people’s  time, or scamming are a central part of this “dynamic” you’re probably a terrible SB",
                                    "author": null,
                                    "id": "hntlpa1",
                                    "parent_id": "t1_hntb34l",
                                    "score": 0,
                                    "created_utc": 1639030147.0,
                                    "replies": [
                                        {
                                            "body": "I seem to have struck a chord. \n\nI’m not saying anything about scamming, not sure where you got that from. I’m saying that the entirety of this post is a negative rant about how SBs make this process horrible for you. You say you want a relationship and then complain when they “get too attached”, they’re always sexually boring or can’t hold a conversation, etc. you say yourself it’s barely worth it. \n\nSoooo yeah, sounds like it’s time to switch things up",
                                            "author": "c0rnstarr",
                                            "id": "hnuvf8o",
                                            "parent_id": "t1_hntlpa1",
                                            "score": 5,
                                            "created_utc": 1639061568.0,
                                            "replies": [
                                                {
                                                    "body": "I don’t have enough space in a single Reddit post to describe all my feelings about sugaring but many of them are positive. This a snarky slice at the difficulties that come with it, mostly so newer SDs can see where it fails. I like sugaring enough to keep at it; the successes make it worth it\n\nSBs should always ask “why isn’t this guy just vanilla dating instead of spending money”. For me, it’s that I don’t want to be anyone’s boyfriend or spend a huge amount of time together. I would vanilla date if I wanted that. So yes, I want a relationship with less attachment than a GF and I think that should be okay in sugaring. I don’t like when SBs don’t respect that",
                                                    "author": null,
                                                    "id": "hnw1lwi",
                                                    "parent_id": "t1_hnuvf8o",
                                                    "score": 1,
                                                    "created_utc": 1639078352.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "What if I like dating older men and sugaring just sweetens the deal (pun intended)?",
            "author": "donnaladonna",
            "id": "hntocat",
            "parent_id": "t3_rbzcgg",
            "score": 2,
            "created_utc": 1639031939.0,
            "replies": [
                {
                    "body": "Lol to the pun. In that case, you’re likely a great SB and you probably don’t do many of these things. I’d say that you should probably tell SDs you want to view it like normal dating is all. \n\nPersonally I sugar date because I want a close relationship but don’t want many of the hassles of having a GF.",
                    "author": null,
                    "id": "hnw4giz",
                    "parent_id": "t1_hntocat",
                    "score": 3,
                    "created_utc": 1639079478.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "It is a hot mess. Even as an SB the things and experiences some pot Sd tell me is wild. Apparently there’s a shit ton of YouTube videos that tell you “how to become a sugar baby”. I couldn’t even get through more that a couple of minutes of the few I watched. Cringe to the max! They pretty much mentally demean you into nothing more than a ready and willing atm not realizing there is actually a human fucking being on the other end of the phone. Then want to be all up in fury when they’ve done nothing but half ass their effort then get treated like a simple cocksleeve. Like sweetheart, no.",
            "author": "avibrator",
            "id": "hnstupe",
            "parent_id": "t3_rbzcgg",
            "score": 2,
            "created_utc": 1639015859.0,
            "replies": []
        },
        {
            "body": "6. Sexually boring, what are you expecting, barebacking backflips? Haha. A lot of them are still figuring out their sexuality. You mentioned you go for 18-22 year olds. They are going to be a bit awkward at times. \n\n\nI did have a good laugh. SBs with the selling pictures and online relationships are a bit delusional.",
            "author": null,
            "id": "hnswt4z",
            "parent_id": "t3_rbzcgg",
            "score": 2,
            "created_utc": 1639017161.0,
            "replies": [
                {
                    "body": "I’ve had two girls that said they didn’t give oral, ever. I’ve had many girls who have never had an orgasm and have no idea how to get there. I’ve had girls that just regard sex as something they put up with and thought they didn’t enjoy. \n\nThose last two starfish and just want to lay there until you’re done. I want participation at bare minimum…with a couple backflips",
                    "author": null,
                    "id": "hnt0dj2",
                    "parent_id": "t1_hnswt4z",
                    "score": 2,
                    "created_utc": 1639018766.0,
                    "replies": [
                        {
                            "body": "Not giving head is a safety choice. You can get nearly every STI through head that you can from sex.",
                            "author": "HailToTheQuinn",
                            "id": "hnt5w3l",
                            "parent_id": "t1_hnt0dj2",
                            "score": 7,
                            "created_utc": 1639021355.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "13) Become grumpy old man and write three page essays on Reddit. Completely ignore that women have their own reasons to complain.",
            "author": "HoosierSdaddie",
            "id": "hnrtmga",
            "parent_id": "t3_rbzcgg",
            "score": 8,
            "created_utc": 1639000194.0,
            "replies": [
                {
                    "body": "Write your own post then? \n\nThis isn’t “steps to be a SB”. It’s shitty out there for SBs too and they deal with a lot of things themselves. I’m not denying that. I could make my own post about SBs and what they deal with but I’m not one, so it probably wouldn’t be accurate\n\nDefensive much though? Me pointing out the ways things go wrong doesn’t make me a grump, I’ve lived these experiences. I’ll post more and you’ll hear about successes too.",
                    "author": null,
                    "id": "hnrx8wl",
                    "parent_id": "t1_hnrtmga",
                    "score": 3,
                    "created_utc": 1639001620.0,
                    "replies": [
                        {
                            "body": "Sounds like you need to get la... oh, I get it now.",
                            "author": "HoosierSdaddie",
                            "id": "hns1omf",
                            "parent_id": "t1_hnrx8wl",
                            "score": 4,
                            "created_utc": 1639003428.0,
                            "replies": [
                                {
                                    "body": "La…dies?\nLa..ughed at ?\nLa..proscopic surgery ?\nLa..p dances ?\nLa..minated ? \nLa..sting love?",
                                    "author": null,
                                    "id": "hns727m",
                                    "parent_id": "t1_hns1omf",
                                    "score": 3,
                                    "created_utc": 1639005693.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Age shaming at its very best! How do you know OP is a GOM? Just because he is an SD? Maybe you ought to seek out better and more youthful SDs.",
                    "author": null,
                    "id": "hnsdum1",
                    "parent_id": "t1_hnrtmga",
                    "score": 1,
                    "created_utc": 1639008727.0,
                    "replies": [
                        {
                            "body": "Wow. You are incredibly detail oriented.",
                            "author": "HoosierSdaddie",
                            "id": "hos39vb",
                            "parent_id": "t1_hnsdum1",
                            "score": 1,
                            "created_utc": 1639662842.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "No offense man, but are you ugly?\n\nDo you mind sharing your profile if you want real feedback.\n\nMaybe I'm an anomaly:\n\nI paid for SA for a month, went on only 2 meet & greets (in the first two weeks).\n\nHit it off with both women. \n\nCommenced to seeing them each 1X/week, and textng everyday: memes, selfies, cute \"thinking of you\" messages, etc.\n\nI cancelled my SA subscription, and hid my profile, but didn't delete it off the site.\n\nIn 4 weeks, dozens of women favorited me or messaged me first. \n\n98% of them much hotter and younger than the typical 35 year old 4s and 5s I meet on apps.\n\nWhat are you stats, if you don't mind me asking? Age, Height, weight, income, etc.",
            "author": null,
            "id": "hnrcey7",
            "parent_id": "t3_rbzcgg",
            "score": 4,
            "created_utc": 1638993627.0,
            "replies": [
                {
                    "body": "Sounds like you’re not being picky enough.",
                    "author": null,
                    "id": "hnrha2h",
                    "parent_id": "t1_hnrcey7",
                    "score": 2,
                    "created_utc": 1638995487.0,
                    "replies": [
                        {
                            "body": "I thought so too. I don't message that much but have great success on setting up M&G and not getting flaked. You can say that my filtering method is a bit more polished.",
                            "author": "HistoricalMap8698",
                            "id": "hnrlfcy",
                            "parent_id": "t1_hnrha2h",
                            "score": 3,
                            "created_utc": 1638997033.0,
                            "replies": []
                        },
                        {
                            "body": "what makes you say that?\n\nI liked both women, and the feeling was mutual.",
                            "author": null,
                            "id": "hnrw7mi",
                            "parent_id": "t1_hnrha2h",
                            "score": 2,
                            "created_utc": 1639001208.0,
                            "replies": [
                                {
                                    "body": "I’ll go on tons of M&G’s and I end up not liking them in person or they’re just ok. Id rather have a SR that is a 10/10’ out of my league than just an average looking girl.",
                                    "author": null,
                                    "id": "hns3vxy",
                                    "parent_id": "t1_hnrw7mi",
                                    "score": 0,
                                    "created_utc": 1639004339.0,
                                    "replies": [
                                        {
                                            "body": "I explained that I went 2/2 and set up relationships with  women that I already described as young, hot, and attentive-\n\nand you made this about you and a hypothetical average looking girl lmao.",
                                            "author": null,
                                            "id": "hnshio9",
                                            "parent_id": "t1_hns3vxy",
                                            "score": 3,
                                            "created_utc": 1639010368.0,
                                            "replies": [
                                                {
                                                    "body": "Ok",
                                                    "author": null,
                                                    "id": "hnshlrh",
                                                    "parent_id": "t1_hnshio9",
                                                    "score": 0,
                                                    "created_utc": 1639010407.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "I don’t share detailed information for anonymity reasons but I’m between 30-40, 5’11, 155 lbs, in good shape (abs and muscles but not a body builder), million+ net worth, allowance that is slightly above the average for my city. \n\nI only go for girls less than 25 (predominantly 18-22) and who is rate 8 or above. That is a big reason I deal with the BS this post \n\nYou have had some success but you can’t base it on being favorited. Being “favorited” means jack on there since there are many steps between that and actually getting a SB. \n\nTbh this post is more of a collection of all the things that go wrong at every step. I always have somewhere between 2-5 SBs and generally I’m happy with them. \n\nIf you do this long enough (7 years) you will experience all of these things regardless of who you are.",
                    "author": null,
                    "id": "hnreh6t",
                    "parent_id": "t1_hnrcey7",
                    "score": 4,
                    "created_utc": 1638994418.0,
                    "replies": [
                        {
                            "body": "People are taking your post too seriously and word for word. I quite enjoyed reading it and it's very common to come across these secnarios.",
                            "author": "chemistryromance",
                            "id": "hns6r1m",
                            "parent_id": "t1_hnreh6t",
                            "score": 6,
                            "created_utc": 1639005563.0,
                            "replies": [
                                {
                                    "body": "Thanks. I tried to say it’s snark, but people don’t see the humor in the frustration and are taking it seriously. Someone said I hate women because I posted this! Like damn",
                                    "author": null,
                                    "id": "hns7eyz",
                                    "parent_id": "t1_hns6r1m",
                                    "score": 3,
                                    "created_utc": 1639005845.0,
                                    "replies": [
                                        {
                                            "body": "Focus on the good comments, and there are quite a few on your post, but I get it, it's difficult to ignore the negative ones when they come as a personal attack. Also remember to get your blood pressure checked tomorrow :)",
                                            "author": "chemistryromance",
                                            "id": "hns8n3f",
                                            "parent_id": "t1_hns7eyz",
                                            "score": 2,
                                            "created_utc": 1639006388.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "Are you me? lol. About the same stats but I go for girls 18-40 (bigger range) and super picky 8 or above as well. If we're paying $$$ then def want to make it worth! But great post!\n\nI do have SBs now that now I see platonically just cause those girls are fun to be around with (as they also have fun with me). Also, it's always good to surround yourself with beautiful women!",
                            "author": "HistoricalMap8698",
                            "id": "hnrl8xr",
                            "parent_id": "t1_hnreh6t",
                            "score": 3,
                            "created_utc": 1638996965.0,
                            "replies": []
                        },
                        {
                            "body": "You're going for the worst demographic and having the worst experience.",
                            "author": "JeaneyBowl",
                            "id": "hnrrls3",
                            "parent_id": "t1_hnreh6t",
                            "score": 8,
                            "created_utc": 1638999404.0,
                            "replies": [
                                {
                                    "body": "But they’re soooo hot lol\n\nYou’re right though, to a degree I bring the pain on myself. This is snarky but I’ve also had a some great experiences in the bowl with amazing women. I just had a bad day the other day and wrote this out as bit of a vent. All of this has happened to me though and I think other new SDs should be aware",
                                    "author": null,
                                    "id": "hnrxred",
                                    "parent_id": "t1_hnrrls3",
                                    "score": 4,
                                    "created_utc": 1639001825.0,
                                    "replies": [
                                        {
                                            "body": "Unfortunately the hot girls don't have to develop a personality or any sort of redeemable skills 90% of the time.",
                                            "author": "HeilerinVonDoom",
                                            "id": "hnsbe4x",
                                            "parent_id": "t1_hnrxred",
                                            "score": 1,
                                            "created_utc": 1639007613.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "I usually hide my profile tbh and only message people who I’m interested in. 18-22 crowd can be fun, best part is they can’t order a ton of expensive drinks and dinner if under 21 and you have a built in excuse to go back to your place (we can drink there…). But yeah the younger crowd can flake a lot",
                            "author": "sdthrowaway568",
                            "id": "hnrff2y",
                            "parent_id": "t1_hnreh6t",
                            "score": -4,
                            "created_utc": 1638994777.0,
                            "replies": [
                                {
                                    "body": ">best part is they can’t order a ton of expensive drinks and dinner\n\nIf *that*'s the *best* part, you must be fun to be around.",
                                    "author": "Inner_Examination_38",
                                    "id": "hnrhohr",
                                    "parent_id": "t1_hnrff2y",
                                    "score": 9,
                                    "created_utc": 1638995640.0,
                                    "replies": [
                                        {
                                            "body": "Should say at dinner, I’m a hoot. You haven’t lived until you’ve had a sugar baby try to order a $300 bottle of wine on a meet and greet (and not at a nice restaurant usually, just literally the most expensive one)",
                                            "author": "sdthrowaway568",
                                            "id": "hnrhzah",
                                            "parent_id": "t1_hnrhohr",
                                            "score": 1,
                                            "created_utc": 1638995751.0,
                                            "replies": [
                                                {
                                                    "body": "I see you may have posted a number which is most likely an amount in relations to an arrangement. If this is the case, you are violating Rule #4 - \"No dollar amounts that are in reference to allowance/PPM are allowed.\"\n\nIf you are curious about Allowances reported by SLF contributors please see the [Allowance Master Thread 2021-2022](/r/sugarlifestyleforum/comments/pc22tk/allowance_master_thread_20212022/).\n\nYour post will not be approved until you remove the amount.  Please read the sub [Rules](/r/sugarlifestyleforum/comments/748zta/updated_and_clarified_rules_for_slf/) prior to posting anything else. \n\nIf you simply posted a number not referencing a monetary amount, please message the MODs to approve your post.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/sugarlifestyleforum) if you have any questions or concerns.*",
                                                    "author": "AutoModerator",
                                                    "id": "hnri1mt",
                                                    "parent_id": "t1_hnrhzah",
                                                    "score": -3,
                                                    "created_utc": 1638995775.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "I actually don’t mind the expensive drinks and meals if they are fun and serious about wanting an arrangement. Problem is many girls aren’t but want that anyway so it’s a time waste",
                                    "author": null,
                                    "id": "hnrn2ec",
                                    "parent_id": "t1_hnrff2y",
                                    "score": 1,
                                    "created_utc": 1638997657.0,
                                    "replies": []
                                },
                                {
                                    "body": "yikes",
                                    "author": "c0rnstarr",
                                    "id": "hnrsm41",
                                    "parent_id": "t1_hnrff2y",
                                    "score": 1,
                                    "created_utc": 1638999799.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Very familiar. One thing I've gotten better at is blocking and deleting. I block profiles on SA when the conversation goes stale. Those who we finally exchange numbers with , g voice, I will block as well if the conversation dies. Or I quickly find out she is trying to finesse.  \n\n\nThe faster you sort,block and delete the better. Move fast men. Spend little time doubling back.",
            "author": "southernslick",
            "id": "hnrrc01",
            "parent_id": "t3_rbzcgg",
            "score": 2,
            "created_utc": 1638999299.0,
            "replies": [
                {
                    "body": "I don't understand the quick-to-block approach.\n\nWhat if the other party is just overwhelmed or brain-fazed and three weeks later goes through the guys they lost track of and want to reconnect with you?\n\nIs the issue that you want to keep  decluttering and, perhaps, you're in a market  with an endless new joiners, such NYC metro.\n\nOr, is your experience that people who let the conversation drizzle are never worth the time, i.e. if they do reply down the road you have to review their history and that's a drain on your focus.",
                    "author": "Hyceanplanet",
                    "id": "hnrscr3",
                    "parent_id": "t1_hnrrc01",
                    "score": 3,
                    "created_utc": 1638999696.0,
                    "replies": [
                        {
                            "body": "It's a feel thing. You just know from the inbox and text conversations it's going nowhere and a time waste. And like the OP said they will out themselves in the conversation if listen and ask the right questions. Just this month I've had two POT who were just trying to finesse for some quick holiday cash. Not knocking the hustle. I'm just wrong target. It's Holiday Desperation Season.\n\nI do live in a target rich market within a 100 mile radius. I could go 250 and find some gems right outside of 100. Yes, there is ALWAYS newcomers in my area. Always.",
                            "author": "southernslick",
                            "id": "hnru0pz",
                            "parent_id": "t1_hnrscr3",
                            "score": 4,
                            "created_utc": 1639000347.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Definitely Spot on",
            "author": "1789-DC",
            "id": "hnsd85k",
            "parent_id": "t3_rbzcgg",
            "score": 2,
            "created_utc": 1639008443.0,
            "replies": []
        },
        {
            "body": "There is a lot of truth to this. But then you find that one sexy, kinky, submissive SB that you just click with and it makes everything worthwhile.\n\nIt's like playing a round of golf. If you can sink one long putt, you forget about everything else and keep coming back.",
            "author": "TradeWindsATX",
            "id": "hnsercf",
            "parent_id": "t3_rbzcgg",
            "score": 2,
            "created_utc": 1639009137.0,
            "replies": [
                {
                    "body": "Exactly! You totally understand…and also seem to have the same type as me so save a few SBs for me haha. \n\nSometimes the difficultly makes you really relish the success when it finally works. \n\nI’ve literally been with SBs and thought “this is fucking perfect, like heaven” and I wonder sometimes if it was as easy if I’d appreciate it as much",
                    "author": null,
                    "id": "hnsho79",
                    "parent_id": "t1_hnsercf",
                    "score": 1,
                    "created_utc": 1639010438.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "This post is extremely accurate.",
            "author": "Ok-Analysis-7084",
            "id": "hnsudly",
            "parent_id": "t3_rbzcgg",
            "score": 2,
            "created_utc": 1639016087.0,
            "replies": []
        },
        {
            "body": "Lol. I'm a SB, been on 3 dates with potential SDs, been with the same SD for over 2 years. You're not great at this. But in your defense, I know that it's harder for men. My SD informs my that there are a lot of scammers and \"flattering\" photos. But to echo the comment above, screen better.",
            "author": "casualthreesome",
            "id": "hnt6i3u",
            "parent_id": "t3_rbzcgg",
            "score": 2,
            "created_utc": 1639021653.0,
            "replies": []
        },
        {
            "body": "tell me you hate women without telling me you hate women",
            "author": "ambientscreaming",
            "id": "hnruxg2",
            "parent_id": "t3_rbzcgg",
            "score": 0,
            "created_utc": 1639000701.0,
            "replies": [
                {
                    "body": "Yes, complaining about all the ways things go wrong in the bowl means “I hate women” 🙄. \n\nI love women, I just don’t like being stood up, scammed, not having my time respected like I respect theirs, and being expected to drop thousands of dollars for the experience when the other person is entitled and providing me nothing. There are great women in the bowl, but also some real duds\n\nIf you think all women are perfect angels, never scam guys, and shouldn’t ever be criticized, I hate to say it but you’re naive and highly biased. \n\nCriticizing shitty behavior women engage in doesn’t mean I hate all women generally",
                    "author": null,
                    "id": "hnrwaid",
                    "parent_id": "t1_hnruxg2",
                    "score": 5,
                    "created_utc": 1639001240.0,
                    "replies": [
                        {
                            "body": "i've had my same SA account for 10 years. i'm no stranger to the annoyances and frustrations. i left my comment because reading this post of complaints was like....well, what do you expect? you're an older man who wants to have sex with younger women with no real life repercussions - yeah, you're going to have to deal with bullshit\n\ni'm a mid 30's woman - if i decided i wanted to sleep with exclusively young 20 something men and took to tinder to do so, i'd face the same frustrations. flaking, having to pay for things, tedious conversation, nothing really in common, life issues cropping up, etc. \n\nthat's the price to pay for dating people decade(s) younger than yourself",
                            "author": "ambientscreaming",
                            "id": "hnry7th",
                            "parent_id": "t1_hnrwaid",
                            "score": 7,
                            "created_utc": 1639002006.0,
                            "replies": [
                                {
                                    "body": "Fair point, but I don’t hate women just because I don’t like those annoyances. I hate the annoyance, not the woman \n\nI’ve met plenty of younger women that _aren’t_ any way like what I complain about, so I know to a degree younger women are choosing to be these ways. I wish they wouldn’t be, so I’m complaining and trying to make newer SDs aware of what they would have to deal with \n\nI agree though, it’s going to come with the territory if those are the women I go for. I bring it on myself to a degree. Perhaps I’ll need to change that",
                                    "author": null,
                                    "id": "hnryw0k",
                                    "parent_id": "t1_hnry7th",
                                    "score": 3,
                                    "created_utc": 1639002274.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "This is BS and OP is an asshole",
            "author": "RockyLeal",
            "id": "hntjutr",
            "parent_id": "t3_rbzcgg",
            "score": 1,
            "created_utc": 1639028967.0,
            "replies": []
        },
        {
            "body": "That's why I hired an assistant, to manage the M&G setup process for me. My assistant has one task:  give me one M&G per week, at Starbucks on Friday at 4pm.\n\nThis saves me the 20 hrs per week that I used to spend messaging back and forth on SA. It still doesn't solve the 'flake' problem, but it makes the overall process much more bearable. The 50% of time that the SB doesn't show up, I just work on my laptop, no time lost.\n\nThe other flakiness problems go away, the higher you set your allowance. So that's my focus: keep making more money, so that the process works better for me.",
            "author": "Nomad_Bill",
            "id": "hnsdtux",
            "parent_id": "t3_rbzcgg",
            "score": 1,
            "created_utc": 1639008718.0,
            "replies": [
                {
                    "body": "I’ve thought about this too and once I hired a company (VIDA) to manage 4 different vanilla dating apps (not seeking). They got me dates but messed up regularly and I wasn’t happen with the return on my investment \n\nI’d love to hire someone to manage the SA messaging. Jealous you have a good system",
                    "author": null,
                    "id": "hnsi051",
                    "parent_id": "t1_hnsdtux",
                    "score": 2,
                    "created_utc": 1639010590.0,
                    "replies": [
                        {
                            "body": "As a fan of organization, and HR background, I would definitely apply to be a virtual assistant. \n\nThat is brilliant.  Sorry it didn't work out.",
                            "author": "Syster_Spyder_695",
                            "id": "hnthlmg",
                            "parent_id": "t1_hnsi051",
                            "score": 1,
                            "created_utc": 1639027604.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "All correct. About clothing, I once had an M&G where the POT overdressed for Starbucks. Some kind of sparkly, glitzy pants suit that looked more appropriate for a club than coffee. Everyone was staring at her.",
            "author": "Prestigious_Cream_35",
            "id": "hnsctmf",
            "parent_id": "t3_rbzcgg",
            "score": 1,
            "created_utc": 1639008260.0,
            "replies": []
        },
        {
            "body": "Vet better.",
            "author": "AShatteredKing",
            "id": "hntim1q",
            "parent_id": "t3_rbzcgg",
            "score": 1,
            "created_utc": 1639028202.0,
            "replies": [
                {
                    "body": "Okay smart guy, what’s your strategy for vetting SBs who are bad in bed ? Or who will try to rinse you after you get their number? \n\nYou act like these things can be “vetted” by looking at a girls profile but in no way is that true. The only way to eliminate these girls is to eliminate girls under 25 who are borderline too pretty to be on SA. For me, that’s the _entire point_ of being on there",
                    "author": null,
                    "id": "hntkcrc",
                    "parent_id": "t1_hntim1q",
                    "score": 0,
                    "created_utc": 1639029277.0,
                    "replies": [
                        {
                            "body": "Chemistry. Don't just look for a girl who is hot. I've never had bad sex with a woman I had good chemistry with. Every time I've had bad sex with someone, we didn't have good chemistry.\n\nAs for rinsing, make it clear you aren't going to give them anything before the first non-platonic date. End it at the first sign that they are going to try to rinse you. I've never been rinsed.",
                            "author": "AShatteredKing",
                            "id": "hntlgi3",
                            "parent_id": "t1_hntkcrc",
                            "score": 5,
                            "created_utc": 1639029986.0,
                            "replies": [
                                {
                                    "body": "Chemistry is important and I think that’s a good suggestion, but for me, someone hot and young is the goal. If I was trying to maximize intrapersonal chemistry, I’d vanilla date someone close to my age, not a 20 yr old college student \n\nAnd I’m guessing you’re one of those guys that the second message on SA you send a novel that outlines all the rules. Personally I like to get an idea for who the SB is as a person first, which (to your point) does allow them to reveal themselves as a rinser later. I’ve found that being authoritative about expectations first several messages does not lead to success",
                                    "author": null,
                                    "id": "hnvy6it",
                                    "parent_id": "t1_hntlgi3",
                                    "score": 1,
                                    "created_utc": 1639076968.0,
                                    "replies": [
                                        {
                                            "body": "Having good chemistry doesn't mean you are trying to maximize the chemistry; that's a false dichotomy. Take your time and find a woman that fits you well. There are A LOT of young beautiful women who want SDs.",
                                            "author": "AShatteredKing",
                                            "id": "hnwmwi9",
                                            "parent_id": "t1_hnvy6it",
                                            "score": 1,
                                            "created_utc": 1639086916.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "hnrp43a",
            "parent_id": "t3_rbzcgg",
            "score": -1,
            "created_utc": 1638998450.0,
            "replies": [
                {
                    "body": "Check the wiki for that - [here’s a link ](/r/sugarlifestyleforum/wiki/advice/new_sbs?utm_source=share&utm_medium=ios_app&utm_name=iossmf)",
                    "author": null,
                    "id": "hnrpcnl",
                    "parent_id": "t1_hnrp43a",
                    "score": 3,
                    "created_utc": 1638998540.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "hnrud82",
            "parent_id": "t3_rbzcgg",
            "score": 1,
            "created_utc": 1639000483.0,
            "replies": [
                {
                    "body": "Exactly. You’d think because you’re not committing to a vanilla romantic relationship that sugar would be easier, but in fact it brings its own time sucks. It’s difficult to maintain any relationships and maximize your success elsewhere",
                    "author": null,
                    "id": "hnrzfq7",
                    "parent_id": "t1_hnrud82",
                    "score": 2,
                    "created_utc": 1639002496.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I'm only on 4)  \\*cries\\*",
            "author": "gam9147",
            "id": "hnuhxrv",
            "parent_id": "t3_rbzcgg",
            "score": 1,
            "created_utc": 1639054839.0,
            "replies": []
        },
        {
            "body": "Hi, Im not a sb (yet) but just looking for some insight.\nI'm 19, I am attracted to older men, like 10yrs plus who have their lives (mostly) in order which s/d's seem to have. \nHowever, I wouldnt really want a s/d for the money and gifts, for me it would mostly be about finding a solid man to have a relationship with, I have my own money so it's not like I'd be their s/b for the sole purpose of receiving money and gifts (I also have no issue with paying for dates/days out) But I'm just wondering if that's what other s/d are looking for, or whether all they want is just a beat, keep for a few months, and then delete lol, so yeah if you have any input or advice that would be great :)\n\nEdit: I'm also shy initially when meeting new people, would that be an issue for someone looking for a sb?",
            "author": "stu-311375",
            "id": "hrdygzy",
            "parent_id": "t3_rbzcgg",
            "score": 1,
            "created_utc": 1641407830.0,
            "replies": []
        },
        {
            "body": "Your comment is really ruining my life plan to escape to the beaches of Barcelona or the Canary Islands and sugar until death.\n\nGuess these are just worldwide problems no matter where we sugar. You’re right it’s all worth it when you get a good SB though",
            "author": null,
            "id": "hnsrrcu",
            "parent_id": "t1_hnsqdi1",
            "score": 12,
            "created_utc": 1639014932.0,
            "replies": [
                {
                    "body": "I legit lol’d at those first 8 words",
                    "author": "avibrator",
                    "id": "hnsva1g",
                    "parent_id": "t1_hnsrrcu",
                    "score": 5,
                    "created_utc": 1639016481.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Statistically speaking, the average number of dates a person needs to feel comfortable is 3. I mean, sexuality is definitely a big aspect of these relationships but companionship over and above that is too. So being that you’re not paying an escort for sex, you’re entering into a form of relationship and it’s understandable to take a few dates to build up that comfort level and connect a big before jumping into sex. Just my take on the matter anyways.",
            "author": "Lucky_Ad3616",
            "id": "hntnxoo",
            "parent_id": "t1_hnsqdi1",
            "score": 5,
            "created_utc": 1639031656.0,
            "replies": []
        },
        {
            "body": "Exactly, I think the thing I wasn’t prepared for was the time involved and the little games you have to watch out for. Many ways it can blow up in your face where you lose time or money",
            "author": null,
            "id": "hnrnnmq",
            "parent_id": "t1_hnrkdit",
            "score": 7,
            "created_utc": 1638997891.0,
            "replies": []
        },
        {
            "body": "I dunno.  Once you understand the game, it can be kind of fun.  The chase and all, especially when you find someone worth spending time with.",
            "author": "MrBuzzard",
            "id": "hnrvqks",
            "parent_id": "t1_hnrkdit",
            "score": 7,
            "created_utc": 1639001022.0,
            "replies": []
        },
        {
            "body": "I agree! I have had no such experiences.",
            "author": null,
            "id": "hnsdn85",
            "parent_id": "t1_hnrkdit",
            "score": 3,
            "created_utc": 1639008634.0,
            "replies": []
        },
        {
            "body": "Sugaring is cheaper than vanilla dating from my experience. Well, maybe about the same. It will also drain far less of your time.",
            "author": "AShatteredKing",
            "id": "hntir7l",
            "parent_id": "t1_hnrkdit",
            "score": 1,
            "created_utc": 1639028288.0,
            "replies": []
        },
        {
            "body": "You’re right, I was being a little hyperbolic for entertainment value. I honestly don’t need high class dress, heels, full make-up. I usually ask the girl what type of meetup she’d like though and if they chose “restaurant”, I’d expect them to not come in pajamas\n\nIn the last month I’ve picked up a girl who said she woke up 5 min before meeting me, threw on the first thing she could find, and kept apologizing for not brushing her teeth (I kissed her, it was true). Another girl showed up in sweats and slippers to a nice restaurant she helped pick. That’s the type of thing I want to avoid \n\nI shower, shave, make sure I smell nice and am dressed for the occasion for every date. I also often clean my entire house before a SB date just in case it ends at my place. I want to be attractive to the SB so it’s more that she put in some minimal effort too…like shoes instead of worn slippers. \n\nI like alt girls and all sorts so dress your style, but please just make a little effort to look like you want to be out in public. That’s it, bare minimum expectations",
            "author": null,
            "id": "hns5wn3",
            "parent_id": "t1_hns18rp",
            "score": 10,
            "created_utc": 1639005200.0,
            "replies": [
                {
                    "body": "One reason why some commenters to your post seem to be missing the point -- or overlooking the point -- is that you seem to have high level sales experience.\n\nOne aspect I find immensely useful/clarifying is that you've structured the process into the sort of sales system that helps put the right context to the minute-by-minute ups and downs of what is a meandering, rejection-filled and circular process.\n\nWhat's not your point is whether X salesperson (SD) has Y or Z level of relative efficiency. Some salesperson in NYC with a grad degree from MIT will do better in tech device sales than another salesperson at the same company in Michigan with a state degree. These variances have nothing to do with whether the system design is good.\n\n\\--\n\nIf I can press a bit deeper on your casual vs dress reply (which was richly detailed and spot-on a direct response:)\n\n...And I realize there's no way you would have a solid answer for this ....so just intuitvely....:\n\nDo you find that how they dress -- even badly -- has any correlation to whether things work out with them? Young women have chaotic lives -- juggling so much stuff -- and their showing up, to my view (until you correct me, which I would appreciate) is their way of showing you that they really wanted to meet you. Otherwise they would have cancelled, realizing they just didn't have the focus/breathing room to get all the right pieces together....they don't have time to dress or brush their teeth.\n\nTo my view, the examples you give show someone who really wanted to meet you....hence I'm wondering if there is even a positivie correlation between the people who can barely pull it off to get there (making things work even though they are barefly above water.)\n\nThere's a cool scene in one of Will Smith's movies which underscores this point -- that, sometimes, if someone shows up to a stress meeting and they know they don't look their best, it's that they *really* want to be there. \n\n[https://youtu.be/UUDKEbX5OQw](https://youtu.be/UUDKEbX5OQw) (link to scene)",
                    "author": "Hyceanplanet",
                    "id": "hnsa196",
                    "parent_id": "t1_hns5wn3",
                    "score": 2,
                    "created_utc": 1639007007.0,
                    "replies": [
                        {
                            "body": "I'm afraid I'd have to agree on OP with this one. While your counter argument is valid, showing up dressed so casually you may as well be wearing pjs, and have it reasoned as \"yes but she/they *really really* want to be there, because you're important!\" Just really isn't right. \n\nShowing up because you really want to be there is of course the truth. That is the point of the meeting. And yes, our lives do get chaotic. I will openly admit I've done similar things, (though not perhaps to such an extent where I showed up to an important meeting in slippers and sweats) where I prioritized comfort over aesthetic. \n\nBut if, as you say, this woman/person really and truly felt you as the POT were so important that they had to meet you no matter what, they should have still put in effort. \n\nI didn't memories which number this is under, but if the lady that OP mentioned in his earlier replies, woke up 5mins before their meeting, she could have called (hoping she did) to apologize for being tardy, and that she'd be there in XY minutes. \n\nGiving herself enough time to run some dry shampoo through her hair, put on some light make up, picked a nicer outfit, brushed her teeth, and met OP looking like she wanted to be there and *showing* that she wanted to be there. \n\nIt happens. Sometimes life is cruel to all your carefully laid out plans. \n\nBut regardless, meeting a POT for the 1st time is really more akin to a job interview (hence the stress). And I don't know about other women, but even if I didn't want to be there, I'd still show up, and be dressed appropriately. \n\nI never got to be an SB though I've always wanted to be one. I wouldn't have minded the intimacy, and honestly an allowance would have helped so many of my current financial issues. \n\nBut SB type relationships aren't really a thing in my country. Well, they are, but only with a very very specific looking type of woman, and sadly, I am not such a woman. And online SDs are majorly a scam, and not plausible anyway because of the long distance. \n\nBut I know that had I been lucky enough to have someone interested in me like that, I would have put in the maximum of all efforts. Because they chose me, and chose to help me. And the next best thing I can do to show gratitude is do my best to meet their expectations and make them happy and content. \n\nSo sad that some women take this chance for granted. \n\nSorry for the rant 😅",
                            "author": "Rowan-the-Girlfriend",
                            "id": "hnsx5ie",
                            "parent_id": "t1_hnsa196",
                            "score": 8,
                            "created_utc": 1639017313.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "hnuav78",
                                    "parent_id": "t1_hnsx5ie",
                                    "score": 2,
                                    "created_utc": 1639050272.0,
                                    "replies": [
                                        {
                                            "body": "What I post is part of my part time job to get some influx of cash. That does not mean that I wouldn't like to actually meet someone and have them help me in such a way that what I do on the side is no longer necessary to help pay my bills, or buy a Christmas present for my little niece and nephews. \n\nMy \"exuberant\" photos don't correlate to what I was speaking of. So they shouldn't be used in your argument in the first place.",
                                            "author": "Rowan-the-Girlfriend",
                                            "id": "hnubeeq",
                                            "parent_id": "t1_hnuav78",
                                            "score": 2,
                                            "created_utc": 1639050657.0,
                                            "replies": [
                                                {
                                                    "body": "[deleted]",
                                                    "author": null,
                                                    "id": "hnuclzm",
                                                    "parent_id": "t1_hnubeeq",
                                                    "score": 2,
                                                    "created_utc": 1639051520.0,
                                                    "replies": [
                                                        {
                                                            "body": "I am not so fragile that a misunderstanding of flowery language will hurt my glass-like feelings. I also know what exuberant means. I grew up in North America, English is my first language. And though I now live back in my hometown, in the country of my birth here in Europe, I can assure you there is no cultural gap between us. \n\nI am accustomed to men believing certain things about what I currently do, and that's what your comment sounded like to me. Which is why I said what I do on the side shouldn't have had any bearing to what I was referring to in my previous comments. What I said stands. \n\nSuffice to say I write a lot in my day job too, as a freelance editor, among other things. But I prefer being clear with my words. \n\nAs one writer to another, perhaps take that as an approach, rather than diplomatically trying to bounce around from one flowery word to another, to avoid further confusions in future.",
                                                            "author": "Rowan-the-Girlfriend",
                                                            "id": "hnud9wq",
                                                            "parent_id": "t1_hnuclzm",
                                                            "score": 4,
                                                            "created_utc": 1639051975.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "How long have you been doing this? I don’t encounter all these things every time I try to find a SB, but every one of these things have happened to me at least once before. I mostly go for girls under 25, many of which are new to being a SB, so that’s a big part of the issues. \n\nPerhaps I could screen better but many girls eliminate themselves during the above steps. In essence, that is screening",
            "author": null,
            "id": "hnrinjp",
            "parent_id": "t1_hnrf3ug",
            "score": 8,
            "created_utc": 1638996005.0,
            "replies": [
                {
                    "body": "Girls under 25 who have no idea what they're doing? No wonder why you're experience is so bad...",
                    "author": null,
                    "id": "hns25p7",
                    "parent_id": "t1_hnrinjp",
                    "score": 12,
                    "created_utc": 1639003623.0,
                    "replies": []
                },
                {
                    "body": "Like 5 years. Yeah I did see that you go for under 25 which is my demographic too. I usually try to set up a meeting for same or next day after a few messages at semi nice restaurant or drink place. Obviously a lot can’t meet same day but those that do are usually legit. If I set up a meeting that isn’t same or next day, I accept that there is ~75% chance it won’t go through",
                    "author": "sdthrowaway568",
                    "id": "hnrj6uo",
                    "parent_id": "t1_hnrinjp",
                    "score": 3,
                    "created_utc": 1638996205.0,
                    "replies": [
                        {
                            "body": "If they cannot get to my side of town then I cannot do anything for them.",
                            "author": "Major-Editor-2016",
                            "id": "hns9df2",
                            "parent_id": "t1_hnrj6uo",
                            "score": 3,
                            "created_utc": 1639006710.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Agree with you... a couple of odd meets but 80% great ones. Sure I've never found Miss Perfect but had lots of fun along the way. All meets have been in Europe or Asia...never done this in America.",
            "author": null,
            "id": "hnucaol",
            "parent_id": "t1_hnrf3ug",
            "score": 1,
            "created_utc": 1639051304.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "hnry7of",
            "parent_id": "t1_hnrgj4j",
            "score": 6,
            "created_utc": 1639002004.0,
            "replies": [
                {
                    "body": "I just imagine this being said with the satirical personality of Brain from Pinky and the Brain",
                    "author": "avibrator",
                    "id": "hnsuiu6",
                    "parent_id": "t1_hnry7of",
                    "score": 2,
                    "created_utc": 1639016148.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "As I said “there are some great experiences to be had”. The point is that there is a lot of bullshit to deal with at every stage. \n\nI’ve encountered all these things and also met amazing women, fallen in love, and had the best sex of my life with model-level attractive women. It wasn’t always easy. New SDs especially shouldn’t think their money will buy them an easy experience",
            "author": null,
            "id": "hnrhvqz",
            "parent_id": "t1_hnrgj4j",
            "score": 13,
            "created_utc": 1638995714.0,
            "replies": []
        },
        {
            "body": "Funny enough that happened to me this very week so I should add that too. Girl actually stood me up despite confirming 2 hrs before and helping choose a place",
            "author": null,
            "id": "hnri5oi",
            "parent_id": "t1_hnrf5ik",
            "score": 5,
            "created_utc": 1638995817.0,
            "replies": [
                {
                    "body": "When I was first using SA, I was stood up 3 times by the same lady. In between, she apologized profusely and begged for another chance.\n\nThe rest of the story....a year later she contacts me and wants to meet. I say come to my home Sunday morning 8 AM, figuring no way. Damn if she doesn't show up and we had a 9 month SR.",
                    "author": "AFSMSgt",
                    "id": "hnrl30o",
                    "parent_id": "t1_hnri5oi",
                    "score": 9,
                    "created_utc": 1638996903.0,
                    "replies": [
                        {
                            "body": "Whoa that’s a crazy story. Like I can’t believe she showed, especially since you made it the morning lol. I don’t know what it is with some SBs but sometimes they just need something to click so they show up and take it seriously. \n\nSimilarly I had a girl I messaged off and on  that never would make time to meet up. One day over a year later she did finally agree. I ended up having a 10 month arrangement with her. I have no idea why it worked then and not before",
                            "author": null,
                            "id": "hnro64u",
                            "parent_id": "t1_hnrl30o",
                            "score": 4,
                            "created_utc": 1638998090.0,
                            "replies": [
                                {
                                    "body": "Bitches be crazy. The big bang theory mail man had it right.",
                                    "author": "AFSMSgt",
                                    "id": "hnsqspx",
                                    "parent_id": "t1_hnro64u",
                                    "score": 2,
                                    "created_utc": 1639014510.0,
                                    "replies": [
                                        {
                                            "body": "Honestly sometimes it might just be that lol. They probably think we’re crazy ourselves",
                                            "author": null,
                                            "id": "hnsrbze",
                                            "parent_id": "t1_hnsqspx",
                                            "score": 1,
                                            "created_utc": 1639014744.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "To borrow an old phrase \n\nSimplicity is the ultimate sophistication",
                            "author": "pinotandsugar",
                            "id": "hnrpbnd",
                            "parent_id": "t1_hnrl30o",
                            "score": 4,
                            "created_utc": 1638998529.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "that is why I require them to get to my side of town and text or call when they are 20 minutes away.\n\nAnd then when they text at the 20 min mark I ask them to tell me what cross road or land mark they can see.\n\nEvery girl I drove a distance to meet had too many problems to be useful to me. (grossly inflated ego, unconscionable financial demand, no car, alcohol issues...) \n\nRemember: they are the ones with the time.",
                    "author": "Major-Editor-2016",
                    "id": "hns90ms",
                    "parent_id": "t1_hnri5oi",
                    "score": 4,
                    "created_utc": 1639006556.0,
                    "replies": [
                        {
                            "body": "Smart, I’m honestly always offering to come to them with the hopes they will be more likely to not flake. \n\nSeems fair to ask them to come to me if they are actually invested and want it to work though",
                            "author": null,
                            "id": "hnsa6w1",
                            "parent_id": "t1_hns90ms",
                            "score": 2,
                            "created_utc": 1639007077.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Good point. I’m willing to put up with some of their life drama but when I find out things like they have a drug problem or a jealous boyfriend (both have happened), I’m out. That’s more what I was referring to",
            "author": null,
            "id": "hnvyhuv",
            "parent_id": "t1_hnvbk0n",
            "score": 1,
            "created_utc": 1639077098.0,
            "replies": []
        },
        {
            "body": "Yes exactly. I am actually looking forward to a Sugar Baby version now!",
            "author": "chemistryromance",
            "id": "hns9dus",
            "parent_id": "t1_hnrch1o",
            "score": 5,
            "created_utc": 1639006715.0,
            "replies": []
        },
        {
            "body": "I think we would be better off with the ladies offering their thoughts on  good and bad things SD's do .  \n\nWhile there are lots of ideas it's important to keep in mind that the approach to a 38 yo SB out of her second marriage should be very different than that appropriate for an aspiring SB with minimal social and sexual experience.",
            "author": "pinotandsugar",
            "id": "hnrnkug",
            "parent_id": "t1_hnrch1o",
            "score": 8,
            "created_utc": 1638997860.0,
            "replies": []
        },
        {
            "body": "Lol honestly they are a lot easier, especially if you just want sex.",
            "author": null,
            "id": "hnrn9kl",
            "parent_id": "t1_hnrka70",
            "score": 4,
            "created_utc": 1638997735.0,
            "replies": []
        },
        {
            "body": "Can't sleep with hookers any more after trying sugar. The experience feels too impersonal.\n\nWith a SR she knows your name, your background, your favourite cocktail. She asks you what you find sexy and buys lingerie.\n\nWhen you fuck she's wet without lube, and actually wants to hang out afterwards rather than leaving.\n\nDifferent strokes for different folks",
            "author": null,
            "id": "hnxd8jq",
            "parent_id": "t1_hnrka70",
            "score": 2,
            "created_utc": 1639098296.0,
            "replies": []
        },
        {
            "body": "100% I always think of finding a sugar baby as a sales funnel where the entry point is a cold call",
            "author": "sdthrowaway568",
            "id": "hntjwuh",
            "parent_id": "t1_hnt1kvq",
            "score": 2,
            "created_utc": 1639029001.0,
            "replies": []
        },
        {
            "body": "That’s very zen. I still had excited about the new gorgeous girls and then bummed when they are actually a scam or disappointment. All part of the chase I guess",
            "author": null,
            "id": "hnt1rw4",
            "parent_id": "t1_hnt1kvq",
            "score": 4,
            "created_utc": 1639019410.0,
            "replies": [
                {
                    "body": "If you tune your process right, you can catch most of that.\n\n1st, schedule a M&G quickly.  That filters out people who have no intent on meeting or don’t look reasonably like their photos.\n\nTo filter out no-shows, either double-book the M&G or tell them to text you when they are on their way, and then don’t leave until you get the text.\n\nAt every point in the process, there are things you can do to filter out people who aren’t good candidates for SR.\n\nWhat you are left with is good candidates, and fun exploring the opportunities.",
                    "author": "robhudsondfw",
                    "id": "hnt2o3w",
                    "parent_id": "t1_hnt1rw4",
                    "score": 3,
                    "created_utc": 1639019825.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Hmm well I wrote this as a SD but it’s hard for SBs too. There are lots of men hoping to use SA to pretend to be SD but who can’t afford it (salt daddies). There are also types of women that do well in the bowl. You can post a profile review here and people can give you input",
            "author": null,
            "id": "hnw5ai7",
            "parent_id": "t1_hntkncq",
            "score": 1,
            "created_utc": 1639079807.0,
            "replies": []
        },
        {
            "body": "I honestly think a huge number of SBs want to normal date their SD while also expecting an allowance. They don’t say it like that, but that’s what is expected. \n\nIf you’re a SD and you can vanilla date women you like for free, might as well since it’s arguably a similar amount of work while saving your cash",
            "author": null,
            "id": "hnw29aa",
            "parent_id": "t1_hnui68h",
            "score": 2,
            "created_utc": 1639078610.0,
            "replies": []
        },
        {
            "body": "I take regular breaks for this very reason. I tend to get an SA membership for a month and then need 3-6 months to recover from it (and enjoy the SBs)",
            "author": null,
            "id": "hnvpxvo",
            "parent_id": "t1_hnvoqqm",
            "score": 1,
            "created_utc": 1639073697.0,
            "replies": []
        },
        {
            "body": "Really good points and I’m glad you shared as a SB. I honestly don’t have a hard “no money before ever” rule but many times girls have asked for it before and abused it by standing me up or likely never actually being a girl (a scammer) \n\nI usually pay for reasonable expenses to travel and a huge amount of whether I’m willing to do it beforehand is how cool the SB has been with me over text. If she shows zero interest in getting to know me, focuses on the money part of the arrangement, or doesn’t want to talk about the details that matter, then usually I won’t risk it. \n\nA girl that’s great to talk to, really attractive, and seems genuinely interested in me can get almost whatever she wants out of me, including money beforehand. If you’re a smart woman, I’d play that way and get me wrapped around your little finger and take 10K+ over a few months. Sadly women often chose scammy shortcuts instead",
            "author": null,
            "id": "hnsqski",
            "parent_id": "t1_hnslx6l",
            "score": 7,
            "created_utc": 1639014508.0,
            "replies": [
                {
                    "body": "Yes I think it really helped that I was genuinely interested in my SD :). I kind of broke all the rules and started vanilla dating him and he has been my partner for two years now haha. My entire life is funded by him and I also love him very much, so needless to say sometimes sending ahead of time can benefit both sides, and isn’t always a scam.",
                    "author": null,
                    "id": "hnsroji",
                    "parent_id": "t1_hnsqski",
                    "score": 3,
                    "created_utc": 1639014898.0,
                    "replies": [
                        {
                            "body": "Love this story and huge congrats for finding someone amazing through all the pitfalls I listed out. Things are so much better when you’re actually interested in your sugar partner enough for a relationship like that \n\nI have a rough time with monogamy and having just one girl, but what you have is kinda the dream after I settle down.",
                            "author": null,
                            "id": "hnsspub",
                            "parent_id": "t1_hnsroji",
                            "score": 2,
                            "created_utc": 1639015358.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Summer 2020 was rough for me too, largely because of COVID and the amount of girls who used that to push for online only (or who didn’t join in the first place). \n\nI’d say it’s better than that now, but not a huge amount. Now I think that many of the young SBs have seen the rise of onlyfans and other online money making opportunities that proliferated during COVID so they expect easy money with no work. They see this shit  on their social media feeds all the time. It’s made “mutually beneficial” go close to extinction \n\nIf you have that much vanilla success, I’d stick with that. It’s arguably not as much work and it’s also free",
            "author": null,
            "id": "hnsiovo",
            "parent_id": "t1_hnshk0s",
            "score": 1,
            "created_utc": 1639010900.0,
            "replies": [
                {
                    "body": "That’s why I’m sticking with vanilla for now. Saved an extra ~60k since COVID began. It’s remarkable how much I used to spend in this lifestyle.",
                    "author": "sdthrowaway006",
                    "id": "hnt6av7",
                    "parent_id": "t1_hnsiovo",
                    "score": 1,
                    "created_utc": 1639021554.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Personally if I go for older women, they are the women I can vanilla date because I’m not too much older for a SD\n\nTo be clear, I’m not just in it to fetishize younger women. I just find that both men and women generally don’t take care of their bodies. The accumulated damage adds up as people age and it effects their looks. A 20 year old can be eating fast food and smoking every day and look great, there has been no time for damage to accumulate. \n\nMy goal is to go for the most attractive people possible and just so happens if you want a girl with an amazing body, they are often younger (for reasons above). I do consider very attractive older women that have taken care of themselves, but usually for vanilla dating (if I can get them)",
            "author": null,
            "id": "hnw61it",
            "parent_id": "t1_hntisic",
            "score": 3,
            "created_utc": 1639080101.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "hnruwcj",
            "parent_id": "t1_hnrsw8r",
            "score": 5,
            "created_utc": 1639000689.0,
            "replies": [
                {
                    "body": " thats interesting, i hadnt considered different lifestyles attracting different incomes.",
                    "author": "c0rnstarr",
                    "id": "hnrw04t",
                    "parent_id": "t1_hnruwcj",
                    "score": 2,
                    "created_utc": 1639001125.0,
                    "replies": []
                },
                {
                    "body": "[removed]",
                    "author": null,
                    "id": "hnsuncp",
                    "parent_id": "t1_hnruwcj",
                    "score": 2,
                    "created_utc": 1639016202.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Why escorts? I want an actual relationship, one that involves sex, but not just sex. \n\nAnd I kinda wish anytime someone complained about the process of getting a SB it wasn’t immediately “get an escort”. Escorts really aren’t the answer.",
            "author": null,
            "id": "hnsu9f6",
            "parent_id": "t1_hnrsw8r",
            "score": 2,
            "created_utc": 1639016035.0,
            "replies": [
                {
                    "body": "It just sounds like you simply don’t like human aspects to women in this kind of dynamic, and honestly doesn’t sound like you want an actual relationship or enjoy this process. I think escorts would simplify everything you’re complaining about",
                    "author": "c0rnstarr",
                    "id": "hntb34l",
                    "parent_id": "t1_hnsu9f6",
                    "score": 6,
                    "created_utc": 1639024002.0,
                    "replies": [
                        {
                            "body": " No, that’s not it and don’t get how you’re getting that interpretation. \n\nExample, step 4, why would you interpret that I don’t like human aspects of women or “this dynamic” when it seems pretty clear I’m complaining about rinsers specifically? I don’t like SBs wasting my time and asking for money before they’ve even met me. I don’t like scams. I’m sure you don’t like scammer SDs either and I’m not suggesting you find a “John”\n\nThere are good SBs that don’t do any of these things. I have a couple of them right now, we have a relationship. They didn’t try to scam me or waste my time so it works.\n\nIf you think the disrespect, wasting other people’s  time, or scamming are a central part of this “dynamic” you’re probably a terrible SB",
                            "author": null,
                            "id": "hntlpa1",
                            "parent_id": "t1_hntb34l",
                            "score": 0,
                            "created_utc": 1639030147.0,
                            "replies": [
                                {
                                    "body": "I seem to have struck a chord. \n\nI’m not saying anything about scamming, not sure where you got that from. I’m saying that the entirety of this post is a negative rant about how SBs make this process horrible for you. You say you want a relationship and then complain when they “get too attached”, they’re always sexually boring or can’t hold a conversation, etc. you say yourself it’s barely worth it. \n\nSoooo yeah, sounds like it’s time to switch things up",
                                    "author": "c0rnstarr",
                                    "id": "hnuvf8o",
                                    "parent_id": "t1_hntlpa1",
                                    "score": 5,
                                    "created_utc": 1639061568.0,
                                    "replies": [
                                        {
                                            "body": "I don’t have enough space in a single Reddit post to describe all my feelings about sugaring but many of them are positive. This a snarky slice at the difficulties that come with it, mostly so newer SDs can see where it fails. I like sugaring enough to keep at it; the successes make it worth it\n\nSBs should always ask “why isn’t this guy just vanilla dating instead of spending money”. For me, it’s that I don’t want to be anyone’s boyfriend or spend a huge amount of time together. I would vanilla date if I wanted that. So yes, I want a relationship with less attachment than a GF and I think that should be okay in sugaring. I don’t like when SBs don’t respect that",
                                            "author": null,
                                            "id": "hnw1lwi",
                                            "parent_id": "t1_hnuvf8o",
                                            "score": 1,
                                            "created_utc": 1639078352.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Lol to the pun. In that case, you’re likely a great SB and you probably don’t do many of these things. I’d say that you should probably tell SDs you want to view it like normal dating is all. \n\nPersonally I sugar date because I want a close relationship but don’t want many of the hassles of having a GF.",
            "author": null,
            "id": "hnw4giz",
            "parent_id": "t1_hntocat",
            "score": 3,
            "created_utc": 1639079478.0,
            "replies": []
        },
        {
            "body": "I’ve had two girls that said they didn’t give oral, ever. I’ve had many girls who have never had an orgasm and have no idea how to get there. I’ve had girls that just regard sex as something they put up with and thought they didn’t enjoy. \n\nThose last two starfish and just want to lay there until you’re done. I want participation at bare minimum…with a couple backflips",
            "author": null,
            "id": "hnt0dj2",
            "parent_id": "t1_hnswt4z",
            "score": 2,
            "created_utc": 1639018766.0,
            "replies": [
                {
                    "body": "Not giving head is a safety choice. You can get nearly every STI through head that you can from sex.",
                    "author": "HailToTheQuinn",
                    "id": "hnt5w3l",
                    "parent_id": "t1_hnt0dj2",
                    "score": 7,
                    "created_utc": 1639021355.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Write your own post then? \n\nThis isn’t “steps to be a SB”. It’s shitty out there for SBs too and they deal with a lot of things themselves. I’m not denying that. I could make my own post about SBs and what they deal with but I’m not one, so it probably wouldn’t be accurate\n\nDefensive much though? Me pointing out the ways things go wrong doesn’t make me a grump, I’ve lived these experiences. I’ll post more and you’ll hear about successes too.",
            "author": null,
            "id": "hnrx8wl",
            "parent_id": "t1_hnrtmga",
            "score": 3,
            "created_utc": 1639001620.0,
            "replies": [
                {
                    "body": "Sounds like you need to get la... oh, I get it now.",
                    "author": "HoosierSdaddie",
                    "id": "hns1omf",
                    "parent_id": "t1_hnrx8wl",
                    "score": 4,
                    "created_utc": 1639003428.0,
                    "replies": [
                        {
                            "body": "La…dies?\nLa..ughed at ?\nLa..proscopic surgery ?\nLa..p dances ?\nLa..minated ? \nLa..sting love?",
                            "author": null,
                            "id": "hns727m",
                            "parent_id": "t1_hns1omf",
                            "score": 3,
                            "created_utc": 1639005693.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Age shaming at its very best! How do you know OP is a GOM? Just because he is an SD? Maybe you ought to seek out better and more youthful SDs.",
            "author": null,
            "id": "hnsdum1",
            "parent_id": "t1_hnrtmga",
            "score": 1,
            "created_utc": 1639008727.0,
            "replies": [
                {
                    "body": "Wow. You are incredibly detail oriented.",
                    "author": "HoosierSdaddie",
                    "id": "hos39vb",
                    "parent_id": "t1_hnsdum1",
                    "score": 1,
                    "created_utc": 1639662842.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Sounds like you’re not being picky enough.",
            "author": null,
            "id": "hnrha2h",
            "parent_id": "t1_hnrcey7",
            "score": 2,
            "created_utc": 1638995487.0,
            "replies": [
                {
                    "body": "I thought so too. I don't message that much but have great success on setting up M&G and not getting flaked. You can say that my filtering method is a bit more polished.",
                    "author": "HistoricalMap8698",
                    "id": "hnrlfcy",
                    "parent_id": "t1_hnrha2h",
                    "score": 3,
                    "created_utc": 1638997033.0,
                    "replies": []
                },
                {
                    "body": "what makes you say that?\n\nI liked both women, and the feeling was mutual.",
                    "author": null,
                    "id": "hnrw7mi",
                    "parent_id": "t1_hnrha2h",
                    "score": 2,
                    "created_utc": 1639001208.0,
                    "replies": [
                        {
                            "body": "I’ll go on tons of M&G’s and I end up not liking them in person or they’re just ok. Id rather have a SR that is a 10/10’ out of my league than just an average looking girl.",
                            "author": null,
                            "id": "hns3vxy",
                            "parent_id": "t1_hnrw7mi",
                            "score": 0,
                            "created_utc": 1639004339.0,
                            "replies": [
                                {
                                    "body": "I explained that I went 2/2 and set up relationships with  women that I already described as young, hot, and attentive-\n\nand you made this about you and a hypothetical average looking girl lmao.",
                                    "author": null,
                                    "id": "hnshio9",
                                    "parent_id": "t1_hns3vxy",
                                    "score": 3,
                                    "created_utc": 1639010368.0,
                                    "replies": [
                                        {
                                            "body": "Ok",
                                            "author": null,
                                            "id": "hnshlrh",
                                            "parent_id": "t1_hnshio9",
                                            "score": 0,
                                            "created_utc": 1639010407.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I don’t share detailed information for anonymity reasons but I’m between 30-40, 5’11, 155 lbs, in good shape (abs and muscles but not a body builder), million+ net worth, allowance that is slightly above the average for my city. \n\nI only go for girls less than 25 (predominantly 18-22) and who is rate 8 or above. That is a big reason I deal with the BS this post \n\nYou have had some success but you can’t base it on being favorited. Being “favorited” means jack on there since there are many steps between that and actually getting a SB. \n\nTbh this post is more of a collection of all the things that go wrong at every step. I always have somewhere between 2-5 SBs and generally I’m happy with them. \n\nIf you do this long enough (7 years) you will experience all of these things regardless of who you are.",
            "author": null,
            "id": "hnreh6t",
            "parent_id": "t1_hnrcey7",
            "score": 4,
            "created_utc": 1638994418.0,
            "replies": [
                {
                    "body": "People are taking your post too seriously and word for word. I quite enjoyed reading it and it's very common to come across these secnarios.",
                    "author": "chemistryromance",
                    "id": "hns6r1m",
                    "parent_id": "t1_hnreh6t",
                    "score": 6,
                    "created_utc": 1639005563.0,
                    "replies": [
                        {
                            "body": "Thanks. I tried to say it’s snark, but people don’t see the humor in the frustration and are taking it seriously. Someone said I hate women because I posted this! Like damn",
                            "author": null,
                            "id": "hns7eyz",
                            "parent_id": "t1_hns6r1m",
                            "score": 3,
                            "created_utc": 1639005845.0,
                            "replies": [
                                {
                                    "body": "Focus on the good comments, and there are quite a few on your post, but I get it, it's difficult to ignore the negative ones when they come as a personal attack. Also remember to get your blood pressure checked tomorrow :)",
                                    "author": "chemistryromance",
                                    "id": "hns8n3f",
                                    "parent_id": "t1_hns7eyz",
                                    "score": 2,
                                    "created_utc": 1639006388.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Are you me? lol. About the same stats but I go for girls 18-40 (bigger range) and super picky 8 or above as well. If we're paying $$$ then def want to make it worth! But great post!\n\nI do have SBs now that now I see platonically just cause those girls are fun to be around with (as they also have fun with me). Also, it's always good to surround yourself with beautiful women!",
                    "author": "HistoricalMap8698",
                    "id": "hnrl8xr",
                    "parent_id": "t1_hnreh6t",
                    "score": 3,
                    "created_utc": 1638996965.0,
                    "replies": []
                },
                {
                    "body": "You're going for the worst demographic and having the worst experience.",
                    "author": "JeaneyBowl",
                    "id": "hnrrls3",
                    "parent_id": "t1_hnreh6t",
                    "score": 8,
                    "created_utc": 1638999404.0,
                    "replies": [
                        {
                            "body": "But they’re soooo hot lol\n\nYou’re right though, to a degree I bring the pain on myself. This is snarky but I’ve also had a some great experiences in the bowl with amazing women. I just had a bad day the other day and wrote this out as bit of a vent. All of this has happened to me though and I think other new SDs should be aware",
                            "author": null,
                            "id": "hnrxred",
                            "parent_id": "t1_hnrrls3",
                            "score": 4,
                            "created_utc": 1639001825.0,
                            "replies": [
                                {
                                    "body": "Unfortunately the hot girls don't have to develop a personality or any sort of redeemable skills 90% of the time.",
                                    "author": "HeilerinVonDoom",
                                    "id": "hnsbe4x",
                                    "parent_id": "t1_hnrxred",
                                    "score": 1,
                                    "created_utc": 1639007613.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "I usually hide my profile tbh and only message people who I’m interested in. 18-22 crowd can be fun, best part is they can’t order a ton of expensive drinks and dinner if under 21 and you have a built in excuse to go back to your place (we can drink there…). But yeah the younger crowd can flake a lot",
                    "author": "sdthrowaway568",
                    "id": "hnrff2y",
                    "parent_id": "t1_hnreh6t",
                    "score": -4,
                    "created_utc": 1638994777.0,
                    "replies": [
                        {
                            "body": ">best part is they can’t order a ton of expensive drinks and dinner\n\nIf *that*'s the *best* part, you must be fun to be around.",
                            "author": "Inner_Examination_38",
                            "id": "hnrhohr",
                            "parent_id": "t1_hnrff2y",
                            "score": 9,
                            "created_utc": 1638995640.0,
                            "replies": [
                                {
                                    "body": "Should say at dinner, I’m a hoot. You haven’t lived until you’ve had a sugar baby try to order a $300 bottle of wine on a meet and greet (and not at a nice restaurant usually, just literally the most expensive one)",
                                    "author": "sdthrowaway568",
                                    "id": "hnrhzah",
                                    "parent_id": "t1_hnrhohr",
                                    "score": 1,
                                    "created_utc": 1638995751.0,
                                    "replies": [
                                        {
                                            "body": "I see you may have posted a number which is most likely an amount in relations to an arrangement. If this is the case, you are violating Rule #4 - \"No dollar amounts that are in reference to allowance/PPM are allowed.\"\n\nIf you are curious about Allowances reported by SLF contributors please see the [Allowance Master Thread 2021-2022](/r/sugarlifestyleforum/comments/pc22tk/allowance_master_thread_20212022/).\n\nYour post will not be approved until you remove the amount.  Please read the sub [Rules](/r/sugarlifestyleforum/comments/748zta/updated_and_clarified_rules_for_slf/) prior to posting anything else. \n\nIf you simply posted a number not referencing a monetary amount, please message the MODs to approve your post.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/sugarlifestyleforum) if you have any questions or concerns.*",
                                            "author": "AutoModerator",
                                            "id": "hnri1mt",
                                            "parent_id": "t1_hnrhzah",
                                            "score": -3,
                                            "created_utc": 1638995775.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "I actually don’t mind the expensive drinks and meals if they are fun and serious about wanting an arrangement. Problem is many girls aren’t but want that anyway so it’s a time waste",
                            "author": null,
                            "id": "hnrn2ec",
                            "parent_id": "t1_hnrff2y",
                            "score": 1,
                            "created_utc": 1638997657.0,
                            "replies": []
                        },
                        {
                            "body": "yikes",
                            "author": "c0rnstarr",
                            "id": "hnrsm41",
                            "parent_id": "t1_hnrff2y",
                            "score": 1,
                            "created_utc": 1638999799.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I don't understand the quick-to-block approach.\n\nWhat if the other party is just overwhelmed or brain-fazed and three weeks later goes through the guys they lost track of and want to reconnect with you?\n\nIs the issue that you want to keep  decluttering and, perhaps, you're in a market  with an endless new joiners, such NYC metro.\n\nOr, is your experience that people who let the conversation drizzle are never worth the time, i.e. if they do reply down the road you have to review their history and that's a drain on your focus.",
            "author": "Hyceanplanet",
            "id": "hnrscr3",
            "parent_id": "t1_hnrrc01",
            "score": 3,
            "created_utc": 1638999696.0,
            "replies": [
                {
                    "body": "It's a feel thing. You just know from the inbox and text conversations it's going nowhere and a time waste. And like the OP said they will out themselves in the conversation if listen and ask the right questions. Just this month I've had two POT who were just trying to finesse for some quick holiday cash. Not knocking the hustle. I'm just wrong target. It's Holiday Desperation Season.\n\nI do live in a target rich market within a 100 mile radius. I could go 250 and find some gems right outside of 100. Yes, there is ALWAYS newcomers in my area. Always.",
                    "author": "southernslick",
                    "id": "hnru0pz",
                    "parent_id": "t1_hnrscr3",
                    "score": 4,
                    "created_utc": 1639000347.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Exactly! You totally understand…and also seem to have the same type as me so save a few SBs for me haha. \n\nSometimes the difficultly makes you really relish the success when it finally works. \n\nI’ve literally been with SBs and thought “this is fucking perfect, like heaven” and I wonder sometimes if it was as easy if I’d appreciate it as much",
            "author": null,
            "id": "hnsho79",
            "parent_id": "t1_hnsercf",
            "score": 1,
            "created_utc": 1639010438.0,
            "replies": []
        },
        {
            "body": "Yes, complaining about all the ways things go wrong in the bowl means “I hate women” 🙄. \n\nI love women, I just don’t like being stood up, scammed, not having my time respected like I respect theirs, and being expected to drop thousands of dollars for the experience when the other person is entitled and providing me nothing. There are great women in the bowl, but also some real duds\n\nIf you think all women are perfect angels, never scam guys, and shouldn’t ever be criticized, I hate to say it but you’re naive and highly biased. \n\nCriticizing shitty behavior women engage in doesn’t mean I hate all women generally",
            "author": null,
            "id": "hnrwaid",
            "parent_id": "t1_hnruxg2",
            "score": 5,
            "created_utc": 1639001240.0,
            "replies": [
                {
                    "body": "i've had my same SA account for 10 years. i'm no stranger to the annoyances and frustrations. i left my comment because reading this post of complaints was like....well, what do you expect? you're an older man who wants to have sex with younger women with no real life repercussions - yeah, you're going to have to deal with bullshit\n\ni'm a mid 30's woman - if i decided i wanted to sleep with exclusively young 20 something men and took to tinder to do so, i'd face the same frustrations. flaking, having to pay for things, tedious conversation, nothing really in common, life issues cropping up, etc. \n\nthat's the price to pay for dating people decade(s) younger than yourself",
                    "author": "ambientscreaming",
                    "id": "hnry7th",
                    "parent_id": "t1_hnrwaid",
                    "score": 7,
                    "created_utc": 1639002006.0,
                    "replies": [
                        {
                            "body": "Fair point, but I don’t hate women just because I don’t like those annoyances. I hate the annoyance, not the woman \n\nI’ve met plenty of younger women that _aren’t_ any way like what I complain about, so I know to a degree younger women are choosing to be these ways. I wish they wouldn’t be, so I’m complaining and trying to make newer SDs aware of what they would have to deal with \n\nI agree though, it’s going to come with the territory if those are the women I go for. I bring it on myself to a degree. Perhaps I’ll need to change that",
                            "author": null,
                            "id": "hnryw0k",
                            "parent_id": "t1_hnry7th",
                            "score": 3,
                            "created_utc": 1639002274.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I’ve thought about this too and once I hired a company (VIDA) to manage 4 different vanilla dating apps (not seeking). They got me dates but messed up regularly and I wasn’t happen with the return on my investment \n\nI’d love to hire someone to manage the SA messaging. Jealous you have a good system",
            "author": null,
            "id": "hnsi051",
            "parent_id": "t1_hnsdtux",
            "score": 2,
            "created_utc": 1639010590.0,
            "replies": [
                {
                    "body": "As a fan of organization, and HR background, I would definitely apply to be a virtual assistant. \n\nThat is brilliant.  Sorry it didn't work out.",
                    "author": "Syster_Spyder_695",
                    "id": "hnthlmg",
                    "parent_id": "t1_hnsi051",
                    "score": 1,
                    "created_utc": 1639027604.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Okay smart guy, what’s your strategy for vetting SBs who are bad in bed ? Or who will try to rinse you after you get their number? \n\nYou act like these things can be “vetted” by looking at a girls profile but in no way is that true. The only way to eliminate these girls is to eliminate girls under 25 who are borderline too pretty to be on SA. For me, that’s the _entire point_ of being on there",
            "author": null,
            "id": "hntkcrc",
            "parent_id": "t1_hntim1q",
            "score": 0,
            "created_utc": 1639029277.0,
            "replies": [
                {
                    "body": "Chemistry. Don't just look for a girl who is hot. I've never had bad sex with a woman I had good chemistry with. Every time I've had bad sex with someone, we didn't have good chemistry.\n\nAs for rinsing, make it clear you aren't going to give them anything before the first non-platonic date. End it at the first sign that they are going to try to rinse you. I've never been rinsed.",
                    "author": "AShatteredKing",
                    "id": "hntlgi3",
                    "parent_id": "t1_hntkcrc",
                    "score": 5,
                    "created_utc": 1639029986.0,
                    "replies": [
                        {
                            "body": "Chemistry is important and I think that’s a good suggestion, but for me, someone hot and young is the goal. If I was trying to maximize intrapersonal chemistry, I’d vanilla date someone close to my age, not a 20 yr old college student \n\nAnd I’m guessing you’re one of those guys that the second message on SA you send a novel that outlines all the rules. Personally I like to get an idea for who the SB is as a person first, which (to your point) does allow them to reveal themselves as a rinser later. I’ve found that being authoritative about expectations first several messages does not lead to success",
                            "author": null,
                            "id": "hnvy6it",
                            "parent_id": "t1_hntlgi3",
                            "score": 1,
                            "created_utc": 1639076968.0,
                            "replies": [
                                {
                                    "body": "Having good chemistry doesn't mean you are trying to maximize the chemistry; that's a false dichotomy. Take your time and find a woman that fits you well. There are A LOT of young beautiful women who want SDs.",
                                    "author": "AShatteredKing",
                                    "id": "hnwmwi9",
                                    "parent_id": "t1_hnvy6it",
                                    "score": 1,
                                    "created_utc": 1639086916.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Check the wiki for that - [here’s a link ](/r/sugarlifestyleforum/wiki/advice/new_sbs?utm_source=share&utm_medium=ios_app&utm_name=iossmf)",
            "author": null,
            "id": "hnrpcnl",
            "parent_id": "t1_hnrp43a",
            "score": 3,
            "created_utc": 1638998540.0,
            "replies": []
        },
        {
            "body": "Exactly. You’d think because you’re not committing to a vanilla romantic relationship that sugar would be easier, but in fact it brings its own time sucks. It’s difficult to maintain any relationships and maximize your success elsewhere",
            "author": null,
            "id": "hnrzfq7",
            "parent_id": "t1_hnrud82",
            "score": 2,
            "created_utc": 1639002496.0,
            "replies": []
        },
        {
            "body": "I legit lol’d at those first 8 words",
            "author": "avibrator",
            "id": "hnsva1g",
            "parent_id": "t1_hnsrrcu",
            "score": 5,
            "created_utc": 1639016481.0,
            "replies": []
        },
        {
            "body": "One reason why some commenters to your post seem to be missing the point -- or overlooking the point -- is that you seem to have high level sales experience.\n\nOne aspect I find immensely useful/clarifying is that you've structured the process into the sort of sales system that helps put the right context to the minute-by-minute ups and downs of what is a meandering, rejection-filled and circular process.\n\nWhat's not your point is whether X salesperson (SD) has Y or Z level of relative efficiency. Some salesperson in NYC with a grad degree from MIT will do better in tech device sales than another salesperson at the same company in Michigan with a state degree. These variances have nothing to do with whether the system design is good.\n\n\\--\n\nIf I can press a bit deeper on your casual vs dress reply (which was richly detailed and spot-on a direct response:)\n\n...And I realize there's no way you would have a solid answer for this ....so just intuitvely....:\n\nDo you find that how they dress -- even badly -- has any correlation to whether things work out with them? Young women have chaotic lives -- juggling so much stuff -- and their showing up, to my view (until you correct me, which I would appreciate) is their way of showing you that they really wanted to meet you. Otherwise they would have cancelled, realizing they just didn't have the focus/breathing room to get all the right pieces together....they don't have time to dress or brush their teeth.\n\nTo my view, the examples you give show someone who really wanted to meet you....hence I'm wondering if there is even a positivie correlation between the people who can barely pull it off to get there (making things work even though they are barefly above water.)\n\nThere's a cool scene in one of Will Smith's movies which underscores this point -- that, sometimes, if someone shows up to a stress meeting and they know they don't look their best, it's that they *really* want to be there. \n\n[https://youtu.be/UUDKEbX5OQw](https://youtu.be/UUDKEbX5OQw) (link to scene)",
            "author": "Hyceanplanet",
            "id": "hnsa196",
            "parent_id": "t1_hns5wn3",
            "score": 2,
            "created_utc": 1639007007.0,
            "replies": [
                {
                    "body": "I'm afraid I'd have to agree on OP with this one. While your counter argument is valid, showing up dressed so casually you may as well be wearing pjs, and have it reasoned as \"yes but she/they *really really* want to be there, because you're important!\" Just really isn't right. \n\nShowing up because you really want to be there is of course the truth. That is the point of the meeting. And yes, our lives do get chaotic. I will openly admit I've done similar things, (though not perhaps to such an extent where I showed up to an important meeting in slippers and sweats) where I prioritized comfort over aesthetic. \n\nBut if, as you say, this woman/person really and truly felt you as the POT were so important that they had to meet you no matter what, they should have still put in effort. \n\nI didn't memories which number this is under, but if the lady that OP mentioned in his earlier replies, woke up 5mins before their meeting, she could have called (hoping she did) to apologize for being tardy, and that she'd be there in XY minutes. \n\nGiving herself enough time to run some dry shampoo through her hair, put on some light make up, picked a nicer outfit, brushed her teeth, and met OP looking like she wanted to be there and *showing* that she wanted to be there. \n\nIt happens. Sometimes life is cruel to all your carefully laid out plans. \n\nBut regardless, meeting a POT for the 1st time is really more akin to a job interview (hence the stress). And I don't know about other women, but even if I didn't want to be there, I'd still show up, and be dressed appropriately. \n\nI never got to be an SB though I've always wanted to be one. I wouldn't have minded the intimacy, and honestly an allowance would have helped so many of my current financial issues. \n\nBut SB type relationships aren't really a thing in my country. Well, they are, but only with a very very specific looking type of woman, and sadly, I am not such a woman. And online SDs are majorly a scam, and not plausible anyway because of the long distance. \n\nBut I know that had I been lucky enough to have someone interested in me like that, I would have put in the maximum of all efforts. Because they chose me, and chose to help me. And the next best thing I can do to show gratitude is do my best to meet their expectations and make them happy and content. \n\nSo sad that some women take this chance for granted. \n\nSorry for the rant 😅",
                    "author": "Rowan-the-Girlfriend",
                    "id": "hnsx5ie",
                    "parent_id": "t1_hnsa196",
                    "score": 8,
                    "created_utc": 1639017313.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "hnuav78",
                            "parent_id": "t1_hnsx5ie",
                            "score": 2,
                            "created_utc": 1639050272.0,
                            "replies": [
                                {
                                    "body": "What I post is part of my part time job to get some influx of cash. That does not mean that I wouldn't like to actually meet someone and have them help me in such a way that what I do on the side is no longer necessary to help pay my bills, or buy a Christmas present for my little niece and nephews. \n\nMy \"exuberant\" photos don't correlate to what I was speaking of. So they shouldn't be used in your argument in the first place.",
                                    "author": "Rowan-the-Girlfriend",
                                    "id": "hnubeeq",
                                    "parent_id": "t1_hnuav78",
                                    "score": 2,
                                    "created_utc": 1639050657.0,
                                    "replies": [
                                        {
                                            "body": "[deleted]",
                                            "author": null,
                                            "id": "hnuclzm",
                                            "parent_id": "t1_hnubeeq",
                                            "score": 2,
                                            "created_utc": 1639051520.0,
                                            "replies": [
                                                {
                                                    "body": "I am not so fragile that a misunderstanding of flowery language will hurt my glass-like feelings. I also know what exuberant means. I grew up in North America, English is my first language. And though I now live back in my hometown, in the country of my birth here in Europe, I can assure you there is no cultural gap between us. \n\nI am accustomed to men believing certain things about what I currently do, and that's what your comment sounded like to me. Which is why I said what I do on the side shouldn't have had any bearing to what I was referring to in my previous comments. What I said stands. \n\nSuffice to say I write a lot in my day job too, as a freelance editor, among other things. But I prefer being clear with my words. \n\nAs one writer to another, perhaps take that as an approach, rather than diplomatically trying to bounce around from one flowery word to another, to avoid further confusions in future.",
                                                    "author": "Rowan-the-Girlfriend",
                                                    "id": "hnud9wq",
                                                    "parent_id": "t1_hnuclzm",
                                                    "score": 4,
                                                    "created_utc": 1639051975.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Girls under 25 who have no idea what they're doing? No wonder why you're experience is so bad...",
            "author": null,
            "id": "hns25p7",
            "parent_id": "t1_hnrinjp",
            "score": 12,
            "created_utc": 1639003623.0,
            "replies": []
        },
        {
            "body": "Like 5 years. Yeah I did see that you go for under 25 which is my demographic too. I usually try to set up a meeting for same or next day after a few messages at semi nice restaurant or drink place. Obviously a lot can’t meet same day but those that do are usually legit. If I set up a meeting that isn’t same or next day, I accept that there is ~75% chance it won’t go through",
            "author": "sdthrowaway568",
            "id": "hnrj6uo",
            "parent_id": "t1_hnrinjp",
            "score": 3,
            "created_utc": 1638996205.0,
            "replies": [
                {
                    "body": "If they cannot get to my side of town then I cannot do anything for them.",
                    "author": "Major-Editor-2016",
                    "id": "hns9df2",
                    "parent_id": "t1_hnrj6uo",
                    "score": 3,
                    "created_utc": 1639006710.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I just imagine this being said with the satirical personality of Brain from Pinky and the Brain",
            "author": "avibrator",
            "id": "hnsuiu6",
            "parent_id": "t1_hnry7of",
            "score": 2,
            "created_utc": 1639016148.0,
            "replies": []
        },
        {
            "body": "When I was first using SA, I was stood up 3 times by the same lady. In between, she apologized profusely and begged for another chance.\n\nThe rest of the story....a year later she contacts me and wants to meet. I say come to my home Sunday morning 8 AM, figuring no way. Damn if she doesn't show up and we had a 9 month SR.",
            "author": "AFSMSgt",
            "id": "hnrl30o",
            "parent_id": "t1_hnri5oi",
            "score": 9,
            "created_utc": 1638996903.0,
            "replies": [
                {
                    "body": "Whoa that’s a crazy story. Like I can’t believe she showed, especially since you made it the morning lol. I don’t know what it is with some SBs but sometimes they just need something to click so they show up and take it seriously. \n\nSimilarly I had a girl I messaged off and on  that never would make time to meet up. One day over a year later she did finally agree. I ended up having a 10 month arrangement with her. I have no idea why it worked then and not before",
                    "author": null,
                    "id": "hnro64u",
                    "parent_id": "t1_hnrl30o",
                    "score": 4,
                    "created_utc": 1638998090.0,
                    "replies": [
                        {
                            "body": "Bitches be crazy. The big bang theory mail man had it right.",
                            "author": "AFSMSgt",
                            "id": "hnsqspx",
                            "parent_id": "t1_hnro64u",
                            "score": 2,
                            "created_utc": 1639014510.0,
                            "replies": [
                                {
                                    "body": "Honestly sometimes it might just be that lol. They probably think we’re crazy ourselves",
                                    "author": null,
                                    "id": "hnsrbze",
                                    "parent_id": "t1_hnsqspx",
                                    "score": 1,
                                    "created_utc": 1639014744.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "To borrow an old phrase \n\nSimplicity is the ultimate sophistication",
                    "author": "pinotandsugar",
                    "id": "hnrpbnd",
                    "parent_id": "t1_hnrl30o",
                    "score": 4,
                    "created_utc": 1638998529.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "that is why I require them to get to my side of town and text or call when they are 20 minutes away.\n\nAnd then when they text at the 20 min mark I ask them to tell me what cross road or land mark they can see.\n\nEvery girl I drove a distance to meet had too many problems to be useful to me. (grossly inflated ego, unconscionable financial demand, no car, alcohol issues...) \n\nRemember: they are the ones with the time.",
            "author": "Major-Editor-2016",
            "id": "hns90ms",
            "parent_id": "t1_hnri5oi",
            "score": 4,
            "created_utc": 1639006556.0,
            "replies": [
                {
                    "body": "Smart, I’m honestly always offering to come to them with the hopes they will be more likely to not flake. \n\nSeems fair to ask them to come to me if they are actually invested and want it to work though",
                    "author": null,
                    "id": "hnsa6w1",
                    "parent_id": "t1_hns90ms",
                    "score": 2,
                    "created_utc": 1639007077.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "If you tune your process right, you can catch most of that.\n\n1st, schedule a M&G quickly.  That filters out people who have no intent on meeting or don’t look reasonably like their photos.\n\nTo filter out no-shows, either double-book the M&G or tell them to text you when they are on their way, and then don’t leave until you get the text.\n\nAt every point in the process, there are things you can do to filter out people who aren’t good candidates for SR.\n\nWhat you are left with is good candidates, and fun exploring the opportunities.",
            "author": "robhudsondfw",
            "id": "hnt2o3w",
            "parent_id": "t1_hnt1rw4",
            "score": 3,
            "created_utc": 1639019825.0,
            "replies": []
        },
        {
            "body": "Yes I think it really helped that I was genuinely interested in my SD :). I kind of broke all the rules and started vanilla dating him and he has been my partner for two years now haha. My entire life is funded by him and I also love him very much, so needless to say sometimes sending ahead of time can benefit both sides, and isn’t always a scam.",
            "author": null,
            "id": "hnsroji",
            "parent_id": "t1_hnsqski",
            "score": 3,
            "created_utc": 1639014898.0,
            "replies": [
                {
                    "body": "Love this story and huge congrats for finding someone amazing through all the pitfalls I listed out. Things are so much better when you’re actually interested in your sugar partner enough for a relationship like that \n\nI have a rough time with monogamy and having just one girl, but what you have is kinda the dream after I settle down.",
                    "author": null,
                    "id": "hnsspub",
                    "parent_id": "t1_hnsroji",
                    "score": 2,
                    "created_utc": 1639015358.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "That’s why I’m sticking with vanilla for now. Saved an extra ~60k since COVID began. It’s remarkable how much I used to spend in this lifestyle.",
            "author": "sdthrowaway006",
            "id": "hnt6av7",
            "parent_id": "t1_hnsiovo",
            "score": 1,
            "created_utc": 1639021554.0,
            "replies": []
        },
        {
            "body": " thats interesting, i hadnt considered different lifestyles attracting different incomes.",
            "author": "c0rnstarr",
            "id": "hnrw04t",
            "parent_id": "t1_hnruwcj",
            "score": 2,
            "created_utc": 1639001125.0,
            "replies": []
        },
        {
            "body": "[removed]",
            "author": null,
            "id": "hnsuncp",
            "parent_id": "t1_hnruwcj",
            "score": 2,
            "created_utc": 1639016202.0,
            "replies": []
        },
        {
            "body": "It just sounds like you simply don’t like human aspects to women in this kind of dynamic, and honestly doesn’t sound like you want an actual relationship or enjoy this process. I think escorts would simplify everything you’re complaining about",
            "author": "c0rnstarr",
            "id": "hntb34l",
            "parent_id": "t1_hnsu9f6",
            "score": 6,
            "created_utc": 1639024002.0,
            "replies": [
                {
                    "body": " No, that’s not it and don’t get how you’re getting that interpretation. \n\nExample, step 4, why would you interpret that I don’t like human aspects of women or “this dynamic” when it seems pretty clear I’m complaining about rinsers specifically? I don’t like SBs wasting my time and asking for money before they’ve even met me. I don’t like scams. I’m sure you don’t like scammer SDs either and I’m not suggesting you find a “John”\n\nThere are good SBs that don’t do any of these things. I have a couple of them right now, we have a relationship. They didn’t try to scam me or waste my time so it works.\n\nIf you think the disrespect, wasting other people’s  time, or scamming are a central part of this “dynamic” you’re probably a terrible SB",
                    "author": null,
                    "id": "hntlpa1",
                    "parent_id": "t1_hntb34l",
                    "score": 0,
                    "created_utc": 1639030147.0,
                    "replies": [
                        {
                            "body": "I seem to have struck a chord. \n\nI’m not saying anything about scamming, not sure where you got that from. I’m saying that the entirety of this post is a negative rant about how SBs make this process horrible for you. You say you want a relationship and then complain when they “get too attached”, they’re always sexually boring or can’t hold a conversation, etc. you say yourself it’s barely worth it. \n\nSoooo yeah, sounds like it’s time to switch things up",
                            "author": "c0rnstarr",
                            "id": "hnuvf8o",
                            "parent_id": "t1_hntlpa1",
                            "score": 5,
                            "created_utc": 1639061568.0,
                            "replies": [
                                {
                                    "body": "I don’t have enough space in a single Reddit post to describe all my feelings about sugaring but many of them are positive. This a snarky slice at the difficulties that come with it, mostly so newer SDs can see where it fails. I like sugaring enough to keep at it; the successes make it worth it\n\nSBs should always ask “why isn’t this guy just vanilla dating instead of spending money”. For me, it’s that I don’t want to be anyone’s boyfriend or spend a huge amount of time together. I would vanilla date if I wanted that. So yes, I want a relationship with less attachment than a GF and I think that should be okay in sugaring. I don’t like when SBs don’t respect that",
                                    "author": null,
                                    "id": "hnw1lwi",
                                    "parent_id": "t1_hnuvf8o",
                                    "score": 1,
                                    "created_utc": 1639078352.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Not giving head is a safety choice. You can get nearly every STI through head that you can from sex.",
            "author": "HailToTheQuinn",
            "id": "hnt5w3l",
            "parent_id": "t1_hnt0dj2",
            "score": 7,
            "created_utc": 1639021355.0,
            "replies": []
        },
        {
            "body": "Sounds like you need to get la... oh, I get it now.",
            "author": "HoosierSdaddie",
            "id": "hns1omf",
            "parent_id": "t1_hnrx8wl",
            "score": 4,
            "created_utc": 1639003428.0,
            "replies": [
                {
                    "body": "La…dies?\nLa..ughed at ?\nLa..proscopic surgery ?\nLa..p dances ?\nLa..minated ? \nLa..sting love?",
                    "author": null,
                    "id": "hns727m",
                    "parent_id": "t1_hns1omf",
                    "score": 3,
                    "created_utc": 1639005693.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Wow. You are incredibly detail oriented.",
            "author": "HoosierSdaddie",
            "id": "hos39vb",
            "parent_id": "t1_hnsdum1",
            "score": 1,
            "created_utc": 1639662842.0,
            "replies": []
        },
        {
            "body": "I thought so too. I don't message that much but have great success on setting up M&G and not getting flaked. You can say that my filtering method is a bit more polished.",
            "author": "HistoricalMap8698",
            "id": "hnrlfcy",
            "parent_id": "t1_hnrha2h",
            "score": 3,
            "created_utc": 1638997033.0,
            "replies": []
        },
        {
            "body": "what makes you say that?\n\nI liked both women, and the feeling was mutual.",
            "author": null,
            "id": "hnrw7mi",
            "parent_id": "t1_hnrha2h",
            "score": 2,
            "created_utc": 1639001208.0,
            "replies": [
                {
                    "body": "I’ll go on tons of M&G’s and I end up not liking them in person or they’re just ok. Id rather have a SR that is a 10/10’ out of my league than just an average looking girl.",
                    "author": null,
                    "id": "hns3vxy",
                    "parent_id": "t1_hnrw7mi",
                    "score": 0,
                    "created_utc": 1639004339.0,
                    "replies": [
                        {
                            "body": "I explained that I went 2/2 and set up relationships with  women that I already described as young, hot, and attentive-\n\nand you made this about you and a hypothetical average looking girl lmao.",
                            "author": null,
                            "id": "hnshio9",
                            "parent_id": "t1_hns3vxy",
                            "score": 3,
                            "created_utc": 1639010368.0,
                            "replies": [
                                {
                                    "body": "Ok",
                                    "author": null,
                                    "id": "hnshlrh",
                                    "parent_id": "t1_hnshio9",
                                    "score": 0,
                                    "created_utc": 1639010407.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "People are taking your post too seriously and word for word. I quite enjoyed reading it and it's very common to come across these secnarios.",
            "author": "chemistryromance",
            "id": "hns6r1m",
            "parent_id": "t1_hnreh6t",
            "score": 6,
            "created_utc": 1639005563.0,
            "replies": [
                {
                    "body": "Thanks. I tried to say it’s snark, but people don’t see the humor in the frustration and are taking it seriously. Someone said I hate women because I posted this! Like damn",
                    "author": null,
                    "id": "hns7eyz",
                    "parent_id": "t1_hns6r1m",
                    "score": 3,
                    "created_utc": 1639005845.0,
                    "replies": [
                        {
                            "body": "Focus on the good comments, and there are quite a few on your post, but I get it, it's difficult to ignore the negative ones when they come as a personal attack. Also remember to get your blood pressure checked tomorrow :)",
                            "author": "chemistryromance",
                            "id": "hns8n3f",
                            "parent_id": "t1_hns7eyz",
                            "score": 2,
                            "created_utc": 1639006388.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Are you me? lol. About the same stats but I go for girls 18-40 (bigger range) and super picky 8 or above as well. If we're paying $$$ then def want to make it worth! But great post!\n\nI do have SBs now that now I see platonically just cause those girls are fun to be around with (as they also have fun with me). Also, it's always good to surround yourself with beautiful women!",
            "author": "HistoricalMap8698",
            "id": "hnrl8xr",
            "parent_id": "t1_hnreh6t",
            "score": 3,
            "created_utc": 1638996965.0,
            "replies": []
        },
        {
            "body": "You're going for the worst demographic and having the worst experience.",
            "author": "JeaneyBowl",
            "id": "hnrrls3",
            "parent_id": "t1_hnreh6t",
            "score": 8,
            "created_utc": 1638999404.0,
            "replies": [
                {
                    "body": "But they’re soooo hot lol\n\nYou’re right though, to a degree I bring the pain on myself. This is snarky but I’ve also had a some great experiences in the bowl with amazing women. I just had a bad day the other day and wrote this out as bit of a vent. All of this has happened to me though and I think other new SDs should be aware",
                    "author": null,
                    "id": "hnrxred",
                    "parent_id": "t1_hnrrls3",
                    "score": 4,
                    "created_utc": 1639001825.0,
                    "replies": [
                        {
                            "body": "Unfortunately the hot girls don't have to develop a personality or any sort of redeemable skills 90% of the time.",
                            "author": "HeilerinVonDoom",
                            "id": "hnsbe4x",
                            "parent_id": "t1_hnrxred",
                            "score": 1,
                            "created_utc": 1639007613.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I usually hide my profile tbh and only message people who I’m interested in. 18-22 crowd can be fun, best part is they can’t order a ton of expensive drinks and dinner if under 21 and you have a built in excuse to go back to your place (we can drink there…). But yeah the younger crowd can flake a lot",
            "author": "sdthrowaway568",
            "id": "hnrff2y",
            "parent_id": "t1_hnreh6t",
            "score": -4,
            "created_utc": 1638994777.0,
            "replies": [
                {
                    "body": ">best part is they can’t order a ton of expensive drinks and dinner\n\nIf *that*'s the *best* part, you must be fun to be around.",
                    "author": "Inner_Examination_38",
                    "id": "hnrhohr",
                    "parent_id": "t1_hnrff2y",
                    "score": 9,
                    "created_utc": 1638995640.0,
                    "replies": [
                        {
                            "body": "Should say at dinner, I’m a hoot. You haven’t lived until you’ve had a sugar baby try to order a $300 bottle of wine on a meet and greet (and not at a nice restaurant usually, just literally the most expensive one)",
                            "author": "sdthrowaway568",
                            "id": "hnrhzah",
                            "parent_id": "t1_hnrhohr",
                            "score": 1,
                            "created_utc": 1638995751.0,
                            "replies": [
                                {
                                    "body": "I see you may have posted a number which is most likely an amount in relations to an arrangement. If this is the case, you are violating Rule #4 - \"No dollar amounts that are in reference to allowance/PPM are allowed.\"\n\nIf you are curious about Allowances reported by SLF contributors please see the [Allowance Master Thread 2021-2022](/r/sugarlifestyleforum/comments/pc22tk/allowance_master_thread_20212022/).\n\nYour post will not be approved until you remove the amount.  Please read the sub [Rules](/r/sugarlifestyleforum/comments/748zta/updated_and_clarified_rules_for_slf/) prior to posting anything else. \n\nIf you simply posted a number not referencing a monetary amount, please message the MODs to approve your post.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/sugarlifestyleforum) if you have any questions or concerns.*",
                                    "author": "AutoModerator",
                                    "id": "hnri1mt",
                                    "parent_id": "t1_hnrhzah",
                                    "score": -3,
                                    "created_utc": 1638995775.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "I actually don’t mind the expensive drinks and meals if they are fun and serious about wanting an arrangement. Problem is many girls aren’t but want that anyway so it’s a time waste",
                    "author": null,
                    "id": "hnrn2ec",
                    "parent_id": "t1_hnrff2y",
                    "score": 1,
                    "created_utc": 1638997657.0,
                    "replies": []
                },
                {
                    "body": "yikes",
                    "author": "c0rnstarr",
                    "id": "hnrsm41",
                    "parent_id": "t1_hnrff2y",
                    "score": 1,
                    "created_utc": 1638999799.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "It's a feel thing. You just know from the inbox and text conversations it's going nowhere and a time waste. And like the OP said they will out themselves in the conversation if listen and ask the right questions. Just this month I've had two POT who were just trying to finesse for some quick holiday cash. Not knocking the hustle. I'm just wrong target. It's Holiday Desperation Season.\n\nI do live in a target rich market within a 100 mile radius. I could go 250 and find some gems right outside of 100. Yes, there is ALWAYS newcomers in my area. Always.",
            "author": "southernslick",
            "id": "hnru0pz",
            "parent_id": "t1_hnrscr3",
            "score": 4,
            "created_utc": 1639000347.0,
            "replies": []
        },
        {
            "body": "i've had my same SA account for 10 years. i'm no stranger to the annoyances and frustrations. i left my comment because reading this post of complaints was like....well, what do you expect? you're an older man who wants to have sex with younger women with no real life repercussions - yeah, you're going to have to deal with bullshit\n\ni'm a mid 30's woman - if i decided i wanted to sleep with exclusively young 20 something men and took to tinder to do so, i'd face the same frustrations. flaking, having to pay for things, tedious conversation, nothing really in common, life issues cropping up, etc. \n\nthat's the price to pay for dating people decade(s) younger than yourself",
            "author": "ambientscreaming",
            "id": "hnry7th",
            "parent_id": "t1_hnrwaid",
            "score": 7,
            "created_utc": 1639002006.0,
            "replies": [
                {
                    "body": "Fair point, but I don’t hate women just because I don’t like those annoyances. I hate the annoyance, not the woman \n\nI’ve met plenty of younger women that _aren’t_ any way like what I complain about, so I know to a degree younger women are choosing to be these ways. I wish they wouldn’t be, so I’m complaining and trying to make newer SDs aware of what they would have to deal with \n\nI agree though, it’s going to come with the territory if those are the women I go for. I bring it on myself to a degree. Perhaps I’ll need to change that",
                    "author": null,
                    "id": "hnryw0k",
                    "parent_id": "t1_hnry7th",
                    "score": 3,
                    "created_utc": 1639002274.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "As a fan of organization, and HR background, I would definitely apply to be a virtual assistant. \n\nThat is brilliant.  Sorry it didn't work out.",
            "author": "Syster_Spyder_695",
            "id": "hnthlmg",
            "parent_id": "t1_hnsi051",
            "score": 1,
            "created_utc": 1639027604.0,
            "replies": []
        },
        {
            "body": "Chemistry. Don't just look for a girl who is hot. I've never had bad sex with a woman I had good chemistry with. Every time I've had bad sex with someone, we didn't have good chemistry.\n\nAs for rinsing, make it clear you aren't going to give them anything before the first non-platonic date. End it at the first sign that they are going to try to rinse you. I've never been rinsed.",
            "author": "AShatteredKing",
            "id": "hntlgi3",
            "parent_id": "t1_hntkcrc",
            "score": 5,
            "created_utc": 1639029986.0,
            "replies": [
                {
                    "body": "Chemistry is important and I think that’s a good suggestion, but for me, someone hot and young is the goal. If I was trying to maximize intrapersonal chemistry, I’d vanilla date someone close to my age, not a 20 yr old college student \n\nAnd I’m guessing you’re one of those guys that the second message on SA you send a novel that outlines all the rules. Personally I like to get an idea for who the SB is as a person first, which (to your point) does allow them to reveal themselves as a rinser later. I’ve found that being authoritative about expectations first several messages does not lead to success",
                    "author": null,
                    "id": "hnvy6it",
                    "parent_id": "t1_hntlgi3",
                    "score": 1,
                    "created_utc": 1639076968.0,
                    "replies": [
                        {
                            "body": "Having good chemistry doesn't mean you are trying to maximize the chemistry; that's a false dichotomy. Take your time and find a woman that fits you well. There are A LOT of young beautiful women who want SDs.",
                            "author": "AShatteredKing",
                            "id": "hnwmwi9",
                            "parent_id": "t1_hnvy6it",
                            "score": 1,
                            "created_utc": 1639086916.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I'm afraid I'd have to agree on OP with this one. While your counter argument is valid, showing up dressed so casually you may as well be wearing pjs, and have it reasoned as \"yes but she/they *really really* want to be there, because you're important!\" Just really isn't right. \n\nShowing up because you really want to be there is of course the truth. That is the point of the meeting. And yes, our lives do get chaotic. I will openly admit I've done similar things, (though not perhaps to such an extent where I showed up to an important meeting in slippers and sweats) where I prioritized comfort over aesthetic. \n\nBut if, as you say, this woman/person really and truly felt you as the POT were so important that they had to meet you no matter what, they should have still put in effort. \n\nI didn't memories which number this is under, but if the lady that OP mentioned in his earlier replies, woke up 5mins before their meeting, she could have called (hoping she did) to apologize for being tardy, and that she'd be there in XY minutes. \n\nGiving herself enough time to run some dry shampoo through her hair, put on some light make up, picked a nicer outfit, brushed her teeth, and met OP looking like she wanted to be there and *showing* that she wanted to be there. \n\nIt happens. Sometimes life is cruel to all your carefully laid out plans. \n\nBut regardless, meeting a POT for the 1st time is really more akin to a job interview (hence the stress). And I don't know about other women, but even if I didn't want to be there, I'd still show up, and be dressed appropriately. \n\nI never got to be an SB though I've always wanted to be one. I wouldn't have minded the intimacy, and honestly an allowance would have helped so many of my current financial issues. \n\nBut SB type relationships aren't really a thing in my country. Well, they are, but only with a very very specific looking type of woman, and sadly, I am not such a woman. And online SDs are majorly a scam, and not plausible anyway because of the long distance. \n\nBut I know that had I been lucky enough to have someone interested in me like that, I would have put in the maximum of all efforts. Because they chose me, and chose to help me. And the next best thing I can do to show gratitude is do my best to meet their expectations and make them happy and content. \n\nSo sad that some women take this chance for granted. \n\nSorry for the rant 😅",
            "author": "Rowan-the-Girlfriend",
            "id": "hnsx5ie",
            "parent_id": "t1_hnsa196",
            "score": 8,
            "created_utc": 1639017313.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "hnuav78",
                    "parent_id": "t1_hnsx5ie",
                    "score": 2,
                    "created_utc": 1639050272.0,
                    "replies": [
                        {
                            "body": "What I post is part of my part time job to get some influx of cash. That does not mean that I wouldn't like to actually meet someone and have them help me in such a way that what I do on the side is no longer necessary to help pay my bills, or buy a Christmas present for my little niece and nephews. \n\nMy \"exuberant\" photos don't correlate to what I was speaking of. So they shouldn't be used in your argument in the first place.",
                            "author": "Rowan-the-Girlfriend",
                            "id": "hnubeeq",
                            "parent_id": "t1_hnuav78",
                            "score": 2,
                            "created_utc": 1639050657.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "hnuclzm",
                                    "parent_id": "t1_hnubeeq",
                                    "score": 2,
                                    "created_utc": 1639051520.0,
                                    "replies": [
                                        {
                                            "body": "I am not so fragile that a misunderstanding of flowery language will hurt my glass-like feelings. I also know what exuberant means. I grew up in North America, English is my first language. And though I now live back in my hometown, in the country of my birth here in Europe, I can assure you there is no cultural gap between us. \n\nI am accustomed to men believing certain things about what I currently do, and that's what your comment sounded like to me. Which is why I said what I do on the side shouldn't have had any bearing to what I was referring to in my previous comments. What I said stands. \n\nSuffice to say I write a lot in my day job too, as a freelance editor, among other things. But I prefer being clear with my words. \n\nAs one writer to another, perhaps take that as an approach, rather than diplomatically trying to bounce around from one flowery word to another, to avoid further confusions in future.",
                                            "author": "Rowan-the-Girlfriend",
                                            "id": "hnud9wq",
                                            "parent_id": "t1_hnuclzm",
                                            "score": 4,
                                            "created_utc": 1639051975.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "If they cannot get to my side of town then I cannot do anything for them.",
            "author": "Major-Editor-2016",
            "id": "hns9df2",
            "parent_id": "t1_hnrj6uo",
            "score": 3,
            "created_utc": 1639006710.0,
            "replies": []
        },
        {
            "body": "Whoa that’s a crazy story. Like I can’t believe she showed, especially since you made it the morning lol. I don’t know what it is with some SBs but sometimes they just need something to click so they show up and take it seriously. \n\nSimilarly I had a girl I messaged off and on  that never would make time to meet up. One day over a year later she did finally agree. I ended up having a 10 month arrangement with her. I have no idea why it worked then and not before",
            "author": null,
            "id": "hnro64u",
            "parent_id": "t1_hnrl30o",
            "score": 4,
            "created_utc": 1638998090.0,
            "replies": [
                {
                    "body": "Bitches be crazy. The big bang theory mail man had it right.",
                    "author": "AFSMSgt",
                    "id": "hnsqspx",
                    "parent_id": "t1_hnro64u",
                    "score": 2,
                    "created_utc": 1639014510.0,
                    "replies": [
                        {
                            "body": "Honestly sometimes it might just be that lol. They probably think we’re crazy ourselves",
                            "author": null,
                            "id": "hnsrbze",
                            "parent_id": "t1_hnsqspx",
                            "score": 1,
                            "created_utc": 1639014744.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "To borrow an old phrase \n\nSimplicity is the ultimate sophistication",
            "author": "pinotandsugar",
            "id": "hnrpbnd",
            "parent_id": "t1_hnrl30o",
            "score": 4,
            "created_utc": 1638998529.0,
            "replies": []
        },
        {
            "body": "Smart, I’m honestly always offering to come to them with the hopes they will be more likely to not flake. \n\nSeems fair to ask them to come to me if they are actually invested and want it to work though",
            "author": null,
            "id": "hnsa6w1",
            "parent_id": "t1_hns90ms",
            "score": 2,
            "created_utc": 1639007077.0,
            "replies": []
        },
        {
            "body": "Love this story and huge congrats for finding someone amazing through all the pitfalls I listed out. Things are so much better when you’re actually interested in your sugar partner enough for a relationship like that \n\nI have a rough time with monogamy and having just one girl, but what you have is kinda the dream after I settle down.",
            "author": null,
            "id": "hnsspub",
            "parent_id": "t1_hnsroji",
            "score": 2,
            "created_utc": 1639015358.0,
            "replies": []
        },
        {
            "body": " No, that’s not it and don’t get how you’re getting that interpretation. \n\nExample, step 4, why would you interpret that I don’t like human aspects of women or “this dynamic” when it seems pretty clear I’m complaining about rinsers specifically? I don’t like SBs wasting my time and asking for money before they’ve even met me. I don’t like scams. I’m sure you don’t like scammer SDs either and I’m not suggesting you find a “John”\n\nThere are good SBs that don’t do any of these things. I have a couple of them right now, we have a relationship. They didn’t try to scam me or waste my time so it works.\n\nIf you think the disrespect, wasting other people’s  time, or scamming are a central part of this “dynamic” you’re probably a terrible SB",
            "author": null,
            "id": "hntlpa1",
            "parent_id": "t1_hntb34l",
            "score": 0,
            "created_utc": 1639030147.0,
            "replies": [
                {
                    "body": "I seem to have struck a chord. \n\nI’m not saying anything about scamming, not sure where you got that from. I’m saying that the entirety of this post is a negative rant about how SBs make this process horrible for you. You say you want a relationship and then complain when they “get too attached”, they’re always sexually boring or can’t hold a conversation, etc. you say yourself it’s barely worth it. \n\nSoooo yeah, sounds like it’s time to switch things up",
                    "author": "c0rnstarr",
                    "id": "hnuvf8o",
                    "parent_id": "t1_hntlpa1",
                    "score": 5,
                    "created_utc": 1639061568.0,
                    "replies": [
                        {
                            "body": "I don’t have enough space in a single Reddit post to describe all my feelings about sugaring but many of them are positive. This a snarky slice at the difficulties that come with it, mostly so newer SDs can see where it fails. I like sugaring enough to keep at it; the successes make it worth it\n\nSBs should always ask “why isn’t this guy just vanilla dating instead of spending money”. For me, it’s that I don’t want to be anyone’s boyfriend or spend a huge amount of time together. I would vanilla date if I wanted that. So yes, I want a relationship with less attachment than a GF and I think that should be okay in sugaring. I don’t like when SBs don’t respect that",
                            "author": null,
                            "id": "hnw1lwi",
                            "parent_id": "t1_hnuvf8o",
                            "score": 1,
                            "created_utc": 1639078352.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "La…dies?\nLa..ughed at ?\nLa..proscopic surgery ?\nLa..p dances ?\nLa..minated ? \nLa..sting love?",
            "author": null,
            "id": "hns727m",
            "parent_id": "t1_hns1omf",
            "score": 3,
            "created_utc": 1639005693.0,
            "replies": []
        },
        {
            "body": "I’ll go on tons of M&G’s and I end up not liking them in person or they’re just ok. Id rather have a SR that is a 10/10’ out of my league than just an average looking girl.",
            "author": null,
            "id": "hns3vxy",
            "parent_id": "t1_hnrw7mi",
            "score": 0,
            "created_utc": 1639004339.0,
            "replies": [
                {
                    "body": "I explained that I went 2/2 and set up relationships with  women that I already described as young, hot, and attentive-\n\nand you made this about you and a hypothetical average looking girl lmao.",
                    "author": null,
                    "id": "hnshio9",
                    "parent_id": "t1_hns3vxy",
                    "score": 3,
                    "created_utc": 1639010368.0,
                    "replies": [
                        {
                            "body": "Ok",
                            "author": null,
                            "id": "hnshlrh",
                            "parent_id": "t1_hnshio9",
                            "score": 0,
                            "created_utc": 1639010407.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Thanks. I tried to say it’s snark, but people don’t see the humor in the frustration and are taking it seriously. Someone said I hate women because I posted this! Like damn",
            "author": null,
            "id": "hns7eyz",
            "parent_id": "t1_hns6r1m",
            "score": 3,
            "created_utc": 1639005845.0,
            "replies": [
                {
                    "body": "Focus on the good comments, and there are quite a few on your post, but I get it, it's difficult to ignore the negative ones when they come as a personal attack. Also remember to get your blood pressure checked tomorrow :)",
                    "author": "chemistryromance",
                    "id": "hns8n3f",
                    "parent_id": "t1_hns7eyz",
                    "score": 2,
                    "created_utc": 1639006388.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "But they’re soooo hot lol\n\nYou’re right though, to a degree I bring the pain on myself. This is snarky but I’ve also had a some great experiences in the bowl with amazing women. I just had a bad day the other day and wrote this out as bit of a vent. All of this has happened to me though and I think other new SDs should be aware",
            "author": null,
            "id": "hnrxred",
            "parent_id": "t1_hnrrls3",
            "score": 4,
            "created_utc": 1639001825.0,
            "replies": [
                {
                    "body": "Unfortunately the hot girls don't have to develop a personality or any sort of redeemable skills 90% of the time.",
                    "author": "HeilerinVonDoom",
                    "id": "hnsbe4x",
                    "parent_id": "t1_hnrxred",
                    "score": 1,
                    "created_utc": 1639007613.0,
                    "replies": []
                }
            ]
        },
        {
            "body": ">best part is they can’t order a ton of expensive drinks and dinner\n\nIf *that*'s the *best* part, you must be fun to be around.",
            "author": "Inner_Examination_38",
            "id": "hnrhohr",
            "parent_id": "t1_hnrff2y",
            "score": 9,
            "created_utc": 1638995640.0,
            "replies": [
                {
                    "body": "Should say at dinner, I’m a hoot. You haven’t lived until you’ve had a sugar baby try to order a $300 bottle of wine on a meet and greet (and not at a nice restaurant usually, just literally the most expensive one)",
                    "author": "sdthrowaway568",
                    "id": "hnrhzah",
                    "parent_id": "t1_hnrhohr",
                    "score": 1,
                    "created_utc": 1638995751.0,
                    "replies": [
                        {
                            "body": "I see you may have posted a number which is most likely an amount in relations to an arrangement. If this is the case, you are violating Rule #4 - \"No dollar amounts that are in reference to allowance/PPM are allowed.\"\n\nIf you are curious about Allowances reported by SLF contributors please see the [Allowance Master Thread 2021-2022](/r/sugarlifestyleforum/comments/pc22tk/allowance_master_thread_20212022/).\n\nYour post will not be approved until you remove the amount.  Please read the sub [Rules](/r/sugarlifestyleforum/comments/748zta/updated_and_clarified_rules_for_slf/) prior to posting anything else. \n\nIf you simply posted a number not referencing a monetary amount, please message the MODs to approve your post.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/sugarlifestyleforum) if you have any questions or concerns.*",
                            "author": "AutoModerator",
                            "id": "hnri1mt",
                            "parent_id": "t1_hnrhzah",
                            "score": -3,
                            "created_utc": 1638995775.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I actually don’t mind the expensive drinks and meals if they are fun and serious about wanting an arrangement. Problem is many girls aren’t but want that anyway so it’s a time waste",
            "author": null,
            "id": "hnrn2ec",
            "parent_id": "t1_hnrff2y",
            "score": 1,
            "created_utc": 1638997657.0,
            "replies": []
        },
        {
            "body": "yikes",
            "author": "c0rnstarr",
            "id": "hnrsm41",
            "parent_id": "t1_hnrff2y",
            "score": 1,
            "created_utc": 1638999799.0,
            "replies": []
        },
        {
            "body": "Fair point, but I don’t hate women just because I don’t like those annoyances. I hate the annoyance, not the woman \n\nI’ve met plenty of younger women that _aren’t_ any way like what I complain about, so I know to a degree younger women are choosing to be these ways. I wish they wouldn’t be, so I’m complaining and trying to make newer SDs aware of what they would have to deal with \n\nI agree though, it’s going to come with the territory if those are the women I go for. I bring it on myself to a degree. Perhaps I’ll need to change that",
            "author": null,
            "id": "hnryw0k",
            "parent_id": "t1_hnry7th",
            "score": 3,
            "created_utc": 1639002274.0,
            "replies": []
        },
        {
            "body": "Chemistry is important and I think that’s a good suggestion, but for me, someone hot and young is the goal. If I was trying to maximize intrapersonal chemistry, I’d vanilla date someone close to my age, not a 20 yr old college student \n\nAnd I’m guessing you’re one of those guys that the second message on SA you send a novel that outlines all the rules. Personally I like to get an idea for who the SB is as a person first, which (to your point) does allow them to reveal themselves as a rinser later. I’ve found that being authoritative about expectations first several messages does not lead to success",
            "author": null,
            "id": "hnvy6it",
            "parent_id": "t1_hntlgi3",
            "score": 1,
            "created_utc": 1639076968.0,
            "replies": [
                {
                    "body": "Having good chemistry doesn't mean you are trying to maximize the chemistry; that's a false dichotomy. Take your time and find a woman that fits you well. There are A LOT of young beautiful women who want SDs.",
                    "author": "AShatteredKing",
                    "id": "hnwmwi9",
                    "parent_id": "t1_hnvy6it",
                    "score": 1,
                    "created_utc": 1639086916.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "hnuav78",
            "parent_id": "t1_hnsx5ie",
            "score": 2,
            "created_utc": 1639050272.0,
            "replies": [
                {
                    "body": "What I post is part of my part time job to get some influx of cash. That does not mean that I wouldn't like to actually meet someone and have them help me in such a way that what I do on the side is no longer necessary to help pay my bills, or buy a Christmas present for my little niece and nephews. \n\nMy \"exuberant\" photos don't correlate to what I was speaking of. So they shouldn't be used in your argument in the first place.",
                    "author": "Rowan-the-Girlfriend",
                    "id": "hnubeeq",
                    "parent_id": "t1_hnuav78",
                    "score": 2,
                    "created_utc": 1639050657.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "hnuclzm",
                            "parent_id": "t1_hnubeeq",
                            "score": 2,
                            "created_utc": 1639051520.0,
                            "replies": [
                                {
                                    "body": "I am not so fragile that a misunderstanding of flowery language will hurt my glass-like feelings. I also know what exuberant means. I grew up in North America, English is my first language. And though I now live back in my hometown, in the country of my birth here in Europe, I can assure you there is no cultural gap between us. \n\nI am accustomed to men believing certain things about what I currently do, and that's what your comment sounded like to me. Which is why I said what I do on the side shouldn't have had any bearing to what I was referring to in my previous comments. What I said stands. \n\nSuffice to say I write a lot in my day job too, as a freelance editor, among other things. But I prefer being clear with my words. \n\nAs one writer to another, perhaps take that as an approach, rather than diplomatically trying to bounce around from one flowery word to another, to avoid further confusions in future.",
                                    "author": "Rowan-the-Girlfriend",
                                    "id": "hnud9wq",
                                    "parent_id": "t1_hnuclzm",
                                    "score": 4,
                                    "created_utc": 1639051975.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Bitches be crazy. The big bang theory mail man had it right.",
            "author": "AFSMSgt",
            "id": "hnsqspx",
            "parent_id": "t1_hnro64u",
            "score": 2,
            "created_utc": 1639014510.0,
            "replies": [
                {
                    "body": "Honestly sometimes it might just be that lol. They probably think we’re crazy ourselves",
                    "author": null,
                    "id": "hnsrbze",
                    "parent_id": "t1_hnsqspx",
                    "score": 1,
                    "created_utc": 1639014744.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I seem to have struck a chord. \n\nI’m not saying anything about scamming, not sure where you got that from. I’m saying that the entirety of this post is a negative rant about how SBs make this process horrible for you. You say you want a relationship and then complain when they “get too attached”, they’re always sexually boring or can’t hold a conversation, etc. you say yourself it’s barely worth it. \n\nSoooo yeah, sounds like it’s time to switch things up",
            "author": "c0rnstarr",
            "id": "hnuvf8o",
            "parent_id": "t1_hntlpa1",
            "score": 5,
            "created_utc": 1639061568.0,
            "replies": [
                {
                    "body": "I don’t have enough space in a single Reddit post to describe all my feelings about sugaring but many of them are positive. This a snarky slice at the difficulties that come with it, mostly so newer SDs can see where it fails. I like sugaring enough to keep at it; the successes make it worth it\n\nSBs should always ask “why isn’t this guy just vanilla dating instead of spending money”. For me, it’s that I don’t want to be anyone’s boyfriend or spend a huge amount of time together. I would vanilla date if I wanted that. So yes, I want a relationship with less attachment than a GF and I think that should be okay in sugaring. I don’t like when SBs don’t respect that",
                    "author": null,
                    "id": "hnw1lwi",
                    "parent_id": "t1_hnuvf8o",
                    "score": 1,
                    "created_utc": 1639078352.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I explained that I went 2/2 and set up relationships with  women that I already described as young, hot, and attentive-\n\nand you made this about you and a hypothetical average looking girl lmao.",
            "author": null,
            "id": "hnshio9",
            "parent_id": "t1_hns3vxy",
            "score": 3,
            "created_utc": 1639010368.0,
            "replies": [
                {
                    "body": "Ok",
                    "author": null,
                    "id": "hnshlrh",
                    "parent_id": "t1_hnshio9",
                    "score": 0,
                    "created_utc": 1639010407.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Focus on the good comments, and there are quite a few on your post, but I get it, it's difficult to ignore the negative ones when they come as a personal attack. Also remember to get your blood pressure checked tomorrow :)",
            "author": "chemistryromance",
            "id": "hns8n3f",
            "parent_id": "t1_hns7eyz",
            "score": 2,
            "created_utc": 1639006388.0,
            "replies": []
        },
        {
            "body": "Unfortunately the hot girls don't have to develop a personality or any sort of redeemable skills 90% of the time.",
            "author": "HeilerinVonDoom",
            "id": "hnsbe4x",
            "parent_id": "t1_hnrxred",
            "score": 1,
            "created_utc": 1639007613.0,
            "replies": []
        },
        {
            "body": "Should say at dinner, I’m a hoot. You haven’t lived until you’ve had a sugar baby try to order a $300 bottle of wine on a meet and greet (and not at a nice restaurant usually, just literally the most expensive one)",
            "author": "sdthrowaway568",
            "id": "hnrhzah",
            "parent_id": "t1_hnrhohr",
            "score": 1,
            "created_utc": 1638995751.0,
            "replies": [
                {
                    "body": "I see you may have posted a number which is most likely an amount in relations to an arrangement. If this is the case, you are violating Rule #4 - \"No dollar amounts that are in reference to allowance/PPM are allowed.\"\n\nIf you are curious about Allowances reported by SLF contributors please see the [Allowance Master Thread 2021-2022](/r/sugarlifestyleforum/comments/pc22tk/allowance_master_thread_20212022/).\n\nYour post will not be approved until you remove the amount.  Please read the sub [Rules](/r/sugarlifestyleforum/comments/748zta/updated_and_clarified_rules_for_slf/) prior to posting anything else. \n\nIf you simply posted a number not referencing a monetary amount, please message the MODs to approve your post.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/sugarlifestyleforum) if you have any questions or concerns.*",
                    "author": "AutoModerator",
                    "id": "hnri1mt",
                    "parent_id": "t1_hnrhzah",
                    "score": -3,
                    "created_utc": 1638995775.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Having good chemistry doesn't mean you are trying to maximize the chemistry; that's a false dichotomy. Take your time and find a woman that fits you well. There are A LOT of young beautiful women who want SDs.",
            "author": "AShatteredKing",
            "id": "hnwmwi9",
            "parent_id": "t1_hnvy6it",
            "score": 1,
            "created_utc": 1639086916.0,
            "replies": []
        },
        {
            "body": "What I post is part of my part time job to get some influx of cash. That does not mean that I wouldn't like to actually meet someone and have them help me in such a way that what I do on the side is no longer necessary to help pay my bills, or buy a Christmas present for my little niece and nephews. \n\nMy \"exuberant\" photos don't correlate to what I was speaking of. So they shouldn't be used in your argument in the first place.",
            "author": "Rowan-the-Girlfriend",
            "id": "hnubeeq",
            "parent_id": "t1_hnuav78",
            "score": 2,
            "created_utc": 1639050657.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "hnuclzm",
                    "parent_id": "t1_hnubeeq",
                    "score": 2,
                    "created_utc": 1639051520.0,
                    "replies": [
                        {
                            "body": "I am not so fragile that a misunderstanding of flowery language will hurt my glass-like feelings. I also know what exuberant means. I grew up in North America, English is my first language. And though I now live back in my hometown, in the country of my birth here in Europe, I can assure you there is no cultural gap between us. \n\nI am accustomed to men believing certain things about what I currently do, and that's what your comment sounded like to me. Which is why I said what I do on the side shouldn't have had any bearing to what I was referring to in my previous comments. What I said stands. \n\nSuffice to say I write a lot in my day job too, as a freelance editor, among other things. But I prefer being clear with my words. \n\nAs one writer to another, perhaps take that as an approach, rather than diplomatically trying to bounce around from one flowery word to another, to avoid further confusions in future.",
                            "author": "Rowan-the-Girlfriend",
                            "id": "hnud9wq",
                            "parent_id": "t1_hnuclzm",
                            "score": 4,
                            "created_utc": 1639051975.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Honestly sometimes it might just be that lol. They probably think we’re crazy ourselves",
            "author": null,
            "id": "hnsrbze",
            "parent_id": "t1_hnsqspx",
            "score": 1,
            "created_utc": 1639014744.0,
            "replies": []
        },
        {
            "body": "I don’t have enough space in a single Reddit post to describe all my feelings about sugaring but many of them are positive. This a snarky slice at the difficulties that come with it, mostly so newer SDs can see where it fails. I like sugaring enough to keep at it; the successes make it worth it\n\nSBs should always ask “why isn’t this guy just vanilla dating instead of spending money”. For me, it’s that I don’t want to be anyone’s boyfriend or spend a huge amount of time together. I would vanilla date if I wanted that. So yes, I want a relationship with less attachment than a GF and I think that should be okay in sugaring. I don’t like when SBs don’t respect that",
            "author": null,
            "id": "hnw1lwi",
            "parent_id": "t1_hnuvf8o",
            "score": 1,
            "created_utc": 1639078352.0,
            "replies": []
        },
        {
            "body": "Ok",
            "author": null,
            "id": "hnshlrh",
            "parent_id": "t1_hnshio9",
            "score": 0,
            "created_utc": 1639010407.0,
            "replies": []
        },
        {
            "body": "I see you may have posted a number which is most likely an amount in relations to an arrangement. If this is the case, you are violating Rule #4 - \"No dollar amounts that are in reference to allowance/PPM are allowed.\"\n\nIf you are curious about Allowances reported by SLF contributors please see the [Allowance Master Thread 2021-2022](/r/sugarlifestyleforum/comments/pc22tk/allowance_master_thread_20212022/).\n\nYour post will not be approved until you remove the amount.  Please read the sub [Rules](/r/sugarlifestyleforum/comments/748zta/updated_and_clarified_rules_for_slf/) prior to posting anything else. \n\nIf you simply posted a number not referencing a monetary amount, please message the MODs to approve your post.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/sugarlifestyleforum) if you have any questions or concerns.*",
            "author": "AutoModerator",
            "id": "hnri1mt",
            "parent_id": "t1_hnrhzah",
            "score": -3,
            "created_utc": 1638995775.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "hnuclzm",
            "parent_id": "t1_hnubeeq",
            "score": 2,
            "created_utc": 1639051520.0,
            "replies": [
                {
                    "body": "I am not so fragile that a misunderstanding of flowery language will hurt my glass-like feelings. I also know what exuberant means. I grew up in North America, English is my first language. And though I now live back in my hometown, in the country of my birth here in Europe, I can assure you there is no cultural gap between us. \n\nI am accustomed to men believing certain things about what I currently do, and that's what your comment sounded like to me. Which is why I said what I do on the side shouldn't have had any bearing to what I was referring to in my previous comments. What I said stands. \n\nSuffice to say I write a lot in my day job too, as a freelance editor, among other things. But I prefer being clear with my words. \n\nAs one writer to another, perhaps take that as an approach, rather than diplomatically trying to bounce around from one flowery word to another, to avoid further confusions in future.",
                    "author": "Rowan-the-Girlfriend",
                    "id": "hnud9wq",
                    "parent_id": "t1_hnuclzm",
                    "score": 4,
                    "created_utc": 1639051975.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I am not so fragile that a misunderstanding of flowery language will hurt my glass-like feelings. I also know what exuberant means. I grew up in North America, English is my first language. And though I now live back in my hometown, in the country of my birth here in Europe, I can assure you there is no cultural gap between us. \n\nI am accustomed to men believing certain things about what I currently do, and that's what your comment sounded like to me. Which is why I said what I do on the side shouldn't have had any bearing to what I was referring to in my previous comments. What I said stands. \n\nSuffice to say I write a lot in my day job too, as a freelance editor, among other things. But I prefer being clear with my words. \n\nAs one writer to another, perhaps take that as an approach, rather than diplomatically trying to bounce around from one flowery word to another, to avoid further confusions in future.",
            "author": "Rowan-the-Girlfriend",
            "id": "hnud9wq",
            "parent_id": "t1_hnuclzm",
            "score": 4,
            "created_utc": 1639051975.0,
            "replies": []
        }
    ]
}