{
    "title": "“I was treating this like we met on Bumble”",
    "post_id": "m5s0ww",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/m5s0ww/i_was_treating_this_like_we_met_on_bumble/",
    "author": "ddknows",
    "body": "I’ll make this long story short. \n\nMet a man on SA who first reached out to me. We exchanged numbers (my Google number) today and started chatting. \n\nMan stated he worked for Disney, now works typically Tues and Thurs. He said he was looking for a companion, blah blah blah and offered $xxxx each week to meet. \n\nSo we start talking specifics- what days work etc. \n\nFirst red flag is he wanted to meet my daughter this week. Bro, no. \n\n(Some advice on whether I should disclose I have a daughter would be appreciated. Typically I won’t but I figured I would this time.)\n\nSecond red flag, he send me pics of himself in a bedroom with a bathroom door right at his feet (what man who’s worth as much as he stated lives in a studio.) \n\nI should’ve called him out but I didn’t. (We video chatted on What’sapp and I saw he had one pillow, in that one bedroom and just eww. \n\nWhen he asked to start our “relationship” with me tomorrow (he lives in Orlando, I live in Tampa) I said yes, so long as we agree upon the $xxxx/ week and I can see him twice a week every time. \n\nHe says “oh. You don’t want a real relationship? I saw you differently than SA. I was treating this as if we met on Bumble”\n\n🤢 \n\nMe: “But we didn’t.”\nHim: “Sorry it appears we’re on two different wavelengths. I’m going to have to pass.”\n\nI go to block him on SA and he already did it. \n\nJust a rant. \nThis poor man. (No pun intended but perfectly fitting)",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/m5s0ww/i_was_treating_this_like_we_met_on_bumble/",
    "score": 129,
    "upvote_ratio": 0.94,
    "created_utc": 1615834687.0,
    "num_comments": 61,
    "links": [
        []
    ],
    "comments": [
        {
            "body": ">Second red flag, he send me pics of himself in a bedroom with a bathroom door right at his feet (what man who’s worth as much as he stated lives in a studio\n\nI'm confused. I have a bathroom door in my bedroom. Most master bedrooms have their own bathroom.",
            "author": "OldschoolSD",
            "id": "gr1p110",
            "parent_id": "t3_m5s0ww",
            "score": 41,
            "created_utc": 1615836841.0,
            "replies": [
                {
                    "body": "I meant to say the room was as big as his bed. \nLike no room in his room.",
                    "author": "ddknows",
                    "id": "gr1pnjk",
                    "parent_id": "t1_gr1p110",
                    "score": 28,
                    "created_utc": 1615837120.0,
                    "replies": [
                        {
                            "body": "Gotcha",
                            "author": "OldschoolSD",
                            "id": "gr1pz77",
                            "parent_id": "t1_gr1pnjk",
                            "score": 4,
                            "created_utc": 1615837263.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "I was confused by the \"We video chatted on What’sapp and I saw he had one pillow, in that one bedroom and just eww\" comment. \n\nHaving one pillow freaked you out?",
                    "author": "DazyKoala007",
                    "id": "gr2duq4",
                    "parent_id": "t1_gr1p110",
                    "score": 9,
                    "created_utc": 1615850453.0,
                    "replies": [
                        {
                            "body": "Yes, where would the woman be putting her head if she stays over?",
                            "author": "MistressMistyX",
                            "id": "gr2o3q5",
                            "parent_id": "t1_gr2duq4",
                            "score": 36,
                            "created_utc": 1615856615.0,
                            "replies": []
                        },
                        {
                            "body": "That's a red flag for me even in regular relationships lol. Most established adults will have at least 2-4 pillows. It's like owning one plate.",
                            "author": "clashingtaco",
                            "id": "gr38o5i",
                            "parent_id": "t1_gr2duq4",
                            "score": 33,
                            "created_utc": 1615868139.0,
                            "replies": [
                                {
                                    "body": "🤣",
                                    "author": "tattoosandtail",
                                    "id": "gr3skyr",
                                    "parent_id": "t1_gr38o5i",
                                    "score": 1,
                                    "created_utc": 1615886330.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Yup that got me too. I got the first red flag but the second red flag was more of a red flag on the posters thinking. Judging people based on pictures sent is too shallow. What if the dude was posing next to his boss’s Ferrari. Would that be ok? Other than the guy clearly was not a SD.",
                    "author": null,
                    "id": "gr4ctux",
                    "parent_id": "t1_gr1p110",
                    "score": 1,
                    "created_utc": 1615901789.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Don’t mention kids. No details about kids until much later in the sugar relationship, if at all.",
            "author": "ExExpectations",
            "id": "gr1okwm",
            "parent_id": "t3_m5s0ww",
            "score": 53,
            "created_utc": 1615836640.0,
            "replies": [
                {
                    "body": "I think I feel the same way. It just provides extra support on the “I’m busy but want to make time for you” conversation cause we truly do have a lot on our plate.",
                    "author": "ddknows",
                    "id": "gr1pu61",
                    "parent_id": "t1_gr1okwm",
                    "score": 12,
                    "created_utc": 1615837202.0,
                    "replies": [
                        {
                            "body": "Nope. Nobody needs to know about kids until much later, if at all. \n\nNo one needs to make justification on why we can’t or don’t want to be available to them 24/7. NO ONE should have that kind of expectations - and you/we don’t need to make justifications for having a life, EVEN IF we don’t have kids.",
                            "author": "ExExpectations",
                            "id": "gr1rhwt",
                            "parent_id": "t1_gr1pu61",
                            "score": 29,
                            "created_utc": 1615837937.0,
                            "replies": [
                                {
                                    "body": "I like that. Thank you for your input",
                                    "author": "ddknows",
                                    "id": "gr21cbo",
                                    "parent_id": "t1_gr1rhwt",
                                    "score": 8,
                                    "created_utc": 1615842300.0,
                                    "replies": [
                                        {
                                            "body": "For what it's worth, I completely disagree on this.  But I also treat sugaring as a form of dating (not bumble, but it's still a form of dating).  I'm not married, and honesty is an important thing.  \n\nMy goal of any SR - is for it to \"grow\".  So I'm not interested in strictly NSA arrangements.  I'm also childfree.  So it's an incompatibility.  And I much prefer to know that up front.",
                                            "author": "SDstartingOut",
                                            "id": "gr2jcuj",
                                            "parent_id": "t1_gr21cbo",
                                            "score": 5,
                                            "created_utc": 1615854047.0,
                                            "replies": [
                                                {
                                                    "body": "Yes but you also must understand that it's a parent's first responsibility to protect their children. I'm not the only person in my family or in my group of friends who suffered at the hands of \"mom's boyfriend.\" The horrible irony is the same happened to her as a kid with HER mom's boyfriends. Many people strive to avoid any chance of the same thing happening to their children. Protecting your children from an SD is absolutely 100% understandable and I would never ever trust a man who didn't agree with that absolutely without question. Children's safety comes before anything at all.",
                                                    "author": "ColdHeaux",
                                                    "id": "gr2mscw",
                                                    "parent_id": "t1_gr2jcuj",
                                                    "score": 15,
                                                    "created_utc": 1615855917.0,
                                                    "replies": [
                                                        {
                                                            "body": "I don't understand the correlation.\n\nHow does admitting you have children, lead to suffering of the children?  If he wants to meet them?  Well, no.  Clearly, that's inappropriate.  And you should take that as a red flag and not even start a relationship with him.\n\nI don't think that little bit of honesty (relationship status, having children or not) is too much to ask for from a person you plan to engage on an intimate relationship with.",
                                                            "author": "SDstartingOut",
                                                            "id": "gr2sri4",
                                                            "parent_id": "t1_gr2mscw",
                                                            "score": -2,
                                                            "created_utc": 1615859038.0,
                                                            "replies": [
                                                                {
                                                                    "body": "[deleted]",
                                                                    "author": null,
                                                                    "id": "gr2xz1h",
                                                                    "parent_id": "t1_gr2sri4",
                                                                    "score": 5,
                                                                    "created_utc": 1615861839.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "Oh right ALSO that shit can come up in a custody battle-- another good reaosn to keep them seperate.",
                                                                            "author": "ColdHeaux",
                                                                            "id": "gr2yd2j",
                                                                            "parent_id": "t1_gr2xz1h",
                                                                            "score": 5,
                                                                            "created_utc": 1615862057.0,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "body": "I mean, are you serious? You don't think there's any chance on earth a guy could.... follow her home and go after her kids lol? I'm not saying always conceal them forever obvi but yeah not everyone needs to know everything right away.",
                                                                    "author": "ColdHeaux",
                                                                    "id": "gr2y04t",
                                                                    "parent_id": "t1_gr2sri4",
                                                                    "score": 3,
                                                                    "created_utc": 1615861855.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "> You don't think there's any chance on earth a guy could.... follow her home and go after her kids lol?\n\nSo could anyone else... does that mean she has to keep the existence of her kids a secret from the world?  \n\nI think you have a wild imagination.",
                                                                            "author": "cld8",
                                                                            "id": "gr3da8h",
                                                                            "parent_id": "t1_gr2y04t",
                                                                            "score": -2,
                                                                            "created_utc": 1615871476.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "Dude my own grandpa tried to kill my dad and aunt when they were kids lol, how unusual do you think this is? And yes, a man who is potentially seeking women who basically get paid for sex is higher suspect than the average man because sex workers are more vulnerable and police don't investigate our deaths as much so dangerous men sometimes target us first. So I would absolutely be cautious with a vanilla partner and even MORE with a sugar partner. Do I have a wild imagination or are you extremely naive to the dangers we face?",
                                                                                    "author": "ColdHeaux",
                                                                                    "id": "gr3dwm7",
                                                                                    "parent_id": "t1_gr3da8h",
                                                                                    "score": 3,
                                                                                    "created_utc": 1615871967.0,
                                                                                    "replies": [
                                                                                        {
                                                                                            "body": "How is your grandpa trying to kill your dad and aunt relevant to this?  Was your grandpa a stranger who met them through a dating app?",
                                                                                            "author": "cld8",
                                                                                            "id": "gr3ek7c",
                                                                                            "parent_id": "t1_gr3dwm7",
                                                                                            "score": 1,
                                                                                            "created_utc": 1615872505.0,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "body": "The rest of my comment should have made that clear. Even men close to us can be a danger, so of course those who are seeking out women who get paid for sex can be an even bigger danger because that is a sociologically vulnerable group of women who can get targeted by dangerous men.",
                                                                                                    "author": "ColdHeaux",
                                                                                                    "id": "gr3eqjf",
                                                                                                    "parent_id": "t1_gr3ek7c",
                                                                                                    "score": 2,
                                                                                                    "created_utc": 1615872649.0,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "body": "> so of course \n\nYou saying \"of course\" does not make something true.  The vast majority of abuse of children is done by men who are known to them, not by random strangers.  \n\nIf a man wanted to abuse a random kid, he would just go to a park, or a school, or wherever.  He's not going to meet a woman on a dating app and then say \"hey, let me follow her home and abuse her child\". This simply defies common sense.",
                                                                                                            "author": "cld8",
                                                                                                            "id": "gr3ezcw",
                                                                                                            "parent_id": "t1_gr3eqjf",
                                                                                                            "score": 1,
                                                                                                            "created_utc": 1615872855.0,
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "body": "If he meets the kids then he's not a random stranger anymore. But also, this may shock you to imagine, men can do those things to her kids knowing that she has less recourse than an average woman legally because he can use proof against her that she is selling sex. That stuff can absolutely get your kids taken away entirely. Like yea this is hypothetical but also some of us have been through similar situations or know sex workers who have. I can't count the number of women I knew in the strip club fighting custody battles with men who were previously ok with them stripping but used it as a weapon against them to get their kids. All of these things may seem far fetched but they suddenly become extremely precarious when you're facing down the real thing and examining all these possibilities with your own kids.   \n\n\nHonestly I cannot imagine willingly letting an SD meet any children of mine. I wouldn't even let them be in the house overnight with my boyfriend until LONG into the relationship. Too many of us have witnessed or experienced too much child abuse to write this stuff off as ridiculous. I guess you don't get that mothering instinct thing.",
                                                                                                                    "author": "ColdHeaux",
                                                                                                                    "id": "gr3fkw8",
                                                                                                                    "parent_id": "t1_gr3ezcw",
                                                                                                                    "score": 2,
                                                                                                                    "created_utc": 1615873367.0,
                                                                                                                    "replies": []
                                                                                                                },
                                                                                                                {
                                                                                                                    "body": "All of these dynamics and possibilities can suddenly become \"oh shit now it's too late\" WAY fast. Honestly if you were my SD I would ESPECIALLY not let you meet my kids because you seem willfully ignorant of what is dangerous to children and to women. You seem almost obstinately unable to acknowledge that and that would be a red flag for me.",
                                                                                                                    "author": "ColdHeaux",
                                                                                                                    "id": "gr3fn7c",
                                                                                                                    "parent_id": "t1_gr3ezcw",
                                                                                                                    "score": 2,
                                                                                                                    "created_utc": 1615873421.0,
                                                                                                                    "replies": []
                                                                                                                },
                                                                                                                {
                                                                                                                    "body": "\"Better safe than sorry\" applies 1000x more for your children.",
                                                                                                                    "author": "ColdHeaux",
                                                                                                                    "id": "gr3fo6p",
                                                                                                                    "parent_id": "t1_gr3ezcw",
                                                                                                                    "score": 2,
                                                                                                                    "created_utc": 1615873445.0,
                                                                                                                    "replies": [
                                                                                                                        {
                                                                                                                            "body": "If someone is that paranoid, then they shouldn't be on a dating site, they should remain locked up at home. \n\nI can tell you that if someone lies to me about having/not having kids, that would be an instant next.  Most guys I know would say the same.",
                                                                                                                            "author": "cld8",
                                                                                                                            "id": "gr3fsrw",
                                                                                                                            "parent_id": "t1_gr3fo6p",
                                                                                                                            "score": 1,
                                                                                                                            "created_utc": 1615873556.0,
                                                                                                                            "replies": [
                                                                                                                                {
                                                                                                                                    "body": "I'd be perfectly happy to lose a guy who doesn't care about actually doing the work of protecting children... Also if you've met as many people (men and women) who've been through horrific shit as children due to their parents not protecting them as I have, you'd feel the same way. No woman with kids protecting them from men will be upset to lose a SD or boyfriend who doesn't understand that their kids safety comes first before anyone's hurt feelings.",
                                                                                                                                    "author": "ColdHeaux",
                                                                                                                                    "id": "gr3g983",
                                                                                                                                    "parent_id": "t1_gr3fsrw",
                                                                                                                                    "score": 1,
                                                                                                                                    "created_utc": 1615873960.0,
                                                                                                                                    "replies": [
                                                                                                                                        {
                                                                                                                                            "body": "Okay then, to each their own.",
                                                                                                                                            "author": "cld8",
                                                                                                                                            "id": "gr3h04l",
                                                                                                                                            "parent_id": "t1_gr3g983",
                                                                                                                                            "score": 1,
                                                                                                                                            "created_utc": 1615874631.0,
                                                                                                                                            "replies": []
                                                                                                                                        }
                                                                                                                                    ]
                                                                                                                                }
                                                                                                                            ]
                                                                                                                        }
                                                                                                                    ]
                                                                                                                }
                                                                                                            ]
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "body": "I will save you heartache hun. It's called Seeking ... a what? That does not equal long term. If you just want to treat someone and don't want an arrangement = element of literal transaction, then Bumble IS a better place. You can find someone you want a long term with, and treat with extras.",
                                                    "author": null,
                                                    "id": "gr38az4",
                                                    "parent_id": "t1_gr2jcuj",
                                                    "score": 1,
                                                    "created_utc": 1615867897.0,
                                                    "replies": [
                                                        {
                                                            "body": ">  It's called Seeking ... a what\n\nActually - it's just called Seeking.  They dropped the arrangement a long time ago.  However - let me key you in on a more important tag line of Seeking:\n\n\"Relationship on your terms\".\n\nSeeking is a dating site.  It's NOT vanilla dating.  But it is a dating site.  \n\nI respect that there is a wide audience in sugaring - and there is not a one style fits all.  For example - I primarily prefer doing monthly allowance, not PPM.  Based on your post history - I\"m going to guess we are at other ends of the sugar spectrum.  That's fine, but that's also the context with which I write this.\n\n>  then Bumble IS a better place\n\nI've been using Seeking for well over 4 years now.  I've had a number of relationships, including several SGFs.",
                                                            "author": "SDstartingOut",
                                                            "id": "gr4109z",
                                                            "parent_id": "t1_gr38az4",
                                                            "score": 2,
                                                            "created_utc": 1615894316.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "body": "Yeah, when *a friend* told *her* dates and POTs *she* had kids, a minority of them started making very sexual pedophilic and incestuous comments out of the blue.\n\nIt's a balance between protecting oneself and one's family vs also establishing a foundation of sincerity and trust.\n\nBut on the outset, you do not owe anyone personal information that you don't feel comfortable to divulge and doesn't affect their lives (this is debatable). \n\nErr on the side of personal caution.",
                                                    "author": "durtari",
                                                    "id": "gr3i7ee",
                                                    "parent_id": "t1_gr2jcuj",
                                                    "score": 1,
                                                    "created_utc": 1615875746.0,
                                                    "replies": [
                                                        {
                                                            "body": "> a minority of them started making very sexual pedophilic and incestuous comments out of the blue.\n\nSounds like a bonus?  What I Mean here is - that should be an immediate GET THE FUCK OUT OF DODGE.  Why would you want to continue dating/seeing that person?",
                                                            "author": "SDstartingOut",
                                                            "id": "gr4172x",
                                                            "parent_id": "t1_gr3i7ee",
                                                            "score": 1,
                                                            "created_utc": 1615894462.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "An offer that is significantly more than the average for your area should be a yellow to red flag, a lot of times the high number is to lure you in so they can either scam you or pull the bullshit that this guy did.",
            "author": "storm170",
            "id": "gr1l7kd",
            "parent_id": "t3_m5s0ww",
            "score": 24,
            "created_utc": 1615835140.0,
            "replies": []
        },
        {
            "body": "Ew, just one pillow? What if he has a romantic guest? What they gonna do, share that one measly pillow? Lmfao this is too funny. Sorry you had your time wasted OP.",
            "author": "LaIndiaDeAzucar",
            "id": "gr2dhq9",
            "parent_id": "t3_m5s0ww",
            "score": 18,
            "created_utc": 1615850217.0,
            "replies": [
                {
                    "body": "Haha was thinking the same thing. My SD has pillows and decorative pillows....all matching color scheme...haha The more pillows the merrier. I may hug and squeeze his pillows more than him haha",
                    "author": null,
                    "id": "gr309t7",
                    "parent_id": "t1_gr2dhq9",
                    "score": 6,
                    "created_utc": 1615863088.0,
                    "replies": [
                        {
                            "body": "Yeah, ngl, sometimes i hug his pillow bc I miss him lots lol",
                            "author": "LaIndiaDeAzucar",
                            "id": "gr32kov",
                            "parent_id": "t1_gr309t7",
                            "score": 2,
                            "created_utc": 1615864365.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "gr2yr3j",
                    "parent_id": "t1_gr2dhq9",
                    "score": 4,
                    "created_utc": 1615862270.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "gr2z31p",
                            "parent_id": "t1_gr2yr3j",
                            "score": 2,
                            "created_utc": 1615862447.0,
                            "replies": []
                        },
                        {
                            "body": "Dawwwww",
                            "author": null,
                            "id": "gr30bzl",
                            "parent_id": "t1_gr2yr3j",
                            "score": 2,
                            "created_utc": 1615863120.0,
                            "replies": []
                        },
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "gr3yj7g",
                            "parent_id": "t1_gr2yr3j",
                            "score": 1,
                            "created_utc": 1615892218.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Allowancefished",
            "author": null,
            "id": "gr2ihi5",
            "parent_id": "t3_m5s0ww",
            "score": 8,
            "created_utc": 1615853528.0,
            "replies": [
                {
                    "body": "😂😂😂",
                    "author": "usernamechecksout4u",
                    "id": "gr3o4an",
                    "parent_id": "t1_gr2ihi5",
                    "score": 2,
                    "created_utc": 1615881578.0,
                    "replies": []
                },
                {
                    "body": "Goldfished - promised gold but no gold...",
                    "author": "ExExpectations",
                    "id": "gr5fqmd",
                    "parent_id": "t1_gr2ihi5",
                    "score": 1,
                    "created_utc": 1615919450.0,
                    "replies": [
                        {
                            "body": "Another great term to add to my sugar dictionary!",
                            "author": "Gee_n_tonic",
                            "id": "gr6i6dw",
                            "parent_id": "t1_gr5fqmd",
                            "score": 1,
                            "created_utc": 1615937532.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "The studio part isn't that crazy. I live in a studio in nyc but have a high net worth. I'm single and a minimalist who doesn't need much.",
            "author": "Ididitall4thegnocchi",
            "id": "gr2e672",
            "parent_id": "t3_m5s0ww",
            "score": 18,
            "created_utc": 1615850666.0,
            "replies": [
                {
                    "body": "yes but Orlando",
                    "author": null,
                    "id": "gr2iex2",
                    "parent_id": "t1_gr2e672",
                    "score": 11,
                    "created_utc": 1615853480.0,
                    "replies": []
                },
                {
                    "body": "Yep same here.",
                    "author": "Fun_Focus8159",
                    "id": "gr2tugc",
                    "parent_id": "t1_gr2e672",
                    "score": 3,
                    "created_utc": 1615859604.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I have been an SD for over 16 years and have had dozens of pleased, satisfied and successful SBs who are very happy I entered their lives and provided the support I did.   My net worth or gross income is no measure of my generosity. I live a rather spartin lifestyle and until recently live alone in a one br apartment. It was sufficient to my needs. It was comfortable. I live the way I do because I do not want or need or enjoy ostentatious show of my wealth.\n\nYou may be absolutely right about the man you met, but I urge you not to judge an SD by his displays of wealth. His character, generosity and willingness to support you financially and otherwise is  his measure. Not the toys in his photis.",
            "author": "AFSMSgt",
            "id": "gr1n4ud",
            "parent_id": "t3_m5s0ww",
            "score": 23,
            "created_utc": 1615835996.0,
            "replies": [
                {
                    "body": "It appeared so cool and calm how we were both communicating and I was actually looking forward to meeting him after seeing him. \n\nI hate that for him- the lying about wanting an arrangement just so he can have a couple minutes where he felt like he had it.",
                    "author": "ddknows",
                    "id": "gr1pbom",
                    "parent_id": "t1_gr1n4ud",
                    "score": 9,
                    "created_utc": 1615836975.0,
                    "replies": [
                        {
                            "body": "Makes me miss my first SD. \nWe were only long distance and FTd often and text and pictures. Turns out he was still legally married, but separated and although I was fine with it, I guess he had a change of heart. \n\nWe had such a true, fun connection him and I.",
                            "author": "ddknows",
                            "id": "gr1pd52",
                            "parent_id": "t1_gr1pbom",
                            "score": 1,
                            "created_utc": 1615836993.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Fucking *sigh.* Men like this are as much of a plague to SA as SBs that come thinking platonic/online is a prevalent thing. \n\nHe did you a favor.",
            "author": "FoxyFreckles1989",
            "id": "gr2ur2e",
            "parent_id": "t3_m5s0ww",
            "score": 9,
            "created_utc": 1615860087.0,
            "replies": []
        },
        {
            "body": "These type of guys are so annoying- false advertisement!",
            "author": "Purplecrumpet7",
            "id": "gr2s0ep",
            "parent_id": "t3_m5s0ww",
            "score": 3,
            "created_utc": 1615858649.0,
            "replies": []
        },
        {
            "body": "Claaaassic dick off SA",
            "author": "mmpopsicle",
            "id": "gr3g01x",
            "parent_id": "t3_m5s0ww",
            "score": 3,
            "created_utc": 1615873734.0,
            "replies": []
        },
        {
            "body": "I don’t understand.  He was offering x dollars per week but also says he wants to treat you like he met you on a vanilla dating app.  \n\nAlso for what it’s worth a nice studio in my area of nyc is 800k to 900k depending on the location.  If he is in that area and paid off his studio, he likely is a legit multi millionaire but that will vary by area",
            "author": "pussy_impaler337",
            "id": "gr24rrj",
            "parent_id": "t3_m5s0ww",
            "score": 4,
            "created_utc": 1615844093.0,
            "replies": [
                {
                    "body": "I wish. He offered x dollars but after we talked for a bit longer, he then said:\n\n “oh, you don’t want a relationship with me? You still want an arrangement? I wanted to treat this like we met on Bumble.”\n\nWho knows what he wanted. \n\nHow do you offer and then negate?",
                    "author": "ddknows",
                    "id": "gr24z8e",
                    "parent_id": "t1_gr24rrj",
                    "score": 5,
                    "created_utc": 1615844266.0,
                    "replies": [
                        {
                            "body": "Oh he blatantly lied then about the initial offer?  A lot of us want a legit sugar relationship where yes there is allowance but a lot of the best parts of normal dating as well.  I don’t think he should be lying like that, if he is a spoiling boyfriend where he buys stuff with no set allowance that is one thing but it sounds like he was offering sugar then trying to switch to vanilla dating right away?  If so that’s dishonest",
                            "author": "pussy_impaler337",
                            "id": "gr259r1",
                            "parent_id": "t1_gr24z8e",
                            "score": 6,
                            "created_utc": 1615844520.0,
                            "replies": [
                                {
                                    "body": "That was exactly it. Unfortunately. He was weird and quirky but I actually like that. Normal weirdos lol",
                                    "author": "ddknows",
                                    "id": "gr25hsk",
                                    "parent_id": "t1_gr259r1",
                                    "score": 3,
                                    "created_utc": 1615844712.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "He was in Orlando, studios are nowhere near that",
                            "author": null,
                            "id": "gr3wnie",
                            "parent_id": "t1_gr24z8e",
                            "score": 1,
                            "created_utc": 1615890489.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Isn't Bumble the one where women have to pre-approve the men?\n\nThat almost sounds like the opposite of SA.",
            "author": "KeyToGramercy",
            "id": "gr3kmx3",
            "parent_id": "t3_m5s0ww",
            "score": 2,
            "created_utc": 1615878093.0,
            "replies": [
                {
                    "body": "Lol yes, exactly. \n\nHe used that statement to say he wanted to go straight vanilla after “agreeing” to an allowance.",
                    "author": "ddknows",
                    "id": "gr46h0k",
                    "parent_id": "t1_gr3kmx3",
                    "score": 1,
                    "created_utc": 1615898156.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "He sounds nasty and gross.  If you really need the money ask him to send you some.  I’ve heard of cash app but never used it before.  Then don’t bother meeting him.  Too many red flags.  However, I’m not sure if you’re allowed to do that on SA.  Block or delete him.  Have faith there’s a good one out there and don’t settle on any nasty weirdos.",
            "author": "Greenapplehoneybun",
            "id": "gr382hl",
            "parent_id": "t3_m5s0ww",
            "score": -1,
            "created_utc": 1615867744.0,
            "replies": []
        },
        {
            "body": "I'm confused about the one pillow thing. If someone is single and living alone, then what's wrong with that? The second pillow can be placed when there's company over. That's what I would do. Unless I had company over often. So I don't get it.",
            "author": "InnocentSweetTooth",
            "id": "gr3tcto",
            "parent_id": "t3_m5s0ww",
            "score": 1,
            "created_utc": 1615887150.0,
            "replies": [
                {
                    "body": "He had two pillows. Lol\n\nI’m also single and always have two pillows on my bed. Call me weird but there’s an energy thing from “The Secret” that talks about leaving room for your ideal partner to step into your life. If you sleep in the middle of your bed with one pillow you’re telling the universe you have no room for anyone else. In the opposite effect, if you have that extra pillow and sleep on one side, your opening up the invitation for another person to be welcomed. \n\nBut then I end up sleeping diagonally anyway so. \nMaybe that’s my deal. 😆",
                    "author": "ddknows",
                    "id": "gr46u67",
                    "parent_id": "t1_gr3tcto",
                    "score": 1,
                    "created_utc": 1615898378.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Non SDs are Phishing on SA for vanilla  suckers just as non SBs are for platonic guys. \n\nThe only reason they are there on SA is that they have enough success to make it worth their while. Unfortunately there is a small cohort of vanillas of both sexes using Seeking inappropriately.  The key is to hive a high index of suspicion in sussing out these frauds.",
            "author": "GSSD",
            "id": "gr453w1",
            "parent_id": "t3_m5s0ww",
            "score": 1,
            "created_utc": 1615897265.0,
            "replies": []
        },
        {
            "body": "I meant to say the room was as big as his bed. \nLike no room in his room.",
            "author": "ddknows",
            "id": "gr1pnjk",
            "parent_id": "t1_gr1p110",
            "score": 28,
            "created_utc": 1615837120.0,
            "replies": [
                {
                    "body": "Gotcha",
                    "author": "OldschoolSD",
                    "id": "gr1pz77",
                    "parent_id": "t1_gr1pnjk",
                    "score": 4,
                    "created_utc": 1615837263.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I was confused by the \"We video chatted on What’sapp and I saw he had one pillow, in that one bedroom and just eww\" comment. \n\nHaving one pillow freaked you out?",
            "author": "DazyKoala007",
            "id": "gr2duq4",
            "parent_id": "t1_gr1p110",
            "score": 9,
            "created_utc": 1615850453.0,
            "replies": [
                {
                    "body": "Yes, where would the woman be putting her head if she stays over?",
                    "author": "MistressMistyX",
                    "id": "gr2o3q5",
                    "parent_id": "t1_gr2duq4",
                    "score": 36,
                    "created_utc": 1615856615.0,
                    "replies": []
                },
                {
                    "body": "That's a red flag for me even in regular relationships lol. Most established adults will have at least 2-4 pillows. It's like owning one plate.",
                    "author": "clashingtaco",
                    "id": "gr38o5i",
                    "parent_id": "t1_gr2duq4",
                    "score": 33,
                    "created_utc": 1615868139.0,
                    "replies": [
                        {
                            "body": "🤣",
                            "author": "tattoosandtail",
                            "id": "gr3skyr",
                            "parent_id": "t1_gr38o5i",
                            "score": 1,
                            "created_utc": 1615886330.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Yup that got me too. I got the first red flag but the second red flag was more of a red flag on the posters thinking. Judging people based on pictures sent is too shallow. What if the dude was posing next to his boss’s Ferrari. Would that be ok? Other than the guy clearly was not a SD.",
            "author": null,
            "id": "gr4ctux",
            "parent_id": "t1_gr1p110",
            "score": 1,
            "created_utc": 1615901789.0,
            "replies": []
        },
        {
            "body": "I think I feel the same way. It just provides extra support on the “I’m busy but want to make time for you” conversation cause we truly do have a lot on our plate.",
            "author": "ddknows",
            "id": "gr1pu61",
            "parent_id": "t1_gr1okwm",
            "score": 12,
            "created_utc": 1615837202.0,
            "replies": [
                {
                    "body": "Nope. Nobody needs to know about kids until much later, if at all. \n\nNo one needs to make justification on why we can’t or don’t want to be available to them 24/7. NO ONE should have that kind of expectations - and you/we don’t need to make justifications for having a life, EVEN IF we don’t have kids.",
                    "author": "ExExpectations",
                    "id": "gr1rhwt",
                    "parent_id": "t1_gr1pu61",
                    "score": 29,
                    "created_utc": 1615837937.0,
                    "replies": [
                        {
                            "body": "I like that. Thank you for your input",
                            "author": "ddknows",
                            "id": "gr21cbo",
                            "parent_id": "t1_gr1rhwt",
                            "score": 8,
                            "created_utc": 1615842300.0,
                            "replies": [
                                {
                                    "body": "For what it's worth, I completely disagree on this.  But I also treat sugaring as a form of dating (not bumble, but it's still a form of dating).  I'm not married, and honesty is an important thing.  \n\nMy goal of any SR - is for it to \"grow\".  So I'm not interested in strictly NSA arrangements.  I'm also childfree.  So it's an incompatibility.  And I much prefer to know that up front.",
                                    "author": "SDstartingOut",
                                    "id": "gr2jcuj",
                                    "parent_id": "t1_gr21cbo",
                                    "score": 5,
                                    "created_utc": 1615854047.0,
                                    "replies": [
                                        {
                                            "body": "Yes but you also must understand that it's a parent's first responsibility to protect their children. I'm not the only person in my family or in my group of friends who suffered at the hands of \"mom's boyfriend.\" The horrible irony is the same happened to her as a kid with HER mom's boyfriends. Many people strive to avoid any chance of the same thing happening to their children. Protecting your children from an SD is absolutely 100% understandable and I would never ever trust a man who didn't agree with that absolutely without question. Children's safety comes before anything at all.",
                                            "author": "ColdHeaux",
                                            "id": "gr2mscw",
                                            "parent_id": "t1_gr2jcuj",
                                            "score": 15,
                                            "created_utc": 1615855917.0,
                                            "replies": [
                                                {
                                                    "body": "I don't understand the correlation.\n\nHow does admitting you have children, lead to suffering of the children?  If he wants to meet them?  Well, no.  Clearly, that's inappropriate.  And you should take that as a red flag and not even start a relationship with him.\n\nI don't think that little bit of honesty (relationship status, having children or not) is too much to ask for from a person you plan to engage on an intimate relationship with.",
                                                    "author": "SDstartingOut",
                                                    "id": "gr2sri4",
                                                    "parent_id": "t1_gr2mscw",
                                                    "score": -2,
                                                    "created_utc": 1615859038.0,
                                                    "replies": [
                                                        {
                                                            "body": "[deleted]",
                                                            "author": null,
                                                            "id": "gr2xz1h",
                                                            "parent_id": "t1_gr2sri4",
                                                            "score": 5,
                                                            "created_utc": 1615861839.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Oh right ALSO that shit can come up in a custody battle-- another good reaosn to keep them seperate.",
                                                                    "author": "ColdHeaux",
                                                                    "id": "gr2yd2j",
                                                                    "parent_id": "t1_gr2xz1h",
                                                                    "score": 5,
                                                                    "created_utc": 1615862057.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "body": "I mean, are you serious? You don't think there's any chance on earth a guy could.... follow her home and go after her kids lol? I'm not saying always conceal them forever obvi but yeah not everyone needs to know everything right away.",
                                                            "author": "ColdHeaux",
                                                            "id": "gr2y04t",
                                                            "parent_id": "t1_gr2sri4",
                                                            "score": 3,
                                                            "created_utc": 1615861855.0,
                                                            "replies": [
                                                                {
                                                                    "body": "> You don't think there's any chance on earth a guy could.... follow her home and go after her kids lol?\n\nSo could anyone else... does that mean she has to keep the existence of her kids a secret from the world?  \n\nI think you have a wild imagination.",
                                                                    "author": "cld8",
                                                                    "id": "gr3da8h",
                                                                    "parent_id": "t1_gr2y04t",
                                                                    "score": -2,
                                                                    "created_utc": 1615871476.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "Dude my own grandpa tried to kill my dad and aunt when they were kids lol, how unusual do you think this is? And yes, a man who is potentially seeking women who basically get paid for sex is higher suspect than the average man because sex workers are more vulnerable and police don't investigate our deaths as much so dangerous men sometimes target us first. So I would absolutely be cautious with a vanilla partner and even MORE with a sugar partner. Do I have a wild imagination or are you extremely naive to the dangers we face?",
                                                                            "author": "ColdHeaux",
                                                                            "id": "gr3dwm7",
                                                                            "parent_id": "t1_gr3da8h",
                                                                            "score": 3,
                                                                            "created_utc": 1615871967.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "How is your grandpa trying to kill your dad and aunt relevant to this?  Was your grandpa a stranger who met them through a dating app?",
                                                                                    "author": "cld8",
                                                                                    "id": "gr3ek7c",
                                                                                    "parent_id": "t1_gr3dwm7",
                                                                                    "score": 1,
                                                                                    "created_utc": 1615872505.0,
                                                                                    "replies": [
                                                                                        {
                                                                                            "body": "The rest of my comment should have made that clear. Even men close to us can be a danger, so of course those who are seeking out women who get paid for sex can be an even bigger danger because that is a sociologically vulnerable group of women who can get targeted by dangerous men.",
                                                                                            "author": "ColdHeaux",
                                                                                            "id": "gr3eqjf",
                                                                                            "parent_id": "t1_gr3ek7c",
                                                                                            "score": 2,
                                                                                            "created_utc": 1615872649.0,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "body": "> so of course \n\nYou saying \"of course\" does not make something true.  The vast majority of abuse of children is done by men who are known to them, not by random strangers.  \n\nIf a man wanted to abuse a random kid, he would just go to a park, or a school, or wherever.  He's not going to meet a woman on a dating app and then say \"hey, let me follow her home and abuse her child\". This simply defies common sense.",
                                                                                                    "author": "cld8",
                                                                                                    "id": "gr3ezcw",
                                                                                                    "parent_id": "t1_gr3eqjf",
                                                                                                    "score": 1,
                                                                                                    "created_utc": 1615872855.0,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "body": "If he meets the kids then he's not a random stranger anymore. But also, this may shock you to imagine, men can do those things to her kids knowing that she has less recourse than an average woman legally because he can use proof against her that she is selling sex. That stuff can absolutely get your kids taken away entirely. Like yea this is hypothetical but also some of us have been through similar situations or know sex workers who have. I can't count the number of women I knew in the strip club fighting custody battles with men who were previously ok with them stripping but used it as a weapon against them to get their kids. All of these things may seem far fetched but they suddenly become extremely precarious when you're facing down the real thing and examining all these possibilities with your own kids.   \n\n\nHonestly I cannot imagine willingly letting an SD meet any children of mine. I wouldn't even let them be in the house overnight with my boyfriend until LONG into the relationship. Too many of us have witnessed or experienced too much child abuse to write this stuff off as ridiculous. I guess you don't get that mothering instinct thing.",
                                                                                                            "author": "ColdHeaux",
                                                                                                            "id": "gr3fkw8",
                                                                                                            "parent_id": "t1_gr3ezcw",
                                                                                                            "score": 2,
                                                                                                            "created_utc": 1615873367.0,
                                                                                                            "replies": []
                                                                                                        },
                                                                                                        {
                                                                                                            "body": "All of these dynamics and possibilities can suddenly become \"oh shit now it's too late\" WAY fast. Honestly if you were my SD I would ESPECIALLY not let you meet my kids because you seem willfully ignorant of what is dangerous to children and to women. You seem almost obstinately unable to acknowledge that and that would be a red flag for me.",
                                                                                                            "author": "ColdHeaux",
                                                                                                            "id": "gr3fn7c",
                                                                                                            "parent_id": "t1_gr3ezcw",
                                                                                                            "score": 2,
                                                                                                            "created_utc": 1615873421.0,
                                                                                                            "replies": []
                                                                                                        },
                                                                                                        {
                                                                                                            "body": "\"Better safe than sorry\" applies 1000x more for your children.",
                                                                                                            "author": "ColdHeaux",
                                                                                                            "id": "gr3fo6p",
                                                                                                            "parent_id": "t1_gr3ezcw",
                                                                                                            "score": 2,
                                                                                                            "created_utc": 1615873445.0,
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "body": "If someone is that paranoid, then they shouldn't be on a dating site, they should remain locked up at home. \n\nI can tell you that if someone lies to me about having/not having kids, that would be an instant next.  Most guys I know would say the same.",
                                                                                                                    "author": "cld8",
                                                                                                                    "id": "gr3fsrw",
                                                                                                                    "parent_id": "t1_gr3fo6p",
                                                                                                                    "score": 1,
                                                                                                                    "created_utc": 1615873556.0,
                                                                                                                    "replies": [
                                                                                                                        {
                                                                                                                            "body": "I'd be perfectly happy to lose a guy who doesn't care about actually doing the work of protecting children... Also if you've met as many people (men and women) who've been through horrific shit as children due to their parents not protecting them as I have, you'd feel the same way. No woman with kids protecting them from men will be upset to lose a SD or boyfriend who doesn't understand that their kids safety comes first before anyone's hurt feelings.",
                                                                                                                            "author": "ColdHeaux",
                                                                                                                            "id": "gr3g983",
                                                                                                                            "parent_id": "t1_gr3fsrw",
                                                                                                                            "score": 1,
                                                                                                                            "created_utc": 1615873960.0,
                                                                                                                            "replies": [
                                                                                                                                {
                                                                                                                                    "body": "Okay then, to each their own.",
                                                                                                                                    "author": "cld8",
                                                                                                                                    "id": "gr3h04l",
                                                                                                                                    "parent_id": "t1_gr3g983",
                                                                                                                                    "score": 1,
                                                                                                                                    "created_utc": 1615874631.0,
                                                                                                                                    "replies": []
                                                                                                                                }
                                                                                                                            ]
                                                                                                                        }
                                                                                                                    ]
                                                                                                                }
                                                                                                            ]
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "body": "I will save you heartache hun. It's called Seeking ... a what? That does not equal long term. If you just want to treat someone and don't want an arrangement = element of literal transaction, then Bumble IS a better place. You can find someone you want a long term with, and treat with extras.",
                                            "author": null,
                                            "id": "gr38az4",
                                            "parent_id": "t1_gr2jcuj",
                                            "score": 1,
                                            "created_utc": 1615867897.0,
                                            "replies": [
                                                {
                                                    "body": ">  It's called Seeking ... a what\n\nActually - it's just called Seeking.  They dropped the arrangement a long time ago.  However - let me key you in on a more important tag line of Seeking:\n\n\"Relationship on your terms\".\n\nSeeking is a dating site.  It's NOT vanilla dating.  But it is a dating site.  \n\nI respect that there is a wide audience in sugaring - and there is not a one style fits all.  For example - I primarily prefer doing monthly allowance, not PPM.  Based on your post history - I\"m going to guess we are at other ends of the sugar spectrum.  That's fine, but that's also the context with which I write this.\n\n>  then Bumble IS a better place\n\nI've been using Seeking for well over 4 years now.  I've had a number of relationships, including several SGFs.",
                                                    "author": "SDstartingOut",
                                                    "id": "gr4109z",
                                                    "parent_id": "t1_gr38az4",
                                                    "score": 2,
                                                    "created_utc": 1615894316.0,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "body": "Yeah, when *a friend* told *her* dates and POTs *she* had kids, a minority of them started making very sexual pedophilic and incestuous comments out of the blue.\n\nIt's a balance between protecting oneself and one's family vs also establishing a foundation of sincerity and trust.\n\nBut on the outset, you do not owe anyone personal information that you don't feel comfortable to divulge and doesn't affect their lives (this is debatable). \n\nErr on the side of personal caution.",
                                            "author": "durtari",
                                            "id": "gr3i7ee",
                                            "parent_id": "t1_gr2jcuj",
                                            "score": 1,
                                            "created_utc": 1615875746.0,
                                            "replies": [
                                                {
                                                    "body": "> a minority of them started making very sexual pedophilic and incestuous comments out of the blue.\n\nSounds like a bonus?  What I Mean here is - that should be an immediate GET THE FUCK OUT OF DODGE.  Why would you want to continue dating/seeing that person?",
                                                    "author": "SDstartingOut",
                                                    "id": "gr4172x",
                                                    "parent_id": "t1_gr3i7ee",
                                                    "score": 1,
                                                    "created_utc": 1615894462.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Haha was thinking the same thing. My SD has pillows and decorative pillows....all matching color scheme...haha The more pillows the merrier. I may hug and squeeze his pillows more than him haha",
            "author": null,
            "id": "gr309t7",
            "parent_id": "t1_gr2dhq9",
            "score": 6,
            "created_utc": 1615863088.0,
            "replies": [
                {
                    "body": "Yeah, ngl, sometimes i hug his pillow bc I miss him lots lol",
                    "author": "LaIndiaDeAzucar",
                    "id": "gr32kov",
                    "parent_id": "t1_gr309t7",
                    "score": 2,
                    "created_utc": 1615864365.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gr2yr3j",
            "parent_id": "t1_gr2dhq9",
            "score": 4,
            "created_utc": 1615862270.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "gr2z31p",
                    "parent_id": "t1_gr2yr3j",
                    "score": 2,
                    "created_utc": 1615862447.0,
                    "replies": []
                },
                {
                    "body": "Dawwwww",
                    "author": null,
                    "id": "gr30bzl",
                    "parent_id": "t1_gr2yr3j",
                    "score": 2,
                    "created_utc": 1615863120.0,
                    "replies": []
                },
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "gr3yj7g",
                    "parent_id": "t1_gr2yr3j",
                    "score": 1,
                    "created_utc": 1615892218.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "😂😂😂",
            "author": "usernamechecksout4u",
            "id": "gr3o4an",
            "parent_id": "t1_gr2ihi5",
            "score": 2,
            "created_utc": 1615881578.0,
            "replies": []
        },
        {
            "body": "Goldfished - promised gold but no gold...",
            "author": "ExExpectations",
            "id": "gr5fqmd",
            "parent_id": "t1_gr2ihi5",
            "score": 1,
            "created_utc": 1615919450.0,
            "replies": [
                {
                    "body": "Another great term to add to my sugar dictionary!",
                    "author": "Gee_n_tonic",
                    "id": "gr6i6dw",
                    "parent_id": "t1_gr5fqmd",
                    "score": 1,
                    "created_utc": 1615937532.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "yes but Orlando",
            "author": null,
            "id": "gr2iex2",
            "parent_id": "t1_gr2e672",
            "score": 11,
            "created_utc": 1615853480.0,
            "replies": []
        },
        {
            "body": "Yep same here.",
            "author": "Fun_Focus8159",
            "id": "gr2tugc",
            "parent_id": "t1_gr2e672",
            "score": 3,
            "created_utc": 1615859604.0,
            "replies": []
        },
        {
            "body": "It appeared so cool and calm how we were both communicating and I was actually looking forward to meeting him after seeing him. \n\nI hate that for him- the lying about wanting an arrangement just so he can have a couple minutes where he felt like he had it.",
            "author": "ddknows",
            "id": "gr1pbom",
            "parent_id": "t1_gr1n4ud",
            "score": 9,
            "created_utc": 1615836975.0,
            "replies": [
                {
                    "body": "Makes me miss my first SD. \nWe were only long distance and FTd often and text and pictures. Turns out he was still legally married, but separated and although I was fine with it, I guess he had a change of heart. \n\nWe had such a true, fun connection him and I.",
                    "author": "ddknows",
                    "id": "gr1pd52",
                    "parent_id": "t1_gr1pbom",
                    "score": 1,
                    "created_utc": 1615836993.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I wish. He offered x dollars but after we talked for a bit longer, he then said:\n\n “oh, you don’t want a relationship with me? You still want an arrangement? I wanted to treat this like we met on Bumble.”\n\nWho knows what he wanted. \n\nHow do you offer and then negate?",
            "author": "ddknows",
            "id": "gr24z8e",
            "parent_id": "t1_gr24rrj",
            "score": 5,
            "created_utc": 1615844266.0,
            "replies": [
                {
                    "body": "Oh he blatantly lied then about the initial offer?  A lot of us want a legit sugar relationship where yes there is allowance but a lot of the best parts of normal dating as well.  I don’t think he should be lying like that, if he is a spoiling boyfriend where he buys stuff with no set allowance that is one thing but it sounds like he was offering sugar then trying to switch to vanilla dating right away?  If so that’s dishonest",
                    "author": "pussy_impaler337",
                    "id": "gr259r1",
                    "parent_id": "t1_gr24z8e",
                    "score": 6,
                    "created_utc": 1615844520.0,
                    "replies": [
                        {
                            "body": "That was exactly it. Unfortunately. He was weird and quirky but I actually like that. Normal weirdos lol",
                            "author": "ddknows",
                            "id": "gr25hsk",
                            "parent_id": "t1_gr259r1",
                            "score": 3,
                            "created_utc": 1615844712.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "He was in Orlando, studios are nowhere near that",
                    "author": null,
                    "id": "gr3wnie",
                    "parent_id": "t1_gr24z8e",
                    "score": 1,
                    "created_utc": 1615890489.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Lol yes, exactly. \n\nHe used that statement to say he wanted to go straight vanilla after “agreeing” to an allowance.",
            "author": "ddknows",
            "id": "gr46h0k",
            "parent_id": "t1_gr3kmx3",
            "score": 1,
            "created_utc": 1615898156.0,
            "replies": []
        },
        {
            "body": "He had two pillows. Lol\n\nI’m also single and always have two pillows on my bed. Call me weird but there’s an energy thing from “The Secret” that talks about leaving room for your ideal partner to step into your life. If you sleep in the middle of your bed with one pillow you’re telling the universe you have no room for anyone else. In the opposite effect, if you have that extra pillow and sleep on one side, your opening up the invitation for another person to be welcomed. \n\nBut then I end up sleeping diagonally anyway so. \nMaybe that’s my deal. 😆",
            "author": "ddknows",
            "id": "gr46u67",
            "parent_id": "t1_gr3tcto",
            "score": 1,
            "created_utc": 1615898378.0,
            "replies": []
        },
        {
            "body": "Gotcha",
            "author": "OldschoolSD",
            "id": "gr1pz77",
            "parent_id": "t1_gr1pnjk",
            "score": 4,
            "created_utc": 1615837263.0,
            "replies": []
        },
        {
            "body": "Yes, where would the woman be putting her head if she stays over?",
            "author": "MistressMistyX",
            "id": "gr2o3q5",
            "parent_id": "t1_gr2duq4",
            "score": 36,
            "created_utc": 1615856615.0,
            "replies": []
        },
        {
            "body": "That's a red flag for me even in regular relationships lol. Most established adults will have at least 2-4 pillows. It's like owning one plate.",
            "author": "clashingtaco",
            "id": "gr38o5i",
            "parent_id": "t1_gr2duq4",
            "score": 33,
            "created_utc": 1615868139.0,
            "replies": [
                {
                    "body": "🤣",
                    "author": "tattoosandtail",
                    "id": "gr3skyr",
                    "parent_id": "t1_gr38o5i",
                    "score": 1,
                    "created_utc": 1615886330.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Nope. Nobody needs to know about kids until much later, if at all. \n\nNo one needs to make justification on why we can’t or don’t want to be available to them 24/7. NO ONE should have that kind of expectations - and you/we don’t need to make justifications for having a life, EVEN IF we don’t have kids.",
            "author": "ExExpectations",
            "id": "gr1rhwt",
            "parent_id": "t1_gr1pu61",
            "score": 29,
            "created_utc": 1615837937.0,
            "replies": [
                {
                    "body": "I like that. Thank you for your input",
                    "author": "ddknows",
                    "id": "gr21cbo",
                    "parent_id": "t1_gr1rhwt",
                    "score": 8,
                    "created_utc": 1615842300.0,
                    "replies": [
                        {
                            "body": "For what it's worth, I completely disagree on this.  But I also treat sugaring as a form of dating (not bumble, but it's still a form of dating).  I'm not married, and honesty is an important thing.  \n\nMy goal of any SR - is for it to \"grow\".  So I'm not interested in strictly NSA arrangements.  I'm also childfree.  So it's an incompatibility.  And I much prefer to know that up front.",
                            "author": "SDstartingOut",
                            "id": "gr2jcuj",
                            "parent_id": "t1_gr21cbo",
                            "score": 5,
                            "created_utc": 1615854047.0,
                            "replies": [
                                {
                                    "body": "Yes but you also must understand that it's a parent's first responsibility to protect their children. I'm not the only person in my family or in my group of friends who suffered at the hands of \"mom's boyfriend.\" The horrible irony is the same happened to her as a kid with HER mom's boyfriends. Many people strive to avoid any chance of the same thing happening to their children. Protecting your children from an SD is absolutely 100% understandable and I would never ever trust a man who didn't agree with that absolutely without question. Children's safety comes before anything at all.",
                                    "author": "ColdHeaux",
                                    "id": "gr2mscw",
                                    "parent_id": "t1_gr2jcuj",
                                    "score": 15,
                                    "created_utc": 1615855917.0,
                                    "replies": [
                                        {
                                            "body": "I don't understand the correlation.\n\nHow does admitting you have children, lead to suffering of the children?  If he wants to meet them?  Well, no.  Clearly, that's inappropriate.  And you should take that as a red flag and not even start a relationship with him.\n\nI don't think that little bit of honesty (relationship status, having children or not) is too much to ask for from a person you plan to engage on an intimate relationship with.",
                                            "author": "SDstartingOut",
                                            "id": "gr2sri4",
                                            "parent_id": "t1_gr2mscw",
                                            "score": -2,
                                            "created_utc": 1615859038.0,
                                            "replies": [
                                                {
                                                    "body": "[deleted]",
                                                    "author": null,
                                                    "id": "gr2xz1h",
                                                    "parent_id": "t1_gr2sri4",
                                                    "score": 5,
                                                    "created_utc": 1615861839.0,
                                                    "replies": [
                                                        {
                                                            "body": "Oh right ALSO that shit can come up in a custody battle-- another good reaosn to keep them seperate.",
                                                            "author": "ColdHeaux",
                                                            "id": "gr2yd2j",
                                                            "parent_id": "t1_gr2xz1h",
                                                            "score": 5,
                                                            "created_utc": 1615862057.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "body": "I mean, are you serious? You don't think there's any chance on earth a guy could.... follow her home and go after her kids lol? I'm not saying always conceal them forever obvi but yeah not everyone needs to know everything right away.",
                                                    "author": "ColdHeaux",
                                                    "id": "gr2y04t",
                                                    "parent_id": "t1_gr2sri4",
                                                    "score": 3,
                                                    "created_utc": 1615861855.0,
                                                    "replies": [
                                                        {
                                                            "body": "> You don't think there's any chance on earth a guy could.... follow her home and go after her kids lol?\n\nSo could anyone else... does that mean she has to keep the existence of her kids a secret from the world?  \n\nI think you have a wild imagination.",
                                                            "author": "cld8",
                                                            "id": "gr3da8h",
                                                            "parent_id": "t1_gr2y04t",
                                                            "score": -2,
                                                            "created_utc": 1615871476.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Dude my own grandpa tried to kill my dad and aunt when they were kids lol, how unusual do you think this is? And yes, a man who is potentially seeking women who basically get paid for sex is higher suspect than the average man because sex workers are more vulnerable and police don't investigate our deaths as much so dangerous men sometimes target us first. So I would absolutely be cautious with a vanilla partner and even MORE with a sugar partner. Do I have a wild imagination or are you extremely naive to the dangers we face?",
                                                                    "author": "ColdHeaux",
                                                                    "id": "gr3dwm7",
                                                                    "parent_id": "t1_gr3da8h",
                                                                    "score": 3,
                                                                    "created_utc": 1615871967.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "How is your grandpa trying to kill your dad and aunt relevant to this?  Was your grandpa a stranger who met them through a dating app?",
                                                                            "author": "cld8",
                                                                            "id": "gr3ek7c",
                                                                            "parent_id": "t1_gr3dwm7",
                                                                            "score": 1,
                                                                            "created_utc": 1615872505.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "The rest of my comment should have made that clear. Even men close to us can be a danger, so of course those who are seeking out women who get paid for sex can be an even bigger danger because that is a sociologically vulnerable group of women who can get targeted by dangerous men.",
                                                                                    "author": "ColdHeaux",
                                                                                    "id": "gr3eqjf",
                                                                                    "parent_id": "t1_gr3ek7c",
                                                                                    "score": 2,
                                                                                    "created_utc": 1615872649.0,
                                                                                    "replies": [
                                                                                        {
                                                                                            "body": "> so of course \n\nYou saying \"of course\" does not make something true.  The vast majority of abuse of children is done by men who are known to them, not by random strangers.  \n\nIf a man wanted to abuse a random kid, he would just go to a park, or a school, or wherever.  He's not going to meet a woman on a dating app and then say \"hey, let me follow her home and abuse her child\". This simply defies common sense.",
                                                                                            "author": "cld8",
                                                                                            "id": "gr3ezcw",
                                                                                            "parent_id": "t1_gr3eqjf",
                                                                                            "score": 1,
                                                                                            "created_utc": 1615872855.0,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "body": "If he meets the kids then he's not a random stranger anymore. But also, this may shock you to imagine, men can do those things to her kids knowing that she has less recourse than an average woman legally because he can use proof against her that she is selling sex. That stuff can absolutely get your kids taken away entirely. Like yea this is hypothetical but also some of us have been through similar situations or know sex workers who have. I can't count the number of women I knew in the strip club fighting custody battles with men who were previously ok with them stripping but used it as a weapon against them to get their kids. All of these things may seem far fetched but they suddenly become extremely precarious when you're facing down the real thing and examining all these possibilities with your own kids.   \n\n\nHonestly I cannot imagine willingly letting an SD meet any children of mine. I wouldn't even let them be in the house overnight with my boyfriend until LONG into the relationship. Too many of us have witnessed or experienced too much child abuse to write this stuff off as ridiculous. I guess you don't get that mothering instinct thing.",
                                                                                                    "author": "ColdHeaux",
                                                                                                    "id": "gr3fkw8",
                                                                                                    "parent_id": "t1_gr3ezcw",
                                                                                                    "score": 2,
                                                                                                    "created_utc": 1615873367.0,
                                                                                                    "replies": []
                                                                                                },
                                                                                                {
                                                                                                    "body": "All of these dynamics and possibilities can suddenly become \"oh shit now it's too late\" WAY fast. Honestly if you were my SD I would ESPECIALLY not let you meet my kids because you seem willfully ignorant of what is dangerous to children and to women. You seem almost obstinately unable to acknowledge that and that would be a red flag for me.",
                                                                                                    "author": "ColdHeaux",
                                                                                                    "id": "gr3fn7c",
                                                                                                    "parent_id": "t1_gr3ezcw",
                                                                                                    "score": 2,
                                                                                                    "created_utc": 1615873421.0,
                                                                                                    "replies": []
                                                                                                },
                                                                                                {
                                                                                                    "body": "\"Better safe than sorry\" applies 1000x more for your children.",
                                                                                                    "author": "ColdHeaux",
                                                                                                    "id": "gr3fo6p",
                                                                                                    "parent_id": "t1_gr3ezcw",
                                                                                                    "score": 2,
                                                                                                    "created_utc": 1615873445.0,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "body": "If someone is that paranoid, then they shouldn't be on a dating site, they should remain locked up at home. \n\nI can tell you that if someone lies to me about having/not having kids, that would be an instant next.  Most guys I know would say the same.",
                                                                                                            "author": "cld8",
                                                                                                            "id": "gr3fsrw",
                                                                                                            "parent_id": "t1_gr3fo6p",
                                                                                                            "score": 1,
                                                                                                            "created_utc": 1615873556.0,
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "body": "I'd be perfectly happy to lose a guy who doesn't care about actually doing the work of protecting children... Also if you've met as many people (men and women) who've been through horrific shit as children due to their parents not protecting them as I have, you'd feel the same way. No woman with kids protecting them from men will be upset to lose a SD or boyfriend who doesn't understand that their kids safety comes first before anyone's hurt feelings.",
                                                                                                                    "author": "ColdHeaux",
                                                                                                                    "id": "gr3g983",
                                                                                                                    "parent_id": "t1_gr3fsrw",
                                                                                                                    "score": 1,
                                                                                                                    "created_utc": 1615873960.0,
                                                                                                                    "replies": [
                                                                                                                        {
                                                                                                                            "body": "Okay then, to each their own.",
                                                                                                                            "author": "cld8",
                                                                                                                            "id": "gr3h04l",
                                                                                                                            "parent_id": "t1_gr3g983",
                                                                                                                            "score": 1,
                                                                                                                            "created_utc": 1615874631.0,
                                                                                                                            "replies": []
                                                                                                                        }
                                                                                                                    ]
                                                                                                                }
                                                                                                            ]
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "I will save you heartache hun. It's called Seeking ... a what? That does not equal long term. If you just want to treat someone and don't want an arrangement = element of literal transaction, then Bumble IS a better place. You can find someone you want a long term with, and treat with extras.",
                                    "author": null,
                                    "id": "gr38az4",
                                    "parent_id": "t1_gr2jcuj",
                                    "score": 1,
                                    "created_utc": 1615867897.0,
                                    "replies": [
                                        {
                                            "body": ">  It's called Seeking ... a what\n\nActually - it's just called Seeking.  They dropped the arrangement a long time ago.  However - let me key you in on a more important tag line of Seeking:\n\n\"Relationship on your terms\".\n\nSeeking is a dating site.  It's NOT vanilla dating.  But it is a dating site.  \n\nI respect that there is a wide audience in sugaring - and there is not a one style fits all.  For example - I primarily prefer doing monthly allowance, not PPM.  Based on your post history - I\"m going to guess we are at other ends of the sugar spectrum.  That's fine, but that's also the context with which I write this.\n\n>  then Bumble IS a better place\n\nI've been using Seeking for well over 4 years now.  I've had a number of relationships, including several SGFs.",
                                            "author": "SDstartingOut",
                                            "id": "gr4109z",
                                            "parent_id": "t1_gr38az4",
                                            "score": 2,
                                            "created_utc": 1615894316.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "Yeah, when *a friend* told *her* dates and POTs *she* had kids, a minority of them started making very sexual pedophilic and incestuous comments out of the blue.\n\nIt's a balance between protecting oneself and one's family vs also establishing a foundation of sincerity and trust.\n\nBut on the outset, you do not owe anyone personal information that you don't feel comfortable to divulge and doesn't affect their lives (this is debatable). \n\nErr on the side of personal caution.",
                                    "author": "durtari",
                                    "id": "gr3i7ee",
                                    "parent_id": "t1_gr2jcuj",
                                    "score": 1,
                                    "created_utc": 1615875746.0,
                                    "replies": [
                                        {
                                            "body": "> a minority of them started making very sexual pedophilic and incestuous comments out of the blue.\n\nSounds like a bonus?  What I Mean here is - that should be an immediate GET THE FUCK OUT OF DODGE.  Why would you want to continue dating/seeing that person?",
                                            "author": "SDstartingOut",
                                            "id": "gr4172x",
                                            "parent_id": "t1_gr3i7ee",
                                            "score": 1,
                                            "created_utc": 1615894462.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Yeah, ngl, sometimes i hug his pillow bc I miss him lots lol",
            "author": "LaIndiaDeAzucar",
            "id": "gr32kov",
            "parent_id": "t1_gr309t7",
            "score": 2,
            "created_utc": 1615864365.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gr2z31p",
            "parent_id": "t1_gr2yr3j",
            "score": 2,
            "created_utc": 1615862447.0,
            "replies": []
        },
        {
            "body": "Dawwwww",
            "author": null,
            "id": "gr30bzl",
            "parent_id": "t1_gr2yr3j",
            "score": 2,
            "created_utc": 1615863120.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gr3yj7g",
            "parent_id": "t1_gr2yr3j",
            "score": 1,
            "created_utc": 1615892218.0,
            "replies": []
        },
        {
            "body": "Another great term to add to my sugar dictionary!",
            "author": "Gee_n_tonic",
            "id": "gr6i6dw",
            "parent_id": "t1_gr5fqmd",
            "score": 1,
            "created_utc": 1615937532.0,
            "replies": []
        },
        {
            "body": "Makes me miss my first SD. \nWe were only long distance and FTd often and text and pictures. Turns out he was still legally married, but separated and although I was fine with it, I guess he had a change of heart. \n\nWe had such a true, fun connection him and I.",
            "author": "ddknows",
            "id": "gr1pd52",
            "parent_id": "t1_gr1pbom",
            "score": 1,
            "created_utc": 1615836993.0,
            "replies": []
        },
        {
            "body": "Oh he blatantly lied then about the initial offer?  A lot of us want a legit sugar relationship where yes there is allowance but a lot of the best parts of normal dating as well.  I don’t think he should be lying like that, if he is a spoiling boyfriend where he buys stuff with no set allowance that is one thing but it sounds like he was offering sugar then trying to switch to vanilla dating right away?  If so that’s dishonest",
            "author": "pussy_impaler337",
            "id": "gr259r1",
            "parent_id": "t1_gr24z8e",
            "score": 6,
            "created_utc": 1615844520.0,
            "replies": [
                {
                    "body": "That was exactly it. Unfortunately. He was weird and quirky but I actually like that. Normal weirdos lol",
                    "author": "ddknows",
                    "id": "gr25hsk",
                    "parent_id": "t1_gr259r1",
                    "score": 3,
                    "created_utc": 1615844712.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "He was in Orlando, studios are nowhere near that",
            "author": null,
            "id": "gr3wnie",
            "parent_id": "t1_gr24z8e",
            "score": 1,
            "created_utc": 1615890489.0,
            "replies": []
        },
        {
            "body": "🤣",
            "author": "tattoosandtail",
            "id": "gr3skyr",
            "parent_id": "t1_gr38o5i",
            "score": 1,
            "created_utc": 1615886330.0,
            "replies": []
        },
        {
            "body": "I like that. Thank you for your input",
            "author": "ddknows",
            "id": "gr21cbo",
            "parent_id": "t1_gr1rhwt",
            "score": 8,
            "created_utc": 1615842300.0,
            "replies": [
                {
                    "body": "For what it's worth, I completely disagree on this.  But I also treat sugaring as a form of dating (not bumble, but it's still a form of dating).  I'm not married, and honesty is an important thing.  \n\nMy goal of any SR - is for it to \"grow\".  So I'm not interested in strictly NSA arrangements.  I'm also childfree.  So it's an incompatibility.  And I much prefer to know that up front.",
                    "author": "SDstartingOut",
                    "id": "gr2jcuj",
                    "parent_id": "t1_gr21cbo",
                    "score": 5,
                    "created_utc": 1615854047.0,
                    "replies": [
                        {
                            "body": "Yes but you also must understand that it's a parent's first responsibility to protect their children. I'm not the only person in my family or in my group of friends who suffered at the hands of \"mom's boyfriend.\" The horrible irony is the same happened to her as a kid with HER mom's boyfriends. Many people strive to avoid any chance of the same thing happening to their children. Protecting your children from an SD is absolutely 100% understandable and I would never ever trust a man who didn't agree with that absolutely without question. Children's safety comes before anything at all.",
                            "author": "ColdHeaux",
                            "id": "gr2mscw",
                            "parent_id": "t1_gr2jcuj",
                            "score": 15,
                            "created_utc": 1615855917.0,
                            "replies": [
                                {
                                    "body": "I don't understand the correlation.\n\nHow does admitting you have children, lead to suffering of the children?  If he wants to meet them?  Well, no.  Clearly, that's inappropriate.  And you should take that as a red flag and not even start a relationship with him.\n\nI don't think that little bit of honesty (relationship status, having children or not) is too much to ask for from a person you plan to engage on an intimate relationship with.",
                                    "author": "SDstartingOut",
                                    "id": "gr2sri4",
                                    "parent_id": "t1_gr2mscw",
                                    "score": -2,
                                    "created_utc": 1615859038.0,
                                    "replies": [
                                        {
                                            "body": "[deleted]",
                                            "author": null,
                                            "id": "gr2xz1h",
                                            "parent_id": "t1_gr2sri4",
                                            "score": 5,
                                            "created_utc": 1615861839.0,
                                            "replies": [
                                                {
                                                    "body": "Oh right ALSO that shit can come up in a custody battle-- another good reaosn to keep them seperate.",
                                                    "author": "ColdHeaux",
                                                    "id": "gr2yd2j",
                                                    "parent_id": "t1_gr2xz1h",
                                                    "score": 5,
                                                    "created_utc": 1615862057.0,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "body": "I mean, are you serious? You don't think there's any chance on earth a guy could.... follow her home and go after her kids lol? I'm not saying always conceal them forever obvi but yeah not everyone needs to know everything right away.",
                                            "author": "ColdHeaux",
                                            "id": "gr2y04t",
                                            "parent_id": "t1_gr2sri4",
                                            "score": 3,
                                            "created_utc": 1615861855.0,
                                            "replies": [
                                                {
                                                    "body": "> You don't think there's any chance on earth a guy could.... follow her home and go after her kids lol?\n\nSo could anyone else... does that mean she has to keep the existence of her kids a secret from the world?  \n\nI think you have a wild imagination.",
                                                    "author": "cld8",
                                                    "id": "gr3da8h",
                                                    "parent_id": "t1_gr2y04t",
                                                    "score": -2,
                                                    "created_utc": 1615871476.0,
                                                    "replies": [
                                                        {
                                                            "body": "Dude my own grandpa tried to kill my dad and aunt when they were kids lol, how unusual do you think this is? And yes, a man who is potentially seeking women who basically get paid for sex is higher suspect than the average man because sex workers are more vulnerable and police don't investigate our deaths as much so dangerous men sometimes target us first. So I would absolutely be cautious with a vanilla partner and even MORE with a sugar partner. Do I have a wild imagination or are you extremely naive to the dangers we face?",
                                                            "author": "ColdHeaux",
                                                            "id": "gr3dwm7",
                                                            "parent_id": "t1_gr3da8h",
                                                            "score": 3,
                                                            "created_utc": 1615871967.0,
                                                            "replies": [
                                                                {
                                                                    "body": "How is your grandpa trying to kill your dad and aunt relevant to this?  Was your grandpa a stranger who met them through a dating app?",
                                                                    "author": "cld8",
                                                                    "id": "gr3ek7c",
                                                                    "parent_id": "t1_gr3dwm7",
                                                                    "score": 1,
                                                                    "created_utc": 1615872505.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "The rest of my comment should have made that clear. Even men close to us can be a danger, so of course those who are seeking out women who get paid for sex can be an even bigger danger because that is a sociologically vulnerable group of women who can get targeted by dangerous men.",
                                                                            "author": "ColdHeaux",
                                                                            "id": "gr3eqjf",
                                                                            "parent_id": "t1_gr3ek7c",
                                                                            "score": 2,
                                                                            "created_utc": 1615872649.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "> so of course \n\nYou saying \"of course\" does not make something true.  The vast majority of abuse of children is done by men who are known to them, not by random strangers.  \n\nIf a man wanted to abuse a random kid, he would just go to a park, or a school, or wherever.  He's not going to meet a woman on a dating app and then say \"hey, let me follow her home and abuse her child\". This simply defies common sense.",
                                                                                    "author": "cld8",
                                                                                    "id": "gr3ezcw",
                                                                                    "parent_id": "t1_gr3eqjf",
                                                                                    "score": 1,
                                                                                    "created_utc": 1615872855.0,
                                                                                    "replies": [
                                                                                        {
                                                                                            "body": "If he meets the kids then he's not a random stranger anymore. But also, this may shock you to imagine, men can do those things to her kids knowing that she has less recourse than an average woman legally because he can use proof against her that she is selling sex. That stuff can absolutely get your kids taken away entirely. Like yea this is hypothetical but also some of us have been through similar situations or know sex workers who have. I can't count the number of women I knew in the strip club fighting custody battles with men who were previously ok with them stripping but used it as a weapon against them to get their kids. All of these things may seem far fetched but they suddenly become extremely precarious when you're facing down the real thing and examining all these possibilities with your own kids.   \n\n\nHonestly I cannot imagine willingly letting an SD meet any children of mine. I wouldn't even let them be in the house overnight with my boyfriend until LONG into the relationship. Too many of us have witnessed or experienced too much child abuse to write this stuff off as ridiculous. I guess you don't get that mothering instinct thing.",
                                                                                            "author": "ColdHeaux",
                                                                                            "id": "gr3fkw8",
                                                                                            "parent_id": "t1_gr3ezcw",
                                                                                            "score": 2,
                                                                                            "created_utc": 1615873367.0,
                                                                                            "replies": []
                                                                                        },
                                                                                        {
                                                                                            "body": "All of these dynamics and possibilities can suddenly become \"oh shit now it's too late\" WAY fast. Honestly if you were my SD I would ESPECIALLY not let you meet my kids because you seem willfully ignorant of what is dangerous to children and to women. You seem almost obstinately unable to acknowledge that and that would be a red flag for me.",
                                                                                            "author": "ColdHeaux",
                                                                                            "id": "gr3fn7c",
                                                                                            "parent_id": "t1_gr3ezcw",
                                                                                            "score": 2,
                                                                                            "created_utc": 1615873421.0,
                                                                                            "replies": []
                                                                                        },
                                                                                        {
                                                                                            "body": "\"Better safe than sorry\" applies 1000x more for your children.",
                                                                                            "author": "ColdHeaux",
                                                                                            "id": "gr3fo6p",
                                                                                            "parent_id": "t1_gr3ezcw",
                                                                                            "score": 2,
                                                                                            "created_utc": 1615873445.0,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "body": "If someone is that paranoid, then they shouldn't be on a dating site, they should remain locked up at home. \n\nI can tell you that if someone lies to me about having/not having kids, that would be an instant next.  Most guys I know would say the same.",
                                                                                                    "author": "cld8",
                                                                                                    "id": "gr3fsrw",
                                                                                                    "parent_id": "t1_gr3fo6p",
                                                                                                    "score": 1,
                                                                                                    "created_utc": 1615873556.0,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "body": "I'd be perfectly happy to lose a guy who doesn't care about actually doing the work of protecting children... Also if you've met as many people (men and women) who've been through horrific shit as children due to their parents not protecting them as I have, you'd feel the same way. No woman with kids protecting them from men will be upset to lose a SD or boyfriend who doesn't understand that their kids safety comes first before anyone's hurt feelings.",
                                                                                                            "author": "ColdHeaux",
                                                                                                            "id": "gr3g983",
                                                                                                            "parent_id": "t1_gr3fsrw",
                                                                                                            "score": 1,
                                                                                                            "created_utc": 1615873960.0,
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "body": "Okay then, to each their own.",
                                                                                                                    "author": "cld8",
                                                                                                                    "id": "gr3h04l",
                                                                                                                    "parent_id": "t1_gr3g983",
                                                                                                                    "score": 1,
                                                                                                                    "created_utc": 1615874631.0,
                                                                                                                    "replies": []
                                                                                                                }
                                                                                                            ]
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "I will save you heartache hun. It's called Seeking ... a what? That does not equal long term. If you just want to treat someone and don't want an arrangement = element of literal transaction, then Bumble IS a better place. You can find someone you want a long term with, and treat with extras.",
                            "author": null,
                            "id": "gr38az4",
                            "parent_id": "t1_gr2jcuj",
                            "score": 1,
                            "created_utc": 1615867897.0,
                            "replies": [
                                {
                                    "body": ">  It's called Seeking ... a what\n\nActually - it's just called Seeking.  They dropped the arrangement a long time ago.  However - let me key you in on a more important tag line of Seeking:\n\n\"Relationship on your terms\".\n\nSeeking is a dating site.  It's NOT vanilla dating.  But it is a dating site.  \n\nI respect that there is a wide audience in sugaring - and there is not a one style fits all.  For example - I primarily prefer doing monthly allowance, not PPM.  Based on your post history - I\"m going to guess we are at other ends of the sugar spectrum.  That's fine, but that's also the context with which I write this.\n\n>  then Bumble IS a better place\n\nI've been using Seeking for well over 4 years now.  I've had a number of relationships, including several SGFs.",
                                    "author": "SDstartingOut",
                                    "id": "gr4109z",
                                    "parent_id": "t1_gr38az4",
                                    "score": 2,
                                    "created_utc": 1615894316.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "Yeah, when *a friend* told *her* dates and POTs *she* had kids, a minority of them started making very sexual pedophilic and incestuous comments out of the blue.\n\nIt's a balance between protecting oneself and one's family vs also establishing a foundation of sincerity and trust.\n\nBut on the outset, you do not owe anyone personal information that you don't feel comfortable to divulge and doesn't affect their lives (this is debatable). \n\nErr on the side of personal caution.",
                            "author": "durtari",
                            "id": "gr3i7ee",
                            "parent_id": "t1_gr2jcuj",
                            "score": 1,
                            "created_utc": 1615875746.0,
                            "replies": [
                                {
                                    "body": "> a minority of them started making very sexual pedophilic and incestuous comments out of the blue.\n\nSounds like a bonus?  What I Mean here is - that should be an immediate GET THE FUCK OUT OF DODGE.  Why would you want to continue dating/seeing that person?",
                                    "author": "SDstartingOut",
                                    "id": "gr4172x",
                                    "parent_id": "t1_gr3i7ee",
                                    "score": 1,
                                    "created_utc": 1615894462.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "That was exactly it. Unfortunately. He was weird and quirky but I actually like that. Normal weirdos lol",
            "author": "ddknows",
            "id": "gr25hsk",
            "parent_id": "t1_gr259r1",
            "score": 3,
            "created_utc": 1615844712.0,
            "replies": []
        },
        {
            "body": "For what it's worth, I completely disagree on this.  But I also treat sugaring as a form of dating (not bumble, but it's still a form of dating).  I'm not married, and honesty is an important thing.  \n\nMy goal of any SR - is for it to \"grow\".  So I'm not interested in strictly NSA arrangements.  I'm also childfree.  So it's an incompatibility.  And I much prefer to know that up front.",
            "author": "SDstartingOut",
            "id": "gr2jcuj",
            "parent_id": "t1_gr21cbo",
            "score": 5,
            "created_utc": 1615854047.0,
            "replies": [
                {
                    "body": "Yes but you also must understand that it's a parent's first responsibility to protect their children. I'm not the only person in my family or in my group of friends who suffered at the hands of \"mom's boyfriend.\" The horrible irony is the same happened to her as a kid with HER mom's boyfriends. Many people strive to avoid any chance of the same thing happening to their children. Protecting your children from an SD is absolutely 100% understandable and I would never ever trust a man who didn't agree with that absolutely without question. Children's safety comes before anything at all.",
                    "author": "ColdHeaux",
                    "id": "gr2mscw",
                    "parent_id": "t1_gr2jcuj",
                    "score": 15,
                    "created_utc": 1615855917.0,
                    "replies": [
                        {
                            "body": "I don't understand the correlation.\n\nHow does admitting you have children, lead to suffering of the children?  If he wants to meet them?  Well, no.  Clearly, that's inappropriate.  And you should take that as a red flag and not even start a relationship with him.\n\nI don't think that little bit of honesty (relationship status, having children or not) is too much to ask for from a person you plan to engage on an intimate relationship with.",
                            "author": "SDstartingOut",
                            "id": "gr2sri4",
                            "parent_id": "t1_gr2mscw",
                            "score": -2,
                            "created_utc": 1615859038.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "gr2xz1h",
                                    "parent_id": "t1_gr2sri4",
                                    "score": 5,
                                    "created_utc": 1615861839.0,
                                    "replies": [
                                        {
                                            "body": "Oh right ALSO that shit can come up in a custody battle-- another good reaosn to keep them seperate.",
                                            "author": "ColdHeaux",
                                            "id": "gr2yd2j",
                                            "parent_id": "t1_gr2xz1h",
                                            "score": 5,
                                            "created_utc": 1615862057.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "I mean, are you serious? You don't think there's any chance on earth a guy could.... follow her home and go after her kids lol? I'm not saying always conceal them forever obvi but yeah not everyone needs to know everything right away.",
                                    "author": "ColdHeaux",
                                    "id": "gr2y04t",
                                    "parent_id": "t1_gr2sri4",
                                    "score": 3,
                                    "created_utc": 1615861855.0,
                                    "replies": [
                                        {
                                            "body": "> You don't think there's any chance on earth a guy could.... follow her home and go after her kids lol?\n\nSo could anyone else... does that mean she has to keep the existence of her kids a secret from the world?  \n\nI think you have a wild imagination.",
                                            "author": "cld8",
                                            "id": "gr3da8h",
                                            "parent_id": "t1_gr2y04t",
                                            "score": -2,
                                            "created_utc": 1615871476.0,
                                            "replies": [
                                                {
                                                    "body": "Dude my own grandpa tried to kill my dad and aunt when they were kids lol, how unusual do you think this is? And yes, a man who is potentially seeking women who basically get paid for sex is higher suspect than the average man because sex workers are more vulnerable and police don't investigate our deaths as much so dangerous men sometimes target us first. So I would absolutely be cautious with a vanilla partner and even MORE with a sugar partner. Do I have a wild imagination or are you extremely naive to the dangers we face?",
                                                    "author": "ColdHeaux",
                                                    "id": "gr3dwm7",
                                                    "parent_id": "t1_gr3da8h",
                                                    "score": 3,
                                                    "created_utc": 1615871967.0,
                                                    "replies": [
                                                        {
                                                            "body": "How is your grandpa trying to kill your dad and aunt relevant to this?  Was your grandpa a stranger who met them through a dating app?",
                                                            "author": "cld8",
                                                            "id": "gr3ek7c",
                                                            "parent_id": "t1_gr3dwm7",
                                                            "score": 1,
                                                            "created_utc": 1615872505.0,
                                                            "replies": [
                                                                {
                                                                    "body": "The rest of my comment should have made that clear. Even men close to us can be a danger, so of course those who are seeking out women who get paid for sex can be an even bigger danger because that is a sociologically vulnerable group of women who can get targeted by dangerous men.",
                                                                    "author": "ColdHeaux",
                                                                    "id": "gr3eqjf",
                                                                    "parent_id": "t1_gr3ek7c",
                                                                    "score": 2,
                                                                    "created_utc": 1615872649.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "> so of course \n\nYou saying \"of course\" does not make something true.  The vast majority of abuse of children is done by men who are known to them, not by random strangers.  \n\nIf a man wanted to abuse a random kid, he would just go to a park, or a school, or wherever.  He's not going to meet a woman on a dating app and then say \"hey, let me follow her home and abuse her child\". This simply defies common sense.",
                                                                            "author": "cld8",
                                                                            "id": "gr3ezcw",
                                                                            "parent_id": "t1_gr3eqjf",
                                                                            "score": 1,
                                                                            "created_utc": 1615872855.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "If he meets the kids then he's not a random stranger anymore. But also, this may shock you to imagine, men can do those things to her kids knowing that she has less recourse than an average woman legally because he can use proof against her that she is selling sex. That stuff can absolutely get your kids taken away entirely. Like yea this is hypothetical but also some of us have been through similar situations or know sex workers who have. I can't count the number of women I knew in the strip club fighting custody battles with men who were previously ok with them stripping but used it as a weapon against them to get their kids. All of these things may seem far fetched but they suddenly become extremely precarious when you're facing down the real thing and examining all these possibilities with your own kids.   \n\n\nHonestly I cannot imagine willingly letting an SD meet any children of mine. I wouldn't even let them be in the house overnight with my boyfriend until LONG into the relationship. Too many of us have witnessed or experienced too much child abuse to write this stuff off as ridiculous. I guess you don't get that mothering instinct thing.",
                                                                                    "author": "ColdHeaux",
                                                                                    "id": "gr3fkw8",
                                                                                    "parent_id": "t1_gr3ezcw",
                                                                                    "score": 2,
                                                                                    "created_utc": 1615873367.0,
                                                                                    "replies": []
                                                                                },
                                                                                {
                                                                                    "body": "All of these dynamics and possibilities can suddenly become \"oh shit now it's too late\" WAY fast. Honestly if you were my SD I would ESPECIALLY not let you meet my kids because you seem willfully ignorant of what is dangerous to children and to women. You seem almost obstinately unable to acknowledge that and that would be a red flag for me.",
                                                                                    "author": "ColdHeaux",
                                                                                    "id": "gr3fn7c",
                                                                                    "parent_id": "t1_gr3ezcw",
                                                                                    "score": 2,
                                                                                    "created_utc": 1615873421.0,
                                                                                    "replies": []
                                                                                },
                                                                                {
                                                                                    "body": "\"Better safe than sorry\" applies 1000x more for your children.",
                                                                                    "author": "ColdHeaux",
                                                                                    "id": "gr3fo6p",
                                                                                    "parent_id": "t1_gr3ezcw",
                                                                                    "score": 2,
                                                                                    "created_utc": 1615873445.0,
                                                                                    "replies": [
                                                                                        {
                                                                                            "body": "If someone is that paranoid, then they shouldn't be on a dating site, they should remain locked up at home. \n\nI can tell you that if someone lies to me about having/not having kids, that would be an instant next.  Most guys I know would say the same.",
                                                                                            "author": "cld8",
                                                                                            "id": "gr3fsrw",
                                                                                            "parent_id": "t1_gr3fo6p",
                                                                                            "score": 1,
                                                                                            "created_utc": 1615873556.0,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "body": "I'd be perfectly happy to lose a guy who doesn't care about actually doing the work of protecting children... Also if you've met as many people (men and women) who've been through horrific shit as children due to their parents not protecting them as I have, you'd feel the same way. No woman with kids protecting them from men will be upset to lose a SD or boyfriend who doesn't understand that their kids safety comes first before anyone's hurt feelings.",
                                                                                                    "author": "ColdHeaux",
                                                                                                    "id": "gr3g983",
                                                                                                    "parent_id": "t1_gr3fsrw",
                                                                                                    "score": 1,
                                                                                                    "created_utc": 1615873960.0,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "body": "Okay then, to each their own.",
                                                                                                            "author": "cld8",
                                                                                                            "id": "gr3h04l",
                                                                                                            "parent_id": "t1_gr3g983",
                                                                                                            "score": 1,
                                                                                                            "created_utc": 1615874631.0,
                                                                                                            "replies": []
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "I will save you heartache hun. It's called Seeking ... a what? That does not equal long term. If you just want to treat someone and don't want an arrangement = element of literal transaction, then Bumble IS a better place. You can find someone you want a long term with, and treat with extras.",
                    "author": null,
                    "id": "gr38az4",
                    "parent_id": "t1_gr2jcuj",
                    "score": 1,
                    "created_utc": 1615867897.0,
                    "replies": [
                        {
                            "body": ">  It's called Seeking ... a what\n\nActually - it's just called Seeking.  They dropped the arrangement a long time ago.  However - let me key you in on a more important tag line of Seeking:\n\n\"Relationship on your terms\".\n\nSeeking is a dating site.  It's NOT vanilla dating.  But it is a dating site.  \n\nI respect that there is a wide audience in sugaring - and there is not a one style fits all.  For example - I primarily prefer doing monthly allowance, not PPM.  Based on your post history - I\"m going to guess we are at other ends of the sugar spectrum.  That's fine, but that's also the context with which I write this.\n\n>  then Bumble IS a better place\n\nI've been using Seeking for well over 4 years now.  I've had a number of relationships, including several SGFs.",
                            "author": "SDstartingOut",
                            "id": "gr4109z",
                            "parent_id": "t1_gr38az4",
                            "score": 2,
                            "created_utc": 1615894316.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Yeah, when *a friend* told *her* dates and POTs *she* had kids, a minority of them started making very sexual pedophilic and incestuous comments out of the blue.\n\nIt's a balance between protecting oneself and one's family vs also establishing a foundation of sincerity and trust.\n\nBut on the outset, you do not owe anyone personal information that you don't feel comfortable to divulge and doesn't affect their lives (this is debatable). \n\nErr on the side of personal caution.",
                    "author": "durtari",
                    "id": "gr3i7ee",
                    "parent_id": "t1_gr2jcuj",
                    "score": 1,
                    "created_utc": 1615875746.0,
                    "replies": [
                        {
                            "body": "> a minority of them started making very sexual pedophilic and incestuous comments out of the blue.\n\nSounds like a bonus?  What I Mean here is - that should be an immediate GET THE FUCK OUT OF DODGE.  Why would you want to continue dating/seeing that person?",
                            "author": "SDstartingOut",
                            "id": "gr4172x",
                            "parent_id": "t1_gr3i7ee",
                            "score": 1,
                            "created_utc": 1615894462.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Yes but you also must understand that it's a parent's first responsibility to protect their children. I'm not the only person in my family or in my group of friends who suffered at the hands of \"mom's boyfriend.\" The horrible irony is the same happened to her as a kid with HER mom's boyfriends. Many people strive to avoid any chance of the same thing happening to their children. Protecting your children from an SD is absolutely 100% understandable and I would never ever trust a man who didn't agree with that absolutely without question. Children's safety comes before anything at all.",
            "author": "ColdHeaux",
            "id": "gr2mscw",
            "parent_id": "t1_gr2jcuj",
            "score": 15,
            "created_utc": 1615855917.0,
            "replies": [
                {
                    "body": "I don't understand the correlation.\n\nHow does admitting you have children, lead to suffering of the children?  If he wants to meet them?  Well, no.  Clearly, that's inappropriate.  And you should take that as a red flag and not even start a relationship with him.\n\nI don't think that little bit of honesty (relationship status, having children or not) is too much to ask for from a person you plan to engage on an intimate relationship with.",
                    "author": "SDstartingOut",
                    "id": "gr2sri4",
                    "parent_id": "t1_gr2mscw",
                    "score": -2,
                    "created_utc": 1615859038.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "gr2xz1h",
                            "parent_id": "t1_gr2sri4",
                            "score": 5,
                            "created_utc": 1615861839.0,
                            "replies": [
                                {
                                    "body": "Oh right ALSO that shit can come up in a custody battle-- another good reaosn to keep them seperate.",
                                    "author": "ColdHeaux",
                                    "id": "gr2yd2j",
                                    "parent_id": "t1_gr2xz1h",
                                    "score": 5,
                                    "created_utc": 1615862057.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "I mean, are you serious? You don't think there's any chance on earth a guy could.... follow her home and go after her kids lol? I'm not saying always conceal them forever obvi but yeah not everyone needs to know everything right away.",
                            "author": "ColdHeaux",
                            "id": "gr2y04t",
                            "parent_id": "t1_gr2sri4",
                            "score": 3,
                            "created_utc": 1615861855.0,
                            "replies": [
                                {
                                    "body": "> You don't think there's any chance on earth a guy could.... follow her home and go after her kids lol?\n\nSo could anyone else... does that mean she has to keep the existence of her kids a secret from the world?  \n\nI think you have a wild imagination.",
                                    "author": "cld8",
                                    "id": "gr3da8h",
                                    "parent_id": "t1_gr2y04t",
                                    "score": -2,
                                    "created_utc": 1615871476.0,
                                    "replies": [
                                        {
                                            "body": "Dude my own grandpa tried to kill my dad and aunt when they were kids lol, how unusual do you think this is? And yes, a man who is potentially seeking women who basically get paid for sex is higher suspect than the average man because sex workers are more vulnerable and police don't investigate our deaths as much so dangerous men sometimes target us first. So I would absolutely be cautious with a vanilla partner and even MORE with a sugar partner. Do I have a wild imagination or are you extremely naive to the dangers we face?",
                                            "author": "ColdHeaux",
                                            "id": "gr3dwm7",
                                            "parent_id": "t1_gr3da8h",
                                            "score": 3,
                                            "created_utc": 1615871967.0,
                                            "replies": [
                                                {
                                                    "body": "How is your grandpa trying to kill your dad and aunt relevant to this?  Was your grandpa a stranger who met them through a dating app?",
                                                    "author": "cld8",
                                                    "id": "gr3ek7c",
                                                    "parent_id": "t1_gr3dwm7",
                                                    "score": 1,
                                                    "created_utc": 1615872505.0,
                                                    "replies": [
                                                        {
                                                            "body": "The rest of my comment should have made that clear. Even men close to us can be a danger, so of course those who are seeking out women who get paid for sex can be an even bigger danger because that is a sociologically vulnerable group of women who can get targeted by dangerous men.",
                                                            "author": "ColdHeaux",
                                                            "id": "gr3eqjf",
                                                            "parent_id": "t1_gr3ek7c",
                                                            "score": 2,
                                                            "created_utc": 1615872649.0,
                                                            "replies": [
                                                                {
                                                                    "body": "> so of course \n\nYou saying \"of course\" does not make something true.  The vast majority of abuse of children is done by men who are known to them, not by random strangers.  \n\nIf a man wanted to abuse a random kid, he would just go to a park, or a school, or wherever.  He's not going to meet a woman on a dating app and then say \"hey, let me follow her home and abuse her child\". This simply defies common sense.",
                                                                    "author": "cld8",
                                                                    "id": "gr3ezcw",
                                                                    "parent_id": "t1_gr3eqjf",
                                                                    "score": 1,
                                                                    "created_utc": 1615872855.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "If he meets the kids then he's not a random stranger anymore. But also, this may shock you to imagine, men can do those things to her kids knowing that she has less recourse than an average woman legally because he can use proof against her that she is selling sex. That stuff can absolutely get your kids taken away entirely. Like yea this is hypothetical but also some of us have been through similar situations or know sex workers who have. I can't count the number of women I knew in the strip club fighting custody battles with men who were previously ok with them stripping but used it as a weapon against them to get their kids. All of these things may seem far fetched but they suddenly become extremely precarious when you're facing down the real thing and examining all these possibilities with your own kids.   \n\n\nHonestly I cannot imagine willingly letting an SD meet any children of mine. I wouldn't even let them be in the house overnight with my boyfriend until LONG into the relationship. Too many of us have witnessed or experienced too much child abuse to write this stuff off as ridiculous. I guess you don't get that mothering instinct thing.",
                                                                            "author": "ColdHeaux",
                                                                            "id": "gr3fkw8",
                                                                            "parent_id": "t1_gr3ezcw",
                                                                            "score": 2,
                                                                            "created_utc": 1615873367.0,
                                                                            "replies": []
                                                                        },
                                                                        {
                                                                            "body": "All of these dynamics and possibilities can suddenly become \"oh shit now it's too late\" WAY fast. Honestly if you were my SD I would ESPECIALLY not let you meet my kids because you seem willfully ignorant of what is dangerous to children and to women. You seem almost obstinately unable to acknowledge that and that would be a red flag for me.",
                                                                            "author": "ColdHeaux",
                                                                            "id": "gr3fn7c",
                                                                            "parent_id": "t1_gr3ezcw",
                                                                            "score": 2,
                                                                            "created_utc": 1615873421.0,
                                                                            "replies": []
                                                                        },
                                                                        {
                                                                            "body": "\"Better safe than sorry\" applies 1000x more for your children.",
                                                                            "author": "ColdHeaux",
                                                                            "id": "gr3fo6p",
                                                                            "parent_id": "t1_gr3ezcw",
                                                                            "score": 2,
                                                                            "created_utc": 1615873445.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "If someone is that paranoid, then they shouldn't be on a dating site, they should remain locked up at home. \n\nI can tell you that if someone lies to me about having/not having kids, that would be an instant next.  Most guys I know would say the same.",
                                                                                    "author": "cld8",
                                                                                    "id": "gr3fsrw",
                                                                                    "parent_id": "t1_gr3fo6p",
                                                                                    "score": 1,
                                                                                    "created_utc": 1615873556.0,
                                                                                    "replies": [
                                                                                        {
                                                                                            "body": "I'd be perfectly happy to lose a guy who doesn't care about actually doing the work of protecting children... Also if you've met as many people (men and women) who've been through horrific shit as children due to their parents not protecting them as I have, you'd feel the same way. No woman with kids protecting them from men will be upset to lose a SD or boyfriend who doesn't understand that their kids safety comes first before anyone's hurt feelings.",
                                                                                            "author": "ColdHeaux",
                                                                                            "id": "gr3g983",
                                                                                            "parent_id": "t1_gr3fsrw",
                                                                                            "score": 1,
                                                                                            "created_utc": 1615873960.0,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "body": "Okay then, to each their own.",
                                                                                                    "author": "cld8",
                                                                                                    "id": "gr3h04l",
                                                                                                    "parent_id": "t1_gr3g983",
                                                                                                    "score": 1,
                                                                                                    "created_utc": 1615874631.0,
                                                                                                    "replies": []
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I will save you heartache hun. It's called Seeking ... a what? That does not equal long term. If you just want to treat someone and don't want an arrangement = element of literal transaction, then Bumble IS a better place. You can find someone you want a long term with, and treat with extras.",
            "author": null,
            "id": "gr38az4",
            "parent_id": "t1_gr2jcuj",
            "score": 1,
            "created_utc": 1615867897.0,
            "replies": [
                {
                    "body": ">  It's called Seeking ... a what\n\nActually - it's just called Seeking.  They dropped the arrangement a long time ago.  However - let me key you in on a more important tag line of Seeking:\n\n\"Relationship on your terms\".\n\nSeeking is a dating site.  It's NOT vanilla dating.  But it is a dating site.  \n\nI respect that there is a wide audience in sugaring - and there is not a one style fits all.  For example - I primarily prefer doing monthly allowance, not PPM.  Based on your post history - I\"m going to guess we are at other ends of the sugar spectrum.  That's fine, but that's also the context with which I write this.\n\n>  then Bumble IS a better place\n\nI've been using Seeking for well over 4 years now.  I've had a number of relationships, including several SGFs.",
                    "author": "SDstartingOut",
                    "id": "gr4109z",
                    "parent_id": "t1_gr38az4",
                    "score": 2,
                    "created_utc": 1615894316.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Yeah, when *a friend* told *her* dates and POTs *she* had kids, a minority of them started making very sexual pedophilic and incestuous comments out of the blue.\n\nIt's a balance between protecting oneself and one's family vs also establishing a foundation of sincerity and trust.\n\nBut on the outset, you do not owe anyone personal information that you don't feel comfortable to divulge and doesn't affect their lives (this is debatable). \n\nErr on the side of personal caution.",
            "author": "durtari",
            "id": "gr3i7ee",
            "parent_id": "t1_gr2jcuj",
            "score": 1,
            "created_utc": 1615875746.0,
            "replies": [
                {
                    "body": "> a minority of them started making very sexual pedophilic and incestuous comments out of the blue.\n\nSounds like a bonus?  What I Mean here is - that should be an immediate GET THE FUCK OUT OF DODGE.  Why would you want to continue dating/seeing that person?",
                    "author": "SDstartingOut",
                    "id": "gr4172x",
                    "parent_id": "t1_gr3i7ee",
                    "score": 1,
                    "created_utc": 1615894462.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I don't understand the correlation.\n\nHow does admitting you have children, lead to suffering of the children?  If he wants to meet them?  Well, no.  Clearly, that's inappropriate.  And you should take that as a red flag and not even start a relationship with him.\n\nI don't think that little bit of honesty (relationship status, having children or not) is too much to ask for from a person you plan to engage on an intimate relationship with.",
            "author": "SDstartingOut",
            "id": "gr2sri4",
            "parent_id": "t1_gr2mscw",
            "score": -2,
            "created_utc": 1615859038.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "gr2xz1h",
                    "parent_id": "t1_gr2sri4",
                    "score": 5,
                    "created_utc": 1615861839.0,
                    "replies": [
                        {
                            "body": "Oh right ALSO that shit can come up in a custody battle-- another good reaosn to keep them seperate.",
                            "author": "ColdHeaux",
                            "id": "gr2yd2j",
                            "parent_id": "t1_gr2xz1h",
                            "score": 5,
                            "created_utc": 1615862057.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "I mean, are you serious? You don't think there's any chance on earth a guy could.... follow her home and go after her kids lol? I'm not saying always conceal them forever obvi but yeah not everyone needs to know everything right away.",
                    "author": "ColdHeaux",
                    "id": "gr2y04t",
                    "parent_id": "t1_gr2sri4",
                    "score": 3,
                    "created_utc": 1615861855.0,
                    "replies": [
                        {
                            "body": "> You don't think there's any chance on earth a guy could.... follow her home and go after her kids lol?\n\nSo could anyone else... does that mean she has to keep the existence of her kids a secret from the world?  \n\nI think you have a wild imagination.",
                            "author": "cld8",
                            "id": "gr3da8h",
                            "parent_id": "t1_gr2y04t",
                            "score": -2,
                            "created_utc": 1615871476.0,
                            "replies": [
                                {
                                    "body": "Dude my own grandpa tried to kill my dad and aunt when they were kids lol, how unusual do you think this is? And yes, a man who is potentially seeking women who basically get paid for sex is higher suspect than the average man because sex workers are more vulnerable and police don't investigate our deaths as much so dangerous men sometimes target us first. So I would absolutely be cautious with a vanilla partner and even MORE with a sugar partner. Do I have a wild imagination or are you extremely naive to the dangers we face?",
                                    "author": "ColdHeaux",
                                    "id": "gr3dwm7",
                                    "parent_id": "t1_gr3da8h",
                                    "score": 3,
                                    "created_utc": 1615871967.0,
                                    "replies": [
                                        {
                                            "body": "How is your grandpa trying to kill your dad and aunt relevant to this?  Was your grandpa a stranger who met them through a dating app?",
                                            "author": "cld8",
                                            "id": "gr3ek7c",
                                            "parent_id": "t1_gr3dwm7",
                                            "score": 1,
                                            "created_utc": 1615872505.0,
                                            "replies": [
                                                {
                                                    "body": "The rest of my comment should have made that clear. Even men close to us can be a danger, so of course those who are seeking out women who get paid for sex can be an even bigger danger because that is a sociologically vulnerable group of women who can get targeted by dangerous men.",
                                                    "author": "ColdHeaux",
                                                    "id": "gr3eqjf",
                                                    "parent_id": "t1_gr3ek7c",
                                                    "score": 2,
                                                    "created_utc": 1615872649.0,
                                                    "replies": [
                                                        {
                                                            "body": "> so of course \n\nYou saying \"of course\" does not make something true.  The vast majority of abuse of children is done by men who are known to them, not by random strangers.  \n\nIf a man wanted to abuse a random kid, he would just go to a park, or a school, or wherever.  He's not going to meet a woman on a dating app and then say \"hey, let me follow her home and abuse her child\". This simply defies common sense.",
                                                            "author": "cld8",
                                                            "id": "gr3ezcw",
                                                            "parent_id": "t1_gr3eqjf",
                                                            "score": 1,
                                                            "created_utc": 1615872855.0,
                                                            "replies": [
                                                                {
                                                                    "body": "If he meets the kids then he's not a random stranger anymore. But also, this may shock you to imagine, men can do those things to her kids knowing that she has less recourse than an average woman legally because he can use proof against her that she is selling sex. That stuff can absolutely get your kids taken away entirely. Like yea this is hypothetical but also some of us have been through similar situations or know sex workers who have. I can't count the number of women I knew in the strip club fighting custody battles with men who were previously ok with them stripping but used it as a weapon against them to get their kids. All of these things may seem far fetched but they suddenly become extremely precarious when you're facing down the real thing and examining all these possibilities with your own kids.   \n\n\nHonestly I cannot imagine willingly letting an SD meet any children of mine. I wouldn't even let them be in the house overnight with my boyfriend until LONG into the relationship. Too many of us have witnessed or experienced too much child abuse to write this stuff off as ridiculous. I guess you don't get that mothering instinct thing.",
                                                                    "author": "ColdHeaux",
                                                                    "id": "gr3fkw8",
                                                                    "parent_id": "t1_gr3ezcw",
                                                                    "score": 2,
                                                                    "created_utc": 1615873367.0,
                                                                    "replies": []
                                                                },
                                                                {
                                                                    "body": "All of these dynamics and possibilities can suddenly become \"oh shit now it's too late\" WAY fast. Honestly if you were my SD I would ESPECIALLY not let you meet my kids because you seem willfully ignorant of what is dangerous to children and to women. You seem almost obstinately unable to acknowledge that and that would be a red flag for me.",
                                                                    "author": "ColdHeaux",
                                                                    "id": "gr3fn7c",
                                                                    "parent_id": "t1_gr3ezcw",
                                                                    "score": 2,
                                                                    "created_utc": 1615873421.0,
                                                                    "replies": []
                                                                },
                                                                {
                                                                    "body": "\"Better safe than sorry\" applies 1000x more for your children.",
                                                                    "author": "ColdHeaux",
                                                                    "id": "gr3fo6p",
                                                                    "parent_id": "t1_gr3ezcw",
                                                                    "score": 2,
                                                                    "created_utc": 1615873445.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "If someone is that paranoid, then they shouldn't be on a dating site, they should remain locked up at home. \n\nI can tell you that if someone lies to me about having/not having kids, that would be an instant next.  Most guys I know would say the same.",
                                                                            "author": "cld8",
                                                                            "id": "gr3fsrw",
                                                                            "parent_id": "t1_gr3fo6p",
                                                                            "score": 1,
                                                                            "created_utc": 1615873556.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "I'd be perfectly happy to lose a guy who doesn't care about actually doing the work of protecting children... Also if you've met as many people (men and women) who've been through horrific shit as children due to their parents not protecting them as I have, you'd feel the same way. No woman with kids protecting them from men will be upset to lose a SD or boyfriend who doesn't understand that their kids safety comes first before anyone's hurt feelings.",
                                                                                    "author": "ColdHeaux",
                                                                                    "id": "gr3g983",
                                                                                    "parent_id": "t1_gr3fsrw",
                                                                                    "score": 1,
                                                                                    "created_utc": 1615873960.0,
                                                                                    "replies": [
                                                                                        {
                                                                                            "body": "Okay then, to each their own.",
                                                                                            "author": "cld8",
                                                                                            "id": "gr3h04l",
                                                                                            "parent_id": "t1_gr3g983",
                                                                                            "score": 1,
                                                                                            "created_utc": 1615874631.0,
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": ">  It's called Seeking ... a what\n\nActually - it's just called Seeking.  They dropped the arrangement a long time ago.  However - let me key you in on a more important tag line of Seeking:\n\n\"Relationship on your terms\".\n\nSeeking is a dating site.  It's NOT vanilla dating.  But it is a dating site.  \n\nI respect that there is a wide audience in sugaring - and there is not a one style fits all.  For example - I primarily prefer doing monthly allowance, not PPM.  Based on your post history - I\"m going to guess we are at other ends of the sugar spectrum.  That's fine, but that's also the context with which I write this.\n\n>  then Bumble IS a better place\n\nI've been using Seeking for well over 4 years now.  I've had a number of relationships, including several SGFs.",
            "author": "SDstartingOut",
            "id": "gr4109z",
            "parent_id": "t1_gr38az4",
            "score": 2,
            "created_utc": 1615894316.0,
            "replies": []
        },
        {
            "body": "> a minority of them started making very sexual pedophilic and incestuous comments out of the blue.\n\nSounds like a bonus?  What I Mean here is - that should be an immediate GET THE FUCK OUT OF DODGE.  Why would you want to continue dating/seeing that person?",
            "author": "SDstartingOut",
            "id": "gr4172x",
            "parent_id": "t1_gr3i7ee",
            "score": 1,
            "created_utc": 1615894462.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gr2xz1h",
            "parent_id": "t1_gr2sri4",
            "score": 5,
            "created_utc": 1615861839.0,
            "replies": [
                {
                    "body": "Oh right ALSO that shit can come up in a custody battle-- another good reaosn to keep them seperate.",
                    "author": "ColdHeaux",
                    "id": "gr2yd2j",
                    "parent_id": "t1_gr2xz1h",
                    "score": 5,
                    "created_utc": 1615862057.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I mean, are you serious? You don't think there's any chance on earth a guy could.... follow her home and go after her kids lol? I'm not saying always conceal them forever obvi but yeah not everyone needs to know everything right away.",
            "author": "ColdHeaux",
            "id": "gr2y04t",
            "parent_id": "t1_gr2sri4",
            "score": 3,
            "created_utc": 1615861855.0,
            "replies": [
                {
                    "body": "> You don't think there's any chance on earth a guy could.... follow her home and go after her kids lol?\n\nSo could anyone else... does that mean she has to keep the existence of her kids a secret from the world?  \n\nI think you have a wild imagination.",
                    "author": "cld8",
                    "id": "gr3da8h",
                    "parent_id": "t1_gr2y04t",
                    "score": -2,
                    "created_utc": 1615871476.0,
                    "replies": [
                        {
                            "body": "Dude my own grandpa tried to kill my dad and aunt when they were kids lol, how unusual do you think this is? And yes, a man who is potentially seeking women who basically get paid for sex is higher suspect than the average man because sex workers are more vulnerable and police don't investigate our deaths as much so dangerous men sometimes target us first. So I would absolutely be cautious with a vanilla partner and even MORE with a sugar partner. Do I have a wild imagination or are you extremely naive to the dangers we face?",
                            "author": "ColdHeaux",
                            "id": "gr3dwm7",
                            "parent_id": "t1_gr3da8h",
                            "score": 3,
                            "created_utc": 1615871967.0,
                            "replies": [
                                {
                                    "body": "How is your grandpa trying to kill your dad and aunt relevant to this?  Was your grandpa a stranger who met them through a dating app?",
                                    "author": "cld8",
                                    "id": "gr3ek7c",
                                    "parent_id": "t1_gr3dwm7",
                                    "score": 1,
                                    "created_utc": 1615872505.0,
                                    "replies": [
                                        {
                                            "body": "The rest of my comment should have made that clear. Even men close to us can be a danger, so of course those who are seeking out women who get paid for sex can be an even bigger danger because that is a sociologically vulnerable group of women who can get targeted by dangerous men.",
                                            "author": "ColdHeaux",
                                            "id": "gr3eqjf",
                                            "parent_id": "t1_gr3ek7c",
                                            "score": 2,
                                            "created_utc": 1615872649.0,
                                            "replies": [
                                                {
                                                    "body": "> so of course \n\nYou saying \"of course\" does not make something true.  The vast majority of abuse of children is done by men who are known to them, not by random strangers.  \n\nIf a man wanted to abuse a random kid, he would just go to a park, or a school, or wherever.  He's not going to meet a woman on a dating app and then say \"hey, let me follow her home and abuse her child\". This simply defies common sense.",
                                                    "author": "cld8",
                                                    "id": "gr3ezcw",
                                                    "parent_id": "t1_gr3eqjf",
                                                    "score": 1,
                                                    "created_utc": 1615872855.0,
                                                    "replies": [
                                                        {
                                                            "body": "If he meets the kids then he's not a random stranger anymore. But also, this may shock you to imagine, men can do those things to her kids knowing that she has less recourse than an average woman legally because he can use proof against her that she is selling sex. That stuff can absolutely get your kids taken away entirely. Like yea this is hypothetical but also some of us have been through similar situations or know sex workers who have. I can't count the number of women I knew in the strip club fighting custody battles with men who were previously ok with them stripping but used it as a weapon against them to get their kids. All of these things may seem far fetched but they suddenly become extremely precarious when you're facing down the real thing and examining all these possibilities with your own kids.   \n\n\nHonestly I cannot imagine willingly letting an SD meet any children of mine. I wouldn't even let them be in the house overnight with my boyfriend until LONG into the relationship. Too many of us have witnessed or experienced too much child abuse to write this stuff off as ridiculous. I guess you don't get that mothering instinct thing.",
                                                            "author": "ColdHeaux",
                                                            "id": "gr3fkw8",
                                                            "parent_id": "t1_gr3ezcw",
                                                            "score": 2,
                                                            "created_utc": 1615873367.0,
                                                            "replies": []
                                                        },
                                                        {
                                                            "body": "All of these dynamics and possibilities can suddenly become \"oh shit now it's too late\" WAY fast. Honestly if you were my SD I would ESPECIALLY not let you meet my kids because you seem willfully ignorant of what is dangerous to children and to women. You seem almost obstinately unable to acknowledge that and that would be a red flag for me.",
                                                            "author": "ColdHeaux",
                                                            "id": "gr3fn7c",
                                                            "parent_id": "t1_gr3ezcw",
                                                            "score": 2,
                                                            "created_utc": 1615873421.0,
                                                            "replies": []
                                                        },
                                                        {
                                                            "body": "\"Better safe than sorry\" applies 1000x more for your children.",
                                                            "author": "ColdHeaux",
                                                            "id": "gr3fo6p",
                                                            "parent_id": "t1_gr3ezcw",
                                                            "score": 2,
                                                            "created_utc": 1615873445.0,
                                                            "replies": [
                                                                {
                                                                    "body": "If someone is that paranoid, then they shouldn't be on a dating site, they should remain locked up at home. \n\nI can tell you that if someone lies to me about having/not having kids, that would be an instant next.  Most guys I know would say the same.",
                                                                    "author": "cld8",
                                                                    "id": "gr3fsrw",
                                                                    "parent_id": "t1_gr3fo6p",
                                                                    "score": 1,
                                                                    "created_utc": 1615873556.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "I'd be perfectly happy to lose a guy who doesn't care about actually doing the work of protecting children... Also if you've met as many people (men and women) who've been through horrific shit as children due to their parents not protecting them as I have, you'd feel the same way. No woman with kids protecting them from men will be upset to lose a SD or boyfriend who doesn't understand that their kids safety comes first before anyone's hurt feelings.",
                                                                            "author": "ColdHeaux",
                                                                            "id": "gr3g983",
                                                                            "parent_id": "t1_gr3fsrw",
                                                                            "score": 1,
                                                                            "created_utc": 1615873960.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "Okay then, to each their own.",
                                                                                    "author": "cld8",
                                                                                    "id": "gr3h04l",
                                                                                    "parent_id": "t1_gr3g983",
                                                                                    "score": 1,
                                                                                    "created_utc": 1615874631.0,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Oh right ALSO that shit can come up in a custody battle-- another good reaosn to keep them seperate.",
            "author": "ColdHeaux",
            "id": "gr2yd2j",
            "parent_id": "t1_gr2xz1h",
            "score": 5,
            "created_utc": 1615862057.0,
            "replies": []
        },
        {
            "body": "> You don't think there's any chance on earth a guy could.... follow her home and go after her kids lol?\n\nSo could anyone else... does that mean she has to keep the existence of her kids a secret from the world?  \n\nI think you have a wild imagination.",
            "author": "cld8",
            "id": "gr3da8h",
            "parent_id": "t1_gr2y04t",
            "score": -2,
            "created_utc": 1615871476.0,
            "replies": [
                {
                    "body": "Dude my own grandpa tried to kill my dad and aunt when they were kids lol, how unusual do you think this is? And yes, a man who is potentially seeking women who basically get paid for sex is higher suspect than the average man because sex workers are more vulnerable and police don't investigate our deaths as much so dangerous men sometimes target us first. So I would absolutely be cautious with a vanilla partner and even MORE with a sugar partner. Do I have a wild imagination or are you extremely naive to the dangers we face?",
                    "author": "ColdHeaux",
                    "id": "gr3dwm7",
                    "parent_id": "t1_gr3da8h",
                    "score": 3,
                    "created_utc": 1615871967.0,
                    "replies": [
                        {
                            "body": "How is your grandpa trying to kill your dad and aunt relevant to this?  Was your grandpa a stranger who met them through a dating app?",
                            "author": "cld8",
                            "id": "gr3ek7c",
                            "parent_id": "t1_gr3dwm7",
                            "score": 1,
                            "created_utc": 1615872505.0,
                            "replies": [
                                {
                                    "body": "The rest of my comment should have made that clear. Even men close to us can be a danger, so of course those who are seeking out women who get paid for sex can be an even bigger danger because that is a sociologically vulnerable group of women who can get targeted by dangerous men.",
                                    "author": "ColdHeaux",
                                    "id": "gr3eqjf",
                                    "parent_id": "t1_gr3ek7c",
                                    "score": 2,
                                    "created_utc": 1615872649.0,
                                    "replies": [
                                        {
                                            "body": "> so of course \n\nYou saying \"of course\" does not make something true.  The vast majority of abuse of children is done by men who are known to them, not by random strangers.  \n\nIf a man wanted to abuse a random kid, he would just go to a park, or a school, or wherever.  He's not going to meet a woman on a dating app and then say \"hey, let me follow her home and abuse her child\". This simply defies common sense.",
                                            "author": "cld8",
                                            "id": "gr3ezcw",
                                            "parent_id": "t1_gr3eqjf",
                                            "score": 1,
                                            "created_utc": 1615872855.0,
                                            "replies": [
                                                {
                                                    "body": "If he meets the kids then he's not a random stranger anymore. But also, this may shock you to imagine, men can do those things to her kids knowing that she has less recourse than an average woman legally because he can use proof against her that she is selling sex. That stuff can absolutely get your kids taken away entirely. Like yea this is hypothetical but also some of us have been through similar situations or know sex workers who have. I can't count the number of women I knew in the strip club fighting custody battles with men who were previously ok with them stripping but used it as a weapon against them to get their kids. All of these things may seem far fetched but they suddenly become extremely precarious when you're facing down the real thing and examining all these possibilities with your own kids.   \n\n\nHonestly I cannot imagine willingly letting an SD meet any children of mine. I wouldn't even let them be in the house overnight with my boyfriend until LONG into the relationship. Too many of us have witnessed or experienced too much child abuse to write this stuff off as ridiculous. I guess you don't get that mothering instinct thing.",
                                                    "author": "ColdHeaux",
                                                    "id": "gr3fkw8",
                                                    "parent_id": "t1_gr3ezcw",
                                                    "score": 2,
                                                    "created_utc": 1615873367.0,
                                                    "replies": []
                                                },
                                                {
                                                    "body": "All of these dynamics and possibilities can suddenly become \"oh shit now it's too late\" WAY fast. Honestly if you were my SD I would ESPECIALLY not let you meet my kids because you seem willfully ignorant of what is dangerous to children and to women. You seem almost obstinately unable to acknowledge that and that would be a red flag for me.",
                                                    "author": "ColdHeaux",
                                                    "id": "gr3fn7c",
                                                    "parent_id": "t1_gr3ezcw",
                                                    "score": 2,
                                                    "created_utc": 1615873421.0,
                                                    "replies": []
                                                },
                                                {
                                                    "body": "\"Better safe than sorry\" applies 1000x more for your children.",
                                                    "author": "ColdHeaux",
                                                    "id": "gr3fo6p",
                                                    "parent_id": "t1_gr3ezcw",
                                                    "score": 2,
                                                    "created_utc": 1615873445.0,
                                                    "replies": [
                                                        {
                                                            "body": "If someone is that paranoid, then they shouldn't be on a dating site, they should remain locked up at home. \n\nI can tell you that if someone lies to me about having/not having kids, that would be an instant next.  Most guys I know would say the same.",
                                                            "author": "cld8",
                                                            "id": "gr3fsrw",
                                                            "parent_id": "t1_gr3fo6p",
                                                            "score": 1,
                                                            "created_utc": 1615873556.0,
                                                            "replies": [
                                                                {
                                                                    "body": "I'd be perfectly happy to lose a guy who doesn't care about actually doing the work of protecting children... Also if you've met as many people (men and women) who've been through horrific shit as children due to their parents not protecting them as I have, you'd feel the same way. No woman with kids protecting them from men will be upset to lose a SD or boyfriend who doesn't understand that their kids safety comes first before anyone's hurt feelings.",
                                                                    "author": "ColdHeaux",
                                                                    "id": "gr3g983",
                                                                    "parent_id": "t1_gr3fsrw",
                                                                    "score": 1,
                                                                    "created_utc": 1615873960.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "Okay then, to each their own.",
                                                                            "author": "cld8",
                                                                            "id": "gr3h04l",
                                                                            "parent_id": "t1_gr3g983",
                                                                            "score": 1,
                                                                            "created_utc": 1615874631.0,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Dude my own grandpa tried to kill my dad and aunt when they were kids lol, how unusual do you think this is? And yes, a man who is potentially seeking women who basically get paid for sex is higher suspect than the average man because sex workers are more vulnerable and police don't investigate our deaths as much so dangerous men sometimes target us first. So I would absolutely be cautious with a vanilla partner and even MORE with a sugar partner. Do I have a wild imagination or are you extremely naive to the dangers we face?",
            "author": "ColdHeaux",
            "id": "gr3dwm7",
            "parent_id": "t1_gr3da8h",
            "score": 3,
            "created_utc": 1615871967.0,
            "replies": [
                {
                    "body": "How is your grandpa trying to kill your dad and aunt relevant to this?  Was your grandpa a stranger who met them through a dating app?",
                    "author": "cld8",
                    "id": "gr3ek7c",
                    "parent_id": "t1_gr3dwm7",
                    "score": 1,
                    "created_utc": 1615872505.0,
                    "replies": [
                        {
                            "body": "The rest of my comment should have made that clear. Even men close to us can be a danger, so of course those who are seeking out women who get paid for sex can be an even bigger danger because that is a sociologically vulnerable group of women who can get targeted by dangerous men.",
                            "author": "ColdHeaux",
                            "id": "gr3eqjf",
                            "parent_id": "t1_gr3ek7c",
                            "score": 2,
                            "created_utc": 1615872649.0,
                            "replies": [
                                {
                                    "body": "> so of course \n\nYou saying \"of course\" does not make something true.  The vast majority of abuse of children is done by men who are known to them, not by random strangers.  \n\nIf a man wanted to abuse a random kid, he would just go to a park, or a school, or wherever.  He's not going to meet a woman on a dating app and then say \"hey, let me follow her home and abuse her child\". This simply defies common sense.",
                                    "author": "cld8",
                                    "id": "gr3ezcw",
                                    "parent_id": "t1_gr3eqjf",
                                    "score": 1,
                                    "created_utc": 1615872855.0,
                                    "replies": [
                                        {
                                            "body": "If he meets the kids then he's not a random stranger anymore. But also, this may shock you to imagine, men can do those things to her kids knowing that she has less recourse than an average woman legally because he can use proof against her that she is selling sex. That stuff can absolutely get your kids taken away entirely. Like yea this is hypothetical but also some of us have been through similar situations or know sex workers who have. I can't count the number of women I knew in the strip club fighting custody battles with men who were previously ok with them stripping but used it as a weapon against them to get their kids. All of these things may seem far fetched but they suddenly become extremely precarious when you're facing down the real thing and examining all these possibilities with your own kids.   \n\n\nHonestly I cannot imagine willingly letting an SD meet any children of mine. I wouldn't even let them be in the house overnight with my boyfriend until LONG into the relationship. Too many of us have witnessed or experienced too much child abuse to write this stuff off as ridiculous. I guess you don't get that mothering instinct thing.",
                                            "author": "ColdHeaux",
                                            "id": "gr3fkw8",
                                            "parent_id": "t1_gr3ezcw",
                                            "score": 2,
                                            "created_utc": 1615873367.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "All of these dynamics and possibilities can suddenly become \"oh shit now it's too late\" WAY fast. Honestly if you were my SD I would ESPECIALLY not let you meet my kids because you seem willfully ignorant of what is dangerous to children and to women. You seem almost obstinately unable to acknowledge that and that would be a red flag for me.",
                                            "author": "ColdHeaux",
                                            "id": "gr3fn7c",
                                            "parent_id": "t1_gr3ezcw",
                                            "score": 2,
                                            "created_utc": 1615873421.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "\"Better safe than sorry\" applies 1000x more for your children.",
                                            "author": "ColdHeaux",
                                            "id": "gr3fo6p",
                                            "parent_id": "t1_gr3ezcw",
                                            "score": 2,
                                            "created_utc": 1615873445.0,
                                            "replies": [
                                                {
                                                    "body": "If someone is that paranoid, then they shouldn't be on a dating site, they should remain locked up at home. \n\nI can tell you that if someone lies to me about having/not having kids, that would be an instant next.  Most guys I know would say the same.",
                                                    "author": "cld8",
                                                    "id": "gr3fsrw",
                                                    "parent_id": "t1_gr3fo6p",
                                                    "score": 1,
                                                    "created_utc": 1615873556.0,
                                                    "replies": [
                                                        {
                                                            "body": "I'd be perfectly happy to lose a guy who doesn't care about actually doing the work of protecting children... Also if you've met as many people (men and women) who've been through horrific shit as children due to their parents not protecting them as I have, you'd feel the same way. No woman with kids protecting them from men will be upset to lose a SD or boyfriend who doesn't understand that their kids safety comes first before anyone's hurt feelings.",
                                                            "author": "ColdHeaux",
                                                            "id": "gr3g983",
                                                            "parent_id": "t1_gr3fsrw",
                                                            "score": 1,
                                                            "created_utc": 1615873960.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Okay then, to each their own.",
                                                                    "author": "cld8",
                                                                    "id": "gr3h04l",
                                                                    "parent_id": "t1_gr3g983",
                                                                    "score": 1,
                                                                    "created_utc": 1615874631.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "How is your grandpa trying to kill your dad and aunt relevant to this?  Was your grandpa a stranger who met them through a dating app?",
            "author": "cld8",
            "id": "gr3ek7c",
            "parent_id": "t1_gr3dwm7",
            "score": 1,
            "created_utc": 1615872505.0,
            "replies": [
                {
                    "body": "The rest of my comment should have made that clear. Even men close to us can be a danger, so of course those who are seeking out women who get paid for sex can be an even bigger danger because that is a sociologically vulnerable group of women who can get targeted by dangerous men.",
                    "author": "ColdHeaux",
                    "id": "gr3eqjf",
                    "parent_id": "t1_gr3ek7c",
                    "score": 2,
                    "created_utc": 1615872649.0,
                    "replies": [
                        {
                            "body": "> so of course \n\nYou saying \"of course\" does not make something true.  The vast majority of abuse of children is done by men who are known to them, not by random strangers.  \n\nIf a man wanted to abuse a random kid, he would just go to a park, or a school, or wherever.  He's not going to meet a woman on a dating app and then say \"hey, let me follow her home and abuse her child\". This simply defies common sense.",
                            "author": "cld8",
                            "id": "gr3ezcw",
                            "parent_id": "t1_gr3eqjf",
                            "score": 1,
                            "created_utc": 1615872855.0,
                            "replies": [
                                {
                                    "body": "If he meets the kids then he's not a random stranger anymore. But also, this may shock you to imagine, men can do those things to her kids knowing that she has less recourse than an average woman legally because he can use proof against her that she is selling sex. That stuff can absolutely get your kids taken away entirely. Like yea this is hypothetical but also some of us have been through similar situations or know sex workers who have. I can't count the number of women I knew in the strip club fighting custody battles with men who were previously ok with them stripping but used it as a weapon against them to get their kids. All of these things may seem far fetched but they suddenly become extremely precarious when you're facing down the real thing and examining all these possibilities with your own kids.   \n\n\nHonestly I cannot imagine willingly letting an SD meet any children of mine. I wouldn't even let them be in the house overnight with my boyfriend until LONG into the relationship. Too many of us have witnessed or experienced too much child abuse to write this stuff off as ridiculous. I guess you don't get that mothering instinct thing.",
                                    "author": "ColdHeaux",
                                    "id": "gr3fkw8",
                                    "parent_id": "t1_gr3ezcw",
                                    "score": 2,
                                    "created_utc": 1615873367.0,
                                    "replies": []
                                },
                                {
                                    "body": "All of these dynamics and possibilities can suddenly become \"oh shit now it's too late\" WAY fast. Honestly if you were my SD I would ESPECIALLY not let you meet my kids because you seem willfully ignorant of what is dangerous to children and to women. You seem almost obstinately unable to acknowledge that and that would be a red flag for me.",
                                    "author": "ColdHeaux",
                                    "id": "gr3fn7c",
                                    "parent_id": "t1_gr3ezcw",
                                    "score": 2,
                                    "created_utc": 1615873421.0,
                                    "replies": []
                                },
                                {
                                    "body": "\"Better safe than sorry\" applies 1000x more for your children.",
                                    "author": "ColdHeaux",
                                    "id": "gr3fo6p",
                                    "parent_id": "t1_gr3ezcw",
                                    "score": 2,
                                    "created_utc": 1615873445.0,
                                    "replies": [
                                        {
                                            "body": "If someone is that paranoid, then they shouldn't be on a dating site, they should remain locked up at home. \n\nI can tell you that if someone lies to me about having/not having kids, that would be an instant next.  Most guys I know would say the same.",
                                            "author": "cld8",
                                            "id": "gr3fsrw",
                                            "parent_id": "t1_gr3fo6p",
                                            "score": 1,
                                            "created_utc": 1615873556.0,
                                            "replies": [
                                                {
                                                    "body": "I'd be perfectly happy to lose a guy who doesn't care about actually doing the work of protecting children... Also if you've met as many people (men and women) who've been through horrific shit as children due to their parents not protecting them as I have, you'd feel the same way. No woman with kids protecting them from men will be upset to lose a SD or boyfriend who doesn't understand that their kids safety comes first before anyone's hurt feelings.",
                                                    "author": "ColdHeaux",
                                                    "id": "gr3g983",
                                                    "parent_id": "t1_gr3fsrw",
                                                    "score": 1,
                                                    "created_utc": 1615873960.0,
                                                    "replies": [
                                                        {
                                                            "body": "Okay then, to each their own.",
                                                            "author": "cld8",
                                                            "id": "gr3h04l",
                                                            "parent_id": "t1_gr3g983",
                                                            "score": 1,
                                                            "created_utc": 1615874631.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "The rest of my comment should have made that clear. Even men close to us can be a danger, so of course those who are seeking out women who get paid for sex can be an even bigger danger because that is a sociologically vulnerable group of women who can get targeted by dangerous men.",
            "author": "ColdHeaux",
            "id": "gr3eqjf",
            "parent_id": "t1_gr3ek7c",
            "score": 2,
            "created_utc": 1615872649.0,
            "replies": [
                {
                    "body": "> so of course \n\nYou saying \"of course\" does not make something true.  The vast majority of abuse of children is done by men who are known to them, not by random strangers.  \n\nIf a man wanted to abuse a random kid, he would just go to a park, or a school, or wherever.  He's not going to meet a woman on a dating app and then say \"hey, let me follow her home and abuse her child\". This simply defies common sense.",
                    "author": "cld8",
                    "id": "gr3ezcw",
                    "parent_id": "t1_gr3eqjf",
                    "score": 1,
                    "created_utc": 1615872855.0,
                    "replies": [
                        {
                            "body": "If he meets the kids then he's not a random stranger anymore. But also, this may shock you to imagine, men can do those things to her kids knowing that she has less recourse than an average woman legally because he can use proof against her that she is selling sex. That stuff can absolutely get your kids taken away entirely. Like yea this is hypothetical but also some of us have been through similar situations or know sex workers who have. I can't count the number of women I knew in the strip club fighting custody battles with men who were previously ok with them stripping but used it as a weapon against them to get their kids. All of these things may seem far fetched but they suddenly become extremely precarious when you're facing down the real thing and examining all these possibilities with your own kids.   \n\n\nHonestly I cannot imagine willingly letting an SD meet any children of mine. I wouldn't even let them be in the house overnight with my boyfriend until LONG into the relationship. Too many of us have witnessed or experienced too much child abuse to write this stuff off as ridiculous. I guess you don't get that mothering instinct thing.",
                            "author": "ColdHeaux",
                            "id": "gr3fkw8",
                            "parent_id": "t1_gr3ezcw",
                            "score": 2,
                            "created_utc": 1615873367.0,
                            "replies": []
                        },
                        {
                            "body": "All of these dynamics and possibilities can suddenly become \"oh shit now it's too late\" WAY fast. Honestly if you were my SD I would ESPECIALLY not let you meet my kids because you seem willfully ignorant of what is dangerous to children and to women. You seem almost obstinately unable to acknowledge that and that would be a red flag for me.",
                            "author": "ColdHeaux",
                            "id": "gr3fn7c",
                            "parent_id": "t1_gr3ezcw",
                            "score": 2,
                            "created_utc": 1615873421.0,
                            "replies": []
                        },
                        {
                            "body": "\"Better safe than sorry\" applies 1000x more for your children.",
                            "author": "ColdHeaux",
                            "id": "gr3fo6p",
                            "parent_id": "t1_gr3ezcw",
                            "score": 2,
                            "created_utc": 1615873445.0,
                            "replies": [
                                {
                                    "body": "If someone is that paranoid, then they shouldn't be on a dating site, they should remain locked up at home. \n\nI can tell you that if someone lies to me about having/not having kids, that would be an instant next.  Most guys I know would say the same.",
                                    "author": "cld8",
                                    "id": "gr3fsrw",
                                    "parent_id": "t1_gr3fo6p",
                                    "score": 1,
                                    "created_utc": 1615873556.0,
                                    "replies": [
                                        {
                                            "body": "I'd be perfectly happy to lose a guy who doesn't care about actually doing the work of protecting children... Also if you've met as many people (men and women) who've been through horrific shit as children due to their parents not protecting them as I have, you'd feel the same way. No woman with kids protecting them from men will be upset to lose a SD or boyfriend who doesn't understand that their kids safety comes first before anyone's hurt feelings.",
                                            "author": "ColdHeaux",
                                            "id": "gr3g983",
                                            "parent_id": "t1_gr3fsrw",
                                            "score": 1,
                                            "created_utc": 1615873960.0,
                                            "replies": [
                                                {
                                                    "body": "Okay then, to each their own.",
                                                    "author": "cld8",
                                                    "id": "gr3h04l",
                                                    "parent_id": "t1_gr3g983",
                                                    "score": 1,
                                                    "created_utc": 1615874631.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "> so of course \n\nYou saying \"of course\" does not make something true.  The vast majority of abuse of children is done by men who are known to them, not by random strangers.  \n\nIf a man wanted to abuse a random kid, he would just go to a park, or a school, or wherever.  He's not going to meet a woman on a dating app and then say \"hey, let me follow her home and abuse her child\". This simply defies common sense.",
            "author": "cld8",
            "id": "gr3ezcw",
            "parent_id": "t1_gr3eqjf",
            "score": 1,
            "created_utc": 1615872855.0,
            "replies": [
                {
                    "body": "If he meets the kids then he's not a random stranger anymore. But also, this may shock you to imagine, men can do those things to her kids knowing that she has less recourse than an average woman legally because he can use proof against her that she is selling sex. That stuff can absolutely get your kids taken away entirely. Like yea this is hypothetical but also some of us have been through similar situations or know sex workers who have. I can't count the number of women I knew in the strip club fighting custody battles with men who were previously ok with them stripping but used it as a weapon against them to get their kids. All of these things may seem far fetched but they suddenly become extremely precarious when you're facing down the real thing and examining all these possibilities with your own kids.   \n\n\nHonestly I cannot imagine willingly letting an SD meet any children of mine. I wouldn't even let them be in the house overnight with my boyfriend until LONG into the relationship. Too many of us have witnessed or experienced too much child abuse to write this stuff off as ridiculous. I guess you don't get that mothering instinct thing.",
                    "author": "ColdHeaux",
                    "id": "gr3fkw8",
                    "parent_id": "t1_gr3ezcw",
                    "score": 2,
                    "created_utc": 1615873367.0,
                    "replies": []
                },
                {
                    "body": "All of these dynamics and possibilities can suddenly become \"oh shit now it's too late\" WAY fast. Honestly if you were my SD I would ESPECIALLY not let you meet my kids because you seem willfully ignorant of what is dangerous to children and to women. You seem almost obstinately unable to acknowledge that and that would be a red flag for me.",
                    "author": "ColdHeaux",
                    "id": "gr3fn7c",
                    "parent_id": "t1_gr3ezcw",
                    "score": 2,
                    "created_utc": 1615873421.0,
                    "replies": []
                },
                {
                    "body": "\"Better safe than sorry\" applies 1000x more for your children.",
                    "author": "ColdHeaux",
                    "id": "gr3fo6p",
                    "parent_id": "t1_gr3ezcw",
                    "score": 2,
                    "created_utc": 1615873445.0,
                    "replies": [
                        {
                            "body": "If someone is that paranoid, then they shouldn't be on a dating site, they should remain locked up at home. \n\nI can tell you that if someone lies to me about having/not having kids, that would be an instant next.  Most guys I know would say the same.",
                            "author": "cld8",
                            "id": "gr3fsrw",
                            "parent_id": "t1_gr3fo6p",
                            "score": 1,
                            "created_utc": 1615873556.0,
                            "replies": [
                                {
                                    "body": "I'd be perfectly happy to lose a guy who doesn't care about actually doing the work of protecting children... Also if you've met as many people (men and women) who've been through horrific shit as children due to their parents not protecting them as I have, you'd feel the same way. No woman with kids protecting them from men will be upset to lose a SD or boyfriend who doesn't understand that their kids safety comes first before anyone's hurt feelings.",
                                    "author": "ColdHeaux",
                                    "id": "gr3g983",
                                    "parent_id": "t1_gr3fsrw",
                                    "score": 1,
                                    "created_utc": 1615873960.0,
                                    "replies": [
                                        {
                                            "body": "Okay then, to each their own.",
                                            "author": "cld8",
                                            "id": "gr3h04l",
                                            "parent_id": "t1_gr3g983",
                                            "score": 1,
                                            "created_utc": 1615874631.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "If he meets the kids then he's not a random stranger anymore. But also, this may shock you to imagine, men can do those things to her kids knowing that she has less recourse than an average woman legally because he can use proof against her that she is selling sex. That stuff can absolutely get your kids taken away entirely. Like yea this is hypothetical but also some of us have been through similar situations or know sex workers who have. I can't count the number of women I knew in the strip club fighting custody battles with men who were previously ok with them stripping but used it as a weapon against them to get their kids. All of these things may seem far fetched but they suddenly become extremely precarious when you're facing down the real thing and examining all these possibilities with your own kids.   \n\n\nHonestly I cannot imagine willingly letting an SD meet any children of mine. I wouldn't even let them be in the house overnight with my boyfriend until LONG into the relationship. Too many of us have witnessed or experienced too much child abuse to write this stuff off as ridiculous. I guess you don't get that mothering instinct thing.",
            "author": "ColdHeaux",
            "id": "gr3fkw8",
            "parent_id": "t1_gr3ezcw",
            "score": 2,
            "created_utc": 1615873367.0,
            "replies": []
        },
        {
            "body": "All of these dynamics and possibilities can suddenly become \"oh shit now it's too late\" WAY fast. Honestly if you were my SD I would ESPECIALLY not let you meet my kids because you seem willfully ignorant of what is dangerous to children and to women. You seem almost obstinately unable to acknowledge that and that would be a red flag for me.",
            "author": "ColdHeaux",
            "id": "gr3fn7c",
            "parent_id": "t1_gr3ezcw",
            "score": 2,
            "created_utc": 1615873421.0,
            "replies": []
        },
        {
            "body": "\"Better safe than sorry\" applies 1000x more for your children.",
            "author": "ColdHeaux",
            "id": "gr3fo6p",
            "parent_id": "t1_gr3ezcw",
            "score": 2,
            "created_utc": 1615873445.0,
            "replies": [
                {
                    "body": "If someone is that paranoid, then they shouldn't be on a dating site, they should remain locked up at home. \n\nI can tell you that if someone lies to me about having/not having kids, that would be an instant next.  Most guys I know would say the same.",
                    "author": "cld8",
                    "id": "gr3fsrw",
                    "parent_id": "t1_gr3fo6p",
                    "score": 1,
                    "created_utc": 1615873556.0,
                    "replies": [
                        {
                            "body": "I'd be perfectly happy to lose a guy who doesn't care about actually doing the work of protecting children... Also if you've met as many people (men and women) who've been through horrific shit as children due to their parents not protecting them as I have, you'd feel the same way. No woman with kids protecting them from men will be upset to lose a SD or boyfriend who doesn't understand that their kids safety comes first before anyone's hurt feelings.",
                            "author": "ColdHeaux",
                            "id": "gr3g983",
                            "parent_id": "t1_gr3fsrw",
                            "score": 1,
                            "created_utc": 1615873960.0,
                            "replies": [
                                {
                                    "body": "Okay then, to each their own.",
                                    "author": "cld8",
                                    "id": "gr3h04l",
                                    "parent_id": "t1_gr3g983",
                                    "score": 1,
                                    "created_utc": 1615874631.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "If someone is that paranoid, then they shouldn't be on a dating site, they should remain locked up at home. \n\nI can tell you that if someone lies to me about having/not having kids, that would be an instant next.  Most guys I know would say the same.",
            "author": "cld8",
            "id": "gr3fsrw",
            "parent_id": "t1_gr3fo6p",
            "score": 1,
            "created_utc": 1615873556.0,
            "replies": [
                {
                    "body": "I'd be perfectly happy to lose a guy who doesn't care about actually doing the work of protecting children... Also if you've met as many people (men and women) who've been through horrific shit as children due to their parents not protecting them as I have, you'd feel the same way. No woman with kids protecting them from men will be upset to lose a SD or boyfriend who doesn't understand that their kids safety comes first before anyone's hurt feelings.",
                    "author": "ColdHeaux",
                    "id": "gr3g983",
                    "parent_id": "t1_gr3fsrw",
                    "score": 1,
                    "created_utc": 1615873960.0,
                    "replies": [
                        {
                            "body": "Okay then, to each their own.",
                            "author": "cld8",
                            "id": "gr3h04l",
                            "parent_id": "t1_gr3g983",
                            "score": 1,
                            "created_utc": 1615874631.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I'd be perfectly happy to lose a guy who doesn't care about actually doing the work of protecting children... Also if you've met as many people (men and women) who've been through horrific shit as children due to their parents not protecting them as I have, you'd feel the same way. No woman with kids protecting them from men will be upset to lose a SD or boyfriend who doesn't understand that their kids safety comes first before anyone's hurt feelings.",
            "author": "ColdHeaux",
            "id": "gr3g983",
            "parent_id": "t1_gr3fsrw",
            "score": 1,
            "created_utc": 1615873960.0,
            "replies": [
                {
                    "body": "Okay then, to each their own.",
                    "author": "cld8",
                    "id": "gr3h04l",
                    "parent_id": "t1_gr3g983",
                    "score": 1,
                    "created_utc": 1615874631.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Okay then, to each their own.",
            "author": "cld8",
            "id": "gr3h04l",
            "parent_id": "t1_gr3g983",
            "score": 1,
            "created_utc": 1615874631.0,
            "replies": []
        }
    ]
}