{
    "title": "A lot of \"What should I do if my SB /SD Says or does this...\" type of Posts can easily be answered with \"You are adults, have a Conversation.\"",
    "post_id": "mc7l5y",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/mc7l5y/a_lot_of_what_should_i_do_if_my_sb_sd_says_or/",
    "author": "BigBearSD",
    "body": "We see various posts daily  where OP asks us \"what if...\", \"How should I handle...\", \"He / she said this, what should I do...\" etc... and everyone and their brother  comes and gives there advice and some pontificate and others debate. The easiest answer is usually \"Just talk to them.\" No two situations are identical, no two SRs are the same. You are an adult, and should be able to speak up for yourself and talk with your partner/ POT. If you dont like something just talk with them. If you are confused, just talk with them. We here at SLF all have different opinions, and thus potentially different answers. We are not you, nor your partner /pot, we don't know every minuscule detail, we are not psychic. Just have a conversation. You may not like the answer your partner gives, but it beats not knowing. \n\nGood luck, and just talk to eachother.",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/mc7l5y/a_lot_of_what_should_i_do_if_my_sb_sd_says_or/",
    "score": 132,
    "upvote_ratio": 0.82,
    "created_utc": 1616597296.0,
    "num_comments": 72,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "Why do you do your weekly \"Monday Mental Health\" thread? Why not just put \"Talk to your therapist\" from next time onwards. Yes we all are adults but these relationships are inherently not balanced especially from SB's perspective.  The other analogy would be boss-employee relationship, its not easy to go ask for a raise or point out something your boss is doing wrong even more so for girls who have been conditioned for years to not question the person in authority. You of all people should know when you were new here and in a shitty relationship, everyone told you break it off and move on but you didn't -- I guess having a conversation like an adult doesn't work all the time.",
            "author": null,
            "id": "gs2dl16",
            "parent_id": "t3_mc7l5y",
            "score": 61,
            "created_utc": 1616603726.0,
            "replies": [
                {
                    "body": "I don’t know the OP’s past but if what you say is true, then you make a good point.",
                    "author": "uniballSD",
                    "id": "gs2kfi9",
                    "parent_id": "t1_gs2dl16",
                    "score": 5,
                    "created_utc": 1616606607.0,
                    "replies": []
                },
                {
                    "body": "Sure they are balanced. Daddy has the $$ and Baby decides what she is willing to provide. Nobody forcing anyone to do anything.",
                    "author": "sanfran4fun",
                    "id": "gs462ob",
                    "parent_id": "t1_gs2dl16",
                    "score": -3,
                    "created_utc": 1616632092.0,
                    "replies": [
                        {
                            "body": "No one is “forced” to do anything, but as a sugar baby (who is likely doing it in part for the money), the power dynamic is completely different.",
                            "author": "zara_io",
                            "id": "gs4g9gm",
                            "parent_id": "t1_gs462ob",
                            "score": 5,
                            "created_utc": 1616637136.0,
                            "replies": [
                                {
                                    "body": "beautiful young women have their pick of who to date compared to paunchy middle aged and older men who want to cling to any scrap of youth, so you're right, the power is completely unbalanced.",
                                    "author": "sucRoseToTheOccasion",
                                    "id": "gs4vi59",
                                    "parent_id": "t1_gs4g9gm",
                                    "score": 0,
                                    "created_utc": 1616645803.0,
                                    "replies": []
                                },
                                {
                                    "body": "depends on if the big head or little head is at the helm.............. and to whom the SB is sending the message..............",
                                    "author": "pinotandsugar",
                                    "id": "gs4rfed",
                                    "parent_id": "t1_gs4g9gm",
                                    "score": 1,
                                    "created_utc": 1616643255.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "\"You are an adult, and should be able to speak up for yourself and talk with your partner/ POT.\"\n\nIn my heart I am not meaning to be condescending, BUT, many of our SB's here and POT SB's are in the 18-24 yr old range. I'm being a bit arbitrary here with the numbers. My point being that they are adults \"in the eyes of the law\" but in particular have little to no experience on the other side of a negotiation with an adult as old as their parents or grandparents about something as specific as: Will you actually use a condom? Will you actually give me funds after we have sex?  Will you not berate me about not wanting to get into your car with you in a dark parking lot? \n\nYou know - stuff like that.\n\nSo yeah, they want and need some help with this.  I'm glad we're here.",
            "author": null,
            "id": "gs266h1",
            "parent_id": "t3_mc7l5y",
            "score": 51,
            "created_utc": 1616600628.0,
            "replies": [
                {
                    "body": "Yes, the answer still is, \"You need to discuss this with them.\"\n\nBut those OP's need our help with it; phrasing or just giving them the encouragement and bravery needed to do it.",
                    "author": null,
                    "id": "gs26et1",
                    "parent_id": "t1_gs266h1",
                    "score": 15,
                    "created_utc": 1616600726.0,
                    "replies": []
                },
                {
                    "body": "It’s not just the age. A lot of tough discussions we run our thoughts by a confident or friend. The nature of the topic eliminates a lot of those options. It’s good to have someone to bounce thoughts off of. You’re right, it’s good this is a place they can seek advice.",
                    "author": "FreshLaker",
                    "id": "gs4ddqj",
                    "parent_id": "t1_gs266h1",
                    "score": 3,
                    "created_utc": 1616635682.0,
                    "replies": []
                },
                {
                    "body": "Not all sugar babies are in that age range. If you want better communication try going after someone older if you think you are tough & manly enough to handle seeing stretch marks.",
                    "author": "anonaccount202",
                    "id": "gs2brh1",
                    "parent_id": "t1_gs266h1",
                    "score": -4,
                    "created_utc": 1616602985.0,
                    "replies": [
                        {
                            "body": "To be fair, this isn't about u/Boston_Prof age preference in SBs. This is about the many posts we see on SLF from younger, less mature and less experienced women. They are in the bowl too.",
                            "author": "BinghamtonSD",
                            "id": "gs2jtsz",
                            "parent_id": "t1_gs2brh1",
                            "score": 10,
                            "created_utc": 1616606353.0,
                            "replies": [
                                {
                                    "body": "Right; my post was misleading when I said \"our SB's.\"  \"Our\" as in those who come to our humble sub.  My preference is older too.",
                                    "author": null,
                                    "id": "gs2p528",
                                    "parent_id": "t1_gs2jtsz",
                                    "score": 5,
                                    "created_utc": 1616608595.0,
                                    "replies": []
                                },
                                {
                                    "body": "[removed]",
                                    "author": null,
                                    "id": "gs2kbpj",
                                    "parent_id": "t1_gs2jtsz",
                                    "score": -6,
                                    "created_utc": 1616606563.0,
                                    "replies": [
                                        {
                                            "body": "Ok but those girls still exist and still need help no matter how much you insult random SDs on here. They still can use some guidance by posting on here for advice. It's a pretty normal human thing to seek advice.",
                                            "author": "ColdHeaux",
                                            "id": "gs2mjb6",
                                            "parent_id": "t1_gs2kbpj",
                                            "score": 11,
                                            "created_utc": 1616607497.0,
                                            "replies": [
                                                {
                                                    "body": "If all sugar babies need help than it would make more sense for the sugar daddies to choose someone they match with best. To cut back on the drama of miscommunication. \n\nI'm not insulting them because they require someone to look perfect in order to sexually perform. It's the subconscious that controls that part of the body.",
                                                    "author": "anonaccount202",
                                                    "id": "gs2nzsx",
                                                    "parent_id": "t1_gs2mjb6",
                                                    "score": -5,
                                                    "created_utc": 1616608113.0,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "body": "Which again is not the point.  Women come here for help; most of us are happy to help. It should not be surprising that many SB's find it daunting or uncomfortable or confusing as to how to communicate effectively with a gentleman 20, 30, or 40 years older than they are.",
                                            "author": null,
                                            "id": "gs2pcvi",
                                            "parent_id": "t1_gs2kbpj",
                                            "score": 8,
                                            "created_utc": 1616608685.0,
                                            "replies": [
                                                {
                                                    "body": "And my point is if you want better communication you can choose someone older.",
                                                    "author": "anonaccount202",
                                                    "id": "gs2q0fu",
                                                    "parent_id": "t1_gs2pcvi",
                                                    "score": -3,
                                                    "created_utc": 1616608964.0,
                                                    "replies": []
                                                },
                                                {
                                                    "body": "And my point is if you want better communication you can choose someone older.",
                                                    "author": "anonaccount202",
                                                    "id": "gs2q0fl",
                                                    "parent_id": "t1_gs2pcvi",
                                                    "score": -3,
                                                    "created_utc": 1616608964.0,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "body": ">But you are too weak to handle any physical imperfections. So it's your fault you can't have emotionally fulfilling relationships.\n\nIf I wanted physical imperfections & women closer to my age, I would just vanilla date. No allowance needed 😜",
                                            "author": null,
                                            "id": "gs3zhfs",
                                            "parent_id": "t1_gs2kbpj",
                                            "score": 3,
                                            "created_utc": 1616628875.0,
                                            "replies": [
                                                {
                                                    "body": "I think it's obvious sugar daddies can't date in their own age range because of their sexual greed. I'd rather have a long term relationship with a man who's dick can work normally.",
                                                    "author": "anonaccount202",
                                                    "id": "gs4qhmq",
                                                    "parent_id": "t1_gs3zhfs",
                                                    "score": 3,
                                                    "created_utc": 1616642700.0,
                                                    "replies": [
                                                        {
                                                            "body": "Wait a minute you just contradicted yourself.   \n\nOne minute you said we don’t date men in our own age because of our sexual greed And the next minute our saying our dicks don’t work...?\n\nHow’s it going to have all the sexual greed with a nonworking dick?\n  \nHow about these are the reasons why I date younger women:  \n\n1. More adventurous in & out of the bedroom then the average 40 something woman\n\n2. Not stuck in their ways, actually still open minded\n\n3. Have the energy and stamina to go multiple rounds per night\n\n4. Still full of hopes and dreams, and aren’t bitter or jaded\n\n5 driven and motivated to succeed\n\n6. Have less emotional baggage from choosing the wrong men most of their lives",
                                                            "author": null,
                                                            "id": "gs742j5",
                                                            "parent_id": "t1_gs4qhmq",
                                                            "score": 0,
                                                            "created_utc": 1616694851.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "body": "Not sure what crowd you hang out with, but I know plenty of 16-24 year olds that know perfectly well how to communicate with people of all ages.\nthat includes my own kids, btw.",
                                            "author": "dontcallmechristian",
                                            "id": "gs2mw91",
                                            "parent_id": "t1_gs2kbpj",
                                            "score": -2,
                                            "created_utc": 1616607648.0,
                                            "replies": [
                                                {
                                                    "body": "Is your 16 yr old, as precocious as he or she is, facile enough to have a significant conversation about cash allowance for an intimate relationship, the use of birth control, etc., with a stranger who is 30 or 40 or 50 yrs his or her senior?  If so -- great!  If not, it would not be surprising nor reflect negatively upon your parenting acumen.",
                                                    "author": null,
                                                    "id": "gs2pnsv",
                                                    "parent_id": "t1_gs2mw91",
                                                    "score": 10,
                                                    "created_utc": 1616608813.0,
                                                    "replies": []
                                                },
                                                {
                                                    "body": "The experience that comes with age is definitely beneficial though. That's why I'm proud to be an older sugar baby.",
                                                    "author": "anonaccount202",
                                                    "id": "gs2o793",
                                                    "parent_id": "t1_gs2mw91",
                                                    "score": 3,
                                                    "created_utc": 1616608199.0,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "body": "I did not start this thread to get in to a huge pissing match. \n\nMany SDs prefer younger, many don't.\n\nMy sweet spot is after the age he mentioned up to early 40s-ish.  Essentially someone out of my leauge but vanilla dating type but with help. But there is wiggle room depending on maturity and yes communication. But communication is a key factor in who I go for. But people like what they like. That's their perogative.",
                                            "author": "BigBearSD",
                                            "id": "gs2lzj9",
                                            "parent_id": "t1_gs2kbpj",
                                            "score": -1,
                                            "created_utc": 1616607263.0,
                                            "replies": [
                                                {
                                                    "body": "And it's my perogative to judge someone for not being able to form a relationship with someone unless they look good enough. That's on the sugar daddy. If they want someone who can communicate better they can have that at the sacrifice of having someone older & more stretch mark covered. It's not on me that these so called daddys are too prissy to choose that option.",
                                                    "author": "anonaccount202",
                                                    "id": "gs2nn3z",
                                                    "parent_id": "t1_gs2lzj9",
                                                    "score": -2,
                                                    "created_utc": 1616607964.0,
                                                    "replies": [
                                                        {
                                                            "body": "Speak for yourself hun, 40 and zero stretch marks here.  And stop whining just because they don't go for older, but maybe your attitude is whats keeping them from picking you?",
                                                            "author": "sinvortex",
                                                            "id": "gs2wgj7",
                                                            "parent_id": "t1_gs2nn3z",
                                                            "score": 6,
                                                            "created_utc": 1616611690.0,
                                                            "replies": []
                                                        },
                                                        {
                                                            "body": "I have dated \"older\" women in this lifestyle that looked stunning and didn't have stretch marks.\n\nAlso, in regards to your comment, there are many younger SBs who can communicate well, maybe not most, but plenty of them exist.\n\nMay I ask, are you jaded because you are having a harder time finding an SD?",
                                                            "author": "BigBearSD",
                                                            "id": "gs2plau",
                                                            "parent_id": "t1_gs2nn3z",
                                                            "score": 5,
                                                            "created_utc": 1616608784.0,
                                                            "replies": [
                                                                {
                                                                    "body": "oh yeah, my ex sgf was 35 yo with a daughter and still stunning and would line her up against any 22 yo SB in the world.  And she showed me younger pictures when she was \"thinner\" and yeah maybe 10 -15 lbs heavier but it went to all the right places and she looked better to me at 35 than she did in her late 20's when modeled.\n\nobviously everyone has different tastes.\n\nBut she was defiantly a woman and not a girl.  But she still seemed to have issues communicating or trying to spin things in fear \"she would get fired\" or I would dump her if she was 100 pct honest.  Which never would have happened.  And what caused first breakup was me finding out about major lies ....not what she was lying about.  And yes multiple breakups and the last straw was yet another lie/omission.  So got to point could never really trust her in the future.\n\nSo I really think its that dynamic over age/maturity.",
                                                                    "author": "Buckeyechamp21",
                                                                    "id": "gs2x8ca",
                                                                    "parent_id": "t1_gs2plau",
                                                                    "score": 6,
                                                                    "created_utc": 1616612009.0,
                                                                    "replies": []
                                                                },
                                                                {
                                                                    "body": ">May I ask, are you jaded because you are having a harder time finding an SD?\n\nYea",
                                                                    "author": "anonaccount202",
                                                                    "id": "gs2ytyn",
                                                                    "parent_id": "t1_gs2plau",
                                                                    "score": 0,
                                                                    "created_utc": 1616612667.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "Which isn't the point -- my point is that especially younger women need help with the communications.  Which is why they come here asking for help.\n\nWhen I said \"our SB's\" I meant the ones coming here to SLF.  My SB is older than that.",
                            "author": null,
                            "id": "gs2oyu2",
                            "parent_id": "t1_gs2brh1",
                            "score": 9,
                            "created_utc": 1616608521.0,
                            "replies": []
                        },
                        {
                            "body": ">Not all sugar babies are in that age range. If you want better communication try going after someone older if you think you are tough & manly enough to handle seeing stretch marks.\n\nno, but probably 90% of them are.\n\nAge has no correlation with communication, my 19 year old SB was a way better communicator then my 34 year old ex GF. So please dont look down on people for choosing a relationship with someone younger. The term Sugar Daddy has been around 100 years and has always referred to someone who dated and financially cared for a younger woman. \n\nAlso this post isnt about complaining about young SB not being able to communicate, its about telling young SB to just talk to their SD rather than has what should I do.",
                            "author": null,
                            "id": "gs3z4tt",
                            "parent_id": "t1_gs2brh1",
                            "score": 2,
                            "created_utc": 1616628705.0,
                            "replies": [
                                {
                                    "body": "I've had so many sugar daddy's tell me that so many women offer what I do but are way younger and better looking. Just feels like that's all sugar daddy's want.",
                                    "author": "anonaccount202",
                                    "id": "gs40ii6",
                                    "parent_id": "t1_gs3z4tt",
                                    "score": 2,
                                    "created_utc": 1616629381.0,
                                    "replies": [
                                        {
                                            "body": "well think of it this way, when you were younger and hotter, you got to pick any man you wanted to sleep with, most men regardless of their looks unless they were top 5%, have had to take whatever they could get. Thats why it was always called getting lucky if a guy hooks up with a girl. Women do the choosing.\n\nSugar daddies now have the same privilege that the young beautiful women had while they were growing up. Imagine if you will, now having the ability to chose who you want to sleep with, and having lots of choices. Sugar dating reverses the roles, and puts the man in the position that women have enjoyed most of their lives.\n\nUnfortunately that means given the choice, most guys are going to choose younger, especially if an allowance is going to be involved. Now if you're just looking to date an older wealthy man, im sure many SD would gladly date you. But from what Ive seen only exceptionally beautiful, well kept in shape women that are older end up making it as SB and having successful SR, not just short term arrangments.",
                                            "author": null,
                                            "id": "gs43chs",
                                            "parent_id": "t1_gs40ii6",
                                            "score": 2,
                                            "created_utc": 1616630761.0,
                                            "replies": [
                                                {
                                                    "body": "I guess I'm not that good looking or something because I couldn't find it when I was young and figured it would get easier as I gained experience and learned what men want.",
                                                    "author": "anonaccount202",
                                                    "id": "gs4548l",
                                                    "parent_id": "t1_gs43chs",
                                                    "score": 1,
                                                    "created_utc": 1616631625.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gs230kx",
            "parent_id": "t3_mc7l5y",
            "score": 35,
            "created_utc": 1616599346.0,
            "replies": [
                {
                    "body": "This. Also they want to know their feeling is valid and be assured that they are not making up things, \ncrazy, or not overreacting that the need to have a conversation is there.",
                    "author": "BlissfulSB",
                    "id": "gs242vf",
                    "parent_id": "t1_gs230kx",
                    "score": 18,
                    "created_utc": 1616599792.0,
                    "replies": []
                },
                {
                    "body": "Agreed. \n\nAnd many times it’s just for reinforcement or validation of their thought process.",
                    "author": "mraspencer",
                    "id": "gs25hqp",
                    "parent_id": "t1_gs230kx",
                    "score": 10,
                    "created_utc": 1616600336.0,
                    "replies": []
                },
                {
                    "body": "True. And I agree to an extent. But some of the questions are simple, and can simply be resolved.",
                    "author": "BigBearSD",
                    "id": "gs26khk",
                    "parent_id": "t1_gs230kx",
                    "score": -4,
                    "created_utc": 1616600793.0,
                    "replies": [
                        {
                            "body": "Everyone's different. If we start shaming people for asking their questions, they will no longer ask, which is worse.",
                            "author": "InnocentSweetTooth",
                            "id": "gs38zvg",
                            "parent_id": "t1_gs26khk",
                            "score": 5,
                            "created_utc": 1616616872.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I love you man, but I think this misses the mark. Most people are looking for perspective, empathy, and need help finding the right words. In any sports game, I could say \"the strategy is easy, just score more points, lmao!\"  It's technically true, but so overly broad that it's, eh em, *pointless* to say that.  So people obsess about tactics. That's part of human nature.\n#\n(Yes, I do plan to chuckle about that pun all day)",
            "author": "TastySpermDispenser",
            "id": "gs25349",
            "parent_id": "t3_mc7l5y",
            "score": 27,
            "created_utc": 1616600161.0,
            "replies": [
                {
                    "body": "You’re the best 😆😆",
                    "author": "Majestic-Ad1867",
                    "id": "gs4tssv",
                    "parent_id": "t1_gs25349",
                    "score": 2,
                    "created_utc": 1616644713.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "This is really dismissive and obnoxious. Most of the time it seems like people just want to know how to phrase something when they talk to their SR partner than what they should do. People put a lot of stock in their SR partner and sometimes it helps to have a third party who doesn't have a bunch of emotions tied up in the situation to weigh in. If you don't like it, you can scroll.",
            "author": "missthingmariah",
            "id": "gs2vpvt",
            "parent_id": "t3_mc7l5y",
            "score": 16,
            "created_utc": 1616611379.0,
            "replies": []
        },
        {
            "body": "What should I do/say if my SB has to bust-ass after eating some crazy-hot Thai food?",
            "author": "mraspencer",
            "id": "gs203cb",
            "parent_id": "t3_mc7l5y",
            "score": 16,
            "created_utc": 1616598105.0,
            "replies": [
                {
                    "body": "Tell her \"No facesitting for you!\"",
                    "author": "BigBearSD",
                    "id": "gs26gb7",
                    "parent_id": "t1_gs203cb",
                    "score": 9,
                    "created_utc": 1616600744.0,
                    "replies": []
                },
                {
                    "body": "Lol",
                    "author": "Adira5",
                    "id": "gs23z9w",
                    "parent_id": "t1_gs203cb",
                    "score": 2,
                    "created_utc": 1616599751.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "*You are an adult, and should be able to speak up for yourself and talk with your partner/ POT.* \n\nBack to my snark & humor... It's hard to talk and speak up when your vocabulary consists entirely of emojis.",
            "author": "BinghamtonSD",
            "id": "gs2l55h",
            "parent_id": "t3_mc7l5y",
            "score": 5,
            "created_utc": 1616606906.0,
            "replies": [
                {
                    "body": "hey wyd....",
                    "author": "Buckeyechamp21",
                    "id": "gs2ykx3",
                    "parent_id": "t1_gs2l55h",
                    "score": 3,
                    "created_utc": 1616612562.0,
                    "replies": []
                },
                {
                    "body": "hahahaaa",
                    "author": "wb19081908",
                    "id": "gs5jz4w",
                    "parent_id": "t1_gs2l55h",
                    "score": 1,
                    "created_utc": 1616666950.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I agree there is definitely stuff in this sub that is more \"basic adulting\" than really SB/SD specific - however we are supposed to be Daddys so we should help to educate a bit\n\nAs well as the  - \"why not just ask him\" topics, I also find there are many \"have you know standards!!\" topics as well where the SB asks is it ok / normal for her SD to mistreat her by refusing or neglecting to discuss allowance, forgetting to pay, insisting on this and that etc.",
            "author": "lookingforlaughter",
            "id": "gs2o3qt",
            "parent_id": "t3_mc7l5y",
            "score": 4,
            "created_utc": 1616608158.0,
            "replies": []
        },
        {
            "body": "Actually, the majority of the time the asker knows the answer to their question, they just don't want to believe/accept it and ask for validation, and then don't accept it anyways.",
            "author": "Acrobatic_Half_6631",
            "id": "gs23fhp",
            "parent_id": "t3_mc7l5y",
            "score": 2,
            "created_utc": 1616599518.0,
            "replies": []
        },
        {
            "body": "The perceived power imbalance and relative lack of life experience makes these understandable questions.  But eventually the right answer is as you say!  That will happen when everyone is wealthy.",
            "author": "TY2022",
            "id": "gs3xqir",
            "parent_id": "t3_mc7l5y",
            "score": 2,
            "created_utc": 1616628033.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gs20kj2",
            "parent_id": "t3_mc7l5y",
            "score": 5,
            "created_utc": 1616598314.0,
            "replies": [
                {
                    "body": "I don't want to get all serious and sincere (my role on SLF tends towards humor and snark), but sadly, I have come across a few women in the bowl who are much closer to these lyrics than anyone would want to admit. If I may quote Della Duck, \"\\[...\\] a mother would do anything for the sake of her kids.\"",
                    "author": "BinghamtonSD",
                    "id": "gs2kym8",
                    "parent_id": "t1_gs20kj2",
                    "score": 2,
                    "created_utc": 1616606829.0,
                    "replies": []
                },
                {
                    "body": "🤣",
                    "author": null,
                    "id": "gs21frn",
                    "parent_id": "t1_gs20kj2",
                    "score": 2,
                    "created_utc": 1616598680.0,
                    "replies": []
                },
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "gs21ony",
                    "parent_id": "t1_gs20kj2",
                    "score": 2,
                    "created_utc": 1616598784.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "gs21z8h",
                            "parent_id": "t1_gs21ony",
                            "score": 2,
                            "created_utc": 1616598906.0,
                            "replies": [
                                {
                                    "body": "thats coffee house open mic poetry right there.  \n\n&#x200B;\n\nsnaps of fingers",
                                    "author": "Buckeyechamp21",
                                    "id": "gs23mpn",
                                    "parent_id": "t1_gs21z8h",
                                    "score": 3,
                                    "created_utc": 1616599602.0,
                                    "replies": []
                                },
                                {
                                    "body": ">in and out of lockdown\n\n>I ain't got a job now\n\nThis part takes on new meaning post-COVID.",
                                    "author": "Intrepid_Egg_7722",
                                    "id": "gs32jlu",
                                    "parent_id": "t1_gs21z8h",
                                    "score": 3,
                                    "created_utc": 1616614195.0,
                                    "replies": []
                                },
                                {
                                    "body": "\"Written and performed by Stevie Nicks\"",
                                    "author": "ColdHeaux",
                                    "id": "gs2mrtb",
                                    "parent_id": "t1_gs21z8h",
                                    "score": 0,
                                    "created_utc": 1616607596.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Talk to him 😂😂",
                    "author": "BigBearSD",
                    "id": "gs22015",
                    "parent_id": "t1_gs20kj2",
                    "score": 1,
                    "created_utc": 1616598915.0,
                    "replies": []
                },
                {
                    "body": "I read this in singsong as soon as I started lol thanks for the throwback",
                    "author": null,
                    "id": "gs2giqp",
                    "parent_id": "t1_gs20kj2",
                    "score": 1,
                    "created_utc": 1616604963.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "But talking to actual people is hard. 🥺",
            "author": "curly_spice",
            "id": "gs2iv4k",
            "parent_id": "t3_mc7l5y",
            "score": 0,
            "created_utc": 1616605952.0,
            "replies": [
                {
                    "body": "because people spend to much time on internet (guilty as accusing...lol) and even just texting instead of talking.  \n\ntechnology has definitely hindered human interaction / communication.",
                    "author": "Buckeyechamp21",
                    "id": "gs2yg0x",
                    "parent_id": "t1_gs2iv4k",
                    "score": 1,
                    "created_utc": 1616612505.0,
                    "replies": []
                },
                {
                    "body": "Im not sure if you were being serious or joking, but thats probably because most young people have actually forgot that the phone in their pocket was originally designed for talking to people, not texting/snapping or gramming. It boggles my mind how many younger women are actually afraid of talking on the phone, because they actually have to talk and have a conversation. I fear that one day people will not know how to talk to each other with actual conversation.",
                    "author": null,
                    "id": "gs408o6",
                    "parent_id": "t1_gs2iv4k",
                    "score": 1,
                    "created_utc": 1616629247.0,
                    "replies": [
                        {
                            "body": "I was mostly kidding but I know where you’re coming from. Before entering this lifestyle I hated talking on the phones or even to people outside of my friends + family in general. It was so bad that I could barely order food at restaurants... But now I’m much more comfortable with calls and I’d honestly prefer them for talking to my SD. \n\nBoth forms of communication serve a purpose; texting is much easier for quick conversations or lighter subjects  whereas calls work better for deep, lengthy conversations. \n\nRegardless of your preferred communication method, I 100% agree that having conversations is the easiest way to solve many of the issues we see on this forum and I wish that people my age weren’t so call-avoidant.",
                            "author": "curly_spice",
                            "id": "gs437xl",
                            "parent_id": "t1_gs408o6",
                            "score": 1,
                            "created_utc": 1616630698.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Exactly .. how is talking to someone honestly so hard.  seems like woman have more issues of conversations than men.  yes i know its also a young vs old thing too and SDs \"more mature\".",
            "author": "Buckeyechamp21",
            "id": "gs23b0x",
            "parent_id": "t3_mc7l5y",
            "score": -6,
            "created_utc": 1616599466.0,
            "replies": [
                {
                    "body": "This is super dismissive of how women have been conditioned their whole lives. You don't question. You don't rock the boat. And you certainly don't do either of those with a man in authority. You don't have conversations that could make the other party uncomfortable. Basically anything that would change the status quo. With these younger women who haven't had a lot of opportunities to set firm boundaries with a person much older/with much more perceived power, that's *terrifying*. Even if you think it's a simple conversation, it may not be from her perspective. If you don't like it, you can scroll.",
                    "author": "missthingmariah",
                    "id": "gs2wqfo",
                    "parent_id": "t1_gs23b0x",
                    "score": 9,
                    "created_utc": 1616611805.0,
                    "replies": []
                },
                {
                    "body": ">how is talking to someone honestly so hard. \n\nYou’ve never found broaching a sensitive topic to be uncomfortable? You’ve never consulted with another person how to handle a conversation? You’ve never asked for feedback on a “what would you do?” scenario? \n\nIsn’t feedback, advice, getting a different perspective one of the benefits of a sugar subreddit?",
                    "author": "uniballSD",
                    "id": "gs2ll4f",
                    "parent_id": "t1_gs23b0x",
                    "score": 7,
                    "created_utc": 1616607093.0,
                    "replies": [
                        {
                            "body": "I mean I like seeing others perspectives in general.  And ive vented telling my experience and did take into account what people said (well i chose not to listen to good advice ;-) )\n\nBut point of OP is on obvious simple stuff that most likely would be a 2 min convo with SR partner.  And yeah random strangers on internet with limited facts or context most likely going to make things worse majority of times.  As yes a few generally lend good advice; but most commenters just responding with their same agenda points imho.\n\nNow I do have a subset of folks on here; even one SB who we have become pretty close friends irl after she DM me, all be it remote as different states.  And yes we trust each other and we were in similar situations with our last Srs so we helped each other more like dual therapists...lol",
                            "author": "Buckeyechamp21",
                            "id": "gs2qd3b",
                            "parent_id": "t1_gs2ll4f",
                            "score": 0,
                            "created_utc": 1616609113.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Because if things go wrong we lose our rent lol",
                    "author": "ColdHeaux",
                    "id": "gs2n4xo",
                    "parent_id": "t1_gs23b0x",
                    "score": 3,
                    "created_utc": 1616607751.0,
                    "replies": [
                        {
                            "body": "than you have the wrong SD to begin with imho.",
                            "author": "Buckeyechamp21",
                            "id": "gs2pbmd",
                            "parent_id": "t1_gs2n4xo",
                            "score": 2,
                            "created_utc": 1616608671.0,
                            "replies": [
                                {
                                    "body": "I'm not talking about me. I'm just saying, esp for new and inexperienced SBs, it's a concern. Women ask each other for relationship advice all the time- why would SBs be any different honestly?",
                                    "author": "ColdHeaux",
                                    "id": "gs34i8p",
                                    "parent_id": "t1_gs2pbmd",
                                    "score": 2,
                                    "created_utc": 1616615007.0,
                                    "replies": []
                                },
                                {
                                    "body": "Plus sometimes SD perspectives are really useful for us and we can get unexpected insights.",
                                    "author": "ColdHeaux",
                                    "id": "gs34lxk",
                                    "parent_id": "t1_gs2pbmd",
                                    "score": 2,
                                    "created_utc": 1616615052.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I still believe that it is people who do not have the skills to broach a subject with their partner full stop.  The specifics as to how to do so with catering to the specific individual comes with a subset of skill that not all possess.  So the OP in theory would benefit from any advice at all.\n\nPersonally I get annoyed at the posts that are easily answered by a mild perusal of the links on the right but I don't read those posts and I rarely comment on them.  Sometimes the SM search posts birth 2-4  babies with same title in the same hour it's funny and a bit tiresome, but that is the nature of the beast.  \n\nI do enjoy your Monday check in not everyone has the luxury of being asked that question especially in this climate.",
            "author": "KittenReigns",
            "id": "gs4bu25",
            "parent_id": "t3_mc7l5y",
            "score": 1,
            "created_utc": 1616634910.0,
            "replies": []
        },
        {
            "body": "I don’t know the OP’s past but if what you say is true, then you make a good point.",
            "author": "uniballSD",
            "id": "gs2kfi9",
            "parent_id": "t1_gs2dl16",
            "score": 5,
            "created_utc": 1616606607.0,
            "replies": []
        },
        {
            "body": "Sure they are balanced. Daddy has the $$ and Baby decides what she is willing to provide. Nobody forcing anyone to do anything.",
            "author": "sanfran4fun",
            "id": "gs462ob",
            "parent_id": "t1_gs2dl16",
            "score": -3,
            "created_utc": 1616632092.0,
            "replies": [
                {
                    "body": "No one is “forced” to do anything, but as a sugar baby (who is likely doing it in part for the money), the power dynamic is completely different.",
                    "author": "zara_io",
                    "id": "gs4g9gm",
                    "parent_id": "t1_gs462ob",
                    "score": 5,
                    "created_utc": 1616637136.0,
                    "replies": [
                        {
                            "body": "beautiful young women have their pick of who to date compared to paunchy middle aged and older men who want to cling to any scrap of youth, so you're right, the power is completely unbalanced.",
                            "author": "sucRoseToTheOccasion",
                            "id": "gs4vi59",
                            "parent_id": "t1_gs4g9gm",
                            "score": 0,
                            "created_utc": 1616645803.0,
                            "replies": []
                        },
                        {
                            "body": "depends on if the big head or little head is at the helm.............. and to whom the SB is sending the message..............",
                            "author": "pinotandsugar",
                            "id": "gs4rfed",
                            "parent_id": "t1_gs4g9gm",
                            "score": 1,
                            "created_utc": 1616643255.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Yes, the answer still is, \"You need to discuss this with them.\"\n\nBut those OP's need our help with it; phrasing or just giving them the encouragement and bravery needed to do it.",
            "author": null,
            "id": "gs26et1",
            "parent_id": "t1_gs266h1",
            "score": 15,
            "created_utc": 1616600726.0,
            "replies": []
        },
        {
            "body": "It’s not just the age. A lot of tough discussions we run our thoughts by a confident or friend. The nature of the topic eliminates a lot of those options. It’s good to have someone to bounce thoughts off of. You’re right, it’s good this is a place they can seek advice.",
            "author": "FreshLaker",
            "id": "gs4ddqj",
            "parent_id": "t1_gs266h1",
            "score": 3,
            "created_utc": 1616635682.0,
            "replies": []
        },
        {
            "body": "Not all sugar babies are in that age range. If you want better communication try going after someone older if you think you are tough & manly enough to handle seeing stretch marks.",
            "author": "anonaccount202",
            "id": "gs2brh1",
            "parent_id": "t1_gs266h1",
            "score": -4,
            "created_utc": 1616602985.0,
            "replies": [
                {
                    "body": "To be fair, this isn't about u/Boston_Prof age preference in SBs. This is about the many posts we see on SLF from younger, less mature and less experienced women. They are in the bowl too.",
                    "author": "BinghamtonSD",
                    "id": "gs2jtsz",
                    "parent_id": "t1_gs2brh1",
                    "score": 10,
                    "created_utc": 1616606353.0,
                    "replies": [
                        {
                            "body": "Right; my post was misleading when I said \"our SB's.\"  \"Our\" as in those who come to our humble sub.  My preference is older too.",
                            "author": null,
                            "id": "gs2p528",
                            "parent_id": "t1_gs2jtsz",
                            "score": 5,
                            "created_utc": 1616608595.0,
                            "replies": []
                        },
                        {
                            "body": "[removed]",
                            "author": null,
                            "id": "gs2kbpj",
                            "parent_id": "t1_gs2jtsz",
                            "score": -6,
                            "created_utc": 1616606563.0,
                            "replies": [
                                {
                                    "body": "Ok but those girls still exist and still need help no matter how much you insult random SDs on here. They still can use some guidance by posting on here for advice. It's a pretty normal human thing to seek advice.",
                                    "author": "ColdHeaux",
                                    "id": "gs2mjb6",
                                    "parent_id": "t1_gs2kbpj",
                                    "score": 11,
                                    "created_utc": 1616607497.0,
                                    "replies": [
                                        {
                                            "body": "If all sugar babies need help than it would make more sense for the sugar daddies to choose someone they match with best. To cut back on the drama of miscommunication. \n\nI'm not insulting them because they require someone to look perfect in order to sexually perform. It's the subconscious that controls that part of the body.",
                                            "author": "anonaccount202",
                                            "id": "gs2nzsx",
                                            "parent_id": "t1_gs2mjb6",
                                            "score": -5,
                                            "created_utc": 1616608113.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "Which again is not the point.  Women come here for help; most of us are happy to help. It should not be surprising that many SB's find it daunting or uncomfortable or confusing as to how to communicate effectively with a gentleman 20, 30, or 40 years older than they are.",
                                    "author": null,
                                    "id": "gs2pcvi",
                                    "parent_id": "t1_gs2kbpj",
                                    "score": 8,
                                    "created_utc": 1616608685.0,
                                    "replies": [
                                        {
                                            "body": "And my point is if you want better communication you can choose someone older.",
                                            "author": "anonaccount202",
                                            "id": "gs2q0fu",
                                            "parent_id": "t1_gs2pcvi",
                                            "score": -3,
                                            "created_utc": 1616608964.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "And my point is if you want better communication you can choose someone older.",
                                            "author": "anonaccount202",
                                            "id": "gs2q0fl",
                                            "parent_id": "t1_gs2pcvi",
                                            "score": -3,
                                            "created_utc": 1616608964.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": ">But you are too weak to handle any physical imperfections. So it's your fault you can't have emotionally fulfilling relationships.\n\nIf I wanted physical imperfections & women closer to my age, I would just vanilla date. No allowance needed 😜",
                                    "author": null,
                                    "id": "gs3zhfs",
                                    "parent_id": "t1_gs2kbpj",
                                    "score": 3,
                                    "created_utc": 1616628875.0,
                                    "replies": [
                                        {
                                            "body": "I think it's obvious sugar daddies can't date in their own age range because of their sexual greed. I'd rather have a long term relationship with a man who's dick can work normally.",
                                            "author": "anonaccount202",
                                            "id": "gs4qhmq",
                                            "parent_id": "t1_gs3zhfs",
                                            "score": 3,
                                            "created_utc": 1616642700.0,
                                            "replies": [
                                                {
                                                    "body": "Wait a minute you just contradicted yourself.   \n\nOne minute you said we don’t date men in our own age because of our sexual greed And the next minute our saying our dicks don’t work...?\n\nHow’s it going to have all the sexual greed with a nonworking dick?\n  \nHow about these are the reasons why I date younger women:  \n\n1. More adventurous in & out of the bedroom then the average 40 something woman\n\n2. Not stuck in their ways, actually still open minded\n\n3. Have the energy and stamina to go multiple rounds per night\n\n4. Still full of hopes and dreams, and aren’t bitter or jaded\n\n5 driven and motivated to succeed\n\n6. Have less emotional baggage from choosing the wrong men most of their lives",
                                                    "author": null,
                                                    "id": "gs742j5",
                                                    "parent_id": "t1_gs4qhmq",
                                                    "score": 0,
                                                    "created_utc": 1616694851.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "Not sure what crowd you hang out with, but I know plenty of 16-24 year olds that know perfectly well how to communicate with people of all ages.\nthat includes my own kids, btw.",
                                    "author": "dontcallmechristian",
                                    "id": "gs2mw91",
                                    "parent_id": "t1_gs2kbpj",
                                    "score": -2,
                                    "created_utc": 1616607648.0,
                                    "replies": [
                                        {
                                            "body": "Is your 16 yr old, as precocious as he or she is, facile enough to have a significant conversation about cash allowance for an intimate relationship, the use of birth control, etc., with a stranger who is 30 or 40 or 50 yrs his or her senior?  If so -- great!  If not, it would not be surprising nor reflect negatively upon your parenting acumen.",
                                            "author": null,
                                            "id": "gs2pnsv",
                                            "parent_id": "t1_gs2mw91",
                                            "score": 10,
                                            "created_utc": 1616608813.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "The experience that comes with age is definitely beneficial though. That's why I'm proud to be an older sugar baby.",
                                            "author": "anonaccount202",
                                            "id": "gs2o793",
                                            "parent_id": "t1_gs2mw91",
                                            "score": 3,
                                            "created_utc": 1616608199.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "I did not start this thread to get in to a huge pissing match. \n\nMany SDs prefer younger, many don't.\n\nMy sweet spot is after the age he mentioned up to early 40s-ish.  Essentially someone out of my leauge but vanilla dating type but with help. But there is wiggle room depending on maturity and yes communication. But communication is a key factor in who I go for. But people like what they like. That's their perogative.",
                                    "author": "BigBearSD",
                                    "id": "gs2lzj9",
                                    "parent_id": "t1_gs2kbpj",
                                    "score": -1,
                                    "created_utc": 1616607263.0,
                                    "replies": [
                                        {
                                            "body": "And it's my perogative to judge someone for not being able to form a relationship with someone unless they look good enough. That's on the sugar daddy. If they want someone who can communicate better they can have that at the sacrifice of having someone older & more stretch mark covered. It's not on me that these so called daddys are too prissy to choose that option.",
                                            "author": "anonaccount202",
                                            "id": "gs2nn3z",
                                            "parent_id": "t1_gs2lzj9",
                                            "score": -2,
                                            "created_utc": 1616607964.0,
                                            "replies": [
                                                {
                                                    "body": "Speak for yourself hun, 40 and zero stretch marks here.  And stop whining just because they don't go for older, but maybe your attitude is whats keeping them from picking you?",
                                                    "author": "sinvortex",
                                                    "id": "gs2wgj7",
                                                    "parent_id": "t1_gs2nn3z",
                                                    "score": 6,
                                                    "created_utc": 1616611690.0,
                                                    "replies": []
                                                },
                                                {
                                                    "body": "I have dated \"older\" women in this lifestyle that looked stunning and didn't have stretch marks.\n\nAlso, in regards to your comment, there are many younger SBs who can communicate well, maybe not most, but plenty of them exist.\n\nMay I ask, are you jaded because you are having a harder time finding an SD?",
                                                    "author": "BigBearSD",
                                                    "id": "gs2plau",
                                                    "parent_id": "t1_gs2nn3z",
                                                    "score": 5,
                                                    "created_utc": 1616608784.0,
                                                    "replies": [
                                                        {
                                                            "body": "oh yeah, my ex sgf was 35 yo with a daughter and still stunning and would line her up against any 22 yo SB in the world.  And she showed me younger pictures when she was \"thinner\" and yeah maybe 10 -15 lbs heavier but it went to all the right places and she looked better to me at 35 than she did in her late 20's when modeled.\n\nobviously everyone has different tastes.\n\nBut she was defiantly a woman and not a girl.  But she still seemed to have issues communicating or trying to spin things in fear \"she would get fired\" or I would dump her if she was 100 pct honest.  Which never would have happened.  And what caused first breakup was me finding out about major lies ....not what she was lying about.  And yes multiple breakups and the last straw was yet another lie/omission.  So got to point could never really trust her in the future.\n\nSo I really think its that dynamic over age/maturity.",
                                                            "author": "Buckeyechamp21",
                                                            "id": "gs2x8ca",
                                                            "parent_id": "t1_gs2plau",
                                                            "score": 6,
                                                            "created_utc": 1616612009.0,
                                                            "replies": []
                                                        },
                                                        {
                                                            "body": ">May I ask, are you jaded because you are having a harder time finding an SD?\n\nYea",
                                                            "author": "anonaccount202",
                                                            "id": "gs2ytyn",
                                                            "parent_id": "t1_gs2plau",
                                                            "score": 0,
                                                            "created_utc": 1616612667.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Which isn't the point -- my point is that especially younger women need help with the communications.  Which is why they come here asking for help.\n\nWhen I said \"our SB's\" I meant the ones coming here to SLF.  My SB is older than that.",
                    "author": null,
                    "id": "gs2oyu2",
                    "parent_id": "t1_gs2brh1",
                    "score": 9,
                    "created_utc": 1616608521.0,
                    "replies": []
                },
                {
                    "body": ">Not all sugar babies are in that age range. If you want better communication try going after someone older if you think you are tough & manly enough to handle seeing stretch marks.\n\nno, but probably 90% of them are.\n\nAge has no correlation with communication, my 19 year old SB was a way better communicator then my 34 year old ex GF. So please dont look down on people for choosing a relationship with someone younger. The term Sugar Daddy has been around 100 years and has always referred to someone who dated and financially cared for a younger woman. \n\nAlso this post isnt about complaining about young SB not being able to communicate, its about telling young SB to just talk to their SD rather than has what should I do.",
                    "author": null,
                    "id": "gs3z4tt",
                    "parent_id": "t1_gs2brh1",
                    "score": 2,
                    "created_utc": 1616628705.0,
                    "replies": [
                        {
                            "body": "I've had so many sugar daddy's tell me that so many women offer what I do but are way younger and better looking. Just feels like that's all sugar daddy's want.",
                            "author": "anonaccount202",
                            "id": "gs40ii6",
                            "parent_id": "t1_gs3z4tt",
                            "score": 2,
                            "created_utc": 1616629381.0,
                            "replies": [
                                {
                                    "body": "well think of it this way, when you were younger and hotter, you got to pick any man you wanted to sleep with, most men regardless of their looks unless they were top 5%, have had to take whatever they could get. Thats why it was always called getting lucky if a guy hooks up with a girl. Women do the choosing.\n\nSugar daddies now have the same privilege that the young beautiful women had while they were growing up. Imagine if you will, now having the ability to chose who you want to sleep with, and having lots of choices. Sugar dating reverses the roles, and puts the man in the position that women have enjoyed most of their lives.\n\nUnfortunately that means given the choice, most guys are going to choose younger, especially if an allowance is going to be involved. Now if you're just looking to date an older wealthy man, im sure many SD would gladly date you. But from what Ive seen only exceptionally beautiful, well kept in shape women that are older end up making it as SB and having successful SR, not just short term arrangments.",
                                    "author": null,
                                    "id": "gs43chs",
                                    "parent_id": "t1_gs40ii6",
                                    "score": 2,
                                    "created_utc": 1616630761.0,
                                    "replies": [
                                        {
                                            "body": "I guess I'm not that good looking or something because I couldn't find it when I was young and figured it would get easier as I gained experience and learned what men want.",
                                            "author": "anonaccount202",
                                            "id": "gs4548l",
                                            "parent_id": "t1_gs43chs",
                                            "score": 1,
                                            "created_utc": 1616631625.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "This. Also they want to know their feeling is valid and be assured that they are not making up things, \ncrazy, or not overreacting that the need to have a conversation is there.",
            "author": "BlissfulSB",
            "id": "gs242vf",
            "parent_id": "t1_gs230kx",
            "score": 18,
            "created_utc": 1616599792.0,
            "replies": []
        },
        {
            "body": "Agreed. \n\nAnd many times it’s just for reinforcement or validation of their thought process.",
            "author": "mraspencer",
            "id": "gs25hqp",
            "parent_id": "t1_gs230kx",
            "score": 10,
            "created_utc": 1616600336.0,
            "replies": []
        },
        {
            "body": "True. And I agree to an extent. But some of the questions are simple, and can simply be resolved.",
            "author": "BigBearSD",
            "id": "gs26khk",
            "parent_id": "t1_gs230kx",
            "score": -4,
            "created_utc": 1616600793.0,
            "replies": [
                {
                    "body": "Everyone's different. If we start shaming people for asking their questions, they will no longer ask, which is worse.",
                    "author": "InnocentSweetTooth",
                    "id": "gs38zvg",
                    "parent_id": "t1_gs26khk",
                    "score": 5,
                    "created_utc": 1616616872.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "You’re the best 😆😆",
            "author": "Majestic-Ad1867",
            "id": "gs4tssv",
            "parent_id": "t1_gs25349",
            "score": 2,
            "created_utc": 1616644713.0,
            "replies": []
        },
        {
            "body": "Tell her \"No facesitting for you!\"",
            "author": "BigBearSD",
            "id": "gs26gb7",
            "parent_id": "t1_gs203cb",
            "score": 9,
            "created_utc": 1616600744.0,
            "replies": []
        },
        {
            "body": "Lol",
            "author": "Adira5",
            "id": "gs23z9w",
            "parent_id": "t1_gs203cb",
            "score": 2,
            "created_utc": 1616599751.0,
            "replies": []
        },
        {
            "body": "hey wyd....",
            "author": "Buckeyechamp21",
            "id": "gs2ykx3",
            "parent_id": "t1_gs2l55h",
            "score": 3,
            "created_utc": 1616612562.0,
            "replies": []
        },
        {
            "body": "hahahaaa",
            "author": "wb19081908",
            "id": "gs5jz4w",
            "parent_id": "t1_gs2l55h",
            "score": 1,
            "created_utc": 1616666950.0,
            "replies": []
        },
        {
            "body": "I don't want to get all serious and sincere (my role on SLF tends towards humor and snark), but sadly, I have come across a few women in the bowl who are much closer to these lyrics than anyone would want to admit. If I may quote Della Duck, \"\\[...\\] a mother would do anything for the sake of her kids.\"",
            "author": "BinghamtonSD",
            "id": "gs2kym8",
            "parent_id": "t1_gs20kj2",
            "score": 2,
            "created_utc": 1616606829.0,
            "replies": []
        },
        {
            "body": "🤣",
            "author": null,
            "id": "gs21frn",
            "parent_id": "t1_gs20kj2",
            "score": 2,
            "created_utc": 1616598680.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gs21ony",
            "parent_id": "t1_gs20kj2",
            "score": 2,
            "created_utc": 1616598784.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "gs21z8h",
                    "parent_id": "t1_gs21ony",
                    "score": 2,
                    "created_utc": 1616598906.0,
                    "replies": [
                        {
                            "body": "thats coffee house open mic poetry right there.  \n\n&#x200B;\n\nsnaps of fingers",
                            "author": "Buckeyechamp21",
                            "id": "gs23mpn",
                            "parent_id": "t1_gs21z8h",
                            "score": 3,
                            "created_utc": 1616599602.0,
                            "replies": []
                        },
                        {
                            "body": ">in and out of lockdown\n\n>I ain't got a job now\n\nThis part takes on new meaning post-COVID.",
                            "author": "Intrepid_Egg_7722",
                            "id": "gs32jlu",
                            "parent_id": "t1_gs21z8h",
                            "score": 3,
                            "created_utc": 1616614195.0,
                            "replies": []
                        },
                        {
                            "body": "\"Written and performed by Stevie Nicks\"",
                            "author": "ColdHeaux",
                            "id": "gs2mrtb",
                            "parent_id": "t1_gs21z8h",
                            "score": 0,
                            "created_utc": 1616607596.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Talk to him 😂😂",
            "author": "BigBearSD",
            "id": "gs22015",
            "parent_id": "t1_gs20kj2",
            "score": 1,
            "created_utc": 1616598915.0,
            "replies": []
        },
        {
            "body": "I read this in singsong as soon as I started lol thanks for the throwback",
            "author": null,
            "id": "gs2giqp",
            "parent_id": "t1_gs20kj2",
            "score": 1,
            "created_utc": 1616604963.0,
            "replies": []
        },
        {
            "body": "because people spend to much time on internet (guilty as accusing...lol) and even just texting instead of talking.  \n\ntechnology has definitely hindered human interaction / communication.",
            "author": "Buckeyechamp21",
            "id": "gs2yg0x",
            "parent_id": "t1_gs2iv4k",
            "score": 1,
            "created_utc": 1616612505.0,
            "replies": []
        },
        {
            "body": "Im not sure if you were being serious or joking, but thats probably because most young people have actually forgot that the phone in their pocket was originally designed for talking to people, not texting/snapping or gramming. It boggles my mind how many younger women are actually afraid of talking on the phone, because they actually have to talk and have a conversation. I fear that one day people will not know how to talk to each other with actual conversation.",
            "author": null,
            "id": "gs408o6",
            "parent_id": "t1_gs2iv4k",
            "score": 1,
            "created_utc": 1616629247.0,
            "replies": [
                {
                    "body": "I was mostly kidding but I know where you’re coming from. Before entering this lifestyle I hated talking on the phones or even to people outside of my friends + family in general. It was so bad that I could barely order food at restaurants... But now I’m much more comfortable with calls and I’d honestly prefer them for talking to my SD. \n\nBoth forms of communication serve a purpose; texting is much easier for quick conversations or lighter subjects  whereas calls work better for deep, lengthy conversations. \n\nRegardless of your preferred communication method, I 100% agree that having conversations is the easiest way to solve many of the issues we see on this forum and I wish that people my age weren’t so call-avoidant.",
                    "author": "curly_spice",
                    "id": "gs437xl",
                    "parent_id": "t1_gs408o6",
                    "score": 1,
                    "created_utc": 1616630698.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "This is super dismissive of how women have been conditioned their whole lives. You don't question. You don't rock the boat. And you certainly don't do either of those with a man in authority. You don't have conversations that could make the other party uncomfortable. Basically anything that would change the status quo. With these younger women who haven't had a lot of opportunities to set firm boundaries with a person much older/with much more perceived power, that's *terrifying*. Even if you think it's a simple conversation, it may not be from her perspective. If you don't like it, you can scroll.",
            "author": "missthingmariah",
            "id": "gs2wqfo",
            "parent_id": "t1_gs23b0x",
            "score": 9,
            "created_utc": 1616611805.0,
            "replies": []
        },
        {
            "body": ">how is talking to someone honestly so hard. \n\nYou’ve never found broaching a sensitive topic to be uncomfortable? You’ve never consulted with another person how to handle a conversation? You’ve never asked for feedback on a “what would you do?” scenario? \n\nIsn’t feedback, advice, getting a different perspective one of the benefits of a sugar subreddit?",
            "author": "uniballSD",
            "id": "gs2ll4f",
            "parent_id": "t1_gs23b0x",
            "score": 7,
            "created_utc": 1616607093.0,
            "replies": [
                {
                    "body": "I mean I like seeing others perspectives in general.  And ive vented telling my experience and did take into account what people said (well i chose not to listen to good advice ;-) )\n\nBut point of OP is on obvious simple stuff that most likely would be a 2 min convo with SR partner.  And yeah random strangers on internet with limited facts or context most likely going to make things worse majority of times.  As yes a few generally lend good advice; but most commenters just responding with their same agenda points imho.\n\nNow I do have a subset of folks on here; even one SB who we have become pretty close friends irl after she DM me, all be it remote as different states.  And yes we trust each other and we were in similar situations with our last Srs so we helped each other more like dual therapists...lol",
                    "author": "Buckeyechamp21",
                    "id": "gs2qd3b",
                    "parent_id": "t1_gs2ll4f",
                    "score": 0,
                    "created_utc": 1616609113.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Because if things go wrong we lose our rent lol",
            "author": "ColdHeaux",
            "id": "gs2n4xo",
            "parent_id": "t1_gs23b0x",
            "score": 3,
            "created_utc": 1616607751.0,
            "replies": [
                {
                    "body": "than you have the wrong SD to begin with imho.",
                    "author": "Buckeyechamp21",
                    "id": "gs2pbmd",
                    "parent_id": "t1_gs2n4xo",
                    "score": 2,
                    "created_utc": 1616608671.0,
                    "replies": [
                        {
                            "body": "I'm not talking about me. I'm just saying, esp for new and inexperienced SBs, it's a concern. Women ask each other for relationship advice all the time- why would SBs be any different honestly?",
                            "author": "ColdHeaux",
                            "id": "gs34i8p",
                            "parent_id": "t1_gs2pbmd",
                            "score": 2,
                            "created_utc": 1616615007.0,
                            "replies": []
                        },
                        {
                            "body": "Plus sometimes SD perspectives are really useful for us and we can get unexpected insights.",
                            "author": "ColdHeaux",
                            "id": "gs34lxk",
                            "parent_id": "t1_gs2pbmd",
                            "score": 2,
                            "created_utc": 1616615052.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "No one is “forced” to do anything, but as a sugar baby (who is likely doing it in part for the money), the power dynamic is completely different.",
            "author": "zara_io",
            "id": "gs4g9gm",
            "parent_id": "t1_gs462ob",
            "score": 5,
            "created_utc": 1616637136.0,
            "replies": [
                {
                    "body": "beautiful young women have their pick of who to date compared to paunchy middle aged and older men who want to cling to any scrap of youth, so you're right, the power is completely unbalanced.",
                    "author": "sucRoseToTheOccasion",
                    "id": "gs4vi59",
                    "parent_id": "t1_gs4g9gm",
                    "score": 0,
                    "created_utc": 1616645803.0,
                    "replies": []
                },
                {
                    "body": "depends on if the big head or little head is at the helm.............. and to whom the SB is sending the message..............",
                    "author": "pinotandsugar",
                    "id": "gs4rfed",
                    "parent_id": "t1_gs4g9gm",
                    "score": 1,
                    "created_utc": 1616643255.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "To be fair, this isn't about u/Boston_Prof age preference in SBs. This is about the many posts we see on SLF from younger, less mature and less experienced women. They are in the bowl too.",
            "author": "BinghamtonSD",
            "id": "gs2jtsz",
            "parent_id": "t1_gs2brh1",
            "score": 10,
            "created_utc": 1616606353.0,
            "replies": [
                {
                    "body": "Right; my post was misleading when I said \"our SB's.\"  \"Our\" as in those who come to our humble sub.  My preference is older too.",
                    "author": null,
                    "id": "gs2p528",
                    "parent_id": "t1_gs2jtsz",
                    "score": 5,
                    "created_utc": 1616608595.0,
                    "replies": []
                },
                {
                    "body": "[removed]",
                    "author": null,
                    "id": "gs2kbpj",
                    "parent_id": "t1_gs2jtsz",
                    "score": -6,
                    "created_utc": 1616606563.0,
                    "replies": [
                        {
                            "body": "Ok but those girls still exist and still need help no matter how much you insult random SDs on here. They still can use some guidance by posting on here for advice. It's a pretty normal human thing to seek advice.",
                            "author": "ColdHeaux",
                            "id": "gs2mjb6",
                            "parent_id": "t1_gs2kbpj",
                            "score": 11,
                            "created_utc": 1616607497.0,
                            "replies": [
                                {
                                    "body": "If all sugar babies need help than it would make more sense for the sugar daddies to choose someone they match with best. To cut back on the drama of miscommunication. \n\nI'm not insulting them because they require someone to look perfect in order to sexually perform. It's the subconscious that controls that part of the body.",
                                    "author": "anonaccount202",
                                    "id": "gs2nzsx",
                                    "parent_id": "t1_gs2mjb6",
                                    "score": -5,
                                    "created_utc": 1616608113.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "Which again is not the point.  Women come here for help; most of us are happy to help. It should not be surprising that many SB's find it daunting or uncomfortable or confusing as to how to communicate effectively with a gentleman 20, 30, or 40 years older than they are.",
                            "author": null,
                            "id": "gs2pcvi",
                            "parent_id": "t1_gs2kbpj",
                            "score": 8,
                            "created_utc": 1616608685.0,
                            "replies": [
                                {
                                    "body": "And my point is if you want better communication you can choose someone older.",
                                    "author": "anonaccount202",
                                    "id": "gs2q0fu",
                                    "parent_id": "t1_gs2pcvi",
                                    "score": -3,
                                    "created_utc": 1616608964.0,
                                    "replies": []
                                },
                                {
                                    "body": "And my point is if you want better communication you can choose someone older.",
                                    "author": "anonaccount202",
                                    "id": "gs2q0fl",
                                    "parent_id": "t1_gs2pcvi",
                                    "score": -3,
                                    "created_utc": 1616608964.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": ">But you are too weak to handle any physical imperfections. So it's your fault you can't have emotionally fulfilling relationships.\n\nIf I wanted physical imperfections & women closer to my age, I would just vanilla date. No allowance needed 😜",
                            "author": null,
                            "id": "gs3zhfs",
                            "parent_id": "t1_gs2kbpj",
                            "score": 3,
                            "created_utc": 1616628875.0,
                            "replies": [
                                {
                                    "body": "I think it's obvious sugar daddies can't date in their own age range because of their sexual greed. I'd rather have a long term relationship with a man who's dick can work normally.",
                                    "author": "anonaccount202",
                                    "id": "gs4qhmq",
                                    "parent_id": "t1_gs3zhfs",
                                    "score": 3,
                                    "created_utc": 1616642700.0,
                                    "replies": [
                                        {
                                            "body": "Wait a minute you just contradicted yourself.   \n\nOne minute you said we don’t date men in our own age because of our sexual greed And the next minute our saying our dicks don’t work...?\n\nHow’s it going to have all the sexual greed with a nonworking dick?\n  \nHow about these are the reasons why I date younger women:  \n\n1. More adventurous in & out of the bedroom then the average 40 something woman\n\n2. Not stuck in their ways, actually still open minded\n\n3. Have the energy and stamina to go multiple rounds per night\n\n4. Still full of hopes and dreams, and aren’t bitter or jaded\n\n5 driven and motivated to succeed\n\n6. Have less emotional baggage from choosing the wrong men most of their lives",
                                            "author": null,
                                            "id": "gs742j5",
                                            "parent_id": "t1_gs4qhmq",
                                            "score": 0,
                                            "created_utc": 1616694851.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "Not sure what crowd you hang out with, but I know plenty of 16-24 year olds that know perfectly well how to communicate with people of all ages.\nthat includes my own kids, btw.",
                            "author": "dontcallmechristian",
                            "id": "gs2mw91",
                            "parent_id": "t1_gs2kbpj",
                            "score": -2,
                            "created_utc": 1616607648.0,
                            "replies": [
                                {
                                    "body": "Is your 16 yr old, as precocious as he or she is, facile enough to have a significant conversation about cash allowance for an intimate relationship, the use of birth control, etc., with a stranger who is 30 or 40 or 50 yrs his or her senior?  If so -- great!  If not, it would not be surprising nor reflect negatively upon your parenting acumen.",
                                    "author": null,
                                    "id": "gs2pnsv",
                                    "parent_id": "t1_gs2mw91",
                                    "score": 10,
                                    "created_utc": 1616608813.0,
                                    "replies": []
                                },
                                {
                                    "body": "The experience that comes with age is definitely beneficial though. That's why I'm proud to be an older sugar baby.",
                                    "author": "anonaccount202",
                                    "id": "gs2o793",
                                    "parent_id": "t1_gs2mw91",
                                    "score": 3,
                                    "created_utc": 1616608199.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "I did not start this thread to get in to a huge pissing match. \n\nMany SDs prefer younger, many don't.\n\nMy sweet spot is after the age he mentioned up to early 40s-ish.  Essentially someone out of my leauge but vanilla dating type but with help. But there is wiggle room depending on maturity and yes communication. But communication is a key factor in who I go for. But people like what they like. That's their perogative.",
                            "author": "BigBearSD",
                            "id": "gs2lzj9",
                            "parent_id": "t1_gs2kbpj",
                            "score": -1,
                            "created_utc": 1616607263.0,
                            "replies": [
                                {
                                    "body": "And it's my perogative to judge someone for not being able to form a relationship with someone unless they look good enough. That's on the sugar daddy. If they want someone who can communicate better they can have that at the sacrifice of having someone older & more stretch mark covered. It's not on me that these so called daddys are too prissy to choose that option.",
                                    "author": "anonaccount202",
                                    "id": "gs2nn3z",
                                    "parent_id": "t1_gs2lzj9",
                                    "score": -2,
                                    "created_utc": 1616607964.0,
                                    "replies": [
                                        {
                                            "body": "Speak for yourself hun, 40 and zero stretch marks here.  And stop whining just because they don't go for older, but maybe your attitude is whats keeping them from picking you?",
                                            "author": "sinvortex",
                                            "id": "gs2wgj7",
                                            "parent_id": "t1_gs2nn3z",
                                            "score": 6,
                                            "created_utc": 1616611690.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "I have dated \"older\" women in this lifestyle that looked stunning and didn't have stretch marks.\n\nAlso, in regards to your comment, there are many younger SBs who can communicate well, maybe not most, but plenty of them exist.\n\nMay I ask, are you jaded because you are having a harder time finding an SD?",
                                            "author": "BigBearSD",
                                            "id": "gs2plau",
                                            "parent_id": "t1_gs2nn3z",
                                            "score": 5,
                                            "created_utc": 1616608784.0,
                                            "replies": [
                                                {
                                                    "body": "oh yeah, my ex sgf was 35 yo with a daughter and still stunning and would line her up against any 22 yo SB in the world.  And she showed me younger pictures when she was \"thinner\" and yeah maybe 10 -15 lbs heavier but it went to all the right places and she looked better to me at 35 than she did in her late 20's when modeled.\n\nobviously everyone has different tastes.\n\nBut she was defiantly a woman and not a girl.  But she still seemed to have issues communicating or trying to spin things in fear \"she would get fired\" or I would dump her if she was 100 pct honest.  Which never would have happened.  And what caused first breakup was me finding out about major lies ....not what she was lying about.  And yes multiple breakups and the last straw was yet another lie/omission.  So got to point could never really trust her in the future.\n\nSo I really think its that dynamic over age/maturity.",
                                                    "author": "Buckeyechamp21",
                                                    "id": "gs2x8ca",
                                                    "parent_id": "t1_gs2plau",
                                                    "score": 6,
                                                    "created_utc": 1616612009.0,
                                                    "replies": []
                                                },
                                                {
                                                    "body": ">May I ask, are you jaded because you are having a harder time finding an SD?\n\nYea",
                                                    "author": "anonaccount202",
                                                    "id": "gs2ytyn",
                                                    "parent_id": "t1_gs2plau",
                                                    "score": 0,
                                                    "created_utc": 1616612667.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Which isn't the point -- my point is that especially younger women need help with the communications.  Which is why they come here asking for help.\n\nWhen I said \"our SB's\" I meant the ones coming here to SLF.  My SB is older than that.",
            "author": null,
            "id": "gs2oyu2",
            "parent_id": "t1_gs2brh1",
            "score": 9,
            "created_utc": 1616608521.0,
            "replies": []
        },
        {
            "body": ">Not all sugar babies are in that age range. If you want better communication try going after someone older if you think you are tough & manly enough to handle seeing stretch marks.\n\nno, but probably 90% of them are.\n\nAge has no correlation with communication, my 19 year old SB was a way better communicator then my 34 year old ex GF. So please dont look down on people for choosing a relationship with someone younger. The term Sugar Daddy has been around 100 years and has always referred to someone who dated and financially cared for a younger woman. \n\nAlso this post isnt about complaining about young SB not being able to communicate, its about telling young SB to just talk to their SD rather than has what should I do.",
            "author": null,
            "id": "gs3z4tt",
            "parent_id": "t1_gs2brh1",
            "score": 2,
            "created_utc": 1616628705.0,
            "replies": [
                {
                    "body": "I've had so many sugar daddy's tell me that so many women offer what I do but are way younger and better looking. Just feels like that's all sugar daddy's want.",
                    "author": "anonaccount202",
                    "id": "gs40ii6",
                    "parent_id": "t1_gs3z4tt",
                    "score": 2,
                    "created_utc": 1616629381.0,
                    "replies": [
                        {
                            "body": "well think of it this way, when you were younger and hotter, you got to pick any man you wanted to sleep with, most men regardless of their looks unless they were top 5%, have had to take whatever they could get. Thats why it was always called getting lucky if a guy hooks up with a girl. Women do the choosing.\n\nSugar daddies now have the same privilege that the young beautiful women had while they were growing up. Imagine if you will, now having the ability to chose who you want to sleep with, and having lots of choices. Sugar dating reverses the roles, and puts the man in the position that women have enjoyed most of their lives.\n\nUnfortunately that means given the choice, most guys are going to choose younger, especially if an allowance is going to be involved. Now if you're just looking to date an older wealthy man, im sure many SD would gladly date you. But from what Ive seen only exceptionally beautiful, well kept in shape women that are older end up making it as SB and having successful SR, not just short term arrangments.",
                            "author": null,
                            "id": "gs43chs",
                            "parent_id": "t1_gs40ii6",
                            "score": 2,
                            "created_utc": 1616630761.0,
                            "replies": [
                                {
                                    "body": "I guess I'm not that good looking or something because I couldn't find it when I was young and figured it would get easier as I gained experience and learned what men want.",
                                    "author": "anonaccount202",
                                    "id": "gs4548l",
                                    "parent_id": "t1_gs43chs",
                                    "score": 1,
                                    "created_utc": 1616631625.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Everyone's different. If we start shaming people for asking their questions, they will no longer ask, which is worse.",
            "author": "InnocentSweetTooth",
            "id": "gs38zvg",
            "parent_id": "t1_gs26khk",
            "score": 5,
            "created_utc": 1616616872.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gs21z8h",
            "parent_id": "t1_gs21ony",
            "score": 2,
            "created_utc": 1616598906.0,
            "replies": [
                {
                    "body": "thats coffee house open mic poetry right there.  \n\n&#x200B;\n\nsnaps of fingers",
                    "author": "Buckeyechamp21",
                    "id": "gs23mpn",
                    "parent_id": "t1_gs21z8h",
                    "score": 3,
                    "created_utc": 1616599602.0,
                    "replies": []
                },
                {
                    "body": ">in and out of lockdown\n\n>I ain't got a job now\n\nThis part takes on new meaning post-COVID.",
                    "author": "Intrepid_Egg_7722",
                    "id": "gs32jlu",
                    "parent_id": "t1_gs21z8h",
                    "score": 3,
                    "created_utc": 1616614195.0,
                    "replies": []
                },
                {
                    "body": "\"Written and performed by Stevie Nicks\"",
                    "author": "ColdHeaux",
                    "id": "gs2mrtb",
                    "parent_id": "t1_gs21z8h",
                    "score": 0,
                    "created_utc": 1616607596.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I was mostly kidding but I know where you’re coming from. Before entering this lifestyle I hated talking on the phones or even to people outside of my friends + family in general. It was so bad that I could barely order food at restaurants... But now I’m much more comfortable with calls and I’d honestly prefer them for talking to my SD. \n\nBoth forms of communication serve a purpose; texting is much easier for quick conversations or lighter subjects  whereas calls work better for deep, lengthy conversations. \n\nRegardless of your preferred communication method, I 100% agree that having conversations is the easiest way to solve many of the issues we see on this forum and I wish that people my age weren’t so call-avoidant.",
            "author": "curly_spice",
            "id": "gs437xl",
            "parent_id": "t1_gs408o6",
            "score": 1,
            "created_utc": 1616630698.0,
            "replies": []
        },
        {
            "body": "I mean I like seeing others perspectives in general.  And ive vented telling my experience and did take into account what people said (well i chose not to listen to good advice ;-) )\n\nBut point of OP is on obvious simple stuff that most likely would be a 2 min convo with SR partner.  And yeah random strangers on internet with limited facts or context most likely going to make things worse majority of times.  As yes a few generally lend good advice; but most commenters just responding with their same agenda points imho.\n\nNow I do have a subset of folks on here; even one SB who we have become pretty close friends irl after she DM me, all be it remote as different states.  And yes we trust each other and we were in similar situations with our last Srs so we helped each other more like dual therapists...lol",
            "author": "Buckeyechamp21",
            "id": "gs2qd3b",
            "parent_id": "t1_gs2ll4f",
            "score": 0,
            "created_utc": 1616609113.0,
            "replies": []
        },
        {
            "body": "than you have the wrong SD to begin with imho.",
            "author": "Buckeyechamp21",
            "id": "gs2pbmd",
            "parent_id": "t1_gs2n4xo",
            "score": 2,
            "created_utc": 1616608671.0,
            "replies": [
                {
                    "body": "I'm not talking about me. I'm just saying, esp for new and inexperienced SBs, it's a concern. Women ask each other for relationship advice all the time- why would SBs be any different honestly?",
                    "author": "ColdHeaux",
                    "id": "gs34i8p",
                    "parent_id": "t1_gs2pbmd",
                    "score": 2,
                    "created_utc": 1616615007.0,
                    "replies": []
                },
                {
                    "body": "Plus sometimes SD perspectives are really useful for us and we can get unexpected insights.",
                    "author": "ColdHeaux",
                    "id": "gs34lxk",
                    "parent_id": "t1_gs2pbmd",
                    "score": 2,
                    "created_utc": 1616615052.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "beautiful young women have their pick of who to date compared to paunchy middle aged and older men who want to cling to any scrap of youth, so you're right, the power is completely unbalanced.",
            "author": "sucRoseToTheOccasion",
            "id": "gs4vi59",
            "parent_id": "t1_gs4g9gm",
            "score": 0,
            "created_utc": 1616645803.0,
            "replies": []
        },
        {
            "body": "depends on if the big head or little head is at the helm.............. and to whom the SB is sending the message..............",
            "author": "pinotandsugar",
            "id": "gs4rfed",
            "parent_id": "t1_gs4g9gm",
            "score": 1,
            "created_utc": 1616643255.0,
            "replies": []
        },
        {
            "body": "Right; my post was misleading when I said \"our SB's.\"  \"Our\" as in those who come to our humble sub.  My preference is older too.",
            "author": null,
            "id": "gs2p528",
            "parent_id": "t1_gs2jtsz",
            "score": 5,
            "created_utc": 1616608595.0,
            "replies": []
        },
        {
            "body": "[removed]",
            "author": null,
            "id": "gs2kbpj",
            "parent_id": "t1_gs2jtsz",
            "score": -6,
            "created_utc": 1616606563.0,
            "replies": [
                {
                    "body": "Ok but those girls still exist and still need help no matter how much you insult random SDs on here. They still can use some guidance by posting on here for advice. It's a pretty normal human thing to seek advice.",
                    "author": "ColdHeaux",
                    "id": "gs2mjb6",
                    "parent_id": "t1_gs2kbpj",
                    "score": 11,
                    "created_utc": 1616607497.0,
                    "replies": [
                        {
                            "body": "If all sugar babies need help than it would make more sense for the sugar daddies to choose someone they match with best. To cut back on the drama of miscommunication. \n\nI'm not insulting them because they require someone to look perfect in order to sexually perform. It's the subconscious that controls that part of the body.",
                            "author": "anonaccount202",
                            "id": "gs2nzsx",
                            "parent_id": "t1_gs2mjb6",
                            "score": -5,
                            "created_utc": 1616608113.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Which again is not the point.  Women come here for help; most of us are happy to help. It should not be surprising that many SB's find it daunting or uncomfortable or confusing as to how to communicate effectively with a gentleman 20, 30, or 40 years older than they are.",
                    "author": null,
                    "id": "gs2pcvi",
                    "parent_id": "t1_gs2kbpj",
                    "score": 8,
                    "created_utc": 1616608685.0,
                    "replies": [
                        {
                            "body": "And my point is if you want better communication you can choose someone older.",
                            "author": "anonaccount202",
                            "id": "gs2q0fu",
                            "parent_id": "t1_gs2pcvi",
                            "score": -3,
                            "created_utc": 1616608964.0,
                            "replies": []
                        },
                        {
                            "body": "And my point is if you want better communication you can choose someone older.",
                            "author": "anonaccount202",
                            "id": "gs2q0fl",
                            "parent_id": "t1_gs2pcvi",
                            "score": -3,
                            "created_utc": 1616608964.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": ">But you are too weak to handle any physical imperfections. So it's your fault you can't have emotionally fulfilling relationships.\n\nIf I wanted physical imperfections & women closer to my age, I would just vanilla date. No allowance needed 😜",
                    "author": null,
                    "id": "gs3zhfs",
                    "parent_id": "t1_gs2kbpj",
                    "score": 3,
                    "created_utc": 1616628875.0,
                    "replies": [
                        {
                            "body": "I think it's obvious sugar daddies can't date in their own age range because of their sexual greed. I'd rather have a long term relationship with a man who's dick can work normally.",
                            "author": "anonaccount202",
                            "id": "gs4qhmq",
                            "parent_id": "t1_gs3zhfs",
                            "score": 3,
                            "created_utc": 1616642700.0,
                            "replies": [
                                {
                                    "body": "Wait a minute you just contradicted yourself.   \n\nOne minute you said we don’t date men in our own age because of our sexual greed And the next minute our saying our dicks don’t work...?\n\nHow’s it going to have all the sexual greed with a nonworking dick?\n  \nHow about these are the reasons why I date younger women:  \n\n1. More adventurous in & out of the bedroom then the average 40 something woman\n\n2. Not stuck in their ways, actually still open minded\n\n3. Have the energy and stamina to go multiple rounds per night\n\n4. Still full of hopes and dreams, and aren’t bitter or jaded\n\n5 driven and motivated to succeed\n\n6. Have less emotional baggage from choosing the wrong men most of their lives",
                                    "author": null,
                                    "id": "gs742j5",
                                    "parent_id": "t1_gs4qhmq",
                                    "score": 0,
                                    "created_utc": 1616694851.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Not sure what crowd you hang out with, but I know plenty of 16-24 year olds that know perfectly well how to communicate with people of all ages.\nthat includes my own kids, btw.",
                    "author": "dontcallmechristian",
                    "id": "gs2mw91",
                    "parent_id": "t1_gs2kbpj",
                    "score": -2,
                    "created_utc": 1616607648.0,
                    "replies": [
                        {
                            "body": "Is your 16 yr old, as precocious as he or she is, facile enough to have a significant conversation about cash allowance for an intimate relationship, the use of birth control, etc., with a stranger who is 30 or 40 or 50 yrs his or her senior?  If so -- great!  If not, it would not be surprising nor reflect negatively upon your parenting acumen.",
                            "author": null,
                            "id": "gs2pnsv",
                            "parent_id": "t1_gs2mw91",
                            "score": 10,
                            "created_utc": 1616608813.0,
                            "replies": []
                        },
                        {
                            "body": "The experience that comes with age is definitely beneficial though. That's why I'm proud to be an older sugar baby.",
                            "author": "anonaccount202",
                            "id": "gs2o793",
                            "parent_id": "t1_gs2mw91",
                            "score": 3,
                            "created_utc": 1616608199.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "I did not start this thread to get in to a huge pissing match. \n\nMany SDs prefer younger, many don't.\n\nMy sweet spot is after the age he mentioned up to early 40s-ish.  Essentially someone out of my leauge but vanilla dating type but with help. But there is wiggle room depending on maturity and yes communication. But communication is a key factor in who I go for. But people like what they like. That's their perogative.",
                    "author": "BigBearSD",
                    "id": "gs2lzj9",
                    "parent_id": "t1_gs2kbpj",
                    "score": -1,
                    "created_utc": 1616607263.0,
                    "replies": [
                        {
                            "body": "And it's my perogative to judge someone for not being able to form a relationship with someone unless they look good enough. That's on the sugar daddy. If they want someone who can communicate better they can have that at the sacrifice of having someone older & more stretch mark covered. It's not on me that these so called daddys are too prissy to choose that option.",
                            "author": "anonaccount202",
                            "id": "gs2nn3z",
                            "parent_id": "t1_gs2lzj9",
                            "score": -2,
                            "created_utc": 1616607964.0,
                            "replies": [
                                {
                                    "body": "Speak for yourself hun, 40 and zero stretch marks here.  And stop whining just because they don't go for older, but maybe your attitude is whats keeping them from picking you?",
                                    "author": "sinvortex",
                                    "id": "gs2wgj7",
                                    "parent_id": "t1_gs2nn3z",
                                    "score": 6,
                                    "created_utc": 1616611690.0,
                                    "replies": []
                                },
                                {
                                    "body": "I have dated \"older\" women in this lifestyle that looked stunning and didn't have stretch marks.\n\nAlso, in regards to your comment, there are many younger SBs who can communicate well, maybe not most, but plenty of them exist.\n\nMay I ask, are you jaded because you are having a harder time finding an SD?",
                                    "author": "BigBearSD",
                                    "id": "gs2plau",
                                    "parent_id": "t1_gs2nn3z",
                                    "score": 5,
                                    "created_utc": 1616608784.0,
                                    "replies": [
                                        {
                                            "body": "oh yeah, my ex sgf was 35 yo with a daughter and still stunning and would line her up against any 22 yo SB in the world.  And she showed me younger pictures when she was \"thinner\" and yeah maybe 10 -15 lbs heavier but it went to all the right places and she looked better to me at 35 than she did in her late 20's when modeled.\n\nobviously everyone has different tastes.\n\nBut she was defiantly a woman and not a girl.  But she still seemed to have issues communicating or trying to spin things in fear \"she would get fired\" or I would dump her if she was 100 pct honest.  Which never would have happened.  And what caused first breakup was me finding out about major lies ....not what she was lying about.  And yes multiple breakups and the last straw was yet another lie/omission.  So got to point could never really trust her in the future.\n\nSo I really think its that dynamic over age/maturity.",
                                            "author": "Buckeyechamp21",
                                            "id": "gs2x8ca",
                                            "parent_id": "t1_gs2plau",
                                            "score": 6,
                                            "created_utc": 1616612009.0,
                                            "replies": []
                                        },
                                        {
                                            "body": ">May I ask, are you jaded because you are having a harder time finding an SD?\n\nYea",
                                            "author": "anonaccount202",
                                            "id": "gs2ytyn",
                                            "parent_id": "t1_gs2plau",
                                            "score": 0,
                                            "created_utc": 1616612667.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I've had so many sugar daddy's tell me that so many women offer what I do but are way younger and better looking. Just feels like that's all sugar daddy's want.",
            "author": "anonaccount202",
            "id": "gs40ii6",
            "parent_id": "t1_gs3z4tt",
            "score": 2,
            "created_utc": 1616629381.0,
            "replies": [
                {
                    "body": "well think of it this way, when you were younger and hotter, you got to pick any man you wanted to sleep with, most men regardless of their looks unless they were top 5%, have had to take whatever they could get. Thats why it was always called getting lucky if a guy hooks up with a girl. Women do the choosing.\n\nSugar daddies now have the same privilege that the young beautiful women had while they were growing up. Imagine if you will, now having the ability to chose who you want to sleep with, and having lots of choices. Sugar dating reverses the roles, and puts the man in the position that women have enjoyed most of their lives.\n\nUnfortunately that means given the choice, most guys are going to choose younger, especially if an allowance is going to be involved. Now if you're just looking to date an older wealthy man, im sure many SD would gladly date you. But from what Ive seen only exceptionally beautiful, well kept in shape women that are older end up making it as SB and having successful SR, not just short term arrangments.",
                    "author": null,
                    "id": "gs43chs",
                    "parent_id": "t1_gs40ii6",
                    "score": 2,
                    "created_utc": 1616630761.0,
                    "replies": [
                        {
                            "body": "I guess I'm not that good looking or something because I couldn't find it when I was young and figured it would get easier as I gained experience and learned what men want.",
                            "author": "anonaccount202",
                            "id": "gs4548l",
                            "parent_id": "t1_gs43chs",
                            "score": 1,
                            "created_utc": 1616631625.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "thats coffee house open mic poetry right there.  \n\n&#x200B;\n\nsnaps of fingers",
            "author": "Buckeyechamp21",
            "id": "gs23mpn",
            "parent_id": "t1_gs21z8h",
            "score": 3,
            "created_utc": 1616599602.0,
            "replies": []
        },
        {
            "body": ">in and out of lockdown\n\n>I ain't got a job now\n\nThis part takes on new meaning post-COVID.",
            "author": "Intrepid_Egg_7722",
            "id": "gs32jlu",
            "parent_id": "t1_gs21z8h",
            "score": 3,
            "created_utc": 1616614195.0,
            "replies": []
        },
        {
            "body": "\"Written and performed by Stevie Nicks\"",
            "author": "ColdHeaux",
            "id": "gs2mrtb",
            "parent_id": "t1_gs21z8h",
            "score": 0,
            "created_utc": 1616607596.0,
            "replies": []
        },
        {
            "body": "I'm not talking about me. I'm just saying, esp for new and inexperienced SBs, it's a concern. Women ask each other for relationship advice all the time- why would SBs be any different honestly?",
            "author": "ColdHeaux",
            "id": "gs34i8p",
            "parent_id": "t1_gs2pbmd",
            "score": 2,
            "created_utc": 1616615007.0,
            "replies": []
        },
        {
            "body": "Plus sometimes SD perspectives are really useful for us and we can get unexpected insights.",
            "author": "ColdHeaux",
            "id": "gs34lxk",
            "parent_id": "t1_gs2pbmd",
            "score": 2,
            "created_utc": 1616615052.0,
            "replies": []
        },
        {
            "body": "Ok but those girls still exist and still need help no matter how much you insult random SDs on here. They still can use some guidance by posting on here for advice. It's a pretty normal human thing to seek advice.",
            "author": "ColdHeaux",
            "id": "gs2mjb6",
            "parent_id": "t1_gs2kbpj",
            "score": 11,
            "created_utc": 1616607497.0,
            "replies": [
                {
                    "body": "If all sugar babies need help than it would make more sense for the sugar daddies to choose someone they match with best. To cut back on the drama of miscommunication. \n\nI'm not insulting them because they require someone to look perfect in order to sexually perform. It's the subconscious that controls that part of the body.",
                    "author": "anonaccount202",
                    "id": "gs2nzsx",
                    "parent_id": "t1_gs2mjb6",
                    "score": -5,
                    "created_utc": 1616608113.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Which again is not the point.  Women come here for help; most of us are happy to help. It should not be surprising that many SB's find it daunting or uncomfortable or confusing as to how to communicate effectively with a gentleman 20, 30, or 40 years older than they are.",
            "author": null,
            "id": "gs2pcvi",
            "parent_id": "t1_gs2kbpj",
            "score": 8,
            "created_utc": 1616608685.0,
            "replies": [
                {
                    "body": "And my point is if you want better communication you can choose someone older.",
                    "author": "anonaccount202",
                    "id": "gs2q0fu",
                    "parent_id": "t1_gs2pcvi",
                    "score": -3,
                    "created_utc": 1616608964.0,
                    "replies": []
                },
                {
                    "body": "And my point is if you want better communication you can choose someone older.",
                    "author": "anonaccount202",
                    "id": "gs2q0fl",
                    "parent_id": "t1_gs2pcvi",
                    "score": -3,
                    "created_utc": 1616608964.0,
                    "replies": []
                }
            ]
        },
        {
            "body": ">But you are too weak to handle any physical imperfections. So it's your fault you can't have emotionally fulfilling relationships.\n\nIf I wanted physical imperfections & women closer to my age, I would just vanilla date. No allowance needed 😜",
            "author": null,
            "id": "gs3zhfs",
            "parent_id": "t1_gs2kbpj",
            "score": 3,
            "created_utc": 1616628875.0,
            "replies": [
                {
                    "body": "I think it's obvious sugar daddies can't date in their own age range because of their sexual greed. I'd rather have a long term relationship with a man who's dick can work normally.",
                    "author": "anonaccount202",
                    "id": "gs4qhmq",
                    "parent_id": "t1_gs3zhfs",
                    "score": 3,
                    "created_utc": 1616642700.0,
                    "replies": [
                        {
                            "body": "Wait a minute you just contradicted yourself.   \n\nOne minute you said we don’t date men in our own age because of our sexual greed And the next minute our saying our dicks don’t work...?\n\nHow’s it going to have all the sexual greed with a nonworking dick?\n  \nHow about these are the reasons why I date younger women:  \n\n1. More adventurous in & out of the bedroom then the average 40 something woman\n\n2. Not stuck in their ways, actually still open minded\n\n3. Have the energy and stamina to go multiple rounds per night\n\n4. Still full of hopes and dreams, and aren’t bitter or jaded\n\n5 driven and motivated to succeed\n\n6. Have less emotional baggage from choosing the wrong men most of their lives",
                            "author": null,
                            "id": "gs742j5",
                            "parent_id": "t1_gs4qhmq",
                            "score": 0,
                            "created_utc": 1616694851.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Not sure what crowd you hang out with, but I know plenty of 16-24 year olds that know perfectly well how to communicate with people of all ages.\nthat includes my own kids, btw.",
            "author": "dontcallmechristian",
            "id": "gs2mw91",
            "parent_id": "t1_gs2kbpj",
            "score": -2,
            "created_utc": 1616607648.0,
            "replies": [
                {
                    "body": "Is your 16 yr old, as precocious as he or she is, facile enough to have a significant conversation about cash allowance for an intimate relationship, the use of birth control, etc., with a stranger who is 30 or 40 or 50 yrs his or her senior?  If so -- great!  If not, it would not be surprising nor reflect negatively upon your parenting acumen.",
                    "author": null,
                    "id": "gs2pnsv",
                    "parent_id": "t1_gs2mw91",
                    "score": 10,
                    "created_utc": 1616608813.0,
                    "replies": []
                },
                {
                    "body": "The experience that comes with age is definitely beneficial though. That's why I'm proud to be an older sugar baby.",
                    "author": "anonaccount202",
                    "id": "gs2o793",
                    "parent_id": "t1_gs2mw91",
                    "score": 3,
                    "created_utc": 1616608199.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I did not start this thread to get in to a huge pissing match. \n\nMany SDs prefer younger, many don't.\n\nMy sweet spot is after the age he mentioned up to early 40s-ish.  Essentially someone out of my leauge but vanilla dating type but with help. But there is wiggle room depending on maturity and yes communication. But communication is a key factor in who I go for. But people like what they like. That's their perogative.",
            "author": "BigBearSD",
            "id": "gs2lzj9",
            "parent_id": "t1_gs2kbpj",
            "score": -1,
            "created_utc": 1616607263.0,
            "replies": [
                {
                    "body": "And it's my perogative to judge someone for not being able to form a relationship with someone unless they look good enough. That's on the sugar daddy. If they want someone who can communicate better they can have that at the sacrifice of having someone older & more stretch mark covered. It's not on me that these so called daddys are too prissy to choose that option.",
                    "author": "anonaccount202",
                    "id": "gs2nn3z",
                    "parent_id": "t1_gs2lzj9",
                    "score": -2,
                    "created_utc": 1616607964.0,
                    "replies": [
                        {
                            "body": "Speak for yourself hun, 40 and zero stretch marks here.  And stop whining just because they don't go for older, but maybe your attitude is whats keeping them from picking you?",
                            "author": "sinvortex",
                            "id": "gs2wgj7",
                            "parent_id": "t1_gs2nn3z",
                            "score": 6,
                            "created_utc": 1616611690.0,
                            "replies": []
                        },
                        {
                            "body": "I have dated \"older\" women in this lifestyle that looked stunning and didn't have stretch marks.\n\nAlso, in regards to your comment, there are many younger SBs who can communicate well, maybe not most, but plenty of them exist.\n\nMay I ask, are you jaded because you are having a harder time finding an SD?",
                            "author": "BigBearSD",
                            "id": "gs2plau",
                            "parent_id": "t1_gs2nn3z",
                            "score": 5,
                            "created_utc": 1616608784.0,
                            "replies": [
                                {
                                    "body": "oh yeah, my ex sgf was 35 yo with a daughter and still stunning and would line her up against any 22 yo SB in the world.  And she showed me younger pictures when she was \"thinner\" and yeah maybe 10 -15 lbs heavier but it went to all the right places and she looked better to me at 35 than she did in her late 20's when modeled.\n\nobviously everyone has different tastes.\n\nBut she was defiantly a woman and not a girl.  But she still seemed to have issues communicating or trying to spin things in fear \"she would get fired\" or I would dump her if she was 100 pct honest.  Which never would have happened.  And what caused first breakup was me finding out about major lies ....not what she was lying about.  And yes multiple breakups and the last straw was yet another lie/omission.  So got to point could never really trust her in the future.\n\nSo I really think its that dynamic over age/maturity.",
                                    "author": "Buckeyechamp21",
                                    "id": "gs2x8ca",
                                    "parent_id": "t1_gs2plau",
                                    "score": 6,
                                    "created_utc": 1616612009.0,
                                    "replies": []
                                },
                                {
                                    "body": ">May I ask, are you jaded because you are having a harder time finding an SD?\n\nYea",
                                    "author": "anonaccount202",
                                    "id": "gs2ytyn",
                                    "parent_id": "t1_gs2plau",
                                    "score": 0,
                                    "created_utc": 1616612667.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "well think of it this way, when you were younger and hotter, you got to pick any man you wanted to sleep with, most men regardless of their looks unless they were top 5%, have had to take whatever they could get. Thats why it was always called getting lucky if a guy hooks up with a girl. Women do the choosing.\n\nSugar daddies now have the same privilege that the young beautiful women had while they were growing up. Imagine if you will, now having the ability to chose who you want to sleep with, and having lots of choices. Sugar dating reverses the roles, and puts the man in the position that women have enjoyed most of their lives.\n\nUnfortunately that means given the choice, most guys are going to choose younger, especially if an allowance is going to be involved. Now if you're just looking to date an older wealthy man, im sure many SD would gladly date you. But from what Ive seen only exceptionally beautiful, well kept in shape women that are older end up making it as SB and having successful SR, not just short term arrangments.",
            "author": null,
            "id": "gs43chs",
            "parent_id": "t1_gs40ii6",
            "score": 2,
            "created_utc": 1616630761.0,
            "replies": [
                {
                    "body": "I guess I'm not that good looking or something because I couldn't find it when I was young and figured it would get easier as I gained experience and learned what men want.",
                    "author": "anonaccount202",
                    "id": "gs4548l",
                    "parent_id": "t1_gs43chs",
                    "score": 1,
                    "created_utc": 1616631625.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "If all sugar babies need help than it would make more sense for the sugar daddies to choose someone they match with best. To cut back on the drama of miscommunication. \n\nI'm not insulting them because they require someone to look perfect in order to sexually perform. It's the subconscious that controls that part of the body.",
            "author": "anonaccount202",
            "id": "gs2nzsx",
            "parent_id": "t1_gs2mjb6",
            "score": -5,
            "created_utc": 1616608113.0,
            "replies": []
        },
        {
            "body": "And my point is if you want better communication you can choose someone older.",
            "author": "anonaccount202",
            "id": "gs2q0fu",
            "parent_id": "t1_gs2pcvi",
            "score": -3,
            "created_utc": 1616608964.0,
            "replies": []
        },
        {
            "body": "And my point is if you want better communication you can choose someone older.",
            "author": "anonaccount202",
            "id": "gs2q0fl",
            "parent_id": "t1_gs2pcvi",
            "score": -3,
            "created_utc": 1616608964.0,
            "replies": []
        },
        {
            "body": "I think it's obvious sugar daddies can't date in their own age range because of their sexual greed. I'd rather have a long term relationship with a man who's dick can work normally.",
            "author": "anonaccount202",
            "id": "gs4qhmq",
            "parent_id": "t1_gs3zhfs",
            "score": 3,
            "created_utc": 1616642700.0,
            "replies": [
                {
                    "body": "Wait a minute you just contradicted yourself.   \n\nOne minute you said we don’t date men in our own age because of our sexual greed And the next minute our saying our dicks don’t work...?\n\nHow’s it going to have all the sexual greed with a nonworking dick?\n  \nHow about these are the reasons why I date younger women:  \n\n1. More adventurous in & out of the bedroom then the average 40 something woman\n\n2. Not stuck in their ways, actually still open minded\n\n3. Have the energy and stamina to go multiple rounds per night\n\n4. Still full of hopes and dreams, and aren’t bitter or jaded\n\n5 driven and motivated to succeed\n\n6. Have less emotional baggage from choosing the wrong men most of their lives",
                    "author": null,
                    "id": "gs742j5",
                    "parent_id": "t1_gs4qhmq",
                    "score": 0,
                    "created_utc": 1616694851.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Is your 16 yr old, as precocious as he or she is, facile enough to have a significant conversation about cash allowance for an intimate relationship, the use of birth control, etc., with a stranger who is 30 or 40 or 50 yrs his or her senior?  If so -- great!  If not, it would not be surprising nor reflect negatively upon your parenting acumen.",
            "author": null,
            "id": "gs2pnsv",
            "parent_id": "t1_gs2mw91",
            "score": 10,
            "created_utc": 1616608813.0,
            "replies": []
        },
        {
            "body": "The experience that comes with age is definitely beneficial though. That's why I'm proud to be an older sugar baby.",
            "author": "anonaccount202",
            "id": "gs2o793",
            "parent_id": "t1_gs2mw91",
            "score": 3,
            "created_utc": 1616608199.0,
            "replies": []
        },
        {
            "body": "And it's my perogative to judge someone for not being able to form a relationship with someone unless they look good enough. That's on the sugar daddy. If they want someone who can communicate better they can have that at the sacrifice of having someone older & more stretch mark covered. It's not on me that these so called daddys are too prissy to choose that option.",
            "author": "anonaccount202",
            "id": "gs2nn3z",
            "parent_id": "t1_gs2lzj9",
            "score": -2,
            "created_utc": 1616607964.0,
            "replies": [
                {
                    "body": "Speak for yourself hun, 40 and zero stretch marks here.  And stop whining just because they don't go for older, but maybe your attitude is whats keeping them from picking you?",
                    "author": "sinvortex",
                    "id": "gs2wgj7",
                    "parent_id": "t1_gs2nn3z",
                    "score": 6,
                    "created_utc": 1616611690.0,
                    "replies": []
                },
                {
                    "body": "I have dated \"older\" women in this lifestyle that looked stunning and didn't have stretch marks.\n\nAlso, in regards to your comment, there are many younger SBs who can communicate well, maybe not most, but plenty of them exist.\n\nMay I ask, are you jaded because you are having a harder time finding an SD?",
                    "author": "BigBearSD",
                    "id": "gs2plau",
                    "parent_id": "t1_gs2nn3z",
                    "score": 5,
                    "created_utc": 1616608784.0,
                    "replies": [
                        {
                            "body": "oh yeah, my ex sgf was 35 yo with a daughter and still stunning and would line her up against any 22 yo SB in the world.  And she showed me younger pictures when she was \"thinner\" and yeah maybe 10 -15 lbs heavier but it went to all the right places and she looked better to me at 35 than she did in her late 20's when modeled.\n\nobviously everyone has different tastes.\n\nBut she was defiantly a woman and not a girl.  But she still seemed to have issues communicating or trying to spin things in fear \"she would get fired\" or I would dump her if she was 100 pct honest.  Which never would have happened.  And what caused first breakup was me finding out about major lies ....not what she was lying about.  And yes multiple breakups and the last straw was yet another lie/omission.  So got to point could never really trust her in the future.\n\nSo I really think its that dynamic over age/maturity.",
                            "author": "Buckeyechamp21",
                            "id": "gs2x8ca",
                            "parent_id": "t1_gs2plau",
                            "score": 6,
                            "created_utc": 1616612009.0,
                            "replies": []
                        },
                        {
                            "body": ">May I ask, are you jaded because you are having a harder time finding an SD?\n\nYea",
                            "author": "anonaccount202",
                            "id": "gs2ytyn",
                            "parent_id": "t1_gs2plau",
                            "score": 0,
                            "created_utc": 1616612667.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I guess I'm not that good looking or something because I couldn't find it when I was young and figured it would get easier as I gained experience and learned what men want.",
            "author": "anonaccount202",
            "id": "gs4548l",
            "parent_id": "t1_gs43chs",
            "score": 1,
            "created_utc": 1616631625.0,
            "replies": []
        },
        {
            "body": "Wait a minute you just contradicted yourself.   \n\nOne minute you said we don’t date men in our own age because of our sexual greed And the next minute our saying our dicks don’t work...?\n\nHow’s it going to have all the sexual greed with a nonworking dick?\n  \nHow about these are the reasons why I date younger women:  \n\n1. More adventurous in & out of the bedroom then the average 40 something woman\n\n2. Not stuck in their ways, actually still open minded\n\n3. Have the energy and stamina to go multiple rounds per night\n\n4. Still full of hopes and dreams, and aren’t bitter or jaded\n\n5 driven and motivated to succeed\n\n6. Have less emotional baggage from choosing the wrong men most of their lives",
            "author": null,
            "id": "gs742j5",
            "parent_id": "t1_gs4qhmq",
            "score": 0,
            "created_utc": 1616694851.0,
            "replies": []
        },
        {
            "body": "Speak for yourself hun, 40 and zero stretch marks here.  And stop whining just because they don't go for older, but maybe your attitude is whats keeping them from picking you?",
            "author": "sinvortex",
            "id": "gs2wgj7",
            "parent_id": "t1_gs2nn3z",
            "score": 6,
            "created_utc": 1616611690.0,
            "replies": []
        },
        {
            "body": "I have dated \"older\" women in this lifestyle that looked stunning and didn't have stretch marks.\n\nAlso, in regards to your comment, there are many younger SBs who can communicate well, maybe not most, but plenty of them exist.\n\nMay I ask, are you jaded because you are having a harder time finding an SD?",
            "author": "BigBearSD",
            "id": "gs2plau",
            "parent_id": "t1_gs2nn3z",
            "score": 5,
            "created_utc": 1616608784.0,
            "replies": [
                {
                    "body": "oh yeah, my ex sgf was 35 yo with a daughter and still stunning and would line her up against any 22 yo SB in the world.  And she showed me younger pictures when she was \"thinner\" and yeah maybe 10 -15 lbs heavier but it went to all the right places and she looked better to me at 35 than she did in her late 20's when modeled.\n\nobviously everyone has different tastes.\n\nBut she was defiantly a woman and not a girl.  But she still seemed to have issues communicating or trying to spin things in fear \"she would get fired\" or I would dump her if she was 100 pct honest.  Which never would have happened.  And what caused first breakup was me finding out about major lies ....not what she was lying about.  And yes multiple breakups and the last straw was yet another lie/omission.  So got to point could never really trust her in the future.\n\nSo I really think its that dynamic over age/maturity.",
                    "author": "Buckeyechamp21",
                    "id": "gs2x8ca",
                    "parent_id": "t1_gs2plau",
                    "score": 6,
                    "created_utc": 1616612009.0,
                    "replies": []
                },
                {
                    "body": ">May I ask, are you jaded because you are having a harder time finding an SD?\n\nYea",
                    "author": "anonaccount202",
                    "id": "gs2ytyn",
                    "parent_id": "t1_gs2plau",
                    "score": 0,
                    "created_utc": 1616612667.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "oh yeah, my ex sgf was 35 yo with a daughter and still stunning and would line her up against any 22 yo SB in the world.  And she showed me younger pictures when she was \"thinner\" and yeah maybe 10 -15 lbs heavier but it went to all the right places and she looked better to me at 35 than she did in her late 20's when modeled.\n\nobviously everyone has different tastes.\n\nBut she was defiantly a woman and not a girl.  But she still seemed to have issues communicating or trying to spin things in fear \"she would get fired\" or I would dump her if she was 100 pct honest.  Which never would have happened.  And what caused first breakup was me finding out about major lies ....not what she was lying about.  And yes multiple breakups and the last straw was yet another lie/omission.  So got to point could never really trust her in the future.\n\nSo I really think its that dynamic over age/maturity.",
            "author": "Buckeyechamp21",
            "id": "gs2x8ca",
            "parent_id": "t1_gs2plau",
            "score": 6,
            "created_utc": 1616612009.0,
            "replies": []
        },
        {
            "body": ">May I ask, are you jaded because you are having a harder time finding an SD?\n\nYea",
            "author": "anonaccount202",
            "id": "gs2ytyn",
            "parent_id": "t1_gs2plau",
            "score": 0,
            "created_utc": 1616612667.0,
            "replies": []
        }
    ]
}