{
    "title": "If you really have feels for your SD or SB, hug them. Hug the living shit out of them. Now. Don't wait.",
    "post_id": "8nn5jh",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/8nn5jh/if_you_really_have_feels_for_your_sd_or_sb_hug/",
    "author": "SDRippington",
    "body": "So my father passed away at the end of March which was pretty devastating. I had been seeing an SB that was an absolutely wonderful and beautiful human being. She would help anyone she could and never ask for anything in return. She was very supportive of me and I knew she would be there when I got back.\n\nSo I texted her while I was away - and then when I got back all I got was silence. Nothing. She never logged into SA or anything so I figured she might have gotten back with her ex. I gave her space, but I kept wondering. And honestly I wanted closure because I had very genuine, intense feelings for that woman.\n\nSo I start hunting for her online - only to find that she passed away. The news just hit me like a bus and I'm still kinda numb.\n\nWhat I wouldn't give to just see her smile, listen to her laugh and giggle just one more time. And hold her in my arms just once. \n\nSo - if you have an SR based on any amount of feelings - hug them, squeeze them so tight and kiss them, tell them you care for them - because you or they might be gone in an instant.\n\nAnd I can honestly guarantee, now from real experience, that someone will suddenly get a hole in their heart they have no idea how to fill. You can't talk to their family, you cannot reach out to anyone they knew because what you shared was very private, and very secret, and very loving in spite of the rest of the world around us. \n\nSo for fucks sake hug them. Now. \n\nEDIT: It's funny - that even though SR's are usually very private and very secret - that in today's day and age we have a support group like this - of just so many people on on Reddit and the \"side chats\" to share with - that I don't have to feel alone in my grief. Thank you all. I appreciate you.\n\nEDIT #2:\nThank you so very much for all the kind words and condolences. They mean a lot to me. She was one of those very rare people that when they come into your life that you are changed for the better forever having known them. \n\nLate last night I found a small crystalline rose cluster she made by hand and gave me as a gift the last time we were together. She was quite a talented artist. She always teased me for being a guy and liking sparkly and shiny things, even as she admired my dragon figurine collection of various pewter and handmade dragons; some of which have laser cuts and glint under the lights. \n\nSo I just now put that crystal rose under the claw of one of the most detailed dragons I have - her favorite one, and there it will forever stay. In a way I feel like it's symbolic of a dragon forever guarding her memory and her soul.",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/8nn5jh/if_you_really_have_feels_for_your_sd_or_sb_hug/",
    "score": 172,
    "upvote_ratio": 0.97,
    "created_utc": 1527809488.0,
    "num_comments": 54,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "I’m so sorry for your loss. I bet she would be so happy to know she made such a positive difference in your life. <3",
            "author": "nigeriansugarprinces",
            "id": "dzwrlot",
            "parent_id": "t3_8nn5jh",
            "score": 46,
            "created_utc": 1527810084.0,
            "replies": [
                {
                    "body": "> she made such a positive difference in your life\n\nI was going to highlight this. She was truly one of those people who cause those whose lives they touch to redefine their scale of what makes a beautiful, awesome person. \n\nI don't think I could ever _not_ measure and compare other people in my life to her memory. She pushed the bar way higher than I ever thought possible. \n\nIt's funny - she was _the one_ that made me only consider anyone older than 25+ because she was totally in tune with the world and had her shit _together_ more than anyone else I ever met at her age - and almost any other!",
                    "author": "SDRippington",
                    "id": "dzwtgvp",
                    "parent_id": "t1_dzwrlot",
                    "score": 28,
                    "created_utc": 1527812039.0,
                    "replies": [
                        {
                            "body": "I am absolutely sorry about this loss. I’m sure it’s such a shock that you never expected to happen. I send my condolences. If you need to chat I’m here anytime ",
                            "author": "tannedsb05",
                            "id": "dzxrtpc",
                            "parent_id": "t1_dzwtgvp",
                            "score": 5,
                            "created_utc": 1527858492.0,
                            "replies": []
                        },
                        {
                            "body": "I am absolutely sorry about this loss. I’m sure it’s such a shock that you never expected to happen. I send my condolences. If you need to chat I’m here anytime ",
                            "author": "tannedsb05",
                            "id": "dzxrvpx",
                            "parent_id": "t1_dzwtgvp",
                            "score": 6,
                            "created_utc": 1527858559.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "I sincerely could not say anything but awesome things about her. \n\nShe even made it a point to be \"exclusive\" to me, even though she didn't have to and I didn't expect her to. She was such a loving, caring, kind and beautiful woman. \n\nAnd my God, when she'd look at me and just smile (more of a knowing smirk, really) with those ice blue eyes when I was talking to her, it just made me always lose my train of thought and make me melt. She knew it, too and used it to her advantage. \n\nThe Universe can totally suck it right now. It leaves shitheads that hurt people alive and takes someone like her instead? Fuck the Universe. ",
                    "author": "SDRippington",
                    "id": "dzwsg0b",
                    "parent_id": "t1_dzwrlot",
                    "score": 24,
                    "created_utc": 1527810957.0,
                    "replies": [
                        {
                            "body": "That sucks so bad.  Even though your relationship was a secret you’ll always be able to treasure those memories and look back on how special it was. \n\nThe universe can be totally unjust and heartbreaking. ",
                            "author": "nigeriansugarprinces",
                            "id": "dzwssik",
                            "parent_id": "t1_dzwsg0b",
                            "score": 7,
                            "created_utc": 1527811322.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "SDR - thanks for your honesty, eloquence and character .....   World's a better place with you in it.  \n\n\n\nThe broadest shoulders are destined to carry the heaviest loads.......",
                    "author": "pinotandsugar",
                    "id": "dzz1aer",
                    "parent_id": "t1_dzwrlot",
                    "score": 3,
                    "created_utc": 1527902448.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I normally keep this to my self and have not shared my truth with anyone, maybe it may help your intended goal, with this post.\n\nSome years ago, I had to abruptly get back stateside, as three of my very dearly loved people \\(family but I don't want to get to deep into this\\) were involved in a terrible incident. The hospital staff told me that all three are terminal and that I should execute a DNR. Knowing the intense love for life and fear of loosing their lives, I refused and demanded a full code status. They pulled through the worst phase but it left all of them with multiple chronic organ impairments, they will have many complications and will eventually expire from all of the injuries.\n\nI also have an additional background in medicine and actually dropped out of med school, \\(many years ago for several reasons\\). With this, I decided to put my life on hold and set my company so that it can function without me. I asked all three what their wishes are and all wanted to LIVE so, I committed myself to delivering the best support and care possible. I converted my house into a mini hospital with all kinds of medical equipment, supplies and environment. Hired staff that  later fired, due to the fact that their idea of quality of life was not in line with each of my family's desire was. I buried myself back into studying and researching medicine, blessed as it comes easy to me, and did everything I could to prolong their lives and make it as enjoyable as possible. completely sacrificed my social life and separated myself from any distractions, while fighting with hospitalist that would perform in such a way that it endangered their extension of their lives even more.\n\nLong and short: the first had a less than 10&#37; chance of survival \\- I kept her alive for an additional 2 years and even though she was on a medical ventilator, I still managed to make her smile, multiple times, each and every day. Can't begin to describe how much I miss her.\n\nSecond; kept him alive for 4 years, fantastic practical joker and shared many laughs, even though I had to attend to regular medical emergencies with him, I discovered his response and reactions to meds so well, I knew what it would take to get him back into the safe zone. A few months ago, during my sleep I heard a loud crash and rushed to discover what it was. I found him contorted partially in the floor and up against some furniture. Quick assessment told me that he was in full arrest; I performed mouth to mouth and CPR for about 7 minutes before the EMT's arrived, they tried for and additionally 35 minutes \\(which is a very long time for EMT's\\), finally realized that it was time to call it. I still see the look on his face as he pulled another one of his practical jokes on me.\n\nThird; I have managed to barely keep her alive but even today had to deal with some very bad arrhythmias and sinus tach. finally got her back to a more normal rate and rhythm but now know enough about medicine that I try to blind myself from the truth that I will only have, hopefully, a few more months with my baby...\n\nAs the OP offered and in my own words: Those things you do today; will dictate the joys or regrets that you WILL experience tomorrow. HUG those who mean something to you!!!!!!!!!!!!!!",
            "author": null,
            "id": "dzwv3xy",
            "parent_id": "t3_8nn5jh",
            "score": 28,
            "created_utc": 1527813805.0,
            "replies": []
        },
        {
            "body": "Im sorry Rip. Damn thats so crazy youre the 3rd person Ive seen here thats sugar partner passed away. sending hugs ",
            "author": "grandmaSb",
            "id": "dzwtohb",
            "parent_id": "t3_8nn5jh",
            "score": 12,
            "created_utc": 1527812262.0,
            "replies": [
                {
                    "body": "Man it sucks even more that she was such an amazing person - inside and out. Like so much so I was seriously falling for that woman :-\\",
                    "author": "SDRippington",
                    "id": "dzwttl7",
                    "parent_id": "t1_dzwtohb",
                    "score": 7,
                    "created_utc": 1527812412.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "dzwrn0n",
            "parent_id": "t3_8nn5jh",
            "score": 17,
            "created_utc": 1527810122.0,
            "replies": [
                {
                    "body": "Nothing wrong with bro hugs",
                    "author": "girlz_are_42",
                    "id": "dzwvulv",
                    "parent_id": "t1_dzwrn0n",
                    "score": 6,
                    "created_utc": 1527814614.0,
                    "replies": []
                },
                {
                    "body": "Stop. I don't wanna cry. Would be really hard to explain to people around me why I'm bawling and shuddering like a child.",
                    "author": "SDRippington",
                    "id": "dzwsp9q",
                    "parent_id": "t1_dzwrn0n",
                    "score": 11,
                    "created_utc": 1527811229.0,
                    "replies": [
                        {
                            "body": "Bro, you owe no one an explanation for expressing your humanity. \n\nOver the past year or so I've been on SLF, your input has been spot on. For once, allow yourself to take from SLF instead of giving to it. \n\nEven in your sorrows, you continue to give to SLF. In less than 24hrs, I'll be dropping my SB off at the airport for a vacation of hers. I was going to give her a hug and a kiss goodbye. After reading this, I will be giving her the best hug and kiss goodbye she will accept.\n\nFuck. I'm nearly holding back tears at the thought of something happening to her. I can't fathom what you're going through. \n\nThere was an SB here who posted about whether she should attend the funeral of her SD some months ago. Of all of us, she may have the wisest words for you right now. If I find it, I'll message you.",
                            "author": "sdthrowaway006",
                            "id": "dzxfl9t",
                            "parent_id": "t1_dzwsp9q",
                            "score": 6,
                            "created_utc": 1527837054.0,
                            "replies": [
                                {
                                    "body": "> I'll be dropping my SB off at the airport for a vacation of hers. I was going to give her a hug and a kiss goodbye. After reading this, I will be giving her the best hug and kiss goodbye she will accept.\n\nGood advice I would hope everyone listens to and takes heed. \n\nHere I was missing her, thinking she just ghosted me and now i feel so ashamed and guilty for that. Yeah, people ghost in these relationships all the time, especially when what you share is very secret and isn't known to each others circle of friends. So when something happens - an old flame comes back, a new one is found, anything, inevitably the person may disappear. \n\nI just wanted to seek her out and just make sure she was happy, if not with me I just wanted her to be happy.\n\nI have a rather complex belief in the afterlife I've never shared here - so all I can hope for is that in whatever consciousness she might be in that she is happy as measured by the universe she is within. She deserves it.",
                                    "author": "SDRippington",
                                    "id": "dzxybsl",
                                    "parent_id": "t1_dzxfl9t",
                                    "score": 2,
                                    "created_utc": 1527865023.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "It's ok to cry. :( You've lost someone important to you that you genuinely cared a great deal about. Big hug bud. Hope you get the time to grieve properly.",
                            "author": "CJ3500",
                            "id": "dzwvdrb",
                            "parent_id": "t1_dzwsp9q",
                            "score": 6,
                            "created_utc": 1527814109.0,
                            "replies": [
                                {
                                    "body": "Oh I've cried, and will probably continue to do so from time to time - but hard to express those feelings in mixed company :-)\n\n\"Why you crying, man?\"\n\n\"My SB died\"\n\n\"What? Your USB died? Get a new motherboard, bro!\"\n\n<rolls eyes>",
                                    "author": "SDRippington",
                                    "id": "dzxq949",
                                    "parent_id": "t1_dzwvdrb",
                                    "score": 6,
                                    "created_utc": 1527856599.0,
                                    "replies": [
                                        {
                                            "body": "I guess my concern is more along the lines of you not having any time to grieve in private because you're stuck having to pretend nothing's wrong while putting on your public/socially acceptable face all the time at work or around friends and family. That sort of thing becomes a crushing weight after a while. I'm glad you feel you can talk to us on SLf about what's happened.",
                                            "author": "CJ3500",
                                            "id": "dzyuoiy",
                                            "parent_id": "t1_dzxq949",
                                            "score": 3,
                                            "created_utc": 1527894817.0,
                                            "replies": [
                                                {
                                                    "body": "As it happens I met her best friend in the park today - who incidentally sugared before as well. \n\nI knew my SB's best friend from almost 2 years before I met mine who passed away. She went \"out of the bowl\" back then as she went vanilla (and I wished her nothing but happiness), but I decided to tke the risk to text her and and ask about my SB and the circumstances around what happened. \n\nShe suddenly realized I was \"that guy\" my SB always talked about being with and was like \"OMG! It was YOU!?!\" and she dropped everything to meet with me. We talked and cried for hours because she hasn't been able to really grieve much either, as my SB's family pretty much ostracized all of her friends after she passed away.\n\nIt felt so good to share with someone in person what she was like in life and I feel so much better having been able to share everything with her best friend, and to everyone here as well.\n\nAll in all it was an okay Friday, all things considered.",
                                                    "author": "SDRippington",
                                                    "id": "dzyvkse",
                                                    "parent_id": "t1_dzyuoiy",
                                                    "score": 6,
                                                    "created_utc": 1527895799.0,
                                                    "replies": [
                                                        {
                                                            "body": "This whole thread and the bit you wrote about her gift and your little dragon statuette has me feeling all throat lumpy. I wish there was more I could do for you as an internet stranger but I'm really grateful for your presence here and that you could meet up with your SB's friend. Be good to yourself ok?",
                                                            "author": "CJ3500",
                                                            "id": "dzz1oxi",
                                                            "parent_id": "t1_dzyvkse",
                                                            "score": 4,
                                                            "created_utc": 1527902925.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Thank you for the kind words!\n\nI will definitely take care of myself :) As time goes on I will do all I can to honor her memory. She deserved the world.",
                                                                    "author": "SDRippington",
                                                                    "id": "dzz660j",
                                                                    "parent_id": "t1_dzz1oxi",
                                                                    "score": 5,
                                                                    "created_utc": 1527908393.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Holy crap man. This is by far the saddest post I've read on this subreddit by far and I'm truly at a loss for words. My heart goes out to you for your losses!",
            "author": "BadComboverDude",
            "id": "dzwsbrp",
            "parent_id": "t3_8nn5jh",
            "score": 13,
            "created_utc": 1527810833.0,
            "replies": [
                {
                    "body": "I appreciate that. Oh there have been sadder here, I assure you - but it just hurts all the same. \n\nI just keep wondering if I could have done more for her - and sadly I'll never know.",
                    "author": "SDRippington",
                    "id": "dzwsmwb",
                    "parent_id": "t1_dzwsbrp",
                    "score": 8,
                    "created_utc": 1527811160.0,
                    "replies": [
                        {
                            "body": "You have done much for her by impressing on all of us the need to let our sugars know how much they really mean to us!!",
                            "author": "ontherdagn",
                            "id": "dzylp5p",
                            "parent_id": "t1_dzwsmwb",
                            "score": 2,
                            "created_utc": 1527885537.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I'm so sorry for your loss. It sounds like she was an amazing woman, and she had a happy relationship with you. I'm sure you made a positive impact in her life just as she had in yours. However you decide to move forward, I hope you are well and can eventually heal a bit from this loss. ",
            "author": "bubbleteaplease",
            "id": "dzwuybv",
            "parent_id": "t3_8nn5jh",
            "score": 6,
            "created_utc": 1527813631.0,
            "replies": []
        },
        {
            "body": "Sending a heartfelt condolence. May her memories always bring you joy.",
            "author": "branchofwhiteacacia",
            "id": "dzwtl6x",
            "parent_id": "t3_8nn5jh",
            "score": 4,
            "created_utc": 1527812165.0,
            "replies": []
        },
        {
            "body": "That's so deep. I'm so sorry to hear. ",
            "author": null,
            "id": "dzwuiw3",
            "parent_id": "t3_8nn5jh",
            "score": 4,
            "created_utc": 1527813156.0,
            "replies": []
        },
        {
            "body": "You really brought tears to my eyes with this post. I'm sorry for your loss and hope that you are able to find solace in the fond memories you have of her. Our body may wither and go but our heart and soul lives on in the memories of those we have made an impact on. Sending you a great big hug! ",
            "author": "Ma1inka",
            "id": "dzwvyul",
            "parent_id": "t3_8nn5jh",
            "score": 4,
            "created_utc": 1527814741.0,
            "replies": []
        },
        {
            "body": "I'm really sorry for your loss, Rip.  Thank you for sharing; you DO have support here!!",
            "author": null,
            "id": "dzwx81v",
            "parent_id": "t3_8nn5jh",
            "score": 4,
            "created_utc": 1527816057.0,
            "replies": []
        },
        {
            "body": "I cannot imagine what you're going through to lose 2 people so close to you. I'll be thinking of you.",
            "author": "sexviewer",
            "id": "dzwz7ye",
            "parent_id": "t3_8nn5jh",
            "score": 4,
            "created_utc": 1527817955.0,
            "replies": [
                {
                    "body": "Yup. 2018 in some ways has seriously been sucking pure ass. If the second half of this harsh year doesn't get better I'm gonna turn into a real bastard and a half\n\n<growls like a motherf**ker>",
                    "author": "SDRippington",
                    "id": "dzxqf7o",
                    "parent_id": "t1_dzwz7ye",
                    "score": 1,
                    "created_utc": 1527856812.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Im so sorry to hear that.... 😔😔",
            "author": "lookingforasugarhigh",
            "id": "dzwzmqp",
            "parent_id": "t3_8nn5jh",
            "score": 4,
            "created_utc": 1527818331.0,
            "replies": []
        },
        {
            "body": "i am so sorry for your loss! sending all the <3 and good energy your way. ",
            "author": "sweet319babe",
            "id": "dzx00yd",
            "parent_id": "t3_8nn5jh",
            "score": 4,
            "created_utc": 1527818720.0,
            "replies": []
        },
        {
            "body": "So sorry for the hole in your being right now, Rip, the world, and you in particular, will miss a great human being.\n\nFeel free to share more about her here, and the stories that made your time together so memorable. And perhaps a live person there in your area will turn out to be receptive and able to help you  grieve with a friendly presence. Maybe your SB can be more in the open now especially if characterized differently.",
            "author": "jacknjilled",
            "id": "dzx4sas",
            "parent_id": "t3_8nn5jh",
            "score": 3,
            "created_utc": 1527823235.0,
            "replies": []
        },
        {
            "body": "Wow this is quite sad. I'm sorry for your losses. Sometimes life can take a turn into a pile of shit. Hang in there Rippington.",
            "author": "pintodinosaur",
            "id": "dzx550m",
            "parent_id": "t3_8nn5jh",
            "score": 4,
            "created_utc": 1527823535.0,
            "replies": []
        },
        {
            "body": "Sincere condolences, sir, for both of your losses.",
            "author": "HHSDPOT",
            "id": "dzx5hi4",
            "parent_id": "t3_8nn5jh",
            "score": 4,
            "created_utc": 1527823833.0,
            "replies": []
        },
        {
            "body": "There today, gone tomorrow. Every day is another day on borrowed time. Enjoy life and cherish the people that you care about. Can't take all the money/material with you when the time comes.",
            "author": "golferkris101",
            "id": "dzx7v8q",
            "parent_id": "t3_8nn5jh",
            "score": 4,
            "created_utc": 1527826211.0,
            "replies": [
                {
                    "body": "Very very true, that is exactly some of us are in SRs.",
                    "author": "ontherdagn",
                    "id": "dzylu6c",
                    "parent_id": "t1_dzx7v8q",
                    "score": 2,
                    "created_utc": 1527885666.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "SD,\n\nSo sorry!  Obviously, the folks in this community are here to support you.",
            "author": "HappyBear1952",
            "id": "dzwxduq",
            "parent_id": "t3_8nn5jh",
            "score": 3,
            "created_utc": 1527816217.0,
            "replies": []
        },
        {
            "body": "I'm so sorry. Sending good vibes to you.",
            "author": "MedicGirl",
            "id": "dzxdmym",
            "parent_id": "t3_8nn5jh",
            "score": 3,
            "created_utc": 1527833637.0,
            "replies": []
        },
        {
            "body": "My heart hurts for you so deeply. Sending sugary love your way. \\<3 ",
            "author": "ShaelaxxRowan",
            "id": "dzytrxh",
            "parent_id": "t3_8nn5jh",
            "score": 3,
            "created_utc": 1527893808.0,
            "replies": []
        },
        {
            "body": "My condolences to all those affected.\n\nI've stated I've done volunteer work with hospice type groups, but I've never stated why....my father got cancer and even though he had the best regional doctor (I checked medical journals rankings), all his expertise was for naught. When my fathers  final phase came, no way was I putting him in a hospital. Hospice provided me on the job training to be his care giver.\n\nThat experience showed me to never wait until the end comes, say what you need to say or want to say. Don't let things hangs, don't let things be assumed.\n\nUnfortunately,  we don't always do that. I've referenced that my first real gf story was sad, on here, but never more. \n\nFirst day of school  (6th grade)and I see this angel. We dated for the school year, but there was always something that seemed off (great intuition, though lack of experience in life). \n\nFast forward 3rd years, first day of HS, and I see her in one of my classes. Drugged out in her appearance. She actually graduated 3 years later.\n\nFast forward 6 years. Earlier in therror year I had moved up 'real' sports cars. One night I pulled into a conveniencertain store to get a bottle of water, there were two women at the corner of the store (by the phone). You've probably already figured why they were there.  As I turned to get into my car, they were in my field of view and I realized that it was her. I froze. \n\nI didn't know what to say. I wanted to go over to her and shake some into her, but didn't.  It felt like stepping into a ring with a boxer you know is going to win, but not wanting to get up after his first punch because you didn't think it would hurt that much. I just left. \n\nFast forward to the early part of this decade. I reconnected with my childhood best friend who was her (since birth) friend. And I asked about her.\n\nSomething happened, she became despondent, greatly increased her drug usage and after a few months, gave herself a lethal overdose.\n\nSometimes we don't say things, but you shouldn't beat yourself over it. There's also no better time to start than the present. \n",
            "author": "Edmund_Fitzggerald",
            "id": "dzyuucw",
            "parent_id": "t3_8nn5jh",
            "score": 3,
            "created_utc": 1527894997.0,
            "replies": []
        },
        {
            "body": "Man, that's devastating. So sorry for your loss. Your advice is excellent and applies to all of our loved ones, friends, and sugar partners. Every day we have with them is a blessing. Peace.",
            "author": "Cledaddy23",
            "id": "e00rfbg",
            "parent_id": "t3_8nn5jh",
            "score": 3,
            "created_utc": 1527989259.0,
            "replies": []
        },
        {
            "body": "Sorry for your loss bro",
            "author": "sug4rdaddy",
            "id": "dzws5mq",
            "parent_id": "t3_8nn5jh",
            "score": 5,
            "created_utc": 1527810656.0,
            "replies": []
        },
        {
            "body": "I'm so sorry for your loss. SLF is a great sub, so if you need to talk we're here for you.",
            "author": "awwsugarsugarbaby",
            "id": "dzwt6t7",
            "parent_id": "t3_8nn5jh",
            "score": 5,
            "created_utc": 1527811745.0,
            "replies": [
                {
                    "body": "I edited the original post to reflect this, actually :-)\n\nIt's so nice to know that in the age of such secret relationships, there are communities full of like minded people on Reddit and in other venues that share the same thoughts, feelings and life that I do. It's truly humbling, honestly. ",
                    "author": "SDRippington",
                    "id": "dzwtkoh",
                    "parent_id": "t1_dzwt6t7",
                    "score": 5,
                    "created_utc": 1527812150.0,
                    "replies": [
                        {
                            "body": "You just said it best! Damn I wish this eye allergy would clear up!",
                            "author": "ontherdagn",
                            "id": "dzylxe8",
                            "parent_id": "t1_dzwtkoh",
                            "score": 2,
                            "created_utc": 1527885751.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Just got your message... i'm so sorry to hear that.  Cherish the sweet memories.  😔  we are here when come up for air...",
            "author": "malibijones",
            "id": "dzx05r5",
            "parent_id": "t3_8nn5jh",
            "score": 5,
            "created_utc": 1527818837.0,
            "replies": []
        },
        {
            "body": "Really sorry to hear.  Thanks for sharing your story, and the reminder to appreciate those in our lives",
            "author": "Azurecole",
            "id": "dzwu06t",
            "parent_id": "t3_8nn5jh",
            "score": 3,
            "created_utc": 1527812606.0,
            "replies": []
        },
        {
            "body": "Jesus Rip. That’s terrible. I can’t even imagine how you’re feeling. But I feel for you. Take care of yourself sir. I feel like you’re a good man, and I’m sure she genuinely enjoyed her time with you. So keep that in your thoughts. Be strong.",
            "author": "UpscaleBiker",
            "id": "dzwuv1p",
            "parent_id": "t3_8nn5jh",
            "score": 4,
            "created_utc": 1527813525.0,
            "replies": []
        },
        {
            "body": "Sorry to hear of your loss. Like you said it makes one appreciate life with others.",
            "author": "expatsd",
            "id": "dzy9frm",
            "parent_id": "t3_8nn5jh",
            "score": 2,
            "created_utc": 1527874612.0,
            "replies": []
        },
        {
            "body": "Sorry for your loss. Ironically Death is a very powerful reminder of life. Death especially of people who pass prematurely or suddenly carries a lot of grief for loved ones. I recall being in deep grief when a colleague passed last year and very suddenly. I would not consider him to be close but somehow it was all so sudden, it left me in a pile of grief for a few weeks. You will get over this I am sure but be it an SB or anyone else, when they pass, it burns a hole. Hope you come to grips and feel better soon. ",
            "author": "Throwaway9410912",
            "id": "dzyemkw",
            "parent_id": "t3_8nn5jh",
            "score": 2,
            "created_utc": 1527879154.0,
            "replies": []
        },
        {
            "body": "Thanks for sharing this.\n\nI'm in a SR which has progressed far beyond what I think either of us had ever expected it to go and I've always told myself that if I ever got to the point where I'd say those words to my SD I would walk away because we both know we have no future together and what we have is something we both enjoy for the time being.\n\nBut we both support each other and I think we challenge and bring out the best in each other but it's just we were both simultaneously not what each other were looking for/expecting and probably one of the most amazing things ever.\n\nI'm already quite affectionate but I think from your post, you're right. Life is short. I'm going to make sure I hug him extra tight when I see him next week and not let go for the night. And maybe not run away so quickly.\n\nThank you so much for sharing this and hang in there. Wish there was more we could do to help. ",
            "author": "secretconfessions75",
            "id": "e00pe0b",
            "parent_id": "t3_8nn5jh",
            "score": 2,
            "created_utc": 1527986794.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "dzwsus4",
            "parent_id": "t3_8nn5jh",
            "score": 3,
            "created_utc": 1527811388.0,
            "replies": [
                {
                    "body": "I appreciate that. I do.",
                    "author": "SDRippington",
                    "id": "dzwswvq",
                    "parent_id": "t1_dzwsus4",
                    "score": 3,
                    "created_utc": 1527811451.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Man, I am so sorry to hear about your loss! I could not phathom that happening to me! If you need anything pal I am here!",
            "author": "BigBearSD",
            "id": "dzwub7p",
            "parent_id": "t3_8nn5jh",
            "score": 3,
            "created_utc": 1527812929.0,
            "replies": []
        },
        {
            "body": "> she made such a positive difference in your life\n\nI was going to highlight this. She was truly one of those people who cause those whose lives they touch to redefine their scale of what makes a beautiful, awesome person. \n\nI don't think I could ever _not_ measure and compare other people in my life to her memory. She pushed the bar way higher than I ever thought possible. \n\nIt's funny - she was _the one_ that made me only consider anyone older than 25+ because she was totally in tune with the world and had her shit _together_ more than anyone else I ever met at her age - and almost any other!",
            "author": "SDRippington",
            "id": "dzwtgvp",
            "parent_id": "t1_dzwrlot",
            "score": 28,
            "created_utc": 1527812039.0,
            "replies": [
                {
                    "body": "I am absolutely sorry about this loss. I’m sure it’s such a shock that you never expected to happen. I send my condolences. If you need to chat I’m here anytime ",
                    "author": "tannedsb05",
                    "id": "dzxrtpc",
                    "parent_id": "t1_dzwtgvp",
                    "score": 5,
                    "created_utc": 1527858492.0,
                    "replies": []
                },
                {
                    "body": "I am absolutely sorry about this loss. I’m sure it’s such a shock that you never expected to happen. I send my condolences. If you need to chat I’m here anytime ",
                    "author": "tannedsb05",
                    "id": "dzxrvpx",
                    "parent_id": "t1_dzwtgvp",
                    "score": 6,
                    "created_utc": 1527858559.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I sincerely could not say anything but awesome things about her. \n\nShe even made it a point to be \"exclusive\" to me, even though she didn't have to and I didn't expect her to. She was such a loving, caring, kind and beautiful woman. \n\nAnd my God, when she'd look at me and just smile (more of a knowing smirk, really) with those ice blue eyes when I was talking to her, it just made me always lose my train of thought and make me melt. She knew it, too and used it to her advantage. \n\nThe Universe can totally suck it right now. It leaves shitheads that hurt people alive and takes someone like her instead? Fuck the Universe. ",
            "author": "SDRippington",
            "id": "dzwsg0b",
            "parent_id": "t1_dzwrlot",
            "score": 24,
            "created_utc": 1527810957.0,
            "replies": [
                {
                    "body": "That sucks so bad.  Even though your relationship was a secret you’ll always be able to treasure those memories and look back on how special it was. \n\nThe universe can be totally unjust and heartbreaking. ",
                    "author": "nigeriansugarprinces",
                    "id": "dzwssik",
                    "parent_id": "t1_dzwsg0b",
                    "score": 7,
                    "created_utc": 1527811322.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "SDR - thanks for your honesty, eloquence and character .....   World's a better place with you in it.  \n\n\n\nThe broadest shoulders are destined to carry the heaviest loads.......",
            "author": "pinotandsugar",
            "id": "dzz1aer",
            "parent_id": "t1_dzwrlot",
            "score": 3,
            "created_utc": 1527902448.0,
            "replies": []
        },
        {
            "body": "Man it sucks even more that she was such an amazing person - inside and out. Like so much so I was seriously falling for that woman :-\\",
            "author": "SDRippington",
            "id": "dzwttl7",
            "parent_id": "t1_dzwtohb",
            "score": 7,
            "created_utc": 1527812412.0,
            "replies": []
        },
        {
            "body": "Nothing wrong with bro hugs",
            "author": "girlz_are_42",
            "id": "dzwvulv",
            "parent_id": "t1_dzwrn0n",
            "score": 6,
            "created_utc": 1527814614.0,
            "replies": []
        },
        {
            "body": "Stop. I don't wanna cry. Would be really hard to explain to people around me why I'm bawling and shuddering like a child.",
            "author": "SDRippington",
            "id": "dzwsp9q",
            "parent_id": "t1_dzwrn0n",
            "score": 11,
            "created_utc": 1527811229.0,
            "replies": [
                {
                    "body": "Bro, you owe no one an explanation for expressing your humanity. \n\nOver the past year or so I've been on SLF, your input has been spot on. For once, allow yourself to take from SLF instead of giving to it. \n\nEven in your sorrows, you continue to give to SLF. In less than 24hrs, I'll be dropping my SB off at the airport for a vacation of hers. I was going to give her a hug and a kiss goodbye. After reading this, I will be giving her the best hug and kiss goodbye she will accept.\n\nFuck. I'm nearly holding back tears at the thought of something happening to her. I can't fathom what you're going through. \n\nThere was an SB here who posted about whether she should attend the funeral of her SD some months ago. Of all of us, she may have the wisest words for you right now. If I find it, I'll message you.",
                    "author": "sdthrowaway006",
                    "id": "dzxfl9t",
                    "parent_id": "t1_dzwsp9q",
                    "score": 6,
                    "created_utc": 1527837054.0,
                    "replies": [
                        {
                            "body": "> I'll be dropping my SB off at the airport for a vacation of hers. I was going to give her a hug and a kiss goodbye. After reading this, I will be giving her the best hug and kiss goodbye she will accept.\n\nGood advice I would hope everyone listens to and takes heed. \n\nHere I was missing her, thinking she just ghosted me and now i feel so ashamed and guilty for that. Yeah, people ghost in these relationships all the time, especially when what you share is very secret and isn't known to each others circle of friends. So when something happens - an old flame comes back, a new one is found, anything, inevitably the person may disappear. \n\nI just wanted to seek her out and just make sure she was happy, if not with me I just wanted her to be happy.\n\nI have a rather complex belief in the afterlife I've never shared here - so all I can hope for is that in whatever consciousness she might be in that she is happy as measured by the universe she is within. She deserves it.",
                            "author": "SDRippington",
                            "id": "dzxybsl",
                            "parent_id": "t1_dzxfl9t",
                            "score": 2,
                            "created_utc": 1527865023.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "It's ok to cry. :( You've lost someone important to you that you genuinely cared a great deal about. Big hug bud. Hope you get the time to grieve properly.",
                    "author": "CJ3500",
                    "id": "dzwvdrb",
                    "parent_id": "t1_dzwsp9q",
                    "score": 6,
                    "created_utc": 1527814109.0,
                    "replies": [
                        {
                            "body": "Oh I've cried, and will probably continue to do so from time to time - but hard to express those feelings in mixed company :-)\n\n\"Why you crying, man?\"\n\n\"My SB died\"\n\n\"What? Your USB died? Get a new motherboard, bro!\"\n\n<rolls eyes>",
                            "author": "SDRippington",
                            "id": "dzxq949",
                            "parent_id": "t1_dzwvdrb",
                            "score": 6,
                            "created_utc": 1527856599.0,
                            "replies": [
                                {
                                    "body": "I guess my concern is more along the lines of you not having any time to grieve in private because you're stuck having to pretend nothing's wrong while putting on your public/socially acceptable face all the time at work or around friends and family. That sort of thing becomes a crushing weight after a while. I'm glad you feel you can talk to us on SLf about what's happened.",
                                    "author": "CJ3500",
                                    "id": "dzyuoiy",
                                    "parent_id": "t1_dzxq949",
                                    "score": 3,
                                    "created_utc": 1527894817.0,
                                    "replies": [
                                        {
                                            "body": "As it happens I met her best friend in the park today - who incidentally sugared before as well. \n\nI knew my SB's best friend from almost 2 years before I met mine who passed away. She went \"out of the bowl\" back then as she went vanilla (and I wished her nothing but happiness), but I decided to tke the risk to text her and and ask about my SB and the circumstances around what happened. \n\nShe suddenly realized I was \"that guy\" my SB always talked about being with and was like \"OMG! It was YOU!?!\" and she dropped everything to meet with me. We talked and cried for hours because she hasn't been able to really grieve much either, as my SB's family pretty much ostracized all of her friends after she passed away.\n\nIt felt so good to share with someone in person what she was like in life and I feel so much better having been able to share everything with her best friend, and to everyone here as well.\n\nAll in all it was an okay Friday, all things considered.",
                                            "author": "SDRippington",
                                            "id": "dzyvkse",
                                            "parent_id": "t1_dzyuoiy",
                                            "score": 6,
                                            "created_utc": 1527895799.0,
                                            "replies": [
                                                {
                                                    "body": "This whole thread and the bit you wrote about her gift and your little dragon statuette has me feeling all throat lumpy. I wish there was more I could do for you as an internet stranger but I'm really grateful for your presence here and that you could meet up with your SB's friend. Be good to yourself ok?",
                                                    "author": "CJ3500",
                                                    "id": "dzz1oxi",
                                                    "parent_id": "t1_dzyvkse",
                                                    "score": 4,
                                                    "created_utc": 1527902925.0,
                                                    "replies": [
                                                        {
                                                            "body": "Thank you for the kind words!\n\nI will definitely take care of myself :) As time goes on I will do all I can to honor her memory. She deserved the world.",
                                                            "author": "SDRippington",
                                                            "id": "dzz660j",
                                                            "parent_id": "t1_dzz1oxi",
                                                            "score": 5,
                                                            "created_utc": 1527908393.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I appreciate that. Oh there have been sadder here, I assure you - but it just hurts all the same. \n\nI just keep wondering if I could have done more for her - and sadly I'll never know.",
            "author": "SDRippington",
            "id": "dzwsmwb",
            "parent_id": "t1_dzwsbrp",
            "score": 8,
            "created_utc": 1527811160.0,
            "replies": [
                {
                    "body": "You have done much for her by impressing on all of us the need to let our sugars know how much they really mean to us!!",
                    "author": "ontherdagn",
                    "id": "dzylp5p",
                    "parent_id": "t1_dzwsmwb",
                    "score": 2,
                    "created_utc": 1527885537.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Yup. 2018 in some ways has seriously been sucking pure ass. If the second half of this harsh year doesn't get better I'm gonna turn into a real bastard and a half\n\n<growls like a motherf**ker>",
            "author": "SDRippington",
            "id": "dzxqf7o",
            "parent_id": "t1_dzwz7ye",
            "score": 1,
            "created_utc": 1527856812.0,
            "replies": []
        },
        {
            "body": "Very very true, that is exactly some of us are in SRs.",
            "author": "ontherdagn",
            "id": "dzylu6c",
            "parent_id": "t1_dzx7v8q",
            "score": 2,
            "created_utc": 1527885666.0,
            "replies": []
        },
        {
            "body": "I edited the original post to reflect this, actually :-)\n\nIt's so nice to know that in the age of such secret relationships, there are communities full of like minded people on Reddit and in other venues that share the same thoughts, feelings and life that I do. It's truly humbling, honestly. ",
            "author": "SDRippington",
            "id": "dzwtkoh",
            "parent_id": "t1_dzwt6t7",
            "score": 5,
            "created_utc": 1527812150.0,
            "replies": [
                {
                    "body": "You just said it best! Damn I wish this eye allergy would clear up!",
                    "author": "ontherdagn",
                    "id": "dzylxe8",
                    "parent_id": "t1_dzwtkoh",
                    "score": 2,
                    "created_utc": 1527885751.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I appreciate that. I do.",
            "author": "SDRippington",
            "id": "dzwswvq",
            "parent_id": "t1_dzwsus4",
            "score": 3,
            "created_utc": 1527811451.0,
            "replies": []
        },
        {
            "body": "I am absolutely sorry about this loss. I’m sure it’s such a shock that you never expected to happen. I send my condolences. If you need to chat I’m here anytime ",
            "author": "tannedsb05",
            "id": "dzxrtpc",
            "parent_id": "t1_dzwtgvp",
            "score": 5,
            "created_utc": 1527858492.0,
            "replies": []
        },
        {
            "body": "I am absolutely sorry about this loss. I’m sure it’s such a shock that you never expected to happen. I send my condolences. If you need to chat I’m here anytime ",
            "author": "tannedsb05",
            "id": "dzxrvpx",
            "parent_id": "t1_dzwtgvp",
            "score": 6,
            "created_utc": 1527858559.0,
            "replies": []
        },
        {
            "body": "That sucks so bad.  Even though your relationship was a secret you’ll always be able to treasure those memories and look back on how special it was. \n\nThe universe can be totally unjust and heartbreaking. ",
            "author": "nigeriansugarprinces",
            "id": "dzwssik",
            "parent_id": "t1_dzwsg0b",
            "score": 7,
            "created_utc": 1527811322.0,
            "replies": []
        },
        {
            "body": "Bro, you owe no one an explanation for expressing your humanity. \n\nOver the past year or so I've been on SLF, your input has been spot on. For once, allow yourself to take from SLF instead of giving to it. \n\nEven in your sorrows, you continue to give to SLF. In less than 24hrs, I'll be dropping my SB off at the airport for a vacation of hers. I was going to give her a hug and a kiss goodbye. After reading this, I will be giving her the best hug and kiss goodbye she will accept.\n\nFuck. I'm nearly holding back tears at the thought of something happening to her. I can't fathom what you're going through. \n\nThere was an SB here who posted about whether she should attend the funeral of her SD some months ago. Of all of us, she may have the wisest words for you right now. If I find it, I'll message you.",
            "author": "sdthrowaway006",
            "id": "dzxfl9t",
            "parent_id": "t1_dzwsp9q",
            "score": 6,
            "created_utc": 1527837054.0,
            "replies": [
                {
                    "body": "> I'll be dropping my SB off at the airport for a vacation of hers. I was going to give her a hug and a kiss goodbye. After reading this, I will be giving her the best hug and kiss goodbye she will accept.\n\nGood advice I would hope everyone listens to and takes heed. \n\nHere I was missing her, thinking she just ghosted me and now i feel so ashamed and guilty for that. Yeah, people ghost in these relationships all the time, especially when what you share is very secret and isn't known to each others circle of friends. So when something happens - an old flame comes back, a new one is found, anything, inevitably the person may disappear. \n\nI just wanted to seek her out and just make sure she was happy, if not with me I just wanted her to be happy.\n\nI have a rather complex belief in the afterlife I've never shared here - so all I can hope for is that in whatever consciousness she might be in that she is happy as measured by the universe she is within. She deserves it.",
                    "author": "SDRippington",
                    "id": "dzxybsl",
                    "parent_id": "t1_dzxfl9t",
                    "score": 2,
                    "created_utc": 1527865023.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "It's ok to cry. :( You've lost someone important to you that you genuinely cared a great deal about. Big hug bud. Hope you get the time to grieve properly.",
            "author": "CJ3500",
            "id": "dzwvdrb",
            "parent_id": "t1_dzwsp9q",
            "score": 6,
            "created_utc": 1527814109.0,
            "replies": [
                {
                    "body": "Oh I've cried, and will probably continue to do so from time to time - but hard to express those feelings in mixed company :-)\n\n\"Why you crying, man?\"\n\n\"My SB died\"\n\n\"What? Your USB died? Get a new motherboard, bro!\"\n\n<rolls eyes>",
                    "author": "SDRippington",
                    "id": "dzxq949",
                    "parent_id": "t1_dzwvdrb",
                    "score": 6,
                    "created_utc": 1527856599.0,
                    "replies": [
                        {
                            "body": "I guess my concern is more along the lines of you not having any time to grieve in private because you're stuck having to pretend nothing's wrong while putting on your public/socially acceptable face all the time at work or around friends and family. That sort of thing becomes a crushing weight after a while. I'm glad you feel you can talk to us on SLf about what's happened.",
                            "author": "CJ3500",
                            "id": "dzyuoiy",
                            "parent_id": "t1_dzxq949",
                            "score": 3,
                            "created_utc": 1527894817.0,
                            "replies": [
                                {
                                    "body": "As it happens I met her best friend in the park today - who incidentally sugared before as well. \n\nI knew my SB's best friend from almost 2 years before I met mine who passed away. She went \"out of the bowl\" back then as she went vanilla (and I wished her nothing but happiness), but I decided to tke the risk to text her and and ask about my SB and the circumstances around what happened. \n\nShe suddenly realized I was \"that guy\" my SB always talked about being with and was like \"OMG! It was YOU!?!\" and she dropped everything to meet with me. We talked and cried for hours because she hasn't been able to really grieve much either, as my SB's family pretty much ostracized all of her friends after she passed away.\n\nIt felt so good to share with someone in person what she was like in life and I feel so much better having been able to share everything with her best friend, and to everyone here as well.\n\nAll in all it was an okay Friday, all things considered.",
                                    "author": "SDRippington",
                                    "id": "dzyvkse",
                                    "parent_id": "t1_dzyuoiy",
                                    "score": 6,
                                    "created_utc": 1527895799.0,
                                    "replies": [
                                        {
                                            "body": "This whole thread and the bit you wrote about her gift and your little dragon statuette has me feeling all throat lumpy. I wish there was more I could do for you as an internet stranger but I'm really grateful for your presence here and that you could meet up with your SB's friend. Be good to yourself ok?",
                                            "author": "CJ3500",
                                            "id": "dzz1oxi",
                                            "parent_id": "t1_dzyvkse",
                                            "score": 4,
                                            "created_utc": 1527902925.0,
                                            "replies": [
                                                {
                                                    "body": "Thank you for the kind words!\n\nI will definitely take care of myself :) As time goes on I will do all I can to honor her memory. She deserved the world.",
                                                    "author": "SDRippington",
                                                    "id": "dzz660j",
                                                    "parent_id": "t1_dzz1oxi",
                                                    "score": 5,
                                                    "created_utc": 1527908393.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "You have done much for her by impressing on all of us the need to let our sugars know how much they really mean to us!!",
            "author": "ontherdagn",
            "id": "dzylp5p",
            "parent_id": "t1_dzwsmwb",
            "score": 2,
            "created_utc": 1527885537.0,
            "replies": []
        },
        {
            "body": "You just said it best! Damn I wish this eye allergy would clear up!",
            "author": "ontherdagn",
            "id": "dzylxe8",
            "parent_id": "t1_dzwtkoh",
            "score": 2,
            "created_utc": 1527885751.0,
            "replies": []
        },
        {
            "body": "> I'll be dropping my SB off at the airport for a vacation of hers. I was going to give her a hug and a kiss goodbye. After reading this, I will be giving her the best hug and kiss goodbye she will accept.\n\nGood advice I would hope everyone listens to and takes heed. \n\nHere I was missing her, thinking she just ghosted me and now i feel so ashamed and guilty for that. Yeah, people ghost in these relationships all the time, especially when what you share is very secret and isn't known to each others circle of friends. So when something happens - an old flame comes back, a new one is found, anything, inevitably the person may disappear. \n\nI just wanted to seek her out and just make sure she was happy, if not with me I just wanted her to be happy.\n\nI have a rather complex belief in the afterlife I've never shared here - so all I can hope for is that in whatever consciousness she might be in that she is happy as measured by the universe she is within. She deserves it.",
            "author": "SDRippington",
            "id": "dzxybsl",
            "parent_id": "t1_dzxfl9t",
            "score": 2,
            "created_utc": 1527865023.0,
            "replies": []
        },
        {
            "body": "Oh I've cried, and will probably continue to do so from time to time - but hard to express those feelings in mixed company :-)\n\n\"Why you crying, man?\"\n\n\"My SB died\"\n\n\"What? Your USB died? Get a new motherboard, bro!\"\n\n<rolls eyes>",
            "author": "SDRippington",
            "id": "dzxq949",
            "parent_id": "t1_dzwvdrb",
            "score": 6,
            "created_utc": 1527856599.0,
            "replies": [
                {
                    "body": "I guess my concern is more along the lines of you not having any time to grieve in private because you're stuck having to pretend nothing's wrong while putting on your public/socially acceptable face all the time at work or around friends and family. That sort of thing becomes a crushing weight after a while. I'm glad you feel you can talk to us on SLf about what's happened.",
                    "author": "CJ3500",
                    "id": "dzyuoiy",
                    "parent_id": "t1_dzxq949",
                    "score": 3,
                    "created_utc": 1527894817.0,
                    "replies": [
                        {
                            "body": "As it happens I met her best friend in the park today - who incidentally sugared before as well. \n\nI knew my SB's best friend from almost 2 years before I met mine who passed away. She went \"out of the bowl\" back then as she went vanilla (and I wished her nothing but happiness), but I decided to tke the risk to text her and and ask about my SB and the circumstances around what happened. \n\nShe suddenly realized I was \"that guy\" my SB always talked about being with and was like \"OMG! It was YOU!?!\" and she dropped everything to meet with me. We talked and cried for hours because she hasn't been able to really grieve much either, as my SB's family pretty much ostracized all of her friends after she passed away.\n\nIt felt so good to share with someone in person what she was like in life and I feel so much better having been able to share everything with her best friend, and to everyone here as well.\n\nAll in all it was an okay Friday, all things considered.",
                            "author": "SDRippington",
                            "id": "dzyvkse",
                            "parent_id": "t1_dzyuoiy",
                            "score": 6,
                            "created_utc": 1527895799.0,
                            "replies": [
                                {
                                    "body": "This whole thread and the bit you wrote about her gift and your little dragon statuette has me feeling all throat lumpy. I wish there was more I could do for you as an internet stranger but I'm really grateful for your presence here and that you could meet up with your SB's friend. Be good to yourself ok?",
                                    "author": "CJ3500",
                                    "id": "dzz1oxi",
                                    "parent_id": "t1_dzyvkse",
                                    "score": 4,
                                    "created_utc": 1527902925.0,
                                    "replies": [
                                        {
                                            "body": "Thank you for the kind words!\n\nI will definitely take care of myself :) As time goes on I will do all I can to honor her memory. She deserved the world.",
                                            "author": "SDRippington",
                                            "id": "dzz660j",
                                            "parent_id": "t1_dzz1oxi",
                                            "score": 5,
                                            "created_utc": 1527908393.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I guess my concern is more along the lines of you not having any time to grieve in private because you're stuck having to pretend nothing's wrong while putting on your public/socially acceptable face all the time at work or around friends and family. That sort of thing becomes a crushing weight after a while. I'm glad you feel you can talk to us on SLf about what's happened.",
            "author": "CJ3500",
            "id": "dzyuoiy",
            "parent_id": "t1_dzxq949",
            "score": 3,
            "created_utc": 1527894817.0,
            "replies": [
                {
                    "body": "As it happens I met her best friend in the park today - who incidentally sugared before as well. \n\nI knew my SB's best friend from almost 2 years before I met mine who passed away. She went \"out of the bowl\" back then as she went vanilla (and I wished her nothing but happiness), but I decided to tke the risk to text her and and ask about my SB and the circumstances around what happened. \n\nShe suddenly realized I was \"that guy\" my SB always talked about being with and was like \"OMG! It was YOU!?!\" and she dropped everything to meet with me. We talked and cried for hours because she hasn't been able to really grieve much either, as my SB's family pretty much ostracized all of her friends after she passed away.\n\nIt felt so good to share with someone in person what she was like in life and I feel so much better having been able to share everything with her best friend, and to everyone here as well.\n\nAll in all it was an okay Friday, all things considered.",
                    "author": "SDRippington",
                    "id": "dzyvkse",
                    "parent_id": "t1_dzyuoiy",
                    "score": 6,
                    "created_utc": 1527895799.0,
                    "replies": [
                        {
                            "body": "This whole thread and the bit you wrote about her gift and your little dragon statuette has me feeling all throat lumpy. I wish there was more I could do for you as an internet stranger but I'm really grateful for your presence here and that you could meet up with your SB's friend. Be good to yourself ok?",
                            "author": "CJ3500",
                            "id": "dzz1oxi",
                            "parent_id": "t1_dzyvkse",
                            "score": 4,
                            "created_utc": 1527902925.0,
                            "replies": [
                                {
                                    "body": "Thank you for the kind words!\n\nI will definitely take care of myself :) As time goes on I will do all I can to honor her memory. She deserved the world.",
                                    "author": "SDRippington",
                                    "id": "dzz660j",
                                    "parent_id": "t1_dzz1oxi",
                                    "score": 5,
                                    "created_utc": 1527908393.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "As it happens I met her best friend in the park today - who incidentally sugared before as well. \n\nI knew my SB's best friend from almost 2 years before I met mine who passed away. She went \"out of the bowl\" back then as she went vanilla (and I wished her nothing but happiness), but I decided to tke the risk to text her and and ask about my SB and the circumstances around what happened. \n\nShe suddenly realized I was \"that guy\" my SB always talked about being with and was like \"OMG! It was YOU!?!\" and she dropped everything to meet with me. We talked and cried for hours because she hasn't been able to really grieve much either, as my SB's family pretty much ostracized all of her friends after she passed away.\n\nIt felt so good to share with someone in person what she was like in life and I feel so much better having been able to share everything with her best friend, and to everyone here as well.\n\nAll in all it was an okay Friday, all things considered.",
            "author": "SDRippington",
            "id": "dzyvkse",
            "parent_id": "t1_dzyuoiy",
            "score": 6,
            "created_utc": 1527895799.0,
            "replies": [
                {
                    "body": "This whole thread and the bit you wrote about her gift and your little dragon statuette has me feeling all throat lumpy. I wish there was more I could do for you as an internet stranger but I'm really grateful for your presence here and that you could meet up with your SB's friend. Be good to yourself ok?",
                    "author": "CJ3500",
                    "id": "dzz1oxi",
                    "parent_id": "t1_dzyvkse",
                    "score": 4,
                    "created_utc": 1527902925.0,
                    "replies": [
                        {
                            "body": "Thank you for the kind words!\n\nI will definitely take care of myself :) As time goes on I will do all I can to honor her memory. She deserved the world.",
                            "author": "SDRippington",
                            "id": "dzz660j",
                            "parent_id": "t1_dzz1oxi",
                            "score": 5,
                            "created_utc": 1527908393.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "This whole thread and the bit you wrote about her gift and your little dragon statuette has me feeling all throat lumpy. I wish there was more I could do for you as an internet stranger but I'm really grateful for your presence here and that you could meet up with your SB's friend. Be good to yourself ok?",
            "author": "CJ3500",
            "id": "dzz1oxi",
            "parent_id": "t1_dzyvkse",
            "score": 4,
            "created_utc": 1527902925.0,
            "replies": [
                {
                    "body": "Thank you for the kind words!\n\nI will definitely take care of myself :) As time goes on I will do all I can to honor her memory. She deserved the world.",
                    "author": "SDRippington",
                    "id": "dzz660j",
                    "parent_id": "t1_dzz1oxi",
                    "score": 5,
                    "created_utc": 1527908393.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Thank you for the kind words!\n\nI will definitely take care of myself :) As time goes on I will do all I can to honor her memory. She deserved the world.",
            "author": "SDRippington",
            "id": "dzz660j",
            "parent_id": "t1_dzz1oxi",
            "score": 5,
            "created_utc": 1527908393.0,
            "replies": []
        }
    ]
}