{
    "title": "Used",
    "post_id": "yv0mtl",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/yv0mtl/used/",
    "author": "WoahThere_124",
    "body": "throwaway for many reasons as I knew better and ashamed I didn’t hold up to my knowledge. I’m so angry I was this naive and trusting but lesson learned.\n\nI recently started back sugaring after losing my job unexpectedly from a 3 month break. I met with a POT I found on Secret Benefits for coffee last week and we hit it off. He seemed normal and had an outgoing personality. Talked highly of his job and his achievements. We got into deeper conversations and he asked me why I sugar, then mentioned he was a findom. I asked what that was as I’ve never heard of it and he explained (google it). He asked me what my life struggles are at the moment and I mentioned winter clothes for my 2 children as they’re still in last years and my oldest is getting bullied for his pants showing his legs by a kid which resulted in them both being suspended for 2 days. He said he loved kids & he would love to continue seeing me that he would change my life. Promised me an x.xxx allowance per meet and anything else I needed like groceries or bills and them an entire new wardrobe of the finest clothes, even said he would pay off my credit card debt and get me a new phone. I found him attractive and loved his smile, I thought my life was gonna change with him that I hit the jackpot. 😂\n\nWe had a second date scheduled for dinner that went amazing. It felt like a vanilla date I didn’t want it to end. It unexpectedly led to him asking if I wanted to stay the night at a hotel close by and whatever happens happens that no pressure. I agreed and we went after. Things got hot and heavy fast, lots of sex. I ended up spending the night. From what he talked before I wasn’t worried about him not paying. When we woke up he doordash us breakfest and said he had to get going soon for some work he had to catch up on. He said he didn’t bring cash since this was last second planned but would send the ppm when he got service after leaving that he doesn’t trust sending through the hotels wifi. My heart started to sink as worry set in with the what ifs, is this too good to be true, did I just get played, who doesn’t trust wifi or just everything in my mind was rolling. We both part ways. After an hour I asked if he got the chance to send it yet and crickets. By 5pm I asked again and he said he was sorry he’s been super busy. Next morning I go to text and he won’t respond. Nothing. Sent another text at 3ish and nothing. I get a text that night saying his cards are locked asking if I could wait until it’s sorted then try’s to make a new meet set up. I asked in a sorta “what’s up” way how would he be able to buy a hotel if cards are locked and he sent me a paragraph telling me how stupid and naive I am. How I was a cum dump and all sorts of awful disgusting things this man took the time to think of and to tell me. I didn’t even respond and blocked him.\n\nRant over. It’s important to not let anyone have the chance or opportunity to pull this. I trusted him based on what he said and promised. Don’t take any sd seriously unless they show or prove to you what they mean. Anyone can say anything and I learned the hard way no matter what’s said, PPM comes first. Until then it’s empty promises.",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/yv0mtl/used/",
    "score": 117,
    "upvote_ratio": 0.93,
    "created_utc": 1668435299.0,
    "num_comments": 125,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "Lesson learned. Sugar dating is transactional, at least at first until you learn to trust each other. \n\nMoney before honey, cash before trash,finance before romance. If a guy gets his widdle feelings bent out of shape then move on. A real SD can aford the occasional cash and dash.",
            "author": "GSSD",
            "id": "iwc5ran",
            "parent_id": "t3_yv0mtl",
            "score": 71,
            "created_utc": 1668440419.0,
            "replies": [
                {
                    "body": "Definitely this!",
                    "author": "WoahThere_124",
                    "id": "iwcje8f",
                    "parent_id": "t1_iwc5ran",
                    "score": 7,
                    "created_utc": 1668445961.0,
                    "replies": []
                },
                {
                    "body": "Couldn't agree more!",
                    "author": "AusterlitzSD",
                    "id": "iwe8sap",
                    "parent_id": "t1_iwc5ran",
                    "score": -1,
                    "created_utc": 1668470635.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "hey...sorry that happened to you especially after you opened your heart up about your kids' needs",
            "author": "mmarquisdesade",
            "id": "iwdi7yz",
            "parent_id": "t3_yv0mtl",
            "score": 13,
            "created_utc": 1668459495.0,
            "replies": [
                {
                    "body": "It’s broke me inside. He mocked me for it after calling me a terrible mother. I didn’t even finish reading his response",
                    "author": "WoahThere_124",
                    "id": "iwdjtet",
                    "parent_id": "t1_iwdi7yz",
                    "score": 13,
                    "created_utc": 1668460120.0,
                    "replies": [
                        {
                            "body": "I hope you don’t believe any of his words. He’s a terrible person, and I’m sorry you had the misfortune of being subjected to that.",
                            "author": "Actually_a_bot_accnt",
                            "id": "iwfvqp6",
                            "parent_id": "t1_iwdjtet",
                            "score": 8,
                            "created_utc": 1668504638.0,
                            "replies": []
                        },
                        {
                            "body": "I'm sorry and hope you find an amazing SD",
                            "author": "mmarquisdesade",
                            "id": "iweqnwa",
                            "parent_id": "t1_iwdjtet",
                            "score": 5,
                            "created_utc": 1668478749.0,
                            "replies": []
                        },
                        {
                            "body": "Did he use a condom? Or did he finish inside of you raw?",
                            "author": "ImWorried2017",
                            "id": "iwei2vr",
                            "parent_id": "t1_iwdjtet",
                            "score": -2,
                            "created_utc": 1668474900.0,
                            "replies": []
                        },
                        {
                            "body": "Hey again I'm so sorry...you seem so sincere and like you'd be an AMAZING SB!! I feel the same as you do in reverse; as though my SB doesn't appreciate me as I should be appreciated and i KNOW i've taken care of her so I do feel your pain!",
                            "author": "mmarquisdesade",
                            "id": "iwmspm2",
                            "parent_id": "t1_iwdjtet",
                            "score": 1,
                            "created_utc": 1668629843.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "What an asshole, and I'm sorry you had to experience this!\n\nOnce he offered to move to a hotel, that's when he needed to give you the money or else it's a No Go!\n\nTo be clear: I blame HIM but I'm glad for your sake that you'll know not to follow that kind of charlatan blindly in the future.",
            "author": "AusterlitzSD",
            "id": "iwc16h9",
            "parent_id": "t3_yv0mtl",
            "score": 39,
            "created_utc": 1668438488.0,
            "replies": [
                {
                    "body": "Thank you 🙏",
                    "author": "WoahThere_124",
                    "id": "iwck73p",
                    "parent_id": "t1_iwc16h9",
                    "score": 9,
                    "created_utc": 1668446273.0,
                    "replies": []
                }
            ]
        },
        {
            "body": ">no matter what’s said, PPM comes first\n\nBut, but....paying before feels so *transactional*!\n\nBut, but.... imagine she runs off with it!\n\n/s\n\nAnd this gentlemen, is why you *always* discretely hand your new SB  (without her having to ask) the PPM/allowance BEFORE! Because OP's scenario will *always* cross the mind of every new SB you are intimate with for the first time!\n\nIf you miss the empathy to understand this, I can also assure you that a relaxed and worry free female mind during sex pays off. BIG time!",
            "author": "A-touchofreality",
            "id": "iwc1lkq",
            "parent_id": "t3_yv0mtl",
            "score": 60,
            "created_utc": 1668438670.0,
            "replies": [
                {
                    "body": "\"Imagine if she runs off with it\"\n\n I'd rather know she's a crook up front so I don't have to worry about it. I may lose a couple xxx here and there.  I consider it the cost of doing business/sugar.  100% agree that a SB should NEVER have to ask.",
                    "author": "NoBagelNoBagel1",
                    "id": "iwd3rku",
                    "parent_id": "t1_iwc1lkq",
                    "score": 25,
                    "created_utc": 1668453872.0,
                    "replies": [
                        {
                            "body": "I agree with you 100%. I rarely make a strong connection, but when I do, I often pay as much as a month's allowance in advance. From my perspective, if I really like someone, I can afford to lose that money much more than I can afford to get involved with the wrong kind of person and have them hurt me emotionally. So if they'll disappear after getting the money, then so be it. I'd much rather not sleep with someone who didn't want to be intimate with me anyway.",
                            "author": "GH-SD",
                            "id": "iwerjk9",
                            "parent_id": "t1_iwd3rku",
                            "score": 15,
                            "created_utc": 1668479138.0,
                            "replies": []
                        },
                        {
                            "body": ">I'd rather know she's a crook up front so I don't have to worry about it.\n\nSome men prefer to use the money as a pressure to fuck the crook who's intention was to run off. LOL",
                            "author": "A-touchofreality",
                            "id": "iwdwoem",
                            "parent_id": "t1_iwd3rku",
                            "score": 3,
                            "created_utc": 1668465365.0,
                            "replies": [
                                {
                                    "body": "Idk.  Pressuring people into fucking isn't my thing.  I know some men get off on it.",
                                    "author": "NoBagelNoBagel1",
                                    "id": "iwe5ouo",
                                    "parent_id": "t1_iwdwoem",
                                    "score": 4,
                                    "created_utc": 1668469258.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "iwc7jpc",
                    "parent_id": "t1_iwc1lkq",
                    "score": 15,
                    "created_utc": 1668441150.0,
                    "replies": [
                        {
                            "body": "How can she completely secure it if you give it to her in the hotel room?\nSerious question that I have pondered. There’s always a risk that an SD can steal it out of her purse, right?",
                            "author": "261chameleons",
                            "id": "iwcm904",
                            "parent_id": "t1_iwc7jpc",
                            "score": 5,
                            "created_utc": 1668447081.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "iwcmq4t",
                                    "parent_id": "t1_iwcm904",
                                    "score": 8,
                                    "created_utc": 1668447267.0,
                                    "replies": [
                                        {
                                            "body": "True. But unfortunately the norm in sugaring seems to be accelerated intimacy.",
                                            "author": "261chameleons",
                                            "id": "iwdtbq6",
                                            "parent_id": "t1_iwcmq4t",
                                            "score": 2,
                                            "created_utc": 1668463946.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "But that just isn't true.  Unless the guy has been screened (full name, place of employment, successful enough he has something to lose).  There are lots of stories of johns robbing girls in private spaces.\n\nA really young SB posted awhile ago about going to a new SD's house.  He gives her the payment, but rifles through her bag while she's sleeping, removes her drivers license and leaves it on the counter and removes the ppm.\n\nAddresses her by her real name in the morning, implying if she says anything about the rape and theft he will blackmail her to her parents.",
                                            "author": "Fair_Rhubarb28",
                                            "id": "iwdj7m5",
                                            "parent_id": "t1_iwcmq4t",
                                            "score": 2,
                                            "created_utc": 1668459880.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "I do usually give her the PPM before intimacy, but it’s in a sealed envelope, and if I saw her open it and count it, I’d probably be unlikely to see her again.   It’s not supposed to be a payment for a service, where she has to count to make sure she got the right amount before we have sex.  Yes, that *is* too transactional.  I’m giving what I promised and over time I’ll give more, but it shouldn’t feel like “I’m only having sex with you because you handed over the exact amount we discussed…” or that just doesn’t feel like sugar to me.",
                            "author": "UseTheForceRey",
                            "id": "iwcnh8n",
                            "parent_id": "t1_iwc7jpc",
                            "score": -10,
                            "created_utc": 1668447563.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "iwcokf3",
                                    "parent_id": "t1_iwcnh8n",
                                    "score": 14,
                                    "created_utc": 1668447988.0,
                                    "replies": [
                                        {
                                            "body": "I had someone do that too.  She skedaddled out the door while I was in the bathroom.",
                                            "author": "aajniojnoihnoi",
                                            "id": "iwd1kce",
                                            "parent_id": "t1_iwcokf3",
                                            "score": -2,
                                            "created_utc": 1668453013.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "I can absolutely understand the turn off of someone counting the money in front of you. But we also know the cases of 'SD' having cut journals in the size of $ bills, or even using Monopoly money to put in closed envelopes.\n\nSo I would suggest to avoid both situations by giving it in an open envelope, and then go for a moment to the bathroom or create another occasion where she can discretely check if the contains of the envelope are as agreed upon?",
                                    "author": "A-touchofreality",
                                    "id": "iwe064t",
                                    "parent_id": "t1_iwcnh8n",
                                    "score": 7,
                                    "created_utc": 1668466849.0,
                                    "replies": [
                                        {
                                            "body": "No.  I would find it off-putting.  It’s not supposed to be a payment for a service.  If she’s willing to fuck me, she should trust me enough that I’m not going to do that.   I gave her a gift after the M&G.  I’ve taken her to a nice dinner. Now I’ve handed her an envelope before we are intimate.   She can trust me at that point.   Some other guys have used fake bills or whatever… I’m not them, and that’s an awful lot of fucking effort to save a few bucks.  I would argue it makes more sense to spend time getting to know the guy to the point this ain’t a concern.  If you’re going to a hotel with a guy you just met after a coffee, the risk of a scam is high.  If you’ve had a M&G, gotten a gif, and now another date, I think the risk is very low, and this isn’t supposed to be pay for play.",
                                            "author": "UseTheForceRey",
                                            "id": "iwe1a4v",
                                            "parent_id": "t1_iwe064t",
                                            "score": -2,
                                            "created_utc": 1668467330.0,
                                            "replies": [
                                                {
                                                    "body": "I  understand, and agree with your POV after having proved already some reliability to your Pot SB.  I personally never felt the need to check and have never been scammed either. But we are probably both in a section of the bowl where things like this not usually happen.\n\nReading others' experiences on sugar forums unfortunately taught me a lot about other, uglier, sections where these things do happen more frequently. Don't underestimate how far some scammers go, and how vulnerable some of their targets are.",
                                                    "author": "A-touchofreality",
                                                    "id": "iwe469y",
                                                    "parent_id": "t1_iwe1a4v",
                                                    "score": 2,
                                                    "created_utc": 1668468586.0,
                                                    "replies": [
                                                        {
                                                            "body": "Yes, I think that's a good point.    None of the SBs I've ever seen has counted, but I would recommend counting if it was more of a \"we just met, let's go have sex now\" situation.",
                                                            "author": "UseTheForceRey",
                                                            "id": "iwe7ghc",
                                                            "parent_id": "t1_iwe469y",
                                                            "score": 0,
                                                            "created_utc": 1668470039.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "body": "Agreed. Plus over time, trust will be built, and everything should naturally go more smoothly.",
                                            "author": "LaylaSB",
                                            "id": "iwfowi7",
                                            "parent_id": "t1_iwe064t",
                                            "score": 1,
                                            "created_utc": 1668498561.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "But it *IS* a service. Idk how y’all play mental gymnastics in your head trying to convince yourselves that it’s not lmao. At this point, You’re hiring nothing more than an actress pretending to like you.",
                                    "author": "ImWorried2017",
                                    "id": "iweig66",
                                    "parent_id": "t1_iwcnh8n",
                                    "score": 3,
                                    "created_utc": 1668475068.0,
                                    "replies": [
                                        {
                                            "body": "Lol.   This is *exactly* my point.  I am *not* hiring anyone to act or provide a service.  If that is her intent, she’s not an SB and she should move on to someone who wants that shit.  \n\nJust because you don’t understand the difference between escorting and sugar dating doesn’t mean that there are no SBs out there who genuinely want to date someone who’s supporting them, not put on an act.",
                                            "author": "UseTheForceRey",
                                            "id": "iweq1qm",
                                            "parent_id": "t1_iweig66",
                                            "score": 1,
                                            "created_utc": 1668478477.0,
                                            "replies": [
                                                {
                                                    "body": "Whatever helps you sleep at night 🙄 \n\nTake away the PPM or allowance and see how long she sticks around",
                                                    "author": "ImWorried2017",
                                                    "id": "iweqwtf",
                                                    "parent_id": "t1_iweq1qm",
                                                    "score": 3,
                                                    "created_utc": 1668478858.0,
                                                    "replies": [
                                                        {
                                                            "body": "Why would I want to stop financially supporting someone who I am dating?",
                                                            "author": "UseTheForceRey",
                                                            "id": "iweu5cg",
                                                            "parent_id": "t1_iweqwtf",
                                                            "score": -2,
                                                            "created_utc": 1668480266.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Here’s a pretty [valid reason](https://www.reddit.com/r/sugarlifestyleforum/comments/yuu3u2/sd_wants_to_stop_arrangement_and_for_us_to_start/?utm_source=share&utm_medium=ios_app&utm_name=iossmf). Sugar dating is one sided. One side is offering financial compensation. The other is offering their… ~~body~~  “time”? When both parties should be offering their time instead without money being an issue.",
                                                                    "author": "ImWorried2017",
                                                                    "id": "iwewz0q",
                                                                    "parent_id": "t1_iweu5cg",
                                                                    "score": 1,
                                                                    "created_utc": 1668481540.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "I've heard of girls getting fake bills before, or one real benji on top of the rest monopoly money, so them glancing at it probably isn't out of bounds.  Not saying she has to take out of a bank blue light pen and check with a counterfeit pen, but opening it up and taking a peek it's all there imo is a good idea on the first intimate encounter.",
                                    "author": "KarensSmokeShop",
                                    "id": "iwekiqr",
                                    "parent_id": "t1_iwcnh8n",
                                    "score": 3,
                                    "created_utc": 1668476016.0,
                                    "replies": [
                                        {
                                            "body": "Disagreed, for the reasons stated above.  No number of downvotes from SBs is going to change that.",
                                            "author": "UseTheForceRey",
                                            "id": "iwepptz",
                                            "parent_id": "t1_iwekiqr",
                                            "score": -2,
                                            "created_utc": 1668478332.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "In six years of sugaring, I got robbed... once. I would have paid 10x, 20x that amount to make sure every SB I have been with feels comfortable and safe.",
                    "author": "TastySpermDevice",
                    "id": "iwc3dj9",
                    "parent_id": "t1_iwc1lkq",
                    "score": 31,
                    "created_utc": 1668439426.0,
                    "replies": []
                },
                {
                    "body": "Completely agree! \n\nThe sooner SDs understand and accept that the risk of \"being had\" is not equivalent (i.e. you lose a bit of money, she loses a sense of dignity!), the better we will all be in this lifestyle.\n\nBe a Man and set her mind at ease!",
                    "author": "AusterlitzSD",
                    "id": "iwc8brb",
                    "parent_id": "t1_iwc1lkq",
                    "score": 17,
                    "created_utc": 1668441468.0,
                    "replies": [
                        {
                            "body": ">> The sooner SDs understand and accept that the risk of \"being had\" is not equivalent (i.e. you lose a bit of money, she loses a sense of dignity!), the better we will all be in this lifestyle.\n\nPlease explain how the risk is not equivalent.  Scenario 1:  she has sex with him, doesn’t get money.   Scenario 2: he gives her money, she runs off.  In *both* cases the “loss” is money.   She didn’t “lose her dignity.”   She didn’t “lose” sex.  She had sex with him and lost the money. It is *exactly* equivalent — in either scenario one loses out on the same amount of money, and does so because the other person lied to them.  Both are shitty, but the “oh she lost her dignity” is nonsense— she fucked a guy she was willing to fuck — she lost money not dignity.",
                            "author": "tempsdforfuns",
                            "id": "iwcovkk",
                            "parent_id": "t1_iwc8brb",
                            "score": -7,
                            "created_utc": 1668448107.0,
                            "replies": [
                                {
                                    "body": "Let's say I buy your argument that it's ALL about the money and that how she feels about it is \"nonsense\". Do you think that the loss of the same amount of money has the same impact on a SD and a SB's life?! You're rich (at least you're supposed to be), she's not! xxx$ might help her pay her rent, or buy food; xxx$ is a freaking blip in my bank account! \n\nHey man, I've been played in the past and it's not pleasant! But I was mad because I hated the feeling of being had, not because the loss of money made any difference in my life. A SB who gives sex without receiving money suffers both ways.",
                                    "author": "AusterlitzSD",
                                    "id": "iwcs9w0",
                                    "parent_id": "t1_iwcovkk",
                                    "score": 13,
                                    "created_utc": 1668449422.0,
                                    "replies": [
                                        {
                                            "body": "I agree with you that the loss of money has to be more impactful to the SB.  I also have given the PPM first in most cases.  I just hate the “it doesn’t matter if the SB plays an SD, it’s just money” argument… the impact of getting played is there whether that money is significant or not.",
                                            "author": "tempsdforfuns",
                                            "id": "iwd0avy",
                                            "parent_id": "t1_iwcs9w0",
                                            "score": -1,
                                            "created_utc": 1668452516.0,
                                            "replies": [
                                                {
                                                    "body": "So when you put it like that, then I agree with you!",
                                                    "author": "AusterlitzSD",
                                                    "id": "iwd1dc3",
                                                    "parent_id": "t1_iwd0avy",
                                                    "score": 3,
                                                    "created_utc": 1668452937.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "You can't imagine how it is to be vulnerable and getting naked with a stranger, alone in a room, kissing, trusting him with your body, allowing him *INSIDE* you? Maybe even cuddle and some pillow talk afterwards?\n\nOnly to find out that all this intimate time together he fully *KNEW* he was going to purposely scam you?\n\nAnd you thinks this is the same risk as losing a couple of $ that might equal to what he would thoughtless spend on a good bottle of wine in an expensive restaurant?",
                                    "author": "A-touchofreality",
                                    "id": "iwdz1jl",
                                    "parent_id": "t1_iwcovkk",
                                    "score": 3,
                                    "created_utc": 1668466372.0,
                                    "replies": [
                                        {
                                            "body": "I highly doubt that the same guy who is thoughtlessly spending a PPM on a bottle of wine is the guy who’s skipping out on the PPM.   The guy who’s skipping out on the PPM is probably taking you to the Applebee’s next to the Red Roof Inn where he’s going to fuck you, and doesn’t drink wine that doesn’t come in a box.",
                                            "author": "tempsdforfuns",
                                            "id": "iwebad9",
                                            "parent_id": "t1_iwdz1jl",
                                            "score": 1,
                                            "created_utc": 1668471770.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Recently offered a London-based SB cash. She said she preferred bank transfer. I tried to get her info right then and there, she said she’d WhatsApp it to me. She waited until late the next day. I guess she felt she could trust me?",
                    "author": null,
                    "id": "iwc4ki8",
                    "parent_id": "t1_iwc1lkq",
                    "score": 1,
                    "created_utc": 1668439924.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "iwfcuv3",
                            "parent_id": "t1_iwc4ki8",
                            "score": 1,
                            "created_utc": 1668489673.0,
                            "replies": [
                                {
                                    "body": "Hmmm I hadn’t thought of that. It wasn’t her first SA rodeo. But who knows?",
                                    "author": null,
                                    "id": "iwfikpi",
                                    "parent_id": "t1_iwfcuv3",
                                    "score": 1,
                                    "created_utc": 1668493585.0,
                                    "replies": [
                                        {
                                            "body": "[deleted]",
                                            "author": null,
                                            "id": "iwhelyw",
                                            "parent_id": "t1_iwfikpi",
                                            "score": 1,
                                            "created_utc": 1668533955.0,
                                            "replies": [
                                                {
                                                    "body": "She said she’d had 2 prior multi year arrangements via SA. One speculates there would also be shorter ones",
                                                    "author": null,
                                                    "id": "iwhfa0w",
                                                    "parent_id": "t1_iwhelyw",
                                                    "score": 1,
                                                    "created_utc": 1668534214.0,
                                                    "replies": [
                                                        {
                                                            "body": "[deleted]",
                                                            "author": null,
                                                            "id": "iwhgbep",
                                                            "parent_id": "t1_iwhfa0w",
                                                            "score": 1,
                                                            "created_utc": 1668534614.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Hmmm? She was very responsive on all fronts - just slow in getting me her bank info after refusing cash, which ultimately is her issue not mine. I paid her as soon as she sent it.",
                                                                    "author": null,
                                                                    "id": "iwhggqh",
                                                                    "parent_id": "t1_iwhgbep",
                                                                    "score": 2,
                                                                    "created_utc": 1668534671.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "I wish I’d find this. Not me lol 😆",
                    "author": "WoahThere_124",
                    "id": "iwc7g25",
                    "parent_id": "t1_iwc1lkq",
                    "score": 0,
                    "created_utc": 1668441108.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "You learned a big lesson here!! NEVER NEVER have sex before any allowance first. He played you and you believe him. Personally, I wait to have sex because I want to feel comfortable and make sure he does not have any STD's. Also, next time don't mention you need money for your kids or even that you have kids. You do not know who these men are when you first meet them. You have to develop trust first to talk about your private life.",
            "author": "Confidentlatina",
            "id": "iwc8bu3",
            "parent_id": "t3_yv0mtl",
            "score": 31,
            "created_utc": 1668441469.0,
            "replies": []
        },
        {
            "body": "What a piece of shit and I hope he gets a nasty infection on his scrotum that itches til 2030 and oozes.",
            "author": "FoxAsking",
            "id": "iwcc2is",
            "parent_id": "t3_yv0mtl",
            "score": 18,
            "created_utc": 1668443000.0,
            "replies": [
                {
                    "body": "❤️ I really hope so",
                    "author": "WoahThere_124",
                    "id": "iwckk3x",
                    "parent_id": "t1_iwcc2is",
                    "score": 4,
                    "created_utc": 1668446412.0,
                    "replies": []
                }
            ]
        },
        {
            "body": ">Anyone can say anything and I learned the hard way no matter what’s said, PPM comes first. Until then it’s empty promises.\n\nPrecisely this.  Unfortunate this has happened to you though.",
            "author": "Enemy-of-Seabiscuit",
            "id": "iwc0zuu",
            "parent_id": "t3_yv0mtl",
            "score": 25,
            "created_utc": 1668438410.0,
            "replies": [
                {
                    "body": "I’m just in shock how well he played it off. I trusted him too. Silly me",
                    "author": "WoahThere_124",
                    "id": "iwc7i2e",
                    "parent_id": "t1_iwc0zuu",
                    "score": 7,
                    "created_utc": 1668441131.0,
                    "replies": [
                        {
                            "body": "Not your fault. Learn and move on.",
                            "author": "261chameleons",
                            "id": "iwcmbqv",
                            "parent_id": "t1_iwc7i2e",
                            "score": 10,
                            "created_utc": 1668447110.0,
                            "replies": []
                        },
                        {
                            "body": "At least you know now. You're not the first. It happens quite often especially when the woman is in a tough situation.",
                            "author": "Automatic_Joke_4414",
                            "id": "iwdlajf",
                            "parent_id": "t1_iwc7i2e",
                            "score": 2,
                            "created_utc": 1668460704.0,
                            "replies": []
                        },
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "iwcq5y2",
                            "parent_id": "t1_iwc7i2e",
                            "score": 2,
                            "created_utc": 1668448602.0,
                            "replies": [
                                {
                                    "body": "It’s real haha but they don’t even want to meet you IRL sometimes. they’ll pay you ASAP to prove their worth or whatever too.",
                                    "author": "hijkman2",
                                    "id": "iwdbri4",
                                    "parent_id": "t1_iwcq5y2",
                                    "score": 6,
                                    "created_utc": 1668456989.0,
                                    "replies": [
                                        {
                                            "body": "[deleted]",
                                            "author": null,
                                            "id": "iwdcvnd",
                                            "parent_id": "t1_iwdbri4",
                                            "score": 1,
                                            "created_utc": 1668457424.0,
                                            "replies": [
                                                {
                                                    "body": "Honestly I think it’s more for people who work extremely stressful jobs or mentally unwell men 😅",
                                                    "author": "hijkman2",
                                                    "id": "iwdhjmt",
                                                    "parent_id": "t1_iwdcvnd",
                                                    "score": 5,
                                                    "created_utc": 1668459234.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "I don’t even understand still what a findom is.",
                                    "author": "WoahThere_124",
                                    "id": "iwcqxve",
                                    "parent_id": "t1_iwcq5y2",
                                    "score": 1,
                                    "created_utc": 1668448900.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I believe in the underwear rule.  The moment the SB and SD are in their skivvies, there should be money exchanged.  This protects both parties as it's very unlikely a SB will take the money and run at this point and it's very unlikely the SD will not pay at this point.",
            "author": "Starshogun1",
            "id": "iwfdnz7",
            "parent_id": "t3_yv0mtl",
            "score": 6,
            "created_utc": 1668490192.0,
            "replies": []
        },
        {
            "body": "> Promised me an x.xxx allowance per meet and anything else I needed like groceries or bills and them an entire new wardrobe of the finest clothes, even said he would pay off my credit card debt and get me a new phone. I found him attractive and loved his smile, I thought my life was gonna change with him that I hit the jackpot. 😂\n\nIf it seems too good to be true, it probably is.  \n\nI'm sorry this happened to you.  I feel like in this economy there are only going to be more sketchy scammers.  \n\nAlways get cash before clothes come off so this don't happen ever again to you.",
            "author": "unique_leek_critique",
            "id": "iwc8w5j",
            "parent_id": "t3_yv0mtl",
            "score": 9,
            "created_utc": 1668441698.0,
            "replies": [
                {
                    "body": "No matter how weird I feel I will be asking before anything happens next time",
                    "author": "WoahThere_124",
                    "id": "iwcjlyy",
                    "parent_id": "t1_iwc8w5j",
                    "score": 9,
                    "created_utc": 1668446044.0,
                    "replies": [
                        {
                            "body": "Yeah I think some sketchballs prey on girls feeling weird so they don't ask for it up front.  They basically bet you're not gonna put your foot down about it.  Sucks, ruins the lifestyle for all the legit people in the bowl.  \n\nHang tough.",
                            "author": "unique_leek_critique",
                            "id": "iwd9lh5",
                            "parent_id": "t1_iwcjlyy",
                            "score": 2,
                            "created_utc": 1668456141.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Awful & I’m sorry this happened, but this is too common and I don’t understand why.. we see posts like this on the forum atleast once a week. Money before honey, no exceptions. Doesn’t matter how real or handsome he seems. Ladies, PLEASE stop taking off your panties for smoke & empty promises up your ass. Until you’ve established trust (3-4 months) of the arrangement always protect yourself & receive allowance FIRST. If he gives an excuse, excuse yourself & leave! A **real** SD will never try to confuse or stiff you. I once even made a past SD pull his phone out & paypal me the allowance as we were sitting in his bed naked about to do the deed. Awkward? Yes, but he said his mind was flustered after an important work meeting & forgot to stop by the ATM.  It was our first intimate date after 2 platonic, so it was time for him to step up. He sent it without issue and apologized, but if given the opportunity some people can & will be vultures.",
            "author": null,
            "id": "iwcb1zo",
            "parent_id": "t3_yv0mtl",
            "score": 12,
            "created_utc": 1668442583.0,
            "replies": [
                {
                    "body": "That’s why I’m so ashamed this happened. I knew better. God did I know better.",
                    "author": "WoahThere_124",
                    "id": "iwckfj7",
                    "parent_id": "t1_iwcb1zo",
                    "score": 8,
                    "created_utc": 1668446363.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "That is traumatic as fuck",
            "author": null,
            "id": "iwg0ekz",
            "parent_id": "t3_yv0mtl",
            "score": 4,
            "created_utc": 1668508906.0,
            "replies": [
                {
                    "body": "I dont see myself sugaring anytime soon after this",
                    "author": "WoahThere_124",
                    "id": "iwh901r",
                    "parent_id": "t1_iwg0ekz",
                    "score": 2,
                    "created_utc": 1668531759.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "He used some basic question asking skills and psychology on the OP.\n\nOnce he had the info he knew how to use it against you.\n\nThat is what skilled pump and dumpers do. They are the male equivalent to skilled rinsers in my eyes. \n\nLadies need rules to stick by so you don't get fucked over.\n\nOne is not going to a man house or hotel room if you don't intend on having sex. If you go there nothing happens until the transaction happens. \n\nIf you do just that one thing it'll flush out pump and dumpers.",
            "author": "southernslick",
            "id": "iwc4mc3",
            "parent_id": "t3_yv0mtl",
            "score": 9,
            "created_utc": 1668439946.0,
            "replies": [
                {
                    "body": "I expected sex, just not what he was pulling. Makes me think he’s not sane which is even scarier",
                    "author": "WoahThere_124",
                    "id": "iwcjizs",
                    "parent_id": "t1_iwc4mc3",
                    "score": 5,
                    "created_utc": 1668446012.0,
                    "replies": [
                        {
                            "body": "He did what he was going to do.\n\nWhen it's the first time it's Job No.1 to make sure the formalities are taken care of.\n\nBelieve it or not, I've had to remind women to check the gift bag. I've had one that almost left the room without taking her envelope. But I'm not that type of guy.  \n\n\nI'm not going to come down on you because this is more common that people think. Soon as you enter the room there should be a envelope, gift bag, or he needs to be pulling out his phone sending something.",
                            "author": "southernslick",
                            "id": "iwcm3st",
                            "parent_id": "t1_iwcjizs",
                            "score": 4,
                            "created_utc": 1668447024.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "He sounds like a total psycho and sick \n\nThere really were no red flags for you to see from the start ? In communication ? During intimacy ? During dinner ?\n\nIt sounds like everything was all honey for both of you until the money issue came up which is very confusing ( lovers turned to enemies because of money ? ) his fault obviously",
            "author": "shamloo77",
            "id": "iwc7bkd",
            "parent_id": "t3_yv0mtl",
            "score": 3,
            "created_utc": 1668441057.0,
            "replies": [
                {
                    "body": "No red flags at all. He talked so big on himself and his work. It wasn’t until after he said after he left he’d send it was when I knew deep down what was happening",
                    "author": "WoahThere_124",
                    "id": "iwckt87",
                    "parent_id": "t1_iwc7bkd",
                    "score": 6,
                    "created_utc": 1668446513.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "iwc1ibr",
            "parent_id": "t3_yv0mtl",
            "score": 2,
            "created_utc": 1668438630.0,
            "replies": [
                {
                    "body": "Cmon not such a comment from another SB. 🤦🏼‍♂️",
                    "author": null,
                    "id": "iwc4s43",
                    "parent_id": "t1_iwc1ibr",
                    "score": 2,
                    "created_utc": 1668440014.0,
                    "replies": [
                        {
                            "body": "Too much? What are you criticizing exactly? You know what never mind I had poor sleep last night and shouldn’t be Reddit.ing half cocked 😝",
                            "author": "P0sitiveViibes777",
                            "id": "iwc5a2v",
                            "parent_id": "t1_iwc4s43",
                            "score": 2,
                            "created_utc": 1668440222.0,
                            "replies": [
                                {
                                    "body": "It was a great comment - just up voted 😘 Why did you delete it? It was the best on this thread.  Don't ever let anyone's criticism (if it was) knock your confidence. Stay POsitive with the viibes :)",
                                    "author": "LondonSugarDaddy",
                                    "id": "iwc6kl6",
                                    "parent_id": "t1_iwc5a2v",
                                    "score": 2,
                                    "created_utc": 1668440753.0,
                                    "replies": [
                                        {
                                            "body": "Thanks! No, I believe in myself and my experience and wisdom…. but it was a little harsh to direct at one individual in particular. It was the right words in the wrong setting.",
                                            "author": "P0sitiveViibes777",
                                            "id": "iwc8uj1",
                                            "parent_id": "t1_iwc6kl6",
                                            "score": 1,
                                            "created_utc": 1668441680.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "Yes, it was kinda harsh and a little victim blaming. More like kicking someone when they are down. Username didn’t check out on that one 😉",
                                    "author": null,
                                    "id": "iwc6zla",
                                    "parent_id": "t1_iwc5a2v",
                                    "score": 1,
                                    "created_utc": 1668440923.0,
                                    "replies": [
                                        {
                                            "body": "Thanks for the feedback! I do get exasperated by the negativity toward men. But that is not the OP’s fault. That was really a scumbag thing to do to her.",
                                            "author": "P0sitiveViibes777",
                                            "id": "iwc8f8i",
                                            "parent_id": "t1_iwc6zla",
                                            "score": 4,
                                            "created_utc": 1668441507.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Wow, thanks for sharing and so sorry this pathetic excuse for a human being crossed paths with you. You did get played, but it was obviously out of your honest desire to enjoy what seemed like a sincere connection with a man who made you feel good aside from promising the help you needed. Unfortunately, it's men like that who poison the bowl and make things difficult for the rest of us. I hope you find a truly amazing SD and that helps erase this negative memory.",
            "author": "GH-SD",
            "id": "iwequu9",
            "parent_id": "t3_yv0mtl",
            "score": 2,
            "created_utc": 1668478834.0,
            "replies": []
        },
        {
            "body": "Feels awful to say this but most SDs are jus looking for a struggling desperate woman they can use for cheap... ur better than this sorry u why thru that... just remember the words from a grown man in a temper tantrum do not define u",
            "author": "Free-Gain8892",
            "id": "iwew38o",
            "parent_id": "t3_yv0mtl",
            "score": 2,
            "created_utc": 1668481134.0,
            "replies": [
                {
                    "body": "He legitimately got off on my struggles so I fully believe it",
                    "author": "WoahThere_124",
                    "id": "iwh98lm",
                    "parent_id": "t1_iwew38o",
                    "score": 1,
                    "created_utc": 1668531853.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Female here just wanted to add, anytime you agree to go back to man's room or house, expect he's leading you there for sex. SD or not, that's why they are asking you back to their place. \n\nIf you're not ready for sex, the answer to \"go back and have a drink,\" should be no.",
            "author": "DarkEyes87",
            "id": "ix089ls",
            "parent_id": "t3_yv0mtl",
            "score": 2,
            "created_utc": 1668884558.0,
            "replies": []
        },
        {
            "body": "OMG … I am so sorry this happened to you.  May he get what’s coming to him.  That is absolutely disgusting to take advantage of you like that.",
            "author": "PracticePositive69",
            "id": "iwdanuz",
            "parent_id": "t3_yv0mtl",
            "score": 2,
            "created_utc": 1668456560.0,
            "replies": []
        },
        {
            "body": "Literally evrrytime and sd asks about paying loans and cc debt, it's a scam. Or so it seems like.",
            "author": "Life-Mistake-2279",
            "id": "iwc16do",
            "parent_id": "t3_yv0mtl",
            "score": 4,
            "created_utc": 1668438487.0,
            "replies": [
                {
                    "body": "I just didn’t see how I could’ve gotten scammed then, but as soon as he said about hotel wifi or whatever his fake reason for not sending it then I deep down knew. My heart aches.",
                    "author": "WoahThere_124",
                    "id": "iwcko7d",
                    "parent_id": "t1_iwc16do",
                    "score": 5,
                    "created_utc": 1668446457.0,
                    "replies": [
                        {
                            "body": "You mentioned you're in a financially desperate situation. Its human psychology when you're desperate you hold on to the glimmer of hope and put out a lot more to latch on to that hope. Con artists know this and prey on it.",
                            "author": "karmaextract",
                            "id": "iwcz0lu",
                            "parent_id": "t1_iwcko7d",
                            "score": 2,
                            "created_utc": 1668452018.0,
                            "replies": []
                        },
                        {
                            "body": "I got scammed before.  It's not necessary a lack of intelligence at all btw.  It's okay to have a trusting nature. Try not to let the experience ruin you with doubt.  It did me for years after and all I did was hurt myself that way.\n\nJust learn from it, and be aware that people can do it and move on.  It's all you can do",
                            "author": "Life-Mistake-2279",
                            "id": "iwckybe",
                            "parent_id": "t1_iwcko7d",
                            "score": 2,
                            "created_utc": 1668446569.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "iwcd3zl",
            "parent_id": "t3_yv0mtl",
            "score": 2,
            "created_utc": 1668443425.0,
            "replies": [
                {
                    "body": "So low. And to call me all those names. 😔",
                    "author": "WoahThere_124",
                    "id": "iwckv7n",
                    "parent_id": "t1_iwcd3zl",
                    "score": 1,
                    "created_utc": 1668446534.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I'm so sorry this happened to you. What a piece of horrible s*** this guy is.\n\nNot only did he take advantage of you, he also gave you hope that might be an answer to your current problems.\n\nA complete and Utter asshole.\n\nI've also been played before by some SBs. Hurts like hell when someone takes advantage of you. I hope things turn out better.",
            "author": "TonyMarcaroni",
            "id": "iwdxcme",
            "parent_id": "t3_yv0mtl",
            "score": 2,
            "created_utc": 1668465653.0,
            "replies": []
        },
        {
            "body": "Damn I’m sorry.  No exceptions next time. You just don’t know the guy and if he’s for real, he’ll care about what you need to feel safe and secure. He probably read that you were in need and took advantage.",
            "author": "JSBelle",
            "id": "iwe33qm",
            "parent_id": "t3_yv0mtl",
            "score": 2,
            "created_utc": 1668468118.0,
            "replies": []
        },
        {
            "body": "An asshole and a moron that does not value his time. It's more cost effective to pay ppm and line up dates #2, #3, etc., then to go back on SA for hours to find someone else to scam. Plus, you don't have to be a shitty person that makes other people feel like shit.",
            "author": "whatever-tata",
            "id": "iwc7i35",
            "parent_id": "t3_yv0mtl",
            "score": 3,
            "created_utc": 1668441131.0,
            "replies": []
        },
        {
            "body": "I have had several ladies run off with the money by paying a deposit or paying the forehand. If it's PPM, I will pay cash in person. There are discrete and relaxed ways to do it without it feeling like a transaction. And I have had a few babies walk away because I won't pay up front. But SDS don't enjoy getting ripped off, just like SBS don't enjoy getting taken advantage of\n\nI'm sorry this scenario happened to you sweetie. It really does just make it difficult for the good people out there.",
            "author": "Assasinenzio",
            "id": "iwcgbvp",
            "parent_id": "t3_yv0mtl",
            "score": 1,
            "created_utc": 1668444734.0,
            "replies": [
                {
                    "body": "I would be thankful and blessed if I could just get it at time of meet, I just knew better. I’m beating myself up over this",
                    "author": "WoahThere_124",
                    "id": "iwckyhq",
                    "parent_id": "t1_iwcgbvp",
                    "score": 3,
                    "created_utc": 1668446571.0,
                    "replies": [
                        {
                            "body": "Don't beat yourself up. We all make mistakes this is how we learn.\nI know one girl I can trust. I have sent her money a week in advance before a date. And she has also waited a day or two for me to pay her. But finding that is relatively rare.\n\nJust keep searching, you will find what you need in time. You have a lot of support here on both sides of the fence.",
                            "author": "Assasinenzio",
                            "id": "iwcm48q",
                            "parent_id": "t1_iwckyhq",
                            "score": 0,
                            "created_utc": 1668447028.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": ">I recently started back sugaring after losing my job unexpectedly from a 3 month break.\n\nYou girls never want to hear it, but again and again, don't sugar if you are desperate for money.  It leads you to ignore red flags and exposes you to all sorts of predators who *can* smell your desperation.",
            "author": null,
            "id": "iwd5sqg",
            "parent_id": "t3_yv0mtl",
            "score": 1,
            "created_utc": 1668454668.0,
            "replies": []
        },
        {
            "body": "The promise of money can be very manipulative. \n\nReading here has taught me about the risks that women go through. I’m pretty sure, looking back, that the times when intimacy came before direct financial support, I had already gone shopping, paid for a trip etc. That’s kind of how things were done in the old days. \n\nI’ve given people “gifts” at the end of a M&G when we haven’t progressed to an arrangement. I’ve paid for gas/travel but often I’m the one who hasn’t wanted to proceed. I’ve never been robbed. I’ve also learned that even when there isn’t an explicit discussion of $$$ that there is the implicit hope that financial support will occur. \n\nThe first thing to suspect was him describing himself as “findom” … and too good to be true. You were manipulated with false promises — future faking. Sign of a narcissist/psychopath.",
            "author": "daddoms",
            "id": "iwc5zo3",
            "parent_id": "t3_yv0mtl",
            "score": 1,
            "created_utc": 1668440515.0,
            "replies": [
                {
                    "body": "Yes the risks are unreal. I don’t wanna seem transactional or pushy but with him I felt safe.",
                    "author": "WoahThere_124",
                    "id": "iwcldfr",
                    "parent_id": "t1_iwc5zo3",
                    "score": 3,
                    "created_utc": 1668446735.0,
                    "replies": [
                        {
                            "body": "You aren’t coming across as transactional **at all**. From the sound of it he was making promises and then ghosted you.",
                            "author": "daddoms",
                            "id": "iwdayio",
                            "parent_id": "t1_iwcldfr",
                            "score": 1,
                            "created_utc": 1668456675.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "If you lived close to me, I would give you a gift just for going to dinner to make up for this scumbag :(",
            "author": "theheartsmaster",
            "id": "iwe8tpi",
            "parent_id": "t3_yv0mtl",
            "score": 1,
            "created_utc": 1668470653.0,
            "replies": []
        },
        {
            "body": "Your conclusion is pretty common sense, I guess not so common 'round these parts, though.",
            "author": null,
            "id": "iwcnhl7",
            "parent_id": "t3_yv0mtl",
            "score": 1,
            "created_utc": 1668447567.0,
            "replies": []
        },
        {
            "body": "Karma will get him, hopefully.",
            "author": "SDinAsia",
            "id": "iwcoslo",
            "parent_id": "t3_yv0mtl",
            "score": 1,
            "created_utc": 1668448076.0,
            "replies": [
                {
                    "body": "I want to be Karma. Ugh I want him to pay",
                    "author": "WoahThere_124",
                    "id": "iwd3tm9",
                    "parent_id": "t1_iwcoslo",
                    "score": 1,
                    "created_utc": 1668453894.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Lots of con men out there, in all areas of life, unfortunately.  This guy is a real shit. When it sounds too good to be true…",
            "author": "Odd-Luck7658",
            "id": "iwcp476",
            "parent_id": "t3_yv0mtl",
            "score": 1,
            "created_utc": 1668448200.0,
            "replies": [
                {
                    "body": "I will never take words to heart again for many reasons he made me realize",
                    "author": "WoahThere_124",
                    "id": "iwd3s7s",
                    "parent_id": "t1_iwcp476",
                    "score": 1,
                    "created_utc": 1668453879.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Yup! He over promised to get exactly what he wanted which is why we need to stand our ground. Thats fucked up and i hope karma gets his ass. So sorry you went through that. Ive made mistakes too so I know exactly how you feel.",
            "author": "Awkward_Pop_3996",
            "id": "iwcvp54",
            "parent_id": "t3_yv0mtl",
            "score": 1,
            "created_utc": 1668450746.0,
            "replies": []
        },
        {
            "body": "Yep, it has happened to me as well. I then always say oh so you have my shopping ,$ before the clothes come off.",
            "author": "freckles116",
            "id": "iwcyrmy",
            "parent_id": "t3_yv0mtl",
            "score": 1,
            "created_utc": 1668451926.0,
            "replies": []
        },
        {
            "body": "I’m sorry this happened to you, and I’m sorry that you’ve had a rough week.  Don’t let this get you down.  It was an expensive lesson that you definitely won’t forget.  Dude was a manipulative scumbag and not a SD.  I hope that you meet a SD who will be good to you and will make the holidays bright for you.",
            "author": "NVOkie9018",
            "id": "iwdcz9r",
            "parent_id": "t3_yv0mtl",
            "score": 1,
            "created_utc": 1668457464.0,
            "replies": []
        },
        {
            "body": "In a world where the heart is involved… we all get scammed. Hugs to you and with each passing year we learn even more of life. Be safe and healthy!",
            "author": "Organic-Med-1999",
            "id": "iwde0js",
            "parent_id": "t3_yv0mtl",
            "score": 1,
            "created_utc": 1668457865.0,
            "replies": []
        },
        {
            "body": "Ugh, so sorry! This is a terrible, terrible feeling. The closest I’ve gotten (I was a newb) was being too shy to discuss money and wait for the “donation” at the end…because I never even brought up dollar amounts!\nSo when it’s over he explains to me that a “mutually beneficial relationship” = I got sex too 😆\n\nI wish I wouldn’t let this bother me so badly, I totally get why you are upset!",
            "author": "spooningTHENforking",
            "id": "iwdpjun",
            "parent_id": "t3_yv0mtl",
            "score": 1,
            "created_utc": 1668462401.0,
            "replies": []
        },
        {
            "body": "The problem wasn’t him. You probably were so pressed l, by your financial situation, that you turned off all your warning systems. Sugaring in need can put you in very difficult spots. Don’t let one bad apple to make you think all apples are rotten. \nKeep your mind clear and pay attention to early signs.",
            "author": "gapaf",
            "id": "iwdqwmm",
            "parent_id": "t3_yv0mtl",
            "score": 1,
            "created_utc": 1668462949.0,
            "replies": []
        },
        {
            "body": "Funny I had a guy say this to me and wants to spend the night with me just cuddling.  Honestly it sounds to good to be true. He wants to make this a long term thing. But things aren’t adding up for me. He’s incredibly needy, he is always fishing for compliments, if I don’t respond fright away he tries to guilt me by saying oh I’m not for everyone, oh you ghosted me. We had a all set for Friday and he never called. I don’t like to just call people especially in this type of situation as a Procuddler not a SB. You never know what they have going on in life. Then he blasts texts this morning. I was like well you never called me and explained why I didn’t call him. Then he tried to lay on the guilt. \n\nYou story made me rethink it more than I already was. I’m sorry he did that to you. I hope you find someone who deserves you!",
            "author": "Fun_Branch_9614",
            "id": "iwdtenb",
            "parent_id": "t3_yv0mtl",
            "score": 1,
            "created_utc": 1668463980.0,
            "replies": []
        },
        {
            "body": "Never ever ever!!! Sleep with them unless there is trust and a few paid dates!!!! \nIf they want instant sex get a prostitute",
            "author": "Zealousideal_Map8100",
            "id": "iwdxyb9",
            "parent_id": "t3_yv0mtl",
            "score": 1,
            "created_utc": 1668465909.0,
            "replies": [
                {
                    "body": "I would go on as many dates as necessary, take afternoons to get each other. \n\nBut I would never give a cents beyond expected transport fees. (At least that's my current way of doing things, since I got rinsed not too long ago).",
                    "author": "No-Victory-9096",
                    "id": "iwe84tw",
                    "parent_id": "t1_iwdxyb9",
                    "score": 1,
                    "created_utc": 1668470340.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "What kind of restaurant did the guy bring you too ? What kind of hotel ?\n\nIf he a guy can do a XXXX ppm, I can guarantee you the setting of the meeting should not be average. That's quite easy to spot.\n\n(I do ppm after now, because I got \"rinsed\" two times, and I hate that feeling. Maybe the fact I go to the best restaurants help with trust - lmao ).",
            "author": "No-Victory-9096",
            "id": "iwe5a3f",
            "parent_id": "t3_yv0mtl",
            "score": 1,
            "created_utc": 1668469074.0,
            "replies": []
        },
        {
            "body": "So sorry this happened to you.  As I like to say, there are great people on SA (not so sure about SB) but you have to wade through oceans of garbage to find them.  Sometimes we all learn the hard way.  Forgive yourself, lesson learned, keep searching.  Good luck.",
            "author": "CapableBother",
            "id": "iwe945c",
            "parent_id": "t3_yv0mtl",
            "score": 1,
            "created_utc": 1668470787.0,
            "replies": []
        },
        {
            "body": "I am so so sorry that you had to go through this and hear those awful things. Be extra kind and gentle to yourself this week",
            "author": "Big_Contribution_460",
            "id": "iweancb",
            "parent_id": "t3_yv0mtl",
            "score": 1,
            "created_utc": 1668471481.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "iwconf0",
            "parent_id": "t3_yv0mtl",
            "score": -1,
            "created_utc": 1668448020.0,
            "replies": [
                {
                    "body": "Findom is a rare type of BDSM in which the sub enjoys letting a domme take control of some of his money.  It’s not “give me money for existing” like a lot of women who want to be FinDommes seem to think, but it’s also not something many men would be interested in.  Him referring to *himself* as a FinDom was a huge red flag she seems to have missed… it would imply he wanted to take control of *her* finances, which… I guess he did.",
                    "author": "UseTheForceRey",
                    "id": "iwd586v",
                    "parent_id": "t1_iwconf0",
                    "score": 3,
                    "created_utc": 1668454447.0,
                    "replies": []
                },
                {
                    "body": "I honestly have 0 clue. It sounded to me like it was wanting to give money and being in control of their users lives? Or either just give money away? If anyone tells me they’re that I am running in future lol",
                    "author": "WoahThere_124",
                    "id": "iwd3yg3",
                    "parent_id": "t1_iwconf0",
                    "score": 1,
                    "created_utc": 1668453947.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Dang some bitch did him dirty before",
            "author": "lcastill1",
            "id": "iwcw7kj",
            "parent_id": "t3_yv0mtl",
            "score": -3,
            "created_utc": 1668450944.0,
            "replies": []
        },
        {
            "body": "Thank you for the reminder. Sorry you had to go through that. \nHave you looked at nearby charities for children’s winter clothes or online free exchange sites?",
            "author": "261chameleons",
            "id": "iwclpp5",
            "parent_id": "t3_yv0mtl",
            "score": 1,
            "created_utc": 1668446870.0,
            "replies": [
                {
                    "body": "I’ve not asked for help from a church or ministry since I lived with my parents years back, I wouldn’t know where to start. I do however plan to stop by once upon a child once my strut gets replaced (I hit a dog this morning and damaged my strut) dog didn’t survive either 😭 but owners weren’t upset. It’s been a hell of a week!",
                    "author": "WoahThere_124",
                    "id": "iwd4cbr",
                    "parent_id": "t1_iwclpp5",
                    "score": 3,
                    "created_utc": 1668454100.0,
                    "replies": [
                        {
                            "body": "I’m sorry. I hope things turn better for you.",
                            "author": "261chameleons",
                            "id": "iwdti3o",
                            "parent_id": "t1_iwd4cbr",
                            "score": 2,
                            "created_utc": 1668464020.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "He is just scum. He doesn't deserve a second of your humanity. Best wishes for next time soon.",
            "author": "This-Organization-11",
            "id": "iwgzegq",
            "parent_id": "t3_yv0mtl",
            "score": 1,
            "created_utc": 1668527936.0,
            "replies": [
                {
                    "body": "Thank you 🙏",
                    "author": "WoahThere_124",
                    "id": "iwh8z35",
                    "parent_id": "t1_iwgzegq",
                    "score": 2,
                    "created_utc": 1668531748.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "This is y I stepped away from the lifestyle the \"care\" factor completely disappeared the men are narcissistic abusers and the women are bitter and greedy. This is not wat this lifestyle is about but as with everything it's been perverted into something disgusting enough to fit perfectly in this pathetic excuse for a society.",
            "author": "Free-Gain8892",
            "id": "iwhbf8j",
            "parent_id": "t3_yv0mtl",
            "score": 1,
            "created_utc": 1668532716.0,
            "replies": []
        },
        {
            "body": "I think the issue is women don't really want to be in this lifestyle it's just an attempt at a life they see in the movies and the wait until they're desperate and hop in assuming u meet a guy and boom he throws money ur way and that's not logical... I had a 2 date minimum rule before money or sex is even discussed... if she won't take the time to get to know me before trying to raid my wallet then she and I have nothing in common",
            "author": "Free-Gain8892",
            "id": "iwhe96v",
            "parent_id": "t3_yv0mtl",
            "score": 1,
            "created_utc": 1668533819.0,
            "replies": []
        },
        {
            "body": "Definitely this!",
            "author": "WoahThere_124",
            "id": "iwcje8f",
            "parent_id": "t1_iwc5ran",
            "score": 7,
            "created_utc": 1668445961.0,
            "replies": []
        },
        {
            "body": "Couldn't agree more!",
            "author": "AusterlitzSD",
            "id": "iwe8sap",
            "parent_id": "t1_iwc5ran",
            "score": -1,
            "created_utc": 1668470635.0,
            "replies": []
        },
        {
            "body": "It’s broke me inside. He mocked me for it after calling me a terrible mother. I didn’t even finish reading his response",
            "author": "WoahThere_124",
            "id": "iwdjtet",
            "parent_id": "t1_iwdi7yz",
            "score": 13,
            "created_utc": 1668460120.0,
            "replies": [
                {
                    "body": "I hope you don’t believe any of his words. He’s a terrible person, and I’m sorry you had the misfortune of being subjected to that.",
                    "author": "Actually_a_bot_accnt",
                    "id": "iwfvqp6",
                    "parent_id": "t1_iwdjtet",
                    "score": 8,
                    "created_utc": 1668504638.0,
                    "replies": []
                },
                {
                    "body": "I'm sorry and hope you find an amazing SD",
                    "author": "mmarquisdesade",
                    "id": "iweqnwa",
                    "parent_id": "t1_iwdjtet",
                    "score": 5,
                    "created_utc": 1668478749.0,
                    "replies": []
                },
                {
                    "body": "Did he use a condom? Or did he finish inside of you raw?",
                    "author": "ImWorried2017",
                    "id": "iwei2vr",
                    "parent_id": "t1_iwdjtet",
                    "score": -2,
                    "created_utc": 1668474900.0,
                    "replies": []
                },
                {
                    "body": "Hey again I'm so sorry...you seem so sincere and like you'd be an AMAZING SB!! I feel the same as you do in reverse; as though my SB doesn't appreciate me as I should be appreciated and i KNOW i've taken care of her so I do feel your pain!",
                    "author": "mmarquisdesade",
                    "id": "iwmspm2",
                    "parent_id": "t1_iwdjtet",
                    "score": 1,
                    "created_utc": 1668629843.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Thank you 🙏",
            "author": "WoahThere_124",
            "id": "iwck73p",
            "parent_id": "t1_iwc16h9",
            "score": 9,
            "created_utc": 1668446273.0,
            "replies": []
        },
        {
            "body": "\"Imagine if she runs off with it\"\n\n I'd rather know she's a crook up front so I don't have to worry about it. I may lose a couple xxx here and there.  I consider it the cost of doing business/sugar.  100% agree that a SB should NEVER have to ask.",
            "author": "NoBagelNoBagel1",
            "id": "iwd3rku",
            "parent_id": "t1_iwc1lkq",
            "score": 25,
            "created_utc": 1668453872.0,
            "replies": [
                {
                    "body": "I agree with you 100%. I rarely make a strong connection, but when I do, I often pay as much as a month's allowance in advance. From my perspective, if I really like someone, I can afford to lose that money much more than I can afford to get involved with the wrong kind of person and have them hurt me emotionally. So if they'll disappear after getting the money, then so be it. I'd much rather not sleep with someone who didn't want to be intimate with me anyway.",
                    "author": "GH-SD",
                    "id": "iwerjk9",
                    "parent_id": "t1_iwd3rku",
                    "score": 15,
                    "created_utc": 1668479138.0,
                    "replies": []
                },
                {
                    "body": ">I'd rather know she's a crook up front so I don't have to worry about it.\n\nSome men prefer to use the money as a pressure to fuck the crook who's intention was to run off. LOL",
                    "author": "A-touchofreality",
                    "id": "iwdwoem",
                    "parent_id": "t1_iwd3rku",
                    "score": 3,
                    "created_utc": 1668465365.0,
                    "replies": [
                        {
                            "body": "Idk.  Pressuring people into fucking isn't my thing.  I know some men get off on it.",
                            "author": "NoBagelNoBagel1",
                            "id": "iwe5ouo",
                            "parent_id": "t1_iwdwoem",
                            "score": 4,
                            "created_utc": 1668469258.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "iwc7jpc",
            "parent_id": "t1_iwc1lkq",
            "score": 15,
            "created_utc": 1668441150.0,
            "replies": [
                {
                    "body": "How can she completely secure it if you give it to her in the hotel room?\nSerious question that I have pondered. There’s always a risk that an SD can steal it out of her purse, right?",
                    "author": "261chameleons",
                    "id": "iwcm904",
                    "parent_id": "t1_iwc7jpc",
                    "score": 5,
                    "created_utc": 1668447081.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "iwcmq4t",
                            "parent_id": "t1_iwcm904",
                            "score": 8,
                            "created_utc": 1668447267.0,
                            "replies": [
                                {
                                    "body": "True. But unfortunately the norm in sugaring seems to be accelerated intimacy.",
                                    "author": "261chameleons",
                                    "id": "iwdtbq6",
                                    "parent_id": "t1_iwcmq4t",
                                    "score": 2,
                                    "created_utc": 1668463946.0,
                                    "replies": []
                                },
                                {
                                    "body": "But that just isn't true.  Unless the guy has been screened (full name, place of employment, successful enough he has something to lose).  There are lots of stories of johns robbing girls in private spaces.\n\nA really young SB posted awhile ago about going to a new SD's house.  He gives her the payment, but rifles through her bag while she's sleeping, removes her drivers license and leaves it on the counter and removes the ppm.\n\nAddresses her by her real name in the morning, implying if she says anything about the rape and theft he will blackmail her to her parents.",
                                    "author": "Fair_Rhubarb28",
                                    "id": "iwdj7m5",
                                    "parent_id": "t1_iwcmq4t",
                                    "score": 2,
                                    "created_utc": 1668459880.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "I do usually give her the PPM before intimacy, but it’s in a sealed envelope, and if I saw her open it and count it, I’d probably be unlikely to see her again.   It’s not supposed to be a payment for a service, where she has to count to make sure she got the right amount before we have sex.  Yes, that *is* too transactional.  I’m giving what I promised and over time I’ll give more, but it shouldn’t feel like “I’m only having sex with you because you handed over the exact amount we discussed…” or that just doesn’t feel like sugar to me.",
                    "author": "UseTheForceRey",
                    "id": "iwcnh8n",
                    "parent_id": "t1_iwc7jpc",
                    "score": -10,
                    "created_utc": 1668447563.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "iwcokf3",
                            "parent_id": "t1_iwcnh8n",
                            "score": 14,
                            "created_utc": 1668447988.0,
                            "replies": [
                                {
                                    "body": "I had someone do that too.  She skedaddled out the door while I was in the bathroom.",
                                    "author": "aajniojnoihnoi",
                                    "id": "iwd1kce",
                                    "parent_id": "t1_iwcokf3",
                                    "score": -2,
                                    "created_utc": 1668453013.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "I can absolutely understand the turn off of someone counting the money in front of you. But we also know the cases of 'SD' having cut journals in the size of $ bills, or even using Monopoly money to put in closed envelopes.\n\nSo I would suggest to avoid both situations by giving it in an open envelope, and then go for a moment to the bathroom or create another occasion where she can discretely check if the contains of the envelope are as agreed upon?",
                            "author": "A-touchofreality",
                            "id": "iwe064t",
                            "parent_id": "t1_iwcnh8n",
                            "score": 7,
                            "created_utc": 1668466849.0,
                            "replies": [
                                {
                                    "body": "No.  I would find it off-putting.  It’s not supposed to be a payment for a service.  If she’s willing to fuck me, she should trust me enough that I’m not going to do that.   I gave her a gift after the M&G.  I’ve taken her to a nice dinner. Now I’ve handed her an envelope before we are intimate.   She can trust me at that point.   Some other guys have used fake bills or whatever… I’m not them, and that’s an awful lot of fucking effort to save a few bucks.  I would argue it makes more sense to spend time getting to know the guy to the point this ain’t a concern.  If you’re going to a hotel with a guy you just met after a coffee, the risk of a scam is high.  If you’ve had a M&G, gotten a gif, and now another date, I think the risk is very low, and this isn’t supposed to be pay for play.",
                                    "author": "UseTheForceRey",
                                    "id": "iwe1a4v",
                                    "parent_id": "t1_iwe064t",
                                    "score": -2,
                                    "created_utc": 1668467330.0,
                                    "replies": [
                                        {
                                            "body": "I  understand, and agree with your POV after having proved already some reliability to your Pot SB.  I personally never felt the need to check and have never been scammed either. But we are probably both in a section of the bowl where things like this not usually happen.\n\nReading others' experiences on sugar forums unfortunately taught me a lot about other, uglier, sections where these things do happen more frequently. Don't underestimate how far some scammers go, and how vulnerable some of their targets are.",
                                            "author": "A-touchofreality",
                                            "id": "iwe469y",
                                            "parent_id": "t1_iwe1a4v",
                                            "score": 2,
                                            "created_utc": 1668468586.0,
                                            "replies": [
                                                {
                                                    "body": "Yes, I think that's a good point.    None of the SBs I've ever seen has counted, but I would recommend counting if it was more of a \"we just met, let's go have sex now\" situation.",
                                                    "author": "UseTheForceRey",
                                                    "id": "iwe7ghc",
                                                    "parent_id": "t1_iwe469y",
                                                    "score": 0,
                                                    "created_utc": 1668470039.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "Agreed. Plus over time, trust will be built, and everything should naturally go more smoothly.",
                                    "author": "LaylaSB",
                                    "id": "iwfowi7",
                                    "parent_id": "t1_iwe064t",
                                    "score": 1,
                                    "created_utc": 1668498561.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "But it *IS* a service. Idk how y’all play mental gymnastics in your head trying to convince yourselves that it’s not lmao. At this point, You’re hiring nothing more than an actress pretending to like you.",
                            "author": "ImWorried2017",
                            "id": "iweig66",
                            "parent_id": "t1_iwcnh8n",
                            "score": 3,
                            "created_utc": 1668475068.0,
                            "replies": [
                                {
                                    "body": "Lol.   This is *exactly* my point.  I am *not* hiring anyone to act or provide a service.  If that is her intent, she’s not an SB and she should move on to someone who wants that shit.  \n\nJust because you don’t understand the difference between escorting and sugar dating doesn’t mean that there are no SBs out there who genuinely want to date someone who’s supporting them, not put on an act.",
                                    "author": "UseTheForceRey",
                                    "id": "iweq1qm",
                                    "parent_id": "t1_iweig66",
                                    "score": 1,
                                    "created_utc": 1668478477.0,
                                    "replies": [
                                        {
                                            "body": "Whatever helps you sleep at night 🙄 \n\nTake away the PPM or allowance and see how long she sticks around",
                                            "author": "ImWorried2017",
                                            "id": "iweqwtf",
                                            "parent_id": "t1_iweq1qm",
                                            "score": 3,
                                            "created_utc": 1668478858.0,
                                            "replies": [
                                                {
                                                    "body": "Why would I want to stop financially supporting someone who I am dating?",
                                                    "author": "UseTheForceRey",
                                                    "id": "iweu5cg",
                                                    "parent_id": "t1_iweqwtf",
                                                    "score": -2,
                                                    "created_utc": 1668480266.0,
                                                    "replies": [
                                                        {
                                                            "body": "Here’s a pretty [valid reason](https://www.reddit.com/r/sugarlifestyleforum/comments/yuu3u2/sd_wants_to_stop_arrangement_and_for_us_to_start/?utm_source=share&utm_medium=ios_app&utm_name=iossmf). Sugar dating is one sided. One side is offering financial compensation. The other is offering their… ~~body~~  “time”? When both parties should be offering their time instead without money being an issue.",
                                                            "author": "ImWorried2017",
                                                            "id": "iwewz0q",
                                                            "parent_id": "t1_iweu5cg",
                                                            "score": 1,
                                                            "created_utc": 1668481540.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "I've heard of girls getting fake bills before, or one real benji on top of the rest monopoly money, so them glancing at it probably isn't out of bounds.  Not saying she has to take out of a bank blue light pen and check with a counterfeit pen, but opening it up and taking a peek it's all there imo is a good idea on the first intimate encounter.",
                            "author": "KarensSmokeShop",
                            "id": "iwekiqr",
                            "parent_id": "t1_iwcnh8n",
                            "score": 3,
                            "created_utc": 1668476016.0,
                            "replies": [
                                {
                                    "body": "Disagreed, for the reasons stated above.  No number of downvotes from SBs is going to change that.",
                                    "author": "UseTheForceRey",
                                    "id": "iwepptz",
                                    "parent_id": "t1_iwekiqr",
                                    "score": -2,
                                    "created_utc": 1668478332.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "In six years of sugaring, I got robbed... once. I would have paid 10x, 20x that amount to make sure every SB I have been with feels comfortable and safe.",
            "author": "TastySpermDevice",
            "id": "iwc3dj9",
            "parent_id": "t1_iwc1lkq",
            "score": 31,
            "created_utc": 1668439426.0,
            "replies": []
        },
        {
            "body": "Completely agree! \n\nThe sooner SDs understand and accept that the risk of \"being had\" is not equivalent (i.e. you lose a bit of money, she loses a sense of dignity!), the better we will all be in this lifestyle.\n\nBe a Man and set her mind at ease!",
            "author": "AusterlitzSD",
            "id": "iwc8brb",
            "parent_id": "t1_iwc1lkq",
            "score": 17,
            "created_utc": 1668441468.0,
            "replies": [
                {
                    "body": ">> The sooner SDs understand and accept that the risk of \"being had\" is not equivalent (i.e. you lose a bit of money, she loses a sense of dignity!), the better we will all be in this lifestyle.\n\nPlease explain how the risk is not equivalent.  Scenario 1:  she has sex with him, doesn’t get money.   Scenario 2: he gives her money, she runs off.  In *both* cases the “loss” is money.   She didn’t “lose her dignity.”   She didn’t “lose” sex.  She had sex with him and lost the money. It is *exactly* equivalent — in either scenario one loses out on the same amount of money, and does so because the other person lied to them.  Both are shitty, but the “oh she lost her dignity” is nonsense— she fucked a guy she was willing to fuck — she lost money not dignity.",
                    "author": "tempsdforfuns",
                    "id": "iwcovkk",
                    "parent_id": "t1_iwc8brb",
                    "score": -7,
                    "created_utc": 1668448107.0,
                    "replies": [
                        {
                            "body": "Let's say I buy your argument that it's ALL about the money and that how she feels about it is \"nonsense\". Do you think that the loss of the same amount of money has the same impact on a SD and a SB's life?! You're rich (at least you're supposed to be), she's not! xxx$ might help her pay her rent, or buy food; xxx$ is a freaking blip in my bank account! \n\nHey man, I've been played in the past and it's not pleasant! But I was mad because I hated the feeling of being had, not because the loss of money made any difference in my life. A SB who gives sex without receiving money suffers both ways.",
                            "author": "AusterlitzSD",
                            "id": "iwcs9w0",
                            "parent_id": "t1_iwcovkk",
                            "score": 13,
                            "created_utc": 1668449422.0,
                            "replies": [
                                {
                                    "body": "I agree with you that the loss of money has to be more impactful to the SB.  I also have given the PPM first in most cases.  I just hate the “it doesn’t matter if the SB plays an SD, it’s just money” argument… the impact of getting played is there whether that money is significant or not.",
                                    "author": "tempsdforfuns",
                                    "id": "iwd0avy",
                                    "parent_id": "t1_iwcs9w0",
                                    "score": -1,
                                    "created_utc": 1668452516.0,
                                    "replies": [
                                        {
                                            "body": "So when you put it like that, then I agree with you!",
                                            "author": "AusterlitzSD",
                                            "id": "iwd1dc3",
                                            "parent_id": "t1_iwd0avy",
                                            "score": 3,
                                            "created_utc": 1668452937.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "You can't imagine how it is to be vulnerable and getting naked with a stranger, alone in a room, kissing, trusting him with your body, allowing him *INSIDE* you? Maybe even cuddle and some pillow talk afterwards?\n\nOnly to find out that all this intimate time together he fully *KNEW* he was going to purposely scam you?\n\nAnd you thinks this is the same risk as losing a couple of $ that might equal to what he would thoughtless spend on a good bottle of wine in an expensive restaurant?",
                            "author": "A-touchofreality",
                            "id": "iwdz1jl",
                            "parent_id": "t1_iwcovkk",
                            "score": 3,
                            "created_utc": 1668466372.0,
                            "replies": [
                                {
                                    "body": "I highly doubt that the same guy who is thoughtlessly spending a PPM on a bottle of wine is the guy who’s skipping out on the PPM.   The guy who’s skipping out on the PPM is probably taking you to the Applebee’s next to the Red Roof Inn where he’s going to fuck you, and doesn’t drink wine that doesn’t come in a box.",
                                    "author": "tempsdforfuns",
                                    "id": "iwebad9",
                                    "parent_id": "t1_iwdz1jl",
                                    "score": 1,
                                    "created_utc": 1668471770.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Recently offered a London-based SB cash. She said she preferred bank transfer. I tried to get her info right then and there, she said she’d WhatsApp it to me. She waited until late the next day. I guess she felt she could trust me?",
            "author": null,
            "id": "iwc4ki8",
            "parent_id": "t1_iwc1lkq",
            "score": 1,
            "created_utc": 1668439924.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "iwfcuv3",
                    "parent_id": "t1_iwc4ki8",
                    "score": 1,
                    "created_utc": 1668489673.0,
                    "replies": [
                        {
                            "body": "Hmmm I hadn’t thought of that. It wasn’t her first SA rodeo. But who knows?",
                            "author": null,
                            "id": "iwfikpi",
                            "parent_id": "t1_iwfcuv3",
                            "score": 1,
                            "created_utc": 1668493585.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "iwhelyw",
                                    "parent_id": "t1_iwfikpi",
                                    "score": 1,
                                    "created_utc": 1668533955.0,
                                    "replies": [
                                        {
                                            "body": "She said she’d had 2 prior multi year arrangements via SA. One speculates there would also be shorter ones",
                                            "author": null,
                                            "id": "iwhfa0w",
                                            "parent_id": "t1_iwhelyw",
                                            "score": 1,
                                            "created_utc": 1668534214.0,
                                            "replies": [
                                                {
                                                    "body": "[deleted]",
                                                    "author": null,
                                                    "id": "iwhgbep",
                                                    "parent_id": "t1_iwhfa0w",
                                                    "score": 1,
                                                    "created_utc": 1668534614.0,
                                                    "replies": [
                                                        {
                                                            "body": "Hmmm? She was very responsive on all fronts - just slow in getting me her bank info after refusing cash, which ultimately is her issue not mine. I paid her as soon as she sent it.",
                                                            "author": null,
                                                            "id": "iwhggqh",
                                                            "parent_id": "t1_iwhgbep",
                                                            "score": 2,
                                                            "created_utc": 1668534671.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I wish I’d find this. Not me lol 😆",
            "author": "WoahThere_124",
            "id": "iwc7g25",
            "parent_id": "t1_iwc1lkq",
            "score": 0,
            "created_utc": 1668441108.0,
            "replies": []
        },
        {
            "body": "❤️ I really hope so",
            "author": "WoahThere_124",
            "id": "iwckk3x",
            "parent_id": "t1_iwcc2is",
            "score": 4,
            "created_utc": 1668446412.0,
            "replies": []
        },
        {
            "body": "I’m just in shock how well he played it off. I trusted him too. Silly me",
            "author": "WoahThere_124",
            "id": "iwc7i2e",
            "parent_id": "t1_iwc0zuu",
            "score": 7,
            "created_utc": 1668441131.0,
            "replies": [
                {
                    "body": "Not your fault. Learn and move on.",
                    "author": "261chameleons",
                    "id": "iwcmbqv",
                    "parent_id": "t1_iwc7i2e",
                    "score": 10,
                    "created_utc": 1668447110.0,
                    "replies": []
                },
                {
                    "body": "At least you know now. You're not the first. It happens quite often especially when the woman is in a tough situation.",
                    "author": "Automatic_Joke_4414",
                    "id": "iwdlajf",
                    "parent_id": "t1_iwc7i2e",
                    "score": 2,
                    "created_utc": 1668460704.0,
                    "replies": []
                },
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "iwcq5y2",
                    "parent_id": "t1_iwc7i2e",
                    "score": 2,
                    "created_utc": 1668448602.0,
                    "replies": [
                        {
                            "body": "It’s real haha but they don’t even want to meet you IRL sometimes. they’ll pay you ASAP to prove their worth or whatever too.",
                            "author": "hijkman2",
                            "id": "iwdbri4",
                            "parent_id": "t1_iwcq5y2",
                            "score": 6,
                            "created_utc": 1668456989.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "iwdcvnd",
                                    "parent_id": "t1_iwdbri4",
                                    "score": 1,
                                    "created_utc": 1668457424.0,
                                    "replies": [
                                        {
                                            "body": "Honestly I think it’s more for people who work extremely stressful jobs or mentally unwell men 😅",
                                            "author": "hijkman2",
                                            "id": "iwdhjmt",
                                            "parent_id": "t1_iwdcvnd",
                                            "score": 5,
                                            "created_utc": 1668459234.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "I don’t even understand still what a findom is.",
                            "author": "WoahThere_124",
                            "id": "iwcqxve",
                            "parent_id": "t1_iwcq5y2",
                            "score": 1,
                            "created_utc": 1668448900.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "No matter how weird I feel I will be asking before anything happens next time",
            "author": "WoahThere_124",
            "id": "iwcjlyy",
            "parent_id": "t1_iwc8w5j",
            "score": 9,
            "created_utc": 1668446044.0,
            "replies": [
                {
                    "body": "Yeah I think some sketchballs prey on girls feeling weird so they don't ask for it up front.  They basically bet you're not gonna put your foot down about it.  Sucks, ruins the lifestyle for all the legit people in the bowl.  \n\nHang tough.",
                    "author": "unique_leek_critique",
                    "id": "iwd9lh5",
                    "parent_id": "t1_iwcjlyy",
                    "score": 2,
                    "created_utc": 1668456141.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "That’s why I’m so ashamed this happened. I knew better. God did I know better.",
            "author": "WoahThere_124",
            "id": "iwckfj7",
            "parent_id": "t1_iwcb1zo",
            "score": 8,
            "created_utc": 1668446363.0,
            "replies": []
        },
        {
            "body": "I dont see myself sugaring anytime soon after this",
            "author": "WoahThere_124",
            "id": "iwh901r",
            "parent_id": "t1_iwg0ekz",
            "score": 2,
            "created_utc": 1668531759.0,
            "replies": []
        },
        {
            "body": "I expected sex, just not what he was pulling. Makes me think he’s not sane which is even scarier",
            "author": "WoahThere_124",
            "id": "iwcjizs",
            "parent_id": "t1_iwc4mc3",
            "score": 5,
            "created_utc": 1668446012.0,
            "replies": [
                {
                    "body": "He did what he was going to do.\n\nWhen it's the first time it's Job No.1 to make sure the formalities are taken care of.\n\nBelieve it or not, I've had to remind women to check the gift bag. I've had one that almost left the room without taking her envelope. But I'm not that type of guy.  \n\n\nI'm not going to come down on you because this is more common that people think. Soon as you enter the room there should be a envelope, gift bag, or he needs to be pulling out his phone sending something.",
                    "author": "southernslick",
                    "id": "iwcm3st",
                    "parent_id": "t1_iwcjizs",
                    "score": 4,
                    "created_utc": 1668447024.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "No red flags at all. He talked so big on himself and his work. It wasn’t until after he said after he left he’d send it was when I knew deep down what was happening",
            "author": "WoahThere_124",
            "id": "iwckt87",
            "parent_id": "t1_iwc7bkd",
            "score": 6,
            "created_utc": 1668446513.0,
            "replies": []
        },
        {
            "body": "Cmon not such a comment from another SB. 🤦🏼‍♂️",
            "author": null,
            "id": "iwc4s43",
            "parent_id": "t1_iwc1ibr",
            "score": 2,
            "created_utc": 1668440014.0,
            "replies": [
                {
                    "body": "Too much? What are you criticizing exactly? You know what never mind I had poor sleep last night and shouldn’t be Reddit.ing half cocked 😝",
                    "author": "P0sitiveViibes777",
                    "id": "iwc5a2v",
                    "parent_id": "t1_iwc4s43",
                    "score": 2,
                    "created_utc": 1668440222.0,
                    "replies": [
                        {
                            "body": "It was a great comment - just up voted 😘 Why did you delete it? It was the best on this thread.  Don't ever let anyone's criticism (if it was) knock your confidence. Stay POsitive with the viibes :)",
                            "author": "LondonSugarDaddy",
                            "id": "iwc6kl6",
                            "parent_id": "t1_iwc5a2v",
                            "score": 2,
                            "created_utc": 1668440753.0,
                            "replies": [
                                {
                                    "body": "Thanks! No, I believe in myself and my experience and wisdom…. but it was a little harsh to direct at one individual in particular. It was the right words in the wrong setting.",
                                    "author": "P0sitiveViibes777",
                                    "id": "iwc8uj1",
                                    "parent_id": "t1_iwc6kl6",
                                    "score": 1,
                                    "created_utc": 1668441680.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "Yes, it was kinda harsh and a little victim blaming. More like kicking someone when they are down. Username didn’t check out on that one 😉",
                            "author": null,
                            "id": "iwc6zla",
                            "parent_id": "t1_iwc5a2v",
                            "score": 1,
                            "created_utc": 1668440923.0,
                            "replies": [
                                {
                                    "body": "Thanks for the feedback! I do get exasperated by the negativity toward men. But that is not the OP’s fault. That was really a scumbag thing to do to her.",
                                    "author": "P0sitiveViibes777",
                                    "id": "iwc8f8i",
                                    "parent_id": "t1_iwc6zla",
                                    "score": 4,
                                    "created_utc": 1668441507.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "He legitimately got off on my struggles so I fully believe it",
            "author": "WoahThere_124",
            "id": "iwh98lm",
            "parent_id": "t1_iwew38o",
            "score": 1,
            "created_utc": 1668531853.0,
            "replies": []
        },
        {
            "body": "I just didn’t see how I could’ve gotten scammed then, but as soon as he said about hotel wifi or whatever his fake reason for not sending it then I deep down knew. My heart aches.",
            "author": "WoahThere_124",
            "id": "iwcko7d",
            "parent_id": "t1_iwc16do",
            "score": 5,
            "created_utc": 1668446457.0,
            "replies": [
                {
                    "body": "You mentioned you're in a financially desperate situation. Its human psychology when you're desperate you hold on to the glimmer of hope and put out a lot more to latch on to that hope. Con artists know this and prey on it.",
                    "author": "karmaextract",
                    "id": "iwcz0lu",
                    "parent_id": "t1_iwcko7d",
                    "score": 2,
                    "created_utc": 1668452018.0,
                    "replies": []
                },
                {
                    "body": "I got scammed before.  It's not necessary a lack of intelligence at all btw.  It's okay to have a trusting nature. Try not to let the experience ruin you with doubt.  It did me for years after and all I did was hurt myself that way.\n\nJust learn from it, and be aware that people can do it and move on.  It's all you can do",
                    "author": "Life-Mistake-2279",
                    "id": "iwckybe",
                    "parent_id": "t1_iwcko7d",
                    "score": 2,
                    "created_utc": 1668446569.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "So low. And to call me all those names. 😔",
            "author": "WoahThere_124",
            "id": "iwckv7n",
            "parent_id": "t1_iwcd3zl",
            "score": 1,
            "created_utc": 1668446534.0,
            "replies": []
        },
        {
            "body": "I would be thankful and blessed if I could just get it at time of meet, I just knew better. I’m beating myself up over this",
            "author": "WoahThere_124",
            "id": "iwckyhq",
            "parent_id": "t1_iwcgbvp",
            "score": 3,
            "created_utc": 1668446571.0,
            "replies": [
                {
                    "body": "Don't beat yourself up. We all make mistakes this is how we learn.\nI know one girl I can trust. I have sent her money a week in advance before a date. And she has also waited a day or two for me to pay her. But finding that is relatively rare.\n\nJust keep searching, you will find what you need in time. You have a lot of support here on both sides of the fence.",
                    "author": "Assasinenzio",
                    "id": "iwcm48q",
                    "parent_id": "t1_iwckyhq",
                    "score": 0,
                    "created_utc": 1668447028.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Yes the risks are unreal. I don’t wanna seem transactional or pushy but with him I felt safe.",
            "author": "WoahThere_124",
            "id": "iwcldfr",
            "parent_id": "t1_iwc5zo3",
            "score": 3,
            "created_utc": 1668446735.0,
            "replies": [
                {
                    "body": "You aren’t coming across as transactional **at all**. From the sound of it he was making promises and then ghosted you.",
                    "author": "daddoms",
                    "id": "iwdayio",
                    "parent_id": "t1_iwcldfr",
                    "score": 1,
                    "created_utc": 1668456675.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I want to be Karma. Ugh I want him to pay",
            "author": "WoahThere_124",
            "id": "iwd3tm9",
            "parent_id": "t1_iwcoslo",
            "score": 1,
            "created_utc": 1668453894.0,
            "replies": []
        },
        {
            "body": "I will never take words to heart again for many reasons he made me realize",
            "author": "WoahThere_124",
            "id": "iwd3s7s",
            "parent_id": "t1_iwcp476",
            "score": 1,
            "created_utc": 1668453879.0,
            "replies": []
        },
        {
            "body": "I would go on as many dates as necessary, take afternoons to get each other. \n\nBut I would never give a cents beyond expected transport fees. (At least that's my current way of doing things, since I got rinsed not too long ago).",
            "author": "No-Victory-9096",
            "id": "iwe84tw",
            "parent_id": "t1_iwdxyb9",
            "score": 1,
            "created_utc": 1668470340.0,
            "replies": []
        },
        {
            "body": "Findom is a rare type of BDSM in which the sub enjoys letting a domme take control of some of his money.  It’s not “give me money for existing” like a lot of women who want to be FinDommes seem to think, but it’s also not something many men would be interested in.  Him referring to *himself* as a FinDom was a huge red flag she seems to have missed… it would imply he wanted to take control of *her* finances, which… I guess he did.",
            "author": "UseTheForceRey",
            "id": "iwd586v",
            "parent_id": "t1_iwconf0",
            "score": 3,
            "created_utc": 1668454447.0,
            "replies": []
        },
        {
            "body": "I honestly have 0 clue. It sounded to me like it was wanting to give money and being in control of their users lives? Or either just give money away? If anyone tells me they’re that I am running in future lol",
            "author": "WoahThere_124",
            "id": "iwd3yg3",
            "parent_id": "t1_iwconf0",
            "score": 1,
            "created_utc": 1668453947.0,
            "replies": []
        },
        {
            "body": "I’ve not asked for help from a church or ministry since I lived with my parents years back, I wouldn’t know where to start. I do however plan to stop by once upon a child once my strut gets replaced (I hit a dog this morning and damaged my strut) dog didn’t survive either 😭 but owners weren’t upset. It’s been a hell of a week!",
            "author": "WoahThere_124",
            "id": "iwd4cbr",
            "parent_id": "t1_iwclpp5",
            "score": 3,
            "created_utc": 1668454100.0,
            "replies": [
                {
                    "body": "I’m sorry. I hope things turn better for you.",
                    "author": "261chameleons",
                    "id": "iwdti3o",
                    "parent_id": "t1_iwd4cbr",
                    "score": 2,
                    "created_utc": 1668464020.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Thank you 🙏",
            "author": "WoahThere_124",
            "id": "iwh8z35",
            "parent_id": "t1_iwgzegq",
            "score": 2,
            "created_utc": 1668531748.0,
            "replies": []
        },
        {
            "body": "I hope you don’t believe any of his words. He’s a terrible person, and I’m sorry you had the misfortune of being subjected to that.",
            "author": "Actually_a_bot_accnt",
            "id": "iwfvqp6",
            "parent_id": "t1_iwdjtet",
            "score": 8,
            "created_utc": 1668504638.0,
            "replies": []
        },
        {
            "body": "I'm sorry and hope you find an amazing SD",
            "author": "mmarquisdesade",
            "id": "iweqnwa",
            "parent_id": "t1_iwdjtet",
            "score": 5,
            "created_utc": 1668478749.0,
            "replies": []
        },
        {
            "body": "Did he use a condom? Or did he finish inside of you raw?",
            "author": "ImWorried2017",
            "id": "iwei2vr",
            "parent_id": "t1_iwdjtet",
            "score": -2,
            "created_utc": 1668474900.0,
            "replies": []
        },
        {
            "body": "Hey again I'm so sorry...you seem so sincere and like you'd be an AMAZING SB!! I feel the same as you do in reverse; as though my SB doesn't appreciate me as I should be appreciated and i KNOW i've taken care of her so I do feel your pain!",
            "author": "mmarquisdesade",
            "id": "iwmspm2",
            "parent_id": "t1_iwdjtet",
            "score": 1,
            "created_utc": 1668629843.0,
            "replies": []
        },
        {
            "body": "I agree with you 100%. I rarely make a strong connection, but when I do, I often pay as much as a month's allowance in advance. From my perspective, if I really like someone, I can afford to lose that money much more than I can afford to get involved with the wrong kind of person and have them hurt me emotionally. So if they'll disappear after getting the money, then so be it. I'd much rather not sleep with someone who didn't want to be intimate with me anyway.",
            "author": "GH-SD",
            "id": "iwerjk9",
            "parent_id": "t1_iwd3rku",
            "score": 15,
            "created_utc": 1668479138.0,
            "replies": []
        },
        {
            "body": ">I'd rather know she's a crook up front so I don't have to worry about it.\n\nSome men prefer to use the money as a pressure to fuck the crook who's intention was to run off. LOL",
            "author": "A-touchofreality",
            "id": "iwdwoem",
            "parent_id": "t1_iwd3rku",
            "score": 3,
            "created_utc": 1668465365.0,
            "replies": [
                {
                    "body": "Idk.  Pressuring people into fucking isn't my thing.  I know some men get off on it.",
                    "author": "NoBagelNoBagel1",
                    "id": "iwe5ouo",
                    "parent_id": "t1_iwdwoem",
                    "score": 4,
                    "created_utc": 1668469258.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "How can she completely secure it if you give it to her in the hotel room?\nSerious question that I have pondered. There’s always a risk that an SD can steal it out of her purse, right?",
            "author": "261chameleons",
            "id": "iwcm904",
            "parent_id": "t1_iwc7jpc",
            "score": 5,
            "created_utc": 1668447081.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "iwcmq4t",
                    "parent_id": "t1_iwcm904",
                    "score": 8,
                    "created_utc": 1668447267.0,
                    "replies": [
                        {
                            "body": "True. But unfortunately the norm in sugaring seems to be accelerated intimacy.",
                            "author": "261chameleons",
                            "id": "iwdtbq6",
                            "parent_id": "t1_iwcmq4t",
                            "score": 2,
                            "created_utc": 1668463946.0,
                            "replies": []
                        },
                        {
                            "body": "But that just isn't true.  Unless the guy has been screened (full name, place of employment, successful enough he has something to lose).  There are lots of stories of johns robbing girls in private spaces.\n\nA really young SB posted awhile ago about going to a new SD's house.  He gives her the payment, but rifles through her bag while she's sleeping, removes her drivers license and leaves it on the counter and removes the ppm.\n\nAddresses her by her real name in the morning, implying if she says anything about the rape and theft he will blackmail her to her parents.",
                            "author": "Fair_Rhubarb28",
                            "id": "iwdj7m5",
                            "parent_id": "t1_iwcmq4t",
                            "score": 2,
                            "created_utc": 1668459880.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I do usually give her the PPM before intimacy, but it’s in a sealed envelope, and if I saw her open it and count it, I’d probably be unlikely to see her again.   It’s not supposed to be a payment for a service, where she has to count to make sure she got the right amount before we have sex.  Yes, that *is* too transactional.  I’m giving what I promised and over time I’ll give more, but it shouldn’t feel like “I’m only having sex with you because you handed over the exact amount we discussed…” or that just doesn’t feel like sugar to me.",
            "author": "UseTheForceRey",
            "id": "iwcnh8n",
            "parent_id": "t1_iwc7jpc",
            "score": -10,
            "created_utc": 1668447563.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "iwcokf3",
                    "parent_id": "t1_iwcnh8n",
                    "score": 14,
                    "created_utc": 1668447988.0,
                    "replies": [
                        {
                            "body": "I had someone do that too.  She skedaddled out the door while I was in the bathroom.",
                            "author": "aajniojnoihnoi",
                            "id": "iwd1kce",
                            "parent_id": "t1_iwcokf3",
                            "score": -2,
                            "created_utc": 1668453013.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "I can absolutely understand the turn off of someone counting the money in front of you. But we also know the cases of 'SD' having cut journals in the size of $ bills, or even using Monopoly money to put in closed envelopes.\n\nSo I would suggest to avoid both situations by giving it in an open envelope, and then go for a moment to the bathroom or create another occasion where she can discretely check if the contains of the envelope are as agreed upon?",
                    "author": "A-touchofreality",
                    "id": "iwe064t",
                    "parent_id": "t1_iwcnh8n",
                    "score": 7,
                    "created_utc": 1668466849.0,
                    "replies": [
                        {
                            "body": "No.  I would find it off-putting.  It’s not supposed to be a payment for a service.  If she’s willing to fuck me, she should trust me enough that I’m not going to do that.   I gave her a gift after the M&G.  I’ve taken her to a nice dinner. Now I’ve handed her an envelope before we are intimate.   She can trust me at that point.   Some other guys have used fake bills or whatever… I’m not them, and that’s an awful lot of fucking effort to save a few bucks.  I would argue it makes more sense to spend time getting to know the guy to the point this ain’t a concern.  If you’re going to a hotel with a guy you just met after a coffee, the risk of a scam is high.  If you’ve had a M&G, gotten a gif, and now another date, I think the risk is very low, and this isn’t supposed to be pay for play.",
                            "author": "UseTheForceRey",
                            "id": "iwe1a4v",
                            "parent_id": "t1_iwe064t",
                            "score": -2,
                            "created_utc": 1668467330.0,
                            "replies": [
                                {
                                    "body": "I  understand, and agree with your POV after having proved already some reliability to your Pot SB.  I personally never felt the need to check and have never been scammed either. But we are probably both in a section of the bowl where things like this not usually happen.\n\nReading others' experiences on sugar forums unfortunately taught me a lot about other, uglier, sections where these things do happen more frequently. Don't underestimate how far some scammers go, and how vulnerable some of their targets are.",
                                    "author": "A-touchofreality",
                                    "id": "iwe469y",
                                    "parent_id": "t1_iwe1a4v",
                                    "score": 2,
                                    "created_utc": 1668468586.0,
                                    "replies": [
                                        {
                                            "body": "Yes, I think that's a good point.    None of the SBs I've ever seen has counted, but I would recommend counting if it was more of a \"we just met, let's go have sex now\" situation.",
                                            "author": "UseTheForceRey",
                                            "id": "iwe7ghc",
                                            "parent_id": "t1_iwe469y",
                                            "score": 0,
                                            "created_utc": 1668470039.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "Agreed. Plus over time, trust will be built, and everything should naturally go more smoothly.",
                            "author": "LaylaSB",
                            "id": "iwfowi7",
                            "parent_id": "t1_iwe064t",
                            "score": 1,
                            "created_utc": 1668498561.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "But it *IS* a service. Idk how y’all play mental gymnastics in your head trying to convince yourselves that it’s not lmao. At this point, You’re hiring nothing more than an actress pretending to like you.",
                    "author": "ImWorried2017",
                    "id": "iweig66",
                    "parent_id": "t1_iwcnh8n",
                    "score": 3,
                    "created_utc": 1668475068.0,
                    "replies": [
                        {
                            "body": "Lol.   This is *exactly* my point.  I am *not* hiring anyone to act or provide a service.  If that is her intent, she’s not an SB and she should move on to someone who wants that shit.  \n\nJust because you don’t understand the difference between escorting and sugar dating doesn’t mean that there are no SBs out there who genuinely want to date someone who’s supporting them, not put on an act.",
                            "author": "UseTheForceRey",
                            "id": "iweq1qm",
                            "parent_id": "t1_iweig66",
                            "score": 1,
                            "created_utc": 1668478477.0,
                            "replies": [
                                {
                                    "body": "Whatever helps you sleep at night 🙄 \n\nTake away the PPM or allowance and see how long she sticks around",
                                    "author": "ImWorried2017",
                                    "id": "iweqwtf",
                                    "parent_id": "t1_iweq1qm",
                                    "score": 3,
                                    "created_utc": 1668478858.0,
                                    "replies": [
                                        {
                                            "body": "Why would I want to stop financially supporting someone who I am dating?",
                                            "author": "UseTheForceRey",
                                            "id": "iweu5cg",
                                            "parent_id": "t1_iweqwtf",
                                            "score": -2,
                                            "created_utc": 1668480266.0,
                                            "replies": [
                                                {
                                                    "body": "Here’s a pretty [valid reason](https://www.reddit.com/r/sugarlifestyleforum/comments/yuu3u2/sd_wants_to_stop_arrangement_and_for_us_to_start/?utm_source=share&utm_medium=ios_app&utm_name=iossmf). Sugar dating is one sided. One side is offering financial compensation. The other is offering their… ~~body~~  “time”? When both parties should be offering their time instead without money being an issue.",
                                                    "author": "ImWorried2017",
                                                    "id": "iwewz0q",
                                                    "parent_id": "t1_iweu5cg",
                                                    "score": 1,
                                                    "created_utc": 1668481540.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "I've heard of girls getting fake bills before, or one real benji on top of the rest monopoly money, so them glancing at it probably isn't out of bounds.  Not saying she has to take out of a bank blue light pen and check with a counterfeit pen, but opening it up and taking a peek it's all there imo is a good idea on the first intimate encounter.",
                    "author": "KarensSmokeShop",
                    "id": "iwekiqr",
                    "parent_id": "t1_iwcnh8n",
                    "score": 3,
                    "created_utc": 1668476016.0,
                    "replies": [
                        {
                            "body": "Disagreed, for the reasons stated above.  No number of downvotes from SBs is going to change that.",
                            "author": "UseTheForceRey",
                            "id": "iwepptz",
                            "parent_id": "t1_iwekiqr",
                            "score": -2,
                            "created_utc": 1668478332.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": ">> The sooner SDs understand and accept that the risk of \"being had\" is not equivalent (i.e. you lose a bit of money, she loses a sense of dignity!), the better we will all be in this lifestyle.\n\nPlease explain how the risk is not equivalent.  Scenario 1:  she has sex with him, doesn’t get money.   Scenario 2: he gives her money, she runs off.  In *both* cases the “loss” is money.   She didn’t “lose her dignity.”   She didn’t “lose” sex.  She had sex with him and lost the money. It is *exactly* equivalent — in either scenario one loses out on the same amount of money, and does so because the other person lied to them.  Both are shitty, but the “oh she lost her dignity” is nonsense— she fucked a guy she was willing to fuck — she lost money not dignity.",
            "author": "tempsdforfuns",
            "id": "iwcovkk",
            "parent_id": "t1_iwc8brb",
            "score": -7,
            "created_utc": 1668448107.0,
            "replies": [
                {
                    "body": "Let's say I buy your argument that it's ALL about the money and that how she feels about it is \"nonsense\". Do you think that the loss of the same amount of money has the same impact on a SD and a SB's life?! You're rich (at least you're supposed to be), she's not! xxx$ might help her pay her rent, or buy food; xxx$ is a freaking blip in my bank account! \n\nHey man, I've been played in the past and it's not pleasant! But I was mad because I hated the feeling of being had, not because the loss of money made any difference in my life. A SB who gives sex without receiving money suffers both ways.",
                    "author": "AusterlitzSD",
                    "id": "iwcs9w0",
                    "parent_id": "t1_iwcovkk",
                    "score": 13,
                    "created_utc": 1668449422.0,
                    "replies": [
                        {
                            "body": "I agree with you that the loss of money has to be more impactful to the SB.  I also have given the PPM first in most cases.  I just hate the “it doesn’t matter if the SB plays an SD, it’s just money” argument… the impact of getting played is there whether that money is significant or not.",
                            "author": "tempsdforfuns",
                            "id": "iwd0avy",
                            "parent_id": "t1_iwcs9w0",
                            "score": -1,
                            "created_utc": 1668452516.0,
                            "replies": [
                                {
                                    "body": "So when you put it like that, then I agree with you!",
                                    "author": "AusterlitzSD",
                                    "id": "iwd1dc3",
                                    "parent_id": "t1_iwd0avy",
                                    "score": 3,
                                    "created_utc": 1668452937.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "You can't imagine how it is to be vulnerable and getting naked with a stranger, alone in a room, kissing, trusting him with your body, allowing him *INSIDE* you? Maybe even cuddle and some pillow talk afterwards?\n\nOnly to find out that all this intimate time together he fully *KNEW* he was going to purposely scam you?\n\nAnd you thinks this is the same risk as losing a couple of $ that might equal to what he would thoughtless spend on a good bottle of wine in an expensive restaurant?",
                    "author": "A-touchofreality",
                    "id": "iwdz1jl",
                    "parent_id": "t1_iwcovkk",
                    "score": 3,
                    "created_utc": 1668466372.0,
                    "replies": [
                        {
                            "body": "I highly doubt that the same guy who is thoughtlessly spending a PPM on a bottle of wine is the guy who’s skipping out on the PPM.   The guy who’s skipping out on the PPM is probably taking you to the Applebee’s next to the Red Roof Inn where he’s going to fuck you, and doesn’t drink wine that doesn’t come in a box.",
                            "author": "tempsdforfuns",
                            "id": "iwebad9",
                            "parent_id": "t1_iwdz1jl",
                            "score": 1,
                            "created_utc": 1668471770.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "iwfcuv3",
            "parent_id": "t1_iwc4ki8",
            "score": 1,
            "created_utc": 1668489673.0,
            "replies": [
                {
                    "body": "Hmmm I hadn’t thought of that. It wasn’t her first SA rodeo. But who knows?",
                    "author": null,
                    "id": "iwfikpi",
                    "parent_id": "t1_iwfcuv3",
                    "score": 1,
                    "created_utc": 1668493585.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "iwhelyw",
                            "parent_id": "t1_iwfikpi",
                            "score": 1,
                            "created_utc": 1668533955.0,
                            "replies": [
                                {
                                    "body": "She said she’d had 2 prior multi year arrangements via SA. One speculates there would also be shorter ones",
                                    "author": null,
                                    "id": "iwhfa0w",
                                    "parent_id": "t1_iwhelyw",
                                    "score": 1,
                                    "created_utc": 1668534214.0,
                                    "replies": [
                                        {
                                            "body": "[deleted]",
                                            "author": null,
                                            "id": "iwhgbep",
                                            "parent_id": "t1_iwhfa0w",
                                            "score": 1,
                                            "created_utc": 1668534614.0,
                                            "replies": [
                                                {
                                                    "body": "Hmmm? She was very responsive on all fronts - just slow in getting me her bank info after refusing cash, which ultimately is her issue not mine. I paid her as soon as she sent it.",
                                                    "author": null,
                                                    "id": "iwhggqh",
                                                    "parent_id": "t1_iwhgbep",
                                                    "score": 2,
                                                    "created_utc": 1668534671.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Not your fault. Learn and move on.",
            "author": "261chameleons",
            "id": "iwcmbqv",
            "parent_id": "t1_iwc7i2e",
            "score": 10,
            "created_utc": 1668447110.0,
            "replies": []
        },
        {
            "body": "At least you know now. You're not the first. It happens quite often especially when the woman is in a tough situation.",
            "author": "Automatic_Joke_4414",
            "id": "iwdlajf",
            "parent_id": "t1_iwc7i2e",
            "score": 2,
            "created_utc": 1668460704.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "iwcq5y2",
            "parent_id": "t1_iwc7i2e",
            "score": 2,
            "created_utc": 1668448602.0,
            "replies": [
                {
                    "body": "It’s real haha but they don’t even want to meet you IRL sometimes. they’ll pay you ASAP to prove their worth or whatever too.",
                    "author": "hijkman2",
                    "id": "iwdbri4",
                    "parent_id": "t1_iwcq5y2",
                    "score": 6,
                    "created_utc": 1668456989.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "iwdcvnd",
                            "parent_id": "t1_iwdbri4",
                            "score": 1,
                            "created_utc": 1668457424.0,
                            "replies": [
                                {
                                    "body": "Honestly I think it’s more for people who work extremely stressful jobs or mentally unwell men 😅",
                                    "author": "hijkman2",
                                    "id": "iwdhjmt",
                                    "parent_id": "t1_iwdcvnd",
                                    "score": 5,
                                    "created_utc": 1668459234.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "I don’t even understand still what a findom is.",
                    "author": "WoahThere_124",
                    "id": "iwcqxve",
                    "parent_id": "t1_iwcq5y2",
                    "score": 1,
                    "created_utc": 1668448900.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Yeah I think some sketchballs prey on girls feeling weird so they don't ask for it up front.  They basically bet you're not gonna put your foot down about it.  Sucks, ruins the lifestyle for all the legit people in the bowl.  \n\nHang tough.",
            "author": "unique_leek_critique",
            "id": "iwd9lh5",
            "parent_id": "t1_iwcjlyy",
            "score": 2,
            "created_utc": 1668456141.0,
            "replies": []
        },
        {
            "body": "He did what he was going to do.\n\nWhen it's the first time it's Job No.1 to make sure the formalities are taken care of.\n\nBelieve it or not, I've had to remind women to check the gift bag. I've had one that almost left the room without taking her envelope. But I'm not that type of guy.  \n\n\nI'm not going to come down on you because this is more common that people think. Soon as you enter the room there should be a envelope, gift bag, or he needs to be pulling out his phone sending something.",
            "author": "southernslick",
            "id": "iwcm3st",
            "parent_id": "t1_iwcjizs",
            "score": 4,
            "created_utc": 1668447024.0,
            "replies": []
        },
        {
            "body": "Too much? What are you criticizing exactly? You know what never mind I had poor sleep last night and shouldn’t be Reddit.ing half cocked 😝",
            "author": "P0sitiveViibes777",
            "id": "iwc5a2v",
            "parent_id": "t1_iwc4s43",
            "score": 2,
            "created_utc": 1668440222.0,
            "replies": [
                {
                    "body": "It was a great comment - just up voted 😘 Why did you delete it? It was the best on this thread.  Don't ever let anyone's criticism (if it was) knock your confidence. Stay POsitive with the viibes :)",
                    "author": "LondonSugarDaddy",
                    "id": "iwc6kl6",
                    "parent_id": "t1_iwc5a2v",
                    "score": 2,
                    "created_utc": 1668440753.0,
                    "replies": [
                        {
                            "body": "Thanks! No, I believe in myself and my experience and wisdom…. but it was a little harsh to direct at one individual in particular. It was the right words in the wrong setting.",
                            "author": "P0sitiveViibes777",
                            "id": "iwc8uj1",
                            "parent_id": "t1_iwc6kl6",
                            "score": 1,
                            "created_utc": 1668441680.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Yes, it was kinda harsh and a little victim blaming. More like kicking someone when they are down. Username didn’t check out on that one 😉",
                    "author": null,
                    "id": "iwc6zla",
                    "parent_id": "t1_iwc5a2v",
                    "score": 1,
                    "created_utc": 1668440923.0,
                    "replies": [
                        {
                            "body": "Thanks for the feedback! I do get exasperated by the negativity toward men. But that is not the OP’s fault. That was really a scumbag thing to do to her.",
                            "author": "P0sitiveViibes777",
                            "id": "iwc8f8i",
                            "parent_id": "t1_iwc6zla",
                            "score": 4,
                            "created_utc": 1668441507.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "You mentioned you're in a financially desperate situation. Its human psychology when you're desperate you hold on to the glimmer of hope and put out a lot more to latch on to that hope. Con artists know this and prey on it.",
            "author": "karmaextract",
            "id": "iwcz0lu",
            "parent_id": "t1_iwcko7d",
            "score": 2,
            "created_utc": 1668452018.0,
            "replies": []
        },
        {
            "body": "I got scammed before.  It's not necessary a lack of intelligence at all btw.  It's okay to have a trusting nature. Try not to let the experience ruin you with doubt.  It did me for years after and all I did was hurt myself that way.\n\nJust learn from it, and be aware that people can do it and move on.  It's all you can do",
            "author": "Life-Mistake-2279",
            "id": "iwckybe",
            "parent_id": "t1_iwcko7d",
            "score": 2,
            "created_utc": 1668446569.0,
            "replies": []
        },
        {
            "body": "Don't beat yourself up. We all make mistakes this is how we learn.\nI know one girl I can trust. I have sent her money a week in advance before a date. And she has also waited a day or two for me to pay her. But finding that is relatively rare.\n\nJust keep searching, you will find what you need in time. You have a lot of support here on both sides of the fence.",
            "author": "Assasinenzio",
            "id": "iwcm48q",
            "parent_id": "t1_iwckyhq",
            "score": 0,
            "created_utc": 1668447028.0,
            "replies": []
        },
        {
            "body": "You aren’t coming across as transactional **at all**. From the sound of it he was making promises and then ghosted you.",
            "author": "daddoms",
            "id": "iwdayio",
            "parent_id": "t1_iwcldfr",
            "score": 1,
            "created_utc": 1668456675.0,
            "replies": []
        },
        {
            "body": "I’m sorry. I hope things turn better for you.",
            "author": "261chameleons",
            "id": "iwdti3o",
            "parent_id": "t1_iwd4cbr",
            "score": 2,
            "created_utc": 1668464020.0,
            "replies": []
        },
        {
            "body": "Idk.  Pressuring people into fucking isn't my thing.  I know some men get off on it.",
            "author": "NoBagelNoBagel1",
            "id": "iwe5ouo",
            "parent_id": "t1_iwdwoem",
            "score": 4,
            "created_utc": 1668469258.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "iwcmq4t",
            "parent_id": "t1_iwcm904",
            "score": 8,
            "created_utc": 1668447267.0,
            "replies": [
                {
                    "body": "True. But unfortunately the norm in sugaring seems to be accelerated intimacy.",
                    "author": "261chameleons",
                    "id": "iwdtbq6",
                    "parent_id": "t1_iwcmq4t",
                    "score": 2,
                    "created_utc": 1668463946.0,
                    "replies": []
                },
                {
                    "body": "But that just isn't true.  Unless the guy has been screened (full name, place of employment, successful enough he has something to lose).  There are lots of stories of johns robbing girls in private spaces.\n\nA really young SB posted awhile ago about going to a new SD's house.  He gives her the payment, but rifles through her bag while she's sleeping, removes her drivers license and leaves it on the counter and removes the ppm.\n\nAddresses her by her real name in the morning, implying if she says anything about the rape and theft he will blackmail her to her parents.",
                    "author": "Fair_Rhubarb28",
                    "id": "iwdj7m5",
                    "parent_id": "t1_iwcmq4t",
                    "score": 2,
                    "created_utc": 1668459880.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "iwcokf3",
            "parent_id": "t1_iwcnh8n",
            "score": 14,
            "created_utc": 1668447988.0,
            "replies": [
                {
                    "body": "I had someone do that too.  She skedaddled out the door while I was in the bathroom.",
                    "author": "aajniojnoihnoi",
                    "id": "iwd1kce",
                    "parent_id": "t1_iwcokf3",
                    "score": -2,
                    "created_utc": 1668453013.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I can absolutely understand the turn off of someone counting the money in front of you. But we also know the cases of 'SD' having cut journals in the size of $ bills, or even using Monopoly money to put in closed envelopes.\n\nSo I would suggest to avoid both situations by giving it in an open envelope, and then go for a moment to the bathroom or create another occasion where she can discretely check if the contains of the envelope are as agreed upon?",
            "author": "A-touchofreality",
            "id": "iwe064t",
            "parent_id": "t1_iwcnh8n",
            "score": 7,
            "created_utc": 1668466849.0,
            "replies": [
                {
                    "body": "No.  I would find it off-putting.  It’s not supposed to be a payment for a service.  If she’s willing to fuck me, she should trust me enough that I’m not going to do that.   I gave her a gift after the M&G.  I’ve taken her to a nice dinner. Now I’ve handed her an envelope before we are intimate.   She can trust me at that point.   Some other guys have used fake bills or whatever… I’m not them, and that’s an awful lot of fucking effort to save a few bucks.  I would argue it makes more sense to spend time getting to know the guy to the point this ain’t a concern.  If you’re going to a hotel with a guy you just met after a coffee, the risk of a scam is high.  If you’ve had a M&G, gotten a gif, and now another date, I think the risk is very low, and this isn’t supposed to be pay for play.",
                    "author": "UseTheForceRey",
                    "id": "iwe1a4v",
                    "parent_id": "t1_iwe064t",
                    "score": -2,
                    "created_utc": 1668467330.0,
                    "replies": [
                        {
                            "body": "I  understand, and agree with your POV after having proved already some reliability to your Pot SB.  I personally never felt the need to check and have never been scammed either. But we are probably both in a section of the bowl where things like this not usually happen.\n\nReading others' experiences on sugar forums unfortunately taught me a lot about other, uglier, sections where these things do happen more frequently. Don't underestimate how far some scammers go, and how vulnerable some of their targets are.",
                            "author": "A-touchofreality",
                            "id": "iwe469y",
                            "parent_id": "t1_iwe1a4v",
                            "score": 2,
                            "created_utc": 1668468586.0,
                            "replies": [
                                {
                                    "body": "Yes, I think that's a good point.    None of the SBs I've ever seen has counted, but I would recommend counting if it was more of a \"we just met, let's go have sex now\" situation.",
                                    "author": "UseTheForceRey",
                                    "id": "iwe7ghc",
                                    "parent_id": "t1_iwe469y",
                                    "score": 0,
                                    "created_utc": 1668470039.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Agreed. Plus over time, trust will be built, and everything should naturally go more smoothly.",
                    "author": "LaylaSB",
                    "id": "iwfowi7",
                    "parent_id": "t1_iwe064t",
                    "score": 1,
                    "created_utc": 1668498561.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "But it *IS* a service. Idk how y’all play mental gymnastics in your head trying to convince yourselves that it’s not lmao. At this point, You’re hiring nothing more than an actress pretending to like you.",
            "author": "ImWorried2017",
            "id": "iweig66",
            "parent_id": "t1_iwcnh8n",
            "score": 3,
            "created_utc": 1668475068.0,
            "replies": [
                {
                    "body": "Lol.   This is *exactly* my point.  I am *not* hiring anyone to act or provide a service.  If that is her intent, she’s not an SB and she should move on to someone who wants that shit.  \n\nJust because you don’t understand the difference between escorting and sugar dating doesn’t mean that there are no SBs out there who genuinely want to date someone who’s supporting them, not put on an act.",
                    "author": "UseTheForceRey",
                    "id": "iweq1qm",
                    "parent_id": "t1_iweig66",
                    "score": 1,
                    "created_utc": 1668478477.0,
                    "replies": [
                        {
                            "body": "Whatever helps you sleep at night 🙄 \n\nTake away the PPM or allowance and see how long she sticks around",
                            "author": "ImWorried2017",
                            "id": "iweqwtf",
                            "parent_id": "t1_iweq1qm",
                            "score": 3,
                            "created_utc": 1668478858.0,
                            "replies": [
                                {
                                    "body": "Why would I want to stop financially supporting someone who I am dating?",
                                    "author": "UseTheForceRey",
                                    "id": "iweu5cg",
                                    "parent_id": "t1_iweqwtf",
                                    "score": -2,
                                    "created_utc": 1668480266.0,
                                    "replies": [
                                        {
                                            "body": "Here’s a pretty [valid reason](https://www.reddit.com/r/sugarlifestyleforum/comments/yuu3u2/sd_wants_to_stop_arrangement_and_for_us_to_start/?utm_source=share&utm_medium=ios_app&utm_name=iossmf). Sugar dating is one sided. One side is offering financial compensation. The other is offering their… ~~body~~  “time”? When both parties should be offering their time instead without money being an issue.",
                                            "author": "ImWorried2017",
                                            "id": "iwewz0q",
                                            "parent_id": "t1_iweu5cg",
                                            "score": 1,
                                            "created_utc": 1668481540.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I've heard of girls getting fake bills before, or one real benji on top of the rest monopoly money, so them glancing at it probably isn't out of bounds.  Not saying she has to take out of a bank blue light pen and check with a counterfeit pen, but opening it up and taking a peek it's all there imo is a good idea on the first intimate encounter.",
            "author": "KarensSmokeShop",
            "id": "iwekiqr",
            "parent_id": "t1_iwcnh8n",
            "score": 3,
            "created_utc": 1668476016.0,
            "replies": [
                {
                    "body": "Disagreed, for the reasons stated above.  No number of downvotes from SBs is going to change that.",
                    "author": "UseTheForceRey",
                    "id": "iwepptz",
                    "parent_id": "t1_iwekiqr",
                    "score": -2,
                    "created_utc": 1668478332.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Let's say I buy your argument that it's ALL about the money and that how she feels about it is \"nonsense\". Do you think that the loss of the same amount of money has the same impact on a SD and a SB's life?! You're rich (at least you're supposed to be), she's not! xxx$ might help her pay her rent, or buy food; xxx$ is a freaking blip in my bank account! \n\nHey man, I've been played in the past and it's not pleasant! But I was mad because I hated the feeling of being had, not because the loss of money made any difference in my life. A SB who gives sex without receiving money suffers both ways.",
            "author": "AusterlitzSD",
            "id": "iwcs9w0",
            "parent_id": "t1_iwcovkk",
            "score": 13,
            "created_utc": 1668449422.0,
            "replies": [
                {
                    "body": "I agree with you that the loss of money has to be more impactful to the SB.  I also have given the PPM first in most cases.  I just hate the “it doesn’t matter if the SB plays an SD, it’s just money” argument… the impact of getting played is there whether that money is significant or not.",
                    "author": "tempsdforfuns",
                    "id": "iwd0avy",
                    "parent_id": "t1_iwcs9w0",
                    "score": -1,
                    "created_utc": 1668452516.0,
                    "replies": [
                        {
                            "body": "So when you put it like that, then I agree with you!",
                            "author": "AusterlitzSD",
                            "id": "iwd1dc3",
                            "parent_id": "t1_iwd0avy",
                            "score": 3,
                            "created_utc": 1668452937.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "You can't imagine how it is to be vulnerable and getting naked with a stranger, alone in a room, kissing, trusting him with your body, allowing him *INSIDE* you? Maybe even cuddle and some pillow talk afterwards?\n\nOnly to find out that all this intimate time together he fully *KNEW* he was going to purposely scam you?\n\nAnd you thinks this is the same risk as losing a couple of $ that might equal to what he would thoughtless spend on a good bottle of wine in an expensive restaurant?",
            "author": "A-touchofreality",
            "id": "iwdz1jl",
            "parent_id": "t1_iwcovkk",
            "score": 3,
            "created_utc": 1668466372.0,
            "replies": [
                {
                    "body": "I highly doubt that the same guy who is thoughtlessly spending a PPM on a bottle of wine is the guy who’s skipping out on the PPM.   The guy who’s skipping out on the PPM is probably taking you to the Applebee’s next to the Red Roof Inn where he’s going to fuck you, and doesn’t drink wine that doesn’t come in a box.",
                    "author": "tempsdforfuns",
                    "id": "iwebad9",
                    "parent_id": "t1_iwdz1jl",
                    "score": 1,
                    "created_utc": 1668471770.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Hmmm I hadn’t thought of that. It wasn’t her first SA rodeo. But who knows?",
            "author": null,
            "id": "iwfikpi",
            "parent_id": "t1_iwfcuv3",
            "score": 1,
            "created_utc": 1668493585.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "iwhelyw",
                    "parent_id": "t1_iwfikpi",
                    "score": 1,
                    "created_utc": 1668533955.0,
                    "replies": [
                        {
                            "body": "She said she’d had 2 prior multi year arrangements via SA. One speculates there would also be shorter ones",
                            "author": null,
                            "id": "iwhfa0w",
                            "parent_id": "t1_iwhelyw",
                            "score": 1,
                            "created_utc": 1668534214.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "iwhgbep",
                                    "parent_id": "t1_iwhfa0w",
                                    "score": 1,
                                    "created_utc": 1668534614.0,
                                    "replies": [
                                        {
                                            "body": "Hmmm? She was very responsive on all fronts - just slow in getting me her bank info after refusing cash, which ultimately is her issue not mine. I paid her as soon as she sent it.",
                                            "author": null,
                                            "id": "iwhggqh",
                                            "parent_id": "t1_iwhgbep",
                                            "score": 2,
                                            "created_utc": 1668534671.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "It’s real haha but they don’t even want to meet you IRL sometimes. they’ll pay you ASAP to prove their worth or whatever too.",
            "author": "hijkman2",
            "id": "iwdbri4",
            "parent_id": "t1_iwcq5y2",
            "score": 6,
            "created_utc": 1668456989.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "iwdcvnd",
                    "parent_id": "t1_iwdbri4",
                    "score": 1,
                    "created_utc": 1668457424.0,
                    "replies": [
                        {
                            "body": "Honestly I think it’s more for people who work extremely stressful jobs or mentally unwell men 😅",
                            "author": "hijkman2",
                            "id": "iwdhjmt",
                            "parent_id": "t1_iwdcvnd",
                            "score": 5,
                            "created_utc": 1668459234.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I don’t even understand still what a findom is.",
            "author": "WoahThere_124",
            "id": "iwcqxve",
            "parent_id": "t1_iwcq5y2",
            "score": 1,
            "created_utc": 1668448900.0,
            "replies": []
        },
        {
            "body": "It was a great comment - just up voted 😘 Why did you delete it? It was the best on this thread.  Don't ever let anyone's criticism (if it was) knock your confidence. Stay POsitive with the viibes :)",
            "author": "LondonSugarDaddy",
            "id": "iwc6kl6",
            "parent_id": "t1_iwc5a2v",
            "score": 2,
            "created_utc": 1668440753.0,
            "replies": [
                {
                    "body": "Thanks! No, I believe in myself and my experience and wisdom…. but it was a little harsh to direct at one individual in particular. It was the right words in the wrong setting.",
                    "author": "P0sitiveViibes777",
                    "id": "iwc8uj1",
                    "parent_id": "t1_iwc6kl6",
                    "score": 1,
                    "created_utc": 1668441680.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Yes, it was kinda harsh and a little victim blaming. More like kicking someone when they are down. Username didn’t check out on that one 😉",
            "author": null,
            "id": "iwc6zla",
            "parent_id": "t1_iwc5a2v",
            "score": 1,
            "created_utc": 1668440923.0,
            "replies": [
                {
                    "body": "Thanks for the feedback! I do get exasperated by the negativity toward men. But that is not the OP’s fault. That was really a scumbag thing to do to her.",
                    "author": "P0sitiveViibes777",
                    "id": "iwc8f8i",
                    "parent_id": "t1_iwc6zla",
                    "score": 4,
                    "created_utc": 1668441507.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "True. But unfortunately the norm in sugaring seems to be accelerated intimacy.",
            "author": "261chameleons",
            "id": "iwdtbq6",
            "parent_id": "t1_iwcmq4t",
            "score": 2,
            "created_utc": 1668463946.0,
            "replies": []
        },
        {
            "body": "But that just isn't true.  Unless the guy has been screened (full name, place of employment, successful enough he has something to lose).  There are lots of stories of johns robbing girls in private spaces.\n\nA really young SB posted awhile ago about going to a new SD's house.  He gives her the payment, but rifles through her bag while she's sleeping, removes her drivers license and leaves it on the counter and removes the ppm.\n\nAddresses her by her real name in the morning, implying if she says anything about the rape and theft he will blackmail her to her parents.",
            "author": "Fair_Rhubarb28",
            "id": "iwdj7m5",
            "parent_id": "t1_iwcmq4t",
            "score": 2,
            "created_utc": 1668459880.0,
            "replies": []
        },
        {
            "body": "I had someone do that too.  She skedaddled out the door while I was in the bathroom.",
            "author": "aajniojnoihnoi",
            "id": "iwd1kce",
            "parent_id": "t1_iwcokf3",
            "score": -2,
            "created_utc": 1668453013.0,
            "replies": []
        },
        {
            "body": "No.  I would find it off-putting.  It’s not supposed to be a payment for a service.  If she’s willing to fuck me, she should trust me enough that I’m not going to do that.   I gave her a gift after the M&G.  I’ve taken her to a nice dinner. Now I’ve handed her an envelope before we are intimate.   She can trust me at that point.   Some other guys have used fake bills or whatever… I’m not them, and that’s an awful lot of fucking effort to save a few bucks.  I would argue it makes more sense to spend time getting to know the guy to the point this ain’t a concern.  If you’re going to a hotel with a guy you just met after a coffee, the risk of a scam is high.  If you’ve had a M&G, gotten a gif, and now another date, I think the risk is very low, and this isn’t supposed to be pay for play.",
            "author": "UseTheForceRey",
            "id": "iwe1a4v",
            "parent_id": "t1_iwe064t",
            "score": -2,
            "created_utc": 1668467330.0,
            "replies": [
                {
                    "body": "I  understand, and agree with your POV after having proved already some reliability to your Pot SB.  I personally never felt the need to check and have never been scammed either. But we are probably both in a section of the bowl where things like this not usually happen.\n\nReading others' experiences on sugar forums unfortunately taught me a lot about other, uglier, sections where these things do happen more frequently. Don't underestimate how far some scammers go, and how vulnerable some of their targets are.",
                    "author": "A-touchofreality",
                    "id": "iwe469y",
                    "parent_id": "t1_iwe1a4v",
                    "score": 2,
                    "created_utc": 1668468586.0,
                    "replies": [
                        {
                            "body": "Yes, I think that's a good point.    None of the SBs I've ever seen has counted, but I would recommend counting if it was more of a \"we just met, let's go have sex now\" situation.",
                            "author": "UseTheForceRey",
                            "id": "iwe7ghc",
                            "parent_id": "t1_iwe469y",
                            "score": 0,
                            "created_utc": 1668470039.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Agreed. Plus over time, trust will be built, and everything should naturally go more smoothly.",
            "author": "LaylaSB",
            "id": "iwfowi7",
            "parent_id": "t1_iwe064t",
            "score": 1,
            "created_utc": 1668498561.0,
            "replies": []
        },
        {
            "body": "Lol.   This is *exactly* my point.  I am *not* hiring anyone to act or provide a service.  If that is her intent, she’s not an SB and she should move on to someone who wants that shit.  \n\nJust because you don’t understand the difference between escorting and sugar dating doesn’t mean that there are no SBs out there who genuinely want to date someone who’s supporting them, not put on an act.",
            "author": "UseTheForceRey",
            "id": "iweq1qm",
            "parent_id": "t1_iweig66",
            "score": 1,
            "created_utc": 1668478477.0,
            "replies": [
                {
                    "body": "Whatever helps you sleep at night 🙄 \n\nTake away the PPM or allowance and see how long she sticks around",
                    "author": "ImWorried2017",
                    "id": "iweqwtf",
                    "parent_id": "t1_iweq1qm",
                    "score": 3,
                    "created_utc": 1668478858.0,
                    "replies": [
                        {
                            "body": "Why would I want to stop financially supporting someone who I am dating?",
                            "author": "UseTheForceRey",
                            "id": "iweu5cg",
                            "parent_id": "t1_iweqwtf",
                            "score": -2,
                            "created_utc": 1668480266.0,
                            "replies": [
                                {
                                    "body": "Here’s a pretty [valid reason](https://www.reddit.com/r/sugarlifestyleforum/comments/yuu3u2/sd_wants_to_stop_arrangement_and_for_us_to_start/?utm_source=share&utm_medium=ios_app&utm_name=iossmf). Sugar dating is one sided. One side is offering financial compensation. The other is offering their… ~~body~~  “time”? When both parties should be offering their time instead without money being an issue.",
                                    "author": "ImWorried2017",
                                    "id": "iwewz0q",
                                    "parent_id": "t1_iweu5cg",
                                    "score": 1,
                                    "created_utc": 1668481540.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Disagreed, for the reasons stated above.  No number of downvotes from SBs is going to change that.",
            "author": "UseTheForceRey",
            "id": "iwepptz",
            "parent_id": "t1_iwekiqr",
            "score": -2,
            "created_utc": 1668478332.0,
            "replies": []
        },
        {
            "body": "I agree with you that the loss of money has to be more impactful to the SB.  I also have given the PPM first in most cases.  I just hate the “it doesn’t matter if the SB plays an SD, it’s just money” argument… the impact of getting played is there whether that money is significant or not.",
            "author": "tempsdforfuns",
            "id": "iwd0avy",
            "parent_id": "t1_iwcs9w0",
            "score": -1,
            "created_utc": 1668452516.0,
            "replies": [
                {
                    "body": "So when you put it like that, then I agree with you!",
                    "author": "AusterlitzSD",
                    "id": "iwd1dc3",
                    "parent_id": "t1_iwd0avy",
                    "score": 3,
                    "created_utc": 1668452937.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I highly doubt that the same guy who is thoughtlessly spending a PPM on a bottle of wine is the guy who’s skipping out on the PPM.   The guy who’s skipping out on the PPM is probably taking you to the Applebee’s next to the Red Roof Inn where he’s going to fuck you, and doesn’t drink wine that doesn’t come in a box.",
            "author": "tempsdforfuns",
            "id": "iwebad9",
            "parent_id": "t1_iwdz1jl",
            "score": 1,
            "created_utc": 1668471770.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "iwhelyw",
            "parent_id": "t1_iwfikpi",
            "score": 1,
            "created_utc": 1668533955.0,
            "replies": [
                {
                    "body": "She said she’d had 2 prior multi year arrangements via SA. One speculates there would also be shorter ones",
                    "author": null,
                    "id": "iwhfa0w",
                    "parent_id": "t1_iwhelyw",
                    "score": 1,
                    "created_utc": 1668534214.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "iwhgbep",
                            "parent_id": "t1_iwhfa0w",
                            "score": 1,
                            "created_utc": 1668534614.0,
                            "replies": [
                                {
                                    "body": "Hmmm? She was very responsive on all fronts - just slow in getting me her bank info after refusing cash, which ultimately is her issue not mine. I paid her as soon as she sent it.",
                                    "author": null,
                                    "id": "iwhggqh",
                                    "parent_id": "t1_iwhgbep",
                                    "score": 2,
                                    "created_utc": 1668534671.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "iwdcvnd",
            "parent_id": "t1_iwdbri4",
            "score": 1,
            "created_utc": 1668457424.0,
            "replies": [
                {
                    "body": "Honestly I think it’s more for people who work extremely stressful jobs or mentally unwell men 😅",
                    "author": "hijkman2",
                    "id": "iwdhjmt",
                    "parent_id": "t1_iwdcvnd",
                    "score": 5,
                    "created_utc": 1668459234.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Thanks! No, I believe in myself and my experience and wisdom…. but it was a little harsh to direct at one individual in particular. It was the right words in the wrong setting.",
            "author": "P0sitiveViibes777",
            "id": "iwc8uj1",
            "parent_id": "t1_iwc6kl6",
            "score": 1,
            "created_utc": 1668441680.0,
            "replies": []
        },
        {
            "body": "Thanks for the feedback! I do get exasperated by the negativity toward men. But that is not the OP’s fault. That was really a scumbag thing to do to her.",
            "author": "P0sitiveViibes777",
            "id": "iwc8f8i",
            "parent_id": "t1_iwc6zla",
            "score": 4,
            "created_utc": 1668441507.0,
            "replies": []
        },
        {
            "body": "I  understand, and agree with your POV after having proved already some reliability to your Pot SB.  I personally never felt the need to check and have never been scammed either. But we are probably both in a section of the bowl where things like this not usually happen.\n\nReading others' experiences on sugar forums unfortunately taught me a lot about other, uglier, sections where these things do happen more frequently. Don't underestimate how far some scammers go, and how vulnerable some of their targets are.",
            "author": "A-touchofreality",
            "id": "iwe469y",
            "parent_id": "t1_iwe1a4v",
            "score": 2,
            "created_utc": 1668468586.0,
            "replies": [
                {
                    "body": "Yes, I think that's a good point.    None of the SBs I've ever seen has counted, but I would recommend counting if it was more of a \"we just met, let's go have sex now\" situation.",
                    "author": "UseTheForceRey",
                    "id": "iwe7ghc",
                    "parent_id": "t1_iwe469y",
                    "score": 0,
                    "created_utc": 1668470039.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Whatever helps you sleep at night 🙄 \n\nTake away the PPM or allowance and see how long she sticks around",
            "author": "ImWorried2017",
            "id": "iweqwtf",
            "parent_id": "t1_iweq1qm",
            "score": 3,
            "created_utc": 1668478858.0,
            "replies": [
                {
                    "body": "Why would I want to stop financially supporting someone who I am dating?",
                    "author": "UseTheForceRey",
                    "id": "iweu5cg",
                    "parent_id": "t1_iweqwtf",
                    "score": -2,
                    "created_utc": 1668480266.0,
                    "replies": [
                        {
                            "body": "Here’s a pretty [valid reason](https://www.reddit.com/r/sugarlifestyleforum/comments/yuu3u2/sd_wants_to_stop_arrangement_and_for_us_to_start/?utm_source=share&utm_medium=ios_app&utm_name=iossmf). Sugar dating is one sided. One side is offering financial compensation. The other is offering their… ~~body~~  “time”? When both parties should be offering their time instead without money being an issue.",
                            "author": "ImWorried2017",
                            "id": "iwewz0q",
                            "parent_id": "t1_iweu5cg",
                            "score": 1,
                            "created_utc": 1668481540.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "So when you put it like that, then I agree with you!",
            "author": "AusterlitzSD",
            "id": "iwd1dc3",
            "parent_id": "t1_iwd0avy",
            "score": 3,
            "created_utc": 1668452937.0,
            "replies": []
        },
        {
            "body": "She said she’d had 2 prior multi year arrangements via SA. One speculates there would also be shorter ones",
            "author": null,
            "id": "iwhfa0w",
            "parent_id": "t1_iwhelyw",
            "score": 1,
            "created_utc": 1668534214.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "iwhgbep",
                    "parent_id": "t1_iwhfa0w",
                    "score": 1,
                    "created_utc": 1668534614.0,
                    "replies": [
                        {
                            "body": "Hmmm? She was very responsive on all fronts - just slow in getting me her bank info after refusing cash, which ultimately is her issue not mine. I paid her as soon as she sent it.",
                            "author": null,
                            "id": "iwhggqh",
                            "parent_id": "t1_iwhgbep",
                            "score": 2,
                            "created_utc": 1668534671.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Honestly I think it’s more for people who work extremely stressful jobs or mentally unwell men 😅",
            "author": "hijkman2",
            "id": "iwdhjmt",
            "parent_id": "t1_iwdcvnd",
            "score": 5,
            "created_utc": 1668459234.0,
            "replies": []
        },
        {
            "body": "Yes, I think that's a good point.    None of the SBs I've ever seen has counted, but I would recommend counting if it was more of a \"we just met, let's go have sex now\" situation.",
            "author": "UseTheForceRey",
            "id": "iwe7ghc",
            "parent_id": "t1_iwe469y",
            "score": 0,
            "created_utc": 1668470039.0,
            "replies": []
        },
        {
            "body": "Why would I want to stop financially supporting someone who I am dating?",
            "author": "UseTheForceRey",
            "id": "iweu5cg",
            "parent_id": "t1_iweqwtf",
            "score": -2,
            "created_utc": 1668480266.0,
            "replies": [
                {
                    "body": "Here’s a pretty [valid reason](https://www.reddit.com/r/sugarlifestyleforum/comments/yuu3u2/sd_wants_to_stop_arrangement_and_for_us_to_start/?utm_source=share&utm_medium=ios_app&utm_name=iossmf). Sugar dating is one sided. One side is offering financial compensation. The other is offering their… ~~body~~  “time”? When both parties should be offering their time instead without money being an issue.",
                    "author": "ImWorried2017",
                    "id": "iwewz0q",
                    "parent_id": "t1_iweu5cg",
                    "score": 1,
                    "created_utc": 1668481540.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "iwhgbep",
            "parent_id": "t1_iwhfa0w",
            "score": 1,
            "created_utc": 1668534614.0,
            "replies": [
                {
                    "body": "Hmmm? She was very responsive on all fronts - just slow in getting me her bank info after refusing cash, which ultimately is her issue not mine. I paid her as soon as she sent it.",
                    "author": null,
                    "id": "iwhggqh",
                    "parent_id": "t1_iwhgbep",
                    "score": 2,
                    "created_utc": 1668534671.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Here’s a pretty [valid reason](https://www.reddit.com/r/sugarlifestyleforum/comments/yuu3u2/sd_wants_to_stop_arrangement_and_for_us_to_start/?utm_source=share&utm_medium=ios_app&utm_name=iossmf). Sugar dating is one sided. One side is offering financial compensation. The other is offering their… ~~body~~  “time”? When both parties should be offering their time instead without money being an issue.",
            "author": "ImWorried2017",
            "id": "iwewz0q",
            "parent_id": "t1_iweu5cg",
            "score": 1,
            "created_utc": 1668481540.0,
            "replies": []
        },
        {
            "body": "Hmmm? She was very responsive on all fronts - just slow in getting me her bank info after refusing cash, which ultimately is her issue not mine. I paid her as soon as she sent it.",
            "author": null,
            "id": "iwhggqh",
            "parent_id": "t1_iwhgbep",
            "score": 2,
            "created_utc": 1668534671.0,
            "replies": []
        }
    ]
}