{
    "title": "My SB only wants to have sex. Is this weird or did I hit the jackpot?",
    "post_id": "sh2sv5",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/sh2sv5/my_sb_only_wants_to_have_sex_is_this_weird_or_did/",
    "author": "NC-Chat",
    "body": "So I've been talking with my SB every day for about 2 months now. Because of my schedule we weren't able to meet up, then the holidays came, AND a covid case... So instead we've been talking nonstop and formed a pretty strong connection through phonecalls/texting. We were finally able to do a M&G a couple weeks ago and agreed on starting the arrangement. For the M&G I took her to a really nice restaurant and was planning on taking her to an art museum after. Halfway through lunch she told me  she was really appreciative, but that she's a low maintenaince kind of girl and doesn't really care to do fancy meals or activities. Her preference is just hanging out and getting takeout. Cool, easy. \n\nSo I planned our first intimate date (last saturday). I was going to cook for her, we were going to watch our favorite shows together, and hang out. Now I already knew we are very sexually compatible, but barely 30 minutes into the date we were already going at it. We literally did not get off the bed the remainder of the date. We are both very high sex-drive people with shared, specific kinks so it came very naturally and time flew by. Towards the end of the date we agreed to be exclusive and we did talk a lot during our breaks. What caught me by surprise was that she said this was an ideal date for her. She prefers to meet up and have sex for 3-5 hours. \"I guess we can do lunch sometimes, if you really want to?\" was what she said to me before we left. \n\nWe talked a bit the day after and we are making plans for the next date. I asked her if she meant what she said about only having sex during the dates and she was surprised I was even asking. She has 3-4 friends who also sugar and this how most of their dates go as well.\n\nI do want to make it clear that she is NOT an escort and while I don't know her friends I don't think they are based on the conversations we've had. I know a lot about my SB, honestly she's told me too much personal stuff and I can see us moving towards the SGF/SBF vibe. However, I know SRs are time-limited and I have an idea how long this is going to last. I really want to enjoy what I have, and I'm grateful for it. But honestly, is this normal? Should I expect this on the next go around? Or did I find someone who's just as big of a pervert as I am out of sheer luck? I don't have much experience with real SRs as my last two relationships (3 years ago) I was more of a spoiling boyfriend than anything.",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/sh2sv5/my_sb_only_wants_to_have_sex_is_this_weird_or_did/",
    "score": 116,
    "upvote_ratio": 0.92,
    "created_utc": 1643640163.0,
    "num_comments": 130,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "[deleted]",
            "author": null,
            "id": "huzygye",
            "parent_id": "t3_sh2sv5",
            "score": 56,
            "created_utc": 1643640509.0,
            "replies": [
                {
                    "body": "Not to be controversial but that's never the response when sds and sbs want platonic and online its alwyas \"thats not a real SR\"",
                    "author": "ready4anytng",
                    "id": "hv0ud32",
                    "parent_id": "t1_huzygye",
                    "score": 18,
                    "created_utc": 1643652743.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "hv0vt2e",
                            "parent_id": "t1_hv0ud32",
                            "score": 14,
                            "created_utc": 1643653275.0,
                            "replies": [
                                {
                                    "body": "Escort?  3 to 5 hours if sex??!!  Not in a million years.",
                                    "author": "TexTH",
                                    "id": "hv36z1r",
                                    "parent_id": "t1_hv0vt2e",
                                    "score": 8,
                                    "created_utc": 1643687237.0,
                                    "replies": []
                                },
                                {
                                    "body": "I came to this thread to say that, but after reading the OP it sounds like he has been doing a lot of talking on the phone, which an escort presumably wouldn't be into doing for free.",
                                    "author": "Sugarbeggar",
                                    "id": "hv11f3c",
                                    "parent_id": "t1_hv0vt2e",
                                    "score": 19,
                                    "created_utc": 1643655330.0,
                                    "replies": []
                                },
                                {
                                    "body": "No escort is taking dick for 3 to 5 hours",
                                    "author": "Blknior",
                                    "id": "hv2fjwa",
                                    "parent_id": "t1_hv0vt2e",
                                    "score": 14,
                                    "created_utc": 1643675019.0,
                                    "replies": [
                                        {
                                            "body": "From the same person, anyway.",
                                            "author": "aotus_trivirgatus",
                                            "id": "hv2ipmo",
                                            "parent_id": "t1_hv2fjwa",
                                            "score": 10,
                                            "created_utc": 1643676506.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "They would  say its not a real SR and she should find a different sub then remove her post and ban her for rule 12 of course. But because its an SDs its the \"jackpot\"  of all SRs and shes a unicorn",
                                    "author": "ready4anytng",
                                    "id": "hv0w6tl",
                                    "parent_id": "t1_hv0vt2e",
                                    "score": 17,
                                    "created_utc": 1643653416.0,
                                    "replies": []
                                },
                                {
                                    "body": "For what its worth there IS an emotional connection at play, I should have mentioned that more in the post. We talk everyday, we're invested in each other's lives (within healthy boundaries) and have plenty of discussions outside of sex. The difference is when we actually are together.. . She just wants to fuck as much as possible. I've been with escorts before, this is very, very different.",
                                    "author": "NC-Chat",
                                    "id": "hv0x5so",
                                    "parent_id": "t1_hv0vt2e",
                                    "score": 14,
                                    "created_utc": 1643653769.0,
                                    "replies": [
                                        {
                                            "body": "I have had 4 Sugar relationships and they all were pretty much like yours.",
                                            "author": "redstone24",
                                            "id": "hv1rti7",
                                            "parent_id": "t1_hv0x5so",
                                            "score": 6,
                                            "created_utc": 1643665254.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "> Im getting escort vibes\n\nNot when she wants sex for 3-5 hours unless he signed up for the extended care program /s",
                                    "author": "GSSD",
                                    "id": "hv1gvjj",
                                    "parent_id": "t1_hv0vt2e",
                                    "score": 2,
                                    "created_utc": 1643661121.0,
                                    "replies": []
                                },
                                {
                                    "body": "I've met several women IRL who wanted that except the allowance.   However, we generally talked a lot between and after.  Relationships come in all sizes and flavors.  Worry more about what works for you rather than what you think others would think of the relationship - with the singular exception if you feel used or abused.",
                                    "author": "pinotandsugar",
                                    "id": "hv3f8vh",
                                    "parent_id": "t1_hv0vt2e",
                                    "score": 0,
                                    "created_utc": 1643691392.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "Cuz platonic and online is called friendship 😗",
                            "author": "Late_Ad_6293",
                            "id": "hv1rs06",
                            "parent_id": "t1_hv0ud32",
                            "score": 3,
                            "created_utc": 1643665238.0,
                            "replies": [
                                {
                                    "body": "I dont sext with my friends online like i assume online sbs do. Also didn't the previous commenter just say \"Honestly a SR for both SD and SB comes down to what both sides want from the relationship\" ?",
                                    "author": "ready4anytng",
                                    "id": "hv27k1y",
                                    "parent_id": "t1_hv1rs06",
                                    "score": 4,
                                    "created_utc": 1643671519.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": ">Honestly a SR for both SD and SB comes down to what both sides want from the relationship.\n\nYup.\n\nThis sounds pretty far for the \"normal\", to the extent there is such a thing in the bowl, but awesome that the two of you matched up so well. Enjoy!",
                    "author": "NoLimitLexa",
                    "id": "hv03mf2",
                    "parent_id": "t1_huzygye",
                    "score": 5,
                    "created_utc": 1643642648.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "That’s awful. \nI’d like to meet her and get to the bottom of this scandal.",
            "author": "DrZenRoot",
            "id": "huzye86",
            "parent_id": "t3_sh2sv5",
            "score": 170,
            "created_utc": 1643640477.0,
            "replies": [
                {
                    "body": "Hahaha",
                    "author": "chemistryromance",
                    "id": "hv09gwr",
                    "parent_id": "t1_huzye86",
                    "score": 5,
                    "created_utc": 1643644970.0,
                    "replies": []
                },
                {
                    "body": "😂😂",
                    "author": null,
                    "id": "hv005sp",
                    "parent_id": "t1_huzye86",
                    "score": 8,
                    "created_utc": 1643641228.0,
                    "replies": [
                        {
                            "body": "I concur. What's her GV number?",
                            "author": "BinghamtonSD",
                            "id": "hv04rru",
                            "parent_id": "t1_hv005sp",
                            "score": 12,
                            "created_utc": 1643643106.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "🤣🤣🤣",
                    "author": "SweetD79",
                    "id": "hv1226j",
                    "parent_id": "t1_huzye86",
                    "score": 4,
                    "created_utc": 1643655562.0,
                    "replies": []
                },
                {
                    "body": "😆 🤣 😂",
                    "author": "mentor4you",
                    "id": "hv1t4vy",
                    "parent_id": "t1_huzye86",
                    "score": 2,
                    "created_utc": 1643665761.0,
                    "replies": []
                },
                {
                    "body": "LMAO, I almost choked on my wrap! 🤣",
                    "author": "Professional-Ad-450",
                    "id": "hv5di3h",
                    "parent_id": "t1_huzye86",
                    "score": 1,
                    "created_utc": 1643732441.0,
                    "replies": [
                        {
                            "body": "If there are any other young women who are looking for a sex only relationship, please DM me and give me a chance to ‘talk you out of it’",
                            "author": "DrZenRoot",
                            "id": "hv5fb1l",
                            "parent_id": "t1_hv5di3h",
                            "score": 2,
                            "created_utc": 1643733108.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "This is totally me. I like restaurants sometimes but usually more hours of play.",
            "author": null,
            "id": "hv0h08l",
            "parent_id": "t3_sh2sv5",
            "score": 21,
            "created_utc": 1643647834.0,
            "replies": []
        },
        {
            "body": "I have an SB that I've tried to take out many times. She'd rather just meet and have at it. We talk a lot but there are no expensive dates. Just a good connection and great sex.",
            "author": "SD1070",
            "id": "hv01gb4",
            "parent_id": "t3_sh2sv5",
            "score": 18,
            "created_utc": 1643641763.0,
            "replies": [
                {
                    "body": "I know the feeling, tho it's a little different. My current, main SB (4 months in) and I plan dates. We start at a hotel with sex (sex first works for me), then some nice cuddling and conversation and suddenly 4 hours have passed and that's all we do. We have had some other dates - a play, some meals - and we're going out for dinner this week. We make plans!! But they usually don't happen.\n\nIt worries me, but it's also very pleasant to have great sex, then talk, be held and caressed for a few hours. I've expressed my concerns to her, told her I'm happy to do what she likes, and she says this is pretty great for her. I think the only way to change it is to do something else, something public, first. Probably will make that change but between the pandemic and winter, this works.\n\nI've also had SBs who only wanted sex, but that's not my current situation. If the sex is good and not rushed, those SRs worked fine, too, tho they usually didn't last long. At some point a relationship has to be more than sex or if doesn't last, imo. So it either evolves and grows or ends.",
                    "author": "ziggy440",
                    "id": "hv0ysss",
                    "parent_id": "t1_hv01gb4",
                    "score": 3,
                    "created_utc": 1643654372.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I don't think it's that rare, high libido women do exist and SRs are often a good outlet. Both my SBs have indicated they're up for \"just playtime\" dates sometimes, while I had tended to assume we'd continue with more date-y activities. \n\nIt depends on your dynamic, and if it works well for you, then great. This sub tends to have a lot of responses that skew toward the more emotionally attached side of Sugaring, but that's if anything a vocal minority, and many sugar relationships are on the more casual and physical side of the spectrum.",
            "author": "noobNYCsd",
            "id": "hv08clg",
            "parent_id": "t3_sh2sv5",
            "score": 16,
            "created_utc": 1643644527.0,
            "replies": []
        },
        {
            "body": "It’s fairly common.  Sometimes the girl needs to be discreet so she doesn’t want to go out and other times they only have X amount of time and they would rather spend it in bed than restaurants and museums.  I can see not being very excited about it if she was trying to get in and out very quickly but three or four hours is a good date length for me.",
            "author": "LotBuilder",
            "id": "hv0e597",
            "parent_id": "t3_sh2sv5",
            "score": 21,
            "created_utc": 1643646763.0,
            "replies": [
                {
                    "body": "\\+1 It's more about avoiding being seen with the person, than the play time!",
                    "author": "Interesting_Scar_481",
                    "id": "hv1350w",
                    "parent_id": "t1_hv0e597",
                    "score": 18,
                    "created_utc": 1643655962.0,
                    "replies": [
                        {
                            "body": "Yep",
                            "author": "Azucarbabby",
                            "id": "hv1ijlq",
                            "parent_id": "t1_hv1350w",
                            "score": 6,
                            "created_utc": 1643661747.0,
                            "replies": []
                        },
                        {
                            "body": ">\\+1 It's more about avoiding being seen with the person, than the play time!\n\nObservant comment buried -- hopefully u/Interesting_Scar_481 s comment can get upvoted.\n\nCan you expand ?",
                            "author": "Hyceanplanet",
                            "id": "hv274nz",
                            "parent_id": "t1_hv1350w",
                            "score": 4,
                            "created_utc": 1643671340.0,
                            "replies": [
                                {
                                    "body": "There isn't much to expand. Multiple reasons girl wouldn't want to be seen with the SD (none of them flattering for the SD) in public, so more play time to make up for it.",
                                    "author": "Interesting_Scar_481",
                                    "id": "hv3gki2",
                                    "parent_id": "t1_hv274nz",
                                    "score": 6,
                                    "created_utc": 1643692104.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Damn that’s a long time lol you got your pills?",
            "author": "UnearthlyDinosaur",
            "id": "hv01ks9",
            "parent_id": "t3_sh2sv5",
            "score": 8,
            "created_utc": 1643641814.0,
            "replies": [
                {
                    "body": "hah yeah I did. I didn't think I was going to need it but was very wrong on that.",
                    "author": "NC-Chat",
                    "id": "hv02gk6",
                    "parent_id": "t1_hv01ks9",
                    "score": 7,
                    "created_utc": 1643642176.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Hate be the negative Nancy, but some girls don’t want to be seen in public with an older guy. She could be an undercover SW as well, but if she stayed 3-5 hours and you are on Ppm she probabaly isn’t a SW",
            "author": "Secret_Diet7053",
            "id": "hv0u0cz",
            "parent_id": "t3_sh2sv5",
            "score": 8,
            "created_utc": 1643652612.0,
            "replies": [
                {
                    "body": "We're on allownce and the date was about 6 hours. I told her she could leave whenever and she stuck around a couple hours longer than I thought she would. She definitely had a good time too from the way she's been texting me, feels more like she needs the outlet.",
                    "author": "NC-Chat",
                    "id": "hv0vltd",
                    "parent_id": "t1_hv0u0cz",
                    "score": 7,
                    "created_utc": 1643653202.0,
                    "replies": [
                        {
                            "body": "My ex and I had a similar relationship, I loved staying in with him and would often spend the night but whenever he suggested leaving the house together??? I'm good lol. I obviously couldn't tell him why but I wouldn't push for dates as it seems she's uncomfortable with public dates.",
                            "author": null,
                            "id": "hv4k1lg",
                            "parent_id": "t1_hv0vltd",
                            "score": 2,
                            "created_utc": 1643719761.0,
                            "replies": [
                                {
                                    "body": "Why didn’t you want to go out with him?",
                                    "author": null,
                                    "id": "hy2c73w",
                                    "parent_id": "t1_hv4k1lg",
                                    "score": 1,
                                    "created_utc": 1645592859.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "hv098l9",
            "parent_id": "t3_sh2sv5",
            "score": 19,
            "created_utc": 1643644876.0,
            "replies": [
                {
                    "body": "I think unless you really have a lot to talk about, alot in common, and you're both chatty people, then spending more time in bed than time dining/hiking/sightseeing or whatever, is probably fairly common. Personally I quite like the non-sex time and I can talk for hours about  a lot of things! But we;re not all the same.",
                    "author": "nickthegreekinlondon",
                    "id": "hv0b6n3",
                    "parent_id": "t1_hv098l9",
                    "score": 8,
                    "created_utc": 1643645638.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "hv0bw06",
                            "parent_id": "t1_hv0b6n3",
                            "score": 9,
                            "created_utc": 1643645910.0,
                            "replies": [
                                {
                                    "body": "Haha, I know what you mean. That's so cool.",
                                    "author": "nickthegreekinlondon",
                                    "id": "hv4q73r",
                                    "parent_id": "t1_hv0bw06",
                                    "score": 1,
                                    "created_utc": 1643722908.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "In my experience, not weird at all. The vast majority of my sugar relationships (and all the successful ones) have been with women who are sexually into mature men. Some to the point where they really are just using the sites as hookup sites and not even looking for “sugar”, per se. The one I’m seeing right now for instance. We’ve both been crazy busy and she had a COVID exposure scare. We haven’t had time for a proper “date” for three weeks, but got together for brunch yesterday. We both had a hard stop time and weren’t close to either of our apartments. I came into the restaurant, she hugs me, and she whispers “Follow me now. Don’t ask questions.” She heads to one of the restrooms (gender neutral, FWIW) and proceeds to throw herself on me (so to speak). Repeated after brunch. 😉 Felt like a teenager sneaking around, but definitely on-brand for this woman. Like u/NC-Chat this one would be SGF material given our great connection except that she’s married (they’re open, I’ve met him).",
            "author": "captcreamfiller",
            "id": "hv0kx6d",
            "parent_id": "t3_sh2sv5",
            "score": 14,
            "created_utc": 1643649280.0,
            "replies": [
                {
                    "body": "Thank you! Honestly this makes me feel a lot better. I had such a great time with her that I'm afraid of the relationship ending (which it will) and not be able to find this same sort of thing later. So far based on the responses I've seen it's not super common, but not exactly uncommon either.",
                    "author": "NC-Chat",
                    "id": "hv0lfw6",
                    "parent_id": "t1_hv0kx6d",
                    "score": 4,
                    "created_utc": 1643649473.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "First of all you have a top notch SB! She told you exactly what she wanted pretty quick. You now know. So you can choose to move forward with 'sex and lunch'. Or find someone if you want more out of it.\n\nI am finding out it is 'more normal' to have these types of dates than I thought. I prefer a more social date. However, if I found someone who liked all my kinks I would explore that as long as possible.",
            "author": "CenTexFunGuy",
            "id": "huzz6ac",
            "parent_id": "t3_sh2sv5",
            "score": 20,
            "created_utc": 1643640810.0,
            "replies": [
                {
                    "body": ">I am finding out it is 'more normal' to have these types of dates than I thought\n\nThis is what I'm really wondering too. When I was searching, half of my POTs hinted that the only really wanted dinner/drinks and werent looking for much more than that either. But I get the exact opposite feeling from a lot of the SBs here on SLF as well. I'm really happy so far, but I'm trying to gauge if this is more normal than I thought. I feel insanely lucky as it is.",
                    "author": "NC-Chat",
                    "id": "hv01fgy",
                    "parent_id": "t1_huzz6ac",
                    "score": 5,
                    "created_utc": 1643641754.0,
                    "replies": [
                        {
                            "body": "What is Normal these days ? Nothing",
                            "author": "DiscreetlyYours2",
                            "id": "hv0usmd",
                            "parent_id": "t1_hv01fgy",
                            "score": 5,
                            "created_utc": 1643652902.0,
                            "replies": []
                        },
                        {
                            "body": "True, SLF SBs are the real ones that I can tell. They are not really the 'feed and fuk and leave' types.",
                            "author": "CenTexFunGuy",
                            "id": "hv032qs",
                            "parent_id": "t1_hv01fgy",
                            "score": 6,
                            "created_utc": 1643642427.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "This is just SR honeymoon and that's all it is.  Everything seems golden and full of roses the 1st few weeks.  Because if it's led by sex, it won't last very long.  I've bed SBs that were top notch that wanted nothing but good hot sex and it ends when I felt my satisfaction stopped when I no longer just need the sex.  Maybe it's just me but after a few weeks it can get too routine.\n\nIf your SB is leading with sex, it's the quickest and fastest way for a SB to gain your trust.  It isn't absolute but usually SB that is really sincere about a long term SR would not lead by sex that fast and that much.  Because even they know that sex driven SR won't last and that will only get tired after a few weeks.\n\nSo no matter what you and her discussed candidly the only way to real long term lasting SR is to slow things down and see what else she can bring for you.  Using sex to create a bond is just too easy.",
            "author": "MKTekke",
            "id": "hv0kabt",
            "parent_id": "t3_sh2sv5",
            "score": 5,
            "created_utc": 1643649049.0,
            "replies": [
                {
                    "body": "That was a really thoughtful response, thanks for that. This is partially why I mentioned we were talking for a little over a month before the M&G. We really didn't talk about sex almost at all until about 2 or 3 days before we met. BUT I am definitely going to keep what you said in the back of my mind. I do tend to fixate on things/people and can have a harder time seeing bigger pictures when I'm enthralled. Thank you!",
                    "author": "NC-Chat",
                    "id": "hv0mimn",
                    "parent_id": "t1_hv0kabt",
                    "score": 1,
                    "created_utc": 1643649863.0,
                    "replies": [
                        {
                            "body": "I'm not being judgmental just putting things in perspective and based on my experience.  I too had experienced what you have had.  It's great but just careful not to get let down after a month when you discover whether there is any true bond.  A lot of SBs are very good with manipulation.  They would make it seem like to the moon we go together but once they feel they've gotten what they've wanted they can reveal their intentions later on so always make decisions when the mood is clear.",
                            "author": "MKTekke",
                            "id": "hv0toq4",
                            "parent_id": "t1_hv0mimn",
                            "score": 3,
                            "created_utc": 1643652492.0,
                            "replies": [
                                {
                                    "body": "I will definitely keep this in mind. Taking her at her word, she's never had a consistent SR for more than a couple months. She's high libido and is only attracted to older men. After the date my first thought was, that was so good but how long will this really last?\n\nDefinitely will keep your advice in my mind for later.",
                                    "author": "NC-Chat",
                                    "id": "hv0w61e",
                                    "parent_id": "t1_hv0toq4",
                                    "score": 1,
                                    "created_utc": 1643653408.0,
                                    "replies": [
                                        {
                                            "body": "Well, I certainly hope you don't take things into heart yet.  It's easy for a SB to say they are attracted to older men when there are $$ attached to it.  Can they be with you without the $?  I never take it seriously when a SB says they're into older men unless they can really prove to me that we can do something together that isn't transactional at all.  Otherwise it is still just that a transactional fantasy relationship.  I'm trying to put things in perspective, some SBs are very good at being that fantasy for you and everything they say belongs in that fantasy.",
                                            "author": "MKTekke",
                                            "id": "hv5m8z0",
                                            "parent_id": "t1_hv0w61e",
                                            "score": 1,
                                            "created_utc": 1643735654.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Why are you complaining about this? I mean really? We tend to make great things bad by not just enjoying them. Enjoy the moment and stop overthinking everything. Before you know it, it will be over and you will be dreaming about it. Just…enjoy…without…thinking about it.",
            "author": "oldharddrive",
            "id": "hv01ecw",
            "parent_id": "t3_sh2sv5",
            "score": 10,
            "created_utc": 1643641741.0,
            "replies": [
                {
                    "body": "I'm not complaining. At all. What I'm asking is if this is somewhat normal for SRs since I don't have a ton of experience doing this. Her thinking is that it is since thats her preference and since her friends do this too.\n\nThe reason I'm thinking about it is because A) I'm tempted to up her allowance and make sure I keep exclusivity and B) When this relationship DOES end, what should I expect.\n\nDefinitely no complaints though.",
                    "author": "NC-Chat",
                    "id": "hv027oq",
                    "parent_id": "t1_hv01ecw",
                    "score": 7,
                    "created_utc": 1643642075.0,
                    "replies": [
                        {
                            "body": "Why does any of that matter? Just enjoy the present. You will have all the time in the world to contemplate whether this was “normal” or not when it eventually ends. Who cares if it is or isn’t normal? So you found a unicorn, ride it (pun intended) Save that contemplative energy for enjoying your SB. From the way you describe the SR, you need all the energy you can muster 🤣",
                            "author": "oldharddrive",
                            "id": "hv0p2q7",
                            "parent_id": "t1_hv027oq",
                            "score": 3,
                            "created_utc": 1643650800.0,
                            "replies": [
                                {
                                    "body": "Lol you know that's really good advice. I do tend to overthink. I'm debating on upping her allownce as an added incentive to stick around, but based on some other messages just giving extra gifts should do the trick.\n\nThanks for the honest feedback.",
                                    "author": "NC-Chat",
                                    "id": "hv0pcll",
                                    "parent_id": "t1_hv0p2q7",
                                    "score": 6,
                                    "created_utc": 1643650900.0,
                                    "replies": [
                                        {
                                            "body": "Glad to help! Just telling you from experience man. I have the PERFECT SB and I almost ruined it getting in my own head. Enjoying the ride is soooooooo much better that the alternative.",
                                            "author": "oldharddrive",
                                            "id": "hv0vi6o",
                                            "parent_id": "t1_hv0pcll",
                                            "score": 1,
                                            "created_utc": 1643653165.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "I don’t think there’s a standard SR. It’s really different for everyone. If you both feel happy and fulfilled with the dynamic she wants, then there’s nothing wrong with it! If you are hoping for something long-term, I don’t think it hurts to tell her that, but I do agree that you should try to enjoy it regardless. It’s still meaningful even if it doesn’t last forever. Also, all relationships end differently too so there’s really no way of knowing what to expect and I don’t think it’s worth worrying about.",
                            "author": "fuzzydaymoon",
                            "id": "hv1gnkv",
                            "parent_id": "t1_hv027oq",
                            "score": 1,
                            "created_utc": 1643661035.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "If the sex was great that’s all I would want to be honest. My sex drive is insane mid 30’s here. It’s my ideal situation high allowance and lots of sex I would choose it over restaurants and all that any day. My vanilla dates take me and I was married to a man who took me to the nicest places I’m not really into it anymore.",
            "author": "atlbabie",
            "id": "hv0a723",
            "parent_id": "t3_sh2sv5",
            "score": 3,
            "created_utc": 1643645252.0,
            "replies": [
                {
                    "body": "This is pretty much exactly what my SB said to me. She isn't vanilla dating or seeing anyone else. She has a very high sexdrive and we have the same kinks, so to her she's just getting out all of her frustration. She wants as much time as possible to do that. I'm trying not to get too attached so realizing that she's not this one in a billion date is helping, thank you.",
                    "author": "NC-Chat",
                    "id": "hv0b99r",
                    "parent_id": "t1_hv0a723",
                    "score": 2,
                    "created_utc": 1643645666.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "That is unusual for sure.  You should definitely up your gift to her to show your appreciation (and keep her as long as possible).  For me personally, I am not a big fan of indoor only arrangements.  Even if the sex is perfect, it just feels incomplete to me.  And I don't really understand the mechanics of a 5 hour sex marathon. But is sounds like you two just fit very well with your shared kinks.",
            "author": "mike_o212",
            "id": "hv0f6ie",
            "parent_id": "t3_sh2sv5",
            "score": 3,
            "created_utc": 1643647156.0,
            "replies": []
        },
        {
            "body": "This is a good problem to have. You actually need to find excuses to lure your SB away from sex! LOL \n\nIt’s not a bad thing at all. It’s not like she wants to bang for an hour and run.\n\nJust tell her you need a “food break” or a “movie break”.",
            "author": "SDchat",
            "id": "hv0fndl",
            "parent_id": "t3_sh2sv5",
            "score": 3,
            "created_utc": 1643647332.0,
            "replies": [
                {
                    "body": "Yeah. I'm not worried about the breaks or anything like that, this is pretty ideal to me overall. I'm more thinking if this is now a reasonable expectation for future SRs or if I found the 1 in a million SB that just wants to go at it with me for hours. I'm honestly debating on upping her allowance to make sure she sticks around long term, but only if this is something that I really would never find again.",
                    "author": "NC-Chat",
                    "id": "hv0g7dc",
                    "parent_id": "t1_hv0fndl",
                    "score": 1,
                    "created_utc": 1643647538.0,
                    "replies": [
                        {
                            "body": "Raising allowance will almost always be well received. Maybe try connecting it to things she likes. Gifts. Experiences. Sex toys for your mutual kinks (maybe).\n\nSo yes, allowance and maybe extra monetary gifts, but also other stuff that just tickles her interests beyond money.\n\nSome SBs will stay with you for benifits, but most will stay longer if they really like you. \n\nFigure out what her priorities are, but don’t let her know that you are “sold“. Keep her interested and keep her surprised. \n\nI’d go with surprise gifts (cash and/or actual things), then be cool about it, “Awe, just a little something for you.” \n\nYou have to be the catch too!",
                            "author": "SDchat",
                            "id": "hv0ju2d",
                            "parent_id": "t1_hv0g7dc",
                            "score": 4,
                            "created_utc": 1643648880.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "This is how it is with my current SB. She literally just wants to meet me to have sex. We're exclusive. I don't mind because during our downtime during sex we do talk and get to know each other better. We also had a huge break as she went home for the holidays and then had Omicron, etc.\n\nWait a second .. are we dating the same SB? ;)",
            "author": "vince539839",
            "id": "hv0p1i0",
            "parent_id": "t3_sh2sv5",
            "score": 3,
            "created_utc": 1643650787.0,
            "replies": []
        },
        {
            "body": "As an SB, it REALLY depends on the person and the dynamics of what they want. I prefer a more social arrangement because I love upscale dinners and activities. However, sometimes my SDs just want sex and that’s what the arrangement is. I respect it either way.\n\nNow my current SR, I’m so attracted I just want to screw him 24/7. Because it’s MY way of connecting to someone on a deeper level. I’m kind of wondering now if he thinks the same thing… lol because I always send sexy, flirty texts ALL THE TIME because I figured that was every man’s dream. Lol 🤷🏻‍♀️",
            "author": null,
            "id": "hv0tuwz",
            "parent_id": "t3_sh2sv5",
            "score": 3,
            "created_utc": 1643652556.0,
            "replies": []
        },
        {
            "body": "Somewhere between the \"dirty little secret\" and the \"elephant in the room\" lies the notion that there are very high libido men AND women \"out here.\"\n\nThey (we)'ve always found ways to find each other.  From party phone line services (pre-internet), to IRC (internet relay chat), to Yahoo Chat, to Craigslist, etc etc.  \n\nAnd obviously throughout the centuries (millenia surely) men have \"taken care\" of and \"provided for\" such women in their lives.\n\nWe're just in the 21st century version of this.",
            "author": null,
            "id": "hv0xyie",
            "parent_id": "t3_sh2sv5",
            "score": 3,
            "created_utc": 1643654063.0,
            "replies": []
        },
        {
            "body": "pretty normal tbh. she doesnt want to be seen in public w you though",
            "author": "vtec__",
            "id": "hv11f2t",
            "parent_id": "t3_sh2sv5",
            "score": 3,
            "created_utc": 1643655330.0,
            "replies": []
        },
        {
            "body": "good actress.\n\nI bet if you give her allowance with no sex ahe wont complain.\n\ngive it a whirl :)",
            "author": "bookworm010101",
            "id": "hv1db8y",
            "parent_id": "t3_sh2sv5",
            "score": 3,
            "created_utc": 1643659775.0,
            "replies": []
        },
        {
            "body": "I had a baby like that. It went for 7 months but it gets old after a while. She also had freinds doing it a \"coaching\" her. Not an escort but escortie for sure.",
            "author": "Limp_Mulberry5030",
            "id": "hv1r91s",
            "parent_id": "t3_sh2sv5",
            "score": 3,
            "created_utc": 1643665037.0,
            "replies": []
        },
        {
            "body": "You can deny it all you want but what you have is an escort.",
            "author": "Late_Ad_6293",
            "id": "hv1ru09",
            "parent_id": "t3_sh2sv5",
            "score": 3,
            "created_utc": 1643665259.0,
            "replies": []
        },
        {
            "body": "Personally, I'd hate an arrangement like that, but if you like it, then enjoy!\n\nI know you say she's not an escort, but I hope you understand why it's going to be many peoples first response, and it's very possible she has lied to you about some stuff to hide her profession. This goes beyond a high sex drive and amazing sexual compatibility which is amazing in any relationship. Stay skeptical and keep using condoms for awhile to be safe.\n\nEach arrangement is different and there are a lot of women that just want a sex based arrangement. They're generally prostitutes and escorts though. Finding an actual SB that only wants to have sex is going to be hard and you'll likely end up with a woman that goes along with what you want despite not liking it if you mention to a pot that you're looking for a sex only arrangement. I've talked to a lot of women with near identical stories of how their first arrangement wad awful because they only had sex and she felt used and she didn't know enough to know other types of arrangements are out there.",
            "author": "sexviewer",
            "id": "hv24cyq",
            "parent_id": "t3_sh2sv5",
            "score": 3,
            "created_utc": 1643670204.0,
            "replies": []
        },
        {
            "body": "Many of us with higher libidos find the sugar bowl and other kinks are more accepting and less shaming than the more conservative relationship escalators.",
            "author": "LadyMorgan2018",
            "id": "hv380fx",
            "parent_id": "t3_sh2sv5",
            "score": 3,
            "created_utc": 1643687727.0,
            "replies": []
        },
        {
            "body": "Lol I’m not sure what she told you, to make you believe that she and her friends aren’t escorts, but lol she’s an escort. This is coming from someone who has a bunch of friends who ARE escorts. “ I guess we can do lunch sometime “ that’s like saying “it’s okay for us to go on a lunch date or two sometime, so YOU won’t feel this is too transactional” it’s like a statement to deter from what’s happening, lol money in exchange for sex. It’s going to get very old. But if that’s what you want, mine as well call a spade a spade. The fact that you had to PSA that she’s not an escort shows that it has crossed your mind and you’re almost making an excuse. There’s several escorts that talk about their personal lives to keep a connection with their clients. I’d like to hear how her friends talk about you though. Low maintenance because the money spent on sugaring dates can go directly to HER rather than on the dates.",
            "author": "Due_Veterinarian_378",
            "id": "hv3bs2g",
            "parent_id": "t3_sh2sv5",
            "score": 3,
            "created_utc": 1643689581.0,
            "replies": []
        },
        {
            "body": "Dear Penthouse forum.........",
            "author": "peterharris100",
            "id": "hv0100r",
            "parent_id": "t3_sh2sv5",
            "score": 4,
            "created_utc": 1643641577.0,
            "replies": []
        },
        {
            "body": "She sounds like an escort lol according to SLF standards for women . I think its funny that SDs on here refer to this as hitting the jackpot when its a cheap escort but then disparage escorts",
            "author": "ready4anytng",
            "id": "hv0u3t1",
            "parent_id": "t3_sh2sv5",
            "score": 3,
            "created_utc": 1643652647.0,
            "replies": [
                {
                    "body": "If it was just meeting up with no communication otherwise, I'd agree with you. I've seen plenty of escorts and have no issue with that. We communicate daily, talk on the phone a couple times a week. I know a lot about her life and I'm becoming emotionally invested. We both like that companionship a lot. I guess the difference is neither of us have other sexual outlets and have a lot of pent up energy.",
                    "author": "NC-Chat",
                    "id": "hv1upes",
                    "parent_id": "t1_hv0u3t1",
                    "score": 0,
                    "created_utc": 1643666365.0,
                    "replies": [
                        {
                            "body": "I mean im not gonna judge you but just pointing a out a double standard women on here have said they were seeking that and judged way more harshly but good to know I can stop going out on dates, having sex marathons and texting my future SDs  .  I'll keep treating this one cause i really like him lol",
                            "author": "ready4anytng",
                            "id": "hv278aj",
                            "parent_id": "t1_hv1upes",
                            "score": 3,
                            "created_utc": 1643671382.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I had an SB who was a teacher that was kind of like this. She wanted to get in bed at the beginning of the date then take a shower and go out after. \n\nBackwards dating ?",
            "author": "KnocDown",
            "id": "hv08lsd",
            "parent_id": "t3_sh2sv5",
            "score": 2,
            "created_utc": 1643644628.0,
            "replies": []
        },
        {
            "body": "One of my exes was like this. We were together for more than a year and all we did was have sex at her apartment. She never wanted to go out, have dinner or do anything else. Super high sex drive and very sexual woman. Miss her for sure.",
            "author": null,
            "id": "hv0v94d",
            "parent_id": "t3_sh2sv5",
            "score": 2,
            "created_utc": 1643653071.0,
            "replies": []
        },
        {
            "body": "It happens. is she also very hot? I had one like this for 2 years, she was very strict about it being sex only and would never go out with me. she was a 10 and wanted to try kinky play with an older man. to make things even more weird, she was also rich.",
            "author": "JeaneyBowl",
            "id": "hv0vpob",
            "parent_id": "t3_sh2sv5",
            "score": 2,
            "created_utc": 1643653241.0,
            "replies": [
                {
                    "body": "Yes she's seriously gorgeous. College age, blonde cheerleader. According to her she's not attracted to young guys and she's looking for someone with shared kinks and a high sex drive. I think because I check a lot of her actual boxes she's just been really into it.",
                    "author": "NC-Chat",
                    "id": "hv0yoh9",
                    "parent_id": "t1_hv0vpob",
                    "score": 1,
                    "created_utc": 1643654327.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I don’t think that it is completely unusual at all. My SD and I have very busy schedules and I prefer discretion so I want to meet privately. I have a high sex drive and prefer to be with a man that is more experienced and very willing to focus on pleasing me. We go our separate ways afterwards and have Sunday carved out for our day to meet. It’s been an ongoing relationship for 6 months now.",
            "author": "Affectionate_Bus_171",
            "id": "hv0x71p",
            "parent_id": "t3_sh2sv5",
            "score": 2,
            "created_utc": 1643653783.0,
            "replies": []
        },
        {
            "body": "> \"I guess we can do lunch sometimes, if you really want to?\"\n\nFrom my experience \\~50% of SBs do not like dinner dates. And as an SD, I don't like dinner dates either.\n\nBut there are a lot of other date ideas: movies, tv, traveling, art walks, drinks, coffee, ...\n\nOf course, sex is the icing on the cake. Glad you are doing well brother. Enjoy your new Sugar Relationship :-)",
            "author": "Ray2020K",
            "id": "hv10tw3",
            "parent_id": "t3_sh2sv5",
            "score": 2,
            "created_utc": 1643655115.0,
            "replies": []
        },
        {
            "body": "My partner was a SB. She's always had a huge sex drive and likes older men so it worked well for her but as much as she would go out for drinks or dinner first if the guy really wanted to she only really wanted to have sex with them.\n\nFor her this was the exciting, fun part. She can go put to eat anytime and with anyone.",
            "author": "Ian_UK",
            "id": "hv162jl",
            "parent_id": "t3_sh2sv5",
            "score": 2,
            "created_utc": 1643657064.0,
            "replies": []
        },
        {
            "body": "I think you are overthinking this. Relax and enjoy. Whatever happens happens.",
            "author": "Realistic_Scratch912",
            "id": "hv1sbi7",
            "parent_id": "t3_sh2sv5",
            "score": 2,
            "created_utc": 1643665446.0,
            "replies": []
        },
        {
            "body": "My advice is to still mix it up once in a while. After every 5 or 6 sex dates try to meet her for a meal or something. It will help the relationship last longer.",
            "author": null,
            "id": "hv1yalf",
            "parent_id": "t3_sh2sv5",
            "score": 2,
            "created_utc": 1643667777.0,
            "replies": [
                {
                    "body": "Ty. Yeah that's my plan. I want this relationship to last and keeping it going is on my mind",
                    "author": "NC-Chat",
                    "id": "hv1yiio",
                    "parent_id": "t1_hv1yalf",
                    "score": 2,
                    "created_utc": 1643667863.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Women get just as horny as guys! \n\nhttps://youtu.be/RxeQ63GDx4s",
            "author": "Funtasmcus",
            "id": "hv23elu",
            "parent_id": "t3_sh2sv5",
            "score": 2,
            "created_utc": 1643669820.0,
            "replies": []
        },
        {
            "body": "I had  SR start out like that.   Most guys are horny all the time but women I've dated tend to taper off though I tired to mix it up and try new things.  Is it an instinct for a woman to go crazy for sex at the start to kind of win the man over?\n\nLet us know in 2 months if it's still going strong.  Hoping it is!!!",
            "author": "WarnerOIV",
            "id": "hv27wft",
            "parent_id": "t3_sh2sv5",
            "score": 2,
            "created_utc": 1643671667.0,
            "replies": []
        },
        {
            "body": "Hours long sex are the best dates! It means that you have oerfect sexual compatibility and that you can't get enough of each other, that's great you should enjoy it!",
            "author": "DieGoldeneLoreley",
            "id": "hv28ony",
            "parent_id": "t3_sh2sv5",
            "score": 2,
            "created_utc": 1643672005.0,
            "replies": []
        },
        {
            "body": "When you say 3-5 hours of sex.. does that include foreplay/oral or is does that just count the time when after you begin penetration?",
            "author": "Superb-Scale4533",
            "id": "hv2bza3",
            "parent_id": "t3_sh2sv5",
            "score": 2,
            "created_utc": 1643673407.0,
            "replies": [
                {
                    "body": "Of everything, multiple rounds basically. Not just non-stop sex. We had plenty of breaks, but mostly because I'm a little out of shape and couldn't keep up lol",
                    "author": "NC-Chat",
                    "id": "hv2da51",
                    "parent_id": "t1_hv2bza3",
                    "score": 3,
                    "created_utc": 1643673968.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Your subject made it sound like she comes over, you have sex and she leaves but it sounds more like you guys enjoy each other's company and she's a homebody. I'm not seeing a problem. Personally, I also prefer to chill at home and get some food delivered. I straight up refuse to go to fancy restaurants on M&Gs and don't like any plans that require me to dress in more than jeans and a t-shirt.",
            "author": "clashingtaco",
            "id": "hv2kuha",
            "parent_id": "t3_sh2sv5",
            "score": 2,
            "created_utc": 1643677460.0,
            "replies": []
        },
        {
            "body": "Yea it’s quite common, I had a 3 year SR where we only went out once every 6 months or so. So maybe a total of 5 times, rest of the time it was indoor intimacy dates. Sh wasn’t the type of girl who would want to sit down for fine dining, her style was dive bar. \n\nAnother factor was that she was a very social person with a lot of friends her age that already took her out several times during the week. She also wanted some discretion (think she had a possible BF). I was ok with it and greatly enjoyed it, I felt very well taken care of.\n\nWith a recent SB we started going out but have slowly moved toward a more indoor SR. We’re both busy from work and skipping dinner or drinks removes 2-3 hours.",
            "author": "techsd00",
            "id": "hv2l0ne",
            "parent_id": "t3_sh2sv5",
            "score": 2,
            "created_utc": 1643677534.0,
            "replies": []
        },
        {
            "body": "Shocking that someone would rather have sex than tour the art museum LOL. I think it is normal to have a lot of sex at the beginning of a relationship of whatever kind with more time for lunch and art museums later. And, yes, 30 minutes is about time elapsed until you are going at it. So that is normal. 3 to 5 hours of sex might be exceptional, never done that, but everybody is different and the more the better.",
            "author": "DATY9998",
            "id": "hv3oo0g",
            "parent_id": "t3_sh2sv5",
            "score": 2,
            "created_utc": 1643696988.0,
            "replies": []
        },
        {
            "body": "I've been dating a SB I met on SA in November and pretty much all we do is have sex.  Occasionally we go out for dinner, to the beach or a hike in nature so that we can feel a bit 'normal' but ultimately our sexual chemistry is so strong we just want to make love for hours and hang out in the bedroom.  So far most of our dates have been at her house and the first thing we do when I arrive is go lie down on her bed.  Her bedroom is now wired into my brain as this portal where orgasms happen and so i'm instantly aroused when I walk in there.  We both feel like we've hit the jackpot and have to pinch ourselves.  And we laugh that we met on SA because it seems so unbelievable that we found each other!",
            "author": "joyouspiglet",
            "id": "hv3xq74",
            "parent_id": "t3_sh2sv5",
            "score": 2,
            "created_utc": 1643703479.0,
            "replies": []
        },
        {
            "body": "Most of my sb's are two hours or so at a hotel - we go at it, talk, go at it again, sometimes I bring in food but it is easy for them and fun for me -",
            "author": "Informal_Ad3477",
            "id": "hv08lex",
            "parent_id": "t3_sh2sv5",
            "score": 3,
            "created_utc": 1643644624.0,
            "replies": []
        },
        {
            "body": "1) I don’t really believe your story. \n2) I can’t imagine that 3-5 hours straight of sex would be fun.  2 hours once in a while is great.  Maybe 2 hours and a quickie later.  But 3-5 hours straight?  Idk.  \n\n3) I met an SB who only wanted sex and didn’t want anything else.  I didn’t consider it a “jackpot” but rather a disappointment.  I want more than sex from an SR.",
            "author": null,
            "id": "hv02hi7",
            "parent_id": "t3_sh2sv5",
            "score": 2,
            "created_utc": 1643642188.0,
            "replies": [
                {
                    "body": "That's fine if you don't believe me, honestly no worries. Indulge me if you can.\n\nThis was the longest single encounter I've ever been in but we still had breaks, but yes it was that long. Personally I have a great marriage with a severe dead bedroom so I don't necessarily NEED the other aspects of the SR as much - though I do want them.\n\nMore of what I've been asking would be if you've had POTs/SBs that are like this? Personally this is more of what I'm looking for and I'm just wondering what to expect when this relationship eventually dies. I should have mentioned in my post that I'm debating on upping her allowance to ensure she sticks around.",
                    "author": "NC-Chat",
                    "id": "hv035rq",
                    "parent_id": "t1_hv02hi7",
                    "score": 3,
                    "created_utc": 1643642461.0,
                    "replies": [
                        {
                            "body": "FYI, it’s “indulge” not “divulge. Only letting you know for future reference, not intended as an insult. \n\nAlso, I can go that long and would kill for a SB that can do the same. Lucky man.",
                            "author": "LordWildmore",
                            "id": "hv0mrix",
                            "parent_id": "t1_hv035rq",
                            "score": 3,
                            "created_utc": 1643649954.0,
                            "replies": [
                                {
                                    "body": "Facepalm. And I like to write so now im embarrassed lol But yeah, I feel lucky. Based on other commenters though there are definitely other SBs like this. How to find that specific type though? No clue. I wasn't really looking for this either.",
                                    "author": "NC-Chat",
                                    "id": "hv0o7mx",
                                    "parent_id": "t1_hv0mrix",
                                    "score": 1,
                                    "created_utc": 1643650480.0,
                                    "replies": [
                                        {
                                            "body": "I don't think you can screen for this even if you tried to, and it's highly chemistry and attraction dependent. IMO it has more to do with your specific relationship than the particular girl. \n\nWith how sometimes sex-work-adjacent and perceptions run, I completely understand that most girls would never want to present a focus on physical intimacy. \n\nHonestly it's good enough to just screen out platonics.",
                                            "author": "noobNYCsd",
                                            "id": "hv0v5ir",
                                            "parent_id": "t1_hv0o7mx",
                                            "score": 1,
                                            "created_utc": 1643653034.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "If this is true and if you’re happy with it, yes you should do whatever you can to hold onto her and you shouldn’t expect to find it again.",
                            "author": null,
                            "id": "hv05trx",
                            "parent_id": "t1_hv035rq",
                            "score": 2,
                            "created_utc": 1643643526.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "I believe him 😂 I easily enjoy 3-5 hours of sex with breaks in between, and it’s not uncommon for me either.",
                    "author": "Secure_Bend_18",
                    "id": "hv081mq",
                    "parent_id": "t1_hv02hi7",
                    "score": 4,
                    "created_utc": 1643644407.0,
                    "replies": []
                },
                {
                    "body": "I can easily go at it for 3-5 hours with breaks.",
                    "author": "Samtaton",
                    "id": "hv0a03p",
                    "parent_id": "t1_hv02hi7",
                    "score": 5,
                    "created_utc": 1643645177.0,
                    "replies": []
                },
                {
                    "body": "> I can’t imagine that 3-5 hours straight of sex would be fun\n\nCome on, man. Just because you don't have the stamina to play that long doesn't mean some of the rest of us don't. lol\n\n> I met an SB who only wanted sex and didn’t want anything else. I didn’t consider it a “jackpot” but rather a disappointment. I want more than sex from an SR.\n\nI concur with this, though. I don't want a sex only SB, either. I prefer to have one who likes to go out and do things and have an actual relationship outside of the bedroom.",
                    "author": "Y_4Z44",
                    "id": "hv0ispb",
                    "parent_id": "t1_hv02hi7",
                    "score": 0,
                    "created_utc": 1643648497.0,
                    "replies": []
                },
                {
                    "body": "2.) Time to update your imagination, this is ideal for me",
                    "author": "OneCanToucanThreeCan",
                    "id": "hv0wgyq",
                    "parent_id": "t1_hv02hi7",
                    "score": 1,
                    "created_utc": 1643653517.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Perfect SR in my opinion. Text and be flirty, fun and cheeky, hang out, then go at it like rabbits. Tender kiss goodbye and repeat. Sound great to me. And Im a woman. \n\nIm also low key, have a high drive, mature enough to know an SR is basically sex for money and a few dates shattered in between. Escape from reality and a stress relief at the end. \n\nDont overthink it if it works for you both",
            "author": "BoredBBW21",
            "id": "hv1ha8d",
            "parent_id": "t3_sh2sv5",
            "score": 2,
            "created_utc": 1643661276.0,
            "replies": [
                {
                    "body": "Thank you. Yes I've noticed now from multiple SBs that this is far more normal than I had anticipated. Thanks for the encouragement!",
                    "author": "NC-Chat",
                    "id": "hv1tb5l",
                    "parent_id": "t1_hv1ha8d",
                    "score": 1,
                    "created_utc": 1643665827.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "JACKPOT!!!",
            "author": "HappyBear1952",
            "id": "hv0peey",
            "parent_id": "t3_sh2sv5",
            "score": 1,
            "created_utc": 1643650919.0,
            "replies": []
        },
        {
            "body": "No two SRs are alike just like no two women are the same. Every single one of my relationships have been different. None of them were bad, but I certainly have preferences. \n\nSome are like yours (mostly the younger, under 25 crowd) where they don't generally care for fancy meals or expensive gifts. Movies, Dave & Busters, Five Guys, PF Changs were some of the places that we went to if we didn't just hang out in hotels and order Uber eats. The boundaries in these types are very clear. Others like to be wined and dined, shown appreciation with gifts and experiences, and seem more like a relationship and things tend to progress because of the \"quality time\" spent together. \n\nSo to answer your question...\n\n>My SB only wants to have sex. Is this weird or did I hit the jackpot?\n\nIt's not weird and many SDs who have some experience have probably had similar experiences. Did you hit the jackpot? That depends on what you're looking for. If you're happy with the arrangement and that's all you want, then sure! Jackpot it is!",
            "author": "non_giant_panda",
            "id": "hv13d9e",
            "parent_id": "t3_sh2sv5",
            "score": 1,
            "created_utc": 1643656048.0,
            "replies": []
        },
        {
            "body": "I think it is normal.  Lots of gals just know the deal and want to get on with it.",
            "author": null,
            "id": "hv036ao",
            "parent_id": "t3_sh2sv5",
            "score": 0,
            "created_utc": 1643642467.0,
            "replies": []
        },
        {
            "body": "Hey there I'm looking for genuine sugar daddies. I'm currently broke and need money to get into college. If interested pls dm me I'm 19.",
            "author": "nxtinUTD",
            "id": "hv3f0vm",
            "parent_id": "t3_sh2sv5",
            "score": 0,
            "created_utc": 1643691274.0,
            "replies": []
        },
        {
            "body": "All too often ,usually from the SD side, a SB gets a SD who is all about constant sex. It is asymmetric and exploitative. However when both parties are all about it it is grand and wonderful. I screen out girls who are hyper sexual, because I couldn't keep up. One good lengthy session is fine for me. And I don't want a sex partner who is not satisfied ,needs more, and will seek out more partners to fill the gap.",
            "author": "GSSD",
            "id": "hv4mxv7",
            "parent_id": "t3_sh2sv5",
            "score": 0,
            "created_utc": 1643721292.0,
            "replies": []
        },
        {
            "body": "I've never had an SR like that, and do enjoy going out on dates etc, but it sounds like fun and certainly something I'd try to see how it goes.",
            "author": "Cledaddy23",
            "id": "hv0etvz",
            "parent_id": "t3_sh2sv5",
            "score": 1,
            "created_utc": 1643647022.0,
            "replies": []
        },
        {
            "body": "I don’t see any issue other than burn out. We don’t know her so we can’t say that she’s lying or telling you what she thinks you want to hear. Only time will tell. I wonder if this is what you really want? You can have a high sex drive and still want to leave the room and see things and it’s ok to say that. I think it’s smart to get lunch and get some air sometimes so you don’t feel like a piece of meat. If. It keep it going! Enjoy!",
            "author": null,
            "id": "hv0o10k",
            "parent_id": "t3_sh2sv5",
            "score": 1,
            "created_utc": 1643650414.0,
            "replies": []
        },
        {
            "body": "If you both have similar preferences in terms of how you want your dates to be, that's great. I've dated some women who we less into sex than I was, and some who were more into it (eg they just wanted to have sex, they didn't want to go on dates or anything).\n\nI wouldn't feel too surprised -- you're probably a great outlet for her, and if she wants to stay casual and not get into a serious relationship, then it makes sense that she doesn't want to do too much date-type things. I'm not sure if this has the makings of something long-term, but you'll see.",
            "author": "emptyoverflow",
            "id": "hv0uo6h",
            "parent_id": "t3_sh2sv5",
            "score": 1,
            "created_utc": 1643652856.0,
            "replies": []
        },
        {
            "body": "Does she have a roommate????",
            "author": "Spartan44BB",
            "id": "hv0w5cz",
            "parent_id": "t3_sh2sv5",
            "score": 1,
            "created_utc": 1643653401.0,
            "replies": [
                {
                    "body": "...or a younger sister?",
                    "author": "Funtasmcus",
                    "id": "hv301sj",
                    "parent_id": "t1_hv0w5cz",
                    "score": 0,
                    "created_utc": 1643684082.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Sounds ideal to me 😂",
            "author": null,
            "id": "hv0yfy1",
            "parent_id": "t3_sh2sv5",
            "score": 1,
            "created_utc": 1643654240.0,
            "replies": []
        },
        {
            "body": "I feel so validated",
            "author": "wlpbt",
            "id": "hv18ow3",
            "parent_id": "t3_sh2sv5",
            "score": 1,
            "created_utc": 1643658051.0,
            "replies": []
        },
        {
            "body": "Sounds ideal as long as you can keep (it) up.",
            "author": "GSSD",
            "id": "hv1h08m",
            "parent_id": "t3_sh2sv5",
            "score": 1,
            "created_utc": 1643661171.0,
            "replies": []
        },
        {
            "body": "Great sugar is finding someone who really appreciates what you bring to the relationship and where you appreciate what they bring.  Best not to snatch defeat from the jaws of victory by worrying but also remember that the brightest candle burns out earlier in the evening .",
            "author": "pinotandsugar",
            "id": "hv1h7vy",
            "parent_id": "t3_sh2sv5",
            "score": 1,
            "created_utc": 1643661252.0,
            "replies": []
        },
        {
            "body": "My most recent SD we actually really enjoyed each other's company so we would hang out at his place, order in, Netflix & chill.\nI'm not really a fancy restaurant girl so I prefer it that way- more like friends with benefits",
            "author": "TlMEGH0ST",
            "id": "hv1mjwc",
            "parent_id": "t3_sh2sv5",
            "score": 1,
            "created_utc": 1643663245.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "hv243n7",
            "parent_id": "t3_sh2sv5",
            "score": 1,
            "created_utc": 1643670099.0,
            "replies": [
                {
                    "body": "Thanks for the comment. Yes I'm noticing now from the SB comments / DMs that this is far more common than I really thought. I don't know why I was under the assumption that the vast majority of SBs wanted all the experiences / fancy dates and didn't want to actually have much sex. I'll need to work in real activities like you said. Thanks for the advice!",
                    "author": "NC-Chat",
                    "id": "hv24t4u",
                    "parent_id": "t1_hv243n7",
                    "score": 2,
                    "created_utc": 1643670389.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Oh well if it makes her happy then you just have to do it",
            "author": "wb19081908",
            "id": "hv2iapw",
            "parent_id": "t3_sh2sv5",
            "score": 1,
            "created_utc": 1643676310.0,
            "replies": []
        },
        {
            "body": "I would not want hours of play at allll. Not in any sexual relationship. But I don’t think it’s weird, just her style of sex. I can’t have sex for more than hour regardless of the situation, it’s really personal preference more than anything",
            "author": "NoNameWoman65",
            "id": "hv2u2vs",
            "parent_id": "t3_sh2sv5",
            "score": 1,
            "created_utc": 1643681507.0,
            "replies": []
        },
        {
            "body": "I’ve had several SRs that were exactly the same, my SB is just very sexual and may also be very discreet.  I’m good with it, so they have worked out quite well",
            "author": "blk-tye",
            "id": "hv3qlvq",
            "parent_id": "t3_sh2sv5",
            "score": 1,
            "created_utc": 1643698294.0,
            "replies": []
        },
        {
            "body": "don’t think there’s anything weird about that at all. clearly she wants sex out of sugaring, and that’s fine because that’s what she’s looking for. the main thing is if you’re also looking for that. do you want to go on dinner dates and have experiences, or are you fine with it being primarily sexual? comes down to you.",
            "author": "lacifx",
            "id": "hv3rtha",
            "parent_id": "t3_sh2sv5",
            "score": 1,
            "created_utc": 1643699125.0,
            "replies": []
        },
        {
            "body": "Jackpot!",
            "author": "Easy-Sun6639",
            "id": "hv4vwhx",
            "parent_id": "t3_sh2sv5",
            "score": 1,
            "created_utc": 1643725489.0,
            "replies": []
        },
        {
            "body": "Sometimes being seen in public with someone from SA just isn't prudent.  Big age and attractiveness gaps make it very obvious what is going on.",
            "author": "Zealousideal-Emu-863",
            "id": "hv61948",
            "parent_id": "t3_sh2sv5",
            "score": 1,
            "created_utc": 1643741088.0,
            "replies": []
        },
        {
            "body": "Meh I wouldn’t be disappointed if my SD was comfortable with a sex’flix and chill only type of situation. Isn’t that what FWB is about? Go hangout and have sex? The icing for her is she gets an allowance on top of it.\n\nWin/win",
            "author": null,
            "id": "hv84pyl",
            "parent_id": "t3_sh2sv5",
            "score": 1,
            "created_utc": 1643770745.0,
            "replies": []
        },
        {
            "body": "Not to be controversial but that's never the response when sds and sbs want platonic and online its alwyas \"thats not a real SR\"",
            "author": "ready4anytng",
            "id": "hv0ud32",
            "parent_id": "t1_huzygye",
            "score": 18,
            "created_utc": 1643652743.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "hv0vt2e",
                    "parent_id": "t1_hv0ud32",
                    "score": 14,
                    "created_utc": 1643653275.0,
                    "replies": [
                        {
                            "body": "Escort?  3 to 5 hours if sex??!!  Not in a million years.",
                            "author": "TexTH",
                            "id": "hv36z1r",
                            "parent_id": "t1_hv0vt2e",
                            "score": 8,
                            "created_utc": 1643687237.0,
                            "replies": []
                        },
                        {
                            "body": "I came to this thread to say that, but after reading the OP it sounds like he has been doing a lot of talking on the phone, which an escort presumably wouldn't be into doing for free.",
                            "author": "Sugarbeggar",
                            "id": "hv11f3c",
                            "parent_id": "t1_hv0vt2e",
                            "score": 19,
                            "created_utc": 1643655330.0,
                            "replies": []
                        },
                        {
                            "body": "No escort is taking dick for 3 to 5 hours",
                            "author": "Blknior",
                            "id": "hv2fjwa",
                            "parent_id": "t1_hv0vt2e",
                            "score": 14,
                            "created_utc": 1643675019.0,
                            "replies": [
                                {
                                    "body": "From the same person, anyway.",
                                    "author": "aotus_trivirgatus",
                                    "id": "hv2ipmo",
                                    "parent_id": "t1_hv2fjwa",
                                    "score": 10,
                                    "created_utc": 1643676506.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "They would  say its not a real SR and she should find a different sub then remove her post and ban her for rule 12 of course. But because its an SDs its the \"jackpot\"  of all SRs and shes a unicorn",
                            "author": "ready4anytng",
                            "id": "hv0w6tl",
                            "parent_id": "t1_hv0vt2e",
                            "score": 17,
                            "created_utc": 1643653416.0,
                            "replies": []
                        },
                        {
                            "body": "For what its worth there IS an emotional connection at play, I should have mentioned that more in the post. We talk everyday, we're invested in each other's lives (within healthy boundaries) and have plenty of discussions outside of sex. The difference is when we actually are together.. . She just wants to fuck as much as possible. I've been with escorts before, this is very, very different.",
                            "author": "NC-Chat",
                            "id": "hv0x5so",
                            "parent_id": "t1_hv0vt2e",
                            "score": 14,
                            "created_utc": 1643653769.0,
                            "replies": [
                                {
                                    "body": "I have had 4 Sugar relationships and they all were pretty much like yours.",
                                    "author": "redstone24",
                                    "id": "hv1rti7",
                                    "parent_id": "t1_hv0x5so",
                                    "score": 6,
                                    "created_utc": 1643665254.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "> Im getting escort vibes\n\nNot when she wants sex for 3-5 hours unless he signed up for the extended care program /s",
                            "author": "GSSD",
                            "id": "hv1gvjj",
                            "parent_id": "t1_hv0vt2e",
                            "score": 2,
                            "created_utc": 1643661121.0,
                            "replies": []
                        },
                        {
                            "body": "I've met several women IRL who wanted that except the allowance.   However, we generally talked a lot between and after.  Relationships come in all sizes and flavors.  Worry more about what works for you rather than what you think others would think of the relationship - with the singular exception if you feel used or abused.",
                            "author": "pinotandsugar",
                            "id": "hv3f8vh",
                            "parent_id": "t1_hv0vt2e",
                            "score": 0,
                            "created_utc": 1643691392.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Cuz platonic and online is called friendship 😗",
                    "author": "Late_Ad_6293",
                    "id": "hv1rs06",
                    "parent_id": "t1_hv0ud32",
                    "score": 3,
                    "created_utc": 1643665238.0,
                    "replies": [
                        {
                            "body": "I dont sext with my friends online like i assume online sbs do. Also didn't the previous commenter just say \"Honestly a SR for both SD and SB comes down to what both sides want from the relationship\" ?",
                            "author": "ready4anytng",
                            "id": "hv27k1y",
                            "parent_id": "t1_hv1rs06",
                            "score": 4,
                            "created_utc": 1643671519.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": ">Honestly a SR for both SD and SB comes down to what both sides want from the relationship.\n\nYup.\n\nThis sounds pretty far for the \"normal\", to the extent there is such a thing in the bowl, but awesome that the two of you matched up so well. Enjoy!",
            "author": "NoLimitLexa",
            "id": "hv03mf2",
            "parent_id": "t1_huzygye",
            "score": 5,
            "created_utc": 1643642648.0,
            "replies": []
        },
        {
            "body": "Hahaha",
            "author": "chemistryromance",
            "id": "hv09gwr",
            "parent_id": "t1_huzye86",
            "score": 5,
            "created_utc": 1643644970.0,
            "replies": []
        },
        {
            "body": "😂😂",
            "author": null,
            "id": "hv005sp",
            "parent_id": "t1_huzye86",
            "score": 8,
            "created_utc": 1643641228.0,
            "replies": [
                {
                    "body": "I concur. What's her GV number?",
                    "author": "BinghamtonSD",
                    "id": "hv04rru",
                    "parent_id": "t1_hv005sp",
                    "score": 12,
                    "created_utc": 1643643106.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "🤣🤣🤣",
            "author": "SweetD79",
            "id": "hv1226j",
            "parent_id": "t1_huzye86",
            "score": 4,
            "created_utc": 1643655562.0,
            "replies": []
        },
        {
            "body": "😆 🤣 😂",
            "author": "mentor4you",
            "id": "hv1t4vy",
            "parent_id": "t1_huzye86",
            "score": 2,
            "created_utc": 1643665761.0,
            "replies": []
        },
        {
            "body": "LMAO, I almost choked on my wrap! 🤣",
            "author": "Professional-Ad-450",
            "id": "hv5di3h",
            "parent_id": "t1_huzye86",
            "score": 1,
            "created_utc": 1643732441.0,
            "replies": [
                {
                    "body": "If there are any other young women who are looking for a sex only relationship, please DM me and give me a chance to ‘talk you out of it’",
                    "author": "DrZenRoot",
                    "id": "hv5fb1l",
                    "parent_id": "t1_hv5di3h",
                    "score": 2,
                    "created_utc": 1643733108.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I know the feeling, tho it's a little different. My current, main SB (4 months in) and I plan dates. We start at a hotel with sex (sex first works for me), then some nice cuddling and conversation and suddenly 4 hours have passed and that's all we do. We have had some other dates - a play, some meals - and we're going out for dinner this week. We make plans!! But they usually don't happen.\n\nIt worries me, but it's also very pleasant to have great sex, then talk, be held and caressed for a few hours. I've expressed my concerns to her, told her I'm happy to do what she likes, and she says this is pretty great for her. I think the only way to change it is to do something else, something public, first. Probably will make that change but between the pandemic and winter, this works.\n\nI've also had SBs who only wanted sex, but that's not my current situation. If the sex is good and not rushed, those SRs worked fine, too, tho they usually didn't last long. At some point a relationship has to be more than sex or if doesn't last, imo. So it either evolves and grows or ends.",
            "author": "ziggy440",
            "id": "hv0ysss",
            "parent_id": "t1_hv01gb4",
            "score": 3,
            "created_utc": 1643654372.0,
            "replies": []
        },
        {
            "body": "\\+1 It's more about avoiding being seen with the person, than the play time!",
            "author": "Interesting_Scar_481",
            "id": "hv1350w",
            "parent_id": "t1_hv0e597",
            "score": 18,
            "created_utc": 1643655962.0,
            "replies": [
                {
                    "body": "Yep",
                    "author": "Azucarbabby",
                    "id": "hv1ijlq",
                    "parent_id": "t1_hv1350w",
                    "score": 6,
                    "created_utc": 1643661747.0,
                    "replies": []
                },
                {
                    "body": ">\\+1 It's more about avoiding being seen with the person, than the play time!\n\nObservant comment buried -- hopefully u/Interesting_Scar_481 s comment can get upvoted.\n\nCan you expand ?",
                    "author": "Hyceanplanet",
                    "id": "hv274nz",
                    "parent_id": "t1_hv1350w",
                    "score": 4,
                    "created_utc": 1643671340.0,
                    "replies": [
                        {
                            "body": "There isn't much to expand. Multiple reasons girl wouldn't want to be seen with the SD (none of them flattering for the SD) in public, so more play time to make up for it.",
                            "author": "Interesting_Scar_481",
                            "id": "hv3gki2",
                            "parent_id": "t1_hv274nz",
                            "score": 6,
                            "created_utc": 1643692104.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "hah yeah I did. I didn't think I was going to need it but was very wrong on that.",
            "author": "NC-Chat",
            "id": "hv02gk6",
            "parent_id": "t1_hv01ks9",
            "score": 7,
            "created_utc": 1643642176.0,
            "replies": []
        },
        {
            "body": "We're on allownce and the date was about 6 hours. I told her she could leave whenever and she stuck around a couple hours longer than I thought she would. She definitely had a good time too from the way she's been texting me, feels more like she needs the outlet.",
            "author": "NC-Chat",
            "id": "hv0vltd",
            "parent_id": "t1_hv0u0cz",
            "score": 7,
            "created_utc": 1643653202.0,
            "replies": [
                {
                    "body": "My ex and I had a similar relationship, I loved staying in with him and would often spend the night but whenever he suggested leaving the house together??? I'm good lol. I obviously couldn't tell him why but I wouldn't push for dates as it seems she's uncomfortable with public dates.",
                    "author": null,
                    "id": "hv4k1lg",
                    "parent_id": "t1_hv0vltd",
                    "score": 2,
                    "created_utc": 1643719761.0,
                    "replies": [
                        {
                            "body": "Why didn’t you want to go out with him?",
                            "author": null,
                            "id": "hy2c73w",
                            "parent_id": "t1_hv4k1lg",
                            "score": 1,
                            "created_utc": 1645592859.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I think unless you really have a lot to talk about, alot in common, and you're both chatty people, then spending more time in bed than time dining/hiking/sightseeing or whatever, is probably fairly common. Personally I quite like the non-sex time and I can talk for hours about  a lot of things! But we;re not all the same.",
            "author": "nickthegreekinlondon",
            "id": "hv0b6n3",
            "parent_id": "t1_hv098l9",
            "score": 8,
            "created_utc": 1643645638.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "hv0bw06",
                    "parent_id": "t1_hv0b6n3",
                    "score": 9,
                    "created_utc": 1643645910.0,
                    "replies": [
                        {
                            "body": "Haha, I know what you mean. That's so cool.",
                            "author": "nickthegreekinlondon",
                            "id": "hv4q73r",
                            "parent_id": "t1_hv0bw06",
                            "score": 1,
                            "created_utc": 1643722908.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Thank you! Honestly this makes me feel a lot better. I had such a great time with her that I'm afraid of the relationship ending (which it will) and not be able to find this same sort of thing later. So far based on the responses I've seen it's not super common, but not exactly uncommon either.",
            "author": "NC-Chat",
            "id": "hv0lfw6",
            "parent_id": "t1_hv0kx6d",
            "score": 4,
            "created_utc": 1643649473.0,
            "replies": []
        },
        {
            "body": ">I am finding out it is 'more normal' to have these types of dates than I thought\n\nThis is what I'm really wondering too. When I was searching, half of my POTs hinted that the only really wanted dinner/drinks and werent looking for much more than that either. But I get the exact opposite feeling from a lot of the SBs here on SLF as well. I'm really happy so far, but I'm trying to gauge if this is more normal than I thought. I feel insanely lucky as it is.",
            "author": "NC-Chat",
            "id": "hv01fgy",
            "parent_id": "t1_huzz6ac",
            "score": 5,
            "created_utc": 1643641754.0,
            "replies": [
                {
                    "body": "What is Normal these days ? Nothing",
                    "author": "DiscreetlyYours2",
                    "id": "hv0usmd",
                    "parent_id": "t1_hv01fgy",
                    "score": 5,
                    "created_utc": 1643652902.0,
                    "replies": []
                },
                {
                    "body": "True, SLF SBs are the real ones that I can tell. They are not really the 'feed and fuk and leave' types.",
                    "author": "CenTexFunGuy",
                    "id": "hv032qs",
                    "parent_id": "t1_hv01fgy",
                    "score": 6,
                    "created_utc": 1643642427.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "That was a really thoughtful response, thanks for that. This is partially why I mentioned we were talking for a little over a month before the M&G. We really didn't talk about sex almost at all until about 2 or 3 days before we met. BUT I am definitely going to keep what you said in the back of my mind. I do tend to fixate on things/people and can have a harder time seeing bigger pictures when I'm enthralled. Thank you!",
            "author": "NC-Chat",
            "id": "hv0mimn",
            "parent_id": "t1_hv0kabt",
            "score": 1,
            "created_utc": 1643649863.0,
            "replies": [
                {
                    "body": "I'm not being judgmental just putting things in perspective and based on my experience.  I too had experienced what you have had.  It's great but just careful not to get let down after a month when you discover whether there is any true bond.  A lot of SBs are very good with manipulation.  They would make it seem like to the moon we go together but once they feel they've gotten what they've wanted they can reveal their intentions later on so always make decisions when the mood is clear.",
                    "author": "MKTekke",
                    "id": "hv0toq4",
                    "parent_id": "t1_hv0mimn",
                    "score": 3,
                    "created_utc": 1643652492.0,
                    "replies": [
                        {
                            "body": "I will definitely keep this in mind. Taking her at her word, she's never had a consistent SR for more than a couple months. She's high libido and is only attracted to older men. After the date my first thought was, that was so good but how long will this really last?\n\nDefinitely will keep your advice in my mind for later.",
                            "author": "NC-Chat",
                            "id": "hv0w61e",
                            "parent_id": "t1_hv0toq4",
                            "score": 1,
                            "created_utc": 1643653408.0,
                            "replies": [
                                {
                                    "body": "Well, I certainly hope you don't take things into heart yet.  It's easy for a SB to say they are attracted to older men when there are $$ attached to it.  Can they be with you without the $?  I never take it seriously when a SB says they're into older men unless they can really prove to me that we can do something together that isn't transactional at all.  Otherwise it is still just that a transactional fantasy relationship.  I'm trying to put things in perspective, some SBs are very good at being that fantasy for you and everything they say belongs in that fantasy.",
                                    "author": "MKTekke",
                                    "id": "hv5m8z0",
                                    "parent_id": "t1_hv0w61e",
                                    "score": 1,
                                    "created_utc": 1643735654.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I'm not complaining. At all. What I'm asking is if this is somewhat normal for SRs since I don't have a ton of experience doing this. Her thinking is that it is since thats her preference and since her friends do this too.\n\nThe reason I'm thinking about it is because A) I'm tempted to up her allowance and make sure I keep exclusivity and B) When this relationship DOES end, what should I expect.\n\nDefinitely no complaints though.",
            "author": "NC-Chat",
            "id": "hv027oq",
            "parent_id": "t1_hv01ecw",
            "score": 7,
            "created_utc": 1643642075.0,
            "replies": [
                {
                    "body": "Why does any of that matter? Just enjoy the present. You will have all the time in the world to contemplate whether this was “normal” or not when it eventually ends. Who cares if it is or isn’t normal? So you found a unicorn, ride it (pun intended) Save that contemplative energy for enjoying your SB. From the way you describe the SR, you need all the energy you can muster 🤣",
                    "author": "oldharddrive",
                    "id": "hv0p2q7",
                    "parent_id": "t1_hv027oq",
                    "score": 3,
                    "created_utc": 1643650800.0,
                    "replies": [
                        {
                            "body": "Lol you know that's really good advice. I do tend to overthink. I'm debating on upping her allownce as an added incentive to stick around, but based on some other messages just giving extra gifts should do the trick.\n\nThanks for the honest feedback.",
                            "author": "NC-Chat",
                            "id": "hv0pcll",
                            "parent_id": "t1_hv0p2q7",
                            "score": 6,
                            "created_utc": 1643650900.0,
                            "replies": [
                                {
                                    "body": "Glad to help! Just telling you from experience man. I have the PERFECT SB and I almost ruined it getting in my own head. Enjoying the ride is soooooooo much better that the alternative.",
                                    "author": "oldharddrive",
                                    "id": "hv0vi6o",
                                    "parent_id": "t1_hv0pcll",
                                    "score": 1,
                                    "created_utc": 1643653165.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "I don’t think there’s a standard SR. It’s really different for everyone. If you both feel happy and fulfilled with the dynamic she wants, then there’s nothing wrong with it! If you are hoping for something long-term, I don’t think it hurts to tell her that, but I do agree that you should try to enjoy it regardless. It’s still meaningful even if it doesn’t last forever. Also, all relationships end differently too so there’s really no way of knowing what to expect and I don’t think it’s worth worrying about.",
                    "author": "fuzzydaymoon",
                    "id": "hv1gnkv",
                    "parent_id": "t1_hv027oq",
                    "score": 1,
                    "created_utc": 1643661035.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "This is pretty much exactly what my SB said to me. She isn't vanilla dating or seeing anyone else. She has a very high sexdrive and we have the same kinks, so to her she's just getting out all of her frustration. She wants as much time as possible to do that. I'm trying not to get too attached so realizing that she's not this one in a billion date is helping, thank you.",
            "author": "NC-Chat",
            "id": "hv0b99r",
            "parent_id": "t1_hv0a723",
            "score": 2,
            "created_utc": 1643645666.0,
            "replies": []
        },
        {
            "body": "Yeah. I'm not worried about the breaks or anything like that, this is pretty ideal to me overall. I'm more thinking if this is now a reasonable expectation for future SRs or if I found the 1 in a million SB that just wants to go at it with me for hours. I'm honestly debating on upping her allowance to make sure she sticks around long term, but only if this is something that I really would never find again.",
            "author": "NC-Chat",
            "id": "hv0g7dc",
            "parent_id": "t1_hv0fndl",
            "score": 1,
            "created_utc": 1643647538.0,
            "replies": [
                {
                    "body": "Raising allowance will almost always be well received. Maybe try connecting it to things she likes. Gifts. Experiences. Sex toys for your mutual kinks (maybe).\n\nSo yes, allowance and maybe extra monetary gifts, but also other stuff that just tickles her interests beyond money.\n\nSome SBs will stay with you for benifits, but most will stay longer if they really like you. \n\nFigure out what her priorities are, but don’t let her know that you are “sold“. Keep her interested and keep her surprised. \n\nI’d go with surprise gifts (cash and/or actual things), then be cool about it, “Awe, just a little something for you.” \n\nYou have to be the catch too!",
                    "author": "SDchat",
                    "id": "hv0ju2d",
                    "parent_id": "t1_hv0g7dc",
                    "score": 4,
                    "created_utc": 1643648880.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "If it was just meeting up with no communication otherwise, I'd agree with you. I've seen plenty of escorts and have no issue with that. We communicate daily, talk on the phone a couple times a week. I know a lot about her life and I'm becoming emotionally invested. We both like that companionship a lot. I guess the difference is neither of us have other sexual outlets and have a lot of pent up energy.",
            "author": "NC-Chat",
            "id": "hv1upes",
            "parent_id": "t1_hv0u3t1",
            "score": 0,
            "created_utc": 1643666365.0,
            "replies": [
                {
                    "body": "I mean im not gonna judge you but just pointing a out a double standard women on here have said they were seeking that and judged way more harshly but good to know I can stop going out on dates, having sex marathons and texting my future SDs  .  I'll keep treating this one cause i really like him lol",
                    "author": "ready4anytng",
                    "id": "hv278aj",
                    "parent_id": "t1_hv1upes",
                    "score": 3,
                    "created_utc": 1643671382.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Yes she's seriously gorgeous. College age, blonde cheerleader. According to her she's not attracted to young guys and she's looking for someone with shared kinks and a high sex drive. I think because I check a lot of her actual boxes she's just been really into it.",
            "author": "NC-Chat",
            "id": "hv0yoh9",
            "parent_id": "t1_hv0vpob",
            "score": 1,
            "created_utc": 1643654327.0,
            "replies": []
        },
        {
            "body": "Ty. Yeah that's my plan. I want this relationship to last and keeping it going is on my mind",
            "author": "NC-Chat",
            "id": "hv1yiio",
            "parent_id": "t1_hv1yalf",
            "score": 2,
            "created_utc": 1643667863.0,
            "replies": []
        },
        {
            "body": "Of everything, multiple rounds basically. Not just non-stop sex. We had plenty of breaks, but mostly because I'm a little out of shape and couldn't keep up lol",
            "author": "NC-Chat",
            "id": "hv2da51",
            "parent_id": "t1_hv2bza3",
            "score": 3,
            "created_utc": 1643673968.0,
            "replies": []
        },
        {
            "body": "That's fine if you don't believe me, honestly no worries. Indulge me if you can.\n\nThis was the longest single encounter I've ever been in but we still had breaks, but yes it was that long. Personally I have a great marriage with a severe dead bedroom so I don't necessarily NEED the other aspects of the SR as much - though I do want them.\n\nMore of what I've been asking would be if you've had POTs/SBs that are like this? Personally this is more of what I'm looking for and I'm just wondering what to expect when this relationship eventually dies. I should have mentioned in my post that I'm debating on upping her allowance to ensure she sticks around.",
            "author": "NC-Chat",
            "id": "hv035rq",
            "parent_id": "t1_hv02hi7",
            "score": 3,
            "created_utc": 1643642461.0,
            "replies": [
                {
                    "body": "FYI, it’s “indulge” not “divulge. Only letting you know for future reference, not intended as an insult. \n\nAlso, I can go that long and would kill for a SB that can do the same. Lucky man.",
                    "author": "LordWildmore",
                    "id": "hv0mrix",
                    "parent_id": "t1_hv035rq",
                    "score": 3,
                    "created_utc": 1643649954.0,
                    "replies": [
                        {
                            "body": "Facepalm. And I like to write so now im embarrassed lol But yeah, I feel lucky. Based on other commenters though there are definitely other SBs like this. How to find that specific type though? No clue. I wasn't really looking for this either.",
                            "author": "NC-Chat",
                            "id": "hv0o7mx",
                            "parent_id": "t1_hv0mrix",
                            "score": 1,
                            "created_utc": 1643650480.0,
                            "replies": [
                                {
                                    "body": "I don't think you can screen for this even if you tried to, and it's highly chemistry and attraction dependent. IMO it has more to do with your specific relationship than the particular girl. \n\nWith how sometimes sex-work-adjacent and perceptions run, I completely understand that most girls would never want to present a focus on physical intimacy. \n\nHonestly it's good enough to just screen out platonics.",
                                    "author": "noobNYCsd",
                                    "id": "hv0v5ir",
                                    "parent_id": "t1_hv0o7mx",
                                    "score": 1,
                                    "created_utc": 1643653034.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "If this is true and if you’re happy with it, yes you should do whatever you can to hold onto her and you shouldn’t expect to find it again.",
                    "author": null,
                    "id": "hv05trx",
                    "parent_id": "t1_hv035rq",
                    "score": 2,
                    "created_utc": 1643643526.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I believe him 😂 I easily enjoy 3-5 hours of sex with breaks in between, and it’s not uncommon for me either.",
            "author": "Secure_Bend_18",
            "id": "hv081mq",
            "parent_id": "t1_hv02hi7",
            "score": 4,
            "created_utc": 1643644407.0,
            "replies": []
        },
        {
            "body": "I can easily go at it for 3-5 hours with breaks.",
            "author": "Samtaton",
            "id": "hv0a03p",
            "parent_id": "t1_hv02hi7",
            "score": 5,
            "created_utc": 1643645177.0,
            "replies": []
        },
        {
            "body": "> I can’t imagine that 3-5 hours straight of sex would be fun\n\nCome on, man. Just because you don't have the stamina to play that long doesn't mean some of the rest of us don't. lol\n\n> I met an SB who only wanted sex and didn’t want anything else. I didn’t consider it a “jackpot” but rather a disappointment. I want more than sex from an SR.\n\nI concur with this, though. I don't want a sex only SB, either. I prefer to have one who likes to go out and do things and have an actual relationship outside of the bedroom.",
            "author": "Y_4Z44",
            "id": "hv0ispb",
            "parent_id": "t1_hv02hi7",
            "score": 0,
            "created_utc": 1643648497.0,
            "replies": []
        },
        {
            "body": "2.) Time to update your imagination, this is ideal for me",
            "author": "OneCanToucanThreeCan",
            "id": "hv0wgyq",
            "parent_id": "t1_hv02hi7",
            "score": 1,
            "created_utc": 1643653517.0,
            "replies": []
        },
        {
            "body": "Thank you. Yes I've noticed now from multiple SBs that this is far more normal than I had anticipated. Thanks for the encouragement!",
            "author": "NC-Chat",
            "id": "hv1tb5l",
            "parent_id": "t1_hv1ha8d",
            "score": 1,
            "created_utc": 1643665827.0,
            "replies": []
        },
        {
            "body": "...or a younger sister?",
            "author": "Funtasmcus",
            "id": "hv301sj",
            "parent_id": "t1_hv0w5cz",
            "score": 0,
            "created_utc": 1643684082.0,
            "replies": []
        },
        {
            "body": "Thanks for the comment. Yes I'm noticing now from the SB comments / DMs that this is far more common than I really thought. I don't know why I was under the assumption that the vast majority of SBs wanted all the experiences / fancy dates and didn't want to actually have much sex. I'll need to work in real activities like you said. Thanks for the advice!",
            "author": "NC-Chat",
            "id": "hv24t4u",
            "parent_id": "t1_hv243n7",
            "score": 2,
            "created_utc": 1643670389.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "hv0vt2e",
            "parent_id": "t1_hv0ud32",
            "score": 14,
            "created_utc": 1643653275.0,
            "replies": [
                {
                    "body": "Escort?  3 to 5 hours if sex??!!  Not in a million years.",
                    "author": "TexTH",
                    "id": "hv36z1r",
                    "parent_id": "t1_hv0vt2e",
                    "score": 8,
                    "created_utc": 1643687237.0,
                    "replies": []
                },
                {
                    "body": "I came to this thread to say that, but after reading the OP it sounds like he has been doing a lot of talking on the phone, which an escort presumably wouldn't be into doing for free.",
                    "author": "Sugarbeggar",
                    "id": "hv11f3c",
                    "parent_id": "t1_hv0vt2e",
                    "score": 19,
                    "created_utc": 1643655330.0,
                    "replies": []
                },
                {
                    "body": "No escort is taking dick for 3 to 5 hours",
                    "author": "Blknior",
                    "id": "hv2fjwa",
                    "parent_id": "t1_hv0vt2e",
                    "score": 14,
                    "created_utc": 1643675019.0,
                    "replies": [
                        {
                            "body": "From the same person, anyway.",
                            "author": "aotus_trivirgatus",
                            "id": "hv2ipmo",
                            "parent_id": "t1_hv2fjwa",
                            "score": 10,
                            "created_utc": 1643676506.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "They would  say its not a real SR and she should find a different sub then remove her post and ban her for rule 12 of course. But because its an SDs its the \"jackpot\"  of all SRs and shes a unicorn",
                    "author": "ready4anytng",
                    "id": "hv0w6tl",
                    "parent_id": "t1_hv0vt2e",
                    "score": 17,
                    "created_utc": 1643653416.0,
                    "replies": []
                },
                {
                    "body": "For what its worth there IS an emotional connection at play, I should have mentioned that more in the post. We talk everyday, we're invested in each other's lives (within healthy boundaries) and have plenty of discussions outside of sex. The difference is when we actually are together.. . She just wants to fuck as much as possible. I've been with escorts before, this is very, very different.",
                    "author": "NC-Chat",
                    "id": "hv0x5so",
                    "parent_id": "t1_hv0vt2e",
                    "score": 14,
                    "created_utc": 1643653769.0,
                    "replies": [
                        {
                            "body": "I have had 4 Sugar relationships and they all were pretty much like yours.",
                            "author": "redstone24",
                            "id": "hv1rti7",
                            "parent_id": "t1_hv0x5so",
                            "score": 6,
                            "created_utc": 1643665254.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "> Im getting escort vibes\n\nNot when she wants sex for 3-5 hours unless he signed up for the extended care program /s",
                    "author": "GSSD",
                    "id": "hv1gvjj",
                    "parent_id": "t1_hv0vt2e",
                    "score": 2,
                    "created_utc": 1643661121.0,
                    "replies": []
                },
                {
                    "body": "I've met several women IRL who wanted that except the allowance.   However, we generally talked a lot between and after.  Relationships come in all sizes and flavors.  Worry more about what works for you rather than what you think others would think of the relationship - with the singular exception if you feel used or abused.",
                    "author": "pinotandsugar",
                    "id": "hv3f8vh",
                    "parent_id": "t1_hv0vt2e",
                    "score": 0,
                    "created_utc": 1643691392.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Cuz platonic and online is called friendship 😗",
            "author": "Late_Ad_6293",
            "id": "hv1rs06",
            "parent_id": "t1_hv0ud32",
            "score": 3,
            "created_utc": 1643665238.0,
            "replies": [
                {
                    "body": "I dont sext with my friends online like i assume online sbs do. Also didn't the previous commenter just say \"Honestly a SR for both SD and SB comes down to what both sides want from the relationship\" ?",
                    "author": "ready4anytng",
                    "id": "hv27k1y",
                    "parent_id": "t1_hv1rs06",
                    "score": 4,
                    "created_utc": 1643671519.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I concur. What's her GV number?",
            "author": "BinghamtonSD",
            "id": "hv04rru",
            "parent_id": "t1_hv005sp",
            "score": 12,
            "created_utc": 1643643106.0,
            "replies": []
        },
        {
            "body": "If there are any other young women who are looking for a sex only relationship, please DM me and give me a chance to ‘talk you out of it’",
            "author": "DrZenRoot",
            "id": "hv5fb1l",
            "parent_id": "t1_hv5di3h",
            "score": 2,
            "created_utc": 1643733108.0,
            "replies": []
        },
        {
            "body": "Yep",
            "author": "Azucarbabby",
            "id": "hv1ijlq",
            "parent_id": "t1_hv1350w",
            "score": 6,
            "created_utc": 1643661747.0,
            "replies": []
        },
        {
            "body": ">\\+1 It's more about avoiding being seen with the person, than the play time!\n\nObservant comment buried -- hopefully u/Interesting_Scar_481 s comment can get upvoted.\n\nCan you expand ?",
            "author": "Hyceanplanet",
            "id": "hv274nz",
            "parent_id": "t1_hv1350w",
            "score": 4,
            "created_utc": 1643671340.0,
            "replies": [
                {
                    "body": "There isn't much to expand. Multiple reasons girl wouldn't want to be seen with the SD (none of them flattering for the SD) in public, so more play time to make up for it.",
                    "author": "Interesting_Scar_481",
                    "id": "hv3gki2",
                    "parent_id": "t1_hv274nz",
                    "score": 6,
                    "created_utc": 1643692104.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "My ex and I had a similar relationship, I loved staying in with him and would often spend the night but whenever he suggested leaving the house together??? I'm good lol. I obviously couldn't tell him why but I wouldn't push for dates as it seems she's uncomfortable with public dates.",
            "author": null,
            "id": "hv4k1lg",
            "parent_id": "t1_hv0vltd",
            "score": 2,
            "created_utc": 1643719761.0,
            "replies": [
                {
                    "body": "Why didn’t you want to go out with him?",
                    "author": null,
                    "id": "hy2c73w",
                    "parent_id": "t1_hv4k1lg",
                    "score": 1,
                    "created_utc": 1645592859.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "hv0bw06",
            "parent_id": "t1_hv0b6n3",
            "score": 9,
            "created_utc": 1643645910.0,
            "replies": [
                {
                    "body": "Haha, I know what you mean. That's so cool.",
                    "author": "nickthegreekinlondon",
                    "id": "hv4q73r",
                    "parent_id": "t1_hv0bw06",
                    "score": 1,
                    "created_utc": 1643722908.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "What is Normal these days ? Nothing",
            "author": "DiscreetlyYours2",
            "id": "hv0usmd",
            "parent_id": "t1_hv01fgy",
            "score": 5,
            "created_utc": 1643652902.0,
            "replies": []
        },
        {
            "body": "True, SLF SBs are the real ones that I can tell. They are not really the 'feed and fuk and leave' types.",
            "author": "CenTexFunGuy",
            "id": "hv032qs",
            "parent_id": "t1_hv01fgy",
            "score": 6,
            "created_utc": 1643642427.0,
            "replies": []
        },
        {
            "body": "I'm not being judgmental just putting things in perspective and based on my experience.  I too had experienced what you have had.  It's great but just careful not to get let down after a month when you discover whether there is any true bond.  A lot of SBs are very good with manipulation.  They would make it seem like to the moon we go together but once they feel they've gotten what they've wanted they can reveal their intentions later on so always make decisions when the mood is clear.",
            "author": "MKTekke",
            "id": "hv0toq4",
            "parent_id": "t1_hv0mimn",
            "score": 3,
            "created_utc": 1643652492.0,
            "replies": [
                {
                    "body": "I will definitely keep this in mind. Taking her at her word, she's never had a consistent SR for more than a couple months. She's high libido and is only attracted to older men. After the date my first thought was, that was so good but how long will this really last?\n\nDefinitely will keep your advice in my mind for later.",
                    "author": "NC-Chat",
                    "id": "hv0w61e",
                    "parent_id": "t1_hv0toq4",
                    "score": 1,
                    "created_utc": 1643653408.0,
                    "replies": [
                        {
                            "body": "Well, I certainly hope you don't take things into heart yet.  It's easy for a SB to say they are attracted to older men when there are $$ attached to it.  Can they be with you without the $?  I never take it seriously when a SB says they're into older men unless they can really prove to me that we can do something together that isn't transactional at all.  Otherwise it is still just that a transactional fantasy relationship.  I'm trying to put things in perspective, some SBs are very good at being that fantasy for you and everything they say belongs in that fantasy.",
                            "author": "MKTekke",
                            "id": "hv5m8z0",
                            "parent_id": "t1_hv0w61e",
                            "score": 1,
                            "created_utc": 1643735654.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Why does any of that matter? Just enjoy the present. You will have all the time in the world to contemplate whether this was “normal” or not when it eventually ends. Who cares if it is or isn’t normal? So you found a unicorn, ride it (pun intended) Save that contemplative energy for enjoying your SB. From the way you describe the SR, you need all the energy you can muster 🤣",
            "author": "oldharddrive",
            "id": "hv0p2q7",
            "parent_id": "t1_hv027oq",
            "score": 3,
            "created_utc": 1643650800.0,
            "replies": [
                {
                    "body": "Lol you know that's really good advice. I do tend to overthink. I'm debating on upping her allownce as an added incentive to stick around, but based on some other messages just giving extra gifts should do the trick.\n\nThanks for the honest feedback.",
                    "author": "NC-Chat",
                    "id": "hv0pcll",
                    "parent_id": "t1_hv0p2q7",
                    "score": 6,
                    "created_utc": 1643650900.0,
                    "replies": [
                        {
                            "body": "Glad to help! Just telling you from experience man. I have the PERFECT SB and I almost ruined it getting in my own head. Enjoying the ride is soooooooo much better that the alternative.",
                            "author": "oldharddrive",
                            "id": "hv0vi6o",
                            "parent_id": "t1_hv0pcll",
                            "score": 1,
                            "created_utc": 1643653165.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I don’t think there’s a standard SR. It’s really different for everyone. If you both feel happy and fulfilled with the dynamic she wants, then there’s nothing wrong with it! If you are hoping for something long-term, I don’t think it hurts to tell her that, but I do agree that you should try to enjoy it regardless. It’s still meaningful even if it doesn’t last forever. Also, all relationships end differently too so there’s really no way of knowing what to expect and I don’t think it’s worth worrying about.",
            "author": "fuzzydaymoon",
            "id": "hv1gnkv",
            "parent_id": "t1_hv027oq",
            "score": 1,
            "created_utc": 1643661035.0,
            "replies": []
        },
        {
            "body": "Raising allowance will almost always be well received. Maybe try connecting it to things she likes. Gifts. Experiences. Sex toys for your mutual kinks (maybe).\n\nSo yes, allowance and maybe extra monetary gifts, but also other stuff that just tickles her interests beyond money.\n\nSome SBs will stay with you for benifits, but most will stay longer if they really like you. \n\nFigure out what her priorities are, but don’t let her know that you are “sold“. Keep her interested and keep her surprised. \n\nI’d go with surprise gifts (cash and/or actual things), then be cool about it, “Awe, just a little something for you.” \n\nYou have to be the catch too!",
            "author": "SDchat",
            "id": "hv0ju2d",
            "parent_id": "t1_hv0g7dc",
            "score": 4,
            "created_utc": 1643648880.0,
            "replies": []
        },
        {
            "body": "I mean im not gonna judge you but just pointing a out a double standard women on here have said they were seeking that and judged way more harshly but good to know I can stop going out on dates, having sex marathons and texting my future SDs  .  I'll keep treating this one cause i really like him lol",
            "author": "ready4anytng",
            "id": "hv278aj",
            "parent_id": "t1_hv1upes",
            "score": 3,
            "created_utc": 1643671382.0,
            "replies": []
        },
        {
            "body": "FYI, it’s “indulge” not “divulge. Only letting you know for future reference, not intended as an insult. \n\nAlso, I can go that long and would kill for a SB that can do the same. Lucky man.",
            "author": "LordWildmore",
            "id": "hv0mrix",
            "parent_id": "t1_hv035rq",
            "score": 3,
            "created_utc": 1643649954.0,
            "replies": [
                {
                    "body": "Facepalm. And I like to write so now im embarrassed lol But yeah, I feel lucky. Based on other commenters though there are definitely other SBs like this. How to find that specific type though? No clue. I wasn't really looking for this either.",
                    "author": "NC-Chat",
                    "id": "hv0o7mx",
                    "parent_id": "t1_hv0mrix",
                    "score": 1,
                    "created_utc": 1643650480.0,
                    "replies": [
                        {
                            "body": "I don't think you can screen for this even if you tried to, and it's highly chemistry and attraction dependent. IMO it has more to do with your specific relationship than the particular girl. \n\nWith how sometimes sex-work-adjacent and perceptions run, I completely understand that most girls would never want to present a focus on physical intimacy. \n\nHonestly it's good enough to just screen out platonics.",
                            "author": "noobNYCsd",
                            "id": "hv0v5ir",
                            "parent_id": "t1_hv0o7mx",
                            "score": 1,
                            "created_utc": 1643653034.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "If this is true and if you’re happy with it, yes you should do whatever you can to hold onto her and you shouldn’t expect to find it again.",
            "author": null,
            "id": "hv05trx",
            "parent_id": "t1_hv035rq",
            "score": 2,
            "created_utc": 1643643526.0,
            "replies": []
        },
        {
            "body": "Escort?  3 to 5 hours if sex??!!  Not in a million years.",
            "author": "TexTH",
            "id": "hv36z1r",
            "parent_id": "t1_hv0vt2e",
            "score": 8,
            "created_utc": 1643687237.0,
            "replies": []
        },
        {
            "body": "I came to this thread to say that, but after reading the OP it sounds like he has been doing a lot of talking on the phone, which an escort presumably wouldn't be into doing for free.",
            "author": "Sugarbeggar",
            "id": "hv11f3c",
            "parent_id": "t1_hv0vt2e",
            "score": 19,
            "created_utc": 1643655330.0,
            "replies": []
        },
        {
            "body": "No escort is taking dick for 3 to 5 hours",
            "author": "Blknior",
            "id": "hv2fjwa",
            "parent_id": "t1_hv0vt2e",
            "score": 14,
            "created_utc": 1643675019.0,
            "replies": [
                {
                    "body": "From the same person, anyway.",
                    "author": "aotus_trivirgatus",
                    "id": "hv2ipmo",
                    "parent_id": "t1_hv2fjwa",
                    "score": 10,
                    "created_utc": 1643676506.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "They would  say its not a real SR and she should find a different sub then remove her post and ban her for rule 12 of course. But because its an SDs its the \"jackpot\"  of all SRs and shes a unicorn",
            "author": "ready4anytng",
            "id": "hv0w6tl",
            "parent_id": "t1_hv0vt2e",
            "score": 17,
            "created_utc": 1643653416.0,
            "replies": []
        },
        {
            "body": "For what its worth there IS an emotional connection at play, I should have mentioned that more in the post. We talk everyday, we're invested in each other's lives (within healthy boundaries) and have plenty of discussions outside of sex. The difference is when we actually are together.. . She just wants to fuck as much as possible. I've been with escorts before, this is very, very different.",
            "author": "NC-Chat",
            "id": "hv0x5so",
            "parent_id": "t1_hv0vt2e",
            "score": 14,
            "created_utc": 1643653769.0,
            "replies": [
                {
                    "body": "I have had 4 Sugar relationships and they all were pretty much like yours.",
                    "author": "redstone24",
                    "id": "hv1rti7",
                    "parent_id": "t1_hv0x5so",
                    "score": 6,
                    "created_utc": 1643665254.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "> Im getting escort vibes\n\nNot when she wants sex for 3-5 hours unless he signed up for the extended care program /s",
            "author": "GSSD",
            "id": "hv1gvjj",
            "parent_id": "t1_hv0vt2e",
            "score": 2,
            "created_utc": 1643661121.0,
            "replies": []
        },
        {
            "body": "I've met several women IRL who wanted that except the allowance.   However, we generally talked a lot between and after.  Relationships come in all sizes and flavors.  Worry more about what works for you rather than what you think others would think of the relationship - with the singular exception if you feel used or abused.",
            "author": "pinotandsugar",
            "id": "hv3f8vh",
            "parent_id": "t1_hv0vt2e",
            "score": 0,
            "created_utc": 1643691392.0,
            "replies": []
        },
        {
            "body": "I dont sext with my friends online like i assume online sbs do. Also didn't the previous commenter just say \"Honestly a SR for both SD and SB comes down to what both sides want from the relationship\" ?",
            "author": "ready4anytng",
            "id": "hv27k1y",
            "parent_id": "t1_hv1rs06",
            "score": 4,
            "created_utc": 1643671519.0,
            "replies": []
        },
        {
            "body": "There isn't much to expand. Multiple reasons girl wouldn't want to be seen with the SD (none of them flattering for the SD) in public, so more play time to make up for it.",
            "author": "Interesting_Scar_481",
            "id": "hv3gki2",
            "parent_id": "t1_hv274nz",
            "score": 6,
            "created_utc": 1643692104.0,
            "replies": []
        },
        {
            "body": "Why didn’t you want to go out with him?",
            "author": null,
            "id": "hy2c73w",
            "parent_id": "t1_hv4k1lg",
            "score": 1,
            "created_utc": 1645592859.0,
            "replies": []
        },
        {
            "body": "Haha, I know what you mean. That's so cool.",
            "author": "nickthegreekinlondon",
            "id": "hv4q73r",
            "parent_id": "t1_hv0bw06",
            "score": 1,
            "created_utc": 1643722908.0,
            "replies": []
        },
        {
            "body": "I will definitely keep this in mind. Taking her at her word, she's never had a consistent SR for more than a couple months. She's high libido and is only attracted to older men. After the date my first thought was, that was so good but how long will this really last?\n\nDefinitely will keep your advice in my mind for later.",
            "author": "NC-Chat",
            "id": "hv0w61e",
            "parent_id": "t1_hv0toq4",
            "score": 1,
            "created_utc": 1643653408.0,
            "replies": [
                {
                    "body": "Well, I certainly hope you don't take things into heart yet.  It's easy for a SB to say they are attracted to older men when there are $$ attached to it.  Can they be with you without the $?  I never take it seriously when a SB says they're into older men unless they can really prove to me that we can do something together that isn't transactional at all.  Otherwise it is still just that a transactional fantasy relationship.  I'm trying to put things in perspective, some SBs are very good at being that fantasy for you and everything they say belongs in that fantasy.",
                    "author": "MKTekke",
                    "id": "hv5m8z0",
                    "parent_id": "t1_hv0w61e",
                    "score": 1,
                    "created_utc": 1643735654.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Lol you know that's really good advice. I do tend to overthink. I'm debating on upping her allownce as an added incentive to stick around, but based on some other messages just giving extra gifts should do the trick.\n\nThanks for the honest feedback.",
            "author": "NC-Chat",
            "id": "hv0pcll",
            "parent_id": "t1_hv0p2q7",
            "score": 6,
            "created_utc": 1643650900.0,
            "replies": [
                {
                    "body": "Glad to help! Just telling you from experience man. I have the PERFECT SB and I almost ruined it getting in my own head. Enjoying the ride is soooooooo much better that the alternative.",
                    "author": "oldharddrive",
                    "id": "hv0vi6o",
                    "parent_id": "t1_hv0pcll",
                    "score": 1,
                    "created_utc": 1643653165.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Facepalm. And I like to write so now im embarrassed lol But yeah, I feel lucky. Based on other commenters though there are definitely other SBs like this. How to find that specific type though? No clue. I wasn't really looking for this either.",
            "author": "NC-Chat",
            "id": "hv0o7mx",
            "parent_id": "t1_hv0mrix",
            "score": 1,
            "created_utc": 1643650480.0,
            "replies": [
                {
                    "body": "I don't think you can screen for this even if you tried to, and it's highly chemistry and attraction dependent. IMO it has more to do with your specific relationship than the particular girl. \n\nWith how sometimes sex-work-adjacent and perceptions run, I completely understand that most girls would never want to present a focus on physical intimacy. \n\nHonestly it's good enough to just screen out platonics.",
                    "author": "noobNYCsd",
                    "id": "hv0v5ir",
                    "parent_id": "t1_hv0o7mx",
                    "score": 1,
                    "created_utc": 1643653034.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "From the same person, anyway.",
            "author": "aotus_trivirgatus",
            "id": "hv2ipmo",
            "parent_id": "t1_hv2fjwa",
            "score": 10,
            "created_utc": 1643676506.0,
            "replies": []
        },
        {
            "body": "I have had 4 Sugar relationships and they all were pretty much like yours.",
            "author": "redstone24",
            "id": "hv1rti7",
            "parent_id": "t1_hv0x5so",
            "score": 6,
            "created_utc": 1643665254.0,
            "replies": []
        },
        {
            "body": "Well, I certainly hope you don't take things into heart yet.  It's easy for a SB to say they are attracted to older men when there are $$ attached to it.  Can they be with you without the $?  I never take it seriously when a SB says they're into older men unless they can really prove to me that we can do something together that isn't transactional at all.  Otherwise it is still just that a transactional fantasy relationship.  I'm trying to put things in perspective, some SBs are very good at being that fantasy for you and everything they say belongs in that fantasy.",
            "author": "MKTekke",
            "id": "hv5m8z0",
            "parent_id": "t1_hv0w61e",
            "score": 1,
            "created_utc": 1643735654.0,
            "replies": []
        },
        {
            "body": "Glad to help! Just telling you from experience man. I have the PERFECT SB and I almost ruined it getting in my own head. Enjoying the ride is soooooooo much better that the alternative.",
            "author": "oldharddrive",
            "id": "hv0vi6o",
            "parent_id": "t1_hv0pcll",
            "score": 1,
            "created_utc": 1643653165.0,
            "replies": []
        },
        {
            "body": "I don't think you can screen for this even if you tried to, and it's highly chemistry and attraction dependent. IMO it has more to do with your specific relationship than the particular girl. \n\nWith how sometimes sex-work-adjacent and perceptions run, I completely understand that most girls would never want to present a focus on physical intimacy. \n\nHonestly it's good enough to just screen out platonics.",
            "author": "noobNYCsd",
            "id": "hv0v5ir",
            "parent_id": "t1_hv0o7mx",
            "score": 1,
            "created_utc": 1643653034.0,
            "replies": []
        }
    ]
}