{
    "title": "Why are we paying SA at this point?",
    "post_id": "infoif",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/infoif/why_are_we_paying_sa_at_this_point/",
    "author": "sdthrowout23",
    "body": "Seriously, the site is a train wreck at this point. They do nothing to take down the multitudes online only posters. They do nothing to remove the scammers. Add to it a smattering if underagers they don’t seem inclined to combat and it is a waste of time.\n\nTonight, second date. First m&g at a park, we decide a dinner in at a hotel and taking things from there for a second date due to COVID. Supposed to meet at 5...get text at 455 that she was sick. Keep in mind I had ordered her dinner she requested, drove 45 minutes, and booked a hotel.\n\nThe second one was just got my laughs. Met girl in seeking she immediately invited me over so I know scam. For giggles I ask where she lives and gives me an address for a luxury apartment in an old train station. I say “oh you I’ve in the old factory/warehouse they made lofts” to which she says yes so I know now for sure she is full of it. I laugh at her and ask her to take a picture out the window to prove she lives there....she says I might have a sniper. \n\nI talked to another girl today listed as twenty but when we get to snap she says that she will be turning 18 in two weeks. She has been on seeking four months. Great job there guys...start asking for Id confirmation as shit like that gets guys out in jail.\n\nBut this is your typical interaction on the site. At best it is a waste of time and at worst it is a minefield to end up on a sex offender list.",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/infoif/why_are_we_paying_sa_at_this_point/",
    "score": 92,
    "upvote_ratio": 0.93,
    "created_utc": 1599365971.0,
    "num_comments": 125,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "> she says I might have a sniper.\n\nWell, do you?",
            "author": null,
            "id": "g47b064",
            "parent_id": "t3_infoif",
            "score": 55,
            "created_utc": 1599366275.0,
            "replies": [
                {
                    "body": "Yep. I have my own private SS at my disposal.",
                    "author": "sdthrowout23",
                    "id": "g47cfkf",
                    "parent_id": "t1_g47b064",
                    "score": 25,
                    "created_utc": 1599367382.0,
                    "replies": [
                        {
                            "body": "You're not paranoid if they're really out to get you.",
                            "author": "TY2022",
                            "id": "g47e0n0",
                            "parent_id": "t1_g47cfkf",
                            "score": 16,
                            "created_utc": 1599368673.0,
                            "replies": []
                        },
                        {
                            "body": "SS? As a World War II History expert this makes me think of that SS! Lol",
                            "author": "BigBearSD",
                            "id": "g47xddc",
                            "parent_id": "t1_g47cfkf",
                            "score": 6,
                            "created_utc": 1599388160.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "g49x7la",
                                    "parent_id": "t1_g47xddc",
                                    "score": -1,
                                    "created_utc": 1599431183.0,
                                    "replies": [
                                        {
                                            "body": "Yeah, I saw your comment originally. Why do you miss the Schutzstaffel (the SS)? And why did you think to post that here of all places?",
                                            "author": "BigBearSD",
                                            "id": "g4bq48i",
                                            "parent_id": "t1_g49x7la",
                                            "score": 1,
                                            "created_utc": 1599482745.0,
                                            "replies": [
                                                {
                                                    "body": "Yeah. That was an odd post to say the least.",
                                                    "author": "sdthrowout23",
                                                    "id": "g4cbw5j",
                                                    "parent_id": "t1_g4bq48i",
                                                    "score": 1,
                                                    "created_utc": 1599493393.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "While I can't say that you're wrong in your assessment that SA is hot fucking garbage (but still \"the best\" garbage in town)... you really shouldn't have ordered dinner for someone before they arrive, much less a fresh POT. Same with the hotel, unless you're well established, take the \"last minute hit\" and wait until you're **sure** you need the room and pay extra that first and/or second time for the \"flexibility\" of being stood up in case.\n\nAs for the sniper... I can get not wanting to send a pic of your place, but that's a lame as shit excuse lol! \n\nAnd the underage is for sure shitty on her end, although at *least* she told you the truth before y'all met, no? So in the grand scheme of things, while it sucks and it had a HUGE potential to blow up in your face, be glad it didn't I guess!",
            "author": "sdaddy305",
            "id": "g47bgpe",
            "parent_id": "t3_infoif",
            "score": 45,
            "created_utc": 1599366627.0,
            "replies": [
                {
                    "body": "My thoughts as well.  \n\nThe reason SA is so polluted with \"bad actors\" is that Sugar Dating has become so popular and SA is really the only game in town.  It attracts all of the scammers, fakes, flakes, toe dippers, escorts, John's, pick up artists, salt daddies, vanilla boyfriends, online only, platonic only, femdoms, findoms, etc \n\nIt takes work to find real SDs and SBs, but it can be done and is still the best option available.",
                    "author": "willfromvb",
                    "id": "g47yx7x",
                    "parent_id": "t1_g47bgpe",
                    "score": 13,
                    "created_utc": 1599389872.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "g49y2xa",
                            "parent_id": "t1_g47yx7x",
                            "score": 2,
                            "created_utc": 1599431677.0,
                            "replies": [
                                {
                                    "body": "I missed feet pic sellers....lol",
                                    "author": "willfromvb",
                                    "id": "g49z7ur",
                                    "parent_id": "t1_g49y2xa",
                                    "score": 1,
                                    "created_utc": 1599432360.0,
                                    "replies": [
                                        {
                                            "body": "[deleted]",
                                            "author": null,
                                            "id": "g49zb75",
                                            "parent_id": "t1_g49z7ur",
                                            "score": 1,
                                            "created_utc": 1599432417.0,
                                            "replies": [
                                                {
                                                    "body": "I include that as \"online only\".  Onlyfans is just one site used for online activities.",
                                                    "author": "willfromvb",
                                                    "id": "g4a1zj0",
                                                    "parent_id": "t1_g49zb75",
                                                    "score": 1,
                                                    "created_utc": 1599434091.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Yeah. I get the whole hotel thing but we were texting literally up to a half hour till meeting and she said she was coming. I booked it at I think 430 and she to be there at 5. She didn’t want to go in together as it is a college town and for discretion reasons wanted to come in after me.\n\nEdit: as far as the underage thing I put most of that blame On seeking for being shit at verifying age. Require ID. End of story.",
                    "author": "sdthrowout23",
                    "id": "g47bo7s",
                    "parent_id": "t1_g47bgpe",
                    "score": 9,
                    "created_utc": 1599366785.0,
                    "replies": [
                        {
                            "body": "Eh.... TBH that sounds like a hot load, if she's *THAT* worried... why is she not worried about being seen sitting with you at a table for an hour+ by the same staff & patrons that would be there when you walk in together?\n\nAnd while I get that it probably seemed legit, I've literally been ghosted while sitting at the table and still texting that \"they're on the way\" into the *positive* minutes (as in, past our scheduled meeting time) so again, until they're across the table, consider it a 50/50 shot of them showing up.",
                            "author": "sdaddy305",
                            "id": "g47bwun",
                            "parent_id": "t1_g47bo7s",
                            "score": 11,
                            "created_utc": 1599366972.0,
                            "replies": [
                                {
                                    "body": "You may have missed it in my word wall...dinner was going to be at the hotel. Uber eats. We decided to stay in due to COVID. At least I got a nice meal for lunch tomorrow",
                                    "author": "sdthrowout23",
                                    "id": "g47c0zw",
                                    "parent_id": "t1_g47bwun",
                                    "score": 8,
                                    "created_utc": 1599367062.0,
                                    "replies": [
                                        {
                                            "body": "AH! No, I'd seen the \"At the hotel\" bit, I just wrongly assumed that you were having dinner at the hotel restaurant, not ordering in!\n\nAnd yeah, that's always been my \"consolation prize\" lol... a nice meal at least lol!",
                                            "author": "sdaddy305",
                                            "id": "g47c5l8",
                                            "parent_id": "t1_g47c0zw",
                                            "score": 11,
                                            "created_utc": 1599367164.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "Next time I know you will wait to order until she comes (appears)",
                                            "author": "rickrat",
                                            "id": "g480gn6",
                                            "parent_id": "t1_g47c0zw",
                                            "score": 4,
                                            "created_utc": 1599391501.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "You didn’t meet up with two of the three so not much harm. \n\nYou have a screening problem. The first was impossible to avoid, but you didn’t have to order a meal and you dodged a bullet. The second should be an immediate block. The third is just raising your age preferences to 21-23 and having the first date at a place where the waiter can ascertain she doesn’t have a fake. \n\nIf these are the only interesting POTs in you inbox, then you’re definitely doing something wrong or lackadaisically screening. \n\nVerification would be made mutual. If all the SB’s have to verify to be on the site, then all the SD’s would too. The blackmail excuse would finally have legs. The security on SA is so abysmal so it’s a surprise that a DDoS attack or AM level breach hasn’t hit SA.",
            "author": "SDF_SLF_SBF_SD_SB",
            "id": "g47xvf9",
            "parent_id": "t3_infoif",
            "score": 18,
            "created_utc": 1599388716.0,
            "replies": [
                {
                    "body": "How about we blame seeking and the other people. When 95% of my interactions are like this it isn’t me.",
                    "author": "sdthrowout23",
                    "id": "g48gmco",
                    "parent_id": "t1_g47xvf9",
                    "score": -7,
                    "created_utc": 1599403604.0,
                    "replies": [
                        {
                            "body": "It's just not productive to blame SA. You can't magically fix the site - the only thing you can do is to modify your own behavior. So, you have to *plan* for people to flake out and/or scam you. That comment above is giving you some constructive criticism as to what you can do to avoid these problems in the future.",
                            "author": "CentralPaSD",
                            "id": "g48tj2c",
                            "parent_id": "t1_g48gmco",
                            "score": 6,
                            "created_utc": 1599409825.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "The sniper part took me 🤣",
            "author": null,
            "id": "g47bvmc",
            "parent_id": "t3_infoif",
            "score": 16,
            "created_utc": 1599366946.0,
            "replies": [
                {
                    "body": "That was an all timer. I knew the next thing if I would have said “I am in my way” would have been asking for a cash app prepayment.",
                    "author": "sdthrowout23",
                    "id": "g47bybf",
                    "parent_id": "t1_g47bvmc",
                    "score": 8,
                    "created_utc": 1599367003.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "For once the jackass that always does a promo for SA “I’ve had great luck it just takes time and patience” did not reply. \n\nTotally agree with you. It was great a few years ago. Now a total shit show.",
            "author": "Nevrlrn",
            "id": "g47d11h",
            "parent_id": "t3_infoif",
            "score": 18,
            "created_utc": 1599367858.0,
            "replies": [
                {
                    "body": "I have actually always had luck on SA. BUT, when I am on it I cast a wide net very quickly and whittle it down from there. I also spend hours a day on it when i do have a profile. I have never had a hard time finding an SB. However, yes, I did have to weed through a ton of bullshit all of those times, and was quick to block people. I would say if I messaged a few hundred women in my locale, I would get a little under half in responses. From there send a few messages, if it was like pulling teeth I would block. So that would lower the number to say in the twenties. From there if I didn't feel a spark, connection, chemsitry, shared outlook etc... whittled down more. In the end only left with at most a handful. And from there move to text. Whittle away more to a few. Meet the woman I feel has the best chance first. M&G. Things go well. Done. I wouldn't do an M&G with just anyone. Had to get a feel of them and be able to talk to them easily before. \n\nBut yes SA is a shit show. Out of hundreds of messages I would at most have one or two M&Gs.\n\nEdit: I would also use filters in my search and filters in my messages. And more often than not I would keep my profile hidden from the search function so I wouldn't get swamped and so I only messaged women I was in to.",
                    "author": "BigBearSD",
                    "id": "g47xtzu",
                    "parent_id": "t1_g47d11h",
                    "score": 3,
                    "created_utc": 1599388672.0,
                    "replies": []
                },
                {
                    "body": "I’m sure they will be here, or the people that say “maybe you’re the problem.”",
                    "author": "sdthrowout23",
                    "id": "g47d8v7",
                    "parent_id": "t1_g47d11h",
                    "score": 3,
                    "created_utc": 1599368034.0,
                    "replies": [
                        {
                            "body": "Or “maybe you need a profile review.” 😂",
                            "author": "Nevrlrn",
                            "id": "g47dlo3",
                            "parent_id": "t1_g47d8v7",
                            "score": 6,
                            "created_utc": 1599368327.0,
                            "replies": []
                        },
                        {
                            "body": "It does seem odd given the 10:1 ratio some men here are constantly spouting emphasising how easy sugar is comparatively...",
                            "author": "blonde-throwaway",
                            "id": "g47sp2o",
                            "parent_id": "t1_g47d8v7",
                            "score": 6,
                            "created_utc": 1599383052.0,
                            "replies": []
                        },
                        {
                            "body": "One just popped in. They don’t bother to read the thread just promo SA when there’s a post pointing out how much it’s gone to the dogs. (Pun intended)",
                            "author": "Nevrlrn",
                            "id": "g47fmdc",
                            "parent_id": "t1_g47d8v7",
                            "score": 1,
                            "created_utc": 1599370047.0,
                            "replies": []
                        },
                        {
                            "body": "Indeed, we need to start calling them out when they are doing the promos for SA.",
                            "author": "Nevrlrn",
                            "id": "g47dgd5",
                            "parent_id": "t1_g47d8v7",
                            "score": 0,
                            "created_utc": 1599368203.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "- I agree seeking sucks. For me, it sucks most because if you report someone your account gets shut down. \n\n- the other problems you encountered suck, but they are a part of normal dating. If you went on any other dating site you would have an equal chance of flakes, online only, and scammers. As far as the underage thing goes, it is legal to meet up with a person under the age of 18, it is not legal to have sex with them. SA is not an escorting site. Escorting sites require ID and extensive verification. SA is just a dating site so they have no purpose verifying age and such because sex is not something that is required (even tho that’s up for debate according to this forum)",
            "author": "russianindianqueen",
            "id": "g47jgii",
            "parent_id": "t3_infoif",
            "score": 9,
            "created_utc": 1599373574.0,
            "replies": [
                {
                    "body": "But BUT there are 10 girls...I mean wait 100 girls for every boy on the website. Men can be so choosy because all the women are literally begging for any SD's attention.  Right, *rolling my eyes so HARD they might roll on off the back of my head.*",
                    "author": null,
                    "id": "g47jxch",
                    "parent_id": "t1_g47jgii",
                    "score": 5,
                    "created_utc": 1599374023.0,
                    "replies": [
                        {
                            "body": "💯 😂",
                            "author": "angelhair12",
                            "id": "g4984us",
                            "parent_id": "t1_g47jxch",
                            "score": 3,
                            "created_utc": 1599417180.0,
                            "replies": []
                        },
                        {
                            "body": "I hear that all the time but I’ve never experienced it!Somehow my SD account (my friend’s but I have access) has 4 times less messages in the inbox than my SB account 🤷🏼‍♀️",
                            "author": "russianindianqueen",
                            "id": "g47klan",
                            "parent_id": "t1_g47jxch",
                            "score": 5,
                            "created_utc": 1599374657.0,
                            "replies": [
                                {
                                    "body": "Guys online enjoy the fantasy of imagining the ratio exists where women must beg for their attention.",
                                    "author": null,
                                    "id": "g4853eo",
                                    "parent_id": "t1_g47klan",
                                    "score": 9,
                                    "created_utc": 1599395809.0,
                                    "replies": [
                                        {
                                            "body": "Come on. This isn’t true at all. I also find it really damn ironic because women love online dating because they have to do literally zero work to get 100’s Of hits while a guy will get one response per 100 messages",
                                            "author": "sdthrowout23",
                                            "id": "g48ft2x",
                                            "parent_id": "t1_g4853eo",
                                            "score": 0,
                                            "created_utc": 1599403119.0,
                                            "replies": [
                                                {
                                                    "body": "Poor men. )-: But, since dick isn't in short supply, it is what it is.",
                                                    "author": null,
                                                    "id": "g48j15c",
                                                    "parent_id": "t1_g48ft2x",
                                                    "score": 5,
                                                    "created_utc": 1599404818.0,
                                                    "replies": [
                                                        {
                                                            "body": ">But, since dick isn't in short supply\n\nGood dick attached to muscular frames and intelligent minds is.",
                                                            "author": null,
                                                            "id": "g48w3f0",
                                                            "parent_id": "t1_g48j15c",
                                                            "score": 1,
                                                            "created_utc": 1599411030.0,
                                                            "replies": []
                                                        },
                                                        {
                                                            "body": "Lol. Got to love women that think they are God’s gift to the world.",
                                                            "author": "sdthrowout23",
                                                            "id": "g48jztm",
                                                            "parent_id": "t1_g48j15c",
                                                            "score": -4,
                                                            "created_utc": 1599405269.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Women are like flowers, they fill the world with beauty, and sometimes attract pests.",
                                                                    "author": null,
                                                                    "id": "g48suq7",
                                                                    "parent_id": "t1_g48jztm",
                                                                    "score": 3,
                                                                    "created_utc": 1599409492.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "That ratio just simply does not exist and I have to explain it every time a post like this is made lmao. It's fantasy at best until anything comes of these profiles that you're interacting with it's all fake.  \n\n\nSuddenly that ratio looks about even.",
                                                                            "author": null,
                                                                            "id": "g4bn0by",
                                                                            "parent_id": "t1_g48suq7",
                                                                            "score": 4,
                                                                            "created_utc": 1599480074.0,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "Well, whats the profile text like on your fake SD account?\n\nThe ratios are still there, just keep in mind a lot of SBs dont initiate conversations (habit I guess).\n\nThen finally the real question, what percentage of the guys that message you are not johns or scammers.\n\nThat said, even with the ratio I'm less than thrilled with SA now days.",
                                    "author": null,
                                    "id": "g47wpqs",
                                    "parent_id": "t1_g47klan",
                                    "score": 5,
                                    "created_utc": 1599387443.0,
                                    "replies": [
                                        {
                                            "body": "It’s not a fake account 😘",
                                            "author": "russianindianqueen",
                                            "id": "g48wlxp",
                                            "parent_id": "t1_g47wpqs",
                                            "score": 2,
                                            "created_utc": 1599411305.0,
                                            "replies": [
                                                {
                                                    "body": "Ah, I assumed it was an account to check out the competition.",
                                                    "author": null,
                                                    "id": "g4985kh",
                                                    "parent_id": "t1_g48wlxp",
                                                    "score": 0,
                                                    "created_utc": 1599417191.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "I NEVER have women initiating with me.",
                                    "author": "sdthrowout23",
                                    "id": "g48eyey",
                                    "parent_id": "t1_g47klan",
                                    "score": 1,
                                    "created_utc": 1599402609.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "I can easily get a SB in a few days at the very most. Finding a quality SB however really is quite difficult and I have to throw back a bunch to get that one good one.",
                            "author": null,
                            "id": "g48rb4p",
                            "parent_id": "t1_g47jxch",
                            "score": 0,
                            "created_utc": 1599408787.0,
                            "replies": [
                                {
                                    "body": "Of course you can, dear. Just like those tall tales of, 'catching the big one' fishermen's stories we have all heard.",
                                    "author": null,
                                    "id": "g48u0ej",
                                    "parent_id": "t1_g48rb4p",
                                    "score": 3,
                                    "created_utc": 1599410045.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "I’d really like to see these sites held responsible subtle for allowing minors on the site. It is asinine that on tinder a 20 year old can go to jail and force to go on a registry because some girl lied about age and tinder faces zero consequences\n\nAlso, we need to change the laws. This might not be popular on here but the 16 or 17 year old that goes on dating websites to meet older men and says she is 20 is a predator.",
                    "author": "sdthrowout23",
                    "id": "g48evqh",
                    "parent_id": "t1_g47jgii",
                    "score": -1,
                    "created_utc": 1599402566.0,
                    "replies": [
                        {
                            "body": "Maybe you should ask to meet at a bar for cocktails, if you’re so concerned it’s your responsibility to check ID. Otherwise try an escort site! There’s lots of verified providers on escort sites! I think 10x less people would be on seeking if ID was required to register.",
                            "author": "russianindianqueen",
                            "id": "g48x0c0",
                            "parent_id": "t1_g48evqh",
                            "score": 4,
                            "created_utc": 1599411528.0,
                            "replies": [
                                {
                                    "body": "This. Many love to skate that fine line with 18-19-20-year-olds. Just seems like a safer bet to date someone who can have wine with their meal.\n\nThe woe-is-me-isms is the price you pay for the risk.",
                                    "author": null,
                                    "id": "g4bn86c",
                                    "parent_id": "t1_g48x0c0",
                                    "score": 2,
                                    "created_utc": 1599480266.0,
                                    "replies": [
                                        {
                                            "body": "Lol. I guarantee you are a 30 year old SB who is just pissed most guys want younger.",
                                            "author": "sdthrowout23",
                                            "id": "g4cc424",
                                            "parent_id": "t1_g4bn86c",
                                            "score": 0,
                                            "created_utc": 1599493482.0,
                                            "replies": [
                                                {
                                                    "body": "I guarantee you - no girl over 25 would put up with your crap.",
                                                    "author": "angelhair12",
                                                    "id": "g4cdgcx",
                                                    "parent_id": "t1_g4cc424",
                                                    "score": 3,
                                                    "created_utc": 1599494005.0,
                                                    "replies": [
                                                        {
                                                            "body": "What crap is that? Being pissed off she ghosted me 5 minutes before we were supposed to meet.",
                                                            "author": "sdthrowout23",
                                                            "id": "g4cepnw",
                                                            "parent_id": "t1_g4cdgcx",
                                                            "score": 0,
                                                            "created_utc": 1599494533.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "body": "What a great way to spend your mental capacity, wish you would have gone in with the same effort to screen your pot. :)  \n\n\nMy mother just left her 30's though; I'll be sure to ask her how she's dealt with the menopausal '30s. 🤣",
                                                    "author": null,
                                                    "id": "g6ackr5",
                                                    "parent_id": "t1_g4cc424",
                                                    "score": 2,
                                                    "created_utc": 1600833810.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "While I agree with several of your general points, a 16 or 17 year old that legally is still considered not an adult and has a less developed brain than you is a “predator” for joining a website lol? Sounds like a confused teenager exploring the internet, not a predator. \n\nWhy is it the site’s responsibility anymore than you to check ID anyway? The law says it’s going to be your responsibility to check either way before you engage in anything sexual, so time to take some personal responsibility. Not going to say that the site can’t do more here, but you seem to want to blame some of your mistakes on SA when the mistakes are yours to prevent",
                            "author": null,
                            "id": "g48xj6i",
                            "parent_id": "t1_g48evqh",
                            "score": 3,
                            "created_utc": 1599411806.0,
                            "replies": [
                                {
                                    "body": "I always check Id but fake ids are a thing. I can only go so far where a website can do a public records check potentially.",
                                    "author": "sdthrowout23",
                                    "id": "g4911hw",
                                    "parent_id": "t1_g48xj6i",
                                    "score": 1,
                                    "created_utc": 1599413501.0,
                                    "replies": [
                                        {
                                            "body": "If fake IDs are a problem they are going to be a problem for SA too. \n\nAt least in the US, no one is going to blame a website for not checking IDs when you are the older man that gets caught trying to sleep with an underage girl you didn’t vet. It will be your life that is ruined in that situation, not SA’s company so learn to have your own back. You do a public records search if your skeptical, it’s your ass on the line",
                                            "author": null,
                                            "id": "g491jfn",
                                            "parent_id": "t1_g4911hw",
                                            "score": 2,
                                            "created_utc": 1599413751.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "I mean, dude, it's 2020, kids are not buying fake IDs in droves. Kids can get drunk and smoke whatever they want at home. It's just how Gen-Z does it. It's so rare to run into this SPECIFIC scenario of your 16-year-old sugar baby having a fake ID. \n\nYou have to screen better and or date older.",
                                            "author": null,
                                            "id": "g4bnr8z",
                                            "parent_id": "t1_g4911hw",
                                            "score": 2,
                                            "created_utc": 1599480741.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Doesn't that depend on which state you are in?",
                    "author": null,
                    "id": "g47ye20",
                    "parent_id": "t1_g47jgii",
                    "score": 0,
                    "created_utc": 1599389295.0,
                    "replies": [
                        {
                            "body": "In any state or country it is legal for a minor and an adult to meet. If there is physical intimacy only then it falls under statutory rape. I had teachers in high school take me out for lunch. Probably had a creepy crush on me. Not illegal tho",
                            "author": "russianindianqueen",
                            "id": "g499car",
                            "parent_id": "t1_g47ye20",
                            "score": 1,
                            "created_utc": 1599417842.0,
                            "replies": [
                                {
                                    "body": "But like age of consent is 16 in like .... a lot of states? dunno, I'm not out here trying to smash 16 years olds but that doesn't bother anyone?",
                                    "author": null,
                                    "id": "g4apwy3",
                                    "parent_id": "t1_g499car",
                                    "score": 0,
                                    "created_utc": 1599449086.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Dont get hotels the day of, or if you do, get it after she meets up.",
            "author": "dade_murphy1",
            "id": "g47rxla",
            "parent_id": "t3_infoif",
            "score": 7,
            "created_utc": 1599382219.0,
            "replies": []
        },
        {
            "body": "SD's with no SB right now, get together and pay a developer to make a better app with what you'd spend on allowances and premium subscriptions.",
            "author": "yeehaw_yall",
            "id": "g47ge6i",
            "parent_id": "t3_infoif",
            "score": 17,
            "created_utc": 1599370728.0,
            "replies": [
                {
                    "body": "This has been discussed for years, but really isn't practical.  Most of the issues people have with SA, aren't because of SA.  It's mostly because of the \"f*cked up\" laws in the US.  Any successful competitor would have to deal with the same issues.",
                    "author": "willfromvb",
                    "id": "g47ynjc",
                    "parent_id": "t1_g47ge6i",
                    "score": 10,
                    "created_utc": 1599389582.0,
                    "replies": [
                        {
                            "body": "I'd argue a bit on that one.\n\n\"Most of the issues,\" from what I've seen, are:\n\n* FAKES\n* Underaged people\n* Bots\n* Slow/nonfunctioning messenger\n* Ugly UI\n* Limited search options\n* No female category to separate \"\"\"\"curvy\"\"\"\" from \"embracing obese\"\n\nAnd these are long-running issues. Easily fixed in a week or two by a competent developer(s).",
                            "author": "yeehaw_yall",
                            "id": "g49epru",
                            "parent_id": "t1_g47ynjc",
                            "score": 0,
                            "created_utc": 1599420819.0,
                            "replies": [
                                {
                                    "body": "Forgot to ad pre & post op trans people.\n\nHave trans friends, I am just not interested in sex with trans people.",
                                    "author": "mollyflowers",
                                    "id": "g49zm13",
                                    "parent_id": "t1_g49epru",
                                    "score": 1,
                                    "created_utc": 1599432600.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "What is your vetting process?\n\nI wouldnt be booking dinner and a hotel for a M&G that puts alot of pressure on a young woman. \n\nI might meet a guy and sleep with him same night?",
            "author": "bookworm010101",
            "id": "g4849h0",
            "parent_id": "t3_infoif",
            "score": 5,
            "created_utc": 1599395092.0,
            "replies": [
                {
                    "body": "We already had a m&g",
                    "author": "sdthrowout23",
                    "id": "g48eotu",
                    "parent_id": "t1_g4849h0",
                    "score": 1,
                    "created_utc": 1599402454.0,
                    "replies": [
                        {
                            "body": "I see.\n\nSucks.....usually SBs get 1 **whoops** this would be her whoops .\n\nbest of luck",
                            "author": "bookworm010101",
                            "id": "g48euyd",
                            "parent_id": "t1_g48eotu",
                            "score": 2,
                            "created_utc": 1599402554.0,
                            "replies": [
                                {
                                    "body": "Nah. She told me she was sick...then posted on Snapchat a picture of a giant greasy hoagie she was eating later that night. That is a block,",
                                    "author": "sdthrowout23",
                                    "id": "g48ggrz",
                                    "parent_id": "t1_g48euyd",
                                    "score": 6,
                                    "created_utc": 1599403511.0,
                                    "replies": [
                                        {
                                            "body": "Agreed.",
                                            "author": "bookworm010101",
                                            "id": "g48h1d3",
                                            "parent_id": "t1_g48ggrz",
                                            "score": 1,
                                            "created_utc": 1599403856.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I literally had a whole account for over a year then they locked me out of it but I never found a Daddy because literally all of them were scammers. I found one but he was super iffy about spoiling me which is why I got on the sight *a whole headache*",
            "author": "DigitalStrippher",
            "id": "g47sf4d",
            "parent_id": "t3_infoif",
            "score": 6,
            "created_utc": 1599382746.0,
            "replies": []
        },
        {
            "body": "Keep trying, you will learn to pick up the red flags sooner and not waste as much time on toe dippers, scammers and the like. \n\n - don't buy a dinner before she arrives\n - if it is your first intimate date, assume she may get cold feet and don't book ahead\n - snap is a great way of communicating for scammers so it is rarely used by real SDs and SBs \n - the \"underage girl\" may not have been underage at all, but was a scammer ready to blackmail you for propositioning a minor\n\nIt is difficult to sort through all the bad actors on SA, but it is still the best option available in most areas.  If you are a legitimate SD, with reasonable money and a decent personality, finding real SBs isn't that hard, but may require patience.",
            "author": "willfromvb",
            "id": "g47z9zu",
            "parent_id": "t3_infoif",
            "score": 5,
            "created_utc": 1599390249.0,
            "replies": []
        },
        {
            "body": "SA is for men who lean toward fantasy. If you are looking for a real woman, go into the real world. SBs are everywhere, you just have to be yourself and be friendly with every woman you find attractive in your world. Where you work, where you go during the day, whenever....smile, eye contact and pay attention to her. The more you listen to her, the more she will feel important and valued. And she also learns about how successful you are, and if you throw in some fodder about how you are not so satisfied in your marriage, the POTs will get the hint. The non-POTs will give you advice, by contrast, so you know to not cross borders with these women. But over time, sooner or later, SHE will proposition you. I believe this because it's happened to me times. But I agree with you -- SA is a supreme waste of time and money.",
            "author": "KnightAnthony",
            "id": "g48txqy",
            "parent_id": "t3_infoif",
            "score": 3,
            "created_utc": 1599410005.0,
            "replies": [
                {
                    "body": "I'm late 40's & the dating scene for my age sucks.  I don't find women 45 plus attractive & the few I do find attractive have 10 guys chasing them.  \n\nSA allows me to sugar date young hot 20 somethings which I'm good with.",
                    "author": "mollyflowers",
                    "id": "g49zte0",
                    "parent_id": "t1_g48txqy",
                    "score": 3,
                    "created_utc": 1599432727.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Your other points are valid...but as far as the apartment girl...why can’t she live there? \n\njust saying that one might’ve been an assumption on your end maybe she’s just an escort with a nice place lol",
            "author": "sienfiekdsa",
            "id": "g47gxxq",
            "parent_id": "t3_infoif",
            "score": 6,
            "created_utc": 1599371213.0,
            "replies": [
                {
                    "body": "Because she would have known it was a train station and not a warehouse,",
                    "author": "sdthrowout23",
                    "id": "g48fw44",
                    "parent_id": "t1_g47gxxq",
                    "score": 5,
                    "created_utc": 1599403168.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Geez....what a whiner.  If you can’t handle this, no one is forcing you to stay.  And besides....you are doing stuff only newbies do.....you’re setting yourself up for failure and disappointment.  Instead of ranting and throwing a hissy fit...how about taking some time and actually read this thread.\n\nI’ve been on SA for 10 years. I honestly don’t see much difference now than when I first joined. There have always been fakes, scammers. Time-wasters too.  But I always say.....you have to kiss a lot of frogs before you find a princess.\n\nIt’s been two years since my last SLR. Bet I had 50+ M&G’s. Spent a lot of $ looking.  And it was worth every cent—because I found her. Again.  \n\nYou’re obviously too cheap, too naive, too impatient or too clueless.  Go try Established Men. Try SugarDaddyforme. Try WYP. Try finding one on your own.  Better yet, start your own website. See how well those work.....then come back to SA with some appreciation that it’s the best thing going.",
            "author": "TheRockateer75",
            "id": "g48apaz",
            "parent_id": "t3_infoif",
            "score": 9,
            "created_utc": 1599399960.0,
            "replies": [
                {
                    "body": "Someone gets it! 🏆",
                    "author": null,
                    "id": "g48axo1",
                    "parent_id": "t1_g48apaz",
                    "score": 0,
                    "created_utc": 1599400121.0,
                    "replies": []
                },
                {
                    "body": "White knight!",
                    "author": "sdthrowout23",
                    "id": "g48ecn5",
                    "parent_id": "t1_g48apaz",
                    "score": -2,
                    "created_utc": 1599402251.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I agree that SA should be reviewing profiles more often, but I will say that they are trying. I am 18 and during my profile review, my account got suspended and required me to send my ID for age verification before continuing to use the site. \n\nEverything has its pros and cons. It is also up to you to thoroughly read profiles, check pictures, and figure out more. Even in the vanilla world, minors lie all the time. At the end of the day, it is your responsibility to take precautions and pay attention to red flags.",
            "author": null,
            "id": "g47h1gz",
            "parent_id": "t3_infoif",
            "score": 3,
            "created_utc": 1599371303.0,
            "replies": []
        },
        {
            "body": "Because with all its flaws, it's the best site for sugar.",
            "author": "SeattleLaserMeteor",
            "id": "g47en8v",
            "parent_id": "t3_infoif",
            "score": 3,
            "created_utc": 1599369204.0,
            "replies": [
                {
                    "body": "What other options are there",
                    "author": "lloydSF",
                    "id": "g47u1qm",
                    "parent_id": "t1_g47en8v",
                    "score": 1,
                    "created_utc": 1599384535.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "😂 at their stories. \nSorry for your loss of efforts ✨",
            "author": "acandygoddess",
            "id": "g486fl1",
            "parent_id": "t3_infoif",
            "score": 2,
            "created_utc": 1599396896.0,
            "replies": []
        },
        {
            "body": "With all due respect your approach looks a bit too rushed and transactional. Like you are in a mad rush to have get to intimacy without wanting to spend more time getting to know people. Particularly important during Covid. \n\nOne should never forget people flake and cancel. For the date, you should have checked in with the lady sometime during morning or noon time just to confirm and also offer her an “out” if she chose not to meet. Getting an hotel, ordering food etc was a bit of an overkill. \n\n So I won’t blame the site 100%.. There are of course a lot of weirdos on it from both sides but a seasoned guy should be able to sniff it out easily.",
            "author": null,
            "id": "g48f6ep",
            "parent_id": "t3_infoif",
            "score": 2,
            "created_utc": 1599402741.0,
            "replies": [
                {
                    "body": "Wow is this the same writing style used on the SA website for FAQ’s and pointers? \n\nIf it walks like a duck and sounds like a duck.....",
                    "author": "Nevrlrn",
                    "id": "g48lnp0",
                    "parent_id": "t1_g48f6ep",
                    "score": 1,
                    "created_utc": 1599406123.0,
                    "replies": []
                },
                {
                    "body": "We were communicating up to 30 minutes before we were to meet. I didn’t book the hotel till that point.\n\nAlso, what is too rushed? We had a m&g then set a first date? That seems pretty standard??",
                    "author": "sdthrowout23",
                    "id": "g48gd0o",
                    "parent_id": "t1_g48f6ep",
                    "score": 0,
                    "created_utc": 1599403448.0,
                    "replies": [
                        {
                            "body": "Well clearly it was too rushed for her. It literally made her sick to her stomach after she canceled she prob felt better and ordered the hoagie.",
                            "author": "angelhair12",
                            "id": "g49adzv",
                            "parent_id": "t1_g48gd0o",
                            "score": 2,
                            "created_utc": 1599418412.0,
                            "replies": [
                                {
                                    "body": "A lot of you women on here are really shitty fucking people.",
                                    "author": "sdthrowout23",
                                    "id": "g49jy89",
                                    "parent_id": "t1_g49adzv",
                                    "score": 1,
                                    "created_utc": 1599423716.0,
                                    "replies": [
                                        {
                                            "body": "Wow. I’m trying to explain to you a girl has feel comfortable before she sleeps with you, something you should know but you don’t seem to care.\n\nI’m so sorry not everyone is going to cater to your delusions.",
                                            "author": "angelhair12",
                                            "id": "g49ljf2",
                                            "parent_id": "t1_g49jy89",
                                            "score": 4,
                                            "created_utc": 1599424601.0,
                                            "replies": [
                                                {
                                                    "body": "SA sucks because there isn't a flock of women on there who wants to sleep with me in my hotel right away, I already ordered her dinner, where the hell is she? Someone call the manager! 😂 This is what I see every time I check this subreddit.",
                                                    "author": null,
                                                    "id": "g4boi7u",
                                                    "parent_id": "t1_g49ljf2",
                                                    "score": 4,
                                                    "created_utc": 1599481406.0,
                                                    "replies": []
                                                },
                                                {
                                                    "body": "Yes...don’t blame her for saying up to 30 minutes before she was ok with meeting.",
                                                    "author": "sdthrowout23",
                                                    "id": "g49qkp0",
                                                    "parent_id": "t1_g49ljf2",
                                                    "score": 0,
                                                    "created_utc": 1599427429.0,
                                                    "replies": [
                                                        {
                                                            "body": "She probably needed the money and thought she go through with it but you have such negative energy and are so off putting she couldn’t go through with it. \n\nShe made the right call. You’re the typical angry unmarried guy in your 30’s most girls wouldn’t touch for any amount of $$.",
                                                            "author": "angelhair12",
                                                            "id": "g49rhq7",
                                                            "parent_id": "t1_g49qkp0",
                                                            "score": 4,
                                                            "created_utc": 1599427953.0,
                                                            "replies": [
                                                                {
                                                                    "body": "You’re a cry baby too, gets even better lol. \nYou were the one who started calling me a shi*y person, remember!",
                                                                    "author": "angelhair12",
                                                                    "id": "g49tf9t",
                                                                    "parent_id": "t1_g49rhq7",
                                                                    "score": 3,
                                                                    "created_utc": 1599429051.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "Don’t even go there. You immediately insulted me by saying the thought of sex with me made her sick.",
                                                                            "author": "sdthrowout23",
                                                                            "id": "g49wv9i",
                                                                            "parent_id": "t1_g49tf9t",
                                                                            "score": 0,
                                                                            "created_utc": 1599430989.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "It may be an insult to you, but it is a different perspective none-the-less. If she was truly young and naive she may have gotten herself above her own head.",
                                                                                    "author": null,
                                                                                    "id": "g4bom38",
                                                                                    "parent_id": "t1_g49wv9i",
                                                                                    "score": 3,
                                                                                    "created_utc": 1599481502.0,
                                                                                    "replies": [
                                                                                        {
                                                                                            "body": "Always always always making excuses for shitty behavior. Also excusing the OP who said the thought of intimacy made her sick.",
                                                                                            "author": "sdthrowout23",
                                                                                            "id": "g4cbs20",
                                                                                            "parent_id": "t1_g4bom38",
                                                                                            "score": 1,
                                                                                            "created_utc": 1599493351.0,
                                                                                            "replies": []
                                                                                        },
                                                                                        {
                                                                                            "body": "Exactly how I meant it. This guy takes things too personally instead of learning.",
                                                                                            "author": "angelhair12",
                                                                                            "id": "g4dzxra",
                                                                                            "parent_id": "t1_g4bom38",
                                                                                            "score": 1,
                                                                                            "created_utc": 1599520420.0,
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "body": "Lol. Mods, why does shit like this not get posters banned?",
                                                                    "author": "sdthrowout23",
                                                                    "id": "g49t0r5",
                                                                    "parent_id": "t1_g49rhq7",
                                                                    "score": 0,
                                                                    "created_utc": 1599428823.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "body": "Try freestyle, much less entitlement and at least you know what you're getting beforehand. I basically stopped using SA because it was such an enormous time waster.",
                                            "author": "alwaysawoke",
                                            "id": "g4a7zjf",
                                            "parent_id": "t1_g49jy89",
                                            "score": 2,
                                            "created_utc": 1599437924.0,
                                            "replies": [
                                                {
                                                    "body": "I find that people who don't freestyle are usually not freestyle material. Meaning that what to find quick and cheap sex and use text to manipulate their way through the end goal. Freestyling is a great way to get to know people while actually living life.",
                                                    "author": null,
                                                    "id": "g4bobi8",
                                                    "parent_id": "t1_g4a7zjf",
                                                    "score": 1,
                                                    "created_utc": 1599481241.0,
                                                    "replies": [
                                                        {
                                                            "body": "Probably why I dont fit in well here. I dont fit the stereotypical socially awkward, emotionally stunted unattractive SD.\nAlso if that's the goal why not get an escort?",
                                                            "author": "alwaysawoke",
                                                            "id": "g4c1kuo",
                                                            "parent_id": "t1_g4bobi8",
                                                            "score": 3,
                                                            "created_utc": 1599488932.0,
                                                            "replies": [
                                                                {
                                                                    "body": "For logistics, I guess.",
                                                                    "author": null,
                                                                    "id": "g6acr55",
                                                                    "parent_id": "t1_g4c1kuo",
                                                                    "score": 1,
                                                                    "created_utc": 1600833931.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "Got it. How does that experience have anything to do with the site? Is the site responsible for your SBs schedule?",
                            "author": null,
                            "id": "g48jmzp",
                            "parent_id": "t1_g48gd0o",
                            "score": 1,
                            "created_utc": 1599405123.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Honestly you have to upload an ID to use things like OnlyFans. There is often lingerie or light nudity on SA anyhow so it's not a far stretch to ask users to upload an ID for their profile verification. I guess that would be too much work for SA🙄",
            "author": "throwawaibye",
            "id": "g48jm16",
            "parent_id": "t3_infoif",
            "score": 2,
            "created_utc": 1599405110.0,
            "replies": []
        },
        {
            "body": "The latest scam which is I need a small cash deposit upfront, $25.  \n\nWhen looking for a new SB, I had no less than 10 profiles do this to me.  I honestly think the scam is good & widespread, it's run by the cartels out of Mexico.  \n\nI had one girl I did a meet & greet with at Starbucks.  Said she needed $$ to get her shit out of hock, said no issue when do you want to kick off the arrangement.  She said in 45 days as she just had a hysterectomy.  I'm like wtf?  The whining about the money was out of hand, so just finished up the date & said I'll text when I'm home.  Blocked & moved on.\n\nStill I found 4 girls on there I liked, did a meet & greet with all of them.  3 we did a dinner date & I am keeping all 3 in the rotation as they cannot meet regularly, only 2x a month each.",
            "author": "mollyflowers",
            "id": "g49zh5l",
            "parent_id": "t3_infoif",
            "score": 1,
            "created_utc": 1599432519.0,
            "replies": [
                {
                    "body": "I had a girl, who was real and from my city, go after me for 5 dollars for an only fans sub. I took the chance since I could confirm she was real but she ghosted me after I paid lol.",
                    "author": "sdthrowout23",
                    "id": "g4a00p4",
                    "parent_id": "t1_g49zh5l",
                    "score": 1,
                    "created_utc": 1599432853.0,
                    "replies": [
                        {
                            "body": "Actually the hottest SB I found recently has a fan's only & approached me about doing a oral sex video for her only fans.   I might take her up on it, as it be me receiving oral sex my face will not be shown.",
                            "author": "mollyflowers",
                            "id": "g4a0i88",
                            "parent_id": "t1_g4a00p4",
                            "score": 2,
                            "created_utc": 1599433158.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I don’t know why people are having such problems with SA.  I love the site and would pay much more.",
            "author": "midwestsweetking",
            "id": "g4axlbu",
            "parent_id": "t3_infoif",
            "score": 1,
            "created_utc": 1599454747.0,
            "replies": []
        },
        {
            "body": "I cant believe how bad this site is .  My opinion it started going down hill once they allowed girls to stop sharing there location/town.  The amount of scammers on there in at least 50% . Then the girls expecting guys to pay for pics is the the next 50% .   Site is ruined and Im really sad because I met so many cool girls and made some amazing memories in the past 5 yrs.",
            "author": "hotbird123",
            "id": "g4dvq0c",
            "parent_id": "t3_infoif",
            "score": 1,
            "created_utc": 1599517901.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "g47zn9y",
            "parent_id": "t3_infoif",
            "score": 1,
            "created_utc": 1599390640.0,
            "replies": [
                {
                    "body": "I’m 35. I’m not upping into the 30’s.",
                    "author": "sdthrowout23",
                    "id": "g48fyw5",
                    "parent_id": "t1_g47zn9y",
                    "score": 3,
                    "created_utc": 1599403214.0,
                    "replies": [
                        {
                            "body": "Why not? Women in their 30s are very much viable as potential SBs.",
                            "author": "earth-to-matilda",
                            "id": "g48lrcv",
                            "parent_id": "t1_g48fyw5",
                            "score": 0,
                            "created_utc": 1599406181.0,
                            "replies": [
                                {
                                    "body": "I’d just date them.",
                                    "author": "sdthrowout23",
                                    "id": "g48uhxb",
                                    "parent_id": "t1_g48lrcv",
                                    "score": 0,
                                    "created_utc": 1599410310.0,
                                    "replies": [
                                        {
                                            "body": "I get that. I'm in my low 40s and I'll stretch up to the mid 30s or so because a diamond in the rough might present herself...but most of my wheelhouse is 21-25.\n\n&#x200B;\n\nAs was said before, your issues tend more toward your lack of ability to screen, rather than the shortcomings of SA itself.",
                                            "author": "earth-to-matilda",
                                            "id": "g48vvsl",
                                            "parent_id": "t1_g48uhxb",
                                            "score": 2,
                                            "created_utc": 1599410959.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Hi! Im an sb and I was wondering if there are better platforms other than seeking?",
            "author": "DoUHearTheBells2",
            "id": "g47xywn",
            "parent_id": "t3_infoif",
            "score": 0,
            "created_utc": 1599388823.0,
            "replies": []
        },
        {
            "body": "Since when do you have to pay to use SA. \n\nAlso about the girl who was listed as 20 then revealed she’s turning 18 in 2 weeks I thought SA verifies every profile and asks for ID etc shouldn’t that help make sure listed ages are accurate.",
            "author": "a1bells",
            "id": "g47lafs",
            "parent_id": "t3_infoif",
            "score": 0,
            "created_utc": 1599375325.0,
            "replies": [
                {
                    "body": "SDs have to pay to message users. SBs have a free or paid option.",
                    "author": "KittenCalledKatt",
                    "id": "g47q2o8",
                    "parent_id": "t1_g47lafs",
                    "score": 7,
                    "created_utc": 1599380207.0,
                    "replies": [
                        {
                            "body": "Ok. For SB’s what are the limits of the free option. \n\nI’m assuming maybe a couple messages and responses a day while paid option allows unlimited messages and responses.",
                            "author": "a1bells",
                            "id": "g47qrkk",
                            "parent_id": "t1_g47q2o8",
                            "score": 2,
                            "created_utc": 1599380945.0,
                            "replies": [
                                {
                                    "body": "Premium SB:\n\nCan communicate without a public profile photo\n\nCan communicate without an approved profile\n\nPriority over Standard Members in profile/photo approval process\n\nFeatured in search\n\nFeatured on the login page\n\nCan hide last login date and time\n\nCan hide last login country\n\nCan have up to 3 profile locations\n\nAbility to share your Wishlist\n\nCan see if a member has read their message\n\nCan see which members are Standard or Premium\n\nAccess to advanced search filters such as: Net Worth, Income, and Lifestyle Budget",
                                    "author": "KittenCalledKatt",
                                    "id": "g47qx17",
                                    "parent_id": "t1_g47qrkk",
                                    "score": 8,
                                    "created_utc": 1599381109.0,
                                    "replies": [
                                        {
                                            "body": "Ok got it. \n\n1) A free/standard SB what are their features? \n\n2) Does SA verify your profile and picture by asking for ID to prove who you are and how you look like to make sure your not using other people’s profiles?\n\n3) Net Worth and Income is details people may exaggerate to get more attention but does SA verify this somehow by asking for bank statements or proof and value of assets? What can stop me from signing up and putting my net worth as $100m?",
                                            "author": "a1bells",
                                            "id": "g47z44e",
                                            "parent_id": "t1_g47qx17",
                                            "score": 3,
                                            "created_utc": 1599390074.0,
                                            "replies": [
                                                {
                                                    "body": "1) free SB can message anyone but can't see whether the SD is premium so may be messaging SD that can't read or reply to the message.  The filters are limited and they can't hide their activity (premium can look at profiles without showing on the SDs viewed by list, can hide the last login info and join date etc)\n\n2) SA requires some to send ID based on previous posts here but I have never had to nor would I send my ID to them\n\n3) there is no income verification.  It's a drop down box when they fill out the profile much like height or marital status.  They can and do put whatever they want so take it with a grain of salt.",
                                                    "author": "tamenwild",
                                                    "id": "g487fpv",
                                                    "parent_id": "t1_g47z44e",
                                                    "score": 3,
                                                    "created_utc": 1599397676.0,
                                                    "replies": [
                                                        {
                                                            "body": "Ok so does a free SD always need to pay to see messages from SB’s? How much is a premium membership I assume they pay monthly.",
                                                            "author": "a1bells",
                                                            "id": "g48i0y8",
                                                            "parent_id": "t1_g487fpv",
                                                            "score": 1,
                                                            "created_utc": 1599404428.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Free  SDs can only look at profiles.  They can't message unless they pay the 90 bucks a month.  A SB with a .edu email can get free premium otherwise it's 20 bucks per month.",
                                                                    "author": "tamenwild",
                                                                    "id": "g48j40s",
                                                                    "parent_id": "t1_g48i0y8",
                                                                    "score": 2,
                                                                    "created_utc": 1599404864.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "90 bucks a month seems a bit expensive. They must be capitalising on guys who are desperate for women.",
                                                                            "author": "a1bells",
                                                                            "id": "g48n737",
                                                                            "parent_id": "t1_g48j40s",
                                                                            "score": 0,
                                                                            "created_utc": 1599406868.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "They are supposed to be well off men. If 90 bucks is too much than they probably shouldn't be a SD.  But also they probably only pay for a month or two.  Once they find a SB they usually go back to free status.  Can you imagine the scammers and John's that would be on there if it were 20 bucks for SDs. It would make it unusable.",
                                                                                    "author": "tamenwild",
                                                                                    "id": "g48o08t",
                                                                                    "parent_id": "t1_g48n737",
                                                                                    "score": 4,
                                                                                    "created_utc": 1599407223.0,
                                                                                    "replies": []
                                                                                },
                                                                                {
                                                                                    "body": "Matchmaking services are much more expensive.",
                                                                                    "author": null,
                                                                                    "id": "g4bop6r",
                                                                                    "parent_id": "t1_g48n737",
                                                                                    "score": 2,
                                                                                    "created_utc": 1599481578.0,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "g487f7k",
            "parent_id": "t3_infoif",
            "score": -1,
            "created_utc": 1599397664.0,
            "replies": [
                {
                    "body": "I can’t tell you how many times I’ve been blasted on here, when talking about sb communication for saying resounding promptly is a big deal. I’ve gotten some SB’s really angry saying how busy they are and that they don’t have time to send back a text more than once a day.",
                    "author": "sdthrowout23",
                    "id": "g48g79h",
                    "parent_id": "t1_g487f7k",
                    "score": 3,
                    "created_utc": 1599403352.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "g48kyen",
                            "parent_id": "t1_g48g79h",
                            "score": 2,
                            "created_utc": 1599405734.0,
                            "replies": [
                                {
                                    "body": "Yep, agree.",
                                    "author": "sdthrowout23",
                                    "id": "g48l7lt",
                                    "parent_id": "t1_g48kyen",
                                    "score": 2,
                                    "created_utc": 1599405880.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Yep. I have my own private SS at my disposal.",
            "author": "sdthrowout23",
            "id": "g47cfkf",
            "parent_id": "t1_g47b064",
            "score": 25,
            "created_utc": 1599367382.0,
            "replies": [
                {
                    "body": "You're not paranoid if they're really out to get you.",
                    "author": "TY2022",
                    "id": "g47e0n0",
                    "parent_id": "t1_g47cfkf",
                    "score": 16,
                    "created_utc": 1599368673.0,
                    "replies": []
                },
                {
                    "body": "SS? As a World War II History expert this makes me think of that SS! Lol",
                    "author": "BigBearSD",
                    "id": "g47xddc",
                    "parent_id": "t1_g47cfkf",
                    "score": 6,
                    "created_utc": 1599388160.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "g49x7la",
                            "parent_id": "t1_g47xddc",
                            "score": -1,
                            "created_utc": 1599431183.0,
                            "replies": [
                                {
                                    "body": "Yeah, I saw your comment originally. Why do you miss the Schutzstaffel (the SS)? And why did you think to post that here of all places?",
                                    "author": "BigBearSD",
                                    "id": "g4bq48i",
                                    "parent_id": "t1_g49x7la",
                                    "score": 1,
                                    "created_utc": 1599482745.0,
                                    "replies": [
                                        {
                                            "body": "Yeah. That was an odd post to say the least.",
                                            "author": "sdthrowout23",
                                            "id": "g4cbw5j",
                                            "parent_id": "t1_g4bq48i",
                                            "score": 1,
                                            "created_utc": 1599493393.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "My thoughts as well.  \n\nThe reason SA is so polluted with \"bad actors\" is that Sugar Dating has become so popular and SA is really the only game in town.  It attracts all of the scammers, fakes, flakes, toe dippers, escorts, John's, pick up artists, salt daddies, vanilla boyfriends, online only, platonic only, femdoms, findoms, etc \n\nIt takes work to find real SDs and SBs, but it can be done and is still the best option available.",
            "author": "willfromvb",
            "id": "g47yx7x",
            "parent_id": "t1_g47bgpe",
            "score": 13,
            "created_utc": 1599389872.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "g49y2xa",
                    "parent_id": "t1_g47yx7x",
                    "score": 2,
                    "created_utc": 1599431677.0,
                    "replies": [
                        {
                            "body": "I missed feet pic sellers....lol",
                            "author": "willfromvb",
                            "id": "g49z7ur",
                            "parent_id": "t1_g49y2xa",
                            "score": 1,
                            "created_utc": 1599432360.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "g49zb75",
                                    "parent_id": "t1_g49z7ur",
                                    "score": 1,
                                    "created_utc": 1599432417.0,
                                    "replies": [
                                        {
                                            "body": "I include that as \"online only\".  Onlyfans is just one site used for online activities.",
                                            "author": "willfromvb",
                                            "id": "g4a1zj0",
                                            "parent_id": "t1_g49zb75",
                                            "score": 1,
                                            "created_utc": 1599434091.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Yeah. I get the whole hotel thing but we were texting literally up to a half hour till meeting and she said she was coming. I booked it at I think 430 and she to be there at 5. She didn’t want to go in together as it is a college town and for discretion reasons wanted to come in after me.\n\nEdit: as far as the underage thing I put most of that blame On seeking for being shit at verifying age. Require ID. End of story.",
            "author": "sdthrowout23",
            "id": "g47bo7s",
            "parent_id": "t1_g47bgpe",
            "score": 9,
            "created_utc": 1599366785.0,
            "replies": [
                {
                    "body": "Eh.... TBH that sounds like a hot load, if she's *THAT* worried... why is she not worried about being seen sitting with you at a table for an hour+ by the same staff & patrons that would be there when you walk in together?\n\nAnd while I get that it probably seemed legit, I've literally been ghosted while sitting at the table and still texting that \"they're on the way\" into the *positive* minutes (as in, past our scheduled meeting time) so again, until they're across the table, consider it a 50/50 shot of them showing up.",
                    "author": "sdaddy305",
                    "id": "g47bwun",
                    "parent_id": "t1_g47bo7s",
                    "score": 11,
                    "created_utc": 1599366972.0,
                    "replies": [
                        {
                            "body": "You may have missed it in my word wall...dinner was going to be at the hotel. Uber eats. We decided to stay in due to COVID. At least I got a nice meal for lunch tomorrow",
                            "author": "sdthrowout23",
                            "id": "g47c0zw",
                            "parent_id": "t1_g47bwun",
                            "score": 8,
                            "created_utc": 1599367062.0,
                            "replies": [
                                {
                                    "body": "AH! No, I'd seen the \"At the hotel\" bit, I just wrongly assumed that you were having dinner at the hotel restaurant, not ordering in!\n\nAnd yeah, that's always been my \"consolation prize\" lol... a nice meal at least lol!",
                                    "author": "sdaddy305",
                                    "id": "g47c5l8",
                                    "parent_id": "t1_g47c0zw",
                                    "score": 11,
                                    "created_utc": 1599367164.0,
                                    "replies": []
                                },
                                {
                                    "body": "Next time I know you will wait to order until she comes (appears)",
                                    "author": "rickrat",
                                    "id": "g480gn6",
                                    "parent_id": "t1_g47c0zw",
                                    "score": 4,
                                    "created_utc": 1599391501.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "How about we blame seeking and the other people. When 95% of my interactions are like this it isn’t me.",
            "author": "sdthrowout23",
            "id": "g48gmco",
            "parent_id": "t1_g47xvf9",
            "score": -7,
            "created_utc": 1599403604.0,
            "replies": [
                {
                    "body": "It's just not productive to blame SA. You can't magically fix the site - the only thing you can do is to modify your own behavior. So, you have to *plan* for people to flake out and/or scam you. That comment above is giving you some constructive criticism as to what you can do to avoid these problems in the future.",
                    "author": "CentralPaSD",
                    "id": "g48tj2c",
                    "parent_id": "t1_g48gmco",
                    "score": 6,
                    "created_utc": 1599409825.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "That was an all timer. I knew the next thing if I would have said “I am in my way” would have been asking for a cash app prepayment.",
            "author": "sdthrowout23",
            "id": "g47bybf",
            "parent_id": "t1_g47bvmc",
            "score": 8,
            "created_utc": 1599367003.0,
            "replies": []
        },
        {
            "body": "I have actually always had luck on SA. BUT, when I am on it I cast a wide net very quickly and whittle it down from there. I also spend hours a day on it when i do have a profile. I have never had a hard time finding an SB. However, yes, I did have to weed through a ton of bullshit all of those times, and was quick to block people. I would say if I messaged a few hundred women in my locale, I would get a little under half in responses. From there send a few messages, if it was like pulling teeth I would block. So that would lower the number to say in the twenties. From there if I didn't feel a spark, connection, chemsitry, shared outlook etc... whittled down more. In the end only left with at most a handful. And from there move to text. Whittle away more to a few. Meet the woman I feel has the best chance first. M&G. Things go well. Done. I wouldn't do an M&G with just anyone. Had to get a feel of them and be able to talk to them easily before. \n\nBut yes SA is a shit show. Out of hundreds of messages I would at most have one or two M&Gs.\n\nEdit: I would also use filters in my search and filters in my messages. And more often than not I would keep my profile hidden from the search function so I wouldn't get swamped and so I only messaged women I was in to.",
            "author": "BigBearSD",
            "id": "g47xtzu",
            "parent_id": "t1_g47d11h",
            "score": 3,
            "created_utc": 1599388672.0,
            "replies": []
        },
        {
            "body": "I’m sure they will be here, or the people that say “maybe you’re the problem.”",
            "author": "sdthrowout23",
            "id": "g47d8v7",
            "parent_id": "t1_g47d11h",
            "score": 3,
            "created_utc": 1599368034.0,
            "replies": [
                {
                    "body": "Or “maybe you need a profile review.” 😂",
                    "author": "Nevrlrn",
                    "id": "g47dlo3",
                    "parent_id": "t1_g47d8v7",
                    "score": 6,
                    "created_utc": 1599368327.0,
                    "replies": []
                },
                {
                    "body": "It does seem odd given the 10:1 ratio some men here are constantly spouting emphasising how easy sugar is comparatively...",
                    "author": "blonde-throwaway",
                    "id": "g47sp2o",
                    "parent_id": "t1_g47d8v7",
                    "score": 6,
                    "created_utc": 1599383052.0,
                    "replies": []
                },
                {
                    "body": "One just popped in. They don’t bother to read the thread just promo SA when there’s a post pointing out how much it’s gone to the dogs. (Pun intended)",
                    "author": "Nevrlrn",
                    "id": "g47fmdc",
                    "parent_id": "t1_g47d8v7",
                    "score": 1,
                    "created_utc": 1599370047.0,
                    "replies": []
                },
                {
                    "body": "Indeed, we need to start calling them out when they are doing the promos for SA.",
                    "author": "Nevrlrn",
                    "id": "g47dgd5",
                    "parent_id": "t1_g47d8v7",
                    "score": 0,
                    "created_utc": 1599368203.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "But BUT there are 10 girls...I mean wait 100 girls for every boy on the website. Men can be so choosy because all the women are literally begging for any SD's attention.  Right, *rolling my eyes so HARD they might roll on off the back of my head.*",
            "author": null,
            "id": "g47jxch",
            "parent_id": "t1_g47jgii",
            "score": 5,
            "created_utc": 1599374023.0,
            "replies": [
                {
                    "body": "💯 😂",
                    "author": "angelhair12",
                    "id": "g4984us",
                    "parent_id": "t1_g47jxch",
                    "score": 3,
                    "created_utc": 1599417180.0,
                    "replies": []
                },
                {
                    "body": "I hear that all the time but I’ve never experienced it!Somehow my SD account (my friend’s but I have access) has 4 times less messages in the inbox than my SB account 🤷🏼‍♀️",
                    "author": "russianindianqueen",
                    "id": "g47klan",
                    "parent_id": "t1_g47jxch",
                    "score": 5,
                    "created_utc": 1599374657.0,
                    "replies": [
                        {
                            "body": "Guys online enjoy the fantasy of imagining the ratio exists where women must beg for their attention.",
                            "author": null,
                            "id": "g4853eo",
                            "parent_id": "t1_g47klan",
                            "score": 9,
                            "created_utc": 1599395809.0,
                            "replies": [
                                {
                                    "body": "Come on. This isn’t true at all. I also find it really damn ironic because women love online dating because they have to do literally zero work to get 100’s Of hits while a guy will get one response per 100 messages",
                                    "author": "sdthrowout23",
                                    "id": "g48ft2x",
                                    "parent_id": "t1_g4853eo",
                                    "score": 0,
                                    "created_utc": 1599403119.0,
                                    "replies": [
                                        {
                                            "body": "Poor men. )-: But, since dick isn't in short supply, it is what it is.",
                                            "author": null,
                                            "id": "g48j15c",
                                            "parent_id": "t1_g48ft2x",
                                            "score": 5,
                                            "created_utc": 1599404818.0,
                                            "replies": [
                                                {
                                                    "body": ">But, since dick isn't in short supply\n\nGood dick attached to muscular frames and intelligent minds is.",
                                                    "author": null,
                                                    "id": "g48w3f0",
                                                    "parent_id": "t1_g48j15c",
                                                    "score": 1,
                                                    "created_utc": 1599411030.0,
                                                    "replies": []
                                                },
                                                {
                                                    "body": "Lol. Got to love women that think they are God’s gift to the world.",
                                                    "author": "sdthrowout23",
                                                    "id": "g48jztm",
                                                    "parent_id": "t1_g48j15c",
                                                    "score": -4,
                                                    "created_utc": 1599405269.0,
                                                    "replies": [
                                                        {
                                                            "body": "Women are like flowers, they fill the world with beauty, and sometimes attract pests.",
                                                            "author": null,
                                                            "id": "g48suq7",
                                                            "parent_id": "t1_g48jztm",
                                                            "score": 3,
                                                            "created_utc": 1599409492.0,
                                                            "replies": [
                                                                {
                                                                    "body": "That ratio just simply does not exist and I have to explain it every time a post like this is made lmao. It's fantasy at best until anything comes of these profiles that you're interacting with it's all fake.  \n\n\nSuddenly that ratio looks about even.",
                                                                    "author": null,
                                                                    "id": "g4bn0by",
                                                                    "parent_id": "t1_g48suq7",
                                                                    "score": 4,
                                                                    "created_utc": 1599480074.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "Well, whats the profile text like on your fake SD account?\n\nThe ratios are still there, just keep in mind a lot of SBs dont initiate conversations (habit I guess).\n\nThen finally the real question, what percentage of the guys that message you are not johns or scammers.\n\nThat said, even with the ratio I'm less than thrilled with SA now days.",
                            "author": null,
                            "id": "g47wpqs",
                            "parent_id": "t1_g47klan",
                            "score": 5,
                            "created_utc": 1599387443.0,
                            "replies": [
                                {
                                    "body": "It’s not a fake account 😘",
                                    "author": "russianindianqueen",
                                    "id": "g48wlxp",
                                    "parent_id": "t1_g47wpqs",
                                    "score": 2,
                                    "created_utc": 1599411305.0,
                                    "replies": [
                                        {
                                            "body": "Ah, I assumed it was an account to check out the competition.",
                                            "author": null,
                                            "id": "g4985kh",
                                            "parent_id": "t1_g48wlxp",
                                            "score": 0,
                                            "created_utc": 1599417191.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "I NEVER have women initiating with me.",
                            "author": "sdthrowout23",
                            "id": "g48eyey",
                            "parent_id": "t1_g47klan",
                            "score": 1,
                            "created_utc": 1599402609.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "I can easily get a SB in a few days at the very most. Finding a quality SB however really is quite difficult and I have to throw back a bunch to get that one good one.",
                    "author": null,
                    "id": "g48rb4p",
                    "parent_id": "t1_g47jxch",
                    "score": 0,
                    "created_utc": 1599408787.0,
                    "replies": [
                        {
                            "body": "Of course you can, dear. Just like those tall tales of, 'catching the big one' fishermen's stories we have all heard.",
                            "author": null,
                            "id": "g48u0ej",
                            "parent_id": "t1_g48rb4p",
                            "score": 3,
                            "created_utc": 1599410045.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I’d really like to see these sites held responsible subtle for allowing minors on the site. It is asinine that on tinder a 20 year old can go to jail and force to go on a registry because some girl lied about age and tinder faces zero consequences\n\nAlso, we need to change the laws. This might not be popular on here but the 16 or 17 year old that goes on dating websites to meet older men and says she is 20 is a predator.",
            "author": "sdthrowout23",
            "id": "g48evqh",
            "parent_id": "t1_g47jgii",
            "score": -1,
            "created_utc": 1599402566.0,
            "replies": [
                {
                    "body": "Maybe you should ask to meet at a bar for cocktails, if you’re so concerned it’s your responsibility to check ID. Otherwise try an escort site! There’s lots of verified providers on escort sites! I think 10x less people would be on seeking if ID was required to register.",
                    "author": "russianindianqueen",
                    "id": "g48x0c0",
                    "parent_id": "t1_g48evqh",
                    "score": 4,
                    "created_utc": 1599411528.0,
                    "replies": [
                        {
                            "body": "This. Many love to skate that fine line with 18-19-20-year-olds. Just seems like a safer bet to date someone who can have wine with their meal.\n\nThe woe-is-me-isms is the price you pay for the risk.",
                            "author": null,
                            "id": "g4bn86c",
                            "parent_id": "t1_g48x0c0",
                            "score": 2,
                            "created_utc": 1599480266.0,
                            "replies": [
                                {
                                    "body": "Lol. I guarantee you are a 30 year old SB who is just pissed most guys want younger.",
                                    "author": "sdthrowout23",
                                    "id": "g4cc424",
                                    "parent_id": "t1_g4bn86c",
                                    "score": 0,
                                    "created_utc": 1599493482.0,
                                    "replies": [
                                        {
                                            "body": "I guarantee you - no girl over 25 would put up with your crap.",
                                            "author": "angelhair12",
                                            "id": "g4cdgcx",
                                            "parent_id": "t1_g4cc424",
                                            "score": 3,
                                            "created_utc": 1599494005.0,
                                            "replies": [
                                                {
                                                    "body": "What crap is that? Being pissed off she ghosted me 5 minutes before we were supposed to meet.",
                                                    "author": "sdthrowout23",
                                                    "id": "g4cepnw",
                                                    "parent_id": "t1_g4cdgcx",
                                                    "score": 0,
                                                    "created_utc": 1599494533.0,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "body": "What a great way to spend your mental capacity, wish you would have gone in with the same effort to screen your pot. :)  \n\n\nMy mother just left her 30's though; I'll be sure to ask her how she's dealt with the menopausal '30s. 🤣",
                                            "author": null,
                                            "id": "g6ackr5",
                                            "parent_id": "t1_g4cc424",
                                            "score": 2,
                                            "created_utc": 1600833810.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "While I agree with several of your general points, a 16 or 17 year old that legally is still considered not an adult and has a less developed brain than you is a “predator” for joining a website lol? Sounds like a confused teenager exploring the internet, not a predator. \n\nWhy is it the site’s responsibility anymore than you to check ID anyway? The law says it’s going to be your responsibility to check either way before you engage in anything sexual, so time to take some personal responsibility. Not going to say that the site can’t do more here, but you seem to want to blame some of your mistakes on SA when the mistakes are yours to prevent",
                    "author": null,
                    "id": "g48xj6i",
                    "parent_id": "t1_g48evqh",
                    "score": 3,
                    "created_utc": 1599411806.0,
                    "replies": [
                        {
                            "body": "I always check Id but fake ids are a thing. I can only go so far where a website can do a public records check potentially.",
                            "author": "sdthrowout23",
                            "id": "g4911hw",
                            "parent_id": "t1_g48xj6i",
                            "score": 1,
                            "created_utc": 1599413501.0,
                            "replies": [
                                {
                                    "body": "If fake IDs are a problem they are going to be a problem for SA too. \n\nAt least in the US, no one is going to blame a website for not checking IDs when you are the older man that gets caught trying to sleep with an underage girl you didn’t vet. It will be your life that is ruined in that situation, not SA’s company so learn to have your own back. You do a public records search if your skeptical, it’s your ass on the line",
                                    "author": null,
                                    "id": "g491jfn",
                                    "parent_id": "t1_g4911hw",
                                    "score": 2,
                                    "created_utc": 1599413751.0,
                                    "replies": []
                                },
                                {
                                    "body": "I mean, dude, it's 2020, kids are not buying fake IDs in droves. Kids can get drunk and smoke whatever they want at home. It's just how Gen-Z does it. It's so rare to run into this SPECIFIC scenario of your 16-year-old sugar baby having a fake ID. \n\nYou have to screen better and or date older.",
                                    "author": null,
                                    "id": "g4bnr8z",
                                    "parent_id": "t1_g4911hw",
                                    "score": 2,
                                    "created_utc": 1599480741.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Doesn't that depend on which state you are in?",
            "author": null,
            "id": "g47ye20",
            "parent_id": "t1_g47jgii",
            "score": 0,
            "created_utc": 1599389295.0,
            "replies": [
                {
                    "body": "In any state or country it is legal for a minor and an adult to meet. If there is physical intimacy only then it falls under statutory rape. I had teachers in high school take me out for lunch. Probably had a creepy crush on me. Not illegal tho",
                    "author": "russianindianqueen",
                    "id": "g499car",
                    "parent_id": "t1_g47ye20",
                    "score": 1,
                    "created_utc": 1599417842.0,
                    "replies": [
                        {
                            "body": "But like age of consent is 16 in like .... a lot of states? dunno, I'm not out here trying to smash 16 years olds but that doesn't bother anyone?",
                            "author": null,
                            "id": "g4apwy3",
                            "parent_id": "t1_g499car",
                            "score": 0,
                            "created_utc": 1599449086.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "This has been discussed for years, but really isn't practical.  Most of the issues people have with SA, aren't because of SA.  It's mostly because of the \"f*cked up\" laws in the US.  Any successful competitor would have to deal with the same issues.",
            "author": "willfromvb",
            "id": "g47ynjc",
            "parent_id": "t1_g47ge6i",
            "score": 10,
            "created_utc": 1599389582.0,
            "replies": [
                {
                    "body": "I'd argue a bit on that one.\n\n\"Most of the issues,\" from what I've seen, are:\n\n* FAKES\n* Underaged people\n* Bots\n* Slow/nonfunctioning messenger\n* Ugly UI\n* Limited search options\n* No female category to separate \"\"\"\"curvy\"\"\"\" from \"embracing obese\"\n\nAnd these are long-running issues. Easily fixed in a week or two by a competent developer(s).",
                    "author": "yeehaw_yall",
                    "id": "g49epru",
                    "parent_id": "t1_g47ynjc",
                    "score": 0,
                    "created_utc": 1599420819.0,
                    "replies": [
                        {
                            "body": "Forgot to ad pre & post op trans people.\n\nHave trans friends, I am just not interested in sex with trans people.",
                            "author": "mollyflowers",
                            "id": "g49zm13",
                            "parent_id": "t1_g49epru",
                            "score": 1,
                            "created_utc": 1599432600.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "We already had a m&g",
            "author": "sdthrowout23",
            "id": "g48eotu",
            "parent_id": "t1_g4849h0",
            "score": 1,
            "created_utc": 1599402454.0,
            "replies": [
                {
                    "body": "I see.\n\nSucks.....usually SBs get 1 **whoops** this would be her whoops .\n\nbest of luck",
                    "author": "bookworm010101",
                    "id": "g48euyd",
                    "parent_id": "t1_g48eotu",
                    "score": 2,
                    "created_utc": 1599402554.0,
                    "replies": [
                        {
                            "body": "Nah. She told me she was sick...then posted on Snapchat a picture of a giant greasy hoagie she was eating later that night. That is a block,",
                            "author": "sdthrowout23",
                            "id": "g48ggrz",
                            "parent_id": "t1_g48euyd",
                            "score": 6,
                            "created_utc": 1599403511.0,
                            "replies": [
                                {
                                    "body": "Agreed.",
                                    "author": "bookworm010101",
                                    "id": "g48h1d3",
                                    "parent_id": "t1_g48ggrz",
                                    "score": 1,
                                    "created_utc": 1599403856.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I'm late 40's & the dating scene for my age sucks.  I don't find women 45 plus attractive & the few I do find attractive have 10 guys chasing them.  \n\nSA allows me to sugar date young hot 20 somethings which I'm good with.",
            "author": "mollyflowers",
            "id": "g49zte0",
            "parent_id": "t1_g48txqy",
            "score": 3,
            "created_utc": 1599432727.0,
            "replies": []
        },
        {
            "body": "Because she would have known it was a train station and not a warehouse,",
            "author": "sdthrowout23",
            "id": "g48fw44",
            "parent_id": "t1_g47gxxq",
            "score": 5,
            "created_utc": 1599403168.0,
            "replies": []
        },
        {
            "body": "Someone gets it! 🏆",
            "author": null,
            "id": "g48axo1",
            "parent_id": "t1_g48apaz",
            "score": 0,
            "created_utc": 1599400121.0,
            "replies": []
        },
        {
            "body": "White knight!",
            "author": "sdthrowout23",
            "id": "g48ecn5",
            "parent_id": "t1_g48apaz",
            "score": -2,
            "created_utc": 1599402251.0,
            "replies": []
        },
        {
            "body": "What other options are there",
            "author": "lloydSF",
            "id": "g47u1qm",
            "parent_id": "t1_g47en8v",
            "score": 1,
            "created_utc": 1599384535.0,
            "replies": []
        },
        {
            "body": "Wow is this the same writing style used on the SA website for FAQ’s and pointers? \n\nIf it walks like a duck and sounds like a duck.....",
            "author": "Nevrlrn",
            "id": "g48lnp0",
            "parent_id": "t1_g48f6ep",
            "score": 1,
            "created_utc": 1599406123.0,
            "replies": []
        },
        {
            "body": "We were communicating up to 30 minutes before we were to meet. I didn’t book the hotel till that point.\n\nAlso, what is too rushed? We had a m&g then set a first date? That seems pretty standard??",
            "author": "sdthrowout23",
            "id": "g48gd0o",
            "parent_id": "t1_g48f6ep",
            "score": 0,
            "created_utc": 1599403448.0,
            "replies": [
                {
                    "body": "Well clearly it was too rushed for her. It literally made her sick to her stomach after she canceled she prob felt better and ordered the hoagie.",
                    "author": "angelhair12",
                    "id": "g49adzv",
                    "parent_id": "t1_g48gd0o",
                    "score": 2,
                    "created_utc": 1599418412.0,
                    "replies": [
                        {
                            "body": "A lot of you women on here are really shitty fucking people.",
                            "author": "sdthrowout23",
                            "id": "g49jy89",
                            "parent_id": "t1_g49adzv",
                            "score": 1,
                            "created_utc": 1599423716.0,
                            "replies": [
                                {
                                    "body": "Wow. I’m trying to explain to you a girl has feel comfortable before she sleeps with you, something you should know but you don’t seem to care.\n\nI’m so sorry not everyone is going to cater to your delusions.",
                                    "author": "angelhair12",
                                    "id": "g49ljf2",
                                    "parent_id": "t1_g49jy89",
                                    "score": 4,
                                    "created_utc": 1599424601.0,
                                    "replies": [
                                        {
                                            "body": "SA sucks because there isn't a flock of women on there who wants to sleep with me in my hotel right away, I already ordered her dinner, where the hell is she? Someone call the manager! 😂 This is what I see every time I check this subreddit.",
                                            "author": null,
                                            "id": "g4boi7u",
                                            "parent_id": "t1_g49ljf2",
                                            "score": 4,
                                            "created_utc": 1599481406.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "Yes...don’t blame her for saying up to 30 minutes before she was ok with meeting.",
                                            "author": "sdthrowout23",
                                            "id": "g49qkp0",
                                            "parent_id": "t1_g49ljf2",
                                            "score": 0,
                                            "created_utc": 1599427429.0,
                                            "replies": [
                                                {
                                                    "body": "She probably needed the money and thought she go through with it but you have such negative energy and are so off putting she couldn’t go through with it. \n\nShe made the right call. You’re the typical angry unmarried guy in your 30’s most girls wouldn’t touch for any amount of $$.",
                                                    "author": "angelhair12",
                                                    "id": "g49rhq7",
                                                    "parent_id": "t1_g49qkp0",
                                                    "score": 4,
                                                    "created_utc": 1599427953.0,
                                                    "replies": [
                                                        {
                                                            "body": "You’re a cry baby too, gets even better lol. \nYou were the one who started calling me a shi*y person, remember!",
                                                            "author": "angelhair12",
                                                            "id": "g49tf9t",
                                                            "parent_id": "t1_g49rhq7",
                                                            "score": 3,
                                                            "created_utc": 1599429051.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Don’t even go there. You immediately insulted me by saying the thought of sex with me made her sick.",
                                                                    "author": "sdthrowout23",
                                                                    "id": "g49wv9i",
                                                                    "parent_id": "t1_g49tf9t",
                                                                    "score": 0,
                                                                    "created_utc": 1599430989.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "It may be an insult to you, but it is a different perspective none-the-less. If she was truly young and naive she may have gotten herself above her own head.",
                                                                            "author": null,
                                                                            "id": "g4bom38",
                                                                            "parent_id": "t1_g49wv9i",
                                                                            "score": 3,
                                                                            "created_utc": 1599481502.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "Always always always making excuses for shitty behavior. Also excusing the OP who said the thought of intimacy made her sick.",
                                                                                    "author": "sdthrowout23",
                                                                                    "id": "g4cbs20",
                                                                                    "parent_id": "t1_g4bom38",
                                                                                    "score": 1,
                                                                                    "created_utc": 1599493351.0,
                                                                                    "replies": []
                                                                                },
                                                                                {
                                                                                    "body": "Exactly how I meant it. This guy takes things too personally instead of learning.",
                                                                                    "author": "angelhair12",
                                                                                    "id": "g4dzxra",
                                                                                    "parent_id": "t1_g4bom38",
                                                                                    "score": 1,
                                                                                    "created_utc": 1599520420.0,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "body": "Lol. Mods, why does shit like this not get posters banned?",
                                                            "author": "sdthrowout23",
                                                            "id": "g49t0r5",
                                                            "parent_id": "t1_g49rhq7",
                                                            "score": 0,
                                                            "created_utc": 1599428823.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "Try freestyle, much less entitlement and at least you know what you're getting beforehand. I basically stopped using SA because it was such an enormous time waster.",
                                    "author": "alwaysawoke",
                                    "id": "g4a7zjf",
                                    "parent_id": "t1_g49jy89",
                                    "score": 2,
                                    "created_utc": 1599437924.0,
                                    "replies": [
                                        {
                                            "body": "I find that people who don't freestyle are usually not freestyle material. Meaning that what to find quick and cheap sex and use text to manipulate their way through the end goal. Freestyling is a great way to get to know people while actually living life.",
                                            "author": null,
                                            "id": "g4bobi8",
                                            "parent_id": "t1_g4a7zjf",
                                            "score": 1,
                                            "created_utc": 1599481241.0,
                                            "replies": [
                                                {
                                                    "body": "Probably why I dont fit in well here. I dont fit the stereotypical socially awkward, emotionally stunted unattractive SD.\nAlso if that's the goal why not get an escort?",
                                                    "author": "alwaysawoke",
                                                    "id": "g4c1kuo",
                                                    "parent_id": "t1_g4bobi8",
                                                    "score": 3,
                                                    "created_utc": 1599488932.0,
                                                    "replies": [
                                                        {
                                                            "body": "For logistics, I guess.",
                                                            "author": null,
                                                            "id": "g6acr55",
                                                            "parent_id": "t1_g4c1kuo",
                                                            "score": 1,
                                                            "created_utc": 1600833931.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Got it. How does that experience have anything to do with the site? Is the site responsible for your SBs schedule?",
                    "author": null,
                    "id": "g48jmzp",
                    "parent_id": "t1_g48gd0o",
                    "score": 1,
                    "created_utc": 1599405123.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I had a girl, who was real and from my city, go after me for 5 dollars for an only fans sub. I took the chance since I could confirm she was real but she ghosted me after I paid lol.",
            "author": "sdthrowout23",
            "id": "g4a00p4",
            "parent_id": "t1_g49zh5l",
            "score": 1,
            "created_utc": 1599432853.0,
            "replies": [
                {
                    "body": "Actually the hottest SB I found recently has a fan's only & approached me about doing a oral sex video for her only fans.   I might take her up on it, as it be me receiving oral sex my face will not be shown.",
                    "author": "mollyflowers",
                    "id": "g4a0i88",
                    "parent_id": "t1_g4a00p4",
                    "score": 2,
                    "created_utc": 1599433158.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I’m 35. I’m not upping into the 30’s.",
            "author": "sdthrowout23",
            "id": "g48fyw5",
            "parent_id": "t1_g47zn9y",
            "score": 3,
            "created_utc": 1599403214.0,
            "replies": [
                {
                    "body": "Why not? Women in their 30s are very much viable as potential SBs.",
                    "author": "earth-to-matilda",
                    "id": "g48lrcv",
                    "parent_id": "t1_g48fyw5",
                    "score": 0,
                    "created_utc": 1599406181.0,
                    "replies": [
                        {
                            "body": "I’d just date them.",
                            "author": "sdthrowout23",
                            "id": "g48uhxb",
                            "parent_id": "t1_g48lrcv",
                            "score": 0,
                            "created_utc": 1599410310.0,
                            "replies": [
                                {
                                    "body": "I get that. I'm in my low 40s and I'll stretch up to the mid 30s or so because a diamond in the rough might present herself...but most of my wheelhouse is 21-25.\n\n&#x200B;\n\nAs was said before, your issues tend more toward your lack of ability to screen, rather than the shortcomings of SA itself.",
                                    "author": "earth-to-matilda",
                                    "id": "g48vvsl",
                                    "parent_id": "t1_g48uhxb",
                                    "score": 2,
                                    "created_utc": 1599410959.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "SDs have to pay to message users. SBs have a free or paid option.",
            "author": "KittenCalledKatt",
            "id": "g47q2o8",
            "parent_id": "t1_g47lafs",
            "score": 7,
            "created_utc": 1599380207.0,
            "replies": [
                {
                    "body": "Ok. For SB’s what are the limits of the free option. \n\nI’m assuming maybe a couple messages and responses a day while paid option allows unlimited messages and responses.",
                    "author": "a1bells",
                    "id": "g47qrkk",
                    "parent_id": "t1_g47q2o8",
                    "score": 2,
                    "created_utc": 1599380945.0,
                    "replies": [
                        {
                            "body": "Premium SB:\n\nCan communicate without a public profile photo\n\nCan communicate without an approved profile\n\nPriority over Standard Members in profile/photo approval process\n\nFeatured in search\n\nFeatured on the login page\n\nCan hide last login date and time\n\nCan hide last login country\n\nCan have up to 3 profile locations\n\nAbility to share your Wishlist\n\nCan see if a member has read their message\n\nCan see which members are Standard or Premium\n\nAccess to advanced search filters such as: Net Worth, Income, and Lifestyle Budget",
                            "author": "KittenCalledKatt",
                            "id": "g47qx17",
                            "parent_id": "t1_g47qrkk",
                            "score": 8,
                            "created_utc": 1599381109.0,
                            "replies": [
                                {
                                    "body": "Ok got it. \n\n1) A free/standard SB what are their features? \n\n2) Does SA verify your profile and picture by asking for ID to prove who you are and how you look like to make sure your not using other people’s profiles?\n\n3) Net Worth and Income is details people may exaggerate to get more attention but does SA verify this somehow by asking for bank statements or proof and value of assets? What can stop me from signing up and putting my net worth as $100m?",
                                    "author": "a1bells",
                                    "id": "g47z44e",
                                    "parent_id": "t1_g47qx17",
                                    "score": 3,
                                    "created_utc": 1599390074.0,
                                    "replies": [
                                        {
                                            "body": "1) free SB can message anyone but can't see whether the SD is premium so may be messaging SD that can't read or reply to the message.  The filters are limited and they can't hide their activity (premium can look at profiles without showing on the SDs viewed by list, can hide the last login info and join date etc)\n\n2) SA requires some to send ID based on previous posts here but I have never had to nor would I send my ID to them\n\n3) there is no income verification.  It's a drop down box when they fill out the profile much like height or marital status.  They can and do put whatever they want so take it with a grain of salt.",
                                            "author": "tamenwild",
                                            "id": "g487fpv",
                                            "parent_id": "t1_g47z44e",
                                            "score": 3,
                                            "created_utc": 1599397676.0,
                                            "replies": [
                                                {
                                                    "body": "Ok so does a free SD always need to pay to see messages from SB’s? How much is a premium membership I assume they pay monthly.",
                                                    "author": "a1bells",
                                                    "id": "g48i0y8",
                                                    "parent_id": "t1_g487fpv",
                                                    "score": 1,
                                                    "created_utc": 1599404428.0,
                                                    "replies": [
                                                        {
                                                            "body": "Free  SDs can only look at profiles.  They can't message unless they pay the 90 bucks a month.  A SB with a .edu email can get free premium otherwise it's 20 bucks per month.",
                                                            "author": "tamenwild",
                                                            "id": "g48j40s",
                                                            "parent_id": "t1_g48i0y8",
                                                            "score": 2,
                                                            "created_utc": 1599404864.0,
                                                            "replies": [
                                                                {
                                                                    "body": "90 bucks a month seems a bit expensive. They must be capitalising on guys who are desperate for women.",
                                                                    "author": "a1bells",
                                                                    "id": "g48n737",
                                                                    "parent_id": "t1_g48j40s",
                                                                    "score": 0,
                                                                    "created_utc": 1599406868.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "They are supposed to be well off men. If 90 bucks is too much than they probably shouldn't be a SD.  But also they probably only pay for a month or two.  Once they find a SB they usually go back to free status.  Can you imagine the scammers and John's that would be on there if it were 20 bucks for SDs. It would make it unusable.",
                                                                            "author": "tamenwild",
                                                                            "id": "g48o08t",
                                                                            "parent_id": "t1_g48n737",
                                                                            "score": 4,
                                                                            "created_utc": 1599407223.0,
                                                                            "replies": []
                                                                        },
                                                                        {
                                                                            "body": "Matchmaking services are much more expensive.",
                                                                            "author": null,
                                                                            "id": "g4bop6r",
                                                                            "parent_id": "t1_g48n737",
                                                                            "score": 2,
                                                                            "created_utc": 1599481578.0,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I can’t tell you how many times I’ve been blasted on here, when talking about sb communication for saying resounding promptly is a big deal. I’ve gotten some SB’s really angry saying how busy they are and that they don’t have time to send back a text more than once a day.",
            "author": "sdthrowout23",
            "id": "g48g79h",
            "parent_id": "t1_g487f7k",
            "score": 3,
            "created_utc": 1599403352.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "g48kyen",
                    "parent_id": "t1_g48g79h",
                    "score": 2,
                    "created_utc": 1599405734.0,
                    "replies": [
                        {
                            "body": "Yep, agree.",
                            "author": "sdthrowout23",
                            "id": "g48l7lt",
                            "parent_id": "t1_g48kyen",
                            "score": 2,
                            "created_utc": 1599405880.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "You're not paranoid if they're really out to get you.",
            "author": "TY2022",
            "id": "g47e0n0",
            "parent_id": "t1_g47cfkf",
            "score": 16,
            "created_utc": 1599368673.0,
            "replies": []
        },
        {
            "body": "SS? As a World War II History expert this makes me think of that SS! Lol",
            "author": "BigBearSD",
            "id": "g47xddc",
            "parent_id": "t1_g47cfkf",
            "score": 6,
            "created_utc": 1599388160.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "g49x7la",
                    "parent_id": "t1_g47xddc",
                    "score": -1,
                    "created_utc": 1599431183.0,
                    "replies": [
                        {
                            "body": "Yeah, I saw your comment originally. Why do you miss the Schutzstaffel (the SS)? And why did you think to post that here of all places?",
                            "author": "BigBearSD",
                            "id": "g4bq48i",
                            "parent_id": "t1_g49x7la",
                            "score": 1,
                            "created_utc": 1599482745.0,
                            "replies": [
                                {
                                    "body": "Yeah. That was an odd post to say the least.",
                                    "author": "sdthrowout23",
                                    "id": "g4cbw5j",
                                    "parent_id": "t1_g4bq48i",
                                    "score": 1,
                                    "created_utc": 1599493393.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "g49y2xa",
            "parent_id": "t1_g47yx7x",
            "score": 2,
            "created_utc": 1599431677.0,
            "replies": [
                {
                    "body": "I missed feet pic sellers....lol",
                    "author": "willfromvb",
                    "id": "g49z7ur",
                    "parent_id": "t1_g49y2xa",
                    "score": 1,
                    "created_utc": 1599432360.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "g49zb75",
                            "parent_id": "t1_g49z7ur",
                            "score": 1,
                            "created_utc": 1599432417.0,
                            "replies": [
                                {
                                    "body": "I include that as \"online only\".  Onlyfans is just one site used for online activities.",
                                    "author": "willfromvb",
                                    "id": "g4a1zj0",
                                    "parent_id": "t1_g49zb75",
                                    "score": 1,
                                    "created_utc": 1599434091.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Eh.... TBH that sounds like a hot load, if she's *THAT* worried... why is she not worried about being seen sitting with you at a table for an hour+ by the same staff & patrons that would be there when you walk in together?\n\nAnd while I get that it probably seemed legit, I've literally been ghosted while sitting at the table and still texting that \"they're on the way\" into the *positive* minutes (as in, past our scheduled meeting time) so again, until they're across the table, consider it a 50/50 shot of them showing up.",
            "author": "sdaddy305",
            "id": "g47bwun",
            "parent_id": "t1_g47bo7s",
            "score": 11,
            "created_utc": 1599366972.0,
            "replies": [
                {
                    "body": "You may have missed it in my word wall...dinner was going to be at the hotel. Uber eats. We decided to stay in due to COVID. At least I got a nice meal for lunch tomorrow",
                    "author": "sdthrowout23",
                    "id": "g47c0zw",
                    "parent_id": "t1_g47bwun",
                    "score": 8,
                    "created_utc": 1599367062.0,
                    "replies": [
                        {
                            "body": "AH! No, I'd seen the \"At the hotel\" bit, I just wrongly assumed that you were having dinner at the hotel restaurant, not ordering in!\n\nAnd yeah, that's always been my \"consolation prize\" lol... a nice meal at least lol!",
                            "author": "sdaddy305",
                            "id": "g47c5l8",
                            "parent_id": "t1_g47c0zw",
                            "score": 11,
                            "created_utc": 1599367164.0,
                            "replies": []
                        },
                        {
                            "body": "Next time I know you will wait to order until she comes (appears)",
                            "author": "rickrat",
                            "id": "g480gn6",
                            "parent_id": "t1_g47c0zw",
                            "score": 4,
                            "created_utc": 1599391501.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "It's just not productive to blame SA. You can't magically fix the site - the only thing you can do is to modify your own behavior. So, you have to *plan* for people to flake out and/or scam you. That comment above is giving you some constructive criticism as to what you can do to avoid these problems in the future.",
            "author": "CentralPaSD",
            "id": "g48tj2c",
            "parent_id": "t1_g48gmco",
            "score": 6,
            "created_utc": 1599409825.0,
            "replies": []
        },
        {
            "body": "Or “maybe you need a profile review.” 😂",
            "author": "Nevrlrn",
            "id": "g47dlo3",
            "parent_id": "t1_g47d8v7",
            "score": 6,
            "created_utc": 1599368327.0,
            "replies": []
        },
        {
            "body": "It does seem odd given the 10:1 ratio some men here are constantly spouting emphasising how easy sugar is comparatively...",
            "author": "blonde-throwaway",
            "id": "g47sp2o",
            "parent_id": "t1_g47d8v7",
            "score": 6,
            "created_utc": 1599383052.0,
            "replies": []
        },
        {
            "body": "One just popped in. They don’t bother to read the thread just promo SA when there’s a post pointing out how much it’s gone to the dogs. (Pun intended)",
            "author": "Nevrlrn",
            "id": "g47fmdc",
            "parent_id": "t1_g47d8v7",
            "score": 1,
            "created_utc": 1599370047.0,
            "replies": []
        },
        {
            "body": "Indeed, we need to start calling them out when they are doing the promos for SA.",
            "author": "Nevrlrn",
            "id": "g47dgd5",
            "parent_id": "t1_g47d8v7",
            "score": 0,
            "created_utc": 1599368203.0,
            "replies": []
        },
        {
            "body": "💯 😂",
            "author": "angelhair12",
            "id": "g4984us",
            "parent_id": "t1_g47jxch",
            "score": 3,
            "created_utc": 1599417180.0,
            "replies": []
        },
        {
            "body": "I hear that all the time but I’ve never experienced it!Somehow my SD account (my friend’s but I have access) has 4 times less messages in the inbox than my SB account 🤷🏼‍♀️",
            "author": "russianindianqueen",
            "id": "g47klan",
            "parent_id": "t1_g47jxch",
            "score": 5,
            "created_utc": 1599374657.0,
            "replies": [
                {
                    "body": "Guys online enjoy the fantasy of imagining the ratio exists where women must beg for their attention.",
                    "author": null,
                    "id": "g4853eo",
                    "parent_id": "t1_g47klan",
                    "score": 9,
                    "created_utc": 1599395809.0,
                    "replies": [
                        {
                            "body": "Come on. This isn’t true at all. I also find it really damn ironic because women love online dating because they have to do literally zero work to get 100’s Of hits while a guy will get one response per 100 messages",
                            "author": "sdthrowout23",
                            "id": "g48ft2x",
                            "parent_id": "t1_g4853eo",
                            "score": 0,
                            "created_utc": 1599403119.0,
                            "replies": [
                                {
                                    "body": "Poor men. )-: But, since dick isn't in short supply, it is what it is.",
                                    "author": null,
                                    "id": "g48j15c",
                                    "parent_id": "t1_g48ft2x",
                                    "score": 5,
                                    "created_utc": 1599404818.0,
                                    "replies": [
                                        {
                                            "body": ">But, since dick isn't in short supply\n\nGood dick attached to muscular frames and intelligent minds is.",
                                            "author": null,
                                            "id": "g48w3f0",
                                            "parent_id": "t1_g48j15c",
                                            "score": 1,
                                            "created_utc": 1599411030.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "Lol. Got to love women that think they are God’s gift to the world.",
                                            "author": "sdthrowout23",
                                            "id": "g48jztm",
                                            "parent_id": "t1_g48j15c",
                                            "score": -4,
                                            "created_utc": 1599405269.0,
                                            "replies": [
                                                {
                                                    "body": "Women are like flowers, they fill the world with beauty, and sometimes attract pests.",
                                                    "author": null,
                                                    "id": "g48suq7",
                                                    "parent_id": "t1_g48jztm",
                                                    "score": 3,
                                                    "created_utc": 1599409492.0,
                                                    "replies": [
                                                        {
                                                            "body": "That ratio just simply does not exist and I have to explain it every time a post like this is made lmao. It's fantasy at best until anything comes of these profiles that you're interacting with it's all fake.  \n\n\nSuddenly that ratio looks about even.",
                                                            "author": null,
                                                            "id": "g4bn0by",
                                                            "parent_id": "t1_g48suq7",
                                                            "score": 4,
                                                            "created_utc": 1599480074.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Well, whats the profile text like on your fake SD account?\n\nThe ratios are still there, just keep in mind a lot of SBs dont initiate conversations (habit I guess).\n\nThen finally the real question, what percentage of the guys that message you are not johns or scammers.\n\nThat said, even with the ratio I'm less than thrilled with SA now days.",
                    "author": null,
                    "id": "g47wpqs",
                    "parent_id": "t1_g47klan",
                    "score": 5,
                    "created_utc": 1599387443.0,
                    "replies": [
                        {
                            "body": "It’s not a fake account 😘",
                            "author": "russianindianqueen",
                            "id": "g48wlxp",
                            "parent_id": "t1_g47wpqs",
                            "score": 2,
                            "created_utc": 1599411305.0,
                            "replies": [
                                {
                                    "body": "Ah, I assumed it was an account to check out the competition.",
                                    "author": null,
                                    "id": "g4985kh",
                                    "parent_id": "t1_g48wlxp",
                                    "score": 0,
                                    "created_utc": 1599417191.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "I NEVER have women initiating with me.",
                    "author": "sdthrowout23",
                    "id": "g48eyey",
                    "parent_id": "t1_g47klan",
                    "score": 1,
                    "created_utc": 1599402609.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I can easily get a SB in a few days at the very most. Finding a quality SB however really is quite difficult and I have to throw back a bunch to get that one good one.",
            "author": null,
            "id": "g48rb4p",
            "parent_id": "t1_g47jxch",
            "score": 0,
            "created_utc": 1599408787.0,
            "replies": [
                {
                    "body": "Of course you can, dear. Just like those tall tales of, 'catching the big one' fishermen's stories we have all heard.",
                    "author": null,
                    "id": "g48u0ej",
                    "parent_id": "t1_g48rb4p",
                    "score": 3,
                    "created_utc": 1599410045.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Maybe you should ask to meet at a bar for cocktails, if you’re so concerned it’s your responsibility to check ID. Otherwise try an escort site! There’s lots of verified providers on escort sites! I think 10x less people would be on seeking if ID was required to register.",
            "author": "russianindianqueen",
            "id": "g48x0c0",
            "parent_id": "t1_g48evqh",
            "score": 4,
            "created_utc": 1599411528.0,
            "replies": [
                {
                    "body": "This. Many love to skate that fine line with 18-19-20-year-olds. Just seems like a safer bet to date someone who can have wine with their meal.\n\nThe woe-is-me-isms is the price you pay for the risk.",
                    "author": null,
                    "id": "g4bn86c",
                    "parent_id": "t1_g48x0c0",
                    "score": 2,
                    "created_utc": 1599480266.0,
                    "replies": [
                        {
                            "body": "Lol. I guarantee you are a 30 year old SB who is just pissed most guys want younger.",
                            "author": "sdthrowout23",
                            "id": "g4cc424",
                            "parent_id": "t1_g4bn86c",
                            "score": 0,
                            "created_utc": 1599493482.0,
                            "replies": [
                                {
                                    "body": "I guarantee you - no girl over 25 would put up with your crap.",
                                    "author": "angelhair12",
                                    "id": "g4cdgcx",
                                    "parent_id": "t1_g4cc424",
                                    "score": 3,
                                    "created_utc": 1599494005.0,
                                    "replies": [
                                        {
                                            "body": "What crap is that? Being pissed off she ghosted me 5 minutes before we were supposed to meet.",
                                            "author": "sdthrowout23",
                                            "id": "g4cepnw",
                                            "parent_id": "t1_g4cdgcx",
                                            "score": 0,
                                            "created_utc": 1599494533.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "What a great way to spend your mental capacity, wish you would have gone in with the same effort to screen your pot. :)  \n\n\nMy mother just left her 30's though; I'll be sure to ask her how she's dealt with the menopausal '30s. 🤣",
                                    "author": null,
                                    "id": "g6ackr5",
                                    "parent_id": "t1_g4cc424",
                                    "score": 2,
                                    "created_utc": 1600833810.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "While I agree with several of your general points, a 16 or 17 year old that legally is still considered not an adult and has a less developed brain than you is a “predator” for joining a website lol? Sounds like a confused teenager exploring the internet, not a predator. \n\nWhy is it the site’s responsibility anymore than you to check ID anyway? The law says it’s going to be your responsibility to check either way before you engage in anything sexual, so time to take some personal responsibility. Not going to say that the site can’t do more here, but you seem to want to blame some of your mistakes on SA when the mistakes are yours to prevent",
            "author": null,
            "id": "g48xj6i",
            "parent_id": "t1_g48evqh",
            "score": 3,
            "created_utc": 1599411806.0,
            "replies": [
                {
                    "body": "I always check Id but fake ids are a thing. I can only go so far where a website can do a public records check potentially.",
                    "author": "sdthrowout23",
                    "id": "g4911hw",
                    "parent_id": "t1_g48xj6i",
                    "score": 1,
                    "created_utc": 1599413501.0,
                    "replies": [
                        {
                            "body": "If fake IDs are a problem they are going to be a problem for SA too. \n\nAt least in the US, no one is going to blame a website for not checking IDs when you are the older man that gets caught trying to sleep with an underage girl you didn’t vet. It will be your life that is ruined in that situation, not SA’s company so learn to have your own back. You do a public records search if your skeptical, it’s your ass on the line",
                            "author": null,
                            "id": "g491jfn",
                            "parent_id": "t1_g4911hw",
                            "score": 2,
                            "created_utc": 1599413751.0,
                            "replies": []
                        },
                        {
                            "body": "I mean, dude, it's 2020, kids are not buying fake IDs in droves. Kids can get drunk and smoke whatever they want at home. It's just how Gen-Z does it. It's so rare to run into this SPECIFIC scenario of your 16-year-old sugar baby having a fake ID. \n\nYou have to screen better and or date older.",
                            "author": null,
                            "id": "g4bnr8z",
                            "parent_id": "t1_g4911hw",
                            "score": 2,
                            "created_utc": 1599480741.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "In any state or country it is legal for a minor and an adult to meet. If there is physical intimacy only then it falls under statutory rape. I had teachers in high school take me out for lunch. Probably had a creepy crush on me. Not illegal tho",
            "author": "russianindianqueen",
            "id": "g499car",
            "parent_id": "t1_g47ye20",
            "score": 1,
            "created_utc": 1599417842.0,
            "replies": [
                {
                    "body": "But like age of consent is 16 in like .... a lot of states? dunno, I'm not out here trying to smash 16 years olds but that doesn't bother anyone?",
                    "author": null,
                    "id": "g4apwy3",
                    "parent_id": "t1_g499car",
                    "score": 0,
                    "created_utc": 1599449086.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I'd argue a bit on that one.\n\n\"Most of the issues,\" from what I've seen, are:\n\n* FAKES\n* Underaged people\n* Bots\n* Slow/nonfunctioning messenger\n* Ugly UI\n* Limited search options\n* No female category to separate \"\"\"\"curvy\"\"\"\" from \"embracing obese\"\n\nAnd these are long-running issues. Easily fixed in a week or two by a competent developer(s).",
            "author": "yeehaw_yall",
            "id": "g49epru",
            "parent_id": "t1_g47ynjc",
            "score": 0,
            "created_utc": 1599420819.0,
            "replies": [
                {
                    "body": "Forgot to ad pre & post op trans people.\n\nHave trans friends, I am just not interested in sex with trans people.",
                    "author": "mollyflowers",
                    "id": "g49zm13",
                    "parent_id": "t1_g49epru",
                    "score": 1,
                    "created_utc": 1599432600.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I see.\n\nSucks.....usually SBs get 1 **whoops** this would be her whoops .\n\nbest of luck",
            "author": "bookworm010101",
            "id": "g48euyd",
            "parent_id": "t1_g48eotu",
            "score": 2,
            "created_utc": 1599402554.0,
            "replies": [
                {
                    "body": "Nah. She told me she was sick...then posted on Snapchat a picture of a giant greasy hoagie she was eating later that night. That is a block,",
                    "author": "sdthrowout23",
                    "id": "g48ggrz",
                    "parent_id": "t1_g48euyd",
                    "score": 6,
                    "created_utc": 1599403511.0,
                    "replies": [
                        {
                            "body": "Agreed.",
                            "author": "bookworm010101",
                            "id": "g48h1d3",
                            "parent_id": "t1_g48ggrz",
                            "score": 1,
                            "created_utc": 1599403856.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Well clearly it was too rushed for her. It literally made her sick to her stomach after she canceled she prob felt better and ordered the hoagie.",
            "author": "angelhair12",
            "id": "g49adzv",
            "parent_id": "t1_g48gd0o",
            "score": 2,
            "created_utc": 1599418412.0,
            "replies": [
                {
                    "body": "A lot of you women on here are really shitty fucking people.",
                    "author": "sdthrowout23",
                    "id": "g49jy89",
                    "parent_id": "t1_g49adzv",
                    "score": 1,
                    "created_utc": 1599423716.0,
                    "replies": [
                        {
                            "body": "Wow. I’m trying to explain to you a girl has feel comfortable before she sleeps with you, something you should know but you don’t seem to care.\n\nI’m so sorry not everyone is going to cater to your delusions.",
                            "author": "angelhair12",
                            "id": "g49ljf2",
                            "parent_id": "t1_g49jy89",
                            "score": 4,
                            "created_utc": 1599424601.0,
                            "replies": [
                                {
                                    "body": "SA sucks because there isn't a flock of women on there who wants to sleep with me in my hotel right away, I already ordered her dinner, where the hell is she? Someone call the manager! 😂 This is what I see every time I check this subreddit.",
                                    "author": null,
                                    "id": "g4boi7u",
                                    "parent_id": "t1_g49ljf2",
                                    "score": 4,
                                    "created_utc": 1599481406.0,
                                    "replies": []
                                },
                                {
                                    "body": "Yes...don’t blame her for saying up to 30 minutes before she was ok with meeting.",
                                    "author": "sdthrowout23",
                                    "id": "g49qkp0",
                                    "parent_id": "t1_g49ljf2",
                                    "score": 0,
                                    "created_utc": 1599427429.0,
                                    "replies": [
                                        {
                                            "body": "She probably needed the money and thought she go through with it but you have such negative energy and are so off putting she couldn’t go through with it. \n\nShe made the right call. You’re the typical angry unmarried guy in your 30’s most girls wouldn’t touch for any amount of $$.",
                                            "author": "angelhair12",
                                            "id": "g49rhq7",
                                            "parent_id": "t1_g49qkp0",
                                            "score": 4,
                                            "created_utc": 1599427953.0,
                                            "replies": [
                                                {
                                                    "body": "You’re a cry baby too, gets even better lol. \nYou were the one who started calling me a shi*y person, remember!",
                                                    "author": "angelhair12",
                                                    "id": "g49tf9t",
                                                    "parent_id": "t1_g49rhq7",
                                                    "score": 3,
                                                    "created_utc": 1599429051.0,
                                                    "replies": [
                                                        {
                                                            "body": "Don’t even go there. You immediately insulted me by saying the thought of sex with me made her sick.",
                                                            "author": "sdthrowout23",
                                                            "id": "g49wv9i",
                                                            "parent_id": "t1_g49tf9t",
                                                            "score": 0,
                                                            "created_utc": 1599430989.0,
                                                            "replies": [
                                                                {
                                                                    "body": "It may be an insult to you, but it is a different perspective none-the-less. If she was truly young and naive she may have gotten herself above her own head.",
                                                                    "author": null,
                                                                    "id": "g4bom38",
                                                                    "parent_id": "t1_g49wv9i",
                                                                    "score": 3,
                                                                    "created_utc": 1599481502.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "Always always always making excuses for shitty behavior. Also excusing the OP who said the thought of intimacy made her sick.",
                                                                            "author": "sdthrowout23",
                                                                            "id": "g4cbs20",
                                                                            "parent_id": "t1_g4bom38",
                                                                            "score": 1,
                                                                            "created_utc": 1599493351.0,
                                                                            "replies": []
                                                                        },
                                                                        {
                                                                            "body": "Exactly how I meant it. This guy takes things too personally instead of learning.",
                                                                            "author": "angelhair12",
                                                                            "id": "g4dzxra",
                                                                            "parent_id": "t1_g4bom38",
                                                                            "score": 1,
                                                                            "created_utc": 1599520420.0,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "body": "Lol. Mods, why does shit like this not get posters banned?",
                                                    "author": "sdthrowout23",
                                                    "id": "g49t0r5",
                                                    "parent_id": "t1_g49rhq7",
                                                    "score": 0,
                                                    "created_utc": 1599428823.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "Try freestyle, much less entitlement and at least you know what you're getting beforehand. I basically stopped using SA because it was such an enormous time waster.",
                            "author": "alwaysawoke",
                            "id": "g4a7zjf",
                            "parent_id": "t1_g49jy89",
                            "score": 2,
                            "created_utc": 1599437924.0,
                            "replies": [
                                {
                                    "body": "I find that people who don't freestyle are usually not freestyle material. Meaning that what to find quick and cheap sex and use text to manipulate their way through the end goal. Freestyling is a great way to get to know people while actually living life.",
                                    "author": null,
                                    "id": "g4bobi8",
                                    "parent_id": "t1_g4a7zjf",
                                    "score": 1,
                                    "created_utc": 1599481241.0,
                                    "replies": [
                                        {
                                            "body": "Probably why I dont fit in well here. I dont fit the stereotypical socially awkward, emotionally stunted unattractive SD.\nAlso if that's the goal why not get an escort?",
                                            "author": "alwaysawoke",
                                            "id": "g4c1kuo",
                                            "parent_id": "t1_g4bobi8",
                                            "score": 3,
                                            "created_utc": 1599488932.0,
                                            "replies": [
                                                {
                                                    "body": "For logistics, I guess.",
                                                    "author": null,
                                                    "id": "g6acr55",
                                                    "parent_id": "t1_g4c1kuo",
                                                    "score": 1,
                                                    "created_utc": 1600833931.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Got it. How does that experience have anything to do with the site? Is the site responsible for your SBs schedule?",
            "author": null,
            "id": "g48jmzp",
            "parent_id": "t1_g48gd0o",
            "score": 1,
            "created_utc": 1599405123.0,
            "replies": []
        },
        {
            "body": "Actually the hottest SB I found recently has a fan's only & approached me about doing a oral sex video for her only fans.   I might take her up on it, as it be me receiving oral sex my face will not be shown.",
            "author": "mollyflowers",
            "id": "g4a0i88",
            "parent_id": "t1_g4a00p4",
            "score": 2,
            "created_utc": 1599433158.0,
            "replies": []
        },
        {
            "body": "Why not? Women in their 30s are very much viable as potential SBs.",
            "author": "earth-to-matilda",
            "id": "g48lrcv",
            "parent_id": "t1_g48fyw5",
            "score": 0,
            "created_utc": 1599406181.0,
            "replies": [
                {
                    "body": "I’d just date them.",
                    "author": "sdthrowout23",
                    "id": "g48uhxb",
                    "parent_id": "t1_g48lrcv",
                    "score": 0,
                    "created_utc": 1599410310.0,
                    "replies": [
                        {
                            "body": "I get that. I'm in my low 40s and I'll stretch up to the mid 30s or so because a diamond in the rough might present herself...but most of my wheelhouse is 21-25.\n\n&#x200B;\n\nAs was said before, your issues tend more toward your lack of ability to screen, rather than the shortcomings of SA itself.",
                            "author": "earth-to-matilda",
                            "id": "g48vvsl",
                            "parent_id": "t1_g48uhxb",
                            "score": 2,
                            "created_utc": 1599410959.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Ok. For SB’s what are the limits of the free option. \n\nI’m assuming maybe a couple messages and responses a day while paid option allows unlimited messages and responses.",
            "author": "a1bells",
            "id": "g47qrkk",
            "parent_id": "t1_g47q2o8",
            "score": 2,
            "created_utc": 1599380945.0,
            "replies": [
                {
                    "body": "Premium SB:\n\nCan communicate without a public profile photo\n\nCan communicate without an approved profile\n\nPriority over Standard Members in profile/photo approval process\n\nFeatured in search\n\nFeatured on the login page\n\nCan hide last login date and time\n\nCan hide last login country\n\nCan have up to 3 profile locations\n\nAbility to share your Wishlist\n\nCan see if a member has read their message\n\nCan see which members are Standard or Premium\n\nAccess to advanced search filters such as: Net Worth, Income, and Lifestyle Budget",
                    "author": "KittenCalledKatt",
                    "id": "g47qx17",
                    "parent_id": "t1_g47qrkk",
                    "score": 8,
                    "created_utc": 1599381109.0,
                    "replies": [
                        {
                            "body": "Ok got it. \n\n1) A free/standard SB what are their features? \n\n2) Does SA verify your profile and picture by asking for ID to prove who you are and how you look like to make sure your not using other people’s profiles?\n\n3) Net Worth and Income is details people may exaggerate to get more attention but does SA verify this somehow by asking for bank statements or proof and value of assets? What can stop me from signing up and putting my net worth as $100m?",
                            "author": "a1bells",
                            "id": "g47z44e",
                            "parent_id": "t1_g47qx17",
                            "score": 3,
                            "created_utc": 1599390074.0,
                            "replies": [
                                {
                                    "body": "1) free SB can message anyone but can't see whether the SD is premium so may be messaging SD that can't read or reply to the message.  The filters are limited and they can't hide their activity (premium can look at profiles without showing on the SDs viewed by list, can hide the last login info and join date etc)\n\n2) SA requires some to send ID based on previous posts here but I have never had to nor would I send my ID to them\n\n3) there is no income verification.  It's a drop down box when they fill out the profile much like height or marital status.  They can and do put whatever they want so take it with a grain of salt.",
                                    "author": "tamenwild",
                                    "id": "g487fpv",
                                    "parent_id": "t1_g47z44e",
                                    "score": 3,
                                    "created_utc": 1599397676.0,
                                    "replies": [
                                        {
                                            "body": "Ok so does a free SD always need to pay to see messages from SB’s? How much is a premium membership I assume they pay monthly.",
                                            "author": "a1bells",
                                            "id": "g48i0y8",
                                            "parent_id": "t1_g487fpv",
                                            "score": 1,
                                            "created_utc": 1599404428.0,
                                            "replies": [
                                                {
                                                    "body": "Free  SDs can only look at profiles.  They can't message unless they pay the 90 bucks a month.  A SB with a .edu email can get free premium otherwise it's 20 bucks per month.",
                                                    "author": "tamenwild",
                                                    "id": "g48j40s",
                                                    "parent_id": "t1_g48i0y8",
                                                    "score": 2,
                                                    "created_utc": 1599404864.0,
                                                    "replies": [
                                                        {
                                                            "body": "90 bucks a month seems a bit expensive. They must be capitalising on guys who are desperate for women.",
                                                            "author": "a1bells",
                                                            "id": "g48n737",
                                                            "parent_id": "t1_g48j40s",
                                                            "score": 0,
                                                            "created_utc": 1599406868.0,
                                                            "replies": [
                                                                {
                                                                    "body": "They are supposed to be well off men. If 90 bucks is too much than they probably shouldn't be a SD.  But also they probably only pay for a month or two.  Once they find a SB they usually go back to free status.  Can you imagine the scammers and John's that would be on there if it were 20 bucks for SDs. It would make it unusable.",
                                                                    "author": "tamenwild",
                                                                    "id": "g48o08t",
                                                                    "parent_id": "t1_g48n737",
                                                                    "score": 4,
                                                                    "created_utc": 1599407223.0,
                                                                    "replies": []
                                                                },
                                                                {
                                                                    "body": "Matchmaking services are much more expensive.",
                                                                    "author": null,
                                                                    "id": "g4bop6r",
                                                                    "parent_id": "t1_g48n737",
                                                                    "score": 2,
                                                                    "created_utc": 1599481578.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "g48kyen",
            "parent_id": "t1_g48g79h",
            "score": 2,
            "created_utc": 1599405734.0,
            "replies": [
                {
                    "body": "Yep, agree.",
                    "author": "sdthrowout23",
                    "id": "g48l7lt",
                    "parent_id": "t1_g48kyen",
                    "score": 2,
                    "created_utc": 1599405880.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "g49x7la",
            "parent_id": "t1_g47xddc",
            "score": -1,
            "created_utc": 1599431183.0,
            "replies": [
                {
                    "body": "Yeah, I saw your comment originally. Why do you miss the Schutzstaffel (the SS)? And why did you think to post that here of all places?",
                    "author": "BigBearSD",
                    "id": "g4bq48i",
                    "parent_id": "t1_g49x7la",
                    "score": 1,
                    "created_utc": 1599482745.0,
                    "replies": [
                        {
                            "body": "Yeah. That was an odd post to say the least.",
                            "author": "sdthrowout23",
                            "id": "g4cbw5j",
                            "parent_id": "t1_g4bq48i",
                            "score": 1,
                            "created_utc": 1599493393.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I missed feet pic sellers....lol",
            "author": "willfromvb",
            "id": "g49z7ur",
            "parent_id": "t1_g49y2xa",
            "score": 1,
            "created_utc": 1599432360.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "g49zb75",
                    "parent_id": "t1_g49z7ur",
                    "score": 1,
                    "created_utc": 1599432417.0,
                    "replies": [
                        {
                            "body": "I include that as \"online only\".  Onlyfans is just one site used for online activities.",
                            "author": "willfromvb",
                            "id": "g4a1zj0",
                            "parent_id": "t1_g49zb75",
                            "score": 1,
                            "created_utc": 1599434091.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "You may have missed it in my word wall...dinner was going to be at the hotel. Uber eats. We decided to stay in due to COVID. At least I got a nice meal for lunch tomorrow",
            "author": "sdthrowout23",
            "id": "g47c0zw",
            "parent_id": "t1_g47bwun",
            "score": 8,
            "created_utc": 1599367062.0,
            "replies": [
                {
                    "body": "AH! No, I'd seen the \"At the hotel\" bit, I just wrongly assumed that you were having dinner at the hotel restaurant, not ordering in!\n\nAnd yeah, that's always been my \"consolation prize\" lol... a nice meal at least lol!",
                    "author": "sdaddy305",
                    "id": "g47c5l8",
                    "parent_id": "t1_g47c0zw",
                    "score": 11,
                    "created_utc": 1599367164.0,
                    "replies": []
                },
                {
                    "body": "Next time I know you will wait to order until she comes (appears)",
                    "author": "rickrat",
                    "id": "g480gn6",
                    "parent_id": "t1_g47c0zw",
                    "score": 4,
                    "created_utc": 1599391501.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Guys online enjoy the fantasy of imagining the ratio exists where women must beg for their attention.",
            "author": null,
            "id": "g4853eo",
            "parent_id": "t1_g47klan",
            "score": 9,
            "created_utc": 1599395809.0,
            "replies": [
                {
                    "body": "Come on. This isn’t true at all. I also find it really damn ironic because women love online dating because they have to do literally zero work to get 100’s Of hits while a guy will get one response per 100 messages",
                    "author": "sdthrowout23",
                    "id": "g48ft2x",
                    "parent_id": "t1_g4853eo",
                    "score": 0,
                    "created_utc": 1599403119.0,
                    "replies": [
                        {
                            "body": "Poor men. )-: But, since dick isn't in short supply, it is what it is.",
                            "author": null,
                            "id": "g48j15c",
                            "parent_id": "t1_g48ft2x",
                            "score": 5,
                            "created_utc": 1599404818.0,
                            "replies": [
                                {
                                    "body": ">But, since dick isn't in short supply\n\nGood dick attached to muscular frames and intelligent minds is.",
                                    "author": null,
                                    "id": "g48w3f0",
                                    "parent_id": "t1_g48j15c",
                                    "score": 1,
                                    "created_utc": 1599411030.0,
                                    "replies": []
                                },
                                {
                                    "body": "Lol. Got to love women that think they are God’s gift to the world.",
                                    "author": "sdthrowout23",
                                    "id": "g48jztm",
                                    "parent_id": "t1_g48j15c",
                                    "score": -4,
                                    "created_utc": 1599405269.0,
                                    "replies": [
                                        {
                                            "body": "Women are like flowers, they fill the world with beauty, and sometimes attract pests.",
                                            "author": null,
                                            "id": "g48suq7",
                                            "parent_id": "t1_g48jztm",
                                            "score": 3,
                                            "created_utc": 1599409492.0,
                                            "replies": [
                                                {
                                                    "body": "That ratio just simply does not exist and I have to explain it every time a post like this is made lmao. It's fantasy at best until anything comes of these profiles that you're interacting with it's all fake.  \n\n\nSuddenly that ratio looks about even.",
                                                    "author": null,
                                                    "id": "g4bn0by",
                                                    "parent_id": "t1_g48suq7",
                                                    "score": 4,
                                                    "created_utc": 1599480074.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Well, whats the profile text like on your fake SD account?\n\nThe ratios are still there, just keep in mind a lot of SBs dont initiate conversations (habit I guess).\n\nThen finally the real question, what percentage of the guys that message you are not johns or scammers.\n\nThat said, even with the ratio I'm less than thrilled with SA now days.",
            "author": null,
            "id": "g47wpqs",
            "parent_id": "t1_g47klan",
            "score": 5,
            "created_utc": 1599387443.0,
            "replies": [
                {
                    "body": "It’s not a fake account 😘",
                    "author": "russianindianqueen",
                    "id": "g48wlxp",
                    "parent_id": "t1_g47wpqs",
                    "score": 2,
                    "created_utc": 1599411305.0,
                    "replies": [
                        {
                            "body": "Ah, I assumed it was an account to check out the competition.",
                            "author": null,
                            "id": "g4985kh",
                            "parent_id": "t1_g48wlxp",
                            "score": 0,
                            "created_utc": 1599417191.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I NEVER have women initiating with me.",
            "author": "sdthrowout23",
            "id": "g48eyey",
            "parent_id": "t1_g47klan",
            "score": 1,
            "created_utc": 1599402609.0,
            "replies": []
        },
        {
            "body": "Of course you can, dear. Just like those tall tales of, 'catching the big one' fishermen's stories we have all heard.",
            "author": null,
            "id": "g48u0ej",
            "parent_id": "t1_g48rb4p",
            "score": 3,
            "created_utc": 1599410045.0,
            "replies": []
        },
        {
            "body": "This. Many love to skate that fine line with 18-19-20-year-olds. Just seems like a safer bet to date someone who can have wine with their meal.\n\nThe woe-is-me-isms is the price you pay for the risk.",
            "author": null,
            "id": "g4bn86c",
            "parent_id": "t1_g48x0c0",
            "score": 2,
            "created_utc": 1599480266.0,
            "replies": [
                {
                    "body": "Lol. I guarantee you are a 30 year old SB who is just pissed most guys want younger.",
                    "author": "sdthrowout23",
                    "id": "g4cc424",
                    "parent_id": "t1_g4bn86c",
                    "score": 0,
                    "created_utc": 1599493482.0,
                    "replies": [
                        {
                            "body": "I guarantee you - no girl over 25 would put up with your crap.",
                            "author": "angelhair12",
                            "id": "g4cdgcx",
                            "parent_id": "t1_g4cc424",
                            "score": 3,
                            "created_utc": 1599494005.0,
                            "replies": [
                                {
                                    "body": "What crap is that? Being pissed off she ghosted me 5 minutes before we were supposed to meet.",
                                    "author": "sdthrowout23",
                                    "id": "g4cepnw",
                                    "parent_id": "t1_g4cdgcx",
                                    "score": 0,
                                    "created_utc": 1599494533.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "What a great way to spend your mental capacity, wish you would have gone in with the same effort to screen your pot. :)  \n\n\nMy mother just left her 30's though; I'll be sure to ask her how she's dealt with the menopausal '30s. 🤣",
                            "author": null,
                            "id": "g6ackr5",
                            "parent_id": "t1_g4cc424",
                            "score": 2,
                            "created_utc": 1600833810.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I always check Id but fake ids are a thing. I can only go so far where a website can do a public records check potentially.",
            "author": "sdthrowout23",
            "id": "g4911hw",
            "parent_id": "t1_g48xj6i",
            "score": 1,
            "created_utc": 1599413501.0,
            "replies": [
                {
                    "body": "If fake IDs are a problem they are going to be a problem for SA too. \n\nAt least in the US, no one is going to blame a website for not checking IDs when you are the older man that gets caught trying to sleep with an underage girl you didn’t vet. It will be your life that is ruined in that situation, not SA’s company so learn to have your own back. You do a public records search if your skeptical, it’s your ass on the line",
                    "author": null,
                    "id": "g491jfn",
                    "parent_id": "t1_g4911hw",
                    "score": 2,
                    "created_utc": 1599413751.0,
                    "replies": []
                },
                {
                    "body": "I mean, dude, it's 2020, kids are not buying fake IDs in droves. Kids can get drunk and smoke whatever they want at home. It's just how Gen-Z does it. It's so rare to run into this SPECIFIC scenario of your 16-year-old sugar baby having a fake ID. \n\nYou have to screen better and or date older.",
                    "author": null,
                    "id": "g4bnr8z",
                    "parent_id": "t1_g4911hw",
                    "score": 2,
                    "created_utc": 1599480741.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "But like age of consent is 16 in like .... a lot of states? dunno, I'm not out here trying to smash 16 years olds but that doesn't bother anyone?",
            "author": null,
            "id": "g4apwy3",
            "parent_id": "t1_g499car",
            "score": 0,
            "created_utc": 1599449086.0,
            "replies": []
        },
        {
            "body": "Forgot to ad pre & post op trans people.\n\nHave trans friends, I am just not interested in sex with trans people.",
            "author": "mollyflowers",
            "id": "g49zm13",
            "parent_id": "t1_g49epru",
            "score": 1,
            "created_utc": 1599432600.0,
            "replies": []
        },
        {
            "body": "Nah. She told me she was sick...then posted on Snapchat a picture of a giant greasy hoagie she was eating later that night. That is a block,",
            "author": "sdthrowout23",
            "id": "g48ggrz",
            "parent_id": "t1_g48euyd",
            "score": 6,
            "created_utc": 1599403511.0,
            "replies": [
                {
                    "body": "Agreed.",
                    "author": "bookworm010101",
                    "id": "g48h1d3",
                    "parent_id": "t1_g48ggrz",
                    "score": 1,
                    "created_utc": 1599403856.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "A lot of you women on here are really shitty fucking people.",
            "author": "sdthrowout23",
            "id": "g49jy89",
            "parent_id": "t1_g49adzv",
            "score": 1,
            "created_utc": 1599423716.0,
            "replies": [
                {
                    "body": "Wow. I’m trying to explain to you a girl has feel comfortable before she sleeps with you, something you should know but you don’t seem to care.\n\nI’m so sorry not everyone is going to cater to your delusions.",
                    "author": "angelhair12",
                    "id": "g49ljf2",
                    "parent_id": "t1_g49jy89",
                    "score": 4,
                    "created_utc": 1599424601.0,
                    "replies": [
                        {
                            "body": "SA sucks because there isn't a flock of women on there who wants to sleep with me in my hotel right away, I already ordered her dinner, where the hell is she? Someone call the manager! 😂 This is what I see every time I check this subreddit.",
                            "author": null,
                            "id": "g4boi7u",
                            "parent_id": "t1_g49ljf2",
                            "score": 4,
                            "created_utc": 1599481406.0,
                            "replies": []
                        },
                        {
                            "body": "Yes...don’t blame her for saying up to 30 minutes before she was ok with meeting.",
                            "author": "sdthrowout23",
                            "id": "g49qkp0",
                            "parent_id": "t1_g49ljf2",
                            "score": 0,
                            "created_utc": 1599427429.0,
                            "replies": [
                                {
                                    "body": "She probably needed the money and thought she go through with it but you have such negative energy and are so off putting she couldn’t go through with it. \n\nShe made the right call. You’re the typical angry unmarried guy in your 30’s most girls wouldn’t touch for any amount of $$.",
                                    "author": "angelhair12",
                                    "id": "g49rhq7",
                                    "parent_id": "t1_g49qkp0",
                                    "score": 4,
                                    "created_utc": 1599427953.0,
                                    "replies": [
                                        {
                                            "body": "You’re a cry baby too, gets even better lol. \nYou were the one who started calling me a shi*y person, remember!",
                                            "author": "angelhair12",
                                            "id": "g49tf9t",
                                            "parent_id": "t1_g49rhq7",
                                            "score": 3,
                                            "created_utc": 1599429051.0,
                                            "replies": [
                                                {
                                                    "body": "Don’t even go there. You immediately insulted me by saying the thought of sex with me made her sick.",
                                                    "author": "sdthrowout23",
                                                    "id": "g49wv9i",
                                                    "parent_id": "t1_g49tf9t",
                                                    "score": 0,
                                                    "created_utc": 1599430989.0,
                                                    "replies": [
                                                        {
                                                            "body": "It may be an insult to you, but it is a different perspective none-the-less. If she was truly young and naive she may have gotten herself above her own head.",
                                                            "author": null,
                                                            "id": "g4bom38",
                                                            "parent_id": "t1_g49wv9i",
                                                            "score": 3,
                                                            "created_utc": 1599481502.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Always always always making excuses for shitty behavior. Also excusing the OP who said the thought of intimacy made her sick.",
                                                                    "author": "sdthrowout23",
                                                                    "id": "g4cbs20",
                                                                    "parent_id": "t1_g4bom38",
                                                                    "score": 1,
                                                                    "created_utc": 1599493351.0,
                                                                    "replies": []
                                                                },
                                                                {
                                                                    "body": "Exactly how I meant it. This guy takes things too personally instead of learning.",
                                                                    "author": "angelhair12",
                                                                    "id": "g4dzxra",
                                                                    "parent_id": "t1_g4bom38",
                                                                    "score": 1,
                                                                    "created_utc": 1599520420.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "body": "Lol. Mods, why does shit like this not get posters banned?",
                                            "author": "sdthrowout23",
                                            "id": "g49t0r5",
                                            "parent_id": "t1_g49rhq7",
                                            "score": 0,
                                            "created_utc": 1599428823.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Try freestyle, much less entitlement and at least you know what you're getting beforehand. I basically stopped using SA because it was such an enormous time waster.",
                    "author": "alwaysawoke",
                    "id": "g4a7zjf",
                    "parent_id": "t1_g49jy89",
                    "score": 2,
                    "created_utc": 1599437924.0,
                    "replies": [
                        {
                            "body": "I find that people who don't freestyle are usually not freestyle material. Meaning that what to find quick and cheap sex and use text to manipulate their way through the end goal. Freestyling is a great way to get to know people while actually living life.",
                            "author": null,
                            "id": "g4bobi8",
                            "parent_id": "t1_g4a7zjf",
                            "score": 1,
                            "created_utc": 1599481241.0,
                            "replies": [
                                {
                                    "body": "Probably why I dont fit in well here. I dont fit the stereotypical socially awkward, emotionally stunted unattractive SD.\nAlso if that's the goal why not get an escort?",
                                    "author": "alwaysawoke",
                                    "id": "g4c1kuo",
                                    "parent_id": "t1_g4bobi8",
                                    "score": 3,
                                    "created_utc": 1599488932.0,
                                    "replies": [
                                        {
                                            "body": "For logistics, I guess.",
                                            "author": null,
                                            "id": "g6acr55",
                                            "parent_id": "t1_g4c1kuo",
                                            "score": 1,
                                            "created_utc": 1600833931.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I’d just date them.",
            "author": "sdthrowout23",
            "id": "g48uhxb",
            "parent_id": "t1_g48lrcv",
            "score": 0,
            "created_utc": 1599410310.0,
            "replies": [
                {
                    "body": "I get that. I'm in my low 40s and I'll stretch up to the mid 30s or so because a diamond in the rough might present herself...but most of my wheelhouse is 21-25.\n\n&#x200B;\n\nAs was said before, your issues tend more toward your lack of ability to screen, rather than the shortcomings of SA itself.",
                    "author": "earth-to-matilda",
                    "id": "g48vvsl",
                    "parent_id": "t1_g48uhxb",
                    "score": 2,
                    "created_utc": 1599410959.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Premium SB:\n\nCan communicate without a public profile photo\n\nCan communicate without an approved profile\n\nPriority over Standard Members in profile/photo approval process\n\nFeatured in search\n\nFeatured on the login page\n\nCan hide last login date and time\n\nCan hide last login country\n\nCan have up to 3 profile locations\n\nAbility to share your Wishlist\n\nCan see if a member has read their message\n\nCan see which members are Standard or Premium\n\nAccess to advanced search filters such as: Net Worth, Income, and Lifestyle Budget",
            "author": "KittenCalledKatt",
            "id": "g47qx17",
            "parent_id": "t1_g47qrkk",
            "score": 8,
            "created_utc": 1599381109.0,
            "replies": [
                {
                    "body": "Ok got it. \n\n1) A free/standard SB what are their features? \n\n2) Does SA verify your profile and picture by asking for ID to prove who you are and how you look like to make sure your not using other people’s profiles?\n\n3) Net Worth and Income is details people may exaggerate to get more attention but does SA verify this somehow by asking for bank statements or proof and value of assets? What can stop me from signing up and putting my net worth as $100m?",
                    "author": "a1bells",
                    "id": "g47z44e",
                    "parent_id": "t1_g47qx17",
                    "score": 3,
                    "created_utc": 1599390074.0,
                    "replies": [
                        {
                            "body": "1) free SB can message anyone but can't see whether the SD is premium so may be messaging SD that can't read or reply to the message.  The filters are limited and they can't hide their activity (premium can look at profiles without showing on the SDs viewed by list, can hide the last login info and join date etc)\n\n2) SA requires some to send ID based on previous posts here but I have never had to nor would I send my ID to them\n\n3) there is no income verification.  It's a drop down box when they fill out the profile much like height or marital status.  They can and do put whatever they want so take it with a grain of salt.",
                            "author": "tamenwild",
                            "id": "g487fpv",
                            "parent_id": "t1_g47z44e",
                            "score": 3,
                            "created_utc": 1599397676.0,
                            "replies": [
                                {
                                    "body": "Ok so does a free SD always need to pay to see messages from SB’s? How much is a premium membership I assume they pay monthly.",
                                    "author": "a1bells",
                                    "id": "g48i0y8",
                                    "parent_id": "t1_g487fpv",
                                    "score": 1,
                                    "created_utc": 1599404428.0,
                                    "replies": [
                                        {
                                            "body": "Free  SDs can only look at profiles.  They can't message unless they pay the 90 bucks a month.  A SB with a .edu email can get free premium otherwise it's 20 bucks per month.",
                                            "author": "tamenwild",
                                            "id": "g48j40s",
                                            "parent_id": "t1_g48i0y8",
                                            "score": 2,
                                            "created_utc": 1599404864.0,
                                            "replies": [
                                                {
                                                    "body": "90 bucks a month seems a bit expensive. They must be capitalising on guys who are desperate for women.",
                                                    "author": "a1bells",
                                                    "id": "g48n737",
                                                    "parent_id": "t1_g48j40s",
                                                    "score": 0,
                                                    "created_utc": 1599406868.0,
                                                    "replies": [
                                                        {
                                                            "body": "They are supposed to be well off men. If 90 bucks is too much than they probably shouldn't be a SD.  But also they probably only pay for a month or two.  Once they find a SB they usually go back to free status.  Can you imagine the scammers and John's that would be on there if it were 20 bucks for SDs. It would make it unusable.",
                                                            "author": "tamenwild",
                                                            "id": "g48o08t",
                                                            "parent_id": "t1_g48n737",
                                                            "score": 4,
                                                            "created_utc": 1599407223.0,
                                                            "replies": []
                                                        },
                                                        {
                                                            "body": "Matchmaking services are much more expensive.",
                                                            "author": null,
                                                            "id": "g4bop6r",
                                                            "parent_id": "t1_g48n737",
                                                            "score": 2,
                                                            "created_utc": 1599481578.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Yep, agree.",
            "author": "sdthrowout23",
            "id": "g48l7lt",
            "parent_id": "t1_g48kyen",
            "score": 2,
            "created_utc": 1599405880.0,
            "replies": []
        },
        {
            "body": "Yeah, I saw your comment originally. Why do you miss the Schutzstaffel (the SS)? And why did you think to post that here of all places?",
            "author": "BigBearSD",
            "id": "g4bq48i",
            "parent_id": "t1_g49x7la",
            "score": 1,
            "created_utc": 1599482745.0,
            "replies": [
                {
                    "body": "Yeah. That was an odd post to say the least.",
                    "author": "sdthrowout23",
                    "id": "g4cbw5j",
                    "parent_id": "t1_g4bq48i",
                    "score": 1,
                    "created_utc": 1599493393.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "g49zb75",
            "parent_id": "t1_g49z7ur",
            "score": 1,
            "created_utc": 1599432417.0,
            "replies": [
                {
                    "body": "I include that as \"online only\".  Onlyfans is just one site used for online activities.",
                    "author": "willfromvb",
                    "id": "g4a1zj0",
                    "parent_id": "t1_g49zb75",
                    "score": 1,
                    "created_utc": 1599434091.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "AH! No, I'd seen the \"At the hotel\" bit, I just wrongly assumed that you were having dinner at the hotel restaurant, not ordering in!\n\nAnd yeah, that's always been my \"consolation prize\" lol... a nice meal at least lol!",
            "author": "sdaddy305",
            "id": "g47c5l8",
            "parent_id": "t1_g47c0zw",
            "score": 11,
            "created_utc": 1599367164.0,
            "replies": []
        },
        {
            "body": "Next time I know you will wait to order until she comes (appears)",
            "author": "rickrat",
            "id": "g480gn6",
            "parent_id": "t1_g47c0zw",
            "score": 4,
            "created_utc": 1599391501.0,
            "replies": []
        },
        {
            "body": "Come on. This isn’t true at all. I also find it really damn ironic because women love online dating because they have to do literally zero work to get 100’s Of hits while a guy will get one response per 100 messages",
            "author": "sdthrowout23",
            "id": "g48ft2x",
            "parent_id": "t1_g4853eo",
            "score": 0,
            "created_utc": 1599403119.0,
            "replies": [
                {
                    "body": "Poor men. )-: But, since dick isn't in short supply, it is what it is.",
                    "author": null,
                    "id": "g48j15c",
                    "parent_id": "t1_g48ft2x",
                    "score": 5,
                    "created_utc": 1599404818.0,
                    "replies": [
                        {
                            "body": ">But, since dick isn't in short supply\n\nGood dick attached to muscular frames and intelligent minds is.",
                            "author": null,
                            "id": "g48w3f0",
                            "parent_id": "t1_g48j15c",
                            "score": 1,
                            "created_utc": 1599411030.0,
                            "replies": []
                        },
                        {
                            "body": "Lol. Got to love women that think they are God’s gift to the world.",
                            "author": "sdthrowout23",
                            "id": "g48jztm",
                            "parent_id": "t1_g48j15c",
                            "score": -4,
                            "created_utc": 1599405269.0,
                            "replies": [
                                {
                                    "body": "Women are like flowers, they fill the world with beauty, and sometimes attract pests.",
                                    "author": null,
                                    "id": "g48suq7",
                                    "parent_id": "t1_g48jztm",
                                    "score": 3,
                                    "created_utc": 1599409492.0,
                                    "replies": [
                                        {
                                            "body": "That ratio just simply does not exist and I have to explain it every time a post like this is made lmao. It's fantasy at best until anything comes of these profiles that you're interacting with it's all fake.  \n\n\nSuddenly that ratio looks about even.",
                                            "author": null,
                                            "id": "g4bn0by",
                                            "parent_id": "t1_g48suq7",
                                            "score": 4,
                                            "created_utc": 1599480074.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "It’s not a fake account 😘",
            "author": "russianindianqueen",
            "id": "g48wlxp",
            "parent_id": "t1_g47wpqs",
            "score": 2,
            "created_utc": 1599411305.0,
            "replies": [
                {
                    "body": "Ah, I assumed it was an account to check out the competition.",
                    "author": null,
                    "id": "g4985kh",
                    "parent_id": "t1_g48wlxp",
                    "score": 0,
                    "created_utc": 1599417191.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Lol. I guarantee you are a 30 year old SB who is just pissed most guys want younger.",
            "author": "sdthrowout23",
            "id": "g4cc424",
            "parent_id": "t1_g4bn86c",
            "score": 0,
            "created_utc": 1599493482.0,
            "replies": [
                {
                    "body": "I guarantee you - no girl over 25 would put up with your crap.",
                    "author": "angelhair12",
                    "id": "g4cdgcx",
                    "parent_id": "t1_g4cc424",
                    "score": 3,
                    "created_utc": 1599494005.0,
                    "replies": [
                        {
                            "body": "What crap is that? Being pissed off she ghosted me 5 minutes before we were supposed to meet.",
                            "author": "sdthrowout23",
                            "id": "g4cepnw",
                            "parent_id": "t1_g4cdgcx",
                            "score": 0,
                            "created_utc": 1599494533.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "What a great way to spend your mental capacity, wish you would have gone in with the same effort to screen your pot. :)  \n\n\nMy mother just left her 30's though; I'll be sure to ask her how she's dealt with the menopausal '30s. 🤣",
                    "author": null,
                    "id": "g6ackr5",
                    "parent_id": "t1_g4cc424",
                    "score": 2,
                    "created_utc": 1600833810.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "If fake IDs are a problem they are going to be a problem for SA too. \n\nAt least in the US, no one is going to blame a website for not checking IDs when you are the older man that gets caught trying to sleep with an underage girl you didn’t vet. It will be your life that is ruined in that situation, not SA’s company so learn to have your own back. You do a public records search if your skeptical, it’s your ass on the line",
            "author": null,
            "id": "g491jfn",
            "parent_id": "t1_g4911hw",
            "score": 2,
            "created_utc": 1599413751.0,
            "replies": []
        },
        {
            "body": "I mean, dude, it's 2020, kids are not buying fake IDs in droves. Kids can get drunk and smoke whatever they want at home. It's just how Gen-Z does it. It's so rare to run into this SPECIFIC scenario of your 16-year-old sugar baby having a fake ID. \n\nYou have to screen better and or date older.",
            "author": null,
            "id": "g4bnr8z",
            "parent_id": "t1_g4911hw",
            "score": 2,
            "created_utc": 1599480741.0,
            "replies": []
        },
        {
            "body": "Agreed.",
            "author": "bookworm010101",
            "id": "g48h1d3",
            "parent_id": "t1_g48ggrz",
            "score": 1,
            "created_utc": 1599403856.0,
            "replies": []
        },
        {
            "body": "Wow. I’m trying to explain to you a girl has feel comfortable before she sleeps with you, something you should know but you don’t seem to care.\n\nI’m so sorry not everyone is going to cater to your delusions.",
            "author": "angelhair12",
            "id": "g49ljf2",
            "parent_id": "t1_g49jy89",
            "score": 4,
            "created_utc": 1599424601.0,
            "replies": [
                {
                    "body": "SA sucks because there isn't a flock of women on there who wants to sleep with me in my hotel right away, I already ordered her dinner, where the hell is she? Someone call the manager! 😂 This is what I see every time I check this subreddit.",
                    "author": null,
                    "id": "g4boi7u",
                    "parent_id": "t1_g49ljf2",
                    "score": 4,
                    "created_utc": 1599481406.0,
                    "replies": []
                },
                {
                    "body": "Yes...don’t blame her for saying up to 30 minutes before she was ok with meeting.",
                    "author": "sdthrowout23",
                    "id": "g49qkp0",
                    "parent_id": "t1_g49ljf2",
                    "score": 0,
                    "created_utc": 1599427429.0,
                    "replies": [
                        {
                            "body": "She probably needed the money and thought she go through with it but you have such negative energy and are so off putting she couldn’t go through with it. \n\nShe made the right call. You’re the typical angry unmarried guy in your 30’s most girls wouldn’t touch for any amount of $$.",
                            "author": "angelhair12",
                            "id": "g49rhq7",
                            "parent_id": "t1_g49qkp0",
                            "score": 4,
                            "created_utc": 1599427953.0,
                            "replies": [
                                {
                                    "body": "You’re a cry baby too, gets even better lol. \nYou were the one who started calling me a shi*y person, remember!",
                                    "author": "angelhair12",
                                    "id": "g49tf9t",
                                    "parent_id": "t1_g49rhq7",
                                    "score": 3,
                                    "created_utc": 1599429051.0,
                                    "replies": [
                                        {
                                            "body": "Don’t even go there. You immediately insulted me by saying the thought of sex with me made her sick.",
                                            "author": "sdthrowout23",
                                            "id": "g49wv9i",
                                            "parent_id": "t1_g49tf9t",
                                            "score": 0,
                                            "created_utc": 1599430989.0,
                                            "replies": [
                                                {
                                                    "body": "It may be an insult to you, but it is a different perspective none-the-less. If she was truly young and naive she may have gotten herself above her own head.",
                                                    "author": null,
                                                    "id": "g4bom38",
                                                    "parent_id": "t1_g49wv9i",
                                                    "score": 3,
                                                    "created_utc": 1599481502.0,
                                                    "replies": [
                                                        {
                                                            "body": "Always always always making excuses for shitty behavior. Also excusing the OP who said the thought of intimacy made her sick.",
                                                            "author": "sdthrowout23",
                                                            "id": "g4cbs20",
                                                            "parent_id": "t1_g4bom38",
                                                            "score": 1,
                                                            "created_utc": 1599493351.0,
                                                            "replies": []
                                                        },
                                                        {
                                                            "body": "Exactly how I meant it. This guy takes things too personally instead of learning.",
                                                            "author": "angelhair12",
                                                            "id": "g4dzxra",
                                                            "parent_id": "t1_g4bom38",
                                                            "score": 1,
                                                            "created_utc": 1599520420.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "Lol. Mods, why does shit like this not get posters banned?",
                                    "author": "sdthrowout23",
                                    "id": "g49t0r5",
                                    "parent_id": "t1_g49rhq7",
                                    "score": 0,
                                    "created_utc": 1599428823.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Try freestyle, much less entitlement and at least you know what you're getting beforehand. I basically stopped using SA because it was such an enormous time waster.",
            "author": "alwaysawoke",
            "id": "g4a7zjf",
            "parent_id": "t1_g49jy89",
            "score": 2,
            "created_utc": 1599437924.0,
            "replies": [
                {
                    "body": "I find that people who don't freestyle are usually not freestyle material. Meaning that what to find quick and cheap sex and use text to manipulate their way through the end goal. Freestyling is a great way to get to know people while actually living life.",
                    "author": null,
                    "id": "g4bobi8",
                    "parent_id": "t1_g4a7zjf",
                    "score": 1,
                    "created_utc": 1599481241.0,
                    "replies": [
                        {
                            "body": "Probably why I dont fit in well here. I dont fit the stereotypical socially awkward, emotionally stunted unattractive SD.\nAlso if that's the goal why not get an escort?",
                            "author": "alwaysawoke",
                            "id": "g4c1kuo",
                            "parent_id": "t1_g4bobi8",
                            "score": 3,
                            "created_utc": 1599488932.0,
                            "replies": [
                                {
                                    "body": "For logistics, I guess.",
                                    "author": null,
                                    "id": "g6acr55",
                                    "parent_id": "t1_g4c1kuo",
                                    "score": 1,
                                    "created_utc": 1600833931.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I get that. I'm in my low 40s and I'll stretch up to the mid 30s or so because a diamond in the rough might present herself...but most of my wheelhouse is 21-25.\n\n&#x200B;\n\nAs was said before, your issues tend more toward your lack of ability to screen, rather than the shortcomings of SA itself.",
            "author": "earth-to-matilda",
            "id": "g48vvsl",
            "parent_id": "t1_g48uhxb",
            "score": 2,
            "created_utc": 1599410959.0,
            "replies": []
        },
        {
            "body": "Ok got it. \n\n1) A free/standard SB what are their features? \n\n2) Does SA verify your profile and picture by asking for ID to prove who you are and how you look like to make sure your not using other people’s profiles?\n\n3) Net Worth and Income is details people may exaggerate to get more attention but does SA verify this somehow by asking for bank statements or proof and value of assets? What can stop me from signing up and putting my net worth as $100m?",
            "author": "a1bells",
            "id": "g47z44e",
            "parent_id": "t1_g47qx17",
            "score": 3,
            "created_utc": 1599390074.0,
            "replies": [
                {
                    "body": "1) free SB can message anyone but can't see whether the SD is premium so may be messaging SD that can't read or reply to the message.  The filters are limited and they can't hide their activity (premium can look at profiles without showing on the SDs viewed by list, can hide the last login info and join date etc)\n\n2) SA requires some to send ID based on previous posts here but I have never had to nor would I send my ID to them\n\n3) there is no income verification.  It's a drop down box when they fill out the profile much like height or marital status.  They can and do put whatever they want so take it with a grain of salt.",
                    "author": "tamenwild",
                    "id": "g487fpv",
                    "parent_id": "t1_g47z44e",
                    "score": 3,
                    "created_utc": 1599397676.0,
                    "replies": [
                        {
                            "body": "Ok so does a free SD always need to pay to see messages from SB’s? How much is a premium membership I assume they pay monthly.",
                            "author": "a1bells",
                            "id": "g48i0y8",
                            "parent_id": "t1_g487fpv",
                            "score": 1,
                            "created_utc": 1599404428.0,
                            "replies": [
                                {
                                    "body": "Free  SDs can only look at profiles.  They can't message unless they pay the 90 bucks a month.  A SB with a .edu email can get free premium otherwise it's 20 bucks per month.",
                                    "author": "tamenwild",
                                    "id": "g48j40s",
                                    "parent_id": "t1_g48i0y8",
                                    "score": 2,
                                    "created_utc": 1599404864.0,
                                    "replies": [
                                        {
                                            "body": "90 bucks a month seems a bit expensive. They must be capitalising on guys who are desperate for women.",
                                            "author": "a1bells",
                                            "id": "g48n737",
                                            "parent_id": "t1_g48j40s",
                                            "score": 0,
                                            "created_utc": 1599406868.0,
                                            "replies": [
                                                {
                                                    "body": "They are supposed to be well off men. If 90 bucks is too much than they probably shouldn't be a SD.  But also they probably only pay for a month or two.  Once they find a SB they usually go back to free status.  Can you imagine the scammers and John's that would be on there if it were 20 bucks for SDs. It would make it unusable.",
                                                    "author": "tamenwild",
                                                    "id": "g48o08t",
                                                    "parent_id": "t1_g48n737",
                                                    "score": 4,
                                                    "created_utc": 1599407223.0,
                                                    "replies": []
                                                },
                                                {
                                                    "body": "Matchmaking services are much more expensive.",
                                                    "author": null,
                                                    "id": "g4bop6r",
                                                    "parent_id": "t1_g48n737",
                                                    "score": 2,
                                                    "created_utc": 1599481578.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Yeah. That was an odd post to say the least.",
            "author": "sdthrowout23",
            "id": "g4cbw5j",
            "parent_id": "t1_g4bq48i",
            "score": 1,
            "created_utc": 1599493393.0,
            "replies": []
        },
        {
            "body": "I include that as \"online only\".  Onlyfans is just one site used for online activities.",
            "author": "willfromvb",
            "id": "g4a1zj0",
            "parent_id": "t1_g49zb75",
            "score": 1,
            "created_utc": 1599434091.0,
            "replies": []
        },
        {
            "body": "Poor men. )-: But, since dick isn't in short supply, it is what it is.",
            "author": null,
            "id": "g48j15c",
            "parent_id": "t1_g48ft2x",
            "score": 5,
            "created_utc": 1599404818.0,
            "replies": [
                {
                    "body": ">But, since dick isn't in short supply\n\nGood dick attached to muscular frames and intelligent minds is.",
                    "author": null,
                    "id": "g48w3f0",
                    "parent_id": "t1_g48j15c",
                    "score": 1,
                    "created_utc": 1599411030.0,
                    "replies": []
                },
                {
                    "body": "Lol. Got to love women that think they are God’s gift to the world.",
                    "author": "sdthrowout23",
                    "id": "g48jztm",
                    "parent_id": "t1_g48j15c",
                    "score": -4,
                    "created_utc": 1599405269.0,
                    "replies": [
                        {
                            "body": "Women are like flowers, they fill the world with beauty, and sometimes attract pests.",
                            "author": null,
                            "id": "g48suq7",
                            "parent_id": "t1_g48jztm",
                            "score": 3,
                            "created_utc": 1599409492.0,
                            "replies": [
                                {
                                    "body": "That ratio just simply does not exist and I have to explain it every time a post like this is made lmao. It's fantasy at best until anything comes of these profiles that you're interacting with it's all fake.  \n\n\nSuddenly that ratio looks about even.",
                                    "author": null,
                                    "id": "g4bn0by",
                                    "parent_id": "t1_g48suq7",
                                    "score": 4,
                                    "created_utc": 1599480074.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Ah, I assumed it was an account to check out the competition.",
            "author": null,
            "id": "g4985kh",
            "parent_id": "t1_g48wlxp",
            "score": 0,
            "created_utc": 1599417191.0,
            "replies": []
        },
        {
            "body": "I guarantee you - no girl over 25 would put up with your crap.",
            "author": "angelhair12",
            "id": "g4cdgcx",
            "parent_id": "t1_g4cc424",
            "score": 3,
            "created_utc": 1599494005.0,
            "replies": [
                {
                    "body": "What crap is that? Being pissed off she ghosted me 5 minutes before we were supposed to meet.",
                    "author": "sdthrowout23",
                    "id": "g4cepnw",
                    "parent_id": "t1_g4cdgcx",
                    "score": 0,
                    "created_utc": 1599494533.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "What a great way to spend your mental capacity, wish you would have gone in with the same effort to screen your pot. :)  \n\n\nMy mother just left her 30's though; I'll be sure to ask her how she's dealt with the menopausal '30s. 🤣",
            "author": null,
            "id": "g6ackr5",
            "parent_id": "t1_g4cc424",
            "score": 2,
            "created_utc": 1600833810.0,
            "replies": []
        },
        {
            "body": "SA sucks because there isn't a flock of women on there who wants to sleep with me in my hotel right away, I already ordered her dinner, where the hell is she? Someone call the manager! 😂 This is what I see every time I check this subreddit.",
            "author": null,
            "id": "g4boi7u",
            "parent_id": "t1_g49ljf2",
            "score": 4,
            "created_utc": 1599481406.0,
            "replies": []
        },
        {
            "body": "Yes...don’t blame her for saying up to 30 minutes before she was ok with meeting.",
            "author": "sdthrowout23",
            "id": "g49qkp0",
            "parent_id": "t1_g49ljf2",
            "score": 0,
            "created_utc": 1599427429.0,
            "replies": [
                {
                    "body": "She probably needed the money and thought she go through with it but you have such negative energy and are so off putting she couldn’t go through with it. \n\nShe made the right call. You’re the typical angry unmarried guy in your 30’s most girls wouldn’t touch for any amount of $$.",
                    "author": "angelhair12",
                    "id": "g49rhq7",
                    "parent_id": "t1_g49qkp0",
                    "score": 4,
                    "created_utc": 1599427953.0,
                    "replies": [
                        {
                            "body": "You’re a cry baby too, gets even better lol. \nYou were the one who started calling me a shi*y person, remember!",
                            "author": "angelhair12",
                            "id": "g49tf9t",
                            "parent_id": "t1_g49rhq7",
                            "score": 3,
                            "created_utc": 1599429051.0,
                            "replies": [
                                {
                                    "body": "Don’t even go there. You immediately insulted me by saying the thought of sex with me made her sick.",
                                    "author": "sdthrowout23",
                                    "id": "g49wv9i",
                                    "parent_id": "t1_g49tf9t",
                                    "score": 0,
                                    "created_utc": 1599430989.0,
                                    "replies": [
                                        {
                                            "body": "It may be an insult to you, but it is a different perspective none-the-less. If she was truly young and naive she may have gotten herself above her own head.",
                                            "author": null,
                                            "id": "g4bom38",
                                            "parent_id": "t1_g49wv9i",
                                            "score": 3,
                                            "created_utc": 1599481502.0,
                                            "replies": [
                                                {
                                                    "body": "Always always always making excuses for shitty behavior. Also excusing the OP who said the thought of intimacy made her sick.",
                                                    "author": "sdthrowout23",
                                                    "id": "g4cbs20",
                                                    "parent_id": "t1_g4bom38",
                                                    "score": 1,
                                                    "created_utc": 1599493351.0,
                                                    "replies": []
                                                },
                                                {
                                                    "body": "Exactly how I meant it. This guy takes things too personally instead of learning.",
                                                    "author": "angelhair12",
                                                    "id": "g4dzxra",
                                                    "parent_id": "t1_g4bom38",
                                                    "score": 1,
                                                    "created_utc": 1599520420.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "Lol. Mods, why does shit like this not get posters banned?",
                            "author": "sdthrowout23",
                            "id": "g49t0r5",
                            "parent_id": "t1_g49rhq7",
                            "score": 0,
                            "created_utc": 1599428823.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I find that people who don't freestyle are usually not freestyle material. Meaning that what to find quick and cheap sex and use text to manipulate their way through the end goal. Freestyling is a great way to get to know people while actually living life.",
            "author": null,
            "id": "g4bobi8",
            "parent_id": "t1_g4a7zjf",
            "score": 1,
            "created_utc": 1599481241.0,
            "replies": [
                {
                    "body": "Probably why I dont fit in well here. I dont fit the stereotypical socially awkward, emotionally stunted unattractive SD.\nAlso if that's the goal why not get an escort?",
                    "author": "alwaysawoke",
                    "id": "g4c1kuo",
                    "parent_id": "t1_g4bobi8",
                    "score": 3,
                    "created_utc": 1599488932.0,
                    "replies": [
                        {
                            "body": "For logistics, I guess.",
                            "author": null,
                            "id": "g6acr55",
                            "parent_id": "t1_g4c1kuo",
                            "score": 1,
                            "created_utc": 1600833931.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "1) free SB can message anyone but can't see whether the SD is premium so may be messaging SD that can't read or reply to the message.  The filters are limited and they can't hide their activity (premium can look at profiles without showing on the SDs viewed by list, can hide the last login info and join date etc)\n\n2) SA requires some to send ID based on previous posts here but I have never had to nor would I send my ID to them\n\n3) there is no income verification.  It's a drop down box when they fill out the profile much like height or marital status.  They can and do put whatever they want so take it with a grain of salt.",
            "author": "tamenwild",
            "id": "g487fpv",
            "parent_id": "t1_g47z44e",
            "score": 3,
            "created_utc": 1599397676.0,
            "replies": [
                {
                    "body": "Ok so does a free SD always need to pay to see messages from SB’s? How much is a premium membership I assume they pay monthly.",
                    "author": "a1bells",
                    "id": "g48i0y8",
                    "parent_id": "t1_g487fpv",
                    "score": 1,
                    "created_utc": 1599404428.0,
                    "replies": [
                        {
                            "body": "Free  SDs can only look at profiles.  They can't message unless they pay the 90 bucks a month.  A SB with a .edu email can get free premium otherwise it's 20 bucks per month.",
                            "author": "tamenwild",
                            "id": "g48j40s",
                            "parent_id": "t1_g48i0y8",
                            "score": 2,
                            "created_utc": 1599404864.0,
                            "replies": [
                                {
                                    "body": "90 bucks a month seems a bit expensive. They must be capitalising on guys who are desperate for women.",
                                    "author": "a1bells",
                                    "id": "g48n737",
                                    "parent_id": "t1_g48j40s",
                                    "score": 0,
                                    "created_utc": 1599406868.0,
                                    "replies": [
                                        {
                                            "body": "They are supposed to be well off men. If 90 bucks is too much than they probably shouldn't be a SD.  But also they probably only pay for a month or two.  Once they find a SB they usually go back to free status.  Can you imagine the scammers and John's that would be on there if it were 20 bucks for SDs. It would make it unusable.",
                                            "author": "tamenwild",
                                            "id": "g48o08t",
                                            "parent_id": "t1_g48n737",
                                            "score": 4,
                                            "created_utc": 1599407223.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "Matchmaking services are much more expensive.",
                                            "author": null,
                                            "id": "g4bop6r",
                                            "parent_id": "t1_g48n737",
                                            "score": 2,
                                            "created_utc": 1599481578.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": ">But, since dick isn't in short supply\n\nGood dick attached to muscular frames and intelligent minds is.",
            "author": null,
            "id": "g48w3f0",
            "parent_id": "t1_g48j15c",
            "score": 1,
            "created_utc": 1599411030.0,
            "replies": []
        },
        {
            "body": "Lol. Got to love women that think they are God’s gift to the world.",
            "author": "sdthrowout23",
            "id": "g48jztm",
            "parent_id": "t1_g48j15c",
            "score": -4,
            "created_utc": 1599405269.0,
            "replies": [
                {
                    "body": "Women are like flowers, they fill the world with beauty, and sometimes attract pests.",
                    "author": null,
                    "id": "g48suq7",
                    "parent_id": "t1_g48jztm",
                    "score": 3,
                    "created_utc": 1599409492.0,
                    "replies": [
                        {
                            "body": "That ratio just simply does not exist and I have to explain it every time a post like this is made lmao. It's fantasy at best until anything comes of these profiles that you're interacting with it's all fake.  \n\n\nSuddenly that ratio looks about even.",
                            "author": null,
                            "id": "g4bn0by",
                            "parent_id": "t1_g48suq7",
                            "score": 4,
                            "created_utc": 1599480074.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "What crap is that? Being pissed off she ghosted me 5 minutes before we were supposed to meet.",
            "author": "sdthrowout23",
            "id": "g4cepnw",
            "parent_id": "t1_g4cdgcx",
            "score": 0,
            "created_utc": 1599494533.0,
            "replies": []
        },
        {
            "body": "She probably needed the money and thought she go through with it but you have such negative energy and are so off putting she couldn’t go through with it. \n\nShe made the right call. You’re the typical angry unmarried guy in your 30’s most girls wouldn’t touch for any amount of $$.",
            "author": "angelhair12",
            "id": "g49rhq7",
            "parent_id": "t1_g49qkp0",
            "score": 4,
            "created_utc": 1599427953.0,
            "replies": [
                {
                    "body": "You’re a cry baby too, gets even better lol. \nYou were the one who started calling me a shi*y person, remember!",
                    "author": "angelhair12",
                    "id": "g49tf9t",
                    "parent_id": "t1_g49rhq7",
                    "score": 3,
                    "created_utc": 1599429051.0,
                    "replies": [
                        {
                            "body": "Don’t even go there. You immediately insulted me by saying the thought of sex with me made her sick.",
                            "author": "sdthrowout23",
                            "id": "g49wv9i",
                            "parent_id": "t1_g49tf9t",
                            "score": 0,
                            "created_utc": 1599430989.0,
                            "replies": [
                                {
                                    "body": "It may be an insult to you, but it is a different perspective none-the-less. If she was truly young and naive she may have gotten herself above her own head.",
                                    "author": null,
                                    "id": "g4bom38",
                                    "parent_id": "t1_g49wv9i",
                                    "score": 3,
                                    "created_utc": 1599481502.0,
                                    "replies": [
                                        {
                                            "body": "Always always always making excuses for shitty behavior. Also excusing the OP who said the thought of intimacy made her sick.",
                                            "author": "sdthrowout23",
                                            "id": "g4cbs20",
                                            "parent_id": "t1_g4bom38",
                                            "score": 1,
                                            "created_utc": 1599493351.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "Exactly how I meant it. This guy takes things too personally instead of learning.",
                                            "author": "angelhair12",
                                            "id": "g4dzxra",
                                            "parent_id": "t1_g4bom38",
                                            "score": 1,
                                            "created_utc": 1599520420.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Lol. Mods, why does shit like this not get posters banned?",
                    "author": "sdthrowout23",
                    "id": "g49t0r5",
                    "parent_id": "t1_g49rhq7",
                    "score": 0,
                    "created_utc": 1599428823.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Probably why I dont fit in well here. I dont fit the stereotypical socially awkward, emotionally stunted unattractive SD.\nAlso if that's the goal why not get an escort?",
            "author": "alwaysawoke",
            "id": "g4c1kuo",
            "parent_id": "t1_g4bobi8",
            "score": 3,
            "created_utc": 1599488932.0,
            "replies": [
                {
                    "body": "For logistics, I guess.",
                    "author": null,
                    "id": "g6acr55",
                    "parent_id": "t1_g4c1kuo",
                    "score": 1,
                    "created_utc": 1600833931.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Ok so does a free SD always need to pay to see messages from SB’s? How much is a premium membership I assume they pay monthly.",
            "author": "a1bells",
            "id": "g48i0y8",
            "parent_id": "t1_g487fpv",
            "score": 1,
            "created_utc": 1599404428.0,
            "replies": [
                {
                    "body": "Free  SDs can only look at profiles.  They can't message unless they pay the 90 bucks a month.  A SB with a .edu email can get free premium otherwise it's 20 bucks per month.",
                    "author": "tamenwild",
                    "id": "g48j40s",
                    "parent_id": "t1_g48i0y8",
                    "score": 2,
                    "created_utc": 1599404864.0,
                    "replies": [
                        {
                            "body": "90 bucks a month seems a bit expensive. They must be capitalising on guys who are desperate for women.",
                            "author": "a1bells",
                            "id": "g48n737",
                            "parent_id": "t1_g48j40s",
                            "score": 0,
                            "created_utc": 1599406868.0,
                            "replies": [
                                {
                                    "body": "They are supposed to be well off men. If 90 bucks is too much than they probably shouldn't be a SD.  But also they probably only pay for a month or two.  Once they find a SB they usually go back to free status.  Can you imagine the scammers and John's that would be on there if it were 20 bucks for SDs. It would make it unusable.",
                                    "author": "tamenwild",
                                    "id": "g48o08t",
                                    "parent_id": "t1_g48n737",
                                    "score": 4,
                                    "created_utc": 1599407223.0,
                                    "replies": []
                                },
                                {
                                    "body": "Matchmaking services are much more expensive.",
                                    "author": null,
                                    "id": "g4bop6r",
                                    "parent_id": "t1_g48n737",
                                    "score": 2,
                                    "created_utc": 1599481578.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Women are like flowers, they fill the world with beauty, and sometimes attract pests.",
            "author": null,
            "id": "g48suq7",
            "parent_id": "t1_g48jztm",
            "score": 3,
            "created_utc": 1599409492.0,
            "replies": [
                {
                    "body": "That ratio just simply does not exist and I have to explain it every time a post like this is made lmao. It's fantasy at best until anything comes of these profiles that you're interacting with it's all fake.  \n\n\nSuddenly that ratio looks about even.",
                    "author": null,
                    "id": "g4bn0by",
                    "parent_id": "t1_g48suq7",
                    "score": 4,
                    "created_utc": 1599480074.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "You’re a cry baby too, gets even better lol. \nYou were the one who started calling me a shi*y person, remember!",
            "author": "angelhair12",
            "id": "g49tf9t",
            "parent_id": "t1_g49rhq7",
            "score": 3,
            "created_utc": 1599429051.0,
            "replies": [
                {
                    "body": "Don’t even go there. You immediately insulted me by saying the thought of sex with me made her sick.",
                    "author": "sdthrowout23",
                    "id": "g49wv9i",
                    "parent_id": "t1_g49tf9t",
                    "score": 0,
                    "created_utc": 1599430989.0,
                    "replies": [
                        {
                            "body": "It may be an insult to you, but it is a different perspective none-the-less. If she was truly young and naive she may have gotten herself above her own head.",
                            "author": null,
                            "id": "g4bom38",
                            "parent_id": "t1_g49wv9i",
                            "score": 3,
                            "created_utc": 1599481502.0,
                            "replies": [
                                {
                                    "body": "Always always always making excuses for shitty behavior. Also excusing the OP who said the thought of intimacy made her sick.",
                                    "author": "sdthrowout23",
                                    "id": "g4cbs20",
                                    "parent_id": "t1_g4bom38",
                                    "score": 1,
                                    "created_utc": 1599493351.0,
                                    "replies": []
                                },
                                {
                                    "body": "Exactly how I meant it. This guy takes things too personally instead of learning.",
                                    "author": "angelhair12",
                                    "id": "g4dzxra",
                                    "parent_id": "t1_g4bom38",
                                    "score": 1,
                                    "created_utc": 1599520420.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Lol. Mods, why does shit like this not get posters banned?",
            "author": "sdthrowout23",
            "id": "g49t0r5",
            "parent_id": "t1_g49rhq7",
            "score": 0,
            "created_utc": 1599428823.0,
            "replies": []
        },
        {
            "body": "For logistics, I guess.",
            "author": null,
            "id": "g6acr55",
            "parent_id": "t1_g4c1kuo",
            "score": 1,
            "created_utc": 1600833931.0,
            "replies": []
        },
        {
            "body": "Free  SDs can only look at profiles.  They can't message unless they pay the 90 bucks a month.  A SB with a .edu email can get free premium otherwise it's 20 bucks per month.",
            "author": "tamenwild",
            "id": "g48j40s",
            "parent_id": "t1_g48i0y8",
            "score": 2,
            "created_utc": 1599404864.0,
            "replies": [
                {
                    "body": "90 bucks a month seems a bit expensive. They must be capitalising on guys who are desperate for women.",
                    "author": "a1bells",
                    "id": "g48n737",
                    "parent_id": "t1_g48j40s",
                    "score": 0,
                    "created_utc": 1599406868.0,
                    "replies": [
                        {
                            "body": "They are supposed to be well off men. If 90 bucks is too much than they probably shouldn't be a SD.  But also they probably only pay for a month or two.  Once they find a SB they usually go back to free status.  Can you imagine the scammers and John's that would be on there if it were 20 bucks for SDs. It would make it unusable.",
                            "author": "tamenwild",
                            "id": "g48o08t",
                            "parent_id": "t1_g48n737",
                            "score": 4,
                            "created_utc": 1599407223.0,
                            "replies": []
                        },
                        {
                            "body": "Matchmaking services are much more expensive.",
                            "author": null,
                            "id": "g4bop6r",
                            "parent_id": "t1_g48n737",
                            "score": 2,
                            "created_utc": 1599481578.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "That ratio just simply does not exist and I have to explain it every time a post like this is made lmao. It's fantasy at best until anything comes of these profiles that you're interacting with it's all fake.  \n\n\nSuddenly that ratio looks about even.",
            "author": null,
            "id": "g4bn0by",
            "parent_id": "t1_g48suq7",
            "score": 4,
            "created_utc": 1599480074.0,
            "replies": []
        },
        {
            "body": "Don’t even go there. You immediately insulted me by saying the thought of sex with me made her sick.",
            "author": "sdthrowout23",
            "id": "g49wv9i",
            "parent_id": "t1_g49tf9t",
            "score": 0,
            "created_utc": 1599430989.0,
            "replies": [
                {
                    "body": "It may be an insult to you, but it is a different perspective none-the-less. If she was truly young and naive she may have gotten herself above her own head.",
                    "author": null,
                    "id": "g4bom38",
                    "parent_id": "t1_g49wv9i",
                    "score": 3,
                    "created_utc": 1599481502.0,
                    "replies": [
                        {
                            "body": "Always always always making excuses for shitty behavior. Also excusing the OP who said the thought of intimacy made her sick.",
                            "author": "sdthrowout23",
                            "id": "g4cbs20",
                            "parent_id": "t1_g4bom38",
                            "score": 1,
                            "created_utc": 1599493351.0,
                            "replies": []
                        },
                        {
                            "body": "Exactly how I meant it. This guy takes things too personally instead of learning.",
                            "author": "angelhair12",
                            "id": "g4dzxra",
                            "parent_id": "t1_g4bom38",
                            "score": 1,
                            "created_utc": 1599520420.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "90 bucks a month seems a bit expensive. They must be capitalising on guys who are desperate for women.",
            "author": "a1bells",
            "id": "g48n737",
            "parent_id": "t1_g48j40s",
            "score": 0,
            "created_utc": 1599406868.0,
            "replies": [
                {
                    "body": "They are supposed to be well off men. If 90 bucks is too much than they probably shouldn't be a SD.  But also they probably only pay for a month or two.  Once they find a SB they usually go back to free status.  Can you imagine the scammers and John's that would be on there if it were 20 bucks for SDs. It would make it unusable.",
                    "author": "tamenwild",
                    "id": "g48o08t",
                    "parent_id": "t1_g48n737",
                    "score": 4,
                    "created_utc": 1599407223.0,
                    "replies": []
                },
                {
                    "body": "Matchmaking services are much more expensive.",
                    "author": null,
                    "id": "g4bop6r",
                    "parent_id": "t1_g48n737",
                    "score": 2,
                    "created_utc": 1599481578.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "It may be an insult to you, but it is a different perspective none-the-less. If she was truly young and naive she may have gotten herself above her own head.",
            "author": null,
            "id": "g4bom38",
            "parent_id": "t1_g49wv9i",
            "score": 3,
            "created_utc": 1599481502.0,
            "replies": [
                {
                    "body": "Always always always making excuses for shitty behavior. Also excusing the OP who said the thought of intimacy made her sick.",
                    "author": "sdthrowout23",
                    "id": "g4cbs20",
                    "parent_id": "t1_g4bom38",
                    "score": 1,
                    "created_utc": 1599493351.0,
                    "replies": []
                },
                {
                    "body": "Exactly how I meant it. This guy takes things too personally instead of learning.",
                    "author": "angelhair12",
                    "id": "g4dzxra",
                    "parent_id": "t1_g4bom38",
                    "score": 1,
                    "created_utc": 1599520420.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "They are supposed to be well off men. If 90 bucks is too much than they probably shouldn't be a SD.  But also they probably only pay for a month or two.  Once they find a SB they usually go back to free status.  Can you imagine the scammers and John's that would be on there if it were 20 bucks for SDs. It would make it unusable.",
            "author": "tamenwild",
            "id": "g48o08t",
            "parent_id": "t1_g48n737",
            "score": 4,
            "created_utc": 1599407223.0,
            "replies": []
        },
        {
            "body": "Matchmaking services are much more expensive.",
            "author": null,
            "id": "g4bop6r",
            "parent_id": "t1_g48n737",
            "score": 2,
            "created_utc": 1599481578.0,
            "replies": []
        },
        {
            "body": "Always always always making excuses for shitty behavior. Also excusing the OP who said the thought of intimacy made her sick.",
            "author": "sdthrowout23",
            "id": "g4cbs20",
            "parent_id": "t1_g4bom38",
            "score": 1,
            "created_utc": 1599493351.0,
            "replies": []
        },
        {
            "body": "Exactly how I meant it. This guy takes things too personally instead of learning.",
            "author": "angelhair12",
            "id": "g4dzxra",
            "parent_id": "t1_g4bom38",
            "score": 1,
            "created_utc": 1599520420.0,
            "replies": []
        }
    ]
}