{
    "title": "Drove me to far away location without permission",
    "post_id": "emccg5",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/emccg5/drove_me_to_far_away_location_without_permission/",
    "author": null,
    "body": "I went out with my SD who I was just starting to get to know. It was our 2nd time out. I enjoyed spending time with him so I accepted a ppm lower than I feel comfortable with to start, with plans to negotiate later. He asked if I wanted to have dinner Saturday night so I rally even though I'm busy. We go out to dinner and have drinks with a few of his friends in a few different locations/clubs. At 2 am I thought he was taking me home, but he wasn't. He was taking me to his house 25 miles away! By the time I noticed I was so far from my house and was so tired and just wanted to go to sleep. We get to his place and I'm kind of getting ready for bed.. brushing my teeth etc. And as soon as I'm going to sleep and (I presume he notices that hes not going to get laid) he starts making insulting comments about my body. I just said \"what is wrong with you???\" And pulled the covers over my head, but he kept going on saying crazy shit so I got up, got redressed and called an uber. He immediately started apologizing.  DONT LEAVE ME I MADE A MISTAKE AHHHH. Whatever. I made it home at literally 4am crying. He didnt pay me. \nI accept fault for being negligent. There are a lot of points in the story where I could have took more control, but I was kind of in a vulnerable place that night and I trusted him more than I should. God forbid someone actually behave as they claim to intend for once? \nBummed I wasted my time and traumatized myself. \nThis is my first SD experience. \nAnyways just wanted to share. Have a good day <3",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/emccg5/drove_me_to_far_away_location_without_permission/",
    "score": 151,
    "upvote_ratio": 0.95,
    "created_utc": 1578588770.0,
    "num_comments": 84,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "Fuckin yikes.  \n\nA) remember anything negative he said about you should be disregarded and this guy can kick rocks\n\nB) you may have made some mistakes, but you can learn from this so it doesn’t happen again. \n\nC) consider taking a brief step away from sugaring to recover from your experience. Self care is so critical right now. \n\nAlso, it goes without saying: block, delete. Even if he promises to make it up to you, block, delete.",
            "author": null,
            "id": "fdnowed",
            "parent_id": "t3_emccg5",
            "score": 58,
            "created_utc": 1578590153.0,
            "replies": [
                {
                    "body": "Consider nasty comments by a dirtbag as affirmation of your goodness.",
                    "author": "pinotandsugar",
                    "id": "fdnunvd",
                    "parent_id": "t1_fdnowed",
                    "score": 23,
                    "created_utc": 1578593191.0,
                    "replies": []
                },
                {
                    "body": "T H I S\n\nTake this as a good lesson since you’re back home safe. Everything about the situation screamed danger and manipulation, as unsettling as it may have been you still dodged a huge bullet. I agree with this comment, focus on self care for now.",
                    "author": "isavvi",
                    "id": "fdpyg1u",
                    "parent_id": "t1_fdnowed",
                    "score": 3,
                    "created_utc": 1578645954.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "OP, this guy is clearly a psycho and loser. Do not blame yourself. From now on, I really think that for basic safety you (and every person), should control their own transportation. Even for the best dates, there is no downside to uber.",
            "author": "TastySpermDispenser",
            "id": "fdnn8oq",
            "parent_id": "t3_emccg5",
            "score": 57,
            "created_utc": 1578589315.0,
            "replies": [
                {
                    "body": "Thank you... \nI really do appreciate the response. I've been feeling hard on myself about it",
                    "author": null,
                    "id": "fdnns59",
                    "parent_id": "t1_fdnn8oq",
                    "score": 15,
                    "created_utc": 1578589614.0,
                    "replies": [
                        {
                            "body": "I think it's okay to be a little hard on yourself, but you 1. took control in the end, and 2. in retrospect figured out where you could have taken control sooner (and a new safety guideline on transportation).   So, it's ok to forgive yourself, too.  In the end he's the asshole, you just need to brush up on your asshole management skills :)",
                            "author": "Azurecole",
                            "id": "fdnp1ju",
                            "parent_id": "t1_fdnns59",
                            "score": 19,
                            "created_utc": 1578590220.0,
                            "replies": [
                                {
                                    "body": "My dude. If someone handed me a resume that said they had asshole management skills, I would assume they knew when to pass on the chipotle, and how to keep a proper inventory of toilet paper.",
                                    "author": "TastySpermDispenser",
                                    "id": "fdnsqwb",
                                    "parent_id": "t1_fdnp1ju",
                                    "score": 7,
                                    "created_utc": 1578592084.0,
                                    "replies": [
                                        {
                                            "body": "So.... I'm  hired?",
                                            "author": "Azurecole",
                                            "id": "fdntai4",
                                            "parent_id": "t1_fdnsqwb",
                                            "score": 4,
                                            "created_utc": 1578592397.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "I fucking do for sure.",
                                    "author": null,
                                    "id": "fdnrz1k",
                                    "parent_id": "t1_fdnp1ju",
                                    "score": 3,
                                    "created_utc": 1578591635.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "😟 that sounds awful and scary, I'm sorry",
            "author": "tenmillionplus",
            "id": "fdnmlwx",
            "parent_id": "t3_emccg5",
            "score": 52,
            "created_utc": 1578588946.0,
            "replies": [
                {
                    "body": "It was so Martin Scorsese how we were yelling on the lawn in the suburbs at 4am in my heels lol! \nI feel proud for getting out even though it was way overdue.",
                    "author": null,
                    "id": "fdnmrqp",
                    "parent_id": "t1_fdnmlwx",
                    "score": 51,
                    "created_utc": 1578589041.0,
                    "replies": [
                        {
                            "body": ">I feel proud for getting out even though it was way overdue.\n\nYou should. Takes a lot of emotional (and at 4 am, physical) energy to make the right move there. Most wouldn't, you did, thanks for sharing the story.\n\nBTW, kinda weird that he had you meet friends that early - not sure if there was a reason for that, but that would almost never happen in a normal SR. For reference, my SB has met two family members but it was totally incidental (we just happened to be at a certain event same time to met up) and we had been together for like 9 months. No SB has ever met any friends of mine.\n\nAnd seems obvious he was pouring tons of drinks to get you wasted so he could pull off the \"oh, we're at my place\" trick.\n\nAgain, good job making the right move, love hearing when that happens!",
                            "author": "2fast-2curious",
                            "id": "fdnnr3q",
                            "parent_id": "t1_fdnmrqp",
                            "score": 43,
                            "created_utc": 1578589599.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I'm sorry this happened. I'm glad you got away safe! Take it as a lesson. Drinking with a POT you don't fully trust is a bad idea, also letting him drive. Next time take the uber home from the restaurant.",
            "author": null,
            "id": "fdnn623",
            "parent_id": "t3_emccg5",
            "score": 15,
            "created_utc": 1578589272.0,
            "replies": []
        },
        {
            "body": "with plans to negotiate later\"\n\nNever a good idea ! Always negotiate your best deal the first time  because most of us don't like when a SB comes back later for a new one.",
            "author": "GSSD",
            "id": "fdnxts5",
            "parent_id": "t3_emccg5",
            "score": 14,
            "created_utc": 1578595039.0,
            "replies": [
                {
                    "body": "Yeah, how does that work exactly? \"Dear SD, my performace last year was impeccable and I feel I have added value, so my new rate adjusted for inflation should be $xxxxx\".\nI think it is setting yourself up for failure and disappointment later down the line.🤷‍♀️",
                    "author": "himynameis--76324675",
                    "id": "fdqhgou",
                    "parent_id": "t1_fdnxts5",
                    "score": 2,
                    "created_utc": 1578666770.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I’m so sorry you had to experience that. I’m my experience with sugar daddies and ALL sex work- cam work or stripping- the client will almost always try to get more than what you’re offering and lowering your rate for him was the signal to him that there was room to dig into you and expect more, do things that aren’t agreed upon and try to emotionally abuse you. His behavior is that of an abuser and he likely feels even more entitled to do that to you if you’re being compensated for your time. That all being said, none of this is your fault. It’s everyone’s job to be a decent human being without being forced or manipulated into it. But because of the way humans and the world is, we have to protect ourselves and be ahead of the game when doing these things with men. I truly hope you never return to this abuser and that in the future you hold strong boundaries and expectations so future SD’s know that you’re not one to be fucked with! Best of luck to you ♥️",
            "author": "HollyLarsen",
            "id": "fdom49d",
            "parent_id": "t3_emccg5",
            "score": 13,
            "created_utc": 1578607932.0,
            "replies": [
                {
                    "body": "Yes.. thank you <3 \nI thought by accepting a low ppm it would be a good way to go out and scope out the situation in a low risk way where i didnt feel pressured to have sex if i didn't want. lol WRONG.",
                    "author": null,
                    "id": "fdon05w",
                    "parent_id": "t1_fdom49d",
                    "score": 4,
                    "created_utc": 1578608459.0,
                    "replies": [
                        {
                            "body": "It’s a lesson learned ;) glad you’re safe in the end of it all.",
                            "author": "HollyLarsen",
                            "id": "fdqtyey",
                            "parent_id": "t1_fdon05w",
                            "score": 1,
                            "created_utc": 1578674816.0,
                            "replies": [
                                {
                                    "body": "Yes! Ugh. <3",
                                    "author": null,
                                    "id": "fdsf7pa",
                                    "parent_id": "t1_fdqtyey",
                                    "score": 1,
                                    "created_utc": 1578701366.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Thank you for sharing. So sorry this happened...\n\nI feel like making insulting body comments is a trend amongst men? Why? Is it to lower our self esteem so we will sleep with them? Makes no sense to me",
            "author": null,
            "id": "fdnpidq",
            "parent_id": "t3_emccg5",
            "score": 10,
            "created_utc": 1578590442.0,
            "replies": [
                {
                    "body": "Honestly it's so ridiculous... I'm an exercise physiology grad student. I'm in great shape. I have zero body issues. Unphased.",
                    "author": null,
                    "id": "fdnrxqk",
                    "parent_id": "t1_fdnpidq",
                    "score": 19,
                    "created_utc": 1578591615.0,
                    "replies": [
                        {
                            "body": "Good on you for leaving",
                            "author": null,
                            "id": "fdns69k",
                            "parent_id": "t1_fdnrxqk",
                            "score": 8,
                            "created_utc": 1578591752.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": ">insulting body comments is a trend\n\nI don't think it's a trend, there's always been an element of human nature that says, I need to devalue the stuff I can't have. That's why I never wanted a yacht, they're too much hassle and people who own them are pretentious. Also why I never wanted to date Giselle, she's shallow and just likes famous football players. etc.\n\nIf there's a trend, probably comes out of the PUA neg culture, but I don't really think so.",
                    "author": "2fast-2curious",
                    "id": "fdnq0z3",
                    "parent_id": "t1_fdnpidq",
                    "score": 9,
                    "created_utc": 1578590683.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Glad you got out of there, but terribly sorry it happened in the first place. You 100% did the right thing here.",
            "author": "mraspencer",
            "id": "fdnn3q2",
            "parent_id": "t3_emccg5",
            "score": 9,
            "created_utc": 1578589234.0,
            "replies": []
        },
        {
            "body": "Always control your transportation until you really trust someone.",
            "author": "LotBuilder",
            "id": "fdnsfr3",
            "parent_id": "t3_emccg5",
            "score": 7,
            "created_utc": 1578591906.0,
            "replies": []
        },
        {
            "body": "If he texts you saying he wants a second chance, tell him you'll be willing to try again if he actually pays you for the last meet/date. After he sends the money (CashApp, etc.), BLOCK. On every site and on your phone (even if you're using a fake number \\[which you hopefully are\\]), BLOCK.\n\nNow, I, of course, don't usually condone anyone baiting for payment and/or blocking after receiving a payment, but this guy owes you what you earned and is obviously a piece of trash. This is one of the few cases I think it's deserved.\n\n\\---\n\nIn the future, as others have said, always control your transportation; a good SD not only would be completely understanding of that, but any SD worth his weight in sugar will give you the money/compensate for the costs of transportation.\n\nAlso, you mentioned you thought he was taking you home? In the future, never give anyone, especially someone you just met, your home/work address. If anything, such as when they're paying for an Uber on their account, use a public place for pick-ups and drop-offs (e.g., gas stations, grocery stores, restaurants, etc. esp. ones you don't frequent often). That way if they end up batshit you don't have to worry about them knowing where you live and work and frequent.\n\nFinally, make sure to tell at least one person what you're doing, who you're with, where you're going, and what time they should expect for you to let them know you're home. Share your location with them (SnapMap, FindMyFriends, etc.)!!!  It can be embarrassing to admit, I know, but *someone* needs to know, whether it's a best friend or someone else you trust in your normal life.\n\n&#x200B;\n\nTake some time to self-care and relax, and maybe talk to your/a therapist if you can (usually colleges/universities offer \"free\" \\[paid with tuition\\] counseling services --  use them to your advantage, esp. while in the sugaring and everyday world!). This was pretty traumatizing, or at least it would be for me, so it's best to make sure you're mentally ready before continuing with any further pursuits.\n\n&#x200B;\n\nWe live and we learn and now you're smarter and wiser for this and know what to do for the future. Glad you're safe!",
            "author": "Strange_Duckling",
            "id": "fdppbze",
            "parent_id": "t3_emccg5",
            "score": 6,
            "created_utc": 1578635490.0,
            "replies": [
                {
                    "body": "Yes. Thank you so much for this advice and thorough response... thanks for caring. I am slightly traumatized in the way that I'm scared i cant trust myself or others anymore. Yeah.. he doesn't have my real phone number or my apartment number. I live in a huge winding complex..Thank you for support. <3",
                    "author": null,
                    "id": "fdpqtu1",
                    "parent_id": "t1_fdppbze",
                    "score": 3,
                    "created_utc": 1578637017.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "This is borderline kidnapping / involuntary imprisonment.\n\nKnow that the vast majority of men would not do this.\n\nBut it's also a great reminder to GPS the destination on your own phone so you're aware this is happening.\n\nHe's a douche and maybe worse. Glad you're ok!",
            "author": "marker3000",
            "id": "fdo5ooy",
            "parent_id": "t3_emccg5",
            "score": 12,
            "created_utc": 1578599343.0,
            "replies": []
        },
        {
            "body": "Heck nah I would've started making a fuss as soon as I didnt recognize where I was. Honey, I'm so glad you're okay. What a creep.\n\nDont beat yourself up but promise yourself you wont put yourself in this situation again. Either have the uber app ready or use your own vehicle but lots of scary things can happen in cars.",
            "author": "Mopsydoll",
            "id": "fdoc3sx",
            "parent_id": "t3_emccg5",
            "score": 5,
            "created_utc": 1578602482.0,
            "replies": []
        },
        {
            "body": "Here are a couple of thoughts that you may want to consider:\n\n1. you probably shouldn't expect to be successful renegotiating to a higher PPM after a short period, it just isn't going to happen\n2. guys who PPM are typically more transactional and more likely to always expect sex for their PPM\n\nI'm sorry to hear that you had a bad time, but I'm glad that you made it out of there relatively intact.",
            "author": "Exact_Method",
            "id": "fdp12m5",
            "parent_id": "t3_emccg5",
            "score": 5,
            "created_utc": 1578617478.0,
            "replies": []
        },
        {
            "body": "what a jerk",
            "author": "doctorcoolpop",
            "id": "fdnrhg2",
            "parent_id": "t3_emccg5",
            "score": 3,
            "created_utc": 1578591384.0,
            "replies": []
        },
        {
            "body": "Most guys on that site are complete assholes looking to only get laid for as little money as possible.  Trust me on that. I know this to be fact.\n\nAnyone can act and pretend to be a great guy, perfect, etc. I personally try as hard as I can not to be a jackass, bad guy, asshole, etc. and am always low-pressure and go with the flow. I try not to overstep boundaries that may or may not be there and can be very patient. Never would I want anyone to feel uncomfortable with me or to assume that I can do something or take someone somewhere without total certainty that it is okay.\n\nI am sorry about your situation and that it was your first experience. As a male, I've been lied to, ghosted, catfished, rinsed, scammed and even made uncomfortable a time or two. I've also met some very cool people and had some great times and made a few friends who are still friends even though maybe the SD/SB relationship isn't in play. And I've been burned - badly and recently. Still kinda getting over one situation.\n\nI can tell you there are really bad people on that site and really good people - and some people who may qualify as neither but are there just there to have something to do and maybe feel like they are in the chase, but not really serious about the actual pursuit. And as much as I try to be a gentleman, good person, nice guy, etc. as with any dating site or hookup situation or any relationship, I'm sure there are a few out there who think I'm a jerk or didn't handle a situation correctly or whatever. I get that. We aren't perfect and sometimes we make mistakes, but at the end of the day if the intentions are good and you haven't violated someone's trust, made them uncomfortable, purposely been deceitful, etc. ... mistakes are acceptable in life. Apologize, move on, and realize that you have have burned a bridge and leave that person alone unless they reach back out to you.\n\nGood, well-meaning people are out there. They aren't easy to find. Be patient. Be careful. Don't feel bad about your situation. It's happened to most of us at some level. If you don't expect perfection, be willing to compromise and meet halfway on some things and proceed with caution you should be able to have some good times and meet some folks who can help you out.\n\nI'm not currently on the site, but don't call me a hypocrite. I left it as a show of good faith to someone I met who apparently didn't return that to me. Oh well. Live and learn. Good  luck!",
            "author": null,
            "id": "fdnv3e8",
            "parent_id": "t3_emccg5",
            "score": 3,
            "created_utc": 1578593446.0,
            "replies": [
                {
                    "body": "I see you may have posted a number which is most likely an amount in relations to an arrangement. If this is the case, you are violating Rule#4 - \"No dollar amounts that are in reference to allowance/PPM are allowed.\"\n\nYour post will not be approved until you remove the amount.  Please read the sub [Rules](https://www.reddit.com/r/sugarlifestyleforum/comments/748zta/updated_and_clarified_rules_for_slf/?utm_source=reddit&utm_medium=usertext&utm_name=sugarlifestyleforum&utm_content=t3_91lpnr) prior to posting anything else. \n\nIf you simply posted a number not referencing a monetary amount, please message the MODs to approve your post.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/sugarlifestyleforum) if you have any questions or concerns.*",
                    "author": "AutoModerator",
                    "id": "fdnv3fv",
                    "parent_id": "t1_fdnv3e8",
                    "score": 1,
                    "created_utc": 1578593447.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Terrible SD. I'm sorry you had to deal with that. Every SB deserves better.",
            "author": "FburgBull",
            "id": "fdomuhk",
            "parent_id": "t3_emccg5",
            "score": 3,
            "created_utc": 1578608367.0,
            "replies": []
        },
        {
            "body": "He sounds abusive",
            "author": "shamloo77",
            "id": "fdp59a6",
            "parent_id": "t3_emccg5",
            "score": 3,
            "created_utc": 1578620304.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "fdnxaua",
            "parent_id": "t3_emccg5",
            "score": 7,
            "created_utc": 1578594729.0,
            "replies": [
                {
                    "body": ">Im sorry girl.. he sounds like he feels like he can take advantage :( you deserve better. its so tough when dudes hang a ppm over your head. I hate pressure. This is why i accepted a low date-only ppm. But even that was overstepped! What does he think I'm gunna put out for 3 pizzas so insane.",
                    "author": null,
                    "id": "fe3xovi",
                    "parent_id": "t1_fdnxaua",
                    "score": 1,
                    "created_utc": 1578853824.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "So sorry to hear that he made those comments towards your beautiful self!!! Glad you got out safe and sound. I've been in fairly similar situations myself, it happens to the best of us. Have a great day girly.",
            "author": "helga287",
            "id": "fdpt6yn",
            "parent_id": "t3_emccg5",
            "score": 2,
            "created_utc": 1578639516.0,
            "replies": [
                {
                    "body": "You're such a sweetheart thanks <3 sorry you've been there. We're stronger having had the experience but it is still a loss on innocence. Blessings \nXoxo",
                    "author": null,
                    "id": "fdsf547",
                    "parent_id": "t1_fdpt6yn",
                    "score": 1,
                    "created_utc": 1578701315.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I'm so sorry this happened to you. You really can't let your guard down with these dogs, no matter what they say in this forum. I'm glad you're safe, I hope he rots alone with the other abusive SDs.",
            "author": "bb_kale",
            "id": "fdq14r0",
            "parent_id": "t3_emccg5",
            "score": 2,
            "created_utc": 1578649684.0,
            "replies": []
        },
        {
            "body": "Rule one, don’t accept less than your worth. Rule two, hotels are the way forward. If the dude is wealthy and respectful he would be arranging a room with clear expectations of what would transpire after dinner.\n\nBlock this guy and never speak to him again!",
            "author": null,
            "id": "fdq3d4u",
            "parent_id": "t3_emccg5",
            "score": 2,
            "created_utc": 1578652869.0,
            "replies": [
                {
                    "body": "This sounds escortish “know your worth”, “hotels”.\n\nIf a guys single you wouldn’t just meet in a home for sex but do other things like cook at home.",
                    "author": "chitraders",
                    "id": "fdqxdh6",
                    "parent_id": "t1_fdq3d4u",
                    "score": 2,
                    "created_utc": 1578676148.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "fdrnr90",
            "parent_id": "t3_emccg5",
            "score": 2,
            "created_utc": 1578687142.0,
            "replies": [
                {
                    "body": "I am.. thanks<3",
                    "author": null,
                    "id": "fdsf6zc",
                    "parent_id": "t1_fdrnr90",
                    "score": 1,
                    "created_utc": 1578701351.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Stop getting into cars with these men.",
            "author": null,
            "id": "fdvy1ex",
            "parent_id": "t3_emccg5",
            "score": 2,
            "created_utc": 1578753056.0,
            "replies": [
                {
                    "body": "yup thanks",
                    "author": null,
                    "id": "fdxle92",
                    "parent_id": "t1_fdvy1ex",
                    "score": 1,
                    "created_utc": 1578770132.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "You had a toothbrush?",
            "author": "drunky_crowette",
            "id": "fdntdt6",
            "parent_id": "t3_emccg5",
            "score": 2,
            "created_utc": 1578592451.0,
            "replies": [
                {
                    "body": "Lmao! He had an extra new one...",
                    "author": null,
                    "id": "fdo224g",
                    "parent_id": "t1_fdntdt6",
                    "score": 5,
                    "created_utc": 1578597459.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "You went clubbing with a SD on a second date?",
            "author": null,
            "id": "fdpnm7o",
            "parent_id": "t3_emccg5",
            "score": 1,
            "created_utc": 1578633844.0,
            "replies": []
        },
        {
            "body": "That's so crazy and could've gone left quick, glad you got out and got home safe",
            "author": "NervousWeb1",
            "id": "fdqkquv",
            "parent_id": "t3_emccg5",
            "score": 1,
            "created_utc": 1578669028.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "fdqm4be",
            "parent_id": "t3_emccg5",
            "score": 1,
            "created_utc": 1578669934.0,
            "replies": [
                {
                    "body": "This I can definitely agree.  Novelty is worth a premium than a girl you hook up with regularly.  Granted some other things can be added over time that make it more emotional, but as a guy the first time with someone has higher value.",
                    "author": "chitraders",
                    "id": "fdqvevx",
                    "parent_id": "t1_fdqm4be",
                    "score": 1,
                    "created_utc": 1578675446.0,
                    "replies": []
                },
                {
                    "body": "The ppm was a date-only ppm. \nThanks for your feedback.<3",
                    "author": null,
                    "id": "fdsfbx9",
                    "parent_id": "t1_fdqm4be",
                    "score": 1,
                    "created_utc": 1578701451.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "U r lucky u did not get gang raped.  Stay away and know as soon as you get in someone's car, u lose control.",
            "author": "AdministrativeLevel9",
            "id": "fmcfo7b",
            "parent_id": "t3_emccg5",
            "score": 1,
            "created_utc": 1585944765.0,
            "replies": [
                {
                    "body": "insert thumbs up",
                    "author": null,
                    "id": "fmgq0ez",
                    "parent_id": "t1_fmcfo7b",
                    "score": 1,
                    "created_utc": 1586054810.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "**No offense intended**; but isn't an \\`SD experience' tantamount to being an \\[young\\] escort to a DADDY? If you are expecting your SD to pick up the tab for what ever is experienced; something is typically expected in return. This is not to say the SD should have behaved the way its claimed, but as the recipient of his financial favors, is it not surprising he'd expect  something \\[sexual\\] in return? Just because you are a cute twink, or something of the sort worthy of the attention of an SD; you either reciprocate with what is obviously anticipated, or just pay your own way.",
            "author": "cldbunow",
            "id": "fdp7293",
            "parent_id": "t3_emccg5",
            "score": -4,
            "created_utc": 1578621512.0,
            "replies": []
        },
        {
            "body": "Wait what did he do wrong?\n\nHe took you to dinner and around town?  Sounds like you enjoyed that.\n\nAfterwards you get in his car.  At 2 am.  Every guy in the world is taking the girl back to their place at 2 am unless you specifically talked about him dropping you off at your place.\n\nYou prior discussed a deal.  Got in his car at 2 am.  He’s expecting sex and it would be rational.\n\nSo he got a little salty when you were going to bed and flipped the switch?  Sort of normal there.\n\nHe then apologized?\n\nI’m not seeing anything here he did that was out of line.  A little bit of late night insults aren’t great but it’s not some huge tragedy.",
            "author": "chitraders",
            "id": "fdnsqaq",
            "parent_id": "t3_emccg5",
            "score": -23,
            "created_utc": 1578592074.0,
            "replies": [
                {
                    "body": ">Every guy in the world is taking the girl back to their place at 2 am unless you specifically talked about him dropping you off at your place.  \n>  \n>You prior discussed a deal.  Got in his car at 2 am.  He’s expecting sex and it would be rational.  \n>  \n>So he got a little salty when you were going to bed and flipped the switch?  Sort of normal there.\n\nThis post is bizarre.\n\nFirst, she states it was her understanding he was driving to her home -- certainly as the driver of the car, the man, and late at night, it was incumbent on him to confirm with her that his house was OK.\n\nSecond, it doesn't appear she ever told him sex was OK, and his frustrated assumption that they would have sex is not a license to start insulting/bullying her when she says no.  That is not \"sort of normal\" behavior, it's shitty behavior.  Speaking as a guy here.  I've been told \"no\" before when I expected \"yes\" and I never flipped out.\n\nThird, on what basis are you trivializing how upsetting this was?  Late at night, his house, he wanted sex, and he's insulting/bullying her.  That could be a scary event which would explain why she was literally left in tears.\n\nThat's not to say she couldn't have protected herself better, but why you decided to go out on a limb defending this creep is beyond me.",
                    "author": null,
                    "id": "fdnud76",
                    "parent_id": "t1_fdnsqaq",
                    "score": 22,
                    "created_utc": 1578593015.0,
                    "replies": [
                        {
                            "body": "Thank you for supporting me",
                            "author": null,
                            "id": "fdo4auq",
                            "parent_id": "t1_fdnud76",
                            "score": 7,
                            "created_utc": 1578598639.0,
                            "replies": []
                        },
                        {
                            "body": "What did he do creepy other than what I said?\n\nShe’s a grown ass lady.  Unless explicit discussed that he’s dropping you off at your place then he’s taking you home.  Like are people idiots?\n\nNow if he lied to her it’s a different story.\n\nAnd if the argument escalating past a certain point it’s a different story.\n\nBut nothing in her post indicates he was the one breaking normal social protocol.\n\nAlso I’m more concerned with drunk driving in this story and not be aware of that.",
                            "author": "chitraders",
                            "id": "fdnvdv1",
                            "parent_id": "t1_fdnud76",
                            "score": -14,
                            "created_utc": 1578593615.0,
                            "replies": [
                                {
                                    "body": "You think it’s “normal social protocol” to take a girl late at night to your house without clearing it with her (surprise!) then when you get there and she doesn’t want sex start insulting/bullying her? Wtf.",
                                    "author": null,
                                    "id": "fdo5jm8",
                                    "parent_id": "t1_fdnvdv1",
                                    "score": 9,
                                    "created_utc": 1578599270.0,
                                    "replies": [
                                        {
                                            "body": "She already consented at the start of the date.\n\n“I agreed to ppm”\n\nShe never removed consent.  \n\nWhere do you think you are going at the end of the night.  IMO this mostly seems to be about her immaturity and inability to communicate.",
                                            "author": "chitraders",
                                            "id": "fdo681w",
                                            "parent_id": "t1_fdo5jm8",
                                            "score": -7,
                                            "created_utc": 1578599602.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Did your definition of consent come from some Jeffrey Epstein guidebook...? \n\nConsent does not mean agreeing to a PPM. People agree to PPMs or allowance often before the M&G. It’s not the same as consent.\n\nConsent means when one adult actively agrees to have sex with another adult. Setting a PPM is not doing that. Now let’s move on to the subject of rape, since you are having trouble understanding basic ass definitions. You can be charged with rape if you do not receive AFFIRMATIVE CONSENT. Any coercion or pressure can classify the sexual actions proceeding as rape. So the fact that he drove her to his home without permission and pressured her to engage in a sexual act is one stones throw away from sexual assault. \n\nStop taking notes from Kevin Spacey, it’s not a good look.",
                    "author": "cute_milkdud",
                    "id": "fdo95py",
                    "parent_id": "t1_fdnsqaq",
                    "score": 15,
                    "created_utc": 1578601042.0,
                    "replies": [
                        {
                            "body": "lmao! the epstein guidebook. so funny.",
                            "author": null,
                            "id": "fdoj49n",
                            "parent_id": "t1_fdo95py",
                            "score": 6,
                            "created_utc": 1578606183.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "You sound like a real keeper.",
                    "author": "cute_milkdud",
                    "id": "fdntupf",
                    "parent_id": "t1_fdnsqaq",
                    "score": 11,
                    "created_utc": 1578592719.0,
                    "replies": []
                },
                {
                    "body": "OP, ignore this sociopath",
                    "author": "fuzzyfuzzbourne",
                    "id": "fdo3lyr",
                    "parent_id": "t1_fdnsqaq",
                    "score": 11,
                    "created_utc": 1578598271.0,
                    "replies": []
                },
                {
                    "body": "You sound like an actual abusive rapist. You're literally the worst.\n\nI have been sugaring for a few months and have been seeing a few men regularly. I have not slept with any of them and I don't intend to unless all my bills are being paid.\n\nYou also think insulting, ie abusing a woman because you're not getting sex from her, is normal and okay as long as an apology was made?\n\nIf a woman stays out until 2 am with someone and he paid for dinner and drinks are you seriously saying sex is on the table?\n\nI have been out until 4 am before and was taken back home with a goodnight smooch at the door. \n\nLadies do not listen to this dusty, abusive, psychopathic rapist.",
                    "author": "illuminaughtyxox",
                    "id": "fdnuzp0",
                    "parent_id": "t1_fdnsqaq",
                    "score": 21,
                    "created_utc": 1578593385.0,
                    "replies": [
                        {
                            "body": "I’m not questioning her right to withdraw consent.\n\nI’m saying her behavior indicated consent.\n\nI also don’t know exactly what she or he said.",
                            "author": "chitraders",
                            "id": "fdnwing",
                            "parent_id": "t1_fdnuzp0",
                            "score": -7,
                            "created_utc": 1578594277.0,
                            "replies": [
                                {
                                    "body": "On what planet does getting in a vehicle at a certain time period translate to \" yes let's have sex\"\n\nYour mind operates in a sick, twisted fashion. You should be in therapy. \n\nYou should not be taking anyone on dates.\n\nYou should stay away from other human beings.",
                                    "author": "illuminaughtyxox",
                                    "id": "fdo0bc7",
                                    "parent_id": "t1_fdnwing",
                                    "score": 17,
                                    "created_utc": 1578596484.0,
                                    "replies": [
                                        {
                                            "body": "“So I accepted a ppm”\n\nShe already agreed to sex.  Why would he take her anywhere else besides his own place when the night was over?\n\nI mean I feel like she deserves a Darwin Award for her stupidity.",
                                            "author": "chitraders",
                                            "id": "fdo22m5",
                                            "parent_id": "t1_fdo0bc7",
                                            "score": -6,
                                            "created_utc": 1578597466.0,
                                            "replies": [
                                                {
                                                    "body": "I have done one pay per MEET, and it was just incentive to get me to go on the date. Sex was never brought up. I did not sleep with them. I never would do that.\n\nObviously you have a very skewed idea of how this all works.",
                                                    "author": "illuminaughtyxox",
                                                    "id": "fdo2ppv",
                                                    "parent_id": "t1_fdo22m5",
                                                    "score": 11,
                                                    "created_utc": 1578597803.0,
                                                    "replies": [
                                                        {
                                                            "body": "“I agree to ppm”\n\nOn this board translates to I agreed to have sex with him and he would give me money.\n\nWhat you are referring to is a paid meet and greet.\n\nSo read her entire rant under the lens of we agreed to have sex but were going on a date first.\n\nThen her entire rant becomes I consented to sex and he took me around town for 6 hours.  At 2 am I once again consented by getting into his vehicle at the end of the night.  At 230 am I decided to change my mind and rescind consent.\n\nNow it’s a girls right to remove consent at any time.  But after spending 6 hours with her he has every right to be a bit upset.",
                                                            "author": "chitraders",
                                                            "id": "fdo37j3",
                                                            "parent_id": "t1_fdo2ppv",
                                                            "score": -1,
                                                            "created_utc": 1578598063.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Ppm was clearly a \"date only\" ppm.",
                                                                    "author": null,
                                                                    "id": "fdo6lp6",
                                                                    "parent_id": "t1_fdo37j3",
                                                                    "score": 7,
                                                                    "created_utc": 1578599790.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "It seems as though you miscommunicated that.\n\nThat needs to be specified as the default assumption is for more.  If you did not specify it was platonic then I would consider your own bad communications as at fault.",
                                                                            "author": "chitraders",
                                                                            "id": "fdo7h2a",
                                                                            "parent_id": "t1_fdo6lp6",
                                                                            "score": 1,
                                                                            "created_utc": 1578600219.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "\" It seems as though you miscommunicated that. \"\n\nIt seems as though you have zero basis to believe that.  The much more likely possibility that he was hoping that sneakily bringing her home to his place and pressuring her would lead to sex.  There are guys who think that's acceptable behavior, which seems to include you.",
                                                                                    "author": null,
                                                                                    "id": "fdoa60i",
                                                                                    "parent_id": "t1_fdo7h2a",
                                                                                    "score": 12,
                                                                                    "created_utc": 1578601529.0,
                                                                                    "replies": [
                                                                                        {
                                                                                            "body": "Many girls like to follow and let the girl lead and not be explicit.  You act like girls are innocent butterflies incapable of doing anything.  All she had to do was ask “where are we going”.  Or maybe after 5 min when they were going the wrong way - “hey I don’t want to go back to your place can we turn around”\n\nI’m just sick of these posts where we act like girls are incapable of adult communications.  She wasn’t drugged.  No physical violence occurred.  He didn’t refuse to take her home.\n\nBut I get it you are an anti-feminists and don’t believe grown women are capable of adult behaviors.",
                                                                                            "author": "chitraders",
                                                                                            "id": "fdoaxwp",
                                                                                            "parent_id": "t1_fdoa60i",
                                                                                            "score": 1,
                                                                                            "created_utc": 1578601915.0,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "body": "I suggested in my first response to you that she could've protected herself better.  But that doesn't justify him verbally abusing her at the end of the night which was the whole reason she posted this thread, and you jumped into this thread to defend him, and that's what I objected to.",
                                                                                                    "author": null,
                                                                                                    "id": "fdpawzb",
                                                                                                    "parent_id": "t1_fdoaxwp",
                                                                                                    "score": 1,
                                                                                                    "created_utc": 1578624089.0,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "body": "You don’t even know what he said.  After she admitted making a half dozen mistakes you are going to take her word for it that he was insanely abusive?\n\nQuit white knighting and just give her the truth.  You don’t know her actions.  You know the stupid things she did.",
                                                                                                            "author": "chitraders",
                                                                                                            "id": "fdpeik8",
                                                                                                            "parent_id": "t1_fdpawzb",
                                                                                                            "score": 1,
                                                                                                            "created_utc": 1578626577.0,
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "body": "She probably did make mistakes, but that doesn't make her a liar.  You really seem to have disliked her from the start. \n\nAnd you have a skewed view of male-female interactions.  If a girl voluntarily goes back with you to your place, it's not a license to verbally or otherwise abuse her if she doesn't want to have sex after she gets there.",
                                                                                                                    "author": null,
                                                                                                                    "id": "fdpev0z",
                                                                                                                    "parent_id": "t1_fdpeik8",
                                                                                                                    "score": 1,
                                                                                                                    "created_utc": 1578626823.0,
                                                                                                                    "replies": [
                                                                                                                        {
                                                                                                                            "body": "I dislike people who blame others for the situations they put themselves in.\n\nI don’t agree with him yelling at her but I can understand why he would be upset.  It’s not like she got assaulted or anything.  Just words.\n\nShe also wasted his time.  \n\nI believe in equality and people taking responsibility for their own actions.",
                                                                                                                            "author": "chitraders",
                                                                                                                            "id": "fdpg8ls",
                                                                                                                            "parent_id": "t1_fdpev0z",
                                                                                                                            "score": 1,
                                                                                                                            "created_utc": 1578627823.0,
                                                                                                                            "replies": []
                                                                                                                        }
                                                                                                                    ]
                                                                                                                }
                                                                                                            ]
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                },
                                                                                {
                                                                                    "body": "\"Im sorry, I thought this car came with leather interior.\"  LOL \nwhy didnt he ask??? the car doesn't just *come* with *leather interior*.",
                                                                                    "author": null,
                                                                                    "id": "fdoioh7",
                                                                                    "parent_id": "t1_fdo7h2a",
                                                                                    "score": 5,
                                                                                    "created_utc": 1578605929.0,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "body": "How about having a rational conversation instead of a knee jerk emotional reaction?\n\nMany people would consider sexual consent being given in term of the sugar bowl.   \n\nDebate the reason for the difference instead of resorting to emotion.",
                                            "author": "houstonsd",
                                            "id": "fdo6erw",
                                            "parent_id": "t1_fdo0bc7",
                                            "score": -9,
                                            "created_utc": 1578599694.0,
                                            "replies": [
                                                {
                                                    "body": "I'm emotionally unstable in what way? Because I'm describing this person's behavior as predatory?\n\nI have gone over every point thoroughly.\n\nIt's hilarious that you would actually have something negative to say about me.\n\nWomen should be emotional when a predator openly proclaims such crazy sounding things.\n\nOther women might read that and think \"he's right I did something wrong\" or \"okay next time I'll let him do that.\"\n\nDon't pull the \"hysterical woman\" card on me.",
                                                    "author": "illuminaughtyxox",
                                                    "id": "fdo7mix",
                                                    "parent_id": "t1_fdo6erw",
                                                    "score": 11,
                                                    "created_utc": 1578600295.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Imagine thinking it’s “normal” to start verbally abusing someone cause they won’t fuck you at 3am. You sound like an actual sociopath.",
                    "author": "WandererOfInterwebs",
                    "id": "fdp0qt5",
                    "parent_id": "t1_fdnsqaq",
                    "score": 6,
                    "created_utc": 1578617257.0,
                    "replies": []
                },
                {
                    "body": "lolz",
                    "author": "2fast-2curious",
                    "id": "fdntgty",
                    "parent_id": "t1_fdnsqaq",
                    "score": 1,
                    "created_utc": 1578592498.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Consider nasty comments by a dirtbag as affirmation of your goodness.",
            "author": "pinotandsugar",
            "id": "fdnunvd",
            "parent_id": "t1_fdnowed",
            "score": 23,
            "created_utc": 1578593191.0,
            "replies": []
        },
        {
            "body": "T H I S\n\nTake this as a good lesson since you’re back home safe. Everything about the situation screamed danger and manipulation, as unsettling as it may have been you still dodged a huge bullet. I agree with this comment, focus on self care for now.",
            "author": "isavvi",
            "id": "fdpyg1u",
            "parent_id": "t1_fdnowed",
            "score": 3,
            "created_utc": 1578645954.0,
            "replies": []
        },
        {
            "body": "Thank you... \nI really do appreciate the response. I've been feeling hard on myself about it",
            "author": null,
            "id": "fdnns59",
            "parent_id": "t1_fdnn8oq",
            "score": 15,
            "created_utc": 1578589614.0,
            "replies": [
                {
                    "body": "I think it's okay to be a little hard on yourself, but you 1. took control in the end, and 2. in retrospect figured out where you could have taken control sooner (and a new safety guideline on transportation).   So, it's ok to forgive yourself, too.  In the end he's the asshole, you just need to brush up on your asshole management skills :)",
                    "author": "Azurecole",
                    "id": "fdnp1ju",
                    "parent_id": "t1_fdnns59",
                    "score": 19,
                    "created_utc": 1578590220.0,
                    "replies": [
                        {
                            "body": "My dude. If someone handed me a resume that said they had asshole management skills, I would assume they knew when to pass on the chipotle, and how to keep a proper inventory of toilet paper.",
                            "author": "TastySpermDispenser",
                            "id": "fdnsqwb",
                            "parent_id": "t1_fdnp1ju",
                            "score": 7,
                            "created_utc": 1578592084.0,
                            "replies": [
                                {
                                    "body": "So.... I'm  hired?",
                                    "author": "Azurecole",
                                    "id": "fdntai4",
                                    "parent_id": "t1_fdnsqwb",
                                    "score": 4,
                                    "created_utc": 1578592397.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "I fucking do for sure.",
                            "author": null,
                            "id": "fdnrz1k",
                            "parent_id": "t1_fdnp1ju",
                            "score": 3,
                            "created_utc": 1578591635.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "It was so Martin Scorsese how we were yelling on the lawn in the suburbs at 4am in my heels lol! \nI feel proud for getting out even though it was way overdue.",
            "author": null,
            "id": "fdnmrqp",
            "parent_id": "t1_fdnmlwx",
            "score": 51,
            "created_utc": 1578589041.0,
            "replies": [
                {
                    "body": ">I feel proud for getting out even though it was way overdue.\n\nYou should. Takes a lot of emotional (and at 4 am, physical) energy to make the right move there. Most wouldn't, you did, thanks for sharing the story.\n\nBTW, kinda weird that he had you meet friends that early - not sure if there was a reason for that, but that would almost never happen in a normal SR. For reference, my SB has met two family members but it was totally incidental (we just happened to be at a certain event same time to met up) and we had been together for like 9 months. No SB has ever met any friends of mine.\n\nAnd seems obvious he was pouring tons of drinks to get you wasted so he could pull off the \"oh, we're at my place\" trick.\n\nAgain, good job making the right move, love hearing when that happens!",
                    "author": "2fast-2curious",
                    "id": "fdnnr3q",
                    "parent_id": "t1_fdnmrqp",
                    "score": 43,
                    "created_utc": 1578589599.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Yeah, how does that work exactly? \"Dear SD, my performace last year was impeccable and I feel I have added value, so my new rate adjusted for inflation should be $xxxxx\".\nI think it is setting yourself up for failure and disappointment later down the line.🤷‍♀️",
            "author": "himynameis--76324675",
            "id": "fdqhgou",
            "parent_id": "t1_fdnxts5",
            "score": 2,
            "created_utc": 1578666770.0,
            "replies": []
        },
        {
            "body": "Yes.. thank you <3 \nI thought by accepting a low ppm it would be a good way to go out and scope out the situation in a low risk way where i didnt feel pressured to have sex if i didn't want. lol WRONG.",
            "author": null,
            "id": "fdon05w",
            "parent_id": "t1_fdom49d",
            "score": 4,
            "created_utc": 1578608459.0,
            "replies": [
                {
                    "body": "It’s a lesson learned ;) glad you’re safe in the end of it all.",
                    "author": "HollyLarsen",
                    "id": "fdqtyey",
                    "parent_id": "t1_fdon05w",
                    "score": 1,
                    "created_utc": 1578674816.0,
                    "replies": [
                        {
                            "body": "Yes! Ugh. <3",
                            "author": null,
                            "id": "fdsf7pa",
                            "parent_id": "t1_fdqtyey",
                            "score": 1,
                            "created_utc": 1578701366.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Honestly it's so ridiculous... I'm an exercise physiology grad student. I'm in great shape. I have zero body issues. Unphased.",
            "author": null,
            "id": "fdnrxqk",
            "parent_id": "t1_fdnpidq",
            "score": 19,
            "created_utc": 1578591615.0,
            "replies": [
                {
                    "body": "Good on you for leaving",
                    "author": null,
                    "id": "fdns69k",
                    "parent_id": "t1_fdnrxqk",
                    "score": 8,
                    "created_utc": 1578591752.0,
                    "replies": []
                }
            ]
        },
        {
            "body": ">insulting body comments is a trend\n\nI don't think it's a trend, there's always been an element of human nature that says, I need to devalue the stuff I can't have. That's why I never wanted a yacht, they're too much hassle and people who own them are pretentious. Also why I never wanted to date Giselle, she's shallow and just likes famous football players. etc.\n\nIf there's a trend, probably comes out of the PUA neg culture, but I don't really think so.",
            "author": "2fast-2curious",
            "id": "fdnq0z3",
            "parent_id": "t1_fdnpidq",
            "score": 9,
            "created_utc": 1578590683.0,
            "replies": []
        },
        {
            "body": "Yes. Thank you so much for this advice and thorough response... thanks for caring. I am slightly traumatized in the way that I'm scared i cant trust myself or others anymore. Yeah.. he doesn't have my real phone number or my apartment number. I live in a huge winding complex..Thank you for support. <3",
            "author": null,
            "id": "fdpqtu1",
            "parent_id": "t1_fdppbze",
            "score": 3,
            "created_utc": 1578637017.0,
            "replies": []
        },
        {
            "body": "I see you may have posted a number which is most likely an amount in relations to an arrangement. If this is the case, you are violating Rule#4 - \"No dollar amounts that are in reference to allowance/PPM are allowed.\"\n\nYour post will not be approved until you remove the amount.  Please read the sub [Rules](https://www.reddit.com/r/sugarlifestyleforum/comments/748zta/updated_and_clarified_rules_for_slf/?utm_source=reddit&utm_medium=usertext&utm_name=sugarlifestyleforum&utm_content=t3_91lpnr) prior to posting anything else. \n\nIf you simply posted a number not referencing a monetary amount, please message the MODs to approve your post.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/sugarlifestyleforum) if you have any questions or concerns.*",
            "author": "AutoModerator",
            "id": "fdnv3fv",
            "parent_id": "t1_fdnv3e8",
            "score": 1,
            "created_utc": 1578593447.0,
            "replies": []
        },
        {
            "body": ">Im sorry girl.. he sounds like he feels like he can take advantage :( you deserve better. its so tough when dudes hang a ppm over your head. I hate pressure. This is why i accepted a low date-only ppm. But even that was overstepped! What does he think I'm gunna put out for 3 pizzas so insane.",
            "author": null,
            "id": "fe3xovi",
            "parent_id": "t1_fdnxaua",
            "score": 1,
            "created_utc": 1578853824.0,
            "replies": []
        },
        {
            "body": "You're such a sweetheart thanks <3 sorry you've been there. We're stronger having had the experience but it is still a loss on innocence. Blessings \nXoxo",
            "author": null,
            "id": "fdsf547",
            "parent_id": "t1_fdpt6yn",
            "score": 1,
            "created_utc": 1578701315.0,
            "replies": []
        },
        {
            "body": "This sounds escortish “know your worth”, “hotels”.\n\nIf a guys single you wouldn’t just meet in a home for sex but do other things like cook at home.",
            "author": "chitraders",
            "id": "fdqxdh6",
            "parent_id": "t1_fdq3d4u",
            "score": 2,
            "created_utc": 1578676148.0,
            "replies": []
        },
        {
            "body": "I am.. thanks<3",
            "author": null,
            "id": "fdsf6zc",
            "parent_id": "t1_fdrnr90",
            "score": 1,
            "created_utc": 1578701351.0,
            "replies": []
        },
        {
            "body": "yup thanks",
            "author": null,
            "id": "fdxle92",
            "parent_id": "t1_fdvy1ex",
            "score": 1,
            "created_utc": 1578770132.0,
            "replies": []
        },
        {
            "body": "Lmao! He had an extra new one...",
            "author": null,
            "id": "fdo224g",
            "parent_id": "t1_fdntdt6",
            "score": 5,
            "created_utc": 1578597459.0,
            "replies": []
        },
        {
            "body": "This I can definitely agree.  Novelty is worth a premium than a girl you hook up with regularly.  Granted some other things can be added over time that make it more emotional, but as a guy the first time with someone has higher value.",
            "author": "chitraders",
            "id": "fdqvevx",
            "parent_id": "t1_fdqm4be",
            "score": 1,
            "created_utc": 1578675446.0,
            "replies": []
        },
        {
            "body": "The ppm was a date-only ppm. \nThanks for your feedback.<3",
            "author": null,
            "id": "fdsfbx9",
            "parent_id": "t1_fdqm4be",
            "score": 1,
            "created_utc": 1578701451.0,
            "replies": []
        },
        {
            "body": "insert thumbs up",
            "author": null,
            "id": "fmgq0ez",
            "parent_id": "t1_fmcfo7b",
            "score": 1,
            "created_utc": 1586054810.0,
            "replies": []
        },
        {
            "body": ">Every guy in the world is taking the girl back to their place at 2 am unless you specifically talked about him dropping you off at your place.  \n>  \n>You prior discussed a deal.  Got in his car at 2 am.  He’s expecting sex and it would be rational.  \n>  \n>So he got a little salty when you were going to bed and flipped the switch?  Sort of normal there.\n\nThis post is bizarre.\n\nFirst, she states it was her understanding he was driving to her home -- certainly as the driver of the car, the man, and late at night, it was incumbent on him to confirm with her that his house was OK.\n\nSecond, it doesn't appear she ever told him sex was OK, and his frustrated assumption that they would have sex is not a license to start insulting/bullying her when she says no.  That is not \"sort of normal\" behavior, it's shitty behavior.  Speaking as a guy here.  I've been told \"no\" before when I expected \"yes\" and I never flipped out.\n\nThird, on what basis are you trivializing how upsetting this was?  Late at night, his house, he wanted sex, and he's insulting/bullying her.  That could be a scary event which would explain why she was literally left in tears.\n\nThat's not to say she couldn't have protected herself better, but why you decided to go out on a limb defending this creep is beyond me.",
            "author": null,
            "id": "fdnud76",
            "parent_id": "t1_fdnsqaq",
            "score": 22,
            "created_utc": 1578593015.0,
            "replies": [
                {
                    "body": "Thank you for supporting me",
                    "author": null,
                    "id": "fdo4auq",
                    "parent_id": "t1_fdnud76",
                    "score": 7,
                    "created_utc": 1578598639.0,
                    "replies": []
                },
                {
                    "body": "What did he do creepy other than what I said?\n\nShe’s a grown ass lady.  Unless explicit discussed that he’s dropping you off at your place then he’s taking you home.  Like are people idiots?\n\nNow if he lied to her it’s a different story.\n\nAnd if the argument escalating past a certain point it’s a different story.\n\nBut nothing in her post indicates he was the one breaking normal social protocol.\n\nAlso I’m more concerned with drunk driving in this story and not be aware of that.",
                    "author": "chitraders",
                    "id": "fdnvdv1",
                    "parent_id": "t1_fdnud76",
                    "score": -14,
                    "created_utc": 1578593615.0,
                    "replies": [
                        {
                            "body": "You think it’s “normal social protocol” to take a girl late at night to your house without clearing it with her (surprise!) then when you get there and she doesn’t want sex start insulting/bullying her? Wtf.",
                            "author": null,
                            "id": "fdo5jm8",
                            "parent_id": "t1_fdnvdv1",
                            "score": 9,
                            "created_utc": 1578599270.0,
                            "replies": [
                                {
                                    "body": "She already consented at the start of the date.\n\n“I agreed to ppm”\n\nShe never removed consent.  \n\nWhere do you think you are going at the end of the night.  IMO this mostly seems to be about her immaturity and inability to communicate.",
                                    "author": "chitraders",
                                    "id": "fdo681w",
                                    "parent_id": "t1_fdo5jm8",
                                    "score": -7,
                                    "created_utc": 1578599602.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Did your definition of consent come from some Jeffrey Epstein guidebook...? \n\nConsent does not mean agreeing to a PPM. People agree to PPMs or allowance often before the M&G. It’s not the same as consent.\n\nConsent means when one adult actively agrees to have sex with another adult. Setting a PPM is not doing that. Now let’s move on to the subject of rape, since you are having trouble understanding basic ass definitions. You can be charged with rape if you do not receive AFFIRMATIVE CONSENT. Any coercion or pressure can classify the sexual actions proceeding as rape. So the fact that he drove her to his home without permission and pressured her to engage in a sexual act is one stones throw away from sexual assault. \n\nStop taking notes from Kevin Spacey, it’s not a good look.",
            "author": "cute_milkdud",
            "id": "fdo95py",
            "parent_id": "t1_fdnsqaq",
            "score": 15,
            "created_utc": 1578601042.0,
            "replies": [
                {
                    "body": "lmao! the epstein guidebook. so funny.",
                    "author": null,
                    "id": "fdoj49n",
                    "parent_id": "t1_fdo95py",
                    "score": 6,
                    "created_utc": 1578606183.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "You sound like a real keeper.",
            "author": "cute_milkdud",
            "id": "fdntupf",
            "parent_id": "t1_fdnsqaq",
            "score": 11,
            "created_utc": 1578592719.0,
            "replies": []
        },
        {
            "body": "OP, ignore this sociopath",
            "author": "fuzzyfuzzbourne",
            "id": "fdo3lyr",
            "parent_id": "t1_fdnsqaq",
            "score": 11,
            "created_utc": 1578598271.0,
            "replies": []
        },
        {
            "body": "You sound like an actual abusive rapist. You're literally the worst.\n\nI have been sugaring for a few months and have been seeing a few men regularly. I have not slept with any of them and I don't intend to unless all my bills are being paid.\n\nYou also think insulting, ie abusing a woman because you're not getting sex from her, is normal and okay as long as an apology was made?\n\nIf a woman stays out until 2 am with someone and he paid for dinner and drinks are you seriously saying sex is on the table?\n\nI have been out until 4 am before and was taken back home with a goodnight smooch at the door. \n\nLadies do not listen to this dusty, abusive, psychopathic rapist.",
            "author": "illuminaughtyxox",
            "id": "fdnuzp0",
            "parent_id": "t1_fdnsqaq",
            "score": 21,
            "created_utc": 1578593385.0,
            "replies": [
                {
                    "body": "I’m not questioning her right to withdraw consent.\n\nI’m saying her behavior indicated consent.\n\nI also don’t know exactly what she or he said.",
                    "author": "chitraders",
                    "id": "fdnwing",
                    "parent_id": "t1_fdnuzp0",
                    "score": -7,
                    "created_utc": 1578594277.0,
                    "replies": [
                        {
                            "body": "On what planet does getting in a vehicle at a certain time period translate to \" yes let's have sex\"\n\nYour mind operates in a sick, twisted fashion. You should be in therapy. \n\nYou should not be taking anyone on dates.\n\nYou should stay away from other human beings.",
                            "author": "illuminaughtyxox",
                            "id": "fdo0bc7",
                            "parent_id": "t1_fdnwing",
                            "score": 17,
                            "created_utc": 1578596484.0,
                            "replies": [
                                {
                                    "body": "“So I accepted a ppm”\n\nShe already agreed to sex.  Why would he take her anywhere else besides his own place when the night was over?\n\nI mean I feel like she deserves a Darwin Award for her stupidity.",
                                    "author": "chitraders",
                                    "id": "fdo22m5",
                                    "parent_id": "t1_fdo0bc7",
                                    "score": -6,
                                    "created_utc": 1578597466.0,
                                    "replies": [
                                        {
                                            "body": "I have done one pay per MEET, and it was just incentive to get me to go on the date. Sex was never brought up. I did not sleep with them. I never would do that.\n\nObviously you have a very skewed idea of how this all works.",
                                            "author": "illuminaughtyxox",
                                            "id": "fdo2ppv",
                                            "parent_id": "t1_fdo22m5",
                                            "score": 11,
                                            "created_utc": 1578597803.0,
                                            "replies": [
                                                {
                                                    "body": "“I agree to ppm”\n\nOn this board translates to I agreed to have sex with him and he would give me money.\n\nWhat you are referring to is a paid meet and greet.\n\nSo read her entire rant under the lens of we agreed to have sex but were going on a date first.\n\nThen her entire rant becomes I consented to sex and he took me around town for 6 hours.  At 2 am I once again consented by getting into his vehicle at the end of the night.  At 230 am I decided to change my mind and rescind consent.\n\nNow it’s a girls right to remove consent at any time.  But after spending 6 hours with her he has every right to be a bit upset.",
                                                    "author": "chitraders",
                                                    "id": "fdo37j3",
                                                    "parent_id": "t1_fdo2ppv",
                                                    "score": -1,
                                                    "created_utc": 1578598063.0,
                                                    "replies": [
                                                        {
                                                            "body": "Ppm was clearly a \"date only\" ppm.",
                                                            "author": null,
                                                            "id": "fdo6lp6",
                                                            "parent_id": "t1_fdo37j3",
                                                            "score": 7,
                                                            "created_utc": 1578599790.0,
                                                            "replies": [
                                                                {
                                                                    "body": "It seems as though you miscommunicated that.\n\nThat needs to be specified as the default assumption is for more.  If you did not specify it was platonic then I would consider your own bad communications as at fault.",
                                                                    "author": "chitraders",
                                                                    "id": "fdo7h2a",
                                                                    "parent_id": "t1_fdo6lp6",
                                                                    "score": 1,
                                                                    "created_utc": 1578600219.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "\" It seems as though you miscommunicated that. \"\n\nIt seems as though you have zero basis to believe that.  The much more likely possibility that he was hoping that sneakily bringing her home to his place and pressuring her would lead to sex.  There are guys who think that's acceptable behavior, which seems to include you.",
                                                                            "author": null,
                                                                            "id": "fdoa60i",
                                                                            "parent_id": "t1_fdo7h2a",
                                                                            "score": 12,
                                                                            "created_utc": 1578601529.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "Many girls like to follow and let the girl lead and not be explicit.  You act like girls are innocent butterflies incapable of doing anything.  All she had to do was ask “where are we going”.  Or maybe after 5 min when they were going the wrong way - “hey I don’t want to go back to your place can we turn around”\n\nI’m just sick of these posts where we act like girls are incapable of adult communications.  She wasn’t drugged.  No physical violence occurred.  He didn’t refuse to take her home.\n\nBut I get it you are an anti-feminists and don’t believe grown women are capable of adult behaviors.",
                                                                                    "author": "chitraders",
                                                                                    "id": "fdoaxwp",
                                                                                    "parent_id": "t1_fdoa60i",
                                                                                    "score": 1,
                                                                                    "created_utc": 1578601915.0,
                                                                                    "replies": [
                                                                                        {
                                                                                            "body": "I suggested in my first response to you that she could've protected herself better.  But that doesn't justify him verbally abusing her at the end of the night which was the whole reason she posted this thread, and you jumped into this thread to defend him, and that's what I objected to.",
                                                                                            "author": null,
                                                                                            "id": "fdpawzb",
                                                                                            "parent_id": "t1_fdoaxwp",
                                                                                            "score": 1,
                                                                                            "created_utc": 1578624089.0,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "body": "You don’t even know what he said.  After she admitted making a half dozen mistakes you are going to take her word for it that he was insanely abusive?\n\nQuit white knighting and just give her the truth.  You don’t know her actions.  You know the stupid things she did.",
                                                                                                    "author": "chitraders",
                                                                                                    "id": "fdpeik8",
                                                                                                    "parent_id": "t1_fdpawzb",
                                                                                                    "score": 1,
                                                                                                    "created_utc": 1578626577.0,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "body": "She probably did make mistakes, but that doesn't make her a liar.  You really seem to have disliked her from the start. \n\nAnd you have a skewed view of male-female interactions.  If a girl voluntarily goes back with you to your place, it's not a license to verbally or otherwise abuse her if she doesn't want to have sex after she gets there.",
                                                                                                            "author": null,
                                                                                                            "id": "fdpev0z",
                                                                                                            "parent_id": "t1_fdpeik8",
                                                                                                            "score": 1,
                                                                                                            "created_utc": 1578626823.0,
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "body": "I dislike people who blame others for the situations they put themselves in.\n\nI don’t agree with him yelling at her but I can understand why he would be upset.  It’s not like she got assaulted or anything.  Just words.\n\nShe also wasted his time.  \n\nI believe in equality and people taking responsibility for their own actions.",
                                                                                                                    "author": "chitraders",
                                                                                                                    "id": "fdpg8ls",
                                                                                                                    "parent_id": "t1_fdpev0z",
                                                                                                                    "score": 1,
                                                                                                                    "created_utc": 1578627823.0,
                                                                                                                    "replies": []
                                                                                                                }
                                                                                                            ]
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        },
                                                                        {
                                                                            "body": "\"Im sorry, I thought this car came with leather interior.\"  LOL \nwhy didnt he ask??? the car doesn't just *come* with *leather interior*.",
                                                                            "author": null,
                                                                            "id": "fdoioh7",
                                                                            "parent_id": "t1_fdo7h2a",
                                                                            "score": 5,
                                                                            "created_utc": 1578605929.0,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "How about having a rational conversation instead of a knee jerk emotional reaction?\n\nMany people would consider sexual consent being given in term of the sugar bowl.   \n\nDebate the reason for the difference instead of resorting to emotion.",
                                    "author": "houstonsd",
                                    "id": "fdo6erw",
                                    "parent_id": "t1_fdo0bc7",
                                    "score": -9,
                                    "created_utc": 1578599694.0,
                                    "replies": [
                                        {
                                            "body": "I'm emotionally unstable in what way? Because I'm describing this person's behavior as predatory?\n\nI have gone over every point thoroughly.\n\nIt's hilarious that you would actually have something negative to say about me.\n\nWomen should be emotional when a predator openly proclaims such crazy sounding things.\n\nOther women might read that and think \"he's right I did something wrong\" or \"okay next time I'll let him do that.\"\n\nDon't pull the \"hysterical woman\" card on me.",
                                            "author": "illuminaughtyxox",
                                            "id": "fdo7mix",
                                            "parent_id": "t1_fdo6erw",
                                            "score": 11,
                                            "created_utc": 1578600295.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Imagine thinking it’s “normal” to start verbally abusing someone cause they won’t fuck you at 3am. You sound like an actual sociopath.",
            "author": "WandererOfInterwebs",
            "id": "fdp0qt5",
            "parent_id": "t1_fdnsqaq",
            "score": 6,
            "created_utc": 1578617257.0,
            "replies": []
        },
        {
            "body": "lolz",
            "author": "2fast-2curious",
            "id": "fdntgty",
            "parent_id": "t1_fdnsqaq",
            "score": 1,
            "created_utc": 1578592498.0,
            "replies": []
        },
        {
            "body": "I think it's okay to be a little hard on yourself, but you 1. took control in the end, and 2. in retrospect figured out where you could have taken control sooner (and a new safety guideline on transportation).   So, it's ok to forgive yourself, too.  In the end he's the asshole, you just need to brush up on your asshole management skills :)",
            "author": "Azurecole",
            "id": "fdnp1ju",
            "parent_id": "t1_fdnns59",
            "score": 19,
            "created_utc": 1578590220.0,
            "replies": [
                {
                    "body": "My dude. If someone handed me a resume that said they had asshole management skills, I would assume they knew when to pass on the chipotle, and how to keep a proper inventory of toilet paper.",
                    "author": "TastySpermDispenser",
                    "id": "fdnsqwb",
                    "parent_id": "t1_fdnp1ju",
                    "score": 7,
                    "created_utc": 1578592084.0,
                    "replies": [
                        {
                            "body": "So.... I'm  hired?",
                            "author": "Azurecole",
                            "id": "fdntai4",
                            "parent_id": "t1_fdnsqwb",
                            "score": 4,
                            "created_utc": 1578592397.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "I fucking do for sure.",
                    "author": null,
                    "id": "fdnrz1k",
                    "parent_id": "t1_fdnp1ju",
                    "score": 3,
                    "created_utc": 1578591635.0,
                    "replies": []
                }
            ]
        },
        {
            "body": ">I feel proud for getting out even though it was way overdue.\n\nYou should. Takes a lot of emotional (and at 4 am, physical) energy to make the right move there. Most wouldn't, you did, thanks for sharing the story.\n\nBTW, kinda weird that he had you meet friends that early - not sure if there was a reason for that, but that would almost never happen in a normal SR. For reference, my SB has met two family members but it was totally incidental (we just happened to be at a certain event same time to met up) and we had been together for like 9 months. No SB has ever met any friends of mine.\n\nAnd seems obvious he was pouring tons of drinks to get you wasted so he could pull off the \"oh, we're at my place\" trick.\n\nAgain, good job making the right move, love hearing when that happens!",
            "author": "2fast-2curious",
            "id": "fdnnr3q",
            "parent_id": "t1_fdnmrqp",
            "score": 43,
            "created_utc": 1578589599.0,
            "replies": []
        },
        {
            "body": "It’s a lesson learned ;) glad you’re safe in the end of it all.",
            "author": "HollyLarsen",
            "id": "fdqtyey",
            "parent_id": "t1_fdon05w",
            "score": 1,
            "created_utc": 1578674816.0,
            "replies": [
                {
                    "body": "Yes! Ugh. <3",
                    "author": null,
                    "id": "fdsf7pa",
                    "parent_id": "t1_fdqtyey",
                    "score": 1,
                    "created_utc": 1578701366.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Good on you for leaving",
            "author": null,
            "id": "fdns69k",
            "parent_id": "t1_fdnrxqk",
            "score": 8,
            "created_utc": 1578591752.0,
            "replies": []
        },
        {
            "body": "Thank you for supporting me",
            "author": null,
            "id": "fdo4auq",
            "parent_id": "t1_fdnud76",
            "score": 7,
            "created_utc": 1578598639.0,
            "replies": []
        },
        {
            "body": "What did he do creepy other than what I said?\n\nShe’s a grown ass lady.  Unless explicit discussed that he’s dropping you off at your place then he’s taking you home.  Like are people idiots?\n\nNow if he lied to her it’s a different story.\n\nAnd if the argument escalating past a certain point it’s a different story.\n\nBut nothing in her post indicates he was the one breaking normal social protocol.\n\nAlso I’m more concerned with drunk driving in this story and not be aware of that.",
            "author": "chitraders",
            "id": "fdnvdv1",
            "parent_id": "t1_fdnud76",
            "score": -14,
            "created_utc": 1578593615.0,
            "replies": [
                {
                    "body": "You think it’s “normal social protocol” to take a girl late at night to your house without clearing it with her (surprise!) then when you get there and she doesn’t want sex start insulting/bullying her? Wtf.",
                    "author": null,
                    "id": "fdo5jm8",
                    "parent_id": "t1_fdnvdv1",
                    "score": 9,
                    "created_utc": 1578599270.0,
                    "replies": [
                        {
                            "body": "She already consented at the start of the date.\n\n“I agreed to ppm”\n\nShe never removed consent.  \n\nWhere do you think you are going at the end of the night.  IMO this mostly seems to be about her immaturity and inability to communicate.",
                            "author": "chitraders",
                            "id": "fdo681w",
                            "parent_id": "t1_fdo5jm8",
                            "score": -7,
                            "created_utc": 1578599602.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "lmao! the epstein guidebook. so funny.",
            "author": null,
            "id": "fdoj49n",
            "parent_id": "t1_fdo95py",
            "score": 6,
            "created_utc": 1578606183.0,
            "replies": []
        },
        {
            "body": "I’m not questioning her right to withdraw consent.\n\nI’m saying her behavior indicated consent.\n\nI also don’t know exactly what she or he said.",
            "author": "chitraders",
            "id": "fdnwing",
            "parent_id": "t1_fdnuzp0",
            "score": -7,
            "created_utc": 1578594277.0,
            "replies": [
                {
                    "body": "On what planet does getting in a vehicle at a certain time period translate to \" yes let's have sex\"\n\nYour mind operates in a sick, twisted fashion. You should be in therapy. \n\nYou should not be taking anyone on dates.\n\nYou should stay away from other human beings.",
                    "author": "illuminaughtyxox",
                    "id": "fdo0bc7",
                    "parent_id": "t1_fdnwing",
                    "score": 17,
                    "created_utc": 1578596484.0,
                    "replies": [
                        {
                            "body": "“So I accepted a ppm”\n\nShe already agreed to sex.  Why would he take her anywhere else besides his own place when the night was over?\n\nI mean I feel like she deserves a Darwin Award for her stupidity.",
                            "author": "chitraders",
                            "id": "fdo22m5",
                            "parent_id": "t1_fdo0bc7",
                            "score": -6,
                            "created_utc": 1578597466.0,
                            "replies": [
                                {
                                    "body": "I have done one pay per MEET, and it was just incentive to get me to go on the date. Sex was never brought up. I did not sleep with them. I never would do that.\n\nObviously you have a very skewed idea of how this all works.",
                                    "author": "illuminaughtyxox",
                                    "id": "fdo2ppv",
                                    "parent_id": "t1_fdo22m5",
                                    "score": 11,
                                    "created_utc": 1578597803.0,
                                    "replies": [
                                        {
                                            "body": "“I agree to ppm”\n\nOn this board translates to I agreed to have sex with him and he would give me money.\n\nWhat you are referring to is a paid meet and greet.\n\nSo read her entire rant under the lens of we agreed to have sex but were going on a date first.\n\nThen her entire rant becomes I consented to sex and he took me around town for 6 hours.  At 2 am I once again consented by getting into his vehicle at the end of the night.  At 230 am I decided to change my mind and rescind consent.\n\nNow it’s a girls right to remove consent at any time.  But after spending 6 hours with her he has every right to be a bit upset.",
                                            "author": "chitraders",
                                            "id": "fdo37j3",
                                            "parent_id": "t1_fdo2ppv",
                                            "score": -1,
                                            "created_utc": 1578598063.0,
                                            "replies": [
                                                {
                                                    "body": "Ppm was clearly a \"date only\" ppm.",
                                                    "author": null,
                                                    "id": "fdo6lp6",
                                                    "parent_id": "t1_fdo37j3",
                                                    "score": 7,
                                                    "created_utc": 1578599790.0,
                                                    "replies": [
                                                        {
                                                            "body": "It seems as though you miscommunicated that.\n\nThat needs to be specified as the default assumption is for more.  If you did not specify it was platonic then I would consider your own bad communications as at fault.",
                                                            "author": "chitraders",
                                                            "id": "fdo7h2a",
                                                            "parent_id": "t1_fdo6lp6",
                                                            "score": 1,
                                                            "created_utc": 1578600219.0,
                                                            "replies": [
                                                                {
                                                                    "body": "\" It seems as though you miscommunicated that. \"\n\nIt seems as though you have zero basis to believe that.  The much more likely possibility that he was hoping that sneakily bringing her home to his place and pressuring her would lead to sex.  There are guys who think that's acceptable behavior, which seems to include you.",
                                                                    "author": null,
                                                                    "id": "fdoa60i",
                                                                    "parent_id": "t1_fdo7h2a",
                                                                    "score": 12,
                                                                    "created_utc": 1578601529.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "Many girls like to follow and let the girl lead and not be explicit.  You act like girls are innocent butterflies incapable of doing anything.  All she had to do was ask “where are we going”.  Or maybe after 5 min when they were going the wrong way - “hey I don’t want to go back to your place can we turn around”\n\nI’m just sick of these posts where we act like girls are incapable of adult communications.  She wasn’t drugged.  No physical violence occurred.  He didn’t refuse to take her home.\n\nBut I get it you are an anti-feminists and don’t believe grown women are capable of adult behaviors.",
                                                                            "author": "chitraders",
                                                                            "id": "fdoaxwp",
                                                                            "parent_id": "t1_fdoa60i",
                                                                            "score": 1,
                                                                            "created_utc": 1578601915.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "I suggested in my first response to you that she could've protected herself better.  But that doesn't justify him verbally abusing her at the end of the night which was the whole reason she posted this thread, and you jumped into this thread to defend him, and that's what I objected to.",
                                                                                    "author": null,
                                                                                    "id": "fdpawzb",
                                                                                    "parent_id": "t1_fdoaxwp",
                                                                                    "score": 1,
                                                                                    "created_utc": 1578624089.0,
                                                                                    "replies": [
                                                                                        {
                                                                                            "body": "You don’t even know what he said.  After she admitted making a half dozen mistakes you are going to take her word for it that he was insanely abusive?\n\nQuit white knighting and just give her the truth.  You don’t know her actions.  You know the stupid things she did.",
                                                                                            "author": "chitraders",
                                                                                            "id": "fdpeik8",
                                                                                            "parent_id": "t1_fdpawzb",
                                                                                            "score": 1,
                                                                                            "created_utc": 1578626577.0,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "body": "She probably did make mistakes, but that doesn't make her a liar.  You really seem to have disliked her from the start. \n\nAnd you have a skewed view of male-female interactions.  If a girl voluntarily goes back with you to your place, it's not a license to verbally or otherwise abuse her if she doesn't want to have sex after she gets there.",
                                                                                                    "author": null,
                                                                                                    "id": "fdpev0z",
                                                                                                    "parent_id": "t1_fdpeik8",
                                                                                                    "score": 1,
                                                                                                    "created_utc": 1578626823.0,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "body": "I dislike people who blame others for the situations they put themselves in.\n\nI don’t agree with him yelling at her but I can understand why he would be upset.  It’s not like she got assaulted or anything.  Just words.\n\nShe also wasted his time.  \n\nI believe in equality and people taking responsibility for their own actions.",
                                                                                                            "author": "chitraders",
                                                                                                            "id": "fdpg8ls",
                                                                                                            "parent_id": "t1_fdpev0z",
                                                                                                            "score": 1,
                                                                                                            "created_utc": 1578627823.0,
                                                                                                            "replies": []
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "body": "\"Im sorry, I thought this car came with leather interior.\"  LOL \nwhy didnt he ask??? the car doesn't just *come* with *leather interior*.",
                                                                    "author": null,
                                                                    "id": "fdoioh7",
                                                                    "parent_id": "t1_fdo7h2a",
                                                                    "score": 5,
                                                                    "created_utc": 1578605929.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "How about having a rational conversation instead of a knee jerk emotional reaction?\n\nMany people would consider sexual consent being given in term of the sugar bowl.   \n\nDebate the reason for the difference instead of resorting to emotion.",
                            "author": "houstonsd",
                            "id": "fdo6erw",
                            "parent_id": "t1_fdo0bc7",
                            "score": -9,
                            "created_utc": 1578599694.0,
                            "replies": [
                                {
                                    "body": "I'm emotionally unstable in what way? Because I'm describing this person's behavior as predatory?\n\nI have gone over every point thoroughly.\n\nIt's hilarious that you would actually have something negative to say about me.\n\nWomen should be emotional when a predator openly proclaims such crazy sounding things.\n\nOther women might read that and think \"he's right I did something wrong\" or \"okay next time I'll let him do that.\"\n\nDon't pull the \"hysterical woman\" card on me.",
                                    "author": "illuminaughtyxox",
                                    "id": "fdo7mix",
                                    "parent_id": "t1_fdo6erw",
                                    "score": 11,
                                    "created_utc": 1578600295.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "My dude. If someone handed me a resume that said they had asshole management skills, I would assume they knew when to pass on the chipotle, and how to keep a proper inventory of toilet paper.",
            "author": "TastySpermDispenser",
            "id": "fdnsqwb",
            "parent_id": "t1_fdnp1ju",
            "score": 7,
            "created_utc": 1578592084.0,
            "replies": [
                {
                    "body": "So.... I'm  hired?",
                    "author": "Azurecole",
                    "id": "fdntai4",
                    "parent_id": "t1_fdnsqwb",
                    "score": 4,
                    "created_utc": 1578592397.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I fucking do for sure.",
            "author": null,
            "id": "fdnrz1k",
            "parent_id": "t1_fdnp1ju",
            "score": 3,
            "created_utc": 1578591635.0,
            "replies": []
        },
        {
            "body": "Yes! Ugh. <3",
            "author": null,
            "id": "fdsf7pa",
            "parent_id": "t1_fdqtyey",
            "score": 1,
            "created_utc": 1578701366.0,
            "replies": []
        },
        {
            "body": "You think it’s “normal social protocol” to take a girl late at night to your house without clearing it with her (surprise!) then when you get there and she doesn’t want sex start insulting/bullying her? Wtf.",
            "author": null,
            "id": "fdo5jm8",
            "parent_id": "t1_fdnvdv1",
            "score": 9,
            "created_utc": 1578599270.0,
            "replies": [
                {
                    "body": "She already consented at the start of the date.\n\n“I agreed to ppm”\n\nShe never removed consent.  \n\nWhere do you think you are going at the end of the night.  IMO this mostly seems to be about her immaturity and inability to communicate.",
                    "author": "chitraders",
                    "id": "fdo681w",
                    "parent_id": "t1_fdo5jm8",
                    "score": -7,
                    "created_utc": 1578599602.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "On what planet does getting in a vehicle at a certain time period translate to \" yes let's have sex\"\n\nYour mind operates in a sick, twisted fashion. You should be in therapy. \n\nYou should not be taking anyone on dates.\n\nYou should stay away from other human beings.",
            "author": "illuminaughtyxox",
            "id": "fdo0bc7",
            "parent_id": "t1_fdnwing",
            "score": 17,
            "created_utc": 1578596484.0,
            "replies": [
                {
                    "body": "“So I accepted a ppm”\n\nShe already agreed to sex.  Why would he take her anywhere else besides his own place when the night was over?\n\nI mean I feel like she deserves a Darwin Award for her stupidity.",
                    "author": "chitraders",
                    "id": "fdo22m5",
                    "parent_id": "t1_fdo0bc7",
                    "score": -6,
                    "created_utc": 1578597466.0,
                    "replies": [
                        {
                            "body": "I have done one pay per MEET, and it was just incentive to get me to go on the date. Sex was never brought up. I did not sleep with them. I never would do that.\n\nObviously you have a very skewed idea of how this all works.",
                            "author": "illuminaughtyxox",
                            "id": "fdo2ppv",
                            "parent_id": "t1_fdo22m5",
                            "score": 11,
                            "created_utc": 1578597803.0,
                            "replies": [
                                {
                                    "body": "“I agree to ppm”\n\nOn this board translates to I agreed to have sex with him and he would give me money.\n\nWhat you are referring to is a paid meet and greet.\n\nSo read her entire rant under the lens of we agreed to have sex but were going on a date first.\n\nThen her entire rant becomes I consented to sex and he took me around town for 6 hours.  At 2 am I once again consented by getting into his vehicle at the end of the night.  At 230 am I decided to change my mind and rescind consent.\n\nNow it’s a girls right to remove consent at any time.  But after spending 6 hours with her he has every right to be a bit upset.",
                                    "author": "chitraders",
                                    "id": "fdo37j3",
                                    "parent_id": "t1_fdo2ppv",
                                    "score": -1,
                                    "created_utc": 1578598063.0,
                                    "replies": [
                                        {
                                            "body": "Ppm was clearly a \"date only\" ppm.",
                                            "author": null,
                                            "id": "fdo6lp6",
                                            "parent_id": "t1_fdo37j3",
                                            "score": 7,
                                            "created_utc": 1578599790.0,
                                            "replies": [
                                                {
                                                    "body": "It seems as though you miscommunicated that.\n\nThat needs to be specified as the default assumption is for more.  If you did not specify it was platonic then I would consider your own bad communications as at fault.",
                                                    "author": "chitraders",
                                                    "id": "fdo7h2a",
                                                    "parent_id": "t1_fdo6lp6",
                                                    "score": 1,
                                                    "created_utc": 1578600219.0,
                                                    "replies": [
                                                        {
                                                            "body": "\" It seems as though you miscommunicated that. \"\n\nIt seems as though you have zero basis to believe that.  The much more likely possibility that he was hoping that sneakily bringing her home to his place and pressuring her would lead to sex.  There are guys who think that's acceptable behavior, which seems to include you.",
                                                            "author": null,
                                                            "id": "fdoa60i",
                                                            "parent_id": "t1_fdo7h2a",
                                                            "score": 12,
                                                            "created_utc": 1578601529.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Many girls like to follow and let the girl lead and not be explicit.  You act like girls are innocent butterflies incapable of doing anything.  All she had to do was ask “where are we going”.  Or maybe after 5 min when they were going the wrong way - “hey I don’t want to go back to your place can we turn around”\n\nI’m just sick of these posts where we act like girls are incapable of adult communications.  She wasn’t drugged.  No physical violence occurred.  He didn’t refuse to take her home.\n\nBut I get it you are an anti-feminists and don’t believe grown women are capable of adult behaviors.",
                                                                    "author": "chitraders",
                                                                    "id": "fdoaxwp",
                                                                    "parent_id": "t1_fdoa60i",
                                                                    "score": 1,
                                                                    "created_utc": 1578601915.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "I suggested in my first response to you that she could've protected herself better.  But that doesn't justify him verbally abusing her at the end of the night which was the whole reason she posted this thread, and you jumped into this thread to defend him, and that's what I objected to.",
                                                                            "author": null,
                                                                            "id": "fdpawzb",
                                                                            "parent_id": "t1_fdoaxwp",
                                                                            "score": 1,
                                                                            "created_utc": 1578624089.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "You don’t even know what he said.  After she admitted making a half dozen mistakes you are going to take her word for it that he was insanely abusive?\n\nQuit white knighting and just give her the truth.  You don’t know her actions.  You know the stupid things she did.",
                                                                                    "author": "chitraders",
                                                                                    "id": "fdpeik8",
                                                                                    "parent_id": "t1_fdpawzb",
                                                                                    "score": 1,
                                                                                    "created_utc": 1578626577.0,
                                                                                    "replies": [
                                                                                        {
                                                                                            "body": "She probably did make mistakes, but that doesn't make her a liar.  You really seem to have disliked her from the start. \n\nAnd you have a skewed view of male-female interactions.  If a girl voluntarily goes back with you to your place, it's not a license to verbally or otherwise abuse her if she doesn't want to have sex after she gets there.",
                                                                                            "author": null,
                                                                                            "id": "fdpev0z",
                                                                                            "parent_id": "t1_fdpeik8",
                                                                                            "score": 1,
                                                                                            "created_utc": 1578626823.0,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "body": "I dislike people who blame others for the situations they put themselves in.\n\nI don’t agree with him yelling at her but I can understand why he would be upset.  It’s not like she got assaulted or anything.  Just words.\n\nShe also wasted his time.  \n\nI believe in equality and people taking responsibility for their own actions.",
                                                                                                    "author": "chitraders",
                                                                                                    "id": "fdpg8ls",
                                                                                                    "parent_id": "t1_fdpev0z",
                                                                                                    "score": 1,
                                                                                                    "created_utc": 1578627823.0,
                                                                                                    "replies": []
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "body": "\"Im sorry, I thought this car came with leather interior.\"  LOL \nwhy didnt he ask??? the car doesn't just *come* with *leather interior*.",
                                                            "author": null,
                                                            "id": "fdoioh7",
                                                            "parent_id": "t1_fdo7h2a",
                                                            "score": 5,
                                                            "created_utc": 1578605929.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "How about having a rational conversation instead of a knee jerk emotional reaction?\n\nMany people would consider sexual consent being given in term of the sugar bowl.   \n\nDebate the reason for the difference instead of resorting to emotion.",
                    "author": "houstonsd",
                    "id": "fdo6erw",
                    "parent_id": "t1_fdo0bc7",
                    "score": -9,
                    "created_utc": 1578599694.0,
                    "replies": [
                        {
                            "body": "I'm emotionally unstable in what way? Because I'm describing this person's behavior as predatory?\n\nI have gone over every point thoroughly.\n\nIt's hilarious that you would actually have something negative to say about me.\n\nWomen should be emotional when a predator openly proclaims such crazy sounding things.\n\nOther women might read that and think \"he's right I did something wrong\" or \"okay next time I'll let him do that.\"\n\nDon't pull the \"hysterical woman\" card on me.",
                            "author": "illuminaughtyxox",
                            "id": "fdo7mix",
                            "parent_id": "t1_fdo6erw",
                            "score": 11,
                            "created_utc": 1578600295.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "So.... I'm  hired?",
            "author": "Azurecole",
            "id": "fdntai4",
            "parent_id": "t1_fdnsqwb",
            "score": 4,
            "created_utc": 1578592397.0,
            "replies": []
        },
        {
            "body": "She already consented at the start of the date.\n\n“I agreed to ppm”\n\nShe never removed consent.  \n\nWhere do you think you are going at the end of the night.  IMO this mostly seems to be about her immaturity and inability to communicate.",
            "author": "chitraders",
            "id": "fdo681w",
            "parent_id": "t1_fdo5jm8",
            "score": -7,
            "created_utc": 1578599602.0,
            "replies": []
        },
        {
            "body": "“So I accepted a ppm”\n\nShe already agreed to sex.  Why would he take her anywhere else besides his own place when the night was over?\n\nI mean I feel like she deserves a Darwin Award for her stupidity.",
            "author": "chitraders",
            "id": "fdo22m5",
            "parent_id": "t1_fdo0bc7",
            "score": -6,
            "created_utc": 1578597466.0,
            "replies": [
                {
                    "body": "I have done one pay per MEET, and it was just incentive to get me to go on the date. Sex was never brought up. I did not sleep with them. I never would do that.\n\nObviously you have a very skewed idea of how this all works.",
                    "author": "illuminaughtyxox",
                    "id": "fdo2ppv",
                    "parent_id": "t1_fdo22m5",
                    "score": 11,
                    "created_utc": 1578597803.0,
                    "replies": [
                        {
                            "body": "“I agree to ppm”\n\nOn this board translates to I agreed to have sex with him and he would give me money.\n\nWhat you are referring to is a paid meet and greet.\n\nSo read her entire rant under the lens of we agreed to have sex but were going on a date first.\n\nThen her entire rant becomes I consented to sex and he took me around town for 6 hours.  At 2 am I once again consented by getting into his vehicle at the end of the night.  At 230 am I decided to change my mind and rescind consent.\n\nNow it’s a girls right to remove consent at any time.  But after spending 6 hours with her he has every right to be a bit upset.",
                            "author": "chitraders",
                            "id": "fdo37j3",
                            "parent_id": "t1_fdo2ppv",
                            "score": -1,
                            "created_utc": 1578598063.0,
                            "replies": [
                                {
                                    "body": "Ppm was clearly a \"date only\" ppm.",
                                    "author": null,
                                    "id": "fdo6lp6",
                                    "parent_id": "t1_fdo37j3",
                                    "score": 7,
                                    "created_utc": 1578599790.0,
                                    "replies": [
                                        {
                                            "body": "It seems as though you miscommunicated that.\n\nThat needs to be specified as the default assumption is for more.  If you did not specify it was platonic then I would consider your own bad communications as at fault.",
                                            "author": "chitraders",
                                            "id": "fdo7h2a",
                                            "parent_id": "t1_fdo6lp6",
                                            "score": 1,
                                            "created_utc": 1578600219.0,
                                            "replies": [
                                                {
                                                    "body": "\" It seems as though you miscommunicated that. \"\n\nIt seems as though you have zero basis to believe that.  The much more likely possibility that he was hoping that sneakily bringing her home to his place and pressuring her would lead to sex.  There are guys who think that's acceptable behavior, which seems to include you.",
                                                    "author": null,
                                                    "id": "fdoa60i",
                                                    "parent_id": "t1_fdo7h2a",
                                                    "score": 12,
                                                    "created_utc": 1578601529.0,
                                                    "replies": [
                                                        {
                                                            "body": "Many girls like to follow and let the girl lead and not be explicit.  You act like girls are innocent butterflies incapable of doing anything.  All she had to do was ask “where are we going”.  Or maybe after 5 min when they were going the wrong way - “hey I don’t want to go back to your place can we turn around”\n\nI’m just sick of these posts where we act like girls are incapable of adult communications.  She wasn’t drugged.  No physical violence occurred.  He didn’t refuse to take her home.\n\nBut I get it you are an anti-feminists and don’t believe grown women are capable of adult behaviors.",
                                                            "author": "chitraders",
                                                            "id": "fdoaxwp",
                                                            "parent_id": "t1_fdoa60i",
                                                            "score": 1,
                                                            "created_utc": 1578601915.0,
                                                            "replies": [
                                                                {
                                                                    "body": "I suggested in my first response to you that she could've protected herself better.  But that doesn't justify him verbally abusing her at the end of the night which was the whole reason she posted this thread, and you jumped into this thread to defend him, and that's what I objected to.",
                                                                    "author": null,
                                                                    "id": "fdpawzb",
                                                                    "parent_id": "t1_fdoaxwp",
                                                                    "score": 1,
                                                                    "created_utc": 1578624089.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "You don’t even know what he said.  After she admitted making a half dozen mistakes you are going to take her word for it that he was insanely abusive?\n\nQuit white knighting and just give her the truth.  You don’t know her actions.  You know the stupid things she did.",
                                                                            "author": "chitraders",
                                                                            "id": "fdpeik8",
                                                                            "parent_id": "t1_fdpawzb",
                                                                            "score": 1,
                                                                            "created_utc": 1578626577.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "She probably did make mistakes, but that doesn't make her a liar.  You really seem to have disliked her from the start. \n\nAnd you have a skewed view of male-female interactions.  If a girl voluntarily goes back with you to your place, it's not a license to verbally or otherwise abuse her if she doesn't want to have sex after she gets there.",
                                                                                    "author": null,
                                                                                    "id": "fdpev0z",
                                                                                    "parent_id": "t1_fdpeik8",
                                                                                    "score": 1,
                                                                                    "created_utc": 1578626823.0,
                                                                                    "replies": [
                                                                                        {
                                                                                            "body": "I dislike people who blame others for the situations they put themselves in.\n\nI don’t agree with him yelling at her but I can understand why he would be upset.  It’s not like she got assaulted or anything.  Just words.\n\nShe also wasted his time.  \n\nI believe in equality and people taking responsibility for their own actions.",
                                                                                            "author": "chitraders",
                                                                                            "id": "fdpg8ls",
                                                                                            "parent_id": "t1_fdpev0z",
                                                                                            "score": 1,
                                                                                            "created_utc": 1578627823.0,
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "body": "\"Im sorry, I thought this car came with leather interior.\"  LOL \nwhy didnt he ask??? the car doesn't just *come* with *leather interior*.",
                                                    "author": null,
                                                    "id": "fdoioh7",
                                                    "parent_id": "t1_fdo7h2a",
                                                    "score": 5,
                                                    "created_utc": 1578605929.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "How about having a rational conversation instead of a knee jerk emotional reaction?\n\nMany people would consider sexual consent being given in term of the sugar bowl.   \n\nDebate the reason for the difference instead of resorting to emotion.",
            "author": "houstonsd",
            "id": "fdo6erw",
            "parent_id": "t1_fdo0bc7",
            "score": -9,
            "created_utc": 1578599694.0,
            "replies": [
                {
                    "body": "I'm emotionally unstable in what way? Because I'm describing this person's behavior as predatory?\n\nI have gone over every point thoroughly.\n\nIt's hilarious that you would actually have something negative to say about me.\n\nWomen should be emotional when a predator openly proclaims such crazy sounding things.\n\nOther women might read that and think \"he's right I did something wrong\" or \"okay next time I'll let him do that.\"\n\nDon't pull the \"hysterical woman\" card on me.",
                    "author": "illuminaughtyxox",
                    "id": "fdo7mix",
                    "parent_id": "t1_fdo6erw",
                    "score": 11,
                    "created_utc": 1578600295.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I have done one pay per MEET, and it was just incentive to get me to go on the date. Sex was never brought up. I did not sleep with them. I never would do that.\n\nObviously you have a very skewed idea of how this all works.",
            "author": "illuminaughtyxox",
            "id": "fdo2ppv",
            "parent_id": "t1_fdo22m5",
            "score": 11,
            "created_utc": 1578597803.0,
            "replies": [
                {
                    "body": "“I agree to ppm”\n\nOn this board translates to I agreed to have sex with him and he would give me money.\n\nWhat you are referring to is a paid meet and greet.\n\nSo read her entire rant under the lens of we agreed to have sex but were going on a date first.\n\nThen her entire rant becomes I consented to sex and he took me around town for 6 hours.  At 2 am I once again consented by getting into his vehicle at the end of the night.  At 230 am I decided to change my mind and rescind consent.\n\nNow it’s a girls right to remove consent at any time.  But after spending 6 hours with her he has every right to be a bit upset.",
                    "author": "chitraders",
                    "id": "fdo37j3",
                    "parent_id": "t1_fdo2ppv",
                    "score": -1,
                    "created_utc": 1578598063.0,
                    "replies": [
                        {
                            "body": "Ppm was clearly a \"date only\" ppm.",
                            "author": null,
                            "id": "fdo6lp6",
                            "parent_id": "t1_fdo37j3",
                            "score": 7,
                            "created_utc": 1578599790.0,
                            "replies": [
                                {
                                    "body": "It seems as though you miscommunicated that.\n\nThat needs to be specified as the default assumption is for more.  If you did not specify it was platonic then I would consider your own bad communications as at fault.",
                                    "author": "chitraders",
                                    "id": "fdo7h2a",
                                    "parent_id": "t1_fdo6lp6",
                                    "score": 1,
                                    "created_utc": 1578600219.0,
                                    "replies": [
                                        {
                                            "body": "\" It seems as though you miscommunicated that. \"\n\nIt seems as though you have zero basis to believe that.  The much more likely possibility that he was hoping that sneakily bringing her home to his place and pressuring her would lead to sex.  There are guys who think that's acceptable behavior, which seems to include you.",
                                            "author": null,
                                            "id": "fdoa60i",
                                            "parent_id": "t1_fdo7h2a",
                                            "score": 12,
                                            "created_utc": 1578601529.0,
                                            "replies": [
                                                {
                                                    "body": "Many girls like to follow and let the girl lead and not be explicit.  You act like girls are innocent butterflies incapable of doing anything.  All she had to do was ask “where are we going”.  Or maybe after 5 min when they were going the wrong way - “hey I don’t want to go back to your place can we turn around”\n\nI’m just sick of these posts where we act like girls are incapable of adult communications.  She wasn’t drugged.  No physical violence occurred.  He didn’t refuse to take her home.\n\nBut I get it you are an anti-feminists and don’t believe grown women are capable of adult behaviors.",
                                                    "author": "chitraders",
                                                    "id": "fdoaxwp",
                                                    "parent_id": "t1_fdoa60i",
                                                    "score": 1,
                                                    "created_utc": 1578601915.0,
                                                    "replies": [
                                                        {
                                                            "body": "I suggested in my first response to you that she could've protected herself better.  But that doesn't justify him verbally abusing her at the end of the night which was the whole reason she posted this thread, and you jumped into this thread to defend him, and that's what I objected to.",
                                                            "author": null,
                                                            "id": "fdpawzb",
                                                            "parent_id": "t1_fdoaxwp",
                                                            "score": 1,
                                                            "created_utc": 1578624089.0,
                                                            "replies": [
                                                                {
                                                                    "body": "You don’t even know what he said.  After she admitted making a half dozen mistakes you are going to take her word for it that he was insanely abusive?\n\nQuit white knighting and just give her the truth.  You don’t know her actions.  You know the stupid things she did.",
                                                                    "author": "chitraders",
                                                                    "id": "fdpeik8",
                                                                    "parent_id": "t1_fdpawzb",
                                                                    "score": 1,
                                                                    "created_utc": 1578626577.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "She probably did make mistakes, but that doesn't make her a liar.  You really seem to have disliked her from the start. \n\nAnd you have a skewed view of male-female interactions.  If a girl voluntarily goes back with you to your place, it's not a license to verbally or otherwise abuse her if she doesn't want to have sex after she gets there.",
                                                                            "author": null,
                                                                            "id": "fdpev0z",
                                                                            "parent_id": "t1_fdpeik8",
                                                                            "score": 1,
                                                                            "created_utc": 1578626823.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "I dislike people who blame others for the situations they put themselves in.\n\nI don’t agree with him yelling at her but I can understand why he would be upset.  It’s not like she got assaulted or anything.  Just words.\n\nShe also wasted his time.  \n\nI believe in equality and people taking responsibility for their own actions.",
                                                                                    "author": "chitraders",
                                                                                    "id": "fdpg8ls",
                                                                                    "parent_id": "t1_fdpev0z",
                                                                                    "score": 1,
                                                                                    "created_utc": 1578627823.0,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "body": "\"Im sorry, I thought this car came with leather interior.\"  LOL \nwhy didnt he ask??? the car doesn't just *come* with *leather interior*.",
                                            "author": null,
                                            "id": "fdoioh7",
                                            "parent_id": "t1_fdo7h2a",
                                            "score": 5,
                                            "created_utc": 1578605929.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I'm emotionally unstable in what way? Because I'm describing this person's behavior as predatory?\n\nI have gone over every point thoroughly.\n\nIt's hilarious that you would actually have something negative to say about me.\n\nWomen should be emotional when a predator openly proclaims such crazy sounding things.\n\nOther women might read that and think \"he's right I did something wrong\" or \"okay next time I'll let him do that.\"\n\nDon't pull the \"hysterical woman\" card on me.",
            "author": "illuminaughtyxox",
            "id": "fdo7mix",
            "parent_id": "t1_fdo6erw",
            "score": 11,
            "created_utc": 1578600295.0,
            "replies": []
        },
        {
            "body": "“I agree to ppm”\n\nOn this board translates to I agreed to have sex with him and he would give me money.\n\nWhat you are referring to is a paid meet and greet.\n\nSo read her entire rant under the lens of we agreed to have sex but were going on a date first.\n\nThen her entire rant becomes I consented to sex and he took me around town for 6 hours.  At 2 am I once again consented by getting into his vehicle at the end of the night.  At 230 am I decided to change my mind and rescind consent.\n\nNow it’s a girls right to remove consent at any time.  But after spending 6 hours with her he has every right to be a bit upset.",
            "author": "chitraders",
            "id": "fdo37j3",
            "parent_id": "t1_fdo2ppv",
            "score": -1,
            "created_utc": 1578598063.0,
            "replies": [
                {
                    "body": "Ppm was clearly a \"date only\" ppm.",
                    "author": null,
                    "id": "fdo6lp6",
                    "parent_id": "t1_fdo37j3",
                    "score": 7,
                    "created_utc": 1578599790.0,
                    "replies": [
                        {
                            "body": "It seems as though you miscommunicated that.\n\nThat needs to be specified as the default assumption is for more.  If you did not specify it was platonic then I would consider your own bad communications as at fault.",
                            "author": "chitraders",
                            "id": "fdo7h2a",
                            "parent_id": "t1_fdo6lp6",
                            "score": 1,
                            "created_utc": 1578600219.0,
                            "replies": [
                                {
                                    "body": "\" It seems as though you miscommunicated that. \"\n\nIt seems as though you have zero basis to believe that.  The much more likely possibility that he was hoping that sneakily bringing her home to his place and pressuring her would lead to sex.  There are guys who think that's acceptable behavior, which seems to include you.",
                                    "author": null,
                                    "id": "fdoa60i",
                                    "parent_id": "t1_fdo7h2a",
                                    "score": 12,
                                    "created_utc": 1578601529.0,
                                    "replies": [
                                        {
                                            "body": "Many girls like to follow and let the girl lead and not be explicit.  You act like girls are innocent butterflies incapable of doing anything.  All she had to do was ask “where are we going”.  Or maybe after 5 min when they were going the wrong way - “hey I don’t want to go back to your place can we turn around”\n\nI’m just sick of these posts where we act like girls are incapable of adult communications.  She wasn’t drugged.  No physical violence occurred.  He didn’t refuse to take her home.\n\nBut I get it you are an anti-feminists and don’t believe grown women are capable of adult behaviors.",
                                            "author": "chitraders",
                                            "id": "fdoaxwp",
                                            "parent_id": "t1_fdoa60i",
                                            "score": 1,
                                            "created_utc": 1578601915.0,
                                            "replies": [
                                                {
                                                    "body": "I suggested in my first response to you that she could've protected herself better.  But that doesn't justify him verbally abusing her at the end of the night which was the whole reason she posted this thread, and you jumped into this thread to defend him, and that's what I objected to.",
                                                    "author": null,
                                                    "id": "fdpawzb",
                                                    "parent_id": "t1_fdoaxwp",
                                                    "score": 1,
                                                    "created_utc": 1578624089.0,
                                                    "replies": [
                                                        {
                                                            "body": "You don’t even know what he said.  After she admitted making a half dozen mistakes you are going to take her word for it that he was insanely abusive?\n\nQuit white knighting and just give her the truth.  You don’t know her actions.  You know the stupid things she did.",
                                                            "author": "chitraders",
                                                            "id": "fdpeik8",
                                                            "parent_id": "t1_fdpawzb",
                                                            "score": 1,
                                                            "created_utc": 1578626577.0,
                                                            "replies": [
                                                                {
                                                                    "body": "She probably did make mistakes, but that doesn't make her a liar.  You really seem to have disliked her from the start. \n\nAnd you have a skewed view of male-female interactions.  If a girl voluntarily goes back with you to your place, it's not a license to verbally or otherwise abuse her if she doesn't want to have sex after she gets there.",
                                                                    "author": null,
                                                                    "id": "fdpev0z",
                                                                    "parent_id": "t1_fdpeik8",
                                                                    "score": 1,
                                                                    "created_utc": 1578626823.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "I dislike people who blame others for the situations they put themselves in.\n\nI don’t agree with him yelling at her but I can understand why he would be upset.  It’s not like she got assaulted or anything.  Just words.\n\nShe also wasted his time.  \n\nI believe in equality and people taking responsibility for their own actions.",
                                                                            "author": "chitraders",
                                                                            "id": "fdpg8ls",
                                                                            "parent_id": "t1_fdpev0z",
                                                                            "score": 1,
                                                                            "created_utc": 1578627823.0,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "\"Im sorry, I thought this car came with leather interior.\"  LOL \nwhy didnt he ask??? the car doesn't just *come* with *leather interior*.",
                                    "author": null,
                                    "id": "fdoioh7",
                                    "parent_id": "t1_fdo7h2a",
                                    "score": 5,
                                    "created_utc": 1578605929.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Ppm was clearly a \"date only\" ppm.",
            "author": null,
            "id": "fdo6lp6",
            "parent_id": "t1_fdo37j3",
            "score": 7,
            "created_utc": 1578599790.0,
            "replies": [
                {
                    "body": "It seems as though you miscommunicated that.\n\nThat needs to be specified as the default assumption is for more.  If you did not specify it was platonic then I would consider your own bad communications as at fault.",
                    "author": "chitraders",
                    "id": "fdo7h2a",
                    "parent_id": "t1_fdo6lp6",
                    "score": 1,
                    "created_utc": 1578600219.0,
                    "replies": [
                        {
                            "body": "\" It seems as though you miscommunicated that. \"\n\nIt seems as though you have zero basis to believe that.  The much more likely possibility that he was hoping that sneakily bringing her home to his place and pressuring her would lead to sex.  There are guys who think that's acceptable behavior, which seems to include you.",
                            "author": null,
                            "id": "fdoa60i",
                            "parent_id": "t1_fdo7h2a",
                            "score": 12,
                            "created_utc": 1578601529.0,
                            "replies": [
                                {
                                    "body": "Many girls like to follow and let the girl lead and not be explicit.  You act like girls are innocent butterflies incapable of doing anything.  All she had to do was ask “where are we going”.  Or maybe after 5 min when they were going the wrong way - “hey I don’t want to go back to your place can we turn around”\n\nI’m just sick of these posts where we act like girls are incapable of adult communications.  She wasn’t drugged.  No physical violence occurred.  He didn’t refuse to take her home.\n\nBut I get it you are an anti-feminists and don’t believe grown women are capable of adult behaviors.",
                                    "author": "chitraders",
                                    "id": "fdoaxwp",
                                    "parent_id": "t1_fdoa60i",
                                    "score": 1,
                                    "created_utc": 1578601915.0,
                                    "replies": [
                                        {
                                            "body": "I suggested in my first response to you that she could've protected herself better.  But that doesn't justify him verbally abusing her at the end of the night which was the whole reason she posted this thread, and you jumped into this thread to defend him, and that's what I objected to.",
                                            "author": null,
                                            "id": "fdpawzb",
                                            "parent_id": "t1_fdoaxwp",
                                            "score": 1,
                                            "created_utc": 1578624089.0,
                                            "replies": [
                                                {
                                                    "body": "You don’t even know what he said.  After she admitted making a half dozen mistakes you are going to take her word for it that he was insanely abusive?\n\nQuit white knighting and just give her the truth.  You don’t know her actions.  You know the stupid things she did.",
                                                    "author": "chitraders",
                                                    "id": "fdpeik8",
                                                    "parent_id": "t1_fdpawzb",
                                                    "score": 1,
                                                    "created_utc": 1578626577.0,
                                                    "replies": [
                                                        {
                                                            "body": "She probably did make mistakes, but that doesn't make her a liar.  You really seem to have disliked her from the start. \n\nAnd you have a skewed view of male-female interactions.  If a girl voluntarily goes back with you to your place, it's not a license to verbally or otherwise abuse her if she doesn't want to have sex after she gets there.",
                                                            "author": null,
                                                            "id": "fdpev0z",
                                                            "parent_id": "t1_fdpeik8",
                                                            "score": 1,
                                                            "created_utc": 1578626823.0,
                                                            "replies": [
                                                                {
                                                                    "body": "I dislike people who blame others for the situations they put themselves in.\n\nI don’t agree with him yelling at her but I can understand why he would be upset.  It’s not like she got assaulted or anything.  Just words.\n\nShe also wasted his time.  \n\nI believe in equality and people taking responsibility for their own actions.",
                                                                    "author": "chitraders",
                                                                    "id": "fdpg8ls",
                                                                    "parent_id": "t1_fdpev0z",
                                                                    "score": 1,
                                                                    "created_utc": 1578627823.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "\"Im sorry, I thought this car came with leather interior.\"  LOL \nwhy didnt he ask??? the car doesn't just *come* with *leather interior*.",
                            "author": null,
                            "id": "fdoioh7",
                            "parent_id": "t1_fdo7h2a",
                            "score": 5,
                            "created_utc": 1578605929.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "It seems as though you miscommunicated that.\n\nThat needs to be specified as the default assumption is for more.  If you did not specify it was platonic then I would consider your own bad communications as at fault.",
            "author": "chitraders",
            "id": "fdo7h2a",
            "parent_id": "t1_fdo6lp6",
            "score": 1,
            "created_utc": 1578600219.0,
            "replies": [
                {
                    "body": "\" It seems as though you miscommunicated that. \"\n\nIt seems as though you have zero basis to believe that.  The much more likely possibility that he was hoping that sneakily bringing her home to his place and pressuring her would lead to sex.  There are guys who think that's acceptable behavior, which seems to include you.",
                    "author": null,
                    "id": "fdoa60i",
                    "parent_id": "t1_fdo7h2a",
                    "score": 12,
                    "created_utc": 1578601529.0,
                    "replies": [
                        {
                            "body": "Many girls like to follow and let the girl lead and not be explicit.  You act like girls are innocent butterflies incapable of doing anything.  All she had to do was ask “where are we going”.  Or maybe after 5 min when they were going the wrong way - “hey I don’t want to go back to your place can we turn around”\n\nI’m just sick of these posts where we act like girls are incapable of adult communications.  She wasn’t drugged.  No physical violence occurred.  He didn’t refuse to take her home.\n\nBut I get it you are an anti-feminists and don’t believe grown women are capable of adult behaviors.",
                            "author": "chitraders",
                            "id": "fdoaxwp",
                            "parent_id": "t1_fdoa60i",
                            "score": 1,
                            "created_utc": 1578601915.0,
                            "replies": [
                                {
                                    "body": "I suggested in my first response to you that she could've protected herself better.  But that doesn't justify him verbally abusing her at the end of the night which was the whole reason she posted this thread, and you jumped into this thread to defend him, and that's what I objected to.",
                                    "author": null,
                                    "id": "fdpawzb",
                                    "parent_id": "t1_fdoaxwp",
                                    "score": 1,
                                    "created_utc": 1578624089.0,
                                    "replies": [
                                        {
                                            "body": "You don’t even know what he said.  After she admitted making a half dozen mistakes you are going to take her word for it that he was insanely abusive?\n\nQuit white knighting and just give her the truth.  You don’t know her actions.  You know the stupid things she did.",
                                            "author": "chitraders",
                                            "id": "fdpeik8",
                                            "parent_id": "t1_fdpawzb",
                                            "score": 1,
                                            "created_utc": 1578626577.0,
                                            "replies": [
                                                {
                                                    "body": "She probably did make mistakes, but that doesn't make her a liar.  You really seem to have disliked her from the start. \n\nAnd you have a skewed view of male-female interactions.  If a girl voluntarily goes back with you to your place, it's not a license to verbally or otherwise abuse her if she doesn't want to have sex after she gets there.",
                                                    "author": null,
                                                    "id": "fdpev0z",
                                                    "parent_id": "t1_fdpeik8",
                                                    "score": 1,
                                                    "created_utc": 1578626823.0,
                                                    "replies": [
                                                        {
                                                            "body": "I dislike people who blame others for the situations they put themselves in.\n\nI don’t agree with him yelling at her but I can understand why he would be upset.  It’s not like she got assaulted or anything.  Just words.\n\nShe also wasted his time.  \n\nI believe in equality and people taking responsibility for their own actions.",
                                                            "author": "chitraders",
                                                            "id": "fdpg8ls",
                                                            "parent_id": "t1_fdpev0z",
                                                            "score": 1,
                                                            "created_utc": 1578627823.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "\"Im sorry, I thought this car came with leather interior.\"  LOL \nwhy didnt he ask??? the car doesn't just *come* with *leather interior*.",
                    "author": null,
                    "id": "fdoioh7",
                    "parent_id": "t1_fdo7h2a",
                    "score": 5,
                    "created_utc": 1578605929.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "\" It seems as though you miscommunicated that. \"\n\nIt seems as though you have zero basis to believe that.  The much more likely possibility that he was hoping that sneakily bringing her home to his place and pressuring her would lead to sex.  There are guys who think that's acceptable behavior, which seems to include you.",
            "author": null,
            "id": "fdoa60i",
            "parent_id": "t1_fdo7h2a",
            "score": 12,
            "created_utc": 1578601529.0,
            "replies": [
                {
                    "body": "Many girls like to follow and let the girl lead and not be explicit.  You act like girls are innocent butterflies incapable of doing anything.  All she had to do was ask “where are we going”.  Or maybe after 5 min when they were going the wrong way - “hey I don’t want to go back to your place can we turn around”\n\nI’m just sick of these posts where we act like girls are incapable of adult communications.  She wasn’t drugged.  No physical violence occurred.  He didn’t refuse to take her home.\n\nBut I get it you are an anti-feminists and don’t believe grown women are capable of adult behaviors.",
                    "author": "chitraders",
                    "id": "fdoaxwp",
                    "parent_id": "t1_fdoa60i",
                    "score": 1,
                    "created_utc": 1578601915.0,
                    "replies": [
                        {
                            "body": "I suggested in my first response to you that she could've protected herself better.  But that doesn't justify him verbally abusing her at the end of the night which was the whole reason she posted this thread, and you jumped into this thread to defend him, and that's what I objected to.",
                            "author": null,
                            "id": "fdpawzb",
                            "parent_id": "t1_fdoaxwp",
                            "score": 1,
                            "created_utc": 1578624089.0,
                            "replies": [
                                {
                                    "body": "You don’t even know what he said.  After she admitted making a half dozen mistakes you are going to take her word for it that he was insanely abusive?\n\nQuit white knighting and just give her the truth.  You don’t know her actions.  You know the stupid things she did.",
                                    "author": "chitraders",
                                    "id": "fdpeik8",
                                    "parent_id": "t1_fdpawzb",
                                    "score": 1,
                                    "created_utc": 1578626577.0,
                                    "replies": [
                                        {
                                            "body": "She probably did make mistakes, but that doesn't make her a liar.  You really seem to have disliked her from the start. \n\nAnd you have a skewed view of male-female interactions.  If a girl voluntarily goes back with you to your place, it's not a license to verbally or otherwise abuse her if she doesn't want to have sex after she gets there.",
                                            "author": null,
                                            "id": "fdpev0z",
                                            "parent_id": "t1_fdpeik8",
                                            "score": 1,
                                            "created_utc": 1578626823.0,
                                            "replies": [
                                                {
                                                    "body": "I dislike people who blame others for the situations they put themselves in.\n\nI don’t agree with him yelling at her but I can understand why he would be upset.  It’s not like she got assaulted or anything.  Just words.\n\nShe also wasted his time.  \n\nI believe in equality and people taking responsibility for their own actions.",
                                                    "author": "chitraders",
                                                    "id": "fdpg8ls",
                                                    "parent_id": "t1_fdpev0z",
                                                    "score": 1,
                                                    "created_utc": 1578627823.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "\"Im sorry, I thought this car came with leather interior.\"  LOL \nwhy didnt he ask??? the car doesn't just *come* with *leather interior*.",
            "author": null,
            "id": "fdoioh7",
            "parent_id": "t1_fdo7h2a",
            "score": 5,
            "created_utc": 1578605929.0,
            "replies": []
        },
        {
            "body": "Many girls like to follow and let the girl lead and not be explicit.  You act like girls are innocent butterflies incapable of doing anything.  All she had to do was ask “where are we going”.  Or maybe after 5 min when they were going the wrong way - “hey I don’t want to go back to your place can we turn around”\n\nI’m just sick of these posts where we act like girls are incapable of adult communications.  She wasn’t drugged.  No physical violence occurred.  He didn’t refuse to take her home.\n\nBut I get it you are an anti-feminists and don’t believe grown women are capable of adult behaviors.",
            "author": "chitraders",
            "id": "fdoaxwp",
            "parent_id": "t1_fdoa60i",
            "score": 1,
            "created_utc": 1578601915.0,
            "replies": [
                {
                    "body": "I suggested in my first response to you that she could've protected herself better.  But that doesn't justify him verbally abusing her at the end of the night which was the whole reason she posted this thread, and you jumped into this thread to defend him, and that's what I objected to.",
                    "author": null,
                    "id": "fdpawzb",
                    "parent_id": "t1_fdoaxwp",
                    "score": 1,
                    "created_utc": 1578624089.0,
                    "replies": [
                        {
                            "body": "You don’t even know what he said.  After she admitted making a half dozen mistakes you are going to take her word for it that he was insanely abusive?\n\nQuit white knighting and just give her the truth.  You don’t know her actions.  You know the stupid things she did.",
                            "author": "chitraders",
                            "id": "fdpeik8",
                            "parent_id": "t1_fdpawzb",
                            "score": 1,
                            "created_utc": 1578626577.0,
                            "replies": [
                                {
                                    "body": "She probably did make mistakes, but that doesn't make her a liar.  You really seem to have disliked her from the start. \n\nAnd you have a skewed view of male-female interactions.  If a girl voluntarily goes back with you to your place, it's not a license to verbally or otherwise abuse her if she doesn't want to have sex after she gets there.",
                                    "author": null,
                                    "id": "fdpev0z",
                                    "parent_id": "t1_fdpeik8",
                                    "score": 1,
                                    "created_utc": 1578626823.0,
                                    "replies": [
                                        {
                                            "body": "I dislike people who blame others for the situations they put themselves in.\n\nI don’t agree with him yelling at her but I can understand why he would be upset.  It’s not like she got assaulted or anything.  Just words.\n\nShe also wasted his time.  \n\nI believe in equality and people taking responsibility for their own actions.",
                                            "author": "chitraders",
                                            "id": "fdpg8ls",
                                            "parent_id": "t1_fdpev0z",
                                            "score": 1,
                                            "created_utc": 1578627823.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I suggested in my first response to you that she could've protected herself better.  But that doesn't justify him verbally abusing her at the end of the night which was the whole reason she posted this thread, and you jumped into this thread to defend him, and that's what I objected to.",
            "author": null,
            "id": "fdpawzb",
            "parent_id": "t1_fdoaxwp",
            "score": 1,
            "created_utc": 1578624089.0,
            "replies": [
                {
                    "body": "You don’t even know what he said.  After she admitted making a half dozen mistakes you are going to take her word for it that he was insanely abusive?\n\nQuit white knighting and just give her the truth.  You don’t know her actions.  You know the stupid things she did.",
                    "author": "chitraders",
                    "id": "fdpeik8",
                    "parent_id": "t1_fdpawzb",
                    "score": 1,
                    "created_utc": 1578626577.0,
                    "replies": [
                        {
                            "body": "She probably did make mistakes, but that doesn't make her a liar.  You really seem to have disliked her from the start. \n\nAnd you have a skewed view of male-female interactions.  If a girl voluntarily goes back with you to your place, it's not a license to verbally or otherwise abuse her if she doesn't want to have sex after she gets there.",
                            "author": null,
                            "id": "fdpev0z",
                            "parent_id": "t1_fdpeik8",
                            "score": 1,
                            "created_utc": 1578626823.0,
                            "replies": [
                                {
                                    "body": "I dislike people who blame others for the situations they put themselves in.\n\nI don’t agree with him yelling at her but I can understand why he would be upset.  It’s not like she got assaulted or anything.  Just words.\n\nShe also wasted his time.  \n\nI believe in equality and people taking responsibility for their own actions.",
                                    "author": "chitraders",
                                    "id": "fdpg8ls",
                                    "parent_id": "t1_fdpev0z",
                                    "score": 1,
                                    "created_utc": 1578627823.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "You don’t even know what he said.  After she admitted making a half dozen mistakes you are going to take her word for it that he was insanely abusive?\n\nQuit white knighting and just give her the truth.  You don’t know her actions.  You know the stupid things she did.",
            "author": "chitraders",
            "id": "fdpeik8",
            "parent_id": "t1_fdpawzb",
            "score": 1,
            "created_utc": 1578626577.0,
            "replies": [
                {
                    "body": "She probably did make mistakes, but that doesn't make her a liar.  You really seem to have disliked her from the start. \n\nAnd you have a skewed view of male-female interactions.  If a girl voluntarily goes back with you to your place, it's not a license to verbally or otherwise abuse her if she doesn't want to have sex after she gets there.",
                    "author": null,
                    "id": "fdpev0z",
                    "parent_id": "t1_fdpeik8",
                    "score": 1,
                    "created_utc": 1578626823.0,
                    "replies": [
                        {
                            "body": "I dislike people who blame others for the situations they put themselves in.\n\nI don’t agree with him yelling at her but I can understand why he would be upset.  It’s not like she got assaulted or anything.  Just words.\n\nShe also wasted his time.  \n\nI believe in equality and people taking responsibility for their own actions.",
                            "author": "chitraders",
                            "id": "fdpg8ls",
                            "parent_id": "t1_fdpev0z",
                            "score": 1,
                            "created_utc": 1578627823.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "She probably did make mistakes, but that doesn't make her a liar.  You really seem to have disliked her from the start. \n\nAnd you have a skewed view of male-female interactions.  If a girl voluntarily goes back with you to your place, it's not a license to verbally or otherwise abuse her if she doesn't want to have sex after she gets there.",
            "author": null,
            "id": "fdpev0z",
            "parent_id": "t1_fdpeik8",
            "score": 1,
            "created_utc": 1578626823.0,
            "replies": [
                {
                    "body": "I dislike people who blame others for the situations they put themselves in.\n\nI don’t agree with him yelling at her but I can understand why he would be upset.  It’s not like she got assaulted or anything.  Just words.\n\nShe also wasted his time.  \n\nI believe in equality and people taking responsibility for their own actions.",
                    "author": "chitraders",
                    "id": "fdpg8ls",
                    "parent_id": "t1_fdpev0z",
                    "score": 1,
                    "created_utc": 1578627823.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I dislike people who blame others for the situations they put themselves in.\n\nI don’t agree with him yelling at her but I can understand why he would be upset.  It’s not like she got assaulted or anything.  Just words.\n\nShe also wasted his time.  \n\nI believe in equality and people taking responsibility for their own actions.",
            "author": "chitraders",
            "id": "fdpg8ls",
            "parent_id": "t1_fdpev0z",
            "score": 1,
            "created_utc": 1578627823.0,
            "replies": []
        }
    ]
}