{
    "title": "New and grateful for all the Somin appreciation",
    "post_id": "pieqdm",
    "post_url": "https://www.reddit.com/r/runningman/comments/pieqdm/new_and_grateful_for_all_the_somin_appreciation/",
    "author": "Lemursinsocks",
    "body": "I’m relatively new to this sub but a long time RM fan and just want to say what a breath of fresh air this sub is in regards to Somin! \n\nI love all the members but I’ve also loved Somin ever since her first guest appearance and was delighted when she joined the cast. But I have been so so shocked by the amount and severity of vitriol spewed at her (and even her brother!!) online. I genuinely don’t understand how she handles it and I’m grateful the members seem to adore and support her, and that she’s finding such success in Sixth Sense too. \n\nIt’s been so nice to find such a lovely pocket of the fandom here and I wish I’d found it sooner. Hoping for continued success for all the members and that one day, the Somin haters recognize they aren’t helping or accomplishing anything…",
    "url": "https://www.reddit.com/r/runningman/comments/pieqdm/new_and_grateful_for_all_the_somin_appreciation/",
    "score": 197,
    "upvote_ratio": 0.95,
    "created_utc": 1630854377.0,
    "num_comments": 40,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "To all those who wish to participate in this thread, please be mindful of RULE 5. We will be enforcing this rule very strictly, especially on this thread.\n\nThe very reason why this sub is \"a breath of fresh air\" is that the moderating team does not tolerate toxicity of any kind. Remember, using **anecdotal observations from outside this sub/platform/thread to form an inflammatory comment about another fanbase or another member is not allowed**. \n\nSo-min is a beautiful and talented individual and is deserving of so much praise. **We can all appreciate her without the need to bring down others**. If you feel a cycle of toxicity surrounding So-min, you need to actively break it **by drowning it out with praise and love**, not by adding in more toxicity.\n\nAddendum:\n\nTo clarify, I am not telling you to turn a blind eye to toxicity. **Call it out,** **right there and then**! If you see it on the social media platforms that you frequent, call it out and report it. If you see it in this sub, report it right away and we will deal with it.",
            "author": "wumikomiko",
            "id": "hbqkmaz",
            "parent_id": "t3_pieqdm",
            "score": 1,
            "created_utc": 1630879839.0,
            "replies": [
                {
                    "body": "Dude are you seriously going to label anything that is not, \"they are beautiful\", \"they are the best, they deserve all the love\" and not praise as toxic? Are your standard of calling someone toxic so low. Do you even understand what toxic is? \n\nAnd this subreddit is not breath of fresh air, is just like any normal subreddit, you just removing anything that is not extremely positive or extremely sweet doesn't make it a breath of fresh air. It's just called looking only in one direction.\n\nP.S. Are you gonna remove as well for being toxic?",
                    "author": "Tnr2D",
                    "id": "hbrvleo",
                    "parent_id": "t1_hbqkmaz",
                    "score": -4,
                    "created_utc": 1630903817.0,
                    "replies": [
                        {
                            "body": "You are free to make constructive criticism as long that it does not break the rules.",
                            "author": "wumikomiko",
                            "id": "hbsrg4w",
                            "parent_id": "t1_hbrvleo",
                            "score": 1,
                            "created_utc": 1630929081.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Is this new because the hate on the other female member was rampant on this sub before lol. I remember saying Jihyo was authentic and a frequent poster here intepreted it as \"others must be inauthentic\" and attacked me. That's toxicity right there.",
                    "author": "Chiinori",
                    "id": "hbtn1z6",
                    "parent_id": "t1_hbqkmaz",
                    "score": -1,
                    "created_utc": 1630944964.0,
                    "replies": [
                        {
                            "body": "Hi, we are a small moderating team and we do mostly depend on our users to report these behaviors to us.\n\nAlso, Rule 5 was published 2 years ago: https://www.reddit.com/r/runningman/comments/c2fzr3/new\\_rule\\_announcement\\_clarification/",
                            "author": "wumikomiko",
                            "id": "hbtpn3l",
                            "parent_id": "t1_hbtn1z6",
                            "score": 1,
                            "created_utc": 1630946078.0,
                            "replies": [
                                {
                                    "body": "Then Rule 5 was clearly not enforced around ep. 554 because another mod was on that thread.",
                                    "author": "Chiinori",
                                    "id": "hbtq4dp",
                                    "parent_id": "t1_hbtpn3l",
                                    "score": 0,
                                    "created_utc": 1630946285.0,
                                    "replies": [
                                        {
                                            "body": "I am sorry that you feel there was a lapse in our judgment there. If you feel that a moderator's decision is incorrect, feel free to message the moderating team in the future [https://www.reddit.com/message/compose?to=/r/runningman](https://www.reddit.com/message/compose?to=/r/runningman) so that we may discuss the decision.",
                                            "author": "wumikomiko",
                                            "id": "hbtqliy",
                                            "parent_id": "t1_hbtq4dp",
                                            "score": 1,
                                            "created_utc": 1630946492.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Honestly, I never got why people hated Somin. When she joined RM she was like a breath of fresh air. She was outgoing, funny, had great chemistry with all the members and didn't give a damn about her image. It's everything you'd want from a variety entertainer. The reason people laud and adore Kwangsoo was somehow also the reason Somin gets hated on. \n\nAnother reason was people saying she stole Jihyo's screentime. I mean, I love Jihyo too but do you really expect her to get plenty of screentime when she normally just stands quietly at the sides and barely participates in banter and challenges (at least, at the time)? \n\nI remember that RM's and Somin personal Ig was bombarded with hate messages for Somin asking her to leave the show. It was just really sad. It's a lot better now, I barely see any hate messages on their Ig anymore. I hope she stays on RM for a long time if only just to piss of the haters.",
            "author": "UnoLaLaLa",
            "id": "hbp5607",
            "parent_id": "t3_pieqdm",
            "score": 79,
            "created_utc": 1630856766.0,
            "replies": [
                {
                    "body": "I had to unfollow the RM IG because it was way too toxic, the crazy amount of shaming of how Somin should act or dress & the constant poop/vomit/middle finger emojis, can't believe Somin is still following it.",
                    "author": "jhdnhc",
                    "id": "hbpybgq",
                    "parent_id": "t1_hbp5607",
                    "score": 21,
                    "created_utc": 1630869703.0,
                    "replies": []
                },
                {
                    "body": "I LOVE Jihyo and don’t understand why the women have to be pitted against each other. It was extra frustrating to me because in my opinion, Jihyo seems to really value having another woman around! And while Somin teases her and competes with her during games, she respectfully defers to her quite often (more often than she does other members!). One of my favorite episodes was when Jihyo was the mother zombie and Somin was her assistant and you could see Somin took such delight in helping her win. \n\nIn early days, I sort of wished Jihyo more publicly supported her but I recognize now that probably would have fanned the flames. Just such a dumb and pointless (and imaginary) rivalry.",
                    "author": "Lemursinsocks",
                    "id": "hbp5ze2",
                    "parent_id": "t1_hbp5607",
                    "score": 44,
                    "created_utc": 1630857126.0,
                    "replies": [
                        {
                            "body": "Exactly. You never see people complaining that Kwangsoo and Jaesuk gets way more screentime than the other men. But somehow the girls get compared to all the time. And guess what, the people who are pitting them against one another are mostly females as well. \n\nI'm just really happy that the situation has mostly improved nowadays. Jihyo and Somin also interact with each other more nowadays.",
                            "author": "UnoLaLaLa",
                            "id": "hbp7cpl",
                            "parent_id": "t1_hbp5ze2",
                            "score": 31,
                            "created_utc": 1630857723.0,
                            "replies": []
                        },
                        {
                            "body": "[removed]",
                            "author": null,
                            "id": "hbqdclu",
                            "parent_id": "t1_hbp5ze2",
                            "score": 6,
                            "created_utc": 1630876437.0,
                            "replies": [
                                {
                                    "body": "I think that’s a really interesting read on the situation. I think one of the things that bugs me is so many of Jihyo’s fans (of which I consider myself one) talk about how caring and generous and kind hearted she is, so I don’t understand how they think she would ever want them to be hostile toward a coworker with whom she clearly has a good relationship.",
                                    "author": "Lemursinsocks",
                                    "id": "hbqdxb0",
                                    "parent_id": "t1_hbqdclu",
                                    "score": 6,
                                    "created_utc": 1630876704.0,
                                    "replies": []
                                },
                                {
                                    "body": "Hello, u/Finklemeire\n\nThank you for your participation in r/runningman. Unfortunately, I have locked your post/comment as it violates our subreddit's rules, specifically Rule No. 5 regarding \"toxicity, toxic-baiting, or drama-baiting\" that states:\n\n>Users must not engage in toxicity, flaming, toxic-baiting, and drama-baiting. E.g., discriminating against or disparaging any RM member or staff, fan wars of any kind, and referring to opposing fan bases in a negative light to elicit a negative response.\n\n**While your analysis appears well-reasoned, you have made an inflammatory generalization of SJH fans without providing data. The reason why we have a different feel in this sub is we rise above such baseless generalizations.**\n\n**Your posts are now on our high monitoring system.**\n\nWould you please review our subreddit's rules found on the sidebar or [on our rules page](https://www.reddit.com/r/runningman/wiki/rules)?\n\nPlease note that further violations of our subreddit's rules are subject to the appropriate punitive function at the moderators' discretion.\n\nPlease [contact the moderating team](https://www.reddit.com/message/compose?to=/r/runningman) if you find this decision unfair or incorrect.\n\n&#x200B;\n\n*Edit: for audit purposes:*\n\n>*It's very obvious when you understand jihyos fan demographic why a lot of them spewed so much vitriol onto her.*  \n>  \n>*Well again they don't actually care too much about song jihyo the person. Otherwise they wouldn't have harassed kjk gary or jsm like they did.*  \n>  \n>*The average jihyo fans chill. These people are maniacs who live vicariously through her.*",
                                    "author": "wumikomiko",
                                    "id": "hbqjhy2",
                                    "parent_id": "t1_hbqdclu",
                                    "score": 4,
                                    "created_utc": 1630879301.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "It's what happens when people prop up some celeb on a pedestal for years.",
                            "author": "ScorpiusDX",
                            "id": "hbprg1g",
                            "parent_id": "t1_hbp5ze2",
                            "score": 7,
                            "created_utc": 1630866610.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "That's just the nature of toxic people, they find a reason to point fingers even if their reason is not valid. Jihyo has less screentime not because of somin or anything, but since they can point fingers to somin since she is new, they just decided to pick on her. I just hope that new fans of a new age stop this toxicity.",
                    "author": "dandoyramos",
                    "id": "hbpv4jc",
                    "parent_id": "t1_hbp5607",
                    "score": 13,
                    "created_utc": 1630868269.0,
                    "replies": [
                        {
                            "body": "[removed]",
                            "author": null,
                            "id": "hbqdgmh",
                            "parent_id": "t1_hbpv4jc",
                            "score": 2,
                            "created_utc": 1630876489.0,
                            "replies": [
                                {
                                    "body": "Hello, u/Finklemeire\n\nThis comment also violates our subreddit's rules, specifically Rule No. 5 regarding \"toxicity, toxic-baiting, or drama-baiting\" that states:\n\n>Users must not engage in toxicity, flaming, toxic-baiting, and drama-baiting. E.g., discriminating against or disparaging any RM member or staff, fan wars of any kind, and referring to opposing fan bases in a negative light to elicit a negative response.\n\nThis is a thread to give appreciation and praise to Somin, not make inflammatory remarks against other people.",
                                    "author": "wumikomiko",
                                    "id": "hbqlx5o",
                                    "parent_id": "t1_hbqdgmh",
                                    "score": 6,
                                    "created_utc": 1630880475.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "[removed]",
                    "author": null,
                    "id": "hbr3p92",
                    "parent_id": "t1_hbp5607",
                    "score": 0,
                    "created_utc": 1630889208.0,
                    "replies": [
                        {
                            "body": "Hi, I have removed your comment as the rumor you are talking about is NOT related to our beloved Running Man member Jeon So-min but rather a different person of the same name.\n\nI hope this was an honest mistake. I will be keeping an eye on your posts.",
                            "author": "wumikomiko",
                            "id": "hbrkmu8",
                            "parent_id": "t1_hbr3p92",
                            "score": 3,
                            "created_utc": 1630897674.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "The thing I appreciate most about Somin is how she unabashedly being herself despite all the negative comments. I love how she is unafraid to dress in pretty clothes, say the things that cross her mind and even express her sentimental side. I like when she goes all in during skits and role playing no matter how many people kept saying how cheesy it was. \n\nOn the surface, she might be the physically weakest member but I think she has a spine of steel, not giving in to the pressure to change herself. She shown that being a girly girl who likes pretty things does not affect your ability to do your job really well, and inspired me to be more self-assured in myself.",
            "author": "daungu22",
            "id": "hbrxssf",
            "parent_id": "t3_pieqdm",
            "score": 23,
            "created_utc": 1630905220.0,
            "replies": [
                {
                    "body": "Agreed!",
                    "author": "Lemursinsocks",
                    "id": "hbrxuxf",
                    "parent_id": "t1_hbrxssf",
                    "score": 4,
                    "created_utc": 1630905259.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I loved her character from the get go, i felt like she and sechan worked really well for runningman. Some of the fans are just too toxic.",
            "author": "dandoyramos",
            "id": "hbptzgm",
            "parent_id": "t3_pieqdm",
            "score": 22,
            "created_utc": 1630867753.0,
            "replies": []
        },
        {
            "body": "Welcome :) I really dont understand all the hate for her since 2017 tbh. Both YSC and JSM are outstanding.",
            "author": "Deroucade",
            "id": "hbp13pg",
            "parent_id": "t3_pieqdm",
            "score": 22,
            "created_utc": 1630854954.0,
            "replies": []
        },
        {
            "body": "I never understood the hate for her. People were screaming that she got more screen time than Jihyo and constantly said such nasty things to her. I honestly though her being on the show helped Jihyo a lot. I've watched every single episode of running man and one of the things I noticed is that Jihyo was sometimes filming Running Man right after filming a drama or film. I remember she would be so tired and the members saying she's especially sensitive when she's filming something. So instead of hating Somin, who is so lovely and so positive, I realize that she, along with the other members were helping Jihyo. It wasn't that she was getting more screen time, I think at times Jihyo was really too exhausted a few times and they edited to show more of Somin being upbeat than Jihyo looking tired. Perception is everything,  I don't understand why people choose to be hateful.",
            "author": "Beneficial-Welcome26",
            "id": "hbqfirf",
            "parent_id": "t3_pieqdm",
            "score": 17,
            "created_utc": 1630877441.0,
            "replies": []
        },
        {
            "body": "Yes!!!! I love So Min. She's like a ray of sunshine in this show and even in Sixth Sense, too. We all have our preferences and I understand that So Min isnt likable to some. But what I dont understand and what I hate the most is the bad and evil behavior of people towards her. Some people just need to be reminded that celebrities are human beings before anything else. \n\nHave you guys seen the latest episode of Sixth Sense and the reason why So Min got really emotional? If not, I suggest you watch it. :)",
            "author": "afrf",
            "id": "hbs3tys",
            "parent_id": "t3_pieqdm",
            "score": 15,
            "created_utc": 1630909341.0,
            "replies": []
        },
        {
            "body": "I like her crazy character before. Now, she is quiet, not like before. I am really sad about it.\n\nI hope that she can just do what she used to be and don't care what the hater said.\n\nLike Taeyeon used to be quiet because of the hate, but now she steps out of that and those ajumma laughs come back again in AMazing Saturday and I love i.t\n\nHopfully, Somin will steps out of it as well and start to do what she used to be doing.",
            "author": "WIZONE4LIFE",
            "id": "hc05jbx",
            "parent_id": "t3_pieqdm",
            "score": 5,
            "created_utc": 1631063367.0,
            "replies": []
        },
        {
            "body": "Same, same. I was always saddened with the comments at the official ytb and insta RM accounts, so much toxicity against our Somin.\n\nThis sub is one of my pride and joy in Reddit because even if you are a different cast stan, you will treat all member with the same respect. \n\nProps to the mods for making this wonderful environment where we can feel safe from haters and trolls and enjoy one of the best (in my opinion) OG variety shows of South Korea.",
            "author": "letitfox",
            "id": "hbrgp6t",
            "parent_id": "t3_pieqdm",
            "score": 13,
            "created_utc": 1630895668.0,
            "replies": []
        },
        {
            "body": "It's just funny in a pathetic way in how an appreciation thread for one of the main cast would have some comments that the mods have to delete.",
            "author": "Kuuganism",
            "id": "hbs9tpv",
            "parent_id": "t3_pieqdm",
            "score": 9,
            "created_utc": 1630914012.0,
            "replies": []
        },
        {
            "body": "I honestly didn't think people hated her before this. I love that she has no filter by default. She's just a ball of crazy and the other RM members encourage/love that about her. I feel like if the director/editors actually felt Somin was a problem they would edit down her time but they let Somin fly.",
            "author": "psfanboy",
            "id": "hbr9dvm",
            "parent_id": "t3_pieqdm",
            "score": 7,
            "created_utc": 1630892031.0,
            "replies": []
        },
        {
            "body": "[removed]",
            "author": null,
            "id": "hbqblwi",
            "parent_id": "t3_pieqdm",
            "score": -2,
            "created_utc": 1630875628.0,
            "replies": [
                {
                    "body": "Either you were really out of the loop when she joined or you are completely ignoring the unique way she was treated. There’s a difference between constructive criticism (which is absolutely fine! and I respect people who don’t really like her love frog character) and people spamming her Instagram and the RM Instagram by calling her ugly, saying, “SOMIN OUT 💩💩💩”and other much less pleasant things, as well as cutting/photoshopping her out of photos and making threats about and to her and her family on Instagram and fb. It got to the point where Tiny actually got a fb group shut down over it. \n\nSechan has received his share of criticism, sure, but to your point, THAT has been constructive criticism. Rarely have I seen the same kind of hate or vitriol spewed at him that has been directed toward Somin. For Sechan, it’s been about how he interacts with the group and whether he is filling a necessary role. I love them both but do think it took him longer to find his voice. I think he especially shines when paired with Jihyo. In my opinion, I think he helps bring her out of her shell.",
                    "author": "Lemursinsocks",
                    "id": "hbqcx11",
                    "parent_id": "t1_hbqblwi",
                    "score": 21,
                    "created_utc": 1630876234.0,
                    "replies": [
                        {
                            "body": "What were the deleted comment says ?.. its deleted",
                            "author": "CultureIndependent10",
                            "id": "hbrecu1",
                            "parent_id": "t1_hbqcx11",
                            "score": 0,
                            "created_utc": 1630894485.0,
                            "replies": []
                        },
                        {
                            "body": "There will be bad apples in between and I do not support them but 1 such bad comment draws more attention than 100 constructive criticism. Do you have any statistical proof with numbers that for Somin such bad comments were extremely high than constructive criticism. There was a mix of toxic and constructive criticism but because of those toxic comment everything was considered toxic even the constructive criticism. You must be saying that just by looking at some of the comments from top no way you have gone through all the comments.\n\nFor Sechan that's what you think, you might think he found his voice and paid good with Jihyo but that's what you think. Not everyone thinks that. And just because you think it does not mean everyone else should think that as well.",
                            "author": "Tnr2D",
                            "id": "hbrw9kl",
                            "parent_id": "t1_hbqcx11",
                            "score": -16,
                            "created_utc": 1630904240.0,
                            "replies": [
                                {
                                    "body": "I think it’s 100 bad comments vs 1 constructive criticism, I would love to know what kind of “constructive criticism” is sent to her brother, to the point that he has sworn off reading his dms. I also don’t have statistical proof but I think that there should be a distinction between So min who plays characters in running man and So min the person, these “constructive criticisms” don’t separate the two.",
                                    "author": "naniwewe",
                                    "id": "hbsbmar",
                                    "parent_id": "t1_hbrw9kl",
                                    "score": 7,
                                    "created_utc": 1630915548.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Hello,\n\nThank you for your participation in r/runningman. Unfortunately, I have removed your post/comment as it violates our subreddit's rules, specifically Rule No. 5 regarding \"toxicity, toxic-baiting, or drama-baiting\" that states:\n\n>Users must not engage in toxicity, flaming, toxic-baiting, and drama-baiting. E.g., discriminating against or disparaging any RM member or staff, fan wars of any kind, and referring to opposing fan bases in a negative light to elicit a negative response.\n\nWould you please review our subreddit's rules found on the sidebar or [on our rules page](https://www.reddit.com/r/runningman/wiki/rules)?\n\nPlease note that further violations of our subreddit's rules are subject to the appropriate punitive function at the moderators' discretion.\n\nPlease [contact the moderating team](https://www.reddit.com/message/compose?to=/r/runningman) if you find this decision unfair or incorrect.\n\nAddendum:\n\n* **We allow constructive criticism but the way you are bringing up Se-chan is off-topic and unrelated to the purpose/merit of this thread and you have provided no support to the statement you made about him.**\n* **Feel free to provide constructive criticism in our episode guide posts.**",
                    "author": "wumikomiko",
                    "id": "hbqo77n",
                    "parent_id": "t1_hbqblwi",
                    "score": 1,
                    "created_utc": 1630881585.0,
                    "replies": [
                        {
                            "body": "Dude it is a post about constructive criticism of toxic comments against Somin who was a new member. The main reason for it was new member and Sechan is a new member. That's why Sechan is there. How is Sechan of topic for topic new members as he is new member.\n\nAnd you want support. Then what sort do you proverbs to the statements, \"XYZ is beautiful\" , \"XYZ deserves all the love\" and \"XYZ is the best\" where's the support for that.",
                            "author": "Tnr2D",
                            "id": "hbrwlh8",
                            "parent_id": "t1_hbqo77n",
                            "score": -14,
                            "created_utc": 1630904449.0,
                            "replies": [
                                {
                                    "body": "Hello Tnr2D,\n\nI removed your one specific post because it broke a rule when you unnecessarily invoked Se-chan. Simple as that. I allowed your subsequent posts as on their own, they do not break any rules, but put together as a whole, it seems you are being argumentative out of emotional basis due to your post being removed. This consequently is now within the purview of Rule 5.\n\nHowever, I will give you another chance to calm down. I will merely lock your post and will now be monitoring all of your posts via our high alert monitoring system for 1 week.\n\nAgain, I encourage that you review our subreddit's rules found on the sidebar or [on our rules page](https://www.reddit.com/r/runningman/wiki/rules)?\n\nIf you feel that this decision is unfair, please [contact the moderating team](https://www.reddit.com/message/compose?to=/r/runningman).",
                                    "author": "wumikomiko",
                                    "id": "hbssipm",
                                    "parent_id": "t1_hbrwlh8",
                                    "score": 3,
                                    "created_utc": 1630929828.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Dude are you seriously going to label anything that is not, \"they are beautiful\", \"they are the best, they deserve all the love\" and not praise as toxic? Are your standard of calling someone toxic so low. Do you even understand what toxic is? \n\nAnd this subreddit is not breath of fresh air, is just like any normal subreddit, you just removing anything that is not extremely positive or extremely sweet doesn't make it a breath of fresh air. It's just called looking only in one direction.\n\nP.S. Are you gonna remove as well for being toxic?",
            "author": "Tnr2D",
            "id": "hbrvleo",
            "parent_id": "t1_hbqkmaz",
            "score": -4,
            "created_utc": 1630903817.0,
            "replies": [
                {
                    "body": "You are free to make constructive criticism as long that it does not break the rules.",
                    "author": "wumikomiko",
                    "id": "hbsrg4w",
                    "parent_id": "t1_hbrvleo",
                    "score": 1,
                    "created_utc": 1630929081.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Is this new because the hate on the other female member was rampant on this sub before lol. I remember saying Jihyo was authentic and a frequent poster here intepreted it as \"others must be inauthentic\" and attacked me. That's toxicity right there.",
            "author": "Chiinori",
            "id": "hbtn1z6",
            "parent_id": "t1_hbqkmaz",
            "score": -1,
            "created_utc": 1630944964.0,
            "replies": [
                {
                    "body": "Hi, we are a small moderating team and we do mostly depend on our users to report these behaviors to us.\n\nAlso, Rule 5 was published 2 years ago: https://www.reddit.com/r/runningman/comments/c2fzr3/new\\_rule\\_announcement\\_clarification/",
                    "author": "wumikomiko",
                    "id": "hbtpn3l",
                    "parent_id": "t1_hbtn1z6",
                    "score": 1,
                    "created_utc": 1630946078.0,
                    "replies": [
                        {
                            "body": "Then Rule 5 was clearly not enforced around ep. 554 because another mod was on that thread.",
                            "author": "Chiinori",
                            "id": "hbtq4dp",
                            "parent_id": "t1_hbtpn3l",
                            "score": 0,
                            "created_utc": 1630946285.0,
                            "replies": [
                                {
                                    "body": "I am sorry that you feel there was a lapse in our judgment there. If you feel that a moderator's decision is incorrect, feel free to message the moderating team in the future [https://www.reddit.com/message/compose?to=/r/runningman](https://www.reddit.com/message/compose?to=/r/runningman) so that we may discuss the decision.",
                                    "author": "wumikomiko",
                                    "id": "hbtqliy",
                                    "parent_id": "t1_hbtq4dp",
                                    "score": 1,
                                    "created_utc": 1630946492.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I had to unfollow the RM IG because it was way too toxic, the crazy amount of shaming of how Somin should act or dress & the constant poop/vomit/middle finger emojis, can't believe Somin is still following it.",
            "author": "jhdnhc",
            "id": "hbpybgq",
            "parent_id": "t1_hbp5607",
            "score": 21,
            "created_utc": 1630869703.0,
            "replies": []
        },
        {
            "body": "I LOVE Jihyo and don’t understand why the women have to be pitted against each other. It was extra frustrating to me because in my opinion, Jihyo seems to really value having another woman around! And while Somin teases her and competes with her during games, she respectfully defers to her quite often (more often than she does other members!). One of my favorite episodes was when Jihyo was the mother zombie and Somin was her assistant and you could see Somin took such delight in helping her win. \n\nIn early days, I sort of wished Jihyo more publicly supported her but I recognize now that probably would have fanned the flames. Just such a dumb and pointless (and imaginary) rivalry.",
            "author": "Lemursinsocks",
            "id": "hbp5ze2",
            "parent_id": "t1_hbp5607",
            "score": 44,
            "created_utc": 1630857126.0,
            "replies": [
                {
                    "body": "Exactly. You never see people complaining that Kwangsoo and Jaesuk gets way more screentime than the other men. But somehow the girls get compared to all the time. And guess what, the people who are pitting them against one another are mostly females as well. \n\nI'm just really happy that the situation has mostly improved nowadays. Jihyo and Somin also interact with each other more nowadays.",
                    "author": "UnoLaLaLa",
                    "id": "hbp7cpl",
                    "parent_id": "t1_hbp5ze2",
                    "score": 31,
                    "created_utc": 1630857723.0,
                    "replies": []
                },
                {
                    "body": "[removed]",
                    "author": null,
                    "id": "hbqdclu",
                    "parent_id": "t1_hbp5ze2",
                    "score": 6,
                    "created_utc": 1630876437.0,
                    "replies": [
                        {
                            "body": "I think that’s a really interesting read on the situation. I think one of the things that bugs me is so many of Jihyo’s fans (of which I consider myself one) talk about how caring and generous and kind hearted she is, so I don’t understand how they think she would ever want them to be hostile toward a coworker with whom she clearly has a good relationship.",
                            "author": "Lemursinsocks",
                            "id": "hbqdxb0",
                            "parent_id": "t1_hbqdclu",
                            "score": 6,
                            "created_utc": 1630876704.0,
                            "replies": []
                        },
                        {
                            "body": "Hello, u/Finklemeire\n\nThank you for your participation in r/runningman. Unfortunately, I have locked your post/comment as it violates our subreddit's rules, specifically Rule No. 5 regarding \"toxicity, toxic-baiting, or drama-baiting\" that states:\n\n>Users must not engage in toxicity, flaming, toxic-baiting, and drama-baiting. E.g., discriminating against or disparaging any RM member or staff, fan wars of any kind, and referring to opposing fan bases in a negative light to elicit a negative response.\n\n**While your analysis appears well-reasoned, you have made an inflammatory generalization of SJH fans without providing data. The reason why we have a different feel in this sub is we rise above such baseless generalizations.**\n\n**Your posts are now on our high monitoring system.**\n\nWould you please review our subreddit's rules found on the sidebar or [on our rules page](https://www.reddit.com/r/runningman/wiki/rules)?\n\nPlease note that further violations of our subreddit's rules are subject to the appropriate punitive function at the moderators' discretion.\n\nPlease [contact the moderating team](https://www.reddit.com/message/compose?to=/r/runningman) if you find this decision unfair or incorrect.\n\n&#x200B;\n\n*Edit: for audit purposes:*\n\n>*It's very obvious when you understand jihyos fan demographic why a lot of them spewed so much vitriol onto her.*  \n>  \n>*Well again they don't actually care too much about song jihyo the person. Otherwise they wouldn't have harassed kjk gary or jsm like they did.*  \n>  \n>*The average jihyo fans chill. These people are maniacs who live vicariously through her.*",
                            "author": "wumikomiko",
                            "id": "hbqjhy2",
                            "parent_id": "t1_hbqdclu",
                            "score": 4,
                            "created_utc": 1630879301.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "It's what happens when people prop up some celeb on a pedestal for years.",
                    "author": "ScorpiusDX",
                    "id": "hbprg1g",
                    "parent_id": "t1_hbp5ze2",
                    "score": 7,
                    "created_utc": 1630866610.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "That's just the nature of toxic people, they find a reason to point fingers even if their reason is not valid. Jihyo has less screentime not because of somin or anything, but since they can point fingers to somin since she is new, they just decided to pick on her. I just hope that new fans of a new age stop this toxicity.",
            "author": "dandoyramos",
            "id": "hbpv4jc",
            "parent_id": "t1_hbp5607",
            "score": 13,
            "created_utc": 1630868269.0,
            "replies": [
                {
                    "body": "[removed]",
                    "author": null,
                    "id": "hbqdgmh",
                    "parent_id": "t1_hbpv4jc",
                    "score": 2,
                    "created_utc": 1630876489.0,
                    "replies": [
                        {
                            "body": "Hello, u/Finklemeire\n\nThis comment also violates our subreddit's rules, specifically Rule No. 5 regarding \"toxicity, toxic-baiting, or drama-baiting\" that states:\n\n>Users must not engage in toxicity, flaming, toxic-baiting, and drama-baiting. E.g., discriminating against or disparaging any RM member or staff, fan wars of any kind, and referring to opposing fan bases in a negative light to elicit a negative response.\n\nThis is a thread to give appreciation and praise to Somin, not make inflammatory remarks against other people.",
                            "author": "wumikomiko",
                            "id": "hbqlx5o",
                            "parent_id": "t1_hbqdgmh",
                            "score": 6,
                            "created_utc": 1630880475.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "[removed]",
            "author": null,
            "id": "hbr3p92",
            "parent_id": "t1_hbp5607",
            "score": 0,
            "created_utc": 1630889208.0,
            "replies": [
                {
                    "body": "Hi, I have removed your comment as the rumor you are talking about is NOT related to our beloved Running Man member Jeon So-min but rather a different person of the same name.\n\nI hope this was an honest mistake. I will be keeping an eye on your posts.",
                    "author": "wumikomiko",
                    "id": "hbrkmu8",
                    "parent_id": "t1_hbr3p92",
                    "score": 3,
                    "created_utc": 1630897674.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Agreed!",
            "author": "Lemursinsocks",
            "id": "hbrxuxf",
            "parent_id": "t1_hbrxssf",
            "score": 4,
            "created_utc": 1630905259.0,
            "replies": []
        },
        {
            "body": "Either you were really out of the loop when she joined or you are completely ignoring the unique way she was treated. There’s a difference between constructive criticism (which is absolutely fine! and I respect people who don’t really like her love frog character) and people spamming her Instagram and the RM Instagram by calling her ugly, saying, “SOMIN OUT 💩💩💩”and other much less pleasant things, as well as cutting/photoshopping her out of photos and making threats about and to her and her family on Instagram and fb. It got to the point where Tiny actually got a fb group shut down over it. \n\nSechan has received his share of criticism, sure, but to your point, THAT has been constructive criticism. Rarely have I seen the same kind of hate or vitriol spewed at him that has been directed toward Somin. For Sechan, it’s been about how he interacts with the group and whether he is filling a necessary role. I love them both but do think it took him longer to find his voice. I think he especially shines when paired with Jihyo. In my opinion, I think he helps bring her out of her shell.",
            "author": "Lemursinsocks",
            "id": "hbqcx11",
            "parent_id": "t1_hbqblwi",
            "score": 21,
            "created_utc": 1630876234.0,
            "replies": [
                {
                    "body": "What were the deleted comment says ?.. its deleted",
                    "author": "CultureIndependent10",
                    "id": "hbrecu1",
                    "parent_id": "t1_hbqcx11",
                    "score": 0,
                    "created_utc": 1630894485.0,
                    "replies": []
                },
                {
                    "body": "There will be bad apples in between and I do not support them but 1 such bad comment draws more attention than 100 constructive criticism. Do you have any statistical proof with numbers that for Somin such bad comments were extremely high than constructive criticism. There was a mix of toxic and constructive criticism but because of those toxic comment everything was considered toxic even the constructive criticism. You must be saying that just by looking at some of the comments from top no way you have gone through all the comments.\n\nFor Sechan that's what you think, you might think he found his voice and paid good with Jihyo but that's what you think. Not everyone thinks that. And just because you think it does not mean everyone else should think that as well.",
                    "author": "Tnr2D",
                    "id": "hbrw9kl",
                    "parent_id": "t1_hbqcx11",
                    "score": -16,
                    "created_utc": 1630904240.0,
                    "replies": [
                        {
                            "body": "I think it’s 100 bad comments vs 1 constructive criticism, I would love to know what kind of “constructive criticism” is sent to her brother, to the point that he has sworn off reading his dms. I also don’t have statistical proof but I think that there should be a distinction between So min who plays characters in running man and So min the person, these “constructive criticisms” don’t separate the two.",
                            "author": "naniwewe",
                            "id": "hbsbmar",
                            "parent_id": "t1_hbrw9kl",
                            "score": 7,
                            "created_utc": 1630915548.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Hello,\n\nThank you for your participation in r/runningman. Unfortunately, I have removed your post/comment as it violates our subreddit's rules, specifically Rule No. 5 regarding \"toxicity, toxic-baiting, or drama-baiting\" that states:\n\n>Users must not engage in toxicity, flaming, toxic-baiting, and drama-baiting. E.g., discriminating against or disparaging any RM member or staff, fan wars of any kind, and referring to opposing fan bases in a negative light to elicit a negative response.\n\nWould you please review our subreddit's rules found on the sidebar or [on our rules page](https://www.reddit.com/r/runningman/wiki/rules)?\n\nPlease note that further violations of our subreddit's rules are subject to the appropriate punitive function at the moderators' discretion.\n\nPlease [contact the moderating team](https://www.reddit.com/message/compose?to=/r/runningman) if you find this decision unfair or incorrect.\n\nAddendum:\n\n* **We allow constructive criticism but the way you are bringing up Se-chan is off-topic and unrelated to the purpose/merit of this thread and you have provided no support to the statement you made about him.**\n* **Feel free to provide constructive criticism in our episode guide posts.**",
            "author": "wumikomiko",
            "id": "hbqo77n",
            "parent_id": "t1_hbqblwi",
            "score": 1,
            "created_utc": 1630881585.0,
            "replies": [
                {
                    "body": "Dude it is a post about constructive criticism of toxic comments against Somin who was a new member. The main reason for it was new member and Sechan is a new member. That's why Sechan is there. How is Sechan of topic for topic new members as he is new member.\n\nAnd you want support. Then what sort do you proverbs to the statements, \"XYZ is beautiful\" , \"XYZ deserves all the love\" and \"XYZ is the best\" where's the support for that.",
                    "author": "Tnr2D",
                    "id": "hbrwlh8",
                    "parent_id": "t1_hbqo77n",
                    "score": -14,
                    "created_utc": 1630904449.0,
                    "replies": [
                        {
                            "body": "Hello Tnr2D,\n\nI removed your one specific post because it broke a rule when you unnecessarily invoked Se-chan. Simple as that. I allowed your subsequent posts as on their own, they do not break any rules, but put together as a whole, it seems you are being argumentative out of emotional basis due to your post being removed. This consequently is now within the purview of Rule 5.\n\nHowever, I will give you another chance to calm down. I will merely lock your post and will now be monitoring all of your posts via our high alert monitoring system for 1 week.\n\nAgain, I encourage that you review our subreddit's rules found on the sidebar or [on our rules page](https://www.reddit.com/r/runningman/wiki/rules)?\n\nIf you feel that this decision is unfair, please [contact the moderating team](https://www.reddit.com/message/compose?to=/r/runningman).",
                            "author": "wumikomiko",
                            "id": "hbssipm",
                            "parent_id": "t1_hbrwlh8",
                            "score": 3,
                            "created_utc": 1630929828.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "You are free to make constructive criticism as long that it does not break the rules.",
            "author": "wumikomiko",
            "id": "hbsrg4w",
            "parent_id": "t1_hbrvleo",
            "score": 1,
            "created_utc": 1630929081.0,
            "replies": []
        },
        {
            "body": "Hi, we are a small moderating team and we do mostly depend on our users to report these behaviors to us.\n\nAlso, Rule 5 was published 2 years ago: https://www.reddit.com/r/runningman/comments/c2fzr3/new\\_rule\\_announcement\\_clarification/",
            "author": "wumikomiko",
            "id": "hbtpn3l",
            "parent_id": "t1_hbtn1z6",
            "score": 1,
            "created_utc": 1630946078.0,
            "replies": [
                {
                    "body": "Then Rule 5 was clearly not enforced around ep. 554 because another mod was on that thread.",
                    "author": "Chiinori",
                    "id": "hbtq4dp",
                    "parent_id": "t1_hbtpn3l",
                    "score": 0,
                    "created_utc": 1630946285.0,
                    "replies": [
                        {
                            "body": "I am sorry that you feel there was a lapse in our judgment there. If you feel that a moderator's decision is incorrect, feel free to message the moderating team in the future [https://www.reddit.com/message/compose?to=/r/runningman](https://www.reddit.com/message/compose?to=/r/runningman) so that we may discuss the decision.",
                            "author": "wumikomiko",
                            "id": "hbtqliy",
                            "parent_id": "t1_hbtq4dp",
                            "score": 1,
                            "created_utc": 1630946492.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Exactly. You never see people complaining that Kwangsoo and Jaesuk gets way more screentime than the other men. But somehow the girls get compared to all the time. And guess what, the people who are pitting them against one another are mostly females as well. \n\nI'm just really happy that the situation has mostly improved nowadays. Jihyo and Somin also interact with each other more nowadays.",
            "author": "UnoLaLaLa",
            "id": "hbp7cpl",
            "parent_id": "t1_hbp5ze2",
            "score": 31,
            "created_utc": 1630857723.0,
            "replies": []
        },
        {
            "body": "[removed]",
            "author": null,
            "id": "hbqdclu",
            "parent_id": "t1_hbp5ze2",
            "score": 6,
            "created_utc": 1630876437.0,
            "replies": [
                {
                    "body": "I think that’s a really interesting read on the situation. I think one of the things that bugs me is so many of Jihyo’s fans (of which I consider myself one) talk about how caring and generous and kind hearted she is, so I don’t understand how they think she would ever want them to be hostile toward a coworker with whom she clearly has a good relationship.",
                    "author": "Lemursinsocks",
                    "id": "hbqdxb0",
                    "parent_id": "t1_hbqdclu",
                    "score": 6,
                    "created_utc": 1630876704.0,
                    "replies": []
                },
                {
                    "body": "Hello, u/Finklemeire\n\nThank you for your participation in r/runningman. Unfortunately, I have locked your post/comment as it violates our subreddit's rules, specifically Rule No. 5 regarding \"toxicity, toxic-baiting, or drama-baiting\" that states:\n\n>Users must not engage in toxicity, flaming, toxic-baiting, and drama-baiting. E.g., discriminating against or disparaging any RM member or staff, fan wars of any kind, and referring to opposing fan bases in a negative light to elicit a negative response.\n\n**While your analysis appears well-reasoned, you have made an inflammatory generalization of SJH fans without providing data. The reason why we have a different feel in this sub is we rise above such baseless generalizations.**\n\n**Your posts are now on our high monitoring system.**\n\nWould you please review our subreddit's rules found on the sidebar or [on our rules page](https://www.reddit.com/r/runningman/wiki/rules)?\n\nPlease note that further violations of our subreddit's rules are subject to the appropriate punitive function at the moderators' discretion.\n\nPlease [contact the moderating team](https://www.reddit.com/message/compose?to=/r/runningman) if you find this decision unfair or incorrect.\n\n&#x200B;\n\n*Edit: for audit purposes:*\n\n>*It's very obvious when you understand jihyos fan demographic why a lot of them spewed so much vitriol onto her.*  \n>  \n>*Well again they don't actually care too much about song jihyo the person. Otherwise they wouldn't have harassed kjk gary or jsm like they did.*  \n>  \n>*The average jihyo fans chill. These people are maniacs who live vicariously through her.*",
                    "author": "wumikomiko",
                    "id": "hbqjhy2",
                    "parent_id": "t1_hbqdclu",
                    "score": 4,
                    "created_utc": 1630879301.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "It's what happens when people prop up some celeb on a pedestal for years.",
            "author": "ScorpiusDX",
            "id": "hbprg1g",
            "parent_id": "t1_hbp5ze2",
            "score": 7,
            "created_utc": 1630866610.0,
            "replies": []
        },
        {
            "body": "[removed]",
            "author": null,
            "id": "hbqdgmh",
            "parent_id": "t1_hbpv4jc",
            "score": 2,
            "created_utc": 1630876489.0,
            "replies": [
                {
                    "body": "Hello, u/Finklemeire\n\nThis comment also violates our subreddit's rules, specifically Rule No. 5 regarding \"toxicity, toxic-baiting, or drama-baiting\" that states:\n\n>Users must not engage in toxicity, flaming, toxic-baiting, and drama-baiting. E.g., discriminating against or disparaging any RM member or staff, fan wars of any kind, and referring to opposing fan bases in a negative light to elicit a negative response.\n\nThis is a thread to give appreciation and praise to Somin, not make inflammatory remarks against other people.",
                    "author": "wumikomiko",
                    "id": "hbqlx5o",
                    "parent_id": "t1_hbqdgmh",
                    "score": 6,
                    "created_utc": 1630880475.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Hi, I have removed your comment as the rumor you are talking about is NOT related to our beloved Running Man member Jeon So-min but rather a different person of the same name.\n\nI hope this was an honest mistake. I will be keeping an eye on your posts.",
            "author": "wumikomiko",
            "id": "hbrkmu8",
            "parent_id": "t1_hbr3p92",
            "score": 3,
            "created_utc": 1630897674.0,
            "replies": []
        },
        {
            "body": "What were the deleted comment says ?.. its deleted",
            "author": "CultureIndependent10",
            "id": "hbrecu1",
            "parent_id": "t1_hbqcx11",
            "score": 0,
            "created_utc": 1630894485.0,
            "replies": []
        },
        {
            "body": "There will be bad apples in between and I do not support them but 1 such bad comment draws more attention than 100 constructive criticism. Do you have any statistical proof with numbers that for Somin such bad comments were extremely high than constructive criticism. There was a mix of toxic and constructive criticism but because of those toxic comment everything was considered toxic even the constructive criticism. You must be saying that just by looking at some of the comments from top no way you have gone through all the comments.\n\nFor Sechan that's what you think, you might think he found his voice and paid good with Jihyo but that's what you think. Not everyone thinks that. And just because you think it does not mean everyone else should think that as well.",
            "author": "Tnr2D",
            "id": "hbrw9kl",
            "parent_id": "t1_hbqcx11",
            "score": -16,
            "created_utc": 1630904240.0,
            "replies": [
                {
                    "body": "I think it’s 100 bad comments vs 1 constructive criticism, I would love to know what kind of “constructive criticism” is sent to her brother, to the point that he has sworn off reading his dms. I also don’t have statistical proof but I think that there should be a distinction between So min who plays characters in running man and So min the person, these “constructive criticisms” don’t separate the two.",
                    "author": "naniwewe",
                    "id": "hbsbmar",
                    "parent_id": "t1_hbrw9kl",
                    "score": 7,
                    "created_utc": 1630915548.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Dude it is a post about constructive criticism of toxic comments against Somin who was a new member. The main reason for it was new member and Sechan is a new member. That's why Sechan is there. How is Sechan of topic for topic new members as he is new member.\n\nAnd you want support. Then what sort do you proverbs to the statements, \"XYZ is beautiful\" , \"XYZ deserves all the love\" and \"XYZ is the best\" where's the support for that.",
            "author": "Tnr2D",
            "id": "hbrwlh8",
            "parent_id": "t1_hbqo77n",
            "score": -14,
            "created_utc": 1630904449.0,
            "replies": [
                {
                    "body": "Hello Tnr2D,\n\nI removed your one specific post because it broke a rule when you unnecessarily invoked Se-chan. Simple as that. I allowed your subsequent posts as on their own, they do not break any rules, but put together as a whole, it seems you are being argumentative out of emotional basis due to your post being removed. This consequently is now within the purview of Rule 5.\n\nHowever, I will give you another chance to calm down. I will merely lock your post and will now be monitoring all of your posts via our high alert monitoring system for 1 week.\n\nAgain, I encourage that you review our subreddit's rules found on the sidebar or [on our rules page](https://www.reddit.com/r/runningman/wiki/rules)?\n\nIf you feel that this decision is unfair, please [contact the moderating team](https://www.reddit.com/message/compose?to=/r/runningman).",
                    "author": "wumikomiko",
                    "id": "hbssipm",
                    "parent_id": "t1_hbrwlh8",
                    "score": 3,
                    "created_utc": 1630929828.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Then Rule 5 was clearly not enforced around ep. 554 because another mod was on that thread.",
            "author": "Chiinori",
            "id": "hbtq4dp",
            "parent_id": "t1_hbtpn3l",
            "score": 0,
            "created_utc": 1630946285.0,
            "replies": [
                {
                    "body": "I am sorry that you feel there was a lapse in our judgment there. If you feel that a moderator's decision is incorrect, feel free to message the moderating team in the future [https://www.reddit.com/message/compose?to=/r/runningman](https://www.reddit.com/message/compose?to=/r/runningman) so that we may discuss the decision.",
                    "author": "wumikomiko",
                    "id": "hbtqliy",
                    "parent_id": "t1_hbtq4dp",
                    "score": 1,
                    "created_utc": 1630946492.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I think that’s a really interesting read on the situation. I think one of the things that bugs me is so many of Jihyo’s fans (of which I consider myself one) talk about how caring and generous and kind hearted she is, so I don’t understand how they think she would ever want them to be hostile toward a coworker with whom she clearly has a good relationship.",
            "author": "Lemursinsocks",
            "id": "hbqdxb0",
            "parent_id": "t1_hbqdclu",
            "score": 6,
            "created_utc": 1630876704.0,
            "replies": []
        },
        {
            "body": "Hello, u/Finklemeire\n\nThank you for your participation in r/runningman. Unfortunately, I have locked your post/comment as it violates our subreddit's rules, specifically Rule No. 5 regarding \"toxicity, toxic-baiting, or drama-baiting\" that states:\n\n>Users must not engage in toxicity, flaming, toxic-baiting, and drama-baiting. E.g., discriminating against or disparaging any RM member or staff, fan wars of any kind, and referring to opposing fan bases in a negative light to elicit a negative response.\n\n**While your analysis appears well-reasoned, you have made an inflammatory generalization of SJH fans without providing data. The reason why we have a different feel in this sub is we rise above such baseless generalizations.**\n\n**Your posts are now on our high monitoring system.**\n\nWould you please review our subreddit's rules found on the sidebar or [on our rules page](https://www.reddit.com/r/runningman/wiki/rules)?\n\nPlease note that further violations of our subreddit's rules are subject to the appropriate punitive function at the moderators' discretion.\n\nPlease [contact the moderating team](https://www.reddit.com/message/compose?to=/r/runningman) if you find this decision unfair or incorrect.\n\n&#x200B;\n\n*Edit: for audit purposes:*\n\n>*It's very obvious when you understand jihyos fan demographic why a lot of them spewed so much vitriol onto her.*  \n>  \n>*Well again they don't actually care too much about song jihyo the person. Otherwise they wouldn't have harassed kjk gary or jsm like they did.*  \n>  \n>*The average jihyo fans chill. These people are maniacs who live vicariously through her.*",
            "author": "wumikomiko",
            "id": "hbqjhy2",
            "parent_id": "t1_hbqdclu",
            "score": 4,
            "created_utc": 1630879301.0,
            "replies": []
        },
        {
            "body": "Hello, u/Finklemeire\n\nThis comment also violates our subreddit's rules, specifically Rule No. 5 regarding \"toxicity, toxic-baiting, or drama-baiting\" that states:\n\n>Users must not engage in toxicity, flaming, toxic-baiting, and drama-baiting. E.g., discriminating against or disparaging any RM member or staff, fan wars of any kind, and referring to opposing fan bases in a negative light to elicit a negative response.\n\nThis is a thread to give appreciation and praise to Somin, not make inflammatory remarks against other people.",
            "author": "wumikomiko",
            "id": "hbqlx5o",
            "parent_id": "t1_hbqdgmh",
            "score": 6,
            "created_utc": 1630880475.0,
            "replies": []
        },
        {
            "body": "I think it’s 100 bad comments vs 1 constructive criticism, I would love to know what kind of “constructive criticism” is sent to her brother, to the point that he has sworn off reading his dms. I also don’t have statistical proof but I think that there should be a distinction between So min who plays characters in running man and So min the person, these “constructive criticisms” don’t separate the two.",
            "author": "naniwewe",
            "id": "hbsbmar",
            "parent_id": "t1_hbrw9kl",
            "score": 7,
            "created_utc": 1630915548.0,
            "replies": []
        },
        {
            "body": "Hello Tnr2D,\n\nI removed your one specific post because it broke a rule when you unnecessarily invoked Se-chan. Simple as that. I allowed your subsequent posts as on their own, they do not break any rules, but put together as a whole, it seems you are being argumentative out of emotional basis due to your post being removed. This consequently is now within the purview of Rule 5.\n\nHowever, I will give you another chance to calm down. I will merely lock your post and will now be monitoring all of your posts via our high alert monitoring system for 1 week.\n\nAgain, I encourage that you review our subreddit's rules found on the sidebar or [on our rules page](https://www.reddit.com/r/runningman/wiki/rules)?\n\nIf you feel that this decision is unfair, please [contact the moderating team](https://www.reddit.com/message/compose?to=/r/runningman).",
            "author": "wumikomiko",
            "id": "hbssipm",
            "parent_id": "t1_hbrwlh8",
            "score": 3,
            "created_utc": 1630929828.0,
            "replies": []
        },
        {
            "body": "I am sorry that you feel there was a lapse in our judgment there. If you feel that a moderator's decision is incorrect, feel free to message the moderating team in the future [https://www.reddit.com/message/compose?to=/r/runningman](https://www.reddit.com/message/compose?to=/r/runningman) so that we may discuss the decision.",
            "author": "wumikomiko",
            "id": "hbtqliy",
            "parent_id": "t1_hbtq4dp",
            "score": 1,
            "created_utc": 1630946492.0,
            "replies": []
        }
    ]
}