{
    "title": "Sugar Daddies of the world. Explain something to me.",
    "post_id": "10hfwxb",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/10hfwxb/sugar_daddies_of_the_world_explain_something_to_me/",
    "author": "AzucarSala",
    "body": "I've been following this sub for about two years. 3 days ago I made an account on Seeking. Almost every man I see with the Online filter has messaged me. I live near an affluent area. Lots of 6 figure salaries and some millionaires sprinkled here and there. I don't want to give any personal information but if I told you where I live you would immediately understand what I mean.\n\nEDIT: Since everyone keeps mentioning it. When I say 6 figures and some millionaires I'm NOT talking about the amounts I see on Seeking. I'm talking about what I know to be true from years of living and working here. \n\nNow, I clearly misunderstood something about the sugar lifestyle because it did not go at all the way I thought it would. The men there are just Shocked, SHOCKED I say, to learn that I expect gifts or an allowance. I wanted to see what would happen so some of them I asked for gifts, and then the others I suggested an allowance.\n\nI didn't say anything about cash app and I didn't tell them my cat died and I needed funeral money. It's not the first thing we talk about either. We first talk for a bit and then THEY hit me with the: \"What type of arrangement are you looking for?\". So I tell them. And for the record I never mentioned a specific dollar amount, just that I expected an allowance. And for the second group of men I told them what kind of gifts I would like.\n\nWhat follows is usually they tell me they're no longer interested or they block. And from lurking in this subreddit I can guess why. \"I don't want it to feel transactional.\" \"I'm not an ATM machine.\" \"The date itself is the gift.\"\n\nBut then WHAT'S THE POINT?\n\nI can have any attractive and smart young man pay for dinner and occasionally gift me things. Why would I go out and have sex with a 50 year old when all he wants to give me is \"dinner\" or \"an experience\".\n\nI doN't WAnt it To FeEL trAnSAcTionAl. BUT IT IS. The only reason any attractive young woman becomes or tries to become a sugar baby is because of the IMPLICATION.\n\nIn the end, I didn't really lose anything by joining Seeking for 3 days. There's two men I've been talking to who seem promising, but I haven't met them yet. So who knows how that's gonna turn out.\n\nGo ahead and downvote. But you know that's the truth. What's the \"Sugar\" supposed to mean exactly?",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/10hfwxb/sugar_daddies_of_the_world_explain_something_to_me/",
    "score": 104,
    "upvote_ratio": 0.85,
    "created_utc": 1674266672.0,
    "num_comments": 68,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "Most of the people are full of crap and trying to get pics, sexting or even sex for free.  In other words, you're dealing with scammers.  Not everyone there is a scammer by the way, there are real guys who are happy to share their wealth with the right SB.  I know because I'm one of them.  The real guys know there's going to be money involved and most probably already have a figure or arrangement they're comfortable with.  Any guy who hesitates, makes excuses, gets uncomfortable or claims he doesn't want to give you money because he doesn't want it to feel transactional is full of shit.   These are guys who have no intention of giving you anything and are only looking to get from you.  The real guys have no problem discussing the arrangement (as uncomfortable of an elephant as it can be sometimes) and have even less of an issue with actually forking over the dough.  \n\nWhatever SA or a guy tells you about his net worth or income is bullshit.  I was forced by SA to put something in but I don't like showing off my money or revealing too much about it.  There's plenty and that's all that needs to be said on that matter.  I'd go further to say most guys who want to show off their wealth have less than the guys who keep it simple.   So don't make the mistake of using advertised net worth or income as a gauge of anything because it doesn't matter.  Ultimately its what a guy is willing to share and can afford to do so that matters because that's the part that will affect you.\n\nAs Marilyn Monroe said: \"Don't you know that a man being rich is like a girl being pretty? You wouldn't marry a girl just because she's pretty, but my goodness, doesn't it help?\"\n\nSo...you have to  dig through a big steaming pile of shit to find the diamonds that are stuffed into the pile.  Its not pleasant or comfortable, but if you follow some rules and guidelines and get better at spotting the fakes so you don't waste as much time on them, the diamonds will begin to reveal themselves more easily to your eyes.   Best of luck!!",
            "author": "coolbaby1978",
            "id": "j58gbo8",
            "parent_id": "t3_10hfwxb",
            "score": 63,
            "created_utc": 1674271276.0,
            "replies": [
                {
                    "body": "This is great response. Ive been feeling as frustrated as OP and I understand there are lots of scammers but your reply has given me hope. I'll keep looking for a good SD, ive just gotta be patient",
                    "author": "CallMeHades119",
                    "id": "j59n4zs",
                    "parent_id": "t1_j58gbo8",
                    "score": 5,
                    "created_utc": 1674301267.0,
                    "replies": []
                },
                {
                    "body": "This is the best response I've gotten yet. A big steaming pile of shit... Sounds about right. \n\nI'll try some more digging before giving up.",
                    "author": "AzucarSala",
                    "id": "j5bw79q",
                    "parent_id": "t1_j58gbo8",
                    "score": 2,
                    "created_utc": 1674337907.0,
                    "replies": []
                },
                {
                    "body": "This x a million!",
                    "author": "AspenF1",
                    "id": "j5agsu2",
                    "parent_id": "t1_j58gbo8",
                    "score": 1,
                    "created_utc": 1674316990.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Have you heard of Sturgeon's Law?  \"90% of everything is shit.\"\n\nThis, I'm sure, applies in the sugar bowl.  Shit may be a hard term, but basically you are going to mine through a lot of crap before hitting paydirt.\n\nWhen I met my SB I took an immediate chance and set an allowance based arrangement up before we'd actually met but after we'd spent a lot of time texting, phoning, video-calling. We agreed the allowance - to the low end of what she was looking for (I've since doubled the allowance in our year together) and will occasionally help her out with gifts, holidays, etc.\n\nI am NOT a millionaire - far from it.  However, I have disposable income - and that's what I use for sugaring. I'm also lucky enough to have a flexible skillset and am self-employed so typically if I need some more money, I get off my arse and make some more money. :-)\n\nDon't get hung up on net worth, etc. (Mine is nowhere near what it should be but I have enough assets for my current lifestyle and my future) but look at the liquidity of what your potential SD has (i.e. how much cash can he get his hands on if needed to meet an emergency), and his disposable income - not the value of house, car, etc.\n\nGood luck!",
            "author": "Captain-Marmite",
            "id": "j59ei5r",
            "parent_id": "t3_10hfwxb",
            "score": 15,
            "created_utc": 1674294195.0,
            "replies": [
                {
                    "body": "Ya'll keep giving me the shit example. Sounds about right. \n\nThank you! I'll keep doing some more digging before I give up.",
                    "author": "AzucarSala",
                    "id": "j5bwycf",
                    "parent_id": "t1_j59ei5r",
                    "score": 1,
                    "created_utc": 1674338217.0,
                    "replies": []
                },
                {
                    "body": "Can I know what the skill set is?",
                    "author": "girlgamerpoi",
                    "id": "j5ajr67",
                    "parent_id": "t1_j59ei5r",
                    "score": 0,
                    "created_utc": 1674318203.0,
                    "replies": [
                        {
                            "body": "Software Engineering / IT Consultancy.  I also publish some specialist software that keeps me in beer money. :-)",
                            "author": "Captain-Marmite",
                            "id": "j5auogj",
                            "parent_id": "t1_j5ajr67",
                            "score": 3,
                            "created_utc": 1674322561.0,
                            "replies": [
                                {
                                    "body": "oh sht thats dope. I'm learning python and hopefully can do that too... Can I add you on discord for future questions? Since I'm a new learner I don't have questions for now lol.",
                                    "author": "girlgamerpoi",
                                    "id": "j5dk6gc",
                                    "parent_id": "t1_j5auogj",
                                    "score": 0,
                                    "created_utc": 1674364871.0,
                                    "replies": [
                                        {
                                            "body": "I'm afraid I don't use Discord, and don't use Python!",
                                            "author": "Captain-Marmite",
                                            "id": "j5exx4c",
                                            "parent_id": "t1_j5dk6gc",
                                            "score": 2,
                                            "created_utc": 1674399653.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "In all honesty, OP, with your attitude, you are not what the top sugar daddies are looking for, and that's why they are disqualifying, avoiding, and rejecting you. They can feel your money focus and selfishness-type vibe, a red flag, and a colossal turn-off. \n\nEmotions play an essential role in sugaring, and the positive emotions that make an SD want to spoil an SB are what the SB needs to create and maintain. Money conversations run counter to that mission, right?  So the narrative an SB uses and her true feelings is crucial to activating the SD’s generosity and loyalty while also avoiding any upsets when it comes to money issues.",
            "author": "eyesopen1111",
            "id": "j5cqca0",
            "parent_id": "t3_10hfwxb",
            "score": 9,
            "created_utc": 1674350450.0,
            "replies": []
        },
        {
            "body": "Most people that message you aren’t real. It doesn’t matter where you live or how many millionaires are around you. Most guys in seeking aren’t SDs.\n\nFilter them quickly and move on to the real guys. This is the process everyone goes through. It’s similar on the SD side.\n\nThe only thing you might want to consider is how you present the money conversation. You don’t want to come across as only money motivated. Hopefully you are looking for a guy that combines a real friendship, great physical connection and financial support. I’d focus on all three.",
            "author": "TwerkingAvocado",
            "id": "j58exuo",
            "parent_id": "t3_10hfwxb",
            "score": 19,
            "created_utc": 1674270571.0,
            "replies": []
        },
        {
            "body": "Typically, I leave or block for qualities I don’t find attractive. I understand how this lifestyle works and how it progresses. A couple things make me hit next. 1. Offering to sell pictures. If we have met, went out, I’ve gifted you and then offer to sell pics before we have the plan for intimacy I immediately hit next even if we got a long. \n\n2. Talk to me like “how it works is…” you aren’t the first baby, won’t be the last. Have a conversation, chat about expectations but don’t assume I don’t know. I want to know about you, who you are and if we are compatible. Of course I’m not going to ask you what you expect, if you want a Tiffany bracelet etc. If I like you I will probably get you something before we meet that I will hope you like, a massage, eyelashes, nails, etc all depends on what you’ve said. \n\n3. If you start with the buy me words randomly popping out unexpectedly etc. \n\nNow, it’s on them for not understanding how to have a conversation and forcing you to a point. But, no one wants to feel like it’s too much to the point. Divert to a conversation, within a short term you will know enough without even putting a number on the table. Build enough interest and your value rises. Read the thing’s written here on the remaining portions of the process. Will it take a little longer to get through the muck? Yes, but it may uncover some newbies or diamonds in the rough too.",
            "author": "CaffineandGasoline",
            "id": "j58rgrl",
            "parent_id": "t3_10hfwxb",
            "score": 6,
            "created_utc": 1674277262.0,
            "replies": [
                {
                    "body": "Have I ended up giving spa gift cards to undeserving babies? Yup, but I still got something out of it because giving feels good\n\nLol this may have no relevance to you questions but I figure style of approach can change everything.",
                    "author": "CaffineandGasoline",
                    "id": "j58sjas",
                    "parent_id": "t1_j58rgrl",
                    "score": 7,
                    "created_utc": 1674277891.0,
                    "replies": [
                        {
                            "body": "Spa gift cards?? Damn, those lucky babies",
                            "author": "Honeyyhive",
                            "id": "j5anjyj",
                            "parent_id": "t1_j58sjas",
                            "score": 3,
                            "created_utc": 1674319728.0,
                            "replies": [
                                {
                                    "body": "Ok gift certificates. And where I live 200 covers about 4 60 minute massage sessions",
                                    "author": "CaffineandGasoline",
                                    "id": "j5b35pg",
                                    "parent_id": "t1_j5anjyj",
                                    "score": 3,
                                    "created_utc": 1674325896.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Many legit SDs know to hide their profiles and only message the ones they seek out. This helps them avoid the problem on the other side of SB scammers \n\nSo odds are higher that public profile SDs messaging you would be the types you’re encountering \n\nYour best bet is to make a solid attractive profile that makes those legit SDs seek you out. They are there and probably a whole bunch in your area if it’s like you described \n\nMaybe get a profile review here if you’d like",
            "author": "OCbird22",
            "id": "j58ht9o",
            "parent_id": "t3_10hfwxb",
            "score": 16,
            "created_utc": 1674272038.0,
            "replies": [
                {
                    "body": "Yes, I hide mine too.",
                    "author": "SDinAsia",
                    "id": "j58ieb7",
                    "parent_id": "t1_j58ht9o",
                    "score": 7,
                    "created_utc": 1674272338.0,
                    "replies": [
                        {
                            "body": "I used to have a public profile when I first started SA - total waste of time  and overwhelmed by pots i couldn’t care less  about. \n\nChanged to private and since then maybe a handful of scammers that’s it since I’ve become much better at skimming past those. Some Flakes still there, but that’s a separate set of problems you can easily tackle.",
                            "author": "OCbird22",
                            "id": "j58k8xb",
                            "parent_id": "t1_j58ieb7",
                            "score": 6,
                            "created_utc": 1674273301.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Comments like this make think maybe my profile is not as good as I thought. I'm thinking maybe buy some clothes and do a little photoshoot at the beach or the park or something. \n\nI'll try to remember to post it here, and see if there really are some hidden gems that haven't noticed me.",
                    "author": "AzucarSala",
                    "id": "j5bzzq7",
                    "parent_id": "t1_j58ht9o",
                    "score": 1,
                    "created_utc": 1674339424.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Short answer: .... Most guys in the bowl are cheap, tire-kicking Johns looking for a cheap/quick score. Mixed in of course, with some outright scammers. What you're seeing has been described in here a million times.\n\n\"I don't want it to feel transactional\", is cheap John-speak for \"I want to have sex with you, and give you as little in return as I can get away with\".\n\nAlso FYI: what a guy says or looks like regarding his finances, has nothing to do with reality (in either direction). e.g. ... I am indistinguishable from a homeless person on most days when I walk around downtown Philly (on the days in between SB meetings).",
            "author": "Nomad_Bill",
            "id": "j58tv4b",
            "parent_id": "t3_10hfwxb",
            "score": 9,
            "created_utc": 1674278692.0,
            "replies": [
                {
                    "body": "Lol at your self-description. love it",
                    "author": "Honeyyhive",
                    "id": "j5an43t",
                    "parent_id": "t1_j58tv4b",
                    "score": 4,
                    "created_utc": 1674319552.0,
                    "replies": []
                },
                {
                    "body": "lol I've seen that. The men at nice places looking like hobos. \n\nI knew not everyone would be an actual generous Sugar Daddy but I didn't realize the number was so low. I assumed incorrectly that the membership price would deter some of this.",
                    "author": "AzucarSala",
                    "id": "j5bxymx",
                    "parent_id": "t1_j58tv4b",
                    "score": 2,
                    "created_utc": 1674338621.0,
                    "replies": []
                },
                {
                    "body": "Fibber that includes all second date SB meeting too. U only put in the effort for the M&G, admit it!!",
                    "author": "midasza",
                    "id": "j5bi359",
                    "parent_id": "t1_j58tv4b",
                    "score": 1,
                    "created_utc": 1674332021.0,
                    "replies": []
                }
            ]
        },
        {
            "body": ">Sugar Daddies of the world. Explain something to me.\n\nWe cannot. The men you're talking to are the only ones who can explain it. It would be like me asking you to be responsible for every hooker, escort, platonic seeker or toe dipper \"SB\" I talk to. If you have been lurking here as long as you say the answer to your question should be pretty obvious.",
            "author": null,
            "id": "j5c1hqv",
            "parent_id": "t3_10hfwxb",
            "score": 5,
            "created_utc": 1674340033.0,
            "replies": []
        },
        {
            "body": ">I doN't WAnt it To FeEL trAnSAcTionAl. BUT IT IS. The only reason any attractive young woman becomes or tries to become a sugar baby is because of the IMPLICATION.\n\nI've had the full range of SRs. I've had 100% entirely transactional it was almost a \"bulk buy\" deal from an escort. That feels like what you sort of want.\n\nI've had the other range which are like normal relationships with \"I love you\" and \"can we move in together?\" and it being a 100% real, legit relationship.\n\nI've also had relationships closer to those extremes. My current SR is 75% towards the \"I love you\" and 25% towards the bulk buy escort deal.\n\nNone of this is right or wrong, different folks what different things. Whilst they all require cash to go from me to my partner the context it is given is wildly different:\n\n1. This is what I want, this is when I want it. Give it to me.\n2. I want things, but I don't want to tell you, just read me, learn me and delight me. The more you delight me, the more I'll delight you\n3. I want you, love you first and foremost. I don't want you to pay my tuition bill because it's on me but I am really, really stuck paying it so begrudgingly accept it as I have no other choice but I'm scared you think I'm taking advantage of you.\n\nI think the acid test is how well they'd deal with me going short. (3) wouldn't care and would be desperate to see me and would be happy to travel bus / ship or whatever. (2) would care but has suggsted non sugar relationship & continue seeing each other but prefers the cash as it just makes life easier. (1) I wouldn't see for dust.\n\nYou feel closer to (1) and that's fine but not everyone is. Also, I'm pretty wealthy and so can be (1) but it's not for me. I prefer (2) and a bit of (3) but obviously old, broke guys can only be (4) \"I'll buy dinner and an uber, can you host?\" and they way outnumber the (1)s, (2)s & (3)s SDs.",
            "author": "C12H22O11-EU",
            "id": "j59cksn",
            "parent_id": "t3_10hfwxb",
            "score": 9,
            "created_utc": 1674292592.0,
            "replies": [
                {
                    "body": "This is a more nuanced reply. I do want an actual relationship with all the romantic things that come with that. I want there to be chemistry, but I also want him to take care of me financially. I don't mean every bill, just nice things. Anything I spend on hair, skin care and clothing ends up being a gift for him too anyways.",
                    "author": "AzucarSala",
                    "id": "j5byvry",
                    "parent_id": "t1_j59cksn",
                    "score": 1,
                    "created_utc": 1674338982.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "SA is full of scammers, Splendas, rinsers and johns. You’ve only been on for 3 days. Keep talking to POTs and eventually you’ll find one who is legit.",
            "author": "-Horatio-",
            "id": "j58eg99",
            "parent_id": "t3_10hfwxb",
            "score": 11,
            "created_utc": 1674270332.0,
            "replies": []
        },
        {
            "body": "OMG, you're kilin' me!\n>Why would I go out and have sex with a 50 year old when all he wants to give me is \"dinner\" or \"an experience\".",
            "author": "Privakey",
            "id": "j5960n4",
            "parent_id": "t3_10hfwxb",
            "score": 4,
            "created_utc": 1674287298.0,
            "replies": []
        },
        {
            "body": "On the flip side, legitimate men are frustrated with all the women running non stop scams on seeking.  Occasionally I meet someone amazing on seeking, but it's exhausting to find the quality girls.  I really like your straightforwardness and honesty.  I wish everyone on seeking could be that way :)",
            "author": "theheartsmaster",
            "id": "j58tib0",
            "parent_id": "t3_10hfwxb",
            "score": 7,
            "created_utc": 1674278478.0,
            "replies": [
                {
                    "body": "\"I'd love to meet you but I'm worried I'm about to loose my home and I need three grand to stop it being repossesed\"",
                    "author": "C12H22O11-EU",
                    "id": "j59cu78",
                    "parent_id": "t1_j58tib0",
                    "score": 4,
                    "created_utc": 1674292810.0,
                    "replies": [
                        {
                            "body": "> to loose my\n\n*lose\n\n *Learn the difference [here](https://www.merriam-webster.com/words-at-play/lose-vs-loose-usage#:~:text=%27Lose%27%20or%20%27Loose%27%3F&text=Lose%20typically%20functions%20only%20as,commonly%2C%20a%20noun%20or%20adverb).*\n*** \n ^(Greetings, I am a language corrector bot. To make me ignore further mistakes from you in the future, reply `!optout` to this comment.)",
                            "author": "LearnDifferenceBot",
                            "id": "j59cxle",
                            "parent_id": "t1_j59cu78",
                            "score": 2,
                            "created_utc": 1674292886.0,
                            "replies": [
                                {
                                    "body": "bad bot",
                                    "author": "HecatesCats",
                                    "id": "j5bf9r3",
                                    "parent_id": "t1_j59cxle",
                                    "score": 1,
                                    "created_utc": 1674330855.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "I got my necessities covered! I want some Sephora!",
                            "author": "AzucarSala",
                            "id": "j5c0eyb",
                            "parent_id": "t1_j59cu78",
                            "score": 1,
                            "created_utc": 1674339593.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Weird that you assume it’s only women running these scams lmao you can’t see who’s on the other side of the screen",
                    "author": "meangingersnap",
                    "id": "j5bhrd4",
                    "parent_id": "t1_j58tib0",
                    "score": 3,
                    "created_utc": 1674331884.0,
                    "replies": [
                        {
                            "body": "Fair enough.  Indeed, it could be men creating profiles of women sugar babies.",
                            "author": "theheartsmaster",
                            "id": "j5blpj3",
                            "parent_id": "t1_j5bhrd4",
                            "score": 2,
                            "created_utc": 1674333517.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "All women should want a transactional arrangement.\n\nNon transactional means no money.",
            "author": "UnearthlyDinosaur",
            "id": "j58vspk",
            "parent_id": "t3_10hfwxb",
            "score": 3,
            "created_utc": 1674279896.0,
            "replies": []
        },
        {
            "body": "> \"The date itself is the gift.\"\n\nLMFAO. Sit yo ass down.",
            "author": "FLRAdvocate",
            "id": "j58lx4l",
            "parent_id": "t3_10hfwxb",
            "score": 8,
            "created_utc": 1674274187.0,
            "replies": [
                {
                    "body": "\"My penis is the gift\"",
                    "author": null,
                    "id": "j58r828",
                    "parent_id": "t1_j58lx4l",
                    "score": 7,
                    "created_utc": 1674277121.0,
                    "replies": [
                        {
                            "body": "I put a bow on it!",
                            "author": "Funtasmcus",
                            "id": "j594yza",
                            "parent_id": "t1_j58r828",
                            "score": 4,
                            "created_utc": 1674286462.0,
                            "replies": []
                        },
                        {
                            "body": "https://tenor.com/bzCSz.gif",
                            "author": "j19104",
                            "id": "j59n4wt",
                            "parent_id": "t1_j58r828",
                            "score": 2,
                            "created_utc": 1674301265.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Welcome to SA and The Bowl\n\nYou will encounter lots of undesirables  \nPUA (Pick Up Artists) - Pump & Dumpers - Splenda - Salt - flat out 'Wannabe SD' (has no real money) - and the \"I Don't have to Pay for IT\" (entitlement is always gross!).\n\nThat and flat out Scammers who 'Ask for your bank info for a transfer' - but MUST do it directly to your bank (with YOUR Login!!)\n\nFor the SDs - we get Rinsers, Hookers, Catfish, Pig Butchers, and various scammers. \n\nIt is a part of this environment.  Just like it is a part of most human endeavors to encounter some great people - and some people who are 'substantially less than wonderful'  :D",
            "author": "sd424242",
            "id": "j58ko7x",
            "parent_id": "t3_10hfwxb",
            "score": 5,
            "created_utc": 1674273527.0,
            "replies": [
                {
                    "body": "Pig butchers?",
                    "author": "OldschoolSD",
                    "id": "j58ll65",
                    "parent_id": "t1_j58ko7x",
                    "score": 9,
                    "created_utc": 1674274012.0,
                    "replies": [
                        {
                            "body": "I am also curious.",
                            "author": "nicht_ernsthaft",
                            "id": "j5acm85",
                            "parent_id": "t1_j58ll65",
                            "score": 1,
                            "created_utc": 1674315249.0,
                            "replies": []
                        },
                        {
                            "body": ">Pig butchers?\n\nHere is an article about it  \n[https://www.finra.org/investors/insights/pig-butchering-scams](https://www.finra.org/investors/insights/pig-butchering-scams)  \n\n\nIt is a specific type of scam where they are trying to build confidence and engage someone in sending them money - all while knowing that they are only \"fattening a pig for butchering\" and that they will get money - and the victim gets nothing. \n\nUntil recently - a lot of them used this with a \"Crypto investment\" - which was a fake server farm for Crypto mining.",
                            "author": "sd424242",
                            "id": "j5f2rjd",
                            "parent_id": "t1_j58ll65",
                            "score": 1,
                            "created_utc": 1674401817.0,
                            "replies": [
                                {
                                    "body": "I know what you're talking about now. I never heard the term, but a buddy of mine was nearly sucked into one of those. The woman was so hot, all the blood flow went south and disabled his brain. She was going to give him 10k but it was in an account (with her company) to trade with. The hook was that her uncle was rich and would help her help him make good trades. It took a lot to convince him it wasn't real.",
                                    "author": "OldschoolSD",
                                    "id": "j5qd1fs",
                                    "parent_id": "t1_j5f2rjd",
                                    "score": 1,
                                    "created_utc": 1674593625.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Jesus.  Let’s count the mistakes in your post:\n\n1) You were on the site for 3 days and you think you’ve got a good feel for what genuine SDs are like?   If you’ve been reading this sub for 2 years you’d know that it takes a long time to find a good SR and that in your first few days you’re going to be bombarded with scammers. \n\n2) You are placing stock in the self-reported income numbers.  Bonus: you don’t know what “millionaire” means. \n\n3) You’re believing that men are “shocked” that you’re looking for an SR on Seeking. No one is shocked.  They’re scammers trying to pull one over on unsuspecting newbies. \n\n4) You’re combining “I don’t want it to be transactional” and “I don’t want to feel like an ATM” with “the date is the gift.”   A good SR is not transactional and no one wants to be treated like an ATM, and you’ll hear SDs who dislike both of those situations, but “the date is the gift” is not a common sentiment here and is only true in very rare circumstances (some SBs are in it for experiences, but those experiences should be very high end and this is not something most SBs want).  \n\n5) After this whole ridiculous rant you mention that you have 2 POTs you’re still interested in.  So 3 days on the site, 2 POTs and you’re complaining because of men on the site who aren’t offering what you want?  Again, I thought you’ve been reading this sub for 2 years… who told you that you’d only be contacted by perfect\ngenuine SDs?",
            "author": "DarthDaddius",
            "id": "j58r4ds",
            "parent_id": "t3_10hfwxb",
            "score": 16,
            "created_utc": 1674277061.0,
            "replies": []
        },
        {
            "body": "Ha ha good luck.",
            "author": "sugardad123",
            "id": "j59rebf",
            "parent_id": "t3_10hfwxb",
            "score": 2,
            "created_utc": 1674304385.0,
            "replies": []
        },
        {
            "body": "You got a lot of good responses.\n\nI want to reiterate that there are plenty of real sugar daddies out there.  I know from talking to SB's who have a lot of experience.\n\nIt seems to me (and I didn't see this in the other comments) that you might be giving off the wrong vibe somehow.  An allowance is expected, and it's reasonable to discuss it fairly early (so that people don't waste their time), but don't do it on SA (move off the site first), and you might sound like someone who's going to take the money and run.  There's a lot of nuance in exactly what you say. \n\nAnother possibility is that your profile is somehow attracting the wrong guys (and not attracting the right guys).  Again, there's a lot of nuance.  \n\nIf you stick with it, I wish you luck.  If you don't, I can't blame you.",
            "author": "PapaMMG",
            "id": "j5aaaq1",
            "parent_id": "t3_10hfwxb",
            "score": 2,
            "created_utc": 1674314241.0,
            "replies": [
                {
                    "body": "You might be right. I don't show cleavage but I do have some very... visible legs. I have an hourglass shape so unless I wear baggy clothes it can look sexual. Maybe I don't have a good enough about me? \n\nI'll try a different tactic and see what happens. And if not Oh well.",
                    "author": "AzucarSala",
                    "id": "j5c3yv9",
                    "parent_id": "t1_j5aaaq1",
                    "score": 0,
                    "created_utc": 1674341021.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "j5b0nop",
            "parent_id": "t3_10hfwxb",
            "score": 2,
            "created_utc": 1674324903.0,
            "replies": [
                {
                    "body": "It could be I'm not as hot as I think I am. The world may never know.",
                    "author": "AzucarSala",
                    "id": "j5c1ys2",
                    "parent_id": "t1_j5b0nop",
                    "score": 1,
                    "created_utc": 1674340222.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I gave up on seeking for these very reasons being talked about. Trying to find an SB seems impossible these days.I truly wish there was a better way",
            "author": null,
            "id": "j5cq4x6",
            "parent_id": "t3_10hfwxb",
            "score": 2,
            "created_utc": 1674350356.0,
            "replies": []
        },
        {
            "body": "Are you asking for money before the meet and greet ? Allowance is for established relationships. Pretty much no one will start with one, ppm at the beginning after meeting and establishing a connection.",
            "author": "Hope_for_tendies",
            "id": "j58ivjz",
            "parent_id": "t3_10hfwxb",
            "score": 4,
            "created_utc": 1674272588.0,
            "replies": [
                {
                    "body": "This\nUntil its an agreed relationship/arrangement we're not anything yet. Sure, I can show some generousity because you made an effort to get to know me and turn up to a meet but if Im paying you to turn up then Im paying for a service Im not even sure I want yet.",
                    "author": "Upper-District-50",
                    "id": "j58qnmg",
                    "parent_id": "t1_j58ivjz",
                    "score": 5,
                    "created_utc": 1674276792.0,
                    "replies": []
                },
                {
                    "body": "No I did not! Maybe I mentioned an allowance before meeting them in person, but I'm not trying to waste my time. I did not ask them for money immediately, just that that was the end goal if we end up liking each other.",
                    "author": "AzucarSala",
                    "id": "j5c2mhz",
                    "parent_id": "t1_j58ivjz",
                    "score": 1,
                    "created_utc": 1674340480.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I shouted “exactly!” so many times while reading this 💀",
            "author": "icequeen1999",
            "id": "j5aau4d",
            "parent_id": "t3_10hfwxb",
            "score": 2,
            "created_utc": 1674314480.0,
            "replies": []
        },
        {
            "body": "You seem entitled but you are right on all the main points. \n\nIt is transactional. It’s an arrangement that would not otherwise exist without $$$ flowing.",
            "author": "Top_Cold6204",
            "id": "j590j9k",
            "parent_id": "t3_10hfwxb",
            "score": 1,
            "created_utc": 1674283083.0,
            "replies": []
        },
        {
            "body": "This is the complete opposite of my experience. I joined on Monday, been on 3 dates, and am seeing 2 of them now. I always check their profile, if I don't see the words \"mutually beneficial\" I next them. I ask if they have had a previous sugar relationship, if it's a yes then I proceed. \nBest of luck!",
            "author": "Pretend_Apartment927",
            "id": "j5a6aam",
            "parent_id": "t3_10hfwxb",
            "score": 1,
            "created_utc": 1674312430.0,
            "replies": [
                {
                    "body": "I incorrectly assumed it was obvious since \"mutually beneficial\" is in my profile and I have \"Life of Leisure\" and \"Luxury Lifestyle\".\n\nMaybe the photos I chose don't show how hot I am? I'm going to buy some new clothes and go do a little photoshoot at the beach or the flower park.",
                    "author": "AzucarSala",
                    "id": "j5c1mot",
                    "parent_id": "t1_j5a6aam",
                    "score": 2,
                    "created_utc": 1674340088.0,
                    "replies": [
                        {
                            "body": "Honestly some men just don't get it, they don't know the terms or the lingo. I check their profile and if it doesn't seem like they know what they are doing here I don't respond.",
                            "author": "Pretend_Apartment927",
                            "id": "j5c6569",
                            "parent_id": "t1_j5c1mot",
                            "score": 0,
                            "created_utc": 1674341919.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "What does “a reviews relationship” mean in this context?",
                    "author": "Campfire77",
                    "id": "j5b7g52",
                    "parent_id": "t1_j5a6aam",
                    "score": 1,
                    "created_utc": 1674327627.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "when I ask what type of arrangement a woman is looking for Im not looking for her to say I want financial assistance or give me a dollar amount. Im looking for what type of relationship shes looking to get that financial assistance.\n\nToo many women come to seeking wanting money, but have no idea what they bring to the table besides perhaps being attractive.\n\nWhat I want to hear from a woman is that Im lookin for an arrangements with a genuine connection and good chemistry, we genuinely care about each others happiness, see each other constantly, go on fun dates both indoors and out, and genuinely enjoy each others company. I want her to tell me shes either looking for NSA, FWB or exclusivity,.\n\nI women relying Im looking for financial assistance is like a guy replying and saying Im looking for sex. How does that make you sound..?",
            "author": "NickPfromYuma",
            "id": "j5b5vcu",
            "parent_id": "t3_10hfwxb",
            "score": 1,
            "created_utc": 1674326991.0,
            "replies": [
                {
                    "body": "But they do. Very often, very publicly. Not really the point you think it is.\n\nBut I might have misunderstood what they meant by \"What kind of relationship are you looking for?\". Noted.",
                    "author": "AzucarSala",
                    "id": "j5c4dof",
                    "parent_id": "t1_j5b5vcu",
                    "score": 0,
                    "created_utc": 1674341191.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "All new accounts,  m,f,whatever are bombed by scammers, Johns and time wasters in the first few days.\n\nYour experience is almost universal for everyone. \n\nGive it another few days, and three quarters of these will have moved to the next Seeking newb.",
            "author": "Frank9567",
            "id": "j5cd3la",
            "parent_id": "t3_10hfwxb",
            "score": 0,
            "created_utc": 1674344795.0,
            "replies": []
        },
        {
            "body": "What you are looking for is perfectly reasonable.  However the boys you have encountered are looking for an escort.",
            "author": "ifxnj",
            "id": "j5jbdl5",
            "parent_id": "t3_10hfwxb",
            "score": 1,
            "created_utc": 1674476402.0,
            "replies": []
        },
        {
            "body": "Sadly, most men on Seeking seem to be non SDs. Thanks to the \"re-brand\" Seeking in so longer a sugar site. Real SDs are still here because unfortunately there has not been any viable alternative elsewhere, so sugar dating is becoming a shit show. \n\n As an aspiring SB you just need to be direct in stating what you expect and stick to your guns un-apologetically.",
            "author": "GSSD",
            "id": "j5li4l6",
            "parent_id": "t3_10hfwxb",
            "score": 1,
            "created_utc": 1674508754.0,
            "replies": []
        },
        {
            "body": "1) Top % guys in United states of America, does not need to pay  \n2) That guys should NOT block you because of you want allowance, cuz that is what seeking is for. He doesn't want transactional, go to tinder  \n3) Yes 50 year old guy needs to stop thinkin vanilla date",
            "author": "Deep_Crypto_Value",
            "id": "j6wmhhi",
            "parent_id": "t3_10hfwxb",
            "score": 1,
            "created_utc": 1675340651.0,
            "replies": []
        },
        {
            "body": "This is great response. Ive been feeling as frustrated as OP and I understand there are lots of scammers but your reply has given me hope. I'll keep looking for a good SD, ive just gotta be patient",
            "author": "CallMeHades119",
            "id": "j59n4zs",
            "parent_id": "t1_j58gbo8",
            "score": 5,
            "created_utc": 1674301267.0,
            "replies": []
        },
        {
            "body": "This is the best response I've gotten yet. A big steaming pile of shit... Sounds about right. \n\nI'll try some more digging before giving up.",
            "author": "AzucarSala",
            "id": "j5bw79q",
            "parent_id": "t1_j58gbo8",
            "score": 2,
            "created_utc": 1674337907.0,
            "replies": []
        },
        {
            "body": "This x a million!",
            "author": "AspenF1",
            "id": "j5agsu2",
            "parent_id": "t1_j58gbo8",
            "score": 1,
            "created_utc": 1674316990.0,
            "replies": []
        },
        {
            "body": "Ya'll keep giving me the shit example. Sounds about right. \n\nThank you! I'll keep doing some more digging before I give up.",
            "author": "AzucarSala",
            "id": "j5bwycf",
            "parent_id": "t1_j59ei5r",
            "score": 1,
            "created_utc": 1674338217.0,
            "replies": []
        },
        {
            "body": "Can I know what the skill set is?",
            "author": "girlgamerpoi",
            "id": "j5ajr67",
            "parent_id": "t1_j59ei5r",
            "score": 0,
            "created_utc": 1674318203.0,
            "replies": [
                {
                    "body": "Software Engineering / IT Consultancy.  I also publish some specialist software that keeps me in beer money. :-)",
                    "author": "Captain-Marmite",
                    "id": "j5auogj",
                    "parent_id": "t1_j5ajr67",
                    "score": 3,
                    "created_utc": 1674322561.0,
                    "replies": [
                        {
                            "body": "oh sht thats dope. I'm learning python and hopefully can do that too... Can I add you on discord for future questions? Since I'm a new learner I don't have questions for now lol.",
                            "author": "girlgamerpoi",
                            "id": "j5dk6gc",
                            "parent_id": "t1_j5auogj",
                            "score": 0,
                            "created_utc": 1674364871.0,
                            "replies": [
                                {
                                    "body": "I'm afraid I don't use Discord, and don't use Python!",
                                    "author": "Captain-Marmite",
                                    "id": "j5exx4c",
                                    "parent_id": "t1_j5dk6gc",
                                    "score": 2,
                                    "created_utc": 1674399653.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Have I ended up giving spa gift cards to undeserving babies? Yup, but I still got something out of it because giving feels good\n\nLol this may have no relevance to you questions but I figure style of approach can change everything.",
            "author": "CaffineandGasoline",
            "id": "j58sjas",
            "parent_id": "t1_j58rgrl",
            "score": 7,
            "created_utc": 1674277891.0,
            "replies": [
                {
                    "body": "Spa gift cards?? Damn, those lucky babies",
                    "author": "Honeyyhive",
                    "id": "j5anjyj",
                    "parent_id": "t1_j58sjas",
                    "score": 3,
                    "created_utc": 1674319728.0,
                    "replies": [
                        {
                            "body": "Ok gift certificates. And where I live 200 covers about 4 60 minute massage sessions",
                            "author": "CaffineandGasoline",
                            "id": "j5b35pg",
                            "parent_id": "t1_j5anjyj",
                            "score": 3,
                            "created_utc": 1674325896.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Yes, I hide mine too.",
            "author": "SDinAsia",
            "id": "j58ieb7",
            "parent_id": "t1_j58ht9o",
            "score": 7,
            "created_utc": 1674272338.0,
            "replies": [
                {
                    "body": "I used to have a public profile when I first started SA - total waste of time  and overwhelmed by pots i couldn’t care less  about. \n\nChanged to private and since then maybe a handful of scammers that’s it since I’ve become much better at skimming past those. Some Flakes still there, but that’s a separate set of problems you can easily tackle.",
                    "author": "OCbird22",
                    "id": "j58k8xb",
                    "parent_id": "t1_j58ieb7",
                    "score": 6,
                    "created_utc": 1674273301.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Comments like this make think maybe my profile is not as good as I thought. I'm thinking maybe buy some clothes and do a little photoshoot at the beach or the park or something. \n\nI'll try to remember to post it here, and see if there really are some hidden gems that haven't noticed me.",
            "author": "AzucarSala",
            "id": "j5bzzq7",
            "parent_id": "t1_j58ht9o",
            "score": 1,
            "created_utc": 1674339424.0,
            "replies": []
        },
        {
            "body": "Lol at your self-description. love it",
            "author": "Honeyyhive",
            "id": "j5an43t",
            "parent_id": "t1_j58tv4b",
            "score": 4,
            "created_utc": 1674319552.0,
            "replies": []
        },
        {
            "body": "lol I've seen that. The men at nice places looking like hobos. \n\nI knew not everyone would be an actual generous Sugar Daddy but I didn't realize the number was so low. I assumed incorrectly that the membership price would deter some of this.",
            "author": "AzucarSala",
            "id": "j5bxymx",
            "parent_id": "t1_j58tv4b",
            "score": 2,
            "created_utc": 1674338621.0,
            "replies": []
        },
        {
            "body": "Fibber that includes all second date SB meeting too. U only put in the effort for the M&G, admit it!!",
            "author": "midasza",
            "id": "j5bi359",
            "parent_id": "t1_j58tv4b",
            "score": 1,
            "created_utc": 1674332021.0,
            "replies": []
        },
        {
            "body": "This is a more nuanced reply. I do want an actual relationship with all the romantic things that come with that. I want there to be chemistry, but I also want him to take care of me financially. I don't mean every bill, just nice things. Anything I spend on hair, skin care and clothing ends up being a gift for him too anyways.",
            "author": "AzucarSala",
            "id": "j5byvry",
            "parent_id": "t1_j59cksn",
            "score": 1,
            "created_utc": 1674338982.0,
            "replies": []
        },
        {
            "body": "\"I'd love to meet you but I'm worried I'm about to loose my home and I need three grand to stop it being repossesed\"",
            "author": "C12H22O11-EU",
            "id": "j59cu78",
            "parent_id": "t1_j58tib0",
            "score": 4,
            "created_utc": 1674292810.0,
            "replies": [
                {
                    "body": "> to loose my\n\n*lose\n\n *Learn the difference [here](https://www.merriam-webster.com/words-at-play/lose-vs-loose-usage#:~:text=%27Lose%27%20or%20%27Loose%27%3F&text=Lose%20typically%20functions%20only%20as,commonly%2C%20a%20noun%20or%20adverb).*\n*** \n ^(Greetings, I am a language corrector bot. To make me ignore further mistakes from you in the future, reply `!optout` to this comment.)",
                    "author": "LearnDifferenceBot",
                    "id": "j59cxle",
                    "parent_id": "t1_j59cu78",
                    "score": 2,
                    "created_utc": 1674292886.0,
                    "replies": [
                        {
                            "body": "bad bot",
                            "author": "HecatesCats",
                            "id": "j5bf9r3",
                            "parent_id": "t1_j59cxle",
                            "score": 1,
                            "created_utc": 1674330855.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "I got my necessities covered! I want some Sephora!",
                    "author": "AzucarSala",
                    "id": "j5c0eyb",
                    "parent_id": "t1_j59cu78",
                    "score": 1,
                    "created_utc": 1674339593.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Weird that you assume it’s only women running these scams lmao you can’t see who’s on the other side of the screen",
            "author": "meangingersnap",
            "id": "j5bhrd4",
            "parent_id": "t1_j58tib0",
            "score": 3,
            "created_utc": 1674331884.0,
            "replies": [
                {
                    "body": "Fair enough.  Indeed, it could be men creating profiles of women sugar babies.",
                    "author": "theheartsmaster",
                    "id": "j5blpj3",
                    "parent_id": "t1_j5bhrd4",
                    "score": 2,
                    "created_utc": 1674333517.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "\"My penis is the gift\"",
            "author": null,
            "id": "j58r828",
            "parent_id": "t1_j58lx4l",
            "score": 7,
            "created_utc": 1674277121.0,
            "replies": [
                {
                    "body": "I put a bow on it!",
                    "author": "Funtasmcus",
                    "id": "j594yza",
                    "parent_id": "t1_j58r828",
                    "score": 4,
                    "created_utc": 1674286462.0,
                    "replies": []
                },
                {
                    "body": "https://tenor.com/bzCSz.gif",
                    "author": "j19104",
                    "id": "j59n4wt",
                    "parent_id": "t1_j58r828",
                    "score": 2,
                    "created_utc": 1674301265.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Pig butchers?",
            "author": "OldschoolSD",
            "id": "j58ll65",
            "parent_id": "t1_j58ko7x",
            "score": 9,
            "created_utc": 1674274012.0,
            "replies": [
                {
                    "body": "I am also curious.",
                    "author": "nicht_ernsthaft",
                    "id": "j5acm85",
                    "parent_id": "t1_j58ll65",
                    "score": 1,
                    "created_utc": 1674315249.0,
                    "replies": []
                },
                {
                    "body": ">Pig butchers?\n\nHere is an article about it  \n[https://www.finra.org/investors/insights/pig-butchering-scams](https://www.finra.org/investors/insights/pig-butchering-scams)  \n\n\nIt is a specific type of scam where they are trying to build confidence and engage someone in sending them money - all while knowing that they are only \"fattening a pig for butchering\" and that they will get money - and the victim gets nothing. \n\nUntil recently - a lot of them used this with a \"Crypto investment\" - which was a fake server farm for Crypto mining.",
                    "author": "sd424242",
                    "id": "j5f2rjd",
                    "parent_id": "t1_j58ll65",
                    "score": 1,
                    "created_utc": 1674401817.0,
                    "replies": [
                        {
                            "body": "I know what you're talking about now. I never heard the term, but a buddy of mine was nearly sucked into one of those. The woman was so hot, all the blood flow went south and disabled his brain. She was going to give him 10k but it was in an account (with her company) to trade with. The hook was that her uncle was rich and would help her help him make good trades. It took a lot to convince him it wasn't real.",
                            "author": "OldschoolSD",
                            "id": "j5qd1fs",
                            "parent_id": "t1_j5f2rjd",
                            "score": 1,
                            "created_utc": 1674593625.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "You might be right. I don't show cleavage but I do have some very... visible legs. I have an hourglass shape so unless I wear baggy clothes it can look sexual. Maybe I don't have a good enough about me? \n\nI'll try a different tactic and see what happens. And if not Oh well.",
            "author": "AzucarSala",
            "id": "j5c3yv9",
            "parent_id": "t1_j5aaaq1",
            "score": 0,
            "created_utc": 1674341021.0,
            "replies": []
        },
        {
            "body": "It could be I'm not as hot as I think I am. The world may never know.",
            "author": "AzucarSala",
            "id": "j5c1ys2",
            "parent_id": "t1_j5b0nop",
            "score": 1,
            "created_utc": 1674340222.0,
            "replies": []
        },
        {
            "body": "This\nUntil its an agreed relationship/arrangement we're not anything yet. Sure, I can show some generousity because you made an effort to get to know me and turn up to a meet but if Im paying you to turn up then Im paying for a service Im not even sure I want yet.",
            "author": "Upper-District-50",
            "id": "j58qnmg",
            "parent_id": "t1_j58ivjz",
            "score": 5,
            "created_utc": 1674276792.0,
            "replies": []
        },
        {
            "body": "No I did not! Maybe I mentioned an allowance before meeting them in person, but I'm not trying to waste my time. I did not ask them for money immediately, just that that was the end goal if we end up liking each other.",
            "author": "AzucarSala",
            "id": "j5c2mhz",
            "parent_id": "t1_j58ivjz",
            "score": 1,
            "created_utc": 1674340480.0,
            "replies": []
        },
        {
            "body": "I incorrectly assumed it was obvious since \"mutually beneficial\" is in my profile and I have \"Life of Leisure\" and \"Luxury Lifestyle\".\n\nMaybe the photos I chose don't show how hot I am? I'm going to buy some new clothes and go do a little photoshoot at the beach or the flower park.",
            "author": "AzucarSala",
            "id": "j5c1mot",
            "parent_id": "t1_j5a6aam",
            "score": 2,
            "created_utc": 1674340088.0,
            "replies": [
                {
                    "body": "Honestly some men just don't get it, they don't know the terms or the lingo. I check their profile and if it doesn't seem like they know what they are doing here I don't respond.",
                    "author": "Pretend_Apartment927",
                    "id": "j5c6569",
                    "parent_id": "t1_j5c1mot",
                    "score": 0,
                    "created_utc": 1674341919.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "What does “a reviews relationship” mean in this context?",
            "author": "Campfire77",
            "id": "j5b7g52",
            "parent_id": "t1_j5a6aam",
            "score": 1,
            "created_utc": 1674327627.0,
            "replies": []
        },
        {
            "body": "But they do. Very often, very publicly. Not really the point you think it is.\n\nBut I might have misunderstood what they meant by \"What kind of relationship are you looking for?\". Noted.",
            "author": "AzucarSala",
            "id": "j5c4dof",
            "parent_id": "t1_j5b5vcu",
            "score": 0,
            "created_utc": 1674341191.0,
            "replies": []
        },
        {
            "body": "Software Engineering / IT Consultancy.  I also publish some specialist software that keeps me in beer money. :-)",
            "author": "Captain-Marmite",
            "id": "j5auogj",
            "parent_id": "t1_j5ajr67",
            "score": 3,
            "created_utc": 1674322561.0,
            "replies": [
                {
                    "body": "oh sht thats dope. I'm learning python and hopefully can do that too... Can I add you on discord for future questions? Since I'm a new learner I don't have questions for now lol.",
                    "author": "girlgamerpoi",
                    "id": "j5dk6gc",
                    "parent_id": "t1_j5auogj",
                    "score": 0,
                    "created_utc": 1674364871.0,
                    "replies": [
                        {
                            "body": "I'm afraid I don't use Discord, and don't use Python!",
                            "author": "Captain-Marmite",
                            "id": "j5exx4c",
                            "parent_id": "t1_j5dk6gc",
                            "score": 2,
                            "created_utc": 1674399653.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Spa gift cards?? Damn, those lucky babies",
            "author": "Honeyyhive",
            "id": "j5anjyj",
            "parent_id": "t1_j58sjas",
            "score": 3,
            "created_utc": 1674319728.0,
            "replies": [
                {
                    "body": "Ok gift certificates. And where I live 200 covers about 4 60 minute massage sessions",
                    "author": "CaffineandGasoline",
                    "id": "j5b35pg",
                    "parent_id": "t1_j5anjyj",
                    "score": 3,
                    "created_utc": 1674325896.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I used to have a public profile when I first started SA - total waste of time  and overwhelmed by pots i couldn’t care less  about. \n\nChanged to private and since then maybe a handful of scammers that’s it since I’ve become much better at skimming past those. Some Flakes still there, but that’s a separate set of problems you can easily tackle.",
            "author": "OCbird22",
            "id": "j58k8xb",
            "parent_id": "t1_j58ieb7",
            "score": 6,
            "created_utc": 1674273301.0,
            "replies": []
        },
        {
            "body": "> to loose my\n\n*lose\n\n *Learn the difference [here](https://www.merriam-webster.com/words-at-play/lose-vs-loose-usage#:~:text=%27Lose%27%20or%20%27Loose%27%3F&text=Lose%20typically%20functions%20only%20as,commonly%2C%20a%20noun%20or%20adverb).*\n*** \n ^(Greetings, I am a language corrector bot. To make me ignore further mistakes from you in the future, reply `!optout` to this comment.)",
            "author": "LearnDifferenceBot",
            "id": "j59cxle",
            "parent_id": "t1_j59cu78",
            "score": 2,
            "created_utc": 1674292886.0,
            "replies": [
                {
                    "body": "bad bot",
                    "author": "HecatesCats",
                    "id": "j5bf9r3",
                    "parent_id": "t1_j59cxle",
                    "score": 1,
                    "created_utc": 1674330855.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I got my necessities covered! I want some Sephora!",
            "author": "AzucarSala",
            "id": "j5c0eyb",
            "parent_id": "t1_j59cu78",
            "score": 1,
            "created_utc": 1674339593.0,
            "replies": []
        },
        {
            "body": "Fair enough.  Indeed, it could be men creating profiles of women sugar babies.",
            "author": "theheartsmaster",
            "id": "j5blpj3",
            "parent_id": "t1_j5bhrd4",
            "score": 2,
            "created_utc": 1674333517.0,
            "replies": []
        },
        {
            "body": "I put a bow on it!",
            "author": "Funtasmcus",
            "id": "j594yza",
            "parent_id": "t1_j58r828",
            "score": 4,
            "created_utc": 1674286462.0,
            "replies": []
        },
        {
            "body": "https://tenor.com/bzCSz.gif",
            "author": "j19104",
            "id": "j59n4wt",
            "parent_id": "t1_j58r828",
            "score": 2,
            "created_utc": 1674301265.0,
            "replies": []
        },
        {
            "body": "I am also curious.",
            "author": "nicht_ernsthaft",
            "id": "j5acm85",
            "parent_id": "t1_j58ll65",
            "score": 1,
            "created_utc": 1674315249.0,
            "replies": []
        },
        {
            "body": ">Pig butchers?\n\nHere is an article about it  \n[https://www.finra.org/investors/insights/pig-butchering-scams](https://www.finra.org/investors/insights/pig-butchering-scams)  \n\n\nIt is a specific type of scam where they are trying to build confidence and engage someone in sending them money - all while knowing that they are only \"fattening a pig for butchering\" and that they will get money - and the victim gets nothing. \n\nUntil recently - a lot of them used this with a \"Crypto investment\" - which was a fake server farm for Crypto mining.",
            "author": "sd424242",
            "id": "j5f2rjd",
            "parent_id": "t1_j58ll65",
            "score": 1,
            "created_utc": 1674401817.0,
            "replies": [
                {
                    "body": "I know what you're talking about now. I never heard the term, but a buddy of mine was nearly sucked into one of those. The woman was so hot, all the blood flow went south and disabled his brain. She was going to give him 10k but it was in an account (with her company) to trade with. The hook was that her uncle was rich and would help her help him make good trades. It took a lot to convince him it wasn't real.",
                    "author": "OldschoolSD",
                    "id": "j5qd1fs",
                    "parent_id": "t1_j5f2rjd",
                    "score": 1,
                    "created_utc": 1674593625.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Honestly some men just don't get it, they don't know the terms or the lingo. I check their profile and if it doesn't seem like they know what they are doing here I don't respond.",
            "author": "Pretend_Apartment927",
            "id": "j5c6569",
            "parent_id": "t1_j5c1mot",
            "score": 0,
            "created_utc": 1674341919.0,
            "replies": []
        },
        {
            "body": "oh sht thats dope. I'm learning python and hopefully can do that too... Can I add you on discord for future questions? Since I'm a new learner I don't have questions for now lol.",
            "author": "girlgamerpoi",
            "id": "j5dk6gc",
            "parent_id": "t1_j5auogj",
            "score": 0,
            "created_utc": 1674364871.0,
            "replies": [
                {
                    "body": "I'm afraid I don't use Discord, and don't use Python!",
                    "author": "Captain-Marmite",
                    "id": "j5exx4c",
                    "parent_id": "t1_j5dk6gc",
                    "score": 2,
                    "created_utc": 1674399653.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Ok gift certificates. And where I live 200 covers about 4 60 minute massage sessions",
            "author": "CaffineandGasoline",
            "id": "j5b35pg",
            "parent_id": "t1_j5anjyj",
            "score": 3,
            "created_utc": 1674325896.0,
            "replies": []
        },
        {
            "body": "bad bot",
            "author": "HecatesCats",
            "id": "j5bf9r3",
            "parent_id": "t1_j59cxle",
            "score": 1,
            "created_utc": 1674330855.0,
            "replies": []
        },
        {
            "body": "I know what you're talking about now. I never heard the term, but a buddy of mine was nearly sucked into one of those. The woman was so hot, all the blood flow went south and disabled his brain. She was going to give him 10k but it was in an account (with her company) to trade with. The hook was that her uncle was rich and would help her help him make good trades. It took a lot to convince him it wasn't real.",
            "author": "OldschoolSD",
            "id": "j5qd1fs",
            "parent_id": "t1_j5f2rjd",
            "score": 1,
            "created_utc": 1674593625.0,
            "replies": []
        },
        {
            "body": "I'm afraid I don't use Discord, and don't use Python!",
            "author": "Captain-Marmite",
            "id": "j5exx4c",
            "parent_id": "t1_j5dk6gc",
            "score": 2,
            "created_utc": 1674399653.0,
            "replies": []
        }
    ]
}