{
    "title": "Stop arguing with SBs who’ve stated their worth",
    "post_id": "jwlfgk",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/jwlfgk/stop_arguing_with_sbs_whove_stated_their_worth/",
    "author": null,
    "body": "SDs and wannabe SDs stop arguing with women just because they stated their worth. I’ve had it happened to me and know a lot of other SBs. It’s already a lot to put yourself out there in the sugar world , so what make it harder on others and yourself. Just say hey, it’s not gonna work out. I’ve literally had men say “woc aren’t worth that much” , “stop being greedy”, “my last SB would blow me off for 100$ a week”, “my last SB was cheaper”,etc.",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/jwlfgk/stop_arguing_with_sbs_whove_stated_their_worth/",
    "score": 129,
    "upvote_ratio": 0.87,
    "created_utc": 1605724574.0,
    "num_comments": 103,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "I don't believe in trying to \"bargain\" from either side, seems it would set things up on the wrong foot. Everyone has a right to ask for what they want in the bowl, and may get it or may not. It's not our job to convince someone otherwise, just wish each other good luck and move on.",
            "author": "roscoe7585",
            "id": "gcr1xvr",
            "parent_id": "t3_jwlfgk",
            "score": 44,
            "created_utc": 1605728831.0,
            "replies": [
                {
                    "body": "\nI'm a great  believer in the approach that the allowance is based on what each thinks is the right amount to balance the relationship.  In some cases that's not an amount that the SD thinks is right or the SB feels is inadequate. It's is in the eye and capacity (and interest) of the beholder, both SB and SD. \n\nRather than thinking of sugar as a commodity  stop and think of it as artwork of the soul......  There is no absolute but rather how it appeals to the people considering an arrangement.  If it doesn't work don't try to make it work.",
                    "author": "pinotandsugar",
                    "id": "gcsx2tv",
                    "parent_id": "t1_gcr1xvr",
                    "score": 8,
                    "created_utc": 1605764307.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "In my perfect world this discussion happens early and goes like this.\n\nSomeone goes first so I will call them 1 and 2. Either the SD or SB can be 1. It doesn't matter and varies.\n\n1 - here is what I'd be comfortable with.\n\n2 - Okay (and we've got a deal)\n\nOr\n\n2 - here is what I'm comfortable with.\n\n1 can say one of 3 things\n\nSorry I can't do that (done)\n\nOkay I guess that works (deal)\n\nHow about this.\n\n2 that's good (deal) or I can't do that, sorry (done)\n\nIf the conversation goes beyond that, or if one person starts to say the other's ask is unreasonable or otherwise argue for some reason, I'm done, done, done. For me the money thing is a hurdle, an obstacle between me and a good SR. I want to get past it quickly and easily so I can get on to the good stuff.\n\nHappy SRs are built by finding someone simpatico. Among many things that means someone whose wishes align with mine. If I'm starting by convincing them to do something different than what they want, we're not a good fit.",
            "author": "ziggy440",
            "id": "gcqwwgq",
            "parent_id": "t3_jwlfgk",
            "score": 31,
            "created_utc": 1605726448.0,
            "replies": [
                {
                    "body": "Couldn’t agree more with your approach.  \n\nSome times it just “is what it is”\n\nSDs should always stay classy.  \n\nBe respectful and wish them luck.",
                    "author": "BGDDDY1",
                    "id": "gcrl286",
                    "parent_id": "t1_gcqwwgq",
                    "score": 9,
                    "created_utc": 1605737959.0,
                    "replies": []
                },
                {
                    "body": "Totally agree",
                    "author": "staceylacey_22",
                    "id": "gcr9ud1",
                    "parent_id": "t1_gcqwwgq",
                    "score": 5,
                    "created_utc": 1605732582.0,
                    "replies": []
                },
                {
                    "body": "I agree with your approach. It keeps things classy and easy. I've done it that way. I've had ladies say, \"Oh, I can't do that.\" And we ceased chatting. And ladies who went first and I said that I couldn't do that. And that was that. And, had one counter and we moved forward. \n\nIt takes some nerve to go first, but it gets easier over time.",
                    "author": "Haffbad",
                    "id": "gcsklyc",
                    "parent_id": "t1_gcqwwgq",
                    "score": 4,
                    "created_utc": 1605756252.0,
                    "replies": []
                },
                {
                    "body": "Many women are uncomfortable with the financial discussion and many women want to be clear about expectations early on.  There is not one answer.   I progress through the discussion by first mentioning I provide financial support, then explaining how I provide financial support and then discussing specific numbers.  I let them decide if they want to discuss more at each step.  \n\nPushing numbers on someone that is not comfortable with the discussion is rude.  Avoiding the financial discussion with someone that wants to set clear expectations early on is rude.  There is not a one size fits all, but it's not that hard to navigate the path.",
                    "author": "willfromvb",
                    "id": "gctqzyi",
                    "parent_id": "t1_gcqwwgq",
                    "score": 5,
                    "created_utc": 1605792005.0,
                    "replies": [
                        {
                            "body": "Agreed. If someone wishes to avoid or delay discussion of money that is certainly their prerogative. My outline is solely my maximum limit to discussion of allowance/ppm. If the answer is \"Let's get together first and see how we get along,\" or \"I really do not want to discuss money, just give me what you think is right\" I accede. Both of those are real quotes, btw, and that second one caused me a month of doubt that ultimately changed how I view allowance. Now I have a minimum I will pay, regardless of what is requested.",
                            "author": "ziggy440",
                            "id": "gctu2ul",
                            "parent_id": "t1_gctqzyi",
                            "score": 2,
                            "created_utc": 1605794001.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Agree it should be easy.",
                    "author": "bookworm010101",
                    "id": "gcrpn1i",
                    "parent_id": "t1_gcqwwgq",
                    "score": 3,
                    "created_utc": 1605740038.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Honestly any guy who wants to argue or barter about anything having to do with comfort levels is an instant red flag turn off for me. It immediately makes me feel that they aren’t interested in any kind of relationship, they just want a sex doll",
            "author": null,
            "id": "gcr9hy6",
            "parent_id": "t3_jwlfgk",
            "score": 24,
            "created_utc": 1605732418.0,
            "replies": [
                {
                    "body": "Right, they’re looking for a below market rate hooker.",
                    "author": "LexyGlobal",
                    "id": "gcsu2rq",
                    "parent_id": "t1_gcr9hy6",
                    "score": 5,
                    "created_utc": 1605762134.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Totally agree. Sometimes the ones who mentioned they’re generous in their bio are the least generous. \n\nI always bring up $ pretty quickly; let’s get to the point. I recently received a “I don’t usually wrap it in that much structure” when I asked how much he intended on paying me. I stopped talking to him. \n\nIf you let him get away with saying that kind of stuff before you even see money from him, move on sis. It’s not gonna get better.",
            "author": "Itsbritneybitch69420",
            "id": "gcr576c",
            "parent_id": "t3_jwlfgk",
            "score": 29,
            "created_utc": 1605730381.0,
            "replies": [
                {
                    "body": "I love the direct approach on the financial element.  \n\nI won’t even go on a M&G unless we’ve had at least a general discussion. \n\nGet that shit out of the way early....",
                    "author": "BGDDDY1",
                    "id": "gcrl9wk",
                    "parent_id": "t1_gcr576c",
                    "score": 18,
                    "created_utc": 1605738066.0,
                    "replies": [
                        {
                            "body": "ding ding",
                            "author": "bookworm010101",
                            "id": "gcrppmi",
                            "parent_id": "t1_gcrl9wk",
                            "score": 10,
                            "created_utc": 1605740068.0,
                            "replies": []
                        },
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "gctpfv9",
                            "parent_id": "t1_gcrl9wk",
                            "score": 0,
                            "created_utc": 1605790902.0,
                            "replies": [
                                {
                                    "body": "I am only interested in women at least 30 years old that have been in arrangements before. \n\nThis makes a huge difference with everything Bowl related, including the financial arrangement. \n\nI’m not interested in a woman that is uncomfortable ironing out the major parameters of a SR before the M&G. \n\nIf we aren’t compatible around the big three (Availability, number of meets & the allowance) then I’m not wasting my time or hers. \n\nI’ve had six arrangements over a decade and have only had six M&Gs.   Four of those turned into arrangements.  \n\nMaybe younger and/or inexperienced women are scared off/uncomfortable by early discussions but the women I am pursuing aren’t.  \n\nBut to be clear, it’s not the first thing we “text” about when we take it off the site.  I typically vet them for a week or so. \n\nOnce I decide I’d like to meet them I bring up the big three.  If we are in general agreement we meet. \n\nIt’s the SDs responsibility to bring up the financial arrangement.  A SD should never wait for a young woman to bring it up.",
                                    "author": "BGDDDY1",
                                    "id": "gcu9jo3",
                                    "parent_id": "t1_gctpfv9",
                                    "score": 5,
                                    "created_utc": 1605802302.0,
                                    "replies": []
                                },
                                {
                                    "body": "While I agree, I also don’t want to get onto the situation where I am wasting both our times because our expectations aren’t in the same ballpark. It’s why I try to discuss these sorts of things in advance including intimacy.",
                                    "author": "sdthrowout23",
                                    "id": "gctygj5",
                                    "parent_id": "t1_gctpfv9",
                                    "score": 4,
                                    "created_utc": 1605796564.0,
                                    "replies": [
                                        {
                                            "body": "I agree with not wasting time, but I've found most women with high expectations know they have high expectations and will want to have the discussion early.  If I knew I provided a lower allowance, I would also want to have the discussion early.  I know what I offer is fair and most women are happy with what I offer.  It's rarely been an issue, but has once or twice.",
                                            "author": "willfromvb",
                                            "id": "gctztzh",
                                            "parent_id": "t1_gctygj5",
                                            "score": 4,
                                            "created_utc": 1605797319.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Haha this is so true. “I help with the small stuff, babe. Hope that’s okay.” Like no, I’m looking for a real relationship with a man who can afford the lifestyle I can afford on my own regardless, not free $30 shoes from Shoe Dazzle. 🙄",
                    "author": "LexyGlobal",
                    "id": "gcstzuz",
                    "parent_id": "t1_gcr576c",
                    "score": 7,
                    "created_utc": 1605762080.0,
                    "replies": []
                }
            ]
        },
        {
            "body": ">my last SB was cheaper\n\nIt makes me wondering why he left his last SB. Do you mind to ask him next time?  \n\n\nEDIT: The question is for kidding.",
            "author": "littledannyx",
            "id": "gcr3nob",
            "parent_id": "t3_jwlfgk",
            "score": 17,
            "created_utc": 1605729643.0,
            "replies": [
                {
                    "body": "I have been SO tempted to ask this.",
                    "author": "LikeHoney99",
                    "id": "gcs6slk",
                    "parent_id": "t1_gcr3nob",
                    "score": 5,
                    "created_utc": 1605748714.0,
                    "replies": []
                },
                {
                    "body": "She probably left him :)",
                    "author": "ChapterRelative",
                    "id": "gcr4ag7",
                    "parent_id": "t1_gcr3nob",
                    "score": 10,
                    "created_utc": 1605729946.0,
                    "replies": [
                        {
                            "body": "He probably started lowering the price lower than it already was",
                            "author": null,
                            "id": "gcr4uqg",
                            "parent_id": "t1_gcr4ag7",
                            "score": 11,
                            "created_utc": 1605730216.0,
                            "replies": [
                                {
                                    "body": "Right, these guys always try to dick women down to nothing. They’re trash.",
                                    "author": "LexyGlobal",
                                    "id": "gcsu9ke",
                                    "parent_id": "t1_gcr4uqg",
                                    "score": 5,
                                    "created_utc": 1605762266.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I think you are seeing more of the \"wannabe SD's\" than actual SD's.  I hear stories about SD's haggling over a hundred dollars, or sending part of a ppm, or some other nonsense; but those aren't SD's.  No real SD is going to send \"part\" of the PPM due to \"account issues\".  These are normal blokes trying to afford a lifestyle they cannot.",
            "author": "redeye87",
            "id": "gcqxbdz",
            "parent_id": "t3_jwlfgk",
            "score": 21,
            "created_utc": 1605726647.0,
            "replies": [
                {
                    "body": "Yup.",
                    "author": "LikeHoney99",
                    "id": "gcs6pfj",
                    "parent_id": "t1_gcqxbdz",
                    "score": 3,
                    "created_utc": 1605748666.0,
                    "replies": []
                },
                {
                    "body": "100% that’s why seeking online SDs is kinda pointless, IMO. I just network in my social group and seek out classy men with good manners.",
                    "author": "LexyGlobal",
                    "id": "gcsu77g",
                    "parent_id": "t1_gcqxbdz",
                    "score": 2,
                    "created_utc": 1605762222.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "They're a complete waste of time. Incredibly cheap and rude.  \n\n\nHow about gems like these? All have been said to me. LOL.  \n\n\n\"You're too old. I can get women HALF your age for 1/3 or less of what you're asking.\" (Mind you, he liked me and my age and looks  \\*until\\* we started talking numbers)  \n\n\n\"What makes you 4x the fun compared to others who ask for much less, since I'll be paying for 4x the price?\"  \n\n\n\"If you liked me like you said you do, then what I'm giving is just a bonus and you should be okay with whatever I'm offering.\"  \n\n\n\"I don't need to buy sex. I'll pay for dinner and drinks, but that's what an arrangement with me would be like.\"",
            "author": "ExExpectations",
            "id": "gcqwvcf",
            "parent_id": "t3_jwlfgk",
            "score": 21,
            "created_utc": 1605726433.0,
            "replies": [
                {
                    "body": "I’ve gotten the don’t want to pay for sex too. Yeah I know age seems to be an issue too. Even me about to turn 21 is old believe it or not.",
                    "author": null,
                    "id": "gcr1rbf",
                    "parent_id": "t1_gcqwvcf",
                    "score": 12,
                    "created_utc": 1605728746.0,
                    "replies": [
                        {
                            "body": "LOL girl, I’m early 40s and do just fine sugar dating. More than fine. (Granted I live amongst billionaires and multimillionaires in California) \n\nThose who only want brand new 18yos are next level Epsteins. 🤢",
                            "author": "ExExpectations",
                            "id": "gcr2hef",
                            "parent_id": "t1_gcr1rbf",
                            "score": 21,
                            "created_utc": 1605729089.0,
                            "replies": [
                                {
                                    "body": "I’m in my early 30s, and was in my late 20s when I entered the bowl. My only long-term SD was hesitant about me because, when we met, I was below 30. He didn’t want to be with somebody in their 20s, bc that was too close to his kids’ age. I never asked for a specific amount, but the number he offered was great. There was no need to barter.\n\nHe was very respectful, mature, and *never* pushed any of my boundaries. Also gave a really nice allowance every time we stayed together.\n\nHe was attractive. He truly didn’t need to pay for sex. He was in his 50s, but looked younger. He was sugaring to avoid the emotional strings that often come with purely vanilla dating.\n\nI have a theory that men seeking *very* young women are perhaps looking for vulnerability and/or exploitability, in addition to the “hot young girl” thing. Ie: if she’s young, she’ll demand/expect less, or won’t truly know how valuable she is as a person, regardless of sugar.\n\nTl;dr: my best and only long-term SD didn’t try to lowball me, and he understood the benefits of being with an older SB, relative to the 18-22y/o demographic). Perhaps older men (50+) who only want women below age 22 are kinda creepy predators.",
                                    "author": "ToxicGrad",
                                    "id": "gcsmlsk",
                                    "parent_id": "t1_gcr2hef",
                                    "score": 8,
                                    "created_utc": 1605757413.0,
                                    "replies": []
                                },
                                {
                                    "body": "Where do you live? *eyes my luggage*",
                                    "author": "kschin1",
                                    "id": "gcuj1u6",
                                    "parent_id": "t1_gcr2hef",
                                    "score": 3,
                                    "created_utc": 1605806783.0,
                                    "replies": [
                                        {
                                            "body": "Lol. I’m in California",
                                            "author": "ExExpectations",
                                            "id": "gcujfpm",
                                            "parent_id": "t1_gcuj1u6",
                                            "score": 2,
                                            "created_utc": 1605806963.0,
                                            "replies": [
                                                {
                                                    "body": "Lol I am too. NorCal or SoCal? (I live in NorCal but the east bay so not sf)",
                                                    "author": "kschin1",
                                                    "id": "gcujj8m",
                                                    "parent_id": "t1_gcujfpm",
                                                    "score": 2,
                                                    "created_utc": 1605807009.0,
                                                    "replies": [
                                                        {
                                                            "body": "*wave*",
                                                            "author": "ExExpectations",
                                                            "id": "gcukenr",
                                                            "parent_id": "t1_gcujj8m",
                                                            "score": 2,
                                                            "created_utc": 1605807414.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "Yup, I’ve a lot say 22 is the limit and and I automatically got Epstein vibes.",
                                    "author": null,
                                    "id": "gcr2nce",
                                    "parent_id": "t1_gcr2hef",
                                    "score": 11,
                                    "created_utc": 1605729167.0,
                                    "replies": [
                                        {
                                            "body": "🤢🤮",
                                            "author": "ExExpectations",
                                            "id": "gcr2xed",
                                            "parent_id": "t1_gcr2nce",
                                            "score": 6,
                                            "created_utc": 1605729300.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "Oh dear.",
                                            "author": "LikeHoney99",
                                            "id": "gcs6rml",
                                            "parent_id": "t1_gcr2nce",
                                            "score": 4,
                                            "created_utc": 1605748700.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Ew! Also, age and value as a date are not correlated. These guys are thinking of hookers, not SBs. What a joke!",
                    "author": "LexyGlobal",
                    "id": "gcsuf3f",
                    "parent_id": "t1_gcqwvcf",
                    "score": 2,
                    "created_utc": 1605762375.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I just say that our expectations don’t match most of the time. With my SD, our numbers were not too far off, and I was willing to compromised bc he prefaced it as “let’s start with x (middle number) ppm, and after a few months we can move to y allowance (my number). And usually it’s more than y anyways bc we see each other 2x week and he’s generous w the extras. There’s a big difference between playing the long game/being well-intentioned and someone that wants a “discount”",
            "author": "misswanderlust_",
            "id": "gcret37",
            "parent_id": "t3_jwlfgk",
            "score": 8,
            "created_utc": 1605734931.0,
            "replies": []
        },
        {
            "body": "Hahaha this always cracks me up. I just stop relying when men say, “do you really think anyone is going to pay that?” or “just out of curiosity, how much do you think someone will pay?” They just want to feel good taking shots at someone they can’t access.\n\nNot here to entertain curiosity and TBH, looking for men who make—at least—as much money as I do. I don’t have rates, just lifestyle standards.",
            "author": "LexyGlobal",
            "id": "gcsttfp",
            "parent_id": "t3_jwlfgk",
            "score": 3,
            "created_utc": 1605761956.0,
            "replies": [
                {
                    "body": "Not always true. Many SBs I talk to seem to think they should be making a VP salary for a ‘shoulder to lean on’. \n\nDon’t get me wrong there is a right and a wrong way to negotiate but the delusions are not all from one side.",
                    "author": "timrid",
                    "id": "gcvun0i",
                    "parent_id": "t1_gcsttfp",
                    "score": 0,
                    "created_utc": 1605827764.0,
                    "replies": [
                        {
                            "body": "Idt anyone said they were. She’s just pointing out what she deals with on her end. I think we’re all aware that there are 23 yr olds imaging six figures for mediocre dates and subpar sexual skills.",
                            "author": "LexyGlobal",
                            "id": "gcvvdlk",
                            "parent_id": "t1_gcvun0i",
                            "score": 0,
                            "created_utc": 1605828081.0,
                            "replies": [
                                {
                                    "body": "Sub par?  That would be an improvement!",
                                    "author": "timrid",
                                    "id": "gcvvzzf",
                                    "parent_id": "t1_gcvvdlk",
                                    "score": 0,
                                    "created_utc": 1605828347.0,
                                    "replies": [
                                        {
                                            "body": "Wow, what is happening over there!?!",
                                            "author": "LexyGlobal",
                                            "id": "gcvwgoq",
                                            "parent_id": "t1_gcvvzzf",
                                            "score": 2,
                                            "created_utc": 1605828553.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "Dump her and tell her she’s bad, so she puts some effort and thought in.",
                                            "author": "LexyGlobal",
                                            "id": "gcvwirh",
                                            "parent_id": "t1_gcvvzzf",
                                            "score": 2,
                                            "created_utc": 1605828579.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "[removed]",
            "author": null,
            "id": "gcs7cg3",
            "parent_id": "t3_jwlfgk",
            "score": 9,
            "created_utc": 1605749017.0,
            "replies": [
                {
                    "body": "Those bullshit guys are very common in the Sugar world and just happen to also be in this forum. It is about worth and how someone respects you, if someone actually respects you in a meaningful conversation, the conversation would be started by “so what’s your amount, ideal meeting, what are you looking for”. If you aren’t interested or can afford/agree, you keep it moving. Not say “oh well this is what I’m looking for and my price and you should try reconsidering “",
                    "author": null,
                    "id": "gcs7wbr",
                    "parent_id": "t1_gcs7cg3",
                    "score": 8,
                    "created_utc": 1605749313.0,
                    "replies": []
                },
                {
                    "body": "Say it louder for the people in the back. I really despise everytime someone says know your worth. It just sounds so bad lol. Like I'm buying a sofa or something.",
                    "author": "dade_murphy1",
                    "id": "gctypd1",
                    "parent_id": "t1_gcs7cg3",
                    "score": 1,
                    "created_utc": 1605796702.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Eww. How tacky and gross!",
            "author": null,
            "id": "gcqtho0",
            "parent_id": "t3_jwlfgk",
            "score": 8,
            "created_utc": 1605724855.0,
            "replies": [
                {
                    "body": "I've had M&G where the conversation turned to $$$$$ and when the stated monthly allowance was over benjamin x a factor of 100 - I simply paid for the meal & wished her good luck.  I didn't need to ask her worth, delusions, or mental state, I'm just not spending that - unless I am deep in a relationship with the lady. (Yes I've spent more, but we were together 7 years).",
                    "author": "Cloud_Architect61",
                    "id": "gcr0ddg",
                    "parent_id": "t1_gcqtho0",
                    "score": 0,
                    "created_utc": 1605728092.0,
                    "replies": [
                        {
                            "body": "If you have a strict budget you should share that in the first few messages, so you're not wasting someone's valuable time and energy.",
                            "author": "sugarsenior2",
                            "id": "gcs3asd",
                            "parent_id": "t1_gcr0ddg",
                            "score": 9,
                            "created_utc": 1605746774.0,
                            "replies": [
                                {
                                    "body": "As stated in other posts & here, I'll pay up to any amount desired, but to a total stranger ? Hardly. - time & trust are earned. A fool & his money are soon parted, I prefer to build wealth with a supportive partner. And as it was a M&G dinner I paid for after one message - how did I waste anybody's time - I invested exactly the same time.",
                                    "author": "Cloud_Architect61",
                                    "id": "gcs5dhb",
                                    "parent_id": "t1_gcs3asd",
                                    "score": 4,
                                    "created_utc": 1605747937.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "Yeah I had that happen. Thankfully it was before a M&G, so I was able to decline politely and move on.",
                            "author": "emptyoverflow",
                            "id": "gcrlmwt",
                            "parent_id": "t1_gcr0ddg",
                            "score": 2,
                            "created_utc": 1605738249.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I totally agree. But on the flip side we as SB need to do a better job vetting out SDs. It’s easy to understand what someone may pay by convo and red flags. Move on to the next.",
            "author": "staceylacey_22",
            "id": "gcraa2d",
            "parent_id": "t3_jwlfgk",
            "score": 6,
            "created_utc": 1605732785.0,
            "replies": [
                {
                    "body": "Exactly, don’t waste your time , let them waste their own and the can argue with a blocked number",
                    "author": null,
                    "id": "gcrchq6",
                    "parent_id": "t1_gcraa2d",
                    "score": 6,
                    "created_utc": 1605733825.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I would agree that \"argument\" is pointless. I would disagree that a statement of SB worth is necessarily an accurate assessment of worth. It is not as if there are licenced valuers in the sugar world. it is a grey/black market. \n\nAn SD can try a counter-offer to what he might consider an inflated statement of worth just like an SB might try a counter-offer to what she considers a deflated statement of worth but if that is declined then it is time to move on. No point arguing about it... Unrealistic buyers and sellers are as common as muck in sugar. The productive move is \"next\"...",
            "author": "aesthete2061",
            "id": "gcs1p5z",
            "parent_id": "t3_jwlfgk",
            "score": 7,
            "created_utc": 1605745878.0,
            "replies": []
        },
        {
            "body": "Yeah, this is a tough one because it happens so often. I usually just say that we’re unfortunately not a good match. As soon as I get a wiff of the behaviour you’re talking about. \n\nA lot people are cheap, and they’re looking to negotiate the lowest number possible, and they like to use all types of bad behaviour to get that done. I find this so revolting because I know that my numbers are reasonable. Like dude, I looked you up, I know you make between 750 grand to 1.5 a year and you have been for many years. You’re want to argue over small change that shows me a lot about who you are, and how much you value women and how you will treat me. Pass. Pass. Pass. \n\nI’ve let my anger go on the subject. It’s a them thing.",
            "author": "InnerRadio7",
            "id": "gcrxue5",
            "parent_id": "t3_jwlfgk",
            "score": 7,
            "created_utc": 1605743760.0,
            "replies": [
                {
                    "body": "Exactly, I’ve been on dates twice with two men making 6 figures and one only wanted to give a “lifestyle “ or just 200$ a week for some of the kinkiest things you can think of. This man had statues that costed more than that.",
                    "author": null,
                    "id": "gcry965",
                    "parent_id": "t1_gcrxue5",
                    "score": 7,
                    "created_utc": 1605743984.0,
                    "replies": [
                        {
                            "body": "That man has underwear that costs more than that.",
                            "author": "InnerRadio7",
                            "id": "gcryqb9",
                            "parent_id": "t1_gcry965",
                            "score": 9,
                            "created_utc": 1605744241.0,
                            "replies": []
                        },
                        {
                            "body": "ya don't get rich by blowing wads of cash",
                            "author": "Blknior",
                            "id": "gcs8ct9",
                            "parent_id": "t1_gcry965",
                            "score": -2,
                            "created_utc": 1605749556.0,
                            "replies": [
                                {
                                    "body": "Sure, but once you’re  wealthy, and set, you can afford to spend. Also, the amount she mentioned was egregiously low, so your point really does not have a place here. These are men who call themselves Sugar Daddies. No one really cares how they got their money, so long as they actually have it and aren’t reprehensible human beings.",
                                    "author": "InnerRadio7",
                                    "id": "gcscvos",
                                    "parent_id": "t1_gcs8ct9",
                                    "score": 2,
                                    "created_utc": 1605751983.0,
                                    "replies": [
                                        {
                                            "body": "True I can, but why would I want to? I'm not here to be rude just give a realistic view of the sugar world. If I'm an SD, especially the type most babies want, tall, connected, sociable, handsome, the right ethnicity, rich. I can get any woman I want on presence alone. So since you're the one who needs help you don't control the playing field, I do. So take what I give you and show me why I should give you more of my hard earned support.\n\nIf he's your cup of tea trust me this won't be an issue",
                                            "author": "Blknior",
                                            "id": "gcy9fdd",
                                            "parent_id": "t1_gcscvos",
                                            "score": 0,
                                            "created_utc": 1605888186.0,
                                            "replies": [
                                                {
                                                    "body": "First off. I don’t trust you because I don’t know you. \n\nSecond of all, if you can get whomever you like outside of the bowl, you go ahead and do that and stop telling the rest of us how great you are. \n\nThirdly, men are on seeking for a reason, and it’s not because they can get what they need from the real world...otherwise they wouldn’t be there. \n\nThat bs is always moot from the beginning. \n\n*SBs and legit SDs take note, this is the kind of attitude that is discussed so very frequently on this subreddit. Thank you Blknior for giving us such a perfect and shining example of what a sugar daddy is truly NOT.*",
                                                    "author": "InnerRadio7",
                                                    "id": "gd3nyap",
                                                    "parent_id": "t1_gcy9fdd",
                                                    "score": 2,
                                                    "created_utc": 1605988920.0,
                                                    "replies": [
                                                        {
                                                            "body": " lets be honest it's a massive chunk and I'm sure you've gotten this message from many an SD. Hence all these posts and wacky images. From what I've been told by my babies when it's too late and ur deep in the situation.",
                                                            "author": "Blknior",
                                                            "id": "gd3wxdv",
                                                            "parent_id": "t1_gd3nyap",
                                                            "score": 0,
                                                            "created_utc": 1605991907.0,
                                                            "replies": [
                                                                {
                                                                    "body": "I honestly cannot understand anything that you wrote. I’m also not going to be gaslighted. \nSo enjoy your day. \nI’m not interested in your replies.",
                                                                    "author": "InnerRadio7",
                                                                    "id": "gd444ry",
                                                                    "parent_id": "t1_gd3wxdv",
                                                                    "score": 1,
                                                                    "created_utc": 1605994226.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "What really puzzles me are the men that always justify everything with \"market value\". We are not cars, phones, houses, or any kind of object.",
            "author": "cobble_cobbler",
            "id": "gcs4bvj",
            "parent_id": "t3_jwlfgk",
            "score": 8,
            "created_utc": 1605747351.0,
            "replies": [
                {
                    "body": "It's naive to use the analogy that only objects have market value.\n\nHow much you make in your career is pretty much determined by supply and demand. It doesn't matter where you went to school or how much you studied.",
                    "author": "xanfiles",
                    "id": "gcs9ntr",
                    "parent_id": "t1_gcs4bvj",
                    "score": -1,
                    "created_utc": 1605750260.0,
                    "replies": [
                        {
                            "body": "Yes, you're right! Earnings in a career are determined by the market. But It's naive to think that being a SB is a career...",
                            "author": "cobble_cobbler",
                            "id": "gcsatyo",
                            "parent_id": "t1_gcs9ntr",
                            "score": 4,
                            "created_utc": 1605750879.0,
                            "replies": [
                                {
                                    "body": "Way to totally miss the point.",
                                    "author": "xanfiles",
                                    "id": "gcsdy24",
                                    "parent_id": "t1_gcsatyo",
                                    "score": -4,
                                    "created_utc": 1605752561.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "There clearly are women with unrealistic expectations and men that are cheap.  It will do no good to tell a woman their expectations are unrealistic, you will only insult her.  It does no good to tell an SD he is cheap, he won't change his mind.  Shaming them for their expectations is just rude.  Just agree to disagree and move on.",
            "author": "willfromvb",
            "id": "gctqfaq",
            "parent_id": "t3_jwlfgk",
            "score": 3,
            "created_utc": 1605791607.0,
            "replies": []
        },
        {
            "body": "In the real world, negotiations happen, either party can make an offer and a counter offer, it's not arguing a person's worth, it's attempting to secure a service for an agreeable price. Either party has the right to accept or decline an offer, it's  No different than hiring a contractor to build a house",
            "author": "prisonernumnerone",
            "id": "gct6j8u",
            "parent_id": "t3_jwlfgk",
            "score": 2,
            "created_utc": 1605772434.0,
            "replies": []
        },
        {
            "body": "Couldn't agree more.  As an SD I find it refreshing. I think the flip side is don't call someone cheap.  We all have budgets and needs and desires.  Common courtesy is seeing if those things overlap.",
            "author": null,
            "id": "gcqv7de",
            "parent_id": "t3_jwlfgk",
            "score": 6,
            "created_utc": 1605725656.0,
            "replies": []
        },
        {
            "body": "Flip side...when I politely say that is not something I’m able/willing to do, don’t call me a John or scammer.\n\nEdit: how this is downvoted is beyond my comprehension.",
            "author": "sdthrowout23",
            "id": "gcss33j",
            "parent_id": "t3_jwlfgk",
            "score": 4,
            "created_utc": 1605760782.0,
            "replies": [
                {
                    "body": "You must be new here. This place can be more partisan than Amerika",
                    "author": "timrid",
                    "id": "gcvv4z1",
                    "parent_id": "t1_gcss33j",
                    "score": 1,
                    "created_utc": 1605827973.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I have a number that I am comfortable with and from reading on this sub seems like a good number for most. If the SB wants more I would not try to shame her about it. I would just explain it won't work for me and good luck. \n\nShaming the other person seems like a horrible way to start any relationship.",
            "author": "wasabiflavoredpeas",
            "id": "gcr6nnj",
            "parent_id": "t3_jwlfgk",
            "score": 2,
            "created_utc": 1605731067.0,
            "replies": [
                {
                    "body": "A horrible way to just overall have to go through with someone.",
                    "author": null,
                    "id": "gcr6xvj",
                    "parent_id": "t1_gcr6nnj",
                    "score": 2,
                    "created_utc": 1605731208.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "All of those are gross, some clearly grosser than others.\n\nI do find it's easier to say, \"hey, it's just not gonna work\"\n\nBut when she insists \"everyone offers twice that\" and you know *for a fact* that many will take your offer, it's hard not to at least say, \"well, the reality is many will take that offer\".\n\nDoes it sink in for her that the market might not be what she desires? I dunno. Do I leave it at that and let her know I'm not upset with her and hope she finds what she seeks? Yes.",
            "author": "marker3000",
            "id": "gcr16h3",
            "parent_id": "t3_jwlfgk",
            "score": 2,
            "created_utc": 1605728473.0,
            "replies": [
                {
                    "body": "‘Good luck with your search’ is my nice passive aggressive way to let her know we have not come to an agreement.",
                    "author": "timrid",
                    "id": "gcvv1dc",
                    "parent_id": "t1_gcr16h3",
                    "score": 1,
                    "created_utc": 1605827930.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "If they want cheap. Go for the streets. I’ve had similar issues with SDs that are just men wanting to use these SBs as a cheap s*x toy. And it’s honestly disgusting because WHY WOULD YOU PAY FOR A CHEAP SERVICE. This life is a luxury... it’s not for everybody for a reason.",
            "author": "kissun3",
            "id": "gcsnlh5",
            "parent_id": "t3_jwlfgk",
            "score": 2,
            "created_utc": 1605758006.0,
            "replies": []
        },
        {
            "body": "I'm not so sure. There's a difference between low-balling and negotiation. I've been SA long enough to know that most of the guys aren't sugaring with Elon musk miney and generally people don't like getting taken advantage of. I am always open to negotiation, and different arrangements.",
            "author": "al3x400",
            "id": "gcti5bj",
            "parent_id": "t3_jwlfgk",
            "score": 2,
            "created_utc": 1605784552.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gcqx5rh",
            "parent_id": "t3_jwlfgk",
            "score": 2,
            "created_utc": 1605726572.0,
            "replies": [
                {
                    "body": "I agree !!",
                    "author": null,
                    "id": "gcr1ws0",
                    "parent_id": "t1_gcqx5rh",
                    "score": 5,
                    "created_utc": 1605728817.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Maturity 101\n\nYou either do or you don't. All things are that simple. Compromise is a \"do\" decision at its base. Keep it simple... Better life.",
            "author": "stonedoubt",
            "id": "gcrlzp0",
            "parent_id": "t3_jwlfgk",
            "score": 1,
            "created_utc": 1605738425.0,
            "replies": []
        },
        {
            "body": ">  I’ve literally had men say “woc aren’t worth that much” , “stop being greedy”, “my last SB would blow me off for 100$ a week”, “my last SB was cheaper”,etc.\n\nAnd I think any poster on here would (man, or woman) that isn't an outright troll would agree all of these are completely inappropriate/stupid.\n\nIf you are venting... I get it.  But beyond that - your target audience isn't this sub.  And even if they were - I'm pretty sure the kind of scumbag that makes those comments doesn't care.  The (unfortunate) reality is that negging does sometimes work.  They aren't stupid, they know what they are doing.",
            "author": "SDstartingOut",
            "id": "gcr7yj0",
            "parent_id": "t3_jwlfgk",
            "score": 1,
            "created_utc": 1605731694.0,
            "replies": [
                {
                    "body": "If you have a preference and want certain things that’s one thing. But arguing with someone who’s not your preference or whatever is another. You don’t tell someone “hey I’m down for something but I’m only willing to pay u this or that because I don’t feel you’re worth more”. Anyone in their right mind wouldn’t respond to that and obviously turn it down.",
                    "author": null,
                    "id": "gcr8er5",
                    "parent_id": "t1_gcr7yj0",
                    "score": 5,
                    "created_utc": 1605731907.0,
                    "replies": [
                        {
                            "body": "Did you respond to the right post?  (not sure what anything in your response has to do with mine).\n\nI don't disagree with your post.  I'm just simply stating - you aren't going to change the mindset of these people.  The disgusting tactics DO work on some women.",
                            "author": "SDstartingOut",
                            "id": "gcr8qh5",
                            "parent_id": "t1_gcr8er5",
                            "score": 1,
                            "created_utc": 1605732060.0,
                            "replies": [
                                {
                                    "body": "I know I won’t change the mindset, but if some are on the forum, they’re gonna still here what’s up. And maybe some women will see it’s not okay.",
                                    "author": null,
                                    "id": "gcr8yek",
                                    "parent_id": "t1_gcr8qh5",
                                    "score": 10,
                                    "created_utc": 1605732163.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Their “perceived “ worth.\n\nFTFY\n\nThere are SBs that think their shit is gold and they are so far above market it isn’t truly their worth, it’s what they dream they are worth. There will always be someone willing to sell you a six figure home for seven or do a five figure job for six. \n\nAnytime there is a transfer of money between people, no matter what else is also transferred, there are people trying to take you for a ride. So just be careful. Because “their worth” could be a five-six figure ripoff.",
            "author": "GenIISD",
            "id": "gcswlw8",
            "parent_id": "t3_jwlfgk",
            "score": 0,
            "created_utc": 1605763955.0,
            "replies": []
        },
        {
            "body": "I HATE when they spout off shit like that 🙄 NEXT!",
            "author": "JnVal96",
            "id": "gcsv4p9",
            "parent_id": "t3_jwlfgk",
            "score": 1,
            "created_utc": 1605762881.0,
            "replies": []
        },
        {
            "body": "Lol, your “worth” is determined by the market",
            "author": "bbmg69",
            "id": "gcr5vp7",
            "parent_id": "t3_jwlfgk",
            "score": -6,
            "created_utc": 1605730705.0,
            "replies": [
                {
                    "body": "SBs will never get this simple concept",
                    "author": "xanfiles",
                    "id": "gcs9too",
                    "parent_id": "t1_gcr5vp7",
                    "score": -4,
                    "created_utc": 1605750347.0,
                    "replies": [
                        {
                            "body": "Yeah because we don't have to 🤷🏼‍♀️",
                            "author": "cobble_cobbler",
                            "id": "gcsim5z",
                            "parent_id": "t1_gcs9too",
                            "score": 5,
                            "created_utc": 1605755118.0,
                            "replies": [
                                {
                                    "body": "It's a life-skill....and then you keep wondering why self-made billionaires/multi-millionaires are all men",
                                    "author": "xanfiles",
                                    "id": "gcsjh85",
                                    "parent_id": "t1_gcsim5z",
                                    "score": 0,
                                    "created_utc": 1605755612.0,
                                    "replies": [
                                        {
                                            "body": "Hi, female investment banker here. 👋🏽 Their worth is determine by market economics which is exactly why they don’t have to settle for below market prices.",
                                            "author": "LexyGlobal",
                                            "id": "gcsuk5o",
                                            "parent_id": "t1_gcsjh85",
                                            "score": 6,
                                            "created_utc": 1605762475.0,
                                            "replies": [
                                                {
                                                    "body": "Just gonna take a wild guess that OP wouldn’t need to take the time to rant and join the hundreds of similar complaining posts if she could just laugh off these offers that don’t meet her “worth” because there is a line of SDs waiting to give her what she wants. The market has spoken.",
                                                    "author": "bbmg69",
                                                    "id": "gctdrou",
                                                    "parent_id": "t1_gcsuk5o",
                                                    "score": 2,
                                                    "created_utc": 1605779890.0,
                                                    "replies": [
                                                        {
                                                            "body": "Meh, I vent about the not serious people wasting time but still definitely have plenty of serious offers at any given time. It’s not like there’s a line out the door at Louboutin, but there are still buyers. They’re just fewer and further between.",
                                                            "author": "LexyGlobal",
                                                            "id": "gcvsdyj",
                                                            "parent_id": "t1_gctdrou",
                                                            "score": 1,
                                                            "created_utc": 1605826759.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "body": "Thank You! That is exactly what I'm trying to say, their worth is set by 'market' economics, not 'self' delusion. \n\nNow, does any of the SBs compare allowances received by similar attributes (race, height, personality, body-type, location, sexual activity) or do they randomly pick numbers? \n\nDo you value all the companies by the price set by the seller or do you laugh at CEOs who think just because they are an online retailer, they should be valued at $1.5T, like Amazon?\n\nHope you see my point.",
                                                    "author": "xanfiles",
                                                    "id": "gcv0utw",
                                                    "parent_id": "t1_gcsuk5o",
                                                    "score": 1,
                                                    "created_utc": 1605815073.0,
                                                    "replies": [
                                                        {
                                                            "body": "I mean I do obviously understand basic economic theory. My point is that the woman who posted this is just venting about the hagglers trying to come into Louboutin. It doesn’t mean that it’s not Louboutin. It doesn’t mean that there arent plenty of buyers for Louboutin. \n\nI get messages constantly about how I’m not worth XYZ, but I’ve dated men my entire life who can afford to participate in my lifestyle with me. I vent the same way this woman does at times. It doesn’t mean I’m worth less or one of the women overvaluing myself. If there weren’t buyers, I won’t post something so bold. lol",
                                                            "author": "LexyGlobal",
                                                            "id": "gcvsqpz",
                                                            "parent_id": "t1_gcv0utw",
                                                            "score": 2,
                                                            "created_utc": 1605826922.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "body": "And no, no they’re not. This was spoken like someone who doesn’t run in those circles at all.",
                                            "author": "LexyGlobal",
                                            "id": "gcsumw2",
                                            "parent_id": "t1_gcsjh85",
                                            "score": 3,
                                            "created_utc": 1605762530.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "[removed]",
            "author": null,
            "id": "gcsmes2",
            "parent_id": "t3_jwlfgk",
            "score": 1,
            "created_utc": 1605757296.0,
            "replies": [
                {
                    "body": "I see you may have posted a number which is most likely an amount in relations to an arrangement. If this is the case, you are violating Rule#4 - \"No dollar amounts that are in reference to allowance/PPM are allowed.\"\n\n\nIf you are curious about Allowances reported by SLF contributors please see the [Allowance Master Thread 2020-2021](https://www.reddit.com/r/sugarlifestyleforum/comments/ja37xt/allowance_master_thread_20202021/)\n\nYour post will not be approved until you remove the amount.  Please read the sub [Rules](https://www.reddit.com/r/sugarlifestyleforum/comments/748zta/updated_and_clarified_rules_for_slf/) prior to posting anything else. \n\nIf you simply posted a number not referencing a monetary amount, please message the MODs to approve your post.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/sugarlifestyleforum) if you have any questions or concerns.*",
                    "author": "AutoModerator",
                    "id": "gcsmeth",
                    "parent_id": "t1_gcsmes2",
                    "score": 0,
                    "created_utc": 1605757297.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I have been told that. And it’s time for, “thank you, next.” Hahaha",
            "author": null,
            "id": "gctcky2",
            "parent_id": "t3_jwlfgk",
            "score": 1,
            "created_utc": 1605778609.0,
            "replies": []
        },
        {
            "body": "I typically don't negotiate and I always put my offer out first. It is based on what I have allocated in my personal budget for this part of my lifestyle. Sometimes they counter for a tiny increase, but 8 out of 10 times they say that is great, which tells me my number is correct for the market. Once in a while I get \"I usually get twice that\". That is fine with me and I wish them well. I hope they get that from someone. That is capitalism and a free market system at work. All good.",
            "author": "Teejaynj",
            "id": "gctj64y",
            "parent_id": "t3_jwlfgk",
            "score": 1,
            "created_utc": 1605785578.0,
            "replies": []
        },
        {
            "body": "After talking to people for a week to a month it did clarify my point of intent I sort of see now that SDs go through.",
            "author": null,
            "id": "gctytfg",
            "parent_id": "t3_jwlfgk",
            "score": 1,
            "created_utc": 1605796764.0,
            "replies": []
        },
        {
            "body": "I think it really depends on the type of relationship you are investing in. I would never want someone to feel like she is settling for an allowance below her worth or feel like she isn’t being compensated for her time and effort.\n\nIf you, as an SB, clearly spell out your expectations and goals I have no problem agreeing to what you consider reasonable compensation. \n\nIn my mind I’m always thinking whatever estimate you give me will be times 2 (sometimes x3) once I consider entertainment costs, gifts, travel and extras. \n\nOn the other hand, and I’m sadly speaking from experience, if a SB places a value on her worth then constantly needs “financial assistance” outside of that arrangement or requesting higher value gifts as an expectation then we have a problem.",
            "author": "KnocDown",
            "id": "gcu0ydy",
            "parent_id": "t3_jwlfgk",
            "score": 1,
            "created_utc": 1605797929.0,
            "replies": []
        },
        {
            "body": "Your financial needs and wants do not determine your \"worth\" or value as a human being. An sds allowance capability also does not determine his \"worth\" or value. You aren't a commodity on a shelf. If our allowances dont match up, we aren't a good fit. Time to move on.State your allowance expectations early. An sd or pot should always respect you and treat you as a lady. Any negative comments based on your expectations should be an easy block and filter. Granted, if you aren't getting the allowance you want after some time, there might be a reason why nobody will pay it.",
            "author": "dade_murphy1",
            "id": "gcuellz",
            "parent_id": "t3_jwlfgk",
            "score": 1,
            "created_utc": 1605804687.0,
            "replies": []
        },
        {
            "body": "\nI'm a great  believer in the approach that the allowance is based on what each thinks is the right amount to balance the relationship.  In some cases that's not an amount that the SD thinks is right or the SB feels is inadequate. It's is in the eye and capacity (and interest) of the beholder, both SB and SD. \n\nRather than thinking of sugar as a commodity  stop and think of it as artwork of the soul......  There is no absolute but rather how it appeals to the people considering an arrangement.  If it doesn't work don't try to make it work.",
            "author": "pinotandsugar",
            "id": "gcsx2tv",
            "parent_id": "t1_gcr1xvr",
            "score": 8,
            "created_utc": 1605764307.0,
            "replies": []
        },
        {
            "body": "Couldn’t agree more with your approach.  \n\nSome times it just “is what it is”\n\nSDs should always stay classy.  \n\nBe respectful and wish them luck.",
            "author": "BGDDDY1",
            "id": "gcrl286",
            "parent_id": "t1_gcqwwgq",
            "score": 9,
            "created_utc": 1605737959.0,
            "replies": []
        },
        {
            "body": "Totally agree",
            "author": "staceylacey_22",
            "id": "gcr9ud1",
            "parent_id": "t1_gcqwwgq",
            "score": 5,
            "created_utc": 1605732582.0,
            "replies": []
        },
        {
            "body": "I agree with your approach. It keeps things classy and easy. I've done it that way. I've had ladies say, \"Oh, I can't do that.\" And we ceased chatting. And ladies who went first and I said that I couldn't do that. And that was that. And, had one counter and we moved forward. \n\nIt takes some nerve to go first, but it gets easier over time.",
            "author": "Haffbad",
            "id": "gcsklyc",
            "parent_id": "t1_gcqwwgq",
            "score": 4,
            "created_utc": 1605756252.0,
            "replies": []
        },
        {
            "body": "Many women are uncomfortable with the financial discussion and many women want to be clear about expectations early on.  There is not one answer.   I progress through the discussion by first mentioning I provide financial support, then explaining how I provide financial support and then discussing specific numbers.  I let them decide if they want to discuss more at each step.  \n\nPushing numbers on someone that is not comfortable with the discussion is rude.  Avoiding the financial discussion with someone that wants to set clear expectations early on is rude.  There is not a one size fits all, but it's not that hard to navigate the path.",
            "author": "willfromvb",
            "id": "gctqzyi",
            "parent_id": "t1_gcqwwgq",
            "score": 5,
            "created_utc": 1605792005.0,
            "replies": [
                {
                    "body": "Agreed. If someone wishes to avoid or delay discussion of money that is certainly their prerogative. My outline is solely my maximum limit to discussion of allowance/ppm. If the answer is \"Let's get together first and see how we get along,\" or \"I really do not want to discuss money, just give me what you think is right\" I accede. Both of those are real quotes, btw, and that second one caused me a month of doubt that ultimately changed how I view allowance. Now I have a minimum I will pay, regardless of what is requested.",
                    "author": "ziggy440",
                    "id": "gctu2ul",
                    "parent_id": "t1_gctqzyi",
                    "score": 2,
                    "created_utc": 1605794001.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Agree it should be easy.",
            "author": "bookworm010101",
            "id": "gcrpn1i",
            "parent_id": "t1_gcqwwgq",
            "score": 3,
            "created_utc": 1605740038.0,
            "replies": []
        },
        {
            "body": "Right, they’re looking for a below market rate hooker.",
            "author": "LexyGlobal",
            "id": "gcsu2rq",
            "parent_id": "t1_gcr9hy6",
            "score": 5,
            "created_utc": 1605762134.0,
            "replies": []
        },
        {
            "body": "I love the direct approach on the financial element.  \n\nI won’t even go on a M&G unless we’ve had at least a general discussion. \n\nGet that shit out of the way early....",
            "author": "BGDDDY1",
            "id": "gcrl9wk",
            "parent_id": "t1_gcr576c",
            "score": 18,
            "created_utc": 1605738066.0,
            "replies": [
                {
                    "body": "ding ding",
                    "author": "bookworm010101",
                    "id": "gcrppmi",
                    "parent_id": "t1_gcrl9wk",
                    "score": 10,
                    "created_utc": 1605740068.0,
                    "replies": []
                },
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "gctpfv9",
                    "parent_id": "t1_gcrl9wk",
                    "score": 0,
                    "created_utc": 1605790902.0,
                    "replies": [
                        {
                            "body": "I am only interested in women at least 30 years old that have been in arrangements before. \n\nThis makes a huge difference with everything Bowl related, including the financial arrangement. \n\nI’m not interested in a woman that is uncomfortable ironing out the major parameters of a SR before the M&G. \n\nIf we aren’t compatible around the big three (Availability, number of meets & the allowance) then I’m not wasting my time or hers. \n\nI’ve had six arrangements over a decade and have only had six M&Gs.   Four of those turned into arrangements.  \n\nMaybe younger and/or inexperienced women are scared off/uncomfortable by early discussions but the women I am pursuing aren’t.  \n\nBut to be clear, it’s not the first thing we “text” about when we take it off the site.  I typically vet them for a week or so. \n\nOnce I decide I’d like to meet them I bring up the big three.  If we are in general agreement we meet. \n\nIt’s the SDs responsibility to bring up the financial arrangement.  A SD should never wait for a young woman to bring it up.",
                            "author": "BGDDDY1",
                            "id": "gcu9jo3",
                            "parent_id": "t1_gctpfv9",
                            "score": 5,
                            "created_utc": 1605802302.0,
                            "replies": []
                        },
                        {
                            "body": "While I agree, I also don’t want to get onto the situation where I am wasting both our times because our expectations aren’t in the same ballpark. It’s why I try to discuss these sorts of things in advance including intimacy.",
                            "author": "sdthrowout23",
                            "id": "gctygj5",
                            "parent_id": "t1_gctpfv9",
                            "score": 4,
                            "created_utc": 1605796564.0,
                            "replies": [
                                {
                                    "body": "I agree with not wasting time, but I've found most women with high expectations know they have high expectations and will want to have the discussion early.  If I knew I provided a lower allowance, I would also want to have the discussion early.  I know what I offer is fair and most women are happy with what I offer.  It's rarely been an issue, but has once or twice.",
                                    "author": "willfromvb",
                                    "id": "gctztzh",
                                    "parent_id": "t1_gctygj5",
                                    "score": 4,
                                    "created_utc": 1605797319.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Haha this is so true. “I help with the small stuff, babe. Hope that’s okay.” Like no, I’m looking for a real relationship with a man who can afford the lifestyle I can afford on my own regardless, not free $30 shoes from Shoe Dazzle. 🙄",
            "author": "LexyGlobal",
            "id": "gcstzuz",
            "parent_id": "t1_gcr576c",
            "score": 7,
            "created_utc": 1605762080.0,
            "replies": []
        },
        {
            "body": "I have been SO tempted to ask this.",
            "author": "LikeHoney99",
            "id": "gcs6slk",
            "parent_id": "t1_gcr3nob",
            "score": 5,
            "created_utc": 1605748714.0,
            "replies": []
        },
        {
            "body": "She probably left him :)",
            "author": "ChapterRelative",
            "id": "gcr4ag7",
            "parent_id": "t1_gcr3nob",
            "score": 10,
            "created_utc": 1605729946.0,
            "replies": [
                {
                    "body": "He probably started lowering the price lower than it already was",
                    "author": null,
                    "id": "gcr4uqg",
                    "parent_id": "t1_gcr4ag7",
                    "score": 11,
                    "created_utc": 1605730216.0,
                    "replies": [
                        {
                            "body": "Right, these guys always try to dick women down to nothing. They’re trash.",
                            "author": "LexyGlobal",
                            "id": "gcsu9ke",
                            "parent_id": "t1_gcr4uqg",
                            "score": 5,
                            "created_utc": 1605762266.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Yup.",
            "author": "LikeHoney99",
            "id": "gcs6pfj",
            "parent_id": "t1_gcqxbdz",
            "score": 3,
            "created_utc": 1605748666.0,
            "replies": []
        },
        {
            "body": "100% that’s why seeking online SDs is kinda pointless, IMO. I just network in my social group and seek out classy men with good manners.",
            "author": "LexyGlobal",
            "id": "gcsu77g",
            "parent_id": "t1_gcqxbdz",
            "score": 2,
            "created_utc": 1605762222.0,
            "replies": []
        },
        {
            "body": "I’ve gotten the don’t want to pay for sex too. Yeah I know age seems to be an issue too. Even me about to turn 21 is old believe it or not.",
            "author": null,
            "id": "gcr1rbf",
            "parent_id": "t1_gcqwvcf",
            "score": 12,
            "created_utc": 1605728746.0,
            "replies": [
                {
                    "body": "LOL girl, I’m early 40s and do just fine sugar dating. More than fine. (Granted I live amongst billionaires and multimillionaires in California) \n\nThose who only want brand new 18yos are next level Epsteins. 🤢",
                    "author": "ExExpectations",
                    "id": "gcr2hef",
                    "parent_id": "t1_gcr1rbf",
                    "score": 21,
                    "created_utc": 1605729089.0,
                    "replies": [
                        {
                            "body": "I’m in my early 30s, and was in my late 20s when I entered the bowl. My only long-term SD was hesitant about me because, when we met, I was below 30. He didn’t want to be with somebody in their 20s, bc that was too close to his kids’ age. I never asked for a specific amount, but the number he offered was great. There was no need to barter.\n\nHe was very respectful, mature, and *never* pushed any of my boundaries. Also gave a really nice allowance every time we stayed together.\n\nHe was attractive. He truly didn’t need to pay for sex. He was in his 50s, but looked younger. He was sugaring to avoid the emotional strings that often come with purely vanilla dating.\n\nI have a theory that men seeking *very* young women are perhaps looking for vulnerability and/or exploitability, in addition to the “hot young girl” thing. Ie: if she’s young, she’ll demand/expect less, or won’t truly know how valuable she is as a person, regardless of sugar.\n\nTl;dr: my best and only long-term SD didn’t try to lowball me, and he understood the benefits of being with an older SB, relative to the 18-22y/o demographic). Perhaps older men (50+) who only want women below age 22 are kinda creepy predators.",
                            "author": "ToxicGrad",
                            "id": "gcsmlsk",
                            "parent_id": "t1_gcr2hef",
                            "score": 8,
                            "created_utc": 1605757413.0,
                            "replies": []
                        },
                        {
                            "body": "Where do you live? *eyes my luggage*",
                            "author": "kschin1",
                            "id": "gcuj1u6",
                            "parent_id": "t1_gcr2hef",
                            "score": 3,
                            "created_utc": 1605806783.0,
                            "replies": [
                                {
                                    "body": "Lol. I’m in California",
                                    "author": "ExExpectations",
                                    "id": "gcujfpm",
                                    "parent_id": "t1_gcuj1u6",
                                    "score": 2,
                                    "created_utc": 1605806963.0,
                                    "replies": [
                                        {
                                            "body": "Lol I am too. NorCal or SoCal? (I live in NorCal but the east bay so not sf)",
                                            "author": "kschin1",
                                            "id": "gcujj8m",
                                            "parent_id": "t1_gcujfpm",
                                            "score": 2,
                                            "created_utc": 1605807009.0,
                                            "replies": [
                                                {
                                                    "body": "*wave*",
                                                    "author": "ExExpectations",
                                                    "id": "gcukenr",
                                                    "parent_id": "t1_gcujj8m",
                                                    "score": 2,
                                                    "created_utc": 1605807414.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "Yup, I’ve a lot say 22 is the limit and and I automatically got Epstein vibes.",
                            "author": null,
                            "id": "gcr2nce",
                            "parent_id": "t1_gcr2hef",
                            "score": 11,
                            "created_utc": 1605729167.0,
                            "replies": [
                                {
                                    "body": "🤢🤮",
                                    "author": "ExExpectations",
                                    "id": "gcr2xed",
                                    "parent_id": "t1_gcr2nce",
                                    "score": 6,
                                    "created_utc": 1605729300.0,
                                    "replies": []
                                },
                                {
                                    "body": "Oh dear.",
                                    "author": "LikeHoney99",
                                    "id": "gcs6rml",
                                    "parent_id": "t1_gcr2nce",
                                    "score": 4,
                                    "created_utc": 1605748700.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Ew! Also, age and value as a date are not correlated. These guys are thinking of hookers, not SBs. What a joke!",
            "author": "LexyGlobal",
            "id": "gcsuf3f",
            "parent_id": "t1_gcqwvcf",
            "score": 2,
            "created_utc": 1605762375.0,
            "replies": []
        },
        {
            "body": "Not always true. Many SBs I talk to seem to think they should be making a VP salary for a ‘shoulder to lean on’. \n\nDon’t get me wrong there is a right and a wrong way to negotiate but the delusions are not all from one side.",
            "author": "timrid",
            "id": "gcvun0i",
            "parent_id": "t1_gcsttfp",
            "score": 0,
            "created_utc": 1605827764.0,
            "replies": [
                {
                    "body": "Idt anyone said they were. She’s just pointing out what she deals with on her end. I think we’re all aware that there are 23 yr olds imaging six figures for mediocre dates and subpar sexual skills.",
                    "author": "LexyGlobal",
                    "id": "gcvvdlk",
                    "parent_id": "t1_gcvun0i",
                    "score": 0,
                    "created_utc": 1605828081.0,
                    "replies": [
                        {
                            "body": "Sub par?  That would be an improvement!",
                            "author": "timrid",
                            "id": "gcvvzzf",
                            "parent_id": "t1_gcvvdlk",
                            "score": 0,
                            "created_utc": 1605828347.0,
                            "replies": [
                                {
                                    "body": "Wow, what is happening over there!?!",
                                    "author": "LexyGlobal",
                                    "id": "gcvwgoq",
                                    "parent_id": "t1_gcvvzzf",
                                    "score": 2,
                                    "created_utc": 1605828553.0,
                                    "replies": []
                                },
                                {
                                    "body": "Dump her and tell her she’s bad, so she puts some effort and thought in.",
                                    "author": "LexyGlobal",
                                    "id": "gcvwirh",
                                    "parent_id": "t1_gcvvzzf",
                                    "score": 2,
                                    "created_utc": 1605828579.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Those bullshit guys are very common in the Sugar world and just happen to also be in this forum. It is about worth and how someone respects you, if someone actually respects you in a meaningful conversation, the conversation would be started by “so what’s your amount, ideal meeting, what are you looking for”. If you aren’t interested or can afford/agree, you keep it moving. Not say “oh well this is what I’m looking for and my price and you should try reconsidering “",
            "author": null,
            "id": "gcs7wbr",
            "parent_id": "t1_gcs7cg3",
            "score": 8,
            "created_utc": 1605749313.0,
            "replies": []
        },
        {
            "body": "Say it louder for the people in the back. I really despise everytime someone says know your worth. It just sounds so bad lol. Like I'm buying a sofa or something.",
            "author": "dade_murphy1",
            "id": "gctypd1",
            "parent_id": "t1_gcs7cg3",
            "score": 1,
            "created_utc": 1605796702.0,
            "replies": []
        },
        {
            "body": "I've had M&G where the conversation turned to $$$$$ and when the stated monthly allowance was over benjamin x a factor of 100 - I simply paid for the meal & wished her good luck.  I didn't need to ask her worth, delusions, or mental state, I'm just not spending that - unless I am deep in a relationship with the lady. (Yes I've spent more, but we were together 7 years).",
            "author": "Cloud_Architect61",
            "id": "gcr0ddg",
            "parent_id": "t1_gcqtho0",
            "score": 0,
            "created_utc": 1605728092.0,
            "replies": [
                {
                    "body": "If you have a strict budget you should share that in the first few messages, so you're not wasting someone's valuable time and energy.",
                    "author": "sugarsenior2",
                    "id": "gcs3asd",
                    "parent_id": "t1_gcr0ddg",
                    "score": 9,
                    "created_utc": 1605746774.0,
                    "replies": [
                        {
                            "body": "As stated in other posts & here, I'll pay up to any amount desired, but to a total stranger ? Hardly. - time & trust are earned. A fool & his money are soon parted, I prefer to build wealth with a supportive partner. And as it was a M&G dinner I paid for after one message - how did I waste anybody's time - I invested exactly the same time.",
                            "author": "Cloud_Architect61",
                            "id": "gcs5dhb",
                            "parent_id": "t1_gcs3asd",
                            "score": 4,
                            "created_utc": 1605747937.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Yeah I had that happen. Thankfully it was before a M&G, so I was able to decline politely and move on.",
                    "author": "emptyoverflow",
                    "id": "gcrlmwt",
                    "parent_id": "t1_gcr0ddg",
                    "score": 2,
                    "created_utc": 1605738249.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Exactly, don’t waste your time , let them waste their own and the can argue with a blocked number",
            "author": null,
            "id": "gcrchq6",
            "parent_id": "t1_gcraa2d",
            "score": 6,
            "created_utc": 1605733825.0,
            "replies": []
        },
        {
            "body": "Exactly, I’ve been on dates twice with two men making 6 figures and one only wanted to give a “lifestyle “ or just 200$ a week for some of the kinkiest things you can think of. This man had statues that costed more than that.",
            "author": null,
            "id": "gcry965",
            "parent_id": "t1_gcrxue5",
            "score": 7,
            "created_utc": 1605743984.0,
            "replies": [
                {
                    "body": "That man has underwear that costs more than that.",
                    "author": "InnerRadio7",
                    "id": "gcryqb9",
                    "parent_id": "t1_gcry965",
                    "score": 9,
                    "created_utc": 1605744241.0,
                    "replies": []
                },
                {
                    "body": "ya don't get rich by blowing wads of cash",
                    "author": "Blknior",
                    "id": "gcs8ct9",
                    "parent_id": "t1_gcry965",
                    "score": -2,
                    "created_utc": 1605749556.0,
                    "replies": [
                        {
                            "body": "Sure, but once you’re  wealthy, and set, you can afford to spend. Also, the amount she mentioned was egregiously low, so your point really does not have a place here. These are men who call themselves Sugar Daddies. No one really cares how they got their money, so long as they actually have it and aren’t reprehensible human beings.",
                            "author": "InnerRadio7",
                            "id": "gcscvos",
                            "parent_id": "t1_gcs8ct9",
                            "score": 2,
                            "created_utc": 1605751983.0,
                            "replies": [
                                {
                                    "body": "True I can, but why would I want to? I'm not here to be rude just give a realistic view of the sugar world. If I'm an SD, especially the type most babies want, tall, connected, sociable, handsome, the right ethnicity, rich. I can get any woman I want on presence alone. So since you're the one who needs help you don't control the playing field, I do. So take what I give you and show me why I should give you more of my hard earned support.\n\nIf he's your cup of tea trust me this won't be an issue",
                                    "author": "Blknior",
                                    "id": "gcy9fdd",
                                    "parent_id": "t1_gcscvos",
                                    "score": 0,
                                    "created_utc": 1605888186.0,
                                    "replies": [
                                        {
                                            "body": "First off. I don’t trust you because I don’t know you. \n\nSecond of all, if you can get whomever you like outside of the bowl, you go ahead and do that and stop telling the rest of us how great you are. \n\nThirdly, men are on seeking for a reason, and it’s not because they can get what they need from the real world...otherwise they wouldn’t be there. \n\nThat bs is always moot from the beginning. \n\n*SBs and legit SDs take note, this is the kind of attitude that is discussed so very frequently on this subreddit. Thank you Blknior for giving us such a perfect and shining example of what a sugar daddy is truly NOT.*",
                                            "author": "InnerRadio7",
                                            "id": "gd3nyap",
                                            "parent_id": "t1_gcy9fdd",
                                            "score": 2,
                                            "created_utc": 1605988920.0,
                                            "replies": [
                                                {
                                                    "body": " lets be honest it's a massive chunk and I'm sure you've gotten this message from many an SD. Hence all these posts and wacky images. From what I've been told by my babies when it's too late and ur deep in the situation.",
                                                    "author": "Blknior",
                                                    "id": "gd3wxdv",
                                                    "parent_id": "t1_gd3nyap",
                                                    "score": 0,
                                                    "created_utc": 1605991907.0,
                                                    "replies": [
                                                        {
                                                            "body": "I honestly cannot understand anything that you wrote. I’m also not going to be gaslighted. \nSo enjoy your day. \nI’m not interested in your replies.",
                                                            "author": "InnerRadio7",
                                                            "id": "gd444ry",
                                                            "parent_id": "t1_gd3wxdv",
                                                            "score": 1,
                                                            "created_utc": 1605994226.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "It's naive to use the analogy that only objects have market value.\n\nHow much you make in your career is pretty much determined by supply and demand. It doesn't matter where you went to school or how much you studied.",
            "author": "xanfiles",
            "id": "gcs9ntr",
            "parent_id": "t1_gcs4bvj",
            "score": -1,
            "created_utc": 1605750260.0,
            "replies": [
                {
                    "body": "Yes, you're right! Earnings in a career are determined by the market. But It's naive to think that being a SB is a career...",
                    "author": "cobble_cobbler",
                    "id": "gcsatyo",
                    "parent_id": "t1_gcs9ntr",
                    "score": 4,
                    "created_utc": 1605750879.0,
                    "replies": [
                        {
                            "body": "Way to totally miss the point.",
                            "author": "xanfiles",
                            "id": "gcsdy24",
                            "parent_id": "t1_gcsatyo",
                            "score": -4,
                            "created_utc": 1605752561.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "You must be new here. This place can be more partisan than Amerika",
            "author": "timrid",
            "id": "gcvv4z1",
            "parent_id": "t1_gcss33j",
            "score": 1,
            "created_utc": 1605827973.0,
            "replies": []
        },
        {
            "body": "A horrible way to just overall have to go through with someone.",
            "author": null,
            "id": "gcr6xvj",
            "parent_id": "t1_gcr6nnj",
            "score": 2,
            "created_utc": 1605731208.0,
            "replies": []
        },
        {
            "body": "‘Good luck with your search’ is my nice passive aggressive way to let her know we have not come to an agreement.",
            "author": "timrid",
            "id": "gcvv1dc",
            "parent_id": "t1_gcr16h3",
            "score": 1,
            "created_utc": 1605827930.0,
            "replies": []
        },
        {
            "body": "I agree !!",
            "author": null,
            "id": "gcr1ws0",
            "parent_id": "t1_gcqx5rh",
            "score": 5,
            "created_utc": 1605728817.0,
            "replies": []
        },
        {
            "body": "If you have a preference and want certain things that’s one thing. But arguing with someone who’s not your preference or whatever is another. You don’t tell someone “hey I’m down for something but I’m only willing to pay u this or that because I don’t feel you’re worth more”. Anyone in their right mind wouldn’t respond to that and obviously turn it down.",
            "author": null,
            "id": "gcr8er5",
            "parent_id": "t1_gcr7yj0",
            "score": 5,
            "created_utc": 1605731907.0,
            "replies": [
                {
                    "body": "Did you respond to the right post?  (not sure what anything in your response has to do with mine).\n\nI don't disagree with your post.  I'm just simply stating - you aren't going to change the mindset of these people.  The disgusting tactics DO work on some women.",
                    "author": "SDstartingOut",
                    "id": "gcr8qh5",
                    "parent_id": "t1_gcr8er5",
                    "score": 1,
                    "created_utc": 1605732060.0,
                    "replies": [
                        {
                            "body": "I know I won’t change the mindset, but if some are on the forum, they’re gonna still here what’s up. And maybe some women will see it’s not okay.",
                            "author": null,
                            "id": "gcr8yek",
                            "parent_id": "t1_gcr8qh5",
                            "score": 10,
                            "created_utc": 1605732163.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "SBs will never get this simple concept",
            "author": "xanfiles",
            "id": "gcs9too",
            "parent_id": "t1_gcr5vp7",
            "score": -4,
            "created_utc": 1605750347.0,
            "replies": [
                {
                    "body": "Yeah because we don't have to 🤷🏼‍♀️",
                    "author": "cobble_cobbler",
                    "id": "gcsim5z",
                    "parent_id": "t1_gcs9too",
                    "score": 5,
                    "created_utc": 1605755118.0,
                    "replies": [
                        {
                            "body": "It's a life-skill....and then you keep wondering why self-made billionaires/multi-millionaires are all men",
                            "author": "xanfiles",
                            "id": "gcsjh85",
                            "parent_id": "t1_gcsim5z",
                            "score": 0,
                            "created_utc": 1605755612.0,
                            "replies": [
                                {
                                    "body": "Hi, female investment banker here. 👋🏽 Their worth is determine by market economics which is exactly why they don’t have to settle for below market prices.",
                                    "author": "LexyGlobal",
                                    "id": "gcsuk5o",
                                    "parent_id": "t1_gcsjh85",
                                    "score": 6,
                                    "created_utc": 1605762475.0,
                                    "replies": [
                                        {
                                            "body": "Just gonna take a wild guess that OP wouldn’t need to take the time to rant and join the hundreds of similar complaining posts if she could just laugh off these offers that don’t meet her “worth” because there is a line of SDs waiting to give her what she wants. The market has spoken.",
                                            "author": "bbmg69",
                                            "id": "gctdrou",
                                            "parent_id": "t1_gcsuk5o",
                                            "score": 2,
                                            "created_utc": 1605779890.0,
                                            "replies": [
                                                {
                                                    "body": "Meh, I vent about the not serious people wasting time but still definitely have plenty of serious offers at any given time. It’s not like there’s a line out the door at Louboutin, but there are still buyers. They’re just fewer and further between.",
                                                    "author": "LexyGlobal",
                                                    "id": "gcvsdyj",
                                                    "parent_id": "t1_gctdrou",
                                                    "score": 1,
                                                    "created_utc": 1605826759.0,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "body": "Thank You! That is exactly what I'm trying to say, their worth is set by 'market' economics, not 'self' delusion. \n\nNow, does any of the SBs compare allowances received by similar attributes (race, height, personality, body-type, location, sexual activity) or do they randomly pick numbers? \n\nDo you value all the companies by the price set by the seller or do you laugh at CEOs who think just because they are an online retailer, they should be valued at $1.5T, like Amazon?\n\nHope you see my point.",
                                            "author": "xanfiles",
                                            "id": "gcv0utw",
                                            "parent_id": "t1_gcsuk5o",
                                            "score": 1,
                                            "created_utc": 1605815073.0,
                                            "replies": [
                                                {
                                                    "body": "I mean I do obviously understand basic economic theory. My point is that the woman who posted this is just venting about the hagglers trying to come into Louboutin. It doesn’t mean that it’s not Louboutin. It doesn’t mean that there arent plenty of buyers for Louboutin. \n\nI get messages constantly about how I’m not worth XYZ, but I’ve dated men my entire life who can afford to participate in my lifestyle with me. I vent the same way this woman does at times. It doesn’t mean I’m worth less or one of the women overvaluing myself. If there weren’t buyers, I won’t post something so bold. lol",
                                                    "author": "LexyGlobal",
                                                    "id": "gcvsqpz",
                                                    "parent_id": "t1_gcv0utw",
                                                    "score": 2,
                                                    "created_utc": 1605826922.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "And no, no they’re not. This was spoken like someone who doesn’t run in those circles at all.",
                                    "author": "LexyGlobal",
                                    "id": "gcsumw2",
                                    "parent_id": "t1_gcsjh85",
                                    "score": 3,
                                    "created_utc": 1605762530.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I see you may have posted a number which is most likely an amount in relations to an arrangement. If this is the case, you are violating Rule#4 - \"No dollar amounts that are in reference to allowance/PPM are allowed.\"\n\n\nIf you are curious about Allowances reported by SLF contributors please see the [Allowance Master Thread 2020-2021](https://www.reddit.com/r/sugarlifestyleforum/comments/ja37xt/allowance_master_thread_20202021/)\n\nYour post will not be approved until you remove the amount.  Please read the sub [Rules](https://www.reddit.com/r/sugarlifestyleforum/comments/748zta/updated_and_clarified_rules_for_slf/) prior to posting anything else. \n\nIf you simply posted a number not referencing a monetary amount, please message the MODs to approve your post.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/sugarlifestyleforum) if you have any questions or concerns.*",
            "author": "AutoModerator",
            "id": "gcsmeth",
            "parent_id": "t1_gcsmes2",
            "score": 0,
            "created_utc": 1605757297.0,
            "replies": []
        },
        {
            "body": "Agreed. If someone wishes to avoid or delay discussion of money that is certainly their prerogative. My outline is solely my maximum limit to discussion of allowance/ppm. If the answer is \"Let's get together first and see how we get along,\" or \"I really do not want to discuss money, just give me what you think is right\" I accede. Both of those are real quotes, btw, and that second one caused me a month of doubt that ultimately changed how I view allowance. Now I have a minimum I will pay, regardless of what is requested.",
            "author": "ziggy440",
            "id": "gctu2ul",
            "parent_id": "t1_gctqzyi",
            "score": 2,
            "created_utc": 1605794001.0,
            "replies": []
        },
        {
            "body": "ding ding",
            "author": "bookworm010101",
            "id": "gcrppmi",
            "parent_id": "t1_gcrl9wk",
            "score": 10,
            "created_utc": 1605740068.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gctpfv9",
            "parent_id": "t1_gcrl9wk",
            "score": 0,
            "created_utc": 1605790902.0,
            "replies": [
                {
                    "body": "I am only interested in women at least 30 years old that have been in arrangements before. \n\nThis makes a huge difference with everything Bowl related, including the financial arrangement. \n\nI’m not interested in a woman that is uncomfortable ironing out the major parameters of a SR before the M&G. \n\nIf we aren’t compatible around the big three (Availability, number of meets & the allowance) then I’m not wasting my time or hers. \n\nI’ve had six arrangements over a decade and have only had six M&Gs.   Four of those turned into arrangements.  \n\nMaybe younger and/or inexperienced women are scared off/uncomfortable by early discussions but the women I am pursuing aren’t.  \n\nBut to be clear, it’s not the first thing we “text” about when we take it off the site.  I typically vet them for a week or so. \n\nOnce I decide I’d like to meet them I bring up the big three.  If we are in general agreement we meet. \n\nIt’s the SDs responsibility to bring up the financial arrangement.  A SD should never wait for a young woman to bring it up.",
                    "author": "BGDDDY1",
                    "id": "gcu9jo3",
                    "parent_id": "t1_gctpfv9",
                    "score": 5,
                    "created_utc": 1605802302.0,
                    "replies": []
                },
                {
                    "body": "While I agree, I also don’t want to get onto the situation where I am wasting both our times because our expectations aren’t in the same ballpark. It’s why I try to discuss these sorts of things in advance including intimacy.",
                    "author": "sdthrowout23",
                    "id": "gctygj5",
                    "parent_id": "t1_gctpfv9",
                    "score": 4,
                    "created_utc": 1605796564.0,
                    "replies": [
                        {
                            "body": "I agree with not wasting time, but I've found most women with high expectations know they have high expectations and will want to have the discussion early.  If I knew I provided a lower allowance, I would also want to have the discussion early.  I know what I offer is fair and most women are happy with what I offer.  It's rarely been an issue, but has once or twice.",
                            "author": "willfromvb",
                            "id": "gctztzh",
                            "parent_id": "t1_gctygj5",
                            "score": 4,
                            "created_utc": 1605797319.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "He probably started lowering the price lower than it already was",
            "author": null,
            "id": "gcr4uqg",
            "parent_id": "t1_gcr4ag7",
            "score": 11,
            "created_utc": 1605730216.0,
            "replies": [
                {
                    "body": "Right, these guys always try to dick women down to nothing. They’re trash.",
                    "author": "LexyGlobal",
                    "id": "gcsu9ke",
                    "parent_id": "t1_gcr4uqg",
                    "score": 5,
                    "created_utc": 1605762266.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "LOL girl, I’m early 40s and do just fine sugar dating. More than fine. (Granted I live amongst billionaires and multimillionaires in California) \n\nThose who only want brand new 18yos are next level Epsteins. 🤢",
            "author": "ExExpectations",
            "id": "gcr2hef",
            "parent_id": "t1_gcr1rbf",
            "score": 21,
            "created_utc": 1605729089.0,
            "replies": [
                {
                    "body": "I’m in my early 30s, and was in my late 20s when I entered the bowl. My only long-term SD was hesitant about me because, when we met, I was below 30. He didn’t want to be with somebody in their 20s, bc that was too close to his kids’ age. I never asked for a specific amount, but the number he offered was great. There was no need to barter.\n\nHe was very respectful, mature, and *never* pushed any of my boundaries. Also gave a really nice allowance every time we stayed together.\n\nHe was attractive. He truly didn’t need to pay for sex. He was in his 50s, but looked younger. He was sugaring to avoid the emotional strings that often come with purely vanilla dating.\n\nI have a theory that men seeking *very* young women are perhaps looking for vulnerability and/or exploitability, in addition to the “hot young girl” thing. Ie: if she’s young, she’ll demand/expect less, or won’t truly know how valuable she is as a person, regardless of sugar.\n\nTl;dr: my best and only long-term SD didn’t try to lowball me, and he understood the benefits of being with an older SB, relative to the 18-22y/o demographic). Perhaps older men (50+) who only want women below age 22 are kinda creepy predators.",
                    "author": "ToxicGrad",
                    "id": "gcsmlsk",
                    "parent_id": "t1_gcr2hef",
                    "score": 8,
                    "created_utc": 1605757413.0,
                    "replies": []
                },
                {
                    "body": "Where do you live? *eyes my luggage*",
                    "author": "kschin1",
                    "id": "gcuj1u6",
                    "parent_id": "t1_gcr2hef",
                    "score": 3,
                    "created_utc": 1605806783.0,
                    "replies": [
                        {
                            "body": "Lol. I’m in California",
                            "author": "ExExpectations",
                            "id": "gcujfpm",
                            "parent_id": "t1_gcuj1u6",
                            "score": 2,
                            "created_utc": 1605806963.0,
                            "replies": [
                                {
                                    "body": "Lol I am too. NorCal or SoCal? (I live in NorCal but the east bay so not sf)",
                                    "author": "kschin1",
                                    "id": "gcujj8m",
                                    "parent_id": "t1_gcujfpm",
                                    "score": 2,
                                    "created_utc": 1605807009.0,
                                    "replies": [
                                        {
                                            "body": "*wave*",
                                            "author": "ExExpectations",
                                            "id": "gcukenr",
                                            "parent_id": "t1_gcujj8m",
                                            "score": 2,
                                            "created_utc": 1605807414.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Yup, I’ve a lot say 22 is the limit and and I automatically got Epstein vibes.",
                    "author": null,
                    "id": "gcr2nce",
                    "parent_id": "t1_gcr2hef",
                    "score": 11,
                    "created_utc": 1605729167.0,
                    "replies": [
                        {
                            "body": "🤢🤮",
                            "author": "ExExpectations",
                            "id": "gcr2xed",
                            "parent_id": "t1_gcr2nce",
                            "score": 6,
                            "created_utc": 1605729300.0,
                            "replies": []
                        },
                        {
                            "body": "Oh dear.",
                            "author": "LikeHoney99",
                            "id": "gcs6rml",
                            "parent_id": "t1_gcr2nce",
                            "score": 4,
                            "created_utc": 1605748700.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Idt anyone said they were. She’s just pointing out what she deals with on her end. I think we’re all aware that there are 23 yr olds imaging six figures for mediocre dates and subpar sexual skills.",
            "author": "LexyGlobal",
            "id": "gcvvdlk",
            "parent_id": "t1_gcvun0i",
            "score": 0,
            "created_utc": 1605828081.0,
            "replies": [
                {
                    "body": "Sub par?  That would be an improvement!",
                    "author": "timrid",
                    "id": "gcvvzzf",
                    "parent_id": "t1_gcvvdlk",
                    "score": 0,
                    "created_utc": 1605828347.0,
                    "replies": [
                        {
                            "body": "Wow, what is happening over there!?!",
                            "author": "LexyGlobal",
                            "id": "gcvwgoq",
                            "parent_id": "t1_gcvvzzf",
                            "score": 2,
                            "created_utc": 1605828553.0,
                            "replies": []
                        },
                        {
                            "body": "Dump her and tell her she’s bad, so she puts some effort and thought in.",
                            "author": "LexyGlobal",
                            "id": "gcvwirh",
                            "parent_id": "t1_gcvvzzf",
                            "score": 2,
                            "created_utc": 1605828579.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "If you have a strict budget you should share that in the first few messages, so you're not wasting someone's valuable time and energy.",
            "author": "sugarsenior2",
            "id": "gcs3asd",
            "parent_id": "t1_gcr0ddg",
            "score": 9,
            "created_utc": 1605746774.0,
            "replies": [
                {
                    "body": "As stated in other posts & here, I'll pay up to any amount desired, but to a total stranger ? Hardly. - time & trust are earned. A fool & his money are soon parted, I prefer to build wealth with a supportive partner. And as it was a M&G dinner I paid for after one message - how did I waste anybody's time - I invested exactly the same time.",
                    "author": "Cloud_Architect61",
                    "id": "gcs5dhb",
                    "parent_id": "t1_gcs3asd",
                    "score": 4,
                    "created_utc": 1605747937.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Yeah I had that happen. Thankfully it was before a M&G, so I was able to decline politely and move on.",
            "author": "emptyoverflow",
            "id": "gcrlmwt",
            "parent_id": "t1_gcr0ddg",
            "score": 2,
            "created_utc": 1605738249.0,
            "replies": []
        },
        {
            "body": "That man has underwear that costs more than that.",
            "author": "InnerRadio7",
            "id": "gcryqb9",
            "parent_id": "t1_gcry965",
            "score": 9,
            "created_utc": 1605744241.0,
            "replies": []
        },
        {
            "body": "ya don't get rich by blowing wads of cash",
            "author": "Blknior",
            "id": "gcs8ct9",
            "parent_id": "t1_gcry965",
            "score": -2,
            "created_utc": 1605749556.0,
            "replies": [
                {
                    "body": "Sure, but once you’re  wealthy, and set, you can afford to spend. Also, the amount she mentioned was egregiously low, so your point really does not have a place here. These are men who call themselves Sugar Daddies. No one really cares how they got their money, so long as they actually have it and aren’t reprehensible human beings.",
                    "author": "InnerRadio7",
                    "id": "gcscvos",
                    "parent_id": "t1_gcs8ct9",
                    "score": 2,
                    "created_utc": 1605751983.0,
                    "replies": [
                        {
                            "body": "True I can, but why would I want to? I'm not here to be rude just give a realistic view of the sugar world. If I'm an SD, especially the type most babies want, tall, connected, sociable, handsome, the right ethnicity, rich. I can get any woman I want on presence alone. So since you're the one who needs help you don't control the playing field, I do. So take what I give you and show me why I should give you more of my hard earned support.\n\nIf he's your cup of tea trust me this won't be an issue",
                            "author": "Blknior",
                            "id": "gcy9fdd",
                            "parent_id": "t1_gcscvos",
                            "score": 0,
                            "created_utc": 1605888186.0,
                            "replies": [
                                {
                                    "body": "First off. I don’t trust you because I don’t know you. \n\nSecond of all, if you can get whomever you like outside of the bowl, you go ahead and do that and stop telling the rest of us how great you are. \n\nThirdly, men are on seeking for a reason, and it’s not because they can get what they need from the real world...otherwise they wouldn’t be there. \n\nThat bs is always moot from the beginning. \n\n*SBs and legit SDs take note, this is the kind of attitude that is discussed so very frequently on this subreddit. Thank you Blknior for giving us such a perfect and shining example of what a sugar daddy is truly NOT.*",
                                    "author": "InnerRadio7",
                                    "id": "gd3nyap",
                                    "parent_id": "t1_gcy9fdd",
                                    "score": 2,
                                    "created_utc": 1605988920.0,
                                    "replies": [
                                        {
                                            "body": " lets be honest it's a massive chunk and I'm sure you've gotten this message from many an SD. Hence all these posts and wacky images. From what I've been told by my babies when it's too late and ur deep in the situation.",
                                            "author": "Blknior",
                                            "id": "gd3wxdv",
                                            "parent_id": "t1_gd3nyap",
                                            "score": 0,
                                            "created_utc": 1605991907.0,
                                            "replies": [
                                                {
                                                    "body": "I honestly cannot understand anything that you wrote. I’m also not going to be gaslighted. \nSo enjoy your day. \nI’m not interested in your replies.",
                                                    "author": "InnerRadio7",
                                                    "id": "gd444ry",
                                                    "parent_id": "t1_gd3wxdv",
                                                    "score": 1,
                                                    "created_utc": 1605994226.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Yes, you're right! Earnings in a career are determined by the market. But It's naive to think that being a SB is a career...",
            "author": "cobble_cobbler",
            "id": "gcsatyo",
            "parent_id": "t1_gcs9ntr",
            "score": 4,
            "created_utc": 1605750879.0,
            "replies": [
                {
                    "body": "Way to totally miss the point.",
                    "author": "xanfiles",
                    "id": "gcsdy24",
                    "parent_id": "t1_gcsatyo",
                    "score": -4,
                    "created_utc": 1605752561.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Did you respond to the right post?  (not sure what anything in your response has to do with mine).\n\nI don't disagree with your post.  I'm just simply stating - you aren't going to change the mindset of these people.  The disgusting tactics DO work on some women.",
            "author": "SDstartingOut",
            "id": "gcr8qh5",
            "parent_id": "t1_gcr8er5",
            "score": 1,
            "created_utc": 1605732060.0,
            "replies": [
                {
                    "body": "I know I won’t change the mindset, but if some are on the forum, they’re gonna still here what’s up. And maybe some women will see it’s not okay.",
                    "author": null,
                    "id": "gcr8yek",
                    "parent_id": "t1_gcr8qh5",
                    "score": 10,
                    "created_utc": 1605732163.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Yeah because we don't have to 🤷🏼‍♀️",
            "author": "cobble_cobbler",
            "id": "gcsim5z",
            "parent_id": "t1_gcs9too",
            "score": 5,
            "created_utc": 1605755118.0,
            "replies": [
                {
                    "body": "It's a life-skill....and then you keep wondering why self-made billionaires/multi-millionaires are all men",
                    "author": "xanfiles",
                    "id": "gcsjh85",
                    "parent_id": "t1_gcsim5z",
                    "score": 0,
                    "created_utc": 1605755612.0,
                    "replies": [
                        {
                            "body": "Hi, female investment banker here. 👋🏽 Their worth is determine by market economics which is exactly why they don’t have to settle for below market prices.",
                            "author": "LexyGlobal",
                            "id": "gcsuk5o",
                            "parent_id": "t1_gcsjh85",
                            "score": 6,
                            "created_utc": 1605762475.0,
                            "replies": [
                                {
                                    "body": "Just gonna take a wild guess that OP wouldn’t need to take the time to rant and join the hundreds of similar complaining posts if she could just laugh off these offers that don’t meet her “worth” because there is a line of SDs waiting to give her what she wants. The market has spoken.",
                                    "author": "bbmg69",
                                    "id": "gctdrou",
                                    "parent_id": "t1_gcsuk5o",
                                    "score": 2,
                                    "created_utc": 1605779890.0,
                                    "replies": [
                                        {
                                            "body": "Meh, I vent about the not serious people wasting time but still definitely have plenty of serious offers at any given time. It’s not like there’s a line out the door at Louboutin, but there are still buyers. They’re just fewer and further between.",
                                            "author": "LexyGlobal",
                                            "id": "gcvsdyj",
                                            "parent_id": "t1_gctdrou",
                                            "score": 1,
                                            "created_utc": 1605826759.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "Thank You! That is exactly what I'm trying to say, their worth is set by 'market' economics, not 'self' delusion. \n\nNow, does any of the SBs compare allowances received by similar attributes (race, height, personality, body-type, location, sexual activity) or do they randomly pick numbers? \n\nDo you value all the companies by the price set by the seller or do you laugh at CEOs who think just because they are an online retailer, they should be valued at $1.5T, like Amazon?\n\nHope you see my point.",
                                    "author": "xanfiles",
                                    "id": "gcv0utw",
                                    "parent_id": "t1_gcsuk5o",
                                    "score": 1,
                                    "created_utc": 1605815073.0,
                                    "replies": [
                                        {
                                            "body": "I mean I do obviously understand basic economic theory. My point is that the woman who posted this is just venting about the hagglers trying to come into Louboutin. It doesn’t mean that it’s not Louboutin. It doesn’t mean that there arent plenty of buyers for Louboutin. \n\nI get messages constantly about how I’m not worth XYZ, but I’ve dated men my entire life who can afford to participate in my lifestyle with me. I vent the same way this woman does at times. It doesn’t mean I’m worth less or one of the women overvaluing myself. If there weren’t buyers, I won’t post something so bold. lol",
                                            "author": "LexyGlobal",
                                            "id": "gcvsqpz",
                                            "parent_id": "t1_gcv0utw",
                                            "score": 2,
                                            "created_utc": 1605826922.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "And no, no they’re not. This was spoken like someone who doesn’t run in those circles at all.",
                            "author": "LexyGlobal",
                            "id": "gcsumw2",
                            "parent_id": "t1_gcsjh85",
                            "score": 3,
                            "created_utc": 1605762530.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I am only interested in women at least 30 years old that have been in arrangements before. \n\nThis makes a huge difference with everything Bowl related, including the financial arrangement. \n\nI’m not interested in a woman that is uncomfortable ironing out the major parameters of a SR before the M&G. \n\nIf we aren’t compatible around the big three (Availability, number of meets & the allowance) then I’m not wasting my time or hers. \n\nI’ve had six arrangements over a decade and have only had six M&Gs.   Four of those turned into arrangements.  \n\nMaybe younger and/or inexperienced women are scared off/uncomfortable by early discussions but the women I am pursuing aren’t.  \n\nBut to be clear, it’s not the first thing we “text” about when we take it off the site.  I typically vet them for a week or so. \n\nOnce I decide I’d like to meet them I bring up the big three.  If we are in general agreement we meet. \n\nIt’s the SDs responsibility to bring up the financial arrangement.  A SD should never wait for a young woman to bring it up.",
            "author": "BGDDDY1",
            "id": "gcu9jo3",
            "parent_id": "t1_gctpfv9",
            "score": 5,
            "created_utc": 1605802302.0,
            "replies": []
        },
        {
            "body": "While I agree, I also don’t want to get onto the situation where I am wasting both our times because our expectations aren’t in the same ballpark. It’s why I try to discuss these sorts of things in advance including intimacy.",
            "author": "sdthrowout23",
            "id": "gctygj5",
            "parent_id": "t1_gctpfv9",
            "score": 4,
            "created_utc": 1605796564.0,
            "replies": [
                {
                    "body": "I agree with not wasting time, but I've found most women with high expectations know they have high expectations and will want to have the discussion early.  If I knew I provided a lower allowance, I would also want to have the discussion early.  I know what I offer is fair and most women are happy with what I offer.  It's rarely been an issue, but has once or twice.",
                    "author": "willfromvb",
                    "id": "gctztzh",
                    "parent_id": "t1_gctygj5",
                    "score": 4,
                    "created_utc": 1605797319.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Right, these guys always try to dick women down to nothing. They’re trash.",
            "author": "LexyGlobal",
            "id": "gcsu9ke",
            "parent_id": "t1_gcr4uqg",
            "score": 5,
            "created_utc": 1605762266.0,
            "replies": []
        },
        {
            "body": "I’m in my early 30s, and was in my late 20s when I entered the bowl. My only long-term SD was hesitant about me because, when we met, I was below 30. He didn’t want to be with somebody in their 20s, bc that was too close to his kids’ age. I never asked for a specific amount, but the number he offered was great. There was no need to barter.\n\nHe was very respectful, mature, and *never* pushed any of my boundaries. Also gave a really nice allowance every time we stayed together.\n\nHe was attractive. He truly didn’t need to pay for sex. He was in his 50s, but looked younger. He was sugaring to avoid the emotional strings that often come with purely vanilla dating.\n\nI have a theory that men seeking *very* young women are perhaps looking for vulnerability and/or exploitability, in addition to the “hot young girl” thing. Ie: if she’s young, she’ll demand/expect less, or won’t truly know how valuable she is as a person, regardless of sugar.\n\nTl;dr: my best and only long-term SD didn’t try to lowball me, and he understood the benefits of being with an older SB, relative to the 18-22y/o demographic). Perhaps older men (50+) who only want women below age 22 are kinda creepy predators.",
            "author": "ToxicGrad",
            "id": "gcsmlsk",
            "parent_id": "t1_gcr2hef",
            "score": 8,
            "created_utc": 1605757413.0,
            "replies": []
        },
        {
            "body": "Where do you live? *eyes my luggage*",
            "author": "kschin1",
            "id": "gcuj1u6",
            "parent_id": "t1_gcr2hef",
            "score": 3,
            "created_utc": 1605806783.0,
            "replies": [
                {
                    "body": "Lol. I’m in California",
                    "author": "ExExpectations",
                    "id": "gcujfpm",
                    "parent_id": "t1_gcuj1u6",
                    "score": 2,
                    "created_utc": 1605806963.0,
                    "replies": [
                        {
                            "body": "Lol I am too. NorCal or SoCal? (I live in NorCal but the east bay so not sf)",
                            "author": "kschin1",
                            "id": "gcujj8m",
                            "parent_id": "t1_gcujfpm",
                            "score": 2,
                            "created_utc": 1605807009.0,
                            "replies": [
                                {
                                    "body": "*wave*",
                                    "author": "ExExpectations",
                                    "id": "gcukenr",
                                    "parent_id": "t1_gcujj8m",
                                    "score": 2,
                                    "created_utc": 1605807414.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Yup, I’ve a lot say 22 is the limit and and I automatically got Epstein vibes.",
            "author": null,
            "id": "gcr2nce",
            "parent_id": "t1_gcr2hef",
            "score": 11,
            "created_utc": 1605729167.0,
            "replies": [
                {
                    "body": "🤢🤮",
                    "author": "ExExpectations",
                    "id": "gcr2xed",
                    "parent_id": "t1_gcr2nce",
                    "score": 6,
                    "created_utc": 1605729300.0,
                    "replies": []
                },
                {
                    "body": "Oh dear.",
                    "author": "LikeHoney99",
                    "id": "gcs6rml",
                    "parent_id": "t1_gcr2nce",
                    "score": 4,
                    "created_utc": 1605748700.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Sub par?  That would be an improvement!",
            "author": "timrid",
            "id": "gcvvzzf",
            "parent_id": "t1_gcvvdlk",
            "score": 0,
            "created_utc": 1605828347.0,
            "replies": [
                {
                    "body": "Wow, what is happening over there!?!",
                    "author": "LexyGlobal",
                    "id": "gcvwgoq",
                    "parent_id": "t1_gcvvzzf",
                    "score": 2,
                    "created_utc": 1605828553.0,
                    "replies": []
                },
                {
                    "body": "Dump her and tell her she’s bad, so she puts some effort and thought in.",
                    "author": "LexyGlobal",
                    "id": "gcvwirh",
                    "parent_id": "t1_gcvvzzf",
                    "score": 2,
                    "created_utc": 1605828579.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "As stated in other posts & here, I'll pay up to any amount desired, but to a total stranger ? Hardly. - time & trust are earned. A fool & his money are soon parted, I prefer to build wealth with a supportive partner. And as it was a M&G dinner I paid for after one message - how did I waste anybody's time - I invested exactly the same time.",
            "author": "Cloud_Architect61",
            "id": "gcs5dhb",
            "parent_id": "t1_gcs3asd",
            "score": 4,
            "created_utc": 1605747937.0,
            "replies": []
        },
        {
            "body": "Sure, but once you’re  wealthy, and set, you can afford to spend. Also, the amount she mentioned was egregiously low, so your point really does not have a place here. These are men who call themselves Sugar Daddies. No one really cares how they got their money, so long as they actually have it and aren’t reprehensible human beings.",
            "author": "InnerRadio7",
            "id": "gcscvos",
            "parent_id": "t1_gcs8ct9",
            "score": 2,
            "created_utc": 1605751983.0,
            "replies": [
                {
                    "body": "True I can, but why would I want to? I'm not here to be rude just give a realistic view of the sugar world. If I'm an SD, especially the type most babies want, tall, connected, sociable, handsome, the right ethnicity, rich. I can get any woman I want on presence alone. So since you're the one who needs help you don't control the playing field, I do. So take what I give you and show me why I should give you more of my hard earned support.\n\nIf he's your cup of tea trust me this won't be an issue",
                    "author": "Blknior",
                    "id": "gcy9fdd",
                    "parent_id": "t1_gcscvos",
                    "score": 0,
                    "created_utc": 1605888186.0,
                    "replies": [
                        {
                            "body": "First off. I don’t trust you because I don’t know you. \n\nSecond of all, if you can get whomever you like outside of the bowl, you go ahead and do that and stop telling the rest of us how great you are. \n\nThirdly, men are on seeking for a reason, and it’s not because they can get what they need from the real world...otherwise they wouldn’t be there. \n\nThat bs is always moot from the beginning. \n\n*SBs and legit SDs take note, this is the kind of attitude that is discussed so very frequently on this subreddit. Thank you Blknior for giving us such a perfect and shining example of what a sugar daddy is truly NOT.*",
                            "author": "InnerRadio7",
                            "id": "gd3nyap",
                            "parent_id": "t1_gcy9fdd",
                            "score": 2,
                            "created_utc": 1605988920.0,
                            "replies": [
                                {
                                    "body": " lets be honest it's a massive chunk and I'm sure you've gotten this message from many an SD. Hence all these posts and wacky images. From what I've been told by my babies when it's too late and ur deep in the situation.",
                                    "author": "Blknior",
                                    "id": "gd3wxdv",
                                    "parent_id": "t1_gd3nyap",
                                    "score": 0,
                                    "created_utc": 1605991907.0,
                                    "replies": [
                                        {
                                            "body": "I honestly cannot understand anything that you wrote. I’m also not going to be gaslighted. \nSo enjoy your day. \nI’m not interested in your replies.",
                                            "author": "InnerRadio7",
                                            "id": "gd444ry",
                                            "parent_id": "t1_gd3wxdv",
                                            "score": 1,
                                            "created_utc": 1605994226.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Way to totally miss the point.",
            "author": "xanfiles",
            "id": "gcsdy24",
            "parent_id": "t1_gcsatyo",
            "score": -4,
            "created_utc": 1605752561.0,
            "replies": []
        },
        {
            "body": "I know I won’t change the mindset, but if some are on the forum, they’re gonna still here what’s up. And maybe some women will see it’s not okay.",
            "author": null,
            "id": "gcr8yek",
            "parent_id": "t1_gcr8qh5",
            "score": 10,
            "created_utc": 1605732163.0,
            "replies": []
        },
        {
            "body": "It's a life-skill....and then you keep wondering why self-made billionaires/multi-millionaires are all men",
            "author": "xanfiles",
            "id": "gcsjh85",
            "parent_id": "t1_gcsim5z",
            "score": 0,
            "created_utc": 1605755612.0,
            "replies": [
                {
                    "body": "Hi, female investment banker here. 👋🏽 Their worth is determine by market economics which is exactly why they don’t have to settle for below market prices.",
                    "author": "LexyGlobal",
                    "id": "gcsuk5o",
                    "parent_id": "t1_gcsjh85",
                    "score": 6,
                    "created_utc": 1605762475.0,
                    "replies": [
                        {
                            "body": "Just gonna take a wild guess that OP wouldn’t need to take the time to rant and join the hundreds of similar complaining posts if she could just laugh off these offers that don’t meet her “worth” because there is a line of SDs waiting to give her what she wants. The market has spoken.",
                            "author": "bbmg69",
                            "id": "gctdrou",
                            "parent_id": "t1_gcsuk5o",
                            "score": 2,
                            "created_utc": 1605779890.0,
                            "replies": [
                                {
                                    "body": "Meh, I vent about the not serious people wasting time but still definitely have plenty of serious offers at any given time. It’s not like there’s a line out the door at Louboutin, but there are still buyers. They’re just fewer and further between.",
                                    "author": "LexyGlobal",
                                    "id": "gcvsdyj",
                                    "parent_id": "t1_gctdrou",
                                    "score": 1,
                                    "created_utc": 1605826759.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "Thank You! That is exactly what I'm trying to say, their worth is set by 'market' economics, not 'self' delusion. \n\nNow, does any of the SBs compare allowances received by similar attributes (race, height, personality, body-type, location, sexual activity) or do they randomly pick numbers? \n\nDo you value all the companies by the price set by the seller or do you laugh at CEOs who think just because they are an online retailer, they should be valued at $1.5T, like Amazon?\n\nHope you see my point.",
                            "author": "xanfiles",
                            "id": "gcv0utw",
                            "parent_id": "t1_gcsuk5o",
                            "score": 1,
                            "created_utc": 1605815073.0,
                            "replies": [
                                {
                                    "body": "I mean I do obviously understand basic economic theory. My point is that the woman who posted this is just venting about the hagglers trying to come into Louboutin. It doesn’t mean that it’s not Louboutin. It doesn’t mean that there arent plenty of buyers for Louboutin. \n\nI get messages constantly about how I’m not worth XYZ, but I’ve dated men my entire life who can afford to participate in my lifestyle with me. I vent the same way this woman does at times. It doesn’t mean I’m worth less or one of the women overvaluing myself. If there weren’t buyers, I won’t post something so bold. lol",
                                    "author": "LexyGlobal",
                                    "id": "gcvsqpz",
                                    "parent_id": "t1_gcv0utw",
                                    "score": 2,
                                    "created_utc": 1605826922.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "And no, no they’re not. This was spoken like someone who doesn’t run in those circles at all.",
                    "author": "LexyGlobal",
                    "id": "gcsumw2",
                    "parent_id": "t1_gcsjh85",
                    "score": 3,
                    "created_utc": 1605762530.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I agree with not wasting time, but I've found most women with high expectations know they have high expectations and will want to have the discussion early.  If I knew I provided a lower allowance, I would also want to have the discussion early.  I know what I offer is fair and most women are happy with what I offer.  It's rarely been an issue, but has once or twice.",
            "author": "willfromvb",
            "id": "gctztzh",
            "parent_id": "t1_gctygj5",
            "score": 4,
            "created_utc": 1605797319.0,
            "replies": []
        },
        {
            "body": "Lol. I’m in California",
            "author": "ExExpectations",
            "id": "gcujfpm",
            "parent_id": "t1_gcuj1u6",
            "score": 2,
            "created_utc": 1605806963.0,
            "replies": [
                {
                    "body": "Lol I am too. NorCal or SoCal? (I live in NorCal but the east bay so not sf)",
                    "author": "kschin1",
                    "id": "gcujj8m",
                    "parent_id": "t1_gcujfpm",
                    "score": 2,
                    "created_utc": 1605807009.0,
                    "replies": [
                        {
                            "body": "*wave*",
                            "author": "ExExpectations",
                            "id": "gcukenr",
                            "parent_id": "t1_gcujj8m",
                            "score": 2,
                            "created_utc": 1605807414.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "🤢🤮",
            "author": "ExExpectations",
            "id": "gcr2xed",
            "parent_id": "t1_gcr2nce",
            "score": 6,
            "created_utc": 1605729300.0,
            "replies": []
        },
        {
            "body": "Oh dear.",
            "author": "LikeHoney99",
            "id": "gcs6rml",
            "parent_id": "t1_gcr2nce",
            "score": 4,
            "created_utc": 1605748700.0,
            "replies": []
        },
        {
            "body": "Wow, what is happening over there!?!",
            "author": "LexyGlobal",
            "id": "gcvwgoq",
            "parent_id": "t1_gcvvzzf",
            "score": 2,
            "created_utc": 1605828553.0,
            "replies": []
        },
        {
            "body": "Dump her and tell her she’s bad, so she puts some effort and thought in.",
            "author": "LexyGlobal",
            "id": "gcvwirh",
            "parent_id": "t1_gcvvzzf",
            "score": 2,
            "created_utc": 1605828579.0,
            "replies": []
        },
        {
            "body": "True I can, but why would I want to? I'm not here to be rude just give a realistic view of the sugar world. If I'm an SD, especially the type most babies want, tall, connected, sociable, handsome, the right ethnicity, rich. I can get any woman I want on presence alone. So since you're the one who needs help you don't control the playing field, I do. So take what I give you and show me why I should give you more of my hard earned support.\n\nIf he's your cup of tea trust me this won't be an issue",
            "author": "Blknior",
            "id": "gcy9fdd",
            "parent_id": "t1_gcscvos",
            "score": 0,
            "created_utc": 1605888186.0,
            "replies": [
                {
                    "body": "First off. I don’t trust you because I don’t know you. \n\nSecond of all, if you can get whomever you like outside of the bowl, you go ahead and do that and stop telling the rest of us how great you are. \n\nThirdly, men are on seeking for a reason, and it’s not because they can get what they need from the real world...otherwise they wouldn’t be there. \n\nThat bs is always moot from the beginning. \n\n*SBs and legit SDs take note, this is the kind of attitude that is discussed so very frequently on this subreddit. Thank you Blknior for giving us such a perfect and shining example of what a sugar daddy is truly NOT.*",
                    "author": "InnerRadio7",
                    "id": "gd3nyap",
                    "parent_id": "t1_gcy9fdd",
                    "score": 2,
                    "created_utc": 1605988920.0,
                    "replies": [
                        {
                            "body": " lets be honest it's a massive chunk and I'm sure you've gotten this message from many an SD. Hence all these posts and wacky images. From what I've been told by my babies when it's too late and ur deep in the situation.",
                            "author": "Blknior",
                            "id": "gd3wxdv",
                            "parent_id": "t1_gd3nyap",
                            "score": 0,
                            "created_utc": 1605991907.0,
                            "replies": [
                                {
                                    "body": "I honestly cannot understand anything that you wrote. I’m also not going to be gaslighted. \nSo enjoy your day. \nI’m not interested in your replies.",
                                    "author": "InnerRadio7",
                                    "id": "gd444ry",
                                    "parent_id": "t1_gd3wxdv",
                                    "score": 1,
                                    "created_utc": 1605994226.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Hi, female investment banker here. 👋🏽 Their worth is determine by market economics which is exactly why they don’t have to settle for below market prices.",
            "author": "LexyGlobal",
            "id": "gcsuk5o",
            "parent_id": "t1_gcsjh85",
            "score": 6,
            "created_utc": 1605762475.0,
            "replies": [
                {
                    "body": "Just gonna take a wild guess that OP wouldn’t need to take the time to rant and join the hundreds of similar complaining posts if she could just laugh off these offers that don’t meet her “worth” because there is a line of SDs waiting to give her what she wants. The market has spoken.",
                    "author": "bbmg69",
                    "id": "gctdrou",
                    "parent_id": "t1_gcsuk5o",
                    "score": 2,
                    "created_utc": 1605779890.0,
                    "replies": [
                        {
                            "body": "Meh, I vent about the not serious people wasting time but still definitely have plenty of serious offers at any given time. It’s not like there’s a line out the door at Louboutin, but there are still buyers. They’re just fewer and further between.",
                            "author": "LexyGlobal",
                            "id": "gcvsdyj",
                            "parent_id": "t1_gctdrou",
                            "score": 1,
                            "created_utc": 1605826759.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Thank You! That is exactly what I'm trying to say, their worth is set by 'market' economics, not 'self' delusion. \n\nNow, does any of the SBs compare allowances received by similar attributes (race, height, personality, body-type, location, sexual activity) or do they randomly pick numbers? \n\nDo you value all the companies by the price set by the seller or do you laugh at CEOs who think just because they are an online retailer, they should be valued at $1.5T, like Amazon?\n\nHope you see my point.",
                    "author": "xanfiles",
                    "id": "gcv0utw",
                    "parent_id": "t1_gcsuk5o",
                    "score": 1,
                    "created_utc": 1605815073.0,
                    "replies": [
                        {
                            "body": "I mean I do obviously understand basic economic theory. My point is that the woman who posted this is just venting about the hagglers trying to come into Louboutin. It doesn’t mean that it’s not Louboutin. It doesn’t mean that there arent plenty of buyers for Louboutin. \n\nI get messages constantly about how I’m not worth XYZ, but I’ve dated men my entire life who can afford to participate in my lifestyle with me. I vent the same way this woman does at times. It doesn’t mean I’m worth less or one of the women overvaluing myself. If there weren’t buyers, I won’t post something so bold. lol",
                            "author": "LexyGlobal",
                            "id": "gcvsqpz",
                            "parent_id": "t1_gcv0utw",
                            "score": 2,
                            "created_utc": 1605826922.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "And no, no they’re not. This was spoken like someone who doesn’t run in those circles at all.",
            "author": "LexyGlobal",
            "id": "gcsumw2",
            "parent_id": "t1_gcsjh85",
            "score": 3,
            "created_utc": 1605762530.0,
            "replies": []
        },
        {
            "body": "Lol I am too. NorCal or SoCal? (I live in NorCal but the east bay so not sf)",
            "author": "kschin1",
            "id": "gcujj8m",
            "parent_id": "t1_gcujfpm",
            "score": 2,
            "created_utc": 1605807009.0,
            "replies": [
                {
                    "body": "*wave*",
                    "author": "ExExpectations",
                    "id": "gcukenr",
                    "parent_id": "t1_gcujj8m",
                    "score": 2,
                    "created_utc": 1605807414.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "First off. I don’t trust you because I don’t know you. \n\nSecond of all, if you can get whomever you like outside of the bowl, you go ahead and do that and stop telling the rest of us how great you are. \n\nThirdly, men are on seeking for a reason, and it’s not because they can get what they need from the real world...otherwise they wouldn’t be there. \n\nThat bs is always moot from the beginning. \n\n*SBs and legit SDs take note, this is the kind of attitude that is discussed so very frequently on this subreddit. Thank you Blknior for giving us such a perfect and shining example of what a sugar daddy is truly NOT.*",
            "author": "InnerRadio7",
            "id": "gd3nyap",
            "parent_id": "t1_gcy9fdd",
            "score": 2,
            "created_utc": 1605988920.0,
            "replies": [
                {
                    "body": " lets be honest it's a massive chunk and I'm sure you've gotten this message from many an SD. Hence all these posts and wacky images. From what I've been told by my babies when it's too late and ur deep in the situation.",
                    "author": "Blknior",
                    "id": "gd3wxdv",
                    "parent_id": "t1_gd3nyap",
                    "score": 0,
                    "created_utc": 1605991907.0,
                    "replies": [
                        {
                            "body": "I honestly cannot understand anything that you wrote. I’m also not going to be gaslighted. \nSo enjoy your day. \nI’m not interested in your replies.",
                            "author": "InnerRadio7",
                            "id": "gd444ry",
                            "parent_id": "t1_gd3wxdv",
                            "score": 1,
                            "created_utc": 1605994226.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Just gonna take a wild guess that OP wouldn’t need to take the time to rant and join the hundreds of similar complaining posts if she could just laugh off these offers that don’t meet her “worth” because there is a line of SDs waiting to give her what she wants. The market has spoken.",
            "author": "bbmg69",
            "id": "gctdrou",
            "parent_id": "t1_gcsuk5o",
            "score": 2,
            "created_utc": 1605779890.0,
            "replies": [
                {
                    "body": "Meh, I vent about the not serious people wasting time but still definitely have plenty of serious offers at any given time. It’s not like there’s a line out the door at Louboutin, but there are still buyers. They’re just fewer and further between.",
                    "author": "LexyGlobal",
                    "id": "gcvsdyj",
                    "parent_id": "t1_gctdrou",
                    "score": 1,
                    "created_utc": 1605826759.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Thank You! That is exactly what I'm trying to say, their worth is set by 'market' economics, not 'self' delusion. \n\nNow, does any of the SBs compare allowances received by similar attributes (race, height, personality, body-type, location, sexual activity) or do they randomly pick numbers? \n\nDo you value all the companies by the price set by the seller or do you laugh at CEOs who think just because they are an online retailer, they should be valued at $1.5T, like Amazon?\n\nHope you see my point.",
            "author": "xanfiles",
            "id": "gcv0utw",
            "parent_id": "t1_gcsuk5o",
            "score": 1,
            "created_utc": 1605815073.0,
            "replies": [
                {
                    "body": "I mean I do obviously understand basic economic theory. My point is that the woman who posted this is just venting about the hagglers trying to come into Louboutin. It doesn’t mean that it’s not Louboutin. It doesn’t mean that there arent plenty of buyers for Louboutin. \n\nI get messages constantly about how I’m not worth XYZ, but I’ve dated men my entire life who can afford to participate in my lifestyle with me. I vent the same way this woman does at times. It doesn’t mean I’m worth less or one of the women overvaluing myself. If there weren’t buyers, I won’t post something so bold. lol",
                    "author": "LexyGlobal",
                    "id": "gcvsqpz",
                    "parent_id": "t1_gcv0utw",
                    "score": 2,
                    "created_utc": 1605826922.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "*wave*",
            "author": "ExExpectations",
            "id": "gcukenr",
            "parent_id": "t1_gcujj8m",
            "score": 2,
            "created_utc": 1605807414.0,
            "replies": []
        },
        {
            "body": " lets be honest it's a massive chunk and I'm sure you've gotten this message from many an SD. Hence all these posts and wacky images. From what I've been told by my babies when it's too late and ur deep in the situation.",
            "author": "Blknior",
            "id": "gd3wxdv",
            "parent_id": "t1_gd3nyap",
            "score": 0,
            "created_utc": 1605991907.0,
            "replies": [
                {
                    "body": "I honestly cannot understand anything that you wrote. I’m also not going to be gaslighted. \nSo enjoy your day. \nI’m not interested in your replies.",
                    "author": "InnerRadio7",
                    "id": "gd444ry",
                    "parent_id": "t1_gd3wxdv",
                    "score": 1,
                    "created_utc": 1605994226.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Meh, I vent about the not serious people wasting time but still definitely have plenty of serious offers at any given time. It’s not like there’s a line out the door at Louboutin, but there are still buyers. They’re just fewer and further between.",
            "author": "LexyGlobal",
            "id": "gcvsdyj",
            "parent_id": "t1_gctdrou",
            "score": 1,
            "created_utc": 1605826759.0,
            "replies": []
        },
        {
            "body": "I mean I do obviously understand basic economic theory. My point is that the woman who posted this is just venting about the hagglers trying to come into Louboutin. It doesn’t mean that it’s not Louboutin. It doesn’t mean that there arent plenty of buyers for Louboutin. \n\nI get messages constantly about how I’m not worth XYZ, but I’ve dated men my entire life who can afford to participate in my lifestyle with me. I vent the same way this woman does at times. It doesn’t mean I’m worth less or one of the women overvaluing myself. If there weren’t buyers, I won’t post something so bold. lol",
            "author": "LexyGlobal",
            "id": "gcvsqpz",
            "parent_id": "t1_gcv0utw",
            "score": 2,
            "created_utc": 1605826922.0,
            "replies": []
        },
        {
            "body": "I honestly cannot understand anything that you wrote. I’m also not going to be gaslighted. \nSo enjoy your day. \nI’m not interested in your replies.",
            "author": "InnerRadio7",
            "id": "gd444ry",
            "parent_id": "t1_gd3wxdv",
            "score": 1,
            "created_utc": 1605994226.0,
            "replies": []
        }
    ]
}