{
    "title": "Have some decency, no really",
    "post_id": "hnqerf",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/hnqerf/have_some_decency_no_really/",
    "author": "Gemini-Fox",
    "body": "This is just a little reminder, it doesn't matter if you're an SD or an SB, the person sitting on the other side of the table at the next M&G or date you go on is a human person, who breathes and has feelings and emotions and reacts to your behavior.  Be firm and put your foot down when they misstep and next them when they show you crazy, but when they don't - treat them well.\n\nIn sugar dating there is always the temptation to get whatever you can get, at the cost of dehumanizing the other person.  Don't do that.\n\nPSA over.",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/hnqerf/have_some_decency_no_really/",
    "score": 186,
    "upvote_ratio": 0.97,
    "created_utc": 1594245084.0,
    "num_comments": 44,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "[removed]",
            "author": null,
            "id": "fxdi6rh",
            "parent_id": "t3_hnqerf",
            "score": 39,
            "created_utc": 1594256341.0,
            "replies": [
                {
                    "body": "What a loser. He was a cheap asshole that tried to get laid by using a loser tactic. I am sorry this happened to you and I am so happy you stand your ground and keep your confidence as you should. Never ever second guess yourself like you say. If someone attempts to waste your time walk away. Frankly at that point I wouldnt even care about 30 because it is just emotional torture not worth it. You will always find someone who values your time and respect you.",
                    "author": "ilt1",
                    "id": "fxduwrk",
                    "parent_id": "t1_fxdi6rh",
                    "score": 14,
                    "created_utc": 1594263733.0,
                    "replies": []
                },
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "fxem0kq",
                    "parent_id": "t1_fxdi6rh",
                    "score": 14,
                    "created_utc": 1594285509.0,
                    "replies": [
                        {
                            "body": "Even when a man has NOTHING he still has thee AUDACITY",
                            "author": "Aphrodisiatic922",
                            "id": "fxetvia",
                            "parent_id": "t1_fxem0kq",
                            "score": 10,
                            "created_utc": 1594293192.0,
                            "replies": []
                        },
                        {
                            "body": "Those are usually the same profiles where their numbers don’t even add up.\n\nIt’s so sad.. I feel bad for their hearts.  Not only are they faking the grandeur identity, they are then purposely trying to swindle women into sexual Innuendo and sexual acts, or even just the crumbs of sexual talk they can squeeze out of them...\n\nTo the guys asking me for my number in the initial message or asking for mine -why? Your free trial membership about to run out?\n\nOr the gents who just send a digit amount that’s pretty much insulting.\nFour bills ? For what, coffee?\n\nThere’s a couple very important possible emergency expenses that minimum need to be allotted for for the health safety of the SB by the SD’s maintenance funds. So that alone (two things come to mind) is already a k and a half ...\n\nI just relocated to SoCal so maybe I’m getting this wanna-be LA con-daddy vibe from these thirtysomething y/ o guys...I felt way more at ease and “safe” with papi’s in the suburbs of Chicago.\nAn authenticity and aggressive yet gentle and chivalrous demeanor that I see I miss... \n\n\nMy first experience was kind of accidental, but I took those digits and never looked back. the “***lionaires ” who bat an eye at a few grand aren’t really *** figure anything’s, just sad hearted boys, who’s actions suggest a compromised relationship with their mother. 🤭🤫😅\n\n\nIt’s all a very curios condition. \nResearch is a bulk portion of my education so both sides of the behaviors intrigue me. \n\nI’ve heard some sketchy stories from guys on SA about SoCal chicks and the rip off game that is seemly rampant now. For some reason all that comes to mind is tweaker chicks with that🤷🏻‍♀️\n\n\nI inadvertently use the SA platform almost as a bare minimum playing field of I do well without the men, I don’t need them for squat. My networth is heavier then most of the dwads trying to holler. But I HATE being swindled by losers, lying, and trying to sleezeball into my pants. Disgusts me that large populations of men behave with this mentality. And ya, dinner isn’t a ticket into my pants. Or any woman’s pants. Period .\n\nThat’s where SA is kind of like the fair. \nWhy charge an admission fee?\nTo keep the trash out. \n\nExcuse my rant. I really enjoy yall’s reflections on experiences. \n\nY’all playing with world domination. Get it. ❤️",
                            "author": "danimusicaaa",
                            "id": "fxf5rmv",
                            "parent_id": "t1_fxem0kq",
                            "score": 3,
                            "created_utc": 1594301714.0,
                            "replies": []
                        },
                        {
                            "body": "My advice for SB's is one of the first things off the table is the  term   PRICE   that word turns sugar into a commodity. \n\nThink of the allowance as the appropriate amount put on the scale to balance what each brings to the relationship,  there are many opportunities. \n\nYou are looking for one where the SD perception of value includes an enthusiastic  commitment to an allowance that balances the scale and brings a smile to your face.",
                            "author": "pinotandsugar",
                            "id": "fxfzoen",
                            "parent_id": "t1_fxem0kq",
                            "score": 2,
                            "created_utc": 1594316652.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Appalling. What a POS. Please don’t believe a word that loser you met said. And definitely don’t take it to heart.  I find it so hard to believe that a ridiculous “attempt to demean” tactic ever succeeds with any woman. It would have exactly the opposite effect on me!",
                    "author": "RealEarthAngel",
                    "id": "fxe78yd",
                    "parent_id": "t1_fxdi6rh",
                    "score": 4,
                    "created_utc": 1594272033.0,
                    "replies": []
                },
                {
                    "body": "I am sorry this happened to you. I am also confused as to how someone that is 5'6 and 120lbs would be considered unfit? V.S. Girls have less body fat, but no muscle whatsoever. And this dude you were with for a M&G  sounded broke. I see why the M&G's are stressed.",
                    "author": "AsheGuade",
                    "id": "fxfcqry",
                    "parent_id": "t1_fxdi6rh",
                    "score": 2,
                    "created_utc": 1594305551.0,
                    "replies": []
                },
                {
                    "body": "I’m sorry you went through that, these men can be ruthless when they feel they are in control. Nonetheless that is no excuse. May I suggest that for future reference, you ask for a “small gift of ($___) for my time and effort in looking my best for you” - If they say no, I don’t bother as they’ll usually be cheap & this helps weed out the people that aren’t serious.",
                    "author": null,
                    "id": "fxfzw1p",
                    "parent_id": "t1_fxdi6rh",
                    "score": 2,
                    "created_utc": 1594316748.0,
                    "replies": []
                },
                {
                    "body": "This happened to me recently too!!! \"No offense, but I'm looking for a white girl\" like???? YOU pursued ME. My photos are also super accurate for that reason. And I don't mean to flex but I'm a solid 9/10 I know my worth. So if you think you can do better with someone 2 shades lighter I'd like to see you try lmao.",
                    "author": "2good4U2k20",
                    "id": "fxgsmf4",
                    "parent_id": "t1_fxdi6rh",
                    "score": 2,
                    "created_utc": 1594330364.0,
                    "replies": []
                },
                {
                    "body": "> because I kissed his ass \n\nI get the payoff-cost you a kiss for $30 -but after that rude display you should have gotten up and left. But $30 is $30. At the fair you used to be able to buy a kiss for $1",
                    "author": "GSSD",
                    "id": "fxf2wt3",
                    "parent_id": "t1_fxdi6rh",
                    "score": -1,
                    "created_utc": 1594299968.0,
                    "replies": [
                        {
                            "body": "[removed]",
                            "author": null,
                            "id": "fxfn36k",
                            "parent_id": "t1_fxf2wt3",
                            "score": 1,
                            "created_utc": 1594310694.0,
                            "replies": [
                                {
                                    "body": "All I'm saying is that he was a dick, so why reward him with a kiss? (I guess the $30)",
                                    "author": "GSSD",
                                    "id": "fxg2456",
                                    "parent_id": "t1_fxfn36k",
                                    "score": 1,
                                    "created_utc": 1594317759.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Good post.  If you're not interested, but they represented themselves honestly and showed good faith, be kind.",
            "author": "throwawayrdu71",
            "id": "fxd5g3z",
            "parent_id": "t3_hnqerf",
            "score": 9,
            "created_utc": 1594249188.0,
            "replies": [
                {
                    "body": "If you are a SD, even if they don’t represent themselves honestly or are less than nice, you should treat every woman that’s taken time to meet with you kindly.",
                    "author": "BGDDDY1",
                    "id": "fxec3zd",
                    "parent_id": "t1_fxd5g3z",
                    "score": 8,
                    "created_utc": 1594275999.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Man I am sorry. I think your post is a great reminder. We are all human. With feelings and emotions and looking for some happiness.  Always choose to be kind. Because well, karma is a bitch. Kindness is free. Its not that hard.",
            "author": "MidwestSB",
            "id": "fxd7e7u",
            "parent_id": "t3_hnqerf",
            "score": 9,
            "created_utc": 1594250233.0,
            "replies": []
        },
        {
            "body": "Yes, I definitely need to be reminded of this. There are ways of disagreeing without being unkind. However,  some people do need to be T-O-L-D. Let's try to keep it topical, fact-based,  and civil.\n\nNinja edit: apparently didn't read the last bit of your post and, oof,  am sorry.  People are jerks.  Just Google \"Karen's going too far,\" and be justified in your normalcy.",
            "author": "_Fortuna_",
            "id": "fxd4ec1",
            "parent_id": "t3_hnqerf",
            "score": 4,
            "created_utc": 1594248636.0,
            "replies": []
        },
        {
            "body": "Oh no! I hope nothing really unkind happened to you! Oy, I’m such a humanitarian to a flaw(I have to chill sometimes)....I’d be the one to kick off my heels to defend another’s honor.",
            "author": "SunnyWinter85",
            "id": "fxd5tvn",
            "parent_id": "t3_hnqerf",
            "score": 2,
            "created_utc": 1594249389.0,
            "replies": []
        },
        {
            "body": "I'm a naturally kind and giving person, and enjoy taking it at a relaxed pace at first until I get a feel for someone, and I swear to you, SBs that I talked to when I was sugar dating acted like I was some kind of unicorn that they had never encountered in the wild. Just treating people with what I would consider basic human decency seemed to be more rare than common, which was a shock for me. It honestly made negotiating arrangements absurdly easy, and in some cases I got preferential treatment, and remained good friends with people after our arrangements had run their natural course. I'm afraid that by telling prospective SDs to simply  \"be kind\" that I would be ruining my competitive advantage. But seriously... be kind.",
            "author": "orgnohpxf",
            "id": "fxflnt1",
            "parent_id": "t3_hnqerf",
            "score": 2,
            "created_utc": 1594310005.0,
            "replies": []
        },
        {
            "body": "I'm going to play a whole ass guessing game and assume this was a GPS situation, and shit, my dude, I'm sorry to hear it. There are so many phony tiktokSBs out there who think that having a tightbod is a substitute for their daddy (father's) credit card. Keep fighting the good fight, and stick to your intuition. There are a LOT of young hot girls out there who are broke AF right now trying to figure out how to come up in the world, and the pitiful old man who just wants a pretty girl to speak to him trope needs to die a fucking terrible death. KILL IT WITH FIRE",
            "author": "_Fortuna_",
            "id": "fxd6b45",
            "parent_id": "t3_hnqerf",
            "score": 5,
            "created_utc": 1594249644.0,
            "replies": [
                {
                    "body": "Sorry. What’s a GPS situation?",
                    "author": "wndrlnds",
                    "id": "fxd84v9",
                    "parent_id": "t1_fxd6b45",
                    "score": 4,
                    "created_utc": 1594250636.0,
                    "replies": [
                        {
                            "body": "Golden Pussy Syndrome",
                            "author": "_Fortuna_",
                            "id": "fxd8bh6",
                            "parent_id": "t1_fxd84v9",
                            "score": 8,
                            "created_utc": 1594250736.0,
                            "replies": [
                                {
                                    "body": "LOL",
                                    "author": "BGDDDY1",
                                    "id": "fxecb70",
                                    "parent_id": "t1_fxd8bh6",
                                    "score": 3,
                                    "created_utc": 1594276180.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Agree to all this! Dehumanizing someone just for money is despicable. \n\nThis also applies to GWS- men who think that being high net worth entitles then to treat women like livestock!",
                    "author": "SassySugar4u",
                    "id": "fxd8odl",
                    "parent_id": "t1_fxd6b45",
                    "score": 6,
                    "created_utc": 1594250930.0,
                    "replies": [
                        {
                            "body": "Sorry for my ignorance, but I am attempting to fill in the blank.\n\nGolden Pterodactyl Sydrome\n\nGolden Pneumonia Syndrome\n\nGolden Pharmaceuticals Syndrome\n\n\n\nHelp.... what does a man have that a woman doesn't have???\n\nGolden Penis Syndrome??\n\nIf that's not it I'll eat my hat.\n\n\n\n\n\nAlso: Yes, we're just long legged pretty bleeters that are primed for the next zoophile.\n\n\n\n\nAnd Edit: I cant read. What is GWS.",
                            "author": "_Fortuna_",
                            "id": "fxd96k1",
                            "parent_id": "t1_fxd8odl",
                            "score": 4,
                            "created_utc": 1594251207.0,
                            "replies": [
                                {
                                    "body": "Golden Wallet Syndrome.\nGolden penis sounds fun though 😍",
                                    "author": "SassySugar4u",
                                    "id": "fxda6yj",
                                    "parent_id": "t1_fxd96k1",
                                    "score": 3,
                                    "created_utc": 1594251772.0,
                                    "replies": [
                                        {
                                            "body": "Oh dear sweet baby Jesus I have so much to say about GWS. Because it puts people in  such strange undignified position. \"How bad do I need/want this money?\"\n\n&#x200B;\n\nThere are those who go through life throwing money at problems, and when I say problems I mean important people in their lives. I've been one of those, not an SB, but an actual abused blood relative of a wealthy patriarch. It's bad. \n\n&#x200B;\n\nI've also lived on the SB side, and damn if it didn't get farther than a M&G where I eventually stormed out of the restaurant. I do blame myself a bit because I encouraged us to try some scotch. Hell you know I'll just tell this story in a post at some point lol.",
                                            "author": "_Fortuna_",
                                            "id": "fxdbtv1",
                                            "parent_id": "t1_fxda6yj",
                                            "score": 2,
                                            "created_utc": 1594252701.0,
                                            "replies": [
                                                {
                                                    "body": "Undignified is exactly the right word. \n\nSome people seem to get off on the ability to leverage someone’s desperation for money to get them to perform in a way that is obviously compromising their dignity. Others respect your dignity and basic humanity. It’s usually pretty obvious who is who. \n\nDo I like companionship, sex and money? Hell ya. \nDo I think I should ever compromise my dignity for any of those three things? Nope! \n\nAnd I won’t be with a SD who expects me to!",
                                                    "author": "SassySugar4u",
                                                    "id": "fxdc6kv",
                                                    "parent_id": "t1_fxdbtv1",
                                                    "score": 3,
                                                    "created_utc": 1594252902.0,
                                                    "replies": []
                                                },
                                                {
                                                    "body": "I’m so sorry that you’ve been abused by people in your life. Abuse is a heinous crime, especially when it was purposely done for someone’s pleasure. You did not deserve it, and I hope you’re okay now. If not, I’m always here to listen and help in any way I can.",
                                                    "author": "SassySugar4u",
                                                    "id": "fxdcbgi",
                                                    "parent_id": "t1_fxdbtv1",
                                                    "score": 1,
                                                    "created_utc": 1594252980.0,
                                                    "replies": [
                                                        {
                                                            "body": "Thank you so much. I'm more or less ok at this point, functioning on my own and what not. Saying no to the money was a huge hill to climb, but in the end I'm so much better for it. What I'm speaking to is more of a dysfunctional upbringing rather than a current situation. I would like to make it known that there are people out there whole get through life throwing money at their problems, and they relish in keeping these \"problems\" (people/loved ones) dependent. SB's are prime targets, and it's a very difficult problem to deal with. I am here to talk equally as you are, and thank you so, so much for the support.",
                                                            "author": "_Fortuna_",
                                                            "id": "fxde4gj",
                                                            "parent_id": "t1_fxdcbgi",
                                                            "score": 2,
                                                            "created_utc": 1594254011.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "Golden Wallet Syndrome?",
                            "author": "BGDDDY1",
                            "id": "fxecdbi",
                            "parent_id": "t1_fxd8odl",
                            "score": 1,
                            "created_utc": 1594276233.0,
                            "replies": [
                                {
                                    "body": "When a man becomes cruel/rude/otherwise an asshole because he thinks his $$$$ are soo amazing.",
                                    "author": "SassySugar4u",
                                    "id": "fxecx76",
                                    "parent_id": "t1_fxecdbi",
                                    "score": 2,
                                    "created_utc": 1594276718.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "I love your outlook and take on this! If all SBs were like you, the bowl would be a better place:-)",
                    "author": "supportiveceo",
                    "id": "fxdhf2f",
                    "parent_id": "t1_fxd6b45",
                    "score": 2,
                    "created_utc": 1594255902.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Men see women as a piece of meat. Women see men as an ATM machine.\n\nBetween the meat and money lies the human being :-)",
            "author": "KnightAnthony",
            "id": "fxdh9es",
            "parent_id": "t3_hnqerf",
            "score": 4,
            "created_utc": 1594255811.0,
            "replies": [
                {
                    "body": "🤣🤣🤣",
                    "author": "a1bells",
                    "id": "fxerprl",
                    "parent_id": "t1_fxdh9es",
                    "score": 1,
                    "created_utc": 1594291192.0,
                    "replies": [
                        {
                            "body": "🥩 + 💲 = 👫\n\n🥩 + 💲💲 = 👄🥖\n\n🥩 + 💲💲💲 = 👉👌💦\n\n🥩 + 💲💲💲💲 = **SR**",
                            "author": "KnightAnthony",
                            "id": "fxf0833",
                            "parent_id": "t1_fxerprl",
                            "score": 3,
                            "created_utc": 1594298193.0,
                            "replies": [
                                {
                                    "body": "🤣🤣🤣",
                                    "author": "a1bells",
                                    "id": "fxf1o2m",
                                    "parent_id": "t1_fxf0833",
                                    "score": 1,
                                    "created_utc": 1594299173.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Was on the same boat just only today haha. I am done",
            "author": "adhik2005",
            "id": "fxd3os9",
            "parent_id": "t3_hnqerf",
            "score": 1,
            "created_utc": 1594248269.0,
            "replies": []
        },
        {
            "body": "Absolutely!",
            "author": null,
            "id": "fxdxq48",
            "parent_id": "t3_hnqerf",
            "score": 1,
            "created_utc": 1594265479.0,
            "replies": []
        },
        {
            "body": "Any relationship both parties need to be comfortable and having fun. If that isn’t happening you will feel unhappy and trapped. Being they for one another is a real relationship",
            "author": null,
            "id": "fxfyrdm",
            "parent_id": "t3_hnqerf",
            "score": 1,
            "created_utc": 1594316233.0,
            "replies": []
        },
        {
            "body": "I have never experienced as much dehumanizing behaviour as I have on SA. I’m not sure if it’s a SD thing or just the nature of the bowl. I believe so much in treating people with respect, and I have always been kind to everyone...even the one’s who don’t deserve it (until I block them). I’m going to keep my side of the street clean, but I hope things will improve.",
            "author": "InnerRadio7",
            "id": "fy3o4oi",
            "parent_id": "t3_hnqerf",
            "score": 1,
            "created_utc": 1594778168.0,
            "replies": []
        },
        {
            "body": "Eek! I’m so sorry if someone treated you like an ATM. \nBeing thirsty is gross and rude. You did not deserve to be dehumanized.",
            "author": "SassySugar4u",
            "id": "fxd8v2e",
            "parent_id": "t3_hnqerf",
            "score": 0,
            "created_utc": 1594251031.0,
            "replies": []
        },
        {
            "body": "What a loser. He was a cheap asshole that tried to get laid by using a loser tactic. I am sorry this happened to you and I am so happy you stand your ground and keep your confidence as you should. Never ever second guess yourself like you say. If someone attempts to waste your time walk away. Frankly at that point I wouldnt even care about 30 because it is just emotional torture not worth it. You will always find someone who values your time and respect you.",
            "author": "ilt1",
            "id": "fxduwrk",
            "parent_id": "t1_fxdi6rh",
            "score": 14,
            "created_utc": 1594263733.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "fxem0kq",
            "parent_id": "t1_fxdi6rh",
            "score": 14,
            "created_utc": 1594285509.0,
            "replies": [
                {
                    "body": "Even when a man has NOTHING he still has thee AUDACITY",
                    "author": "Aphrodisiatic922",
                    "id": "fxetvia",
                    "parent_id": "t1_fxem0kq",
                    "score": 10,
                    "created_utc": 1594293192.0,
                    "replies": []
                },
                {
                    "body": "Those are usually the same profiles where their numbers don’t even add up.\n\nIt’s so sad.. I feel bad for their hearts.  Not only are they faking the grandeur identity, they are then purposely trying to swindle women into sexual Innuendo and sexual acts, or even just the crumbs of sexual talk they can squeeze out of them...\n\nTo the guys asking me for my number in the initial message or asking for mine -why? Your free trial membership about to run out?\n\nOr the gents who just send a digit amount that’s pretty much insulting.\nFour bills ? For what, coffee?\n\nThere’s a couple very important possible emergency expenses that minimum need to be allotted for for the health safety of the SB by the SD’s maintenance funds. So that alone (two things come to mind) is already a k and a half ...\n\nI just relocated to SoCal so maybe I’m getting this wanna-be LA con-daddy vibe from these thirtysomething y/ o guys...I felt way more at ease and “safe” with papi’s in the suburbs of Chicago.\nAn authenticity and aggressive yet gentle and chivalrous demeanor that I see I miss... \n\n\nMy first experience was kind of accidental, but I took those digits and never looked back. the “***lionaires ” who bat an eye at a few grand aren’t really *** figure anything’s, just sad hearted boys, who’s actions suggest a compromised relationship with their mother. 🤭🤫😅\n\n\nIt’s all a very curios condition. \nResearch is a bulk portion of my education so both sides of the behaviors intrigue me. \n\nI’ve heard some sketchy stories from guys on SA about SoCal chicks and the rip off game that is seemly rampant now. For some reason all that comes to mind is tweaker chicks with that🤷🏻‍♀️\n\n\nI inadvertently use the SA platform almost as a bare minimum playing field of I do well without the men, I don’t need them for squat. My networth is heavier then most of the dwads trying to holler. But I HATE being swindled by losers, lying, and trying to sleezeball into my pants. Disgusts me that large populations of men behave with this mentality. And ya, dinner isn’t a ticket into my pants. Or any woman’s pants. Period .\n\nThat’s where SA is kind of like the fair. \nWhy charge an admission fee?\nTo keep the trash out. \n\nExcuse my rant. I really enjoy yall’s reflections on experiences. \n\nY’all playing with world domination. Get it. ❤️",
                    "author": "danimusicaaa",
                    "id": "fxf5rmv",
                    "parent_id": "t1_fxem0kq",
                    "score": 3,
                    "created_utc": 1594301714.0,
                    "replies": []
                },
                {
                    "body": "My advice for SB's is one of the first things off the table is the  term   PRICE   that word turns sugar into a commodity. \n\nThink of the allowance as the appropriate amount put on the scale to balance what each brings to the relationship,  there are many opportunities. \n\nYou are looking for one where the SD perception of value includes an enthusiastic  commitment to an allowance that balances the scale and brings a smile to your face.",
                    "author": "pinotandsugar",
                    "id": "fxfzoen",
                    "parent_id": "t1_fxem0kq",
                    "score": 2,
                    "created_utc": 1594316652.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Appalling. What a POS. Please don’t believe a word that loser you met said. And definitely don’t take it to heart.  I find it so hard to believe that a ridiculous “attempt to demean” tactic ever succeeds with any woman. It would have exactly the opposite effect on me!",
            "author": "RealEarthAngel",
            "id": "fxe78yd",
            "parent_id": "t1_fxdi6rh",
            "score": 4,
            "created_utc": 1594272033.0,
            "replies": []
        },
        {
            "body": "I am sorry this happened to you. I am also confused as to how someone that is 5'6 and 120lbs would be considered unfit? V.S. Girls have less body fat, but no muscle whatsoever. And this dude you were with for a M&G  sounded broke. I see why the M&G's are stressed.",
            "author": "AsheGuade",
            "id": "fxfcqry",
            "parent_id": "t1_fxdi6rh",
            "score": 2,
            "created_utc": 1594305551.0,
            "replies": []
        },
        {
            "body": "I’m sorry you went through that, these men can be ruthless when they feel they are in control. Nonetheless that is no excuse. May I suggest that for future reference, you ask for a “small gift of ($___) for my time and effort in looking my best for you” - If they say no, I don’t bother as they’ll usually be cheap & this helps weed out the people that aren’t serious.",
            "author": null,
            "id": "fxfzw1p",
            "parent_id": "t1_fxdi6rh",
            "score": 2,
            "created_utc": 1594316748.0,
            "replies": []
        },
        {
            "body": "This happened to me recently too!!! \"No offense, but I'm looking for a white girl\" like???? YOU pursued ME. My photos are also super accurate for that reason. And I don't mean to flex but I'm a solid 9/10 I know my worth. So if you think you can do better with someone 2 shades lighter I'd like to see you try lmao.",
            "author": "2good4U2k20",
            "id": "fxgsmf4",
            "parent_id": "t1_fxdi6rh",
            "score": 2,
            "created_utc": 1594330364.0,
            "replies": []
        },
        {
            "body": "> because I kissed his ass \n\nI get the payoff-cost you a kiss for $30 -but after that rude display you should have gotten up and left. But $30 is $30. At the fair you used to be able to buy a kiss for $1",
            "author": "GSSD",
            "id": "fxf2wt3",
            "parent_id": "t1_fxdi6rh",
            "score": -1,
            "created_utc": 1594299968.0,
            "replies": [
                {
                    "body": "[removed]",
                    "author": null,
                    "id": "fxfn36k",
                    "parent_id": "t1_fxf2wt3",
                    "score": 1,
                    "created_utc": 1594310694.0,
                    "replies": [
                        {
                            "body": "All I'm saying is that he was a dick, so why reward him with a kiss? (I guess the $30)",
                            "author": "GSSD",
                            "id": "fxg2456",
                            "parent_id": "t1_fxfn36k",
                            "score": 1,
                            "created_utc": 1594317759.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "If you are a SD, even if they don’t represent themselves honestly or are less than nice, you should treat every woman that’s taken time to meet with you kindly.",
            "author": "BGDDDY1",
            "id": "fxec3zd",
            "parent_id": "t1_fxd5g3z",
            "score": 8,
            "created_utc": 1594275999.0,
            "replies": []
        },
        {
            "body": "Sorry. What’s a GPS situation?",
            "author": "wndrlnds",
            "id": "fxd84v9",
            "parent_id": "t1_fxd6b45",
            "score": 4,
            "created_utc": 1594250636.0,
            "replies": [
                {
                    "body": "Golden Pussy Syndrome",
                    "author": "_Fortuna_",
                    "id": "fxd8bh6",
                    "parent_id": "t1_fxd84v9",
                    "score": 8,
                    "created_utc": 1594250736.0,
                    "replies": [
                        {
                            "body": "LOL",
                            "author": "BGDDDY1",
                            "id": "fxecb70",
                            "parent_id": "t1_fxd8bh6",
                            "score": 3,
                            "created_utc": 1594276180.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Agree to all this! Dehumanizing someone just for money is despicable. \n\nThis also applies to GWS- men who think that being high net worth entitles then to treat women like livestock!",
            "author": "SassySugar4u",
            "id": "fxd8odl",
            "parent_id": "t1_fxd6b45",
            "score": 6,
            "created_utc": 1594250930.0,
            "replies": [
                {
                    "body": "Sorry for my ignorance, but I am attempting to fill in the blank.\n\nGolden Pterodactyl Sydrome\n\nGolden Pneumonia Syndrome\n\nGolden Pharmaceuticals Syndrome\n\n\n\nHelp.... what does a man have that a woman doesn't have???\n\nGolden Penis Syndrome??\n\nIf that's not it I'll eat my hat.\n\n\n\n\n\nAlso: Yes, we're just long legged pretty bleeters that are primed for the next zoophile.\n\n\n\n\nAnd Edit: I cant read. What is GWS.",
                    "author": "_Fortuna_",
                    "id": "fxd96k1",
                    "parent_id": "t1_fxd8odl",
                    "score": 4,
                    "created_utc": 1594251207.0,
                    "replies": [
                        {
                            "body": "Golden Wallet Syndrome.\nGolden penis sounds fun though 😍",
                            "author": "SassySugar4u",
                            "id": "fxda6yj",
                            "parent_id": "t1_fxd96k1",
                            "score": 3,
                            "created_utc": 1594251772.0,
                            "replies": [
                                {
                                    "body": "Oh dear sweet baby Jesus I have so much to say about GWS. Because it puts people in  such strange undignified position. \"How bad do I need/want this money?\"\n\n&#x200B;\n\nThere are those who go through life throwing money at problems, and when I say problems I mean important people in their lives. I've been one of those, not an SB, but an actual abused blood relative of a wealthy patriarch. It's bad. \n\n&#x200B;\n\nI've also lived on the SB side, and damn if it didn't get farther than a M&G where I eventually stormed out of the restaurant. I do blame myself a bit because I encouraged us to try some scotch. Hell you know I'll just tell this story in a post at some point lol.",
                                    "author": "_Fortuna_",
                                    "id": "fxdbtv1",
                                    "parent_id": "t1_fxda6yj",
                                    "score": 2,
                                    "created_utc": 1594252701.0,
                                    "replies": [
                                        {
                                            "body": "Undignified is exactly the right word. \n\nSome people seem to get off on the ability to leverage someone’s desperation for money to get them to perform in a way that is obviously compromising their dignity. Others respect your dignity and basic humanity. It’s usually pretty obvious who is who. \n\nDo I like companionship, sex and money? Hell ya. \nDo I think I should ever compromise my dignity for any of those three things? Nope! \n\nAnd I won’t be with a SD who expects me to!",
                                            "author": "SassySugar4u",
                                            "id": "fxdc6kv",
                                            "parent_id": "t1_fxdbtv1",
                                            "score": 3,
                                            "created_utc": 1594252902.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "I’m so sorry that you’ve been abused by people in your life. Abuse is a heinous crime, especially when it was purposely done for someone’s pleasure. You did not deserve it, and I hope you’re okay now. If not, I’m always here to listen and help in any way I can.",
                                            "author": "SassySugar4u",
                                            "id": "fxdcbgi",
                                            "parent_id": "t1_fxdbtv1",
                                            "score": 1,
                                            "created_utc": 1594252980.0,
                                            "replies": [
                                                {
                                                    "body": "Thank you so much. I'm more or less ok at this point, functioning on my own and what not. Saying no to the money was a huge hill to climb, but in the end I'm so much better for it. What I'm speaking to is more of a dysfunctional upbringing rather than a current situation. I would like to make it known that there are people out there whole get through life throwing money at their problems, and they relish in keeping these \"problems\" (people/loved ones) dependent. SB's are prime targets, and it's a very difficult problem to deal with. I am here to talk equally as you are, and thank you so, so much for the support.",
                                                    "author": "_Fortuna_",
                                                    "id": "fxde4gj",
                                                    "parent_id": "t1_fxdcbgi",
                                                    "score": 2,
                                                    "created_utc": 1594254011.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Golden Wallet Syndrome?",
                    "author": "BGDDDY1",
                    "id": "fxecdbi",
                    "parent_id": "t1_fxd8odl",
                    "score": 1,
                    "created_utc": 1594276233.0,
                    "replies": [
                        {
                            "body": "When a man becomes cruel/rude/otherwise an asshole because he thinks his $$$$ are soo amazing.",
                            "author": "SassySugar4u",
                            "id": "fxecx76",
                            "parent_id": "t1_fxecdbi",
                            "score": 2,
                            "created_utc": 1594276718.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I love your outlook and take on this! If all SBs were like you, the bowl would be a better place:-)",
            "author": "supportiveceo",
            "id": "fxdhf2f",
            "parent_id": "t1_fxd6b45",
            "score": 2,
            "created_utc": 1594255902.0,
            "replies": []
        },
        {
            "body": "🤣🤣🤣",
            "author": "a1bells",
            "id": "fxerprl",
            "parent_id": "t1_fxdh9es",
            "score": 1,
            "created_utc": 1594291192.0,
            "replies": [
                {
                    "body": "🥩 + 💲 = 👫\n\n🥩 + 💲💲 = 👄🥖\n\n🥩 + 💲💲💲 = 👉👌💦\n\n🥩 + 💲💲💲💲 = **SR**",
                    "author": "KnightAnthony",
                    "id": "fxf0833",
                    "parent_id": "t1_fxerprl",
                    "score": 3,
                    "created_utc": 1594298193.0,
                    "replies": [
                        {
                            "body": "🤣🤣🤣",
                            "author": "a1bells",
                            "id": "fxf1o2m",
                            "parent_id": "t1_fxf0833",
                            "score": 1,
                            "created_utc": 1594299173.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Even when a man has NOTHING he still has thee AUDACITY",
            "author": "Aphrodisiatic922",
            "id": "fxetvia",
            "parent_id": "t1_fxem0kq",
            "score": 10,
            "created_utc": 1594293192.0,
            "replies": []
        },
        {
            "body": "Those are usually the same profiles where their numbers don’t even add up.\n\nIt’s so sad.. I feel bad for their hearts.  Not only are they faking the grandeur identity, they are then purposely trying to swindle women into sexual Innuendo and sexual acts, or even just the crumbs of sexual talk they can squeeze out of them...\n\nTo the guys asking me for my number in the initial message or asking for mine -why? Your free trial membership about to run out?\n\nOr the gents who just send a digit amount that’s pretty much insulting.\nFour bills ? For what, coffee?\n\nThere’s a couple very important possible emergency expenses that minimum need to be allotted for for the health safety of the SB by the SD’s maintenance funds. So that alone (two things come to mind) is already a k and a half ...\n\nI just relocated to SoCal so maybe I’m getting this wanna-be LA con-daddy vibe from these thirtysomething y/ o guys...I felt way more at ease and “safe” with papi’s in the suburbs of Chicago.\nAn authenticity and aggressive yet gentle and chivalrous demeanor that I see I miss... \n\n\nMy first experience was kind of accidental, but I took those digits and never looked back. the “***lionaires ” who bat an eye at a few grand aren’t really *** figure anything’s, just sad hearted boys, who’s actions suggest a compromised relationship with their mother. 🤭🤫😅\n\n\nIt’s all a very curios condition. \nResearch is a bulk portion of my education so both sides of the behaviors intrigue me. \n\nI’ve heard some sketchy stories from guys on SA about SoCal chicks and the rip off game that is seemly rampant now. For some reason all that comes to mind is tweaker chicks with that🤷🏻‍♀️\n\n\nI inadvertently use the SA platform almost as a bare minimum playing field of I do well without the men, I don’t need them for squat. My networth is heavier then most of the dwads trying to holler. But I HATE being swindled by losers, lying, and trying to sleezeball into my pants. Disgusts me that large populations of men behave with this mentality. And ya, dinner isn’t a ticket into my pants. Or any woman’s pants. Period .\n\nThat’s where SA is kind of like the fair. \nWhy charge an admission fee?\nTo keep the trash out. \n\nExcuse my rant. I really enjoy yall’s reflections on experiences. \n\nY’all playing with world domination. Get it. ❤️",
            "author": "danimusicaaa",
            "id": "fxf5rmv",
            "parent_id": "t1_fxem0kq",
            "score": 3,
            "created_utc": 1594301714.0,
            "replies": []
        },
        {
            "body": "My advice for SB's is one of the first things off the table is the  term   PRICE   that word turns sugar into a commodity. \n\nThink of the allowance as the appropriate amount put on the scale to balance what each brings to the relationship,  there are many opportunities. \n\nYou are looking for one where the SD perception of value includes an enthusiastic  commitment to an allowance that balances the scale and brings a smile to your face.",
            "author": "pinotandsugar",
            "id": "fxfzoen",
            "parent_id": "t1_fxem0kq",
            "score": 2,
            "created_utc": 1594316652.0,
            "replies": []
        },
        {
            "body": "[removed]",
            "author": null,
            "id": "fxfn36k",
            "parent_id": "t1_fxf2wt3",
            "score": 1,
            "created_utc": 1594310694.0,
            "replies": [
                {
                    "body": "All I'm saying is that he was a dick, so why reward him with a kiss? (I guess the $30)",
                    "author": "GSSD",
                    "id": "fxg2456",
                    "parent_id": "t1_fxfn36k",
                    "score": 1,
                    "created_utc": 1594317759.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Golden Pussy Syndrome",
            "author": "_Fortuna_",
            "id": "fxd8bh6",
            "parent_id": "t1_fxd84v9",
            "score": 8,
            "created_utc": 1594250736.0,
            "replies": [
                {
                    "body": "LOL",
                    "author": "BGDDDY1",
                    "id": "fxecb70",
                    "parent_id": "t1_fxd8bh6",
                    "score": 3,
                    "created_utc": 1594276180.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Sorry for my ignorance, but I am attempting to fill in the blank.\n\nGolden Pterodactyl Sydrome\n\nGolden Pneumonia Syndrome\n\nGolden Pharmaceuticals Syndrome\n\n\n\nHelp.... what does a man have that a woman doesn't have???\n\nGolden Penis Syndrome??\n\nIf that's not it I'll eat my hat.\n\n\n\n\n\nAlso: Yes, we're just long legged pretty bleeters that are primed for the next zoophile.\n\n\n\n\nAnd Edit: I cant read. What is GWS.",
            "author": "_Fortuna_",
            "id": "fxd96k1",
            "parent_id": "t1_fxd8odl",
            "score": 4,
            "created_utc": 1594251207.0,
            "replies": [
                {
                    "body": "Golden Wallet Syndrome.\nGolden penis sounds fun though 😍",
                    "author": "SassySugar4u",
                    "id": "fxda6yj",
                    "parent_id": "t1_fxd96k1",
                    "score": 3,
                    "created_utc": 1594251772.0,
                    "replies": [
                        {
                            "body": "Oh dear sweet baby Jesus I have so much to say about GWS. Because it puts people in  such strange undignified position. \"How bad do I need/want this money?\"\n\n&#x200B;\n\nThere are those who go through life throwing money at problems, and when I say problems I mean important people in their lives. I've been one of those, not an SB, but an actual abused blood relative of a wealthy patriarch. It's bad. \n\n&#x200B;\n\nI've also lived on the SB side, and damn if it didn't get farther than a M&G where I eventually stormed out of the restaurant. I do blame myself a bit because I encouraged us to try some scotch. Hell you know I'll just tell this story in a post at some point lol.",
                            "author": "_Fortuna_",
                            "id": "fxdbtv1",
                            "parent_id": "t1_fxda6yj",
                            "score": 2,
                            "created_utc": 1594252701.0,
                            "replies": [
                                {
                                    "body": "Undignified is exactly the right word. \n\nSome people seem to get off on the ability to leverage someone’s desperation for money to get them to perform in a way that is obviously compromising their dignity. Others respect your dignity and basic humanity. It’s usually pretty obvious who is who. \n\nDo I like companionship, sex and money? Hell ya. \nDo I think I should ever compromise my dignity for any of those three things? Nope! \n\nAnd I won’t be with a SD who expects me to!",
                                    "author": "SassySugar4u",
                                    "id": "fxdc6kv",
                                    "parent_id": "t1_fxdbtv1",
                                    "score": 3,
                                    "created_utc": 1594252902.0,
                                    "replies": []
                                },
                                {
                                    "body": "I’m so sorry that you’ve been abused by people in your life. Abuse is a heinous crime, especially when it was purposely done for someone’s pleasure. You did not deserve it, and I hope you’re okay now. If not, I’m always here to listen and help in any way I can.",
                                    "author": "SassySugar4u",
                                    "id": "fxdcbgi",
                                    "parent_id": "t1_fxdbtv1",
                                    "score": 1,
                                    "created_utc": 1594252980.0,
                                    "replies": [
                                        {
                                            "body": "Thank you so much. I'm more or less ok at this point, functioning on my own and what not. Saying no to the money was a huge hill to climb, but in the end I'm so much better for it. What I'm speaking to is more of a dysfunctional upbringing rather than a current situation. I would like to make it known that there are people out there whole get through life throwing money at their problems, and they relish in keeping these \"problems\" (people/loved ones) dependent. SB's are prime targets, and it's a very difficult problem to deal with. I am here to talk equally as you are, and thank you so, so much for the support.",
                                            "author": "_Fortuna_",
                                            "id": "fxde4gj",
                                            "parent_id": "t1_fxdcbgi",
                                            "score": 2,
                                            "created_utc": 1594254011.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Golden Wallet Syndrome?",
            "author": "BGDDDY1",
            "id": "fxecdbi",
            "parent_id": "t1_fxd8odl",
            "score": 1,
            "created_utc": 1594276233.0,
            "replies": [
                {
                    "body": "When a man becomes cruel/rude/otherwise an asshole because he thinks his $$$$ are soo amazing.",
                    "author": "SassySugar4u",
                    "id": "fxecx76",
                    "parent_id": "t1_fxecdbi",
                    "score": 2,
                    "created_utc": 1594276718.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "🥩 + 💲 = 👫\n\n🥩 + 💲💲 = 👄🥖\n\n🥩 + 💲💲💲 = 👉👌💦\n\n🥩 + 💲💲💲💲 = **SR**",
            "author": "KnightAnthony",
            "id": "fxf0833",
            "parent_id": "t1_fxerprl",
            "score": 3,
            "created_utc": 1594298193.0,
            "replies": [
                {
                    "body": "🤣🤣🤣",
                    "author": "a1bells",
                    "id": "fxf1o2m",
                    "parent_id": "t1_fxf0833",
                    "score": 1,
                    "created_utc": 1594299173.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "All I'm saying is that he was a dick, so why reward him with a kiss? (I guess the $30)",
            "author": "GSSD",
            "id": "fxg2456",
            "parent_id": "t1_fxfn36k",
            "score": 1,
            "created_utc": 1594317759.0,
            "replies": []
        },
        {
            "body": "LOL",
            "author": "BGDDDY1",
            "id": "fxecb70",
            "parent_id": "t1_fxd8bh6",
            "score": 3,
            "created_utc": 1594276180.0,
            "replies": []
        },
        {
            "body": "Golden Wallet Syndrome.\nGolden penis sounds fun though 😍",
            "author": "SassySugar4u",
            "id": "fxda6yj",
            "parent_id": "t1_fxd96k1",
            "score": 3,
            "created_utc": 1594251772.0,
            "replies": [
                {
                    "body": "Oh dear sweet baby Jesus I have so much to say about GWS. Because it puts people in  such strange undignified position. \"How bad do I need/want this money?\"\n\n&#x200B;\n\nThere are those who go through life throwing money at problems, and when I say problems I mean important people in their lives. I've been one of those, not an SB, but an actual abused blood relative of a wealthy patriarch. It's bad. \n\n&#x200B;\n\nI've also lived on the SB side, and damn if it didn't get farther than a M&G where I eventually stormed out of the restaurant. I do blame myself a bit because I encouraged us to try some scotch. Hell you know I'll just tell this story in a post at some point lol.",
                    "author": "_Fortuna_",
                    "id": "fxdbtv1",
                    "parent_id": "t1_fxda6yj",
                    "score": 2,
                    "created_utc": 1594252701.0,
                    "replies": [
                        {
                            "body": "Undignified is exactly the right word. \n\nSome people seem to get off on the ability to leverage someone’s desperation for money to get them to perform in a way that is obviously compromising their dignity. Others respect your dignity and basic humanity. It’s usually pretty obvious who is who. \n\nDo I like companionship, sex and money? Hell ya. \nDo I think I should ever compromise my dignity for any of those three things? Nope! \n\nAnd I won’t be with a SD who expects me to!",
                            "author": "SassySugar4u",
                            "id": "fxdc6kv",
                            "parent_id": "t1_fxdbtv1",
                            "score": 3,
                            "created_utc": 1594252902.0,
                            "replies": []
                        },
                        {
                            "body": "I’m so sorry that you’ve been abused by people in your life. Abuse is a heinous crime, especially when it was purposely done for someone’s pleasure. You did not deserve it, and I hope you’re okay now. If not, I’m always here to listen and help in any way I can.",
                            "author": "SassySugar4u",
                            "id": "fxdcbgi",
                            "parent_id": "t1_fxdbtv1",
                            "score": 1,
                            "created_utc": 1594252980.0,
                            "replies": [
                                {
                                    "body": "Thank you so much. I'm more or less ok at this point, functioning on my own and what not. Saying no to the money was a huge hill to climb, but in the end I'm so much better for it. What I'm speaking to is more of a dysfunctional upbringing rather than a current situation. I would like to make it known that there are people out there whole get through life throwing money at their problems, and they relish in keeping these \"problems\" (people/loved ones) dependent. SB's are prime targets, and it's a very difficult problem to deal with. I am here to talk equally as you are, and thank you so, so much for the support.",
                                    "author": "_Fortuna_",
                                    "id": "fxde4gj",
                                    "parent_id": "t1_fxdcbgi",
                                    "score": 2,
                                    "created_utc": 1594254011.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "When a man becomes cruel/rude/otherwise an asshole because he thinks his $$$$ are soo amazing.",
            "author": "SassySugar4u",
            "id": "fxecx76",
            "parent_id": "t1_fxecdbi",
            "score": 2,
            "created_utc": 1594276718.0,
            "replies": []
        },
        {
            "body": "🤣🤣🤣",
            "author": "a1bells",
            "id": "fxf1o2m",
            "parent_id": "t1_fxf0833",
            "score": 1,
            "created_utc": 1594299173.0,
            "replies": []
        },
        {
            "body": "Oh dear sweet baby Jesus I have so much to say about GWS. Because it puts people in  such strange undignified position. \"How bad do I need/want this money?\"\n\n&#x200B;\n\nThere are those who go through life throwing money at problems, and when I say problems I mean important people in their lives. I've been one of those, not an SB, but an actual abused blood relative of a wealthy patriarch. It's bad. \n\n&#x200B;\n\nI've also lived on the SB side, and damn if it didn't get farther than a M&G where I eventually stormed out of the restaurant. I do blame myself a bit because I encouraged us to try some scotch. Hell you know I'll just tell this story in a post at some point lol.",
            "author": "_Fortuna_",
            "id": "fxdbtv1",
            "parent_id": "t1_fxda6yj",
            "score": 2,
            "created_utc": 1594252701.0,
            "replies": [
                {
                    "body": "Undignified is exactly the right word. \n\nSome people seem to get off on the ability to leverage someone’s desperation for money to get them to perform in a way that is obviously compromising their dignity. Others respect your dignity and basic humanity. It’s usually pretty obvious who is who. \n\nDo I like companionship, sex and money? Hell ya. \nDo I think I should ever compromise my dignity for any of those three things? Nope! \n\nAnd I won’t be with a SD who expects me to!",
                    "author": "SassySugar4u",
                    "id": "fxdc6kv",
                    "parent_id": "t1_fxdbtv1",
                    "score": 3,
                    "created_utc": 1594252902.0,
                    "replies": []
                },
                {
                    "body": "I’m so sorry that you’ve been abused by people in your life. Abuse is a heinous crime, especially when it was purposely done for someone’s pleasure. You did not deserve it, and I hope you’re okay now. If not, I’m always here to listen and help in any way I can.",
                    "author": "SassySugar4u",
                    "id": "fxdcbgi",
                    "parent_id": "t1_fxdbtv1",
                    "score": 1,
                    "created_utc": 1594252980.0,
                    "replies": [
                        {
                            "body": "Thank you so much. I'm more or less ok at this point, functioning on my own and what not. Saying no to the money was a huge hill to climb, but in the end I'm so much better for it. What I'm speaking to is more of a dysfunctional upbringing rather than a current situation. I would like to make it known that there are people out there whole get through life throwing money at their problems, and they relish in keeping these \"problems\" (people/loved ones) dependent. SB's are prime targets, and it's a very difficult problem to deal with. I am here to talk equally as you are, and thank you so, so much for the support.",
                            "author": "_Fortuna_",
                            "id": "fxde4gj",
                            "parent_id": "t1_fxdcbgi",
                            "score": 2,
                            "created_utc": 1594254011.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Undignified is exactly the right word. \n\nSome people seem to get off on the ability to leverage someone’s desperation for money to get them to perform in a way that is obviously compromising their dignity. Others respect your dignity and basic humanity. It’s usually pretty obvious who is who. \n\nDo I like companionship, sex and money? Hell ya. \nDo I think I should ever compromise my dignity for any of those three things? Nope! \n\nAnd I won’t be with a SD who expects me to!",
            "author": "SassySugar4u",
            "id": "fxdc6kv",
            "parent_id": "t1_fxdbtv1",
            "score": 3,
            "created_utc": 1594252902.0,
            "replies": []
        },
        {
            "body": "I’m so sorry that you’ve been abused by people in your life. Abuse is a heinous crime, especially when it was purposely done for someone’s pleasure. You did not deserve it, and I hope you’re okay now. If not, I’m always here to listen and help in any way I can.",
            "author": "SassySugar4u",
            "id": "fxdcbgi",
            "parent_id": "t1_fxdbtv1",
            "score": 1,
            "created_utc": 1594252980.0,
            "replies": [
                {
                    "body": "Thank you so much. I'm more or less ok at this point, functioning on my own and what not. Saying no to the money was a huge hill to climb, but in the end I'm so much better for it. What I'm speaking to is more of a dysfunctional upbringing rather than a current situation. I would like to make it known that there are people out there whole get through life throwing money at their problems, and they relish in keeping these \"problems\" (people/loved ones) dependent. SB's are prime targets, and it's a very difficult problem to deal with. I am here to talk equally as you are, and thank you so, so much for the support.",
                    "author": "_Fortuna_",
                    "id": "fxde4gj",
                    "parent_id": "t1_fxdcbgi",
                    "score": 2,
                    "created_utc": 1594254011.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Thank you so much. I'm more or less ok at this point, functioning on my own and what not. Saying no to the money was a huge hill to climb, but in the end I'm so much better for it. What I'm speaking to is more of a dysfunctional upbringing rather than a current situation. I would like to make it known that there are people out there whole get through life throwing money at their problems, and they relish in keeping these \"problems\" (people/loved ones) dependent. SB's are prime targets, and it's a very difficult problem to deal with. I am here to talk equally as you are, and thank you so, so much for the support.",
            "author": "_Fortuna_",
            "id": "fxde4gj",
            "parent_id": "t1_fxdcbgi",
            "score": 2,
            "created_utc": 1594254011.0,
            "replies": []
        }
    ]
}