{
    "title": "Sugar Tinder tips for SBs",
    "post_id": "ftihq1",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/ftihq1/sugar_tinder_tips_for_sbs/",
    "author": null,
    "body": "Just wanted to share some tips, since I’ve been using Tinder for a while now and I’ve managed to have a few different types of arrangements from it over the past year.\n\nFirst of all I wanted to clarify that Tinder isn’t a vanilla dating app, it’s a dating app. Nowhere in the terms of use does it say anything about the type of dating that is allowed. What is not allowed on tinder is soliciting and prostitution, that’s also the case on Seeking Arrangements. Apart from that, people of all ages (legal) and orientations are allowed to use tinder for all kinds of relationships: FWB, platonic, hookups, sugar, bdsm, polyamory, long term, future spouse etc. \n\nHowever if multiple people get offended and report your account, it will get banned for sure, no questions asked. You will never be able to use the same phone number to create a new tinder account, and you will lose all your matches and conversations. Tinder will not reveal the reason why your account was banned (they don’t investigate) and you will not be able to appeal. [Bitter guys go on reporting rampages against girls who have their IG in their bio](https://www.reddit.com/r/Tinder/comments/ehzc88/today_i_started_reporting_any_profile_with_just/?utm_source=share&utm_medium=ios_app&utm_name=iossmf), so you can imagine the hate gold diggers/ sugar babies get.\n\nHere are a few tips to make the experience easier:\n\n- Use a burner number to create your profile (Google Voice or Hushed depending on your location)\n\n- Do not link your Instagram to your tinder account. If you want to, mention your handle in your bio. If your account gets banned, your linked Instagram will be flagged too and you’ll have issues next time you create an account. \n\n- Do not use any terms in your bio or messages that can be associated with illegal activities. Avoid “mutually beneficial” “arrangement” “allowance” etc.\n\n- Instead describe the kind of man you want (“generous” “financially stable”) and the type of relationship you are looking for. I like to mention expensive activities we could do together, just to make sure they get the message. \n\n- If you can, choose pictures that make you look more $B rather than girl next door. Considering this isn’t SA, you have to market yourself differently. I include pictures on luxury holidays, on a yacht, at high-end events etc. That’s not my everyday lifestyle but it helps weed out splenda/ salt daddies and men who do not want to spend. \n\n- Avoid swiping right on people if you’re not sure they are into sugar dating. I recommend investing in Tinder Gold to see who has liked you and selecting your matches from there. Otherwise focus on the men who superliked you, that indicates that they probably know what you’re looking for and they are OK with it (or they might just want to make sure they can talk to you to insult you, you know how it is).\n\n- When you get a match and start talking, try and switch to a different messaging platform ASAP. Some men will know what you want, some will think you’re an escort and will try to get your rates, some men will just want to pass time out of curiosity with no intention of pursuing anything. Do not clarify anything in tinder chat.\n\n- As soon as you start talking on another platform, unmatch from tinder. That way if they get offended by the fact that you’re a SB, they won’t be able to report you. (Don’t forget to take screenshots of the profile before to have their bio and pictures in case you decide to meet). \n\nOn SA you have a pool of men supposedly looking for the same thing as you are, and you need to approach a large number of them. On Tinder it’s the opposite, you need to focus on the few men who look like they might be into sugar dating. \n\nAn extra benefit of tinder (if you’re into that), is that you can date young and handsome experience daddies. Athletes, entrepreneurs, traders etc. who will take you out on luxury dates, buy you gifts, and give you a good time in a way that feels natural. Usually it’s casual and it doesn’t last long, but it’s fun and the wardrobe/ lifestyle upgrade helps be comfortable around a +++ POT sugar daddy.",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/ftihq1/sugar_tinder_tips_for_sbs/",
    "score": 108,
    "upvote_ratio": 0.88,
    "created_utc": 1585815090.0,
    "num_comments": 74,
    "links": [
        [
            "https://www.reddit.com/r/Tinder/comments/ehzc88/today_i_started_reporting_any_profile_with_just/?utm_source=share&utm_medium=ios_app&utm_name=iossmf"
        ]
    ],
    "comments": [
        {
            "body": "I wholeheartedly agree with using Tinder alongside SA. I’ve met two of my current SDs through tinder. My first sd is now my sbf and we’ve been together for two years so far. My second guy I first got in contact with SA, but then he found me on tinder and liked me there too. At the time, I was seriously pursuing pots, but I got swept up in homework. Had he not reached out that second time we would not have been together. \n\n\nAside from my bio, I add this bit: “‘Seeking’ a kind, generous, supportive, and respectful person. A cross between friends and lovers (mutual/beneficial relationship).” I think this helps a lot. Also I feel like common sense would dictate that if a 20-something yr old woman was reaching out to a 50+yr old man, she is looking for something other than vanilla. It is true that you will face a lot of negative reactions, but its fair to get that.",
            "author": "LaIndiaDeAzucar",
            "id": "fm8ncs9",
            "parent_id": "t3_ftihq1",
            "score": 13,
            "created_utc": 1585852510.0,
            "replies": []
        },
        {
            "body": "I very frequently see 'seeking sugar daddy' on Tinder. My thoughts are that Tinder is the first and easiest place an aspiring SB will go to start looking for an SD.   \n\n\nIt's an excellent resource to find some sugar, but you may be dealing with unexperienced individuals on both ends.",
            "author": "SugarPopsCLub",
            "id": "fm8ko57",
            "parent_id": "t3_ftihq1",
            "score": 13,
            "created_utc": 1585851117.0,
            "replies": []
        },
        {
            "body": "I use tinder for hookups only, and supplement with SA",
            "author": "Casual_DM",
            "id": "fm8rlo3",
            "parent_id": "t3_ftihq1",
            "score": 3,
            "created_utc": 1585854714.0,
            "replies": []
        },
        {
            "body": " Tinder is on 🔥🔥🔥🔥I'm in South Florida. Supply and demand fellas. I've set up multiple Post Quarantine Meet and Greets. I agree 100 percent with OP, in order to be successful in sugar dating, you have to use multiple platforms.",
            "author": "slimfitexec",
            "id": "fm7jlhr",
            "parent_id": "t3_ftihq1",
            "score": 19,
            "created_utc": 1585829185.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "fm7s0mv",
                    "parent_id": "t1_fm7jlhr",
                    "score": 14,
                    "created_utc": 1585835515.0,
                    "replies": [
                        {
                            "body": "💀💀💀",
                            "author": "LikeHoney99",
                            "id": "fm862kg",
                            "parent_id": "t1_fm7s0mv",
                            "score": 0,
                            "created_utc": 1585843489.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "[removed]",
                    "author": null,
                    "id": "fm7jv11",
                    "parent_id": "t1_fm7jlhr",
                    "score": 13,
                    "created_utc": 1585829426.0,
                    "replies": [
                        {
                            "body": "You build your net worth by investing in stocks, bonds, real estate. The same logic applies. It's my opinion and opinions are like assholes everyone has one😂😂😂",
                            "author": "slimfitexec",
                            "id": "fm7k16j",
                            "parent_id": "t1_fm7jv11",
                            "score": -1,
                            "created_utc": 1585829578.0,
                            "replies": [
                                {
                                    "body": "\"In order to be successful in sugar dating, you have to use multiple platforms\" is not an opinion.   It is a inaccurate statement of something you believe to be a fact.",
                                    "author": "UseTheForceRey",
                                    "id": "fm84ft7",
                                    "parent_id": "t1_fm7k16j",
                                    "score": 14,
                                    "created_utc": 1585842617.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I think this is a valuable addition. A few times a week someone posts about how to sugar on Tinder. Now we have some valuable insight. Can the wiki be updated to link this thread for future questions about sugaring on Tinder?",
            "author": "BinghamtonSD",
            "id": "fm8c4ln",
            "parent_id": "t3_ftihq1",
            "score": 8,
            "created_utc": 1585846688.0,
            "replies": [
                {
                    "body": "agree",
                    "author": "_mimi97",
                    "id": "fm979fw",
                    "parent_id": "t1_fm8c4ln",
                    "score": 1,
                    "created_utc": 1585863053.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Good suggestions. As an SD on tinder it’s harder but if you do match it can work.",
            "author": "MartelioD",
            "id": "fm76rpd",
            "parent_id": "t3_ftihq1",
            "score": 3,
            "created_utc": 1585815311.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "fm7t1kp",
            "parent_id": "t3_ftihq1",
            "score": 4,
            "created_utc": 1585836148.0,
            "replies": [
                {
                    "body": "Is it easy to tell by reading your bio and looking at your pictures that you are looking for a SB? On tinder I assume most people aren’t into sugar dating and swipe left unless there is a hint in their profile, so that might be it.",
                    "author": null,
                    "id": "fm849v2",
                    "parent_id": "t1_fm7t1kp",
                    "score": 5,
                    "created_utc": 1585842529.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "fm86z7e",
                            "parent_id": "t1_fm849v2",
                            "score": 2,
                            "created_utc": 1585843978.0,
                            "replies": [
                                {
                                    "body": "Strange! Maybe it has something to do with your location.",
                                    "author": null,
                                    "id": "fm875zf",
                                    "parent_id": "t1_fm86z7e",
                                    "score": 3,
                                    "created_utc": 1585844076.0,
                                    "replies": [
                                        {
                                            "body": "[deleted]",
                                            "author": null,
                                            "id": "fm970yg",
                                            "parent_id": "t1_fm875zf",
                                            "score": 3,
                                            "created_utc": 1585862925.0,
                                            "replies": [
                                                {
                                                    "body": "Will it work if I post a bikini shot with no head? Or does tinder require faces?",
                                                    "author": "testing1to3",
                                                    "id": "fsxtvx6",
                                                    "parent_id": "t1_fm970yg",
                                                    "score": 1,
                                                    "created_utc": 1591331251.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Use SA",
            "author": "BigBearSD",
            "id": "fm7aly6",
            "parent_id": "t3_ftihq1",
            "score": 4,
            "created_utc": 1585819526.0,
            "replies": [
                {
                    "body": "I use it too, I’m not limiting myself to just Tinder. Best to use multiple platforms.",
                    "author": null,
                    "id": "fm7ggfn",
                    "parent_id": "t1_fm7aly6",
                    "score": 6,
                    "created_utc": 1585826098.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "fm8hi7e",
            "parent_id": "t3_ftihq1",
            "score": 2,
            "created_utc": 1585849482.0,
            "replies": [
                {
                    "body": "I get that, ideally it would be so much better to be able to write “looking for a sugar relationship” on your bio but in some locations that profile won’t last more than a day, even though there is no real reason to report this based on the terms of use.",
                    "author": null,
                    "id": "fm8ielv",
                    "parent_id": "t1_fm8hi7e",
                    "score": 3,
                    "created_utc": 1585849952.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "fm8jaap",
                            "parent_id": "t1_fm8ielv",
                            "score": 4,
                            "created_utc": 1585850398.0,
                            "replies": [
                                {
                                    "body": "It just opens up new opportunities... I met people on Tinder who weren’t on SA. I also saw SA people on Tinder, recognized their pictures. Tinder is easy to download and everyone knows the app whereas SA is niche. I don’t see the harm in being on both. \n\nI agree with what you’re saying about being clear, and that why in my post I talk about what I put in my bio and pictures (usually they get what I’m about, at least experience sugar) and I recommend to move to another platform ASAP and talk about sugar dating there. There’s no point even for a SB in wasting time talking to someone who isn’t on the same page.",
                                    "author": null,
                                    "id": "fm8kfso",
                                    "parent_id": "t1_fm8jaap",
                                    "score": 5,
                                    "created_utc": 1585850996.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "[removed]",
            "author": null,
            "id": "fm7i93i",
            "parent_id": "t3_ftihq1",
            "score": 1,
            "created_utc": 1585827932.0,
            "replies": [
                {
                    "body": "Then swipe left? I see profiles I find annoying all the time on tinder, it’s never occurred to me to report anyone. You’re wasting more time by reporting than by just moving on",
                    "author": null,
                    "id": "fm7ic6w",
                    "parent_id": "t1_fm7i93i",
                    "score": 19,
                    "created_utc": 1585828017.0,
                    "replies": [
                        {
                            "body": "I know Ranger seems pretty annoyed and, at first, I was skeptical but then I looked into it and he's right.\n\n[https://www.gq-magazine.co.uk/lifestyle/article/why-do-people-on-tinder-list-their-instagram](https://www.gq-magazine.co.uk/lifestyle/article/why-do-people-on-tinder-list-their-instagram)\n\nEliminate Instagram from Tinder and you will clean it up a lot.  You can always give someone your Instagram once you take your conversation off the the app.\n\nTinder would easily weed out people on there just looking for Instagram followers or those who want to rope you in one step more to some onlyfans kind of paysite.",
                            "author": "soicansaywhatiwant",
                            "id": "fma2v22",
                            "parent_id": "t1_fm7ic6w",
                            "score": 2,
                            "created_utc": 1585882457.0,
                            "replies": [
                                {
                                    "body": "I’m aware that some people (not just women) use tinder for Instagram followers, that doesn’t mean that any profile that lists their ig handle is using tinder just for Instagram followers. Assuming that is a stretch, and considering you don’t even know that person’s intentions, taking action to report any profile with their handle doesn’t make any sense to me. There are lots of other reasons for which you’d want to list your Instagram account. \n\nFor instance I list an IG for men to be able check my pictures and possibly reach out there if I don’t swipe on them (I’m not always on tinder and don’t swipe for too long, so I might not see their profile for days). It’s not even my main account, it’s a separate one only for dating apps with <15 pictures so I really couldn’t care less care about the number of followers...",
                                    "author": null,
                                    "id": "fma43y9",
                                    "parent_id": "t1_fma2v22",
                                    "score": 2,
                                    "created_utc": 1585883336.0,
                                    "replies": [
                                        {
                                            "body": "All good points.  That being said, I would never track anyone down and reach out on Instagram if they didn't swipe right on me.  It strikes me as creepy and desperate.    The entire relationship would get off on the wrong footing.  I would venture to guess a lot of successful people my age feel the same way.\n\nWhen I have an account on Tinder I pay for Gold so I can see ahead of time who swiped right on me and then choose to swipe right on them if I'm intrigued.  Cuts out the endless swiping and narrows things down quite nicely.",
                                            "author": "soicansaywhatiwant",
                                            "id": "fmdff78",
                                            "parent_id": "t1_fma43y9",
                                            "score": 2,
                                            "created_utc": 1585966452.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "[removed]",
                            "author": null,
                            "id": "fm7ifcw",
                            "parent_id": "t1_fm7ic6w",
                            "score": 8,
                            "created_utc": 1585828101.0,
                            "replies": [
                                {
                                    "body": "Could be, could be just a lazy bio. There are many empty bios on tinder and IG is an easy way to see what someone is about. \n\nI still don’t get why you’d decide it’s a girl looking for followers and choose to spend time reporting if there isn’t some resentment.",
                                    "author": null,
                                    "id": "fm7inmq",
                                    "parent_id": "t1_fm7ifcw",
                                    "score": 9,
                                    "created_utc": 1585828317.0,
                                    "replies": [
                                        {
                                            "body": "[removed]",
                                            "author": null,
                                            "id": "fm7j2s8",
                                            "parent_id": "t1_fm7inmq",
                                            "score": 0,
                                            "created_utc": 1585828712.0,
                                            "replies": [
                                                {
                                                    "body": "Check your tone.",
                                                    "author": null,
                                                    "id": "fm7j4nc",
                                                    "parent_id": "t1_fm7j2s8",
                                                    "score": 4,
                                                    "created_utc": 1585828760.0,
                                                    "replies": [
                                                        {
                                                            "body": "“Your inside voice is gonna put your ass outside.” \n Leonard Washington",
                                                            "author": "Smitty0808",
                                                            "id": "fm7kgoi",
                                                            "parent_id": "t1_fm7j4nc",
                                                            "score": 8,
                                                            "created_utc": 1585829951.0,
                                                            "replies": []
                                                        },
                                                        {
                                                            "body": "Anna Oop",
                                                            "author": "LaNouvelleSugar",
                                                            "id": "fmlftm1",
                                                            "parent_id": "t1_fm7j4nc",
                                                            "score": 2,
                                                            "created_utc": 1586185560.0,
                                                            "replies": []
                                                        },
                                                        {
                                                            "body": "[removed]",
                                                            "author": null,
                                                            "id": "fm7jabk",
                                                            "parent_id": "t1_fm7j4nc",
                                                            "score": -2,
                                                            "created_utc": 1585828903.0,
                                                            "replies": [
                                                                {
                                                                    "body": "You *are* being kinda rude, dude.",
                                                                    "author": "LikeHoney99",
                                                                    "id": "fm866j0",
                                                                    "parent_id": "t1_fm7jabk",
                                                                    "score": 8,
                                                                    "created_utc": 1585843549.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "[removed]",
                                                                            "author": null,
                                                                            "id": "fm87gmz",
                                                                            "parent_id": "t1_fm866j0",
                                                                            "score": -4,
                                                                            "created_utc": 1585844231.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "I mean...I could as easily say you’re projecting.",
                                                                                    "author": "LikeHoney99",
                                                                                    "id": "fm8877j",
                                                                                    "parent_id": "t1_fm87gmz",
                                                                                    "score": 10,
                                                                                    "created_utc": 1585844618.0,
                                                                                    "replies": []
                                                                                },
                                                                                {
                                                                                    "body": "[deleted]",
                                                                                    "author": null,
                                                                                    "id": "fm88pu5",
                                                                                    "parent_id": "t1_fm87gmz",
                                                                                    "score": 7,
                                                                                    "created_utc": 1585844891.0,
                                                                                    "replies": [
                                                                                        {
                                                                                            "body": "[removed]",
                                                                                            "author": null,
                                                                                            "id": "fm8a5cx",
                                                                                            "parent_id": "t1_fm88pu5",
                                                                                            "score": -2,
                                                                                            "created_utc": 1585845645.0,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "body": "[deleted]",
                                                                                                    "author": null,
                                                                                                    "id": "fm8aehu",
                                                                                                    "parent_id": "t1_fm8a5cx",
                                                                                                    "score": 6,
                                                                                                    "created_utc": 1585845776.0,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "body": "Exactly!",
                                                                                                            "author": "LikeHoney99",
                                                                                                            "id": "fm8bfj1",
                                                                                                            "parent_id": "t1_fm8aehu",
                                                                                                            "score": 2,
                                                                                                            "created_utc": 1585846315.0,
                                                                                                            "replies": []
                                                                                                        }
                                                                                                    ]
                                                                                                },
                                                                                                {
                                                                                                    "body": "I don’t even HAVE IG.....doesn’t make me any less irritated by your attitude 😉",
                                                                                                    "author": "LikeHoney99",
                                                                                                    "id": "fm8ggth",
                                                                                                    "parent_id": "t1_fm8a5cx",
                                                                                                    "score": 6,
                                                                                                    "created_utc": 1585848960.0,
                                                                                                    "replies": []
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "body": "I’m no longer interacting with SDs here who are just here to contradict and are rude on top of that. It’s a waste of time and energy. \n\nI’m not against a healthy discussion and that’s just not it. I wrote a long and detailed post for SBs trying to be as helpful as I could. You picked up on one line that didn’t sit right with you and are now being borderline disrespectful in the way you address me. \n\nYou’re a grown man and you should know better. I’m not replying here any more.",
                                                                    "author": null,
                                                                    "id": "fm7jrpr",
                                                                    "parent_id": "t1_fm7jabk",
                                                                    "score": 10,
                                                                    "created_utc": 1585829344.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "body": "Are they paying you to do this ?🙄",
                                                    "author": "LaNouvelleSugar",
                                                    "id": "fmlfwms",
                                                    "parent_id": "t1_fm7j2s8",
                                                    "score": 2,
                                                    "created_utc": 1586185608.0,
                                                    "replies": [
                                                        {
                                                            "body": "[removed]",
                                                            "author": null,
                                                            "id": "fmliiv5",
                                                            "parent_id": "t1_fmlfwms",
                                                            "score": 1,
                                                            "created_utc": 1586187100.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Yeah...you definitely sound spiteful and bitter. That’s not cool dude. Stay safe !",
                                                                    "author": "LaNouvelleSugar",
                                                                    "id": "fmliu50",
                                                                    "parent_id": "t1_fmliiv5",
                                                                    "score": 2,
                                                                    "created_utc": 1586187274.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I dunno how you managed this... i was extra cautious and always tried to move conversations off tinder but alas, lifetime ban! Which sucks cause sometimes I wanna vanilla date too and not having tinder sucks. Not worth the risk in my opinion",
            "author": "urbanhippy123",
            "id": "fm8nug6",
            "parent_id": "t3_ftihq1",
            "score": 1,
            "created_utc": 1585852765.0,
            "replies": [
                {
                    "body": "You can create a Tinder profile with a new number, just use Google Voice if you’re in the US or Hushed elsewhere 😊  \nI never got banned in some locations and in others I got banned twice in a week. It really depends on the local culture and dating scene I guess.",
                    "author": null,
                    "id": "fm8ota4",
                    "parent_id": "t1_fm8nug6",
                    "score": 1,
                    "created_utc": 1585853262.0,
                    "replies": [
                        {
                            "body": "Nope. I swear they use facial recognition software... I’ve tried diff phone numbers, etc no luck",
                            "author": "urbanhippy123",
                            "id": "fm8owus",
                            "parent_id": "t1_fm8ota4",
                            "score": 5,
                            "created_utc": 1585853313.0,
                            "replies": [
                                {
                                    "body": "That’s insane! Never heard that before, it sucks.",
                                    "author": null,
                                    "id": "fm8p6bh",
                                    "parent_id": "t1_fm8owus",
                                    "score": 1,
                                    "created_utc": 1585853450.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I mean it is a vanilla dating / hookup site so if you use it for sugar purposes i can 100% understand and agree with why you are banned. Same if you bitch and complain about guys using SA as a vanilla dating site. Either stick to allowing both misuses of those sites, or go strictly for their intended use. Do not say it is ok to sugar on tinder but get hypocritical butthurt if guys use SA to Vanilla. You can't have your cake and eat it too. All or nothing.",
            "author": "BigBearSD",
            "id": "fm7dp25",
            "parent_id": "t3_ftihq1",
            "score": 0,
            "created_utc": 1585823060.0,
            "replies": [
                {
                    "body": "SA is meant for sugar dating only. Tinder is meant for dating, broad sense. No hypocrisy, and I’m seriously tired of the lack of basic respect from SDs here in the way they speak.",
                    "author": null,
                    "id": "fm8333q",
                    "parent_id": "t1_fm7dp25",
                    "score": 12,
                    "created_utc": 1585841888.0,
                    "replies": [
                        {
                            "body": "This is akin to PUAs using SA to find hookups. \n\nSoliciting money for arrangement / dating is against Tinder’s policies, which is why they ban your account. On the contrary, SA can be used for any type of dating, they promote it as a platform for dating successful or attractive people. Even SA is against PPM allowance, they can ban you for it.",
                            "author": "geekxp",
                            "id": "fm9knl4",
                            "parent_id": "t1_fm8333q",
                            "score": 0,
                            "created_utc": 1585870686.0,
                            "replies": []
                        },
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "fm84e94",
                            "parent_id": "t1_fm8333q",
                            "score": -3,
                            "created_utc": 1585842594.0,
                            "replies": [
                                {
                                    "body": "Well on here it is given. Rule number 1 of SLF\n\n>be respectful to other posters.\n\nYou can disagree and that’s fine, it’s your opinion. The fact is that nowhere on tinder terms of use does it say that the app is intended for one type of dating only, and sugar dating is not against the rules. Most people are into vanilla dating so it’s mostly vanilla.",
                                    "author": null,
                                    "id": "fm84ri7",
                                    "parent_id": "t1_fm84e94",
                                    "score": 8,
                                    "created_utc": 1585842792.0,
                                    "replies": [
                                        {
                                            "body": "Nowhere on SA does it say that you have to pay for companionship... they actually say no ppm talk!",
                                            "author": "BigBearSD",
                                            "id": "fm84ugs",
                                            "parent_id": "t1_fm84ri7",
                                            "score": -2,
                                            "created_utc": 1585842836.0,
                                            "replies": [
                                                {
                                                    "body": "Seeking **arrangement**, number one **Sugar daddy / sugar baby** website. \n\nWhen you sign up you have to mention if you are a **sugar daddy, sugar momma** or **sugar baby**. I don’t know how much clearer it can be.",
                                                    "author": null,
                                                    "id": "fm8512g",
                                                    "parent_id": "t1_fm84ugs",
                                                    "score": 5,
                                                    "created_utc": 1585842934.0,
                                                    "replies": [
                                                        {
                                                            "body": "[deleted]",
                                                            "author": null,
                                                            "id": "fm8oty6",
                                                            "parent_id": "t1_fm8512g",
                                                            "score": 1,
                                                            "created_utc": 1585853271.0,
                                                            "replies": [
                                                                {
                                                                    "body": "I’m a fool then... What is sugar dating if it’s not a form of dating?",
                                                                    "author": null,
                                                                    "id": "fm8ozmt",
                                                                    "parent_id": "t1_fm8oty6",
                                                                    "score": 2,
                                                                    "created_utc": 1585853354.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "[deleted]",
                                                                            "author": null,
                                                                            "id": "fm8q5tq",
                                                                            "parent_id": "t1_fm8ozmt",
                                                                            "score": 0,
                                                                            "created_utc": 1585853957.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "Sugar dating is a form of dating to me, therefore I think it’s perfectly fine to look for a SD on a dating app. But what do I know, I’m a fool who has never been on a date.",
                                                                                    "author": null,
                                                                                    "id": "fm8rt62",
                                                                                    "parent_id": "t1_fm8q5tq",
                                                                                    "score": 4,
                                                                                    "created_utc": 1585854827.0,
                                                                                    "replies": [
                                                                                        {
                                                                                            "body": "[deleted]",
                                                                                            "author": null,
                                                                                            "id": "fm8u46k",
                                                                                            "parent_id": "t1_fm8rt62",
                                                                                            "score": 0,
                                                                                            "created_utc": 1585856060.0,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "body": "> I am not saying it doesn't work; just that Tinder is not meant for arrangements, it is obviously not allowed and you are rightfully reported when it happens because you are wrong\n\n\nBeing banned just means that some tinder users decide they don’t want arrangements on the app and they report. That doesn’t mean that it’s not allowed. Tinder doesn’t investigate anything. I don’t know how many times I have to repeat that sugar dating doesn’t go against any Tinder rule. \n\nIn my part of the world you’re more likely to get banned if you’re a transgender person than a sugar baby. Doesn’t mean that being trans is against any tinder rule",
                                                                                                    "author": null,
                                                                                                    "id": "fm8ushj",
                                                                                                    "parent_id": "t1_fm8u46k",
                                                                                                    "score": 3,
                                                                                                    "created_utc": 1585856418.0,
                                                                                                    "replies": []
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Iam not sure girl here are not liking my dick",
            "author": "vampire_love",
            "id": "fm789du",
            "parent_id": "t3_ftihq1",
            "score": 0,
            "created_utc": 1585816888.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "fm790qt",
                    "parent_id": "t1_fm789du",
                    "score": 0,
                    "created_utc": 1585817724.0,
                    "replies": [
                        {
                            "body": "Sperm*\n\nDon't insult the legend! 😉🤣",
                            "author": "BigBearSD",
                            "id": "fm7ane4",
                            "parent_id": "t1_fm790qt",
                            "score": 2,
                            "created_utc": 1585819573.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "There are sites where POT SDs go to find POT SBs, and there are sites that are used primarily for vanilla dating where POT SBs are very likely to encounter people who don't understand sugar dating and don't know what \"generous\" is a code word for.    I'm sure it's possible to find men on there who don't know what sugar is but are interested, but I really don't see the point unless you've already messaged every possible SD on SA.",
            "author": "UseTheForceRey",
            "id": "fm85e36",
            "parent_id": "t3_ftihq1",
            "score": 0,
            "created_utc": 1585843127.0,
            "replies": [
                {
                    "body": "It’s been helpful and beneficial to me, which is why I made this post.",
                    "author": null,
                    "id": "fm85i58",
                    "parent_id": "t1_fm85e36",
                    "score": 3,
                    "created_utc": 1585843188.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "fm78vzu",
            "parent_id": "t3_ftihq1",
            "score": -2,
            "created_utc": 1585817576.0,
            "replies": [
                {
                    "body": "> Salt Daddy? \n\nImagine going on a site where almost no one is looking for sugar and finding a salt daddy....",
                    "author": "UseTheForceRey",
                    "id": "fm85lhl",
                    "parent_id": "t1_fm78vzu",
                    "score": 1,
                    "created_utc": 1585843237.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Oh the irony of complaining about guys reporting girls just for trying to get Instagram followers, when you’re using a vanilla dating app to find a sugar daddy 😂",
            "author": null,
            "id": "fm8emdf",
            "parent_id": "t3_ftihq1",
            "score": -2,
            "created_utc": 1585848014.0,
            "replies": [
                {
                    "body": "It’s not a vanilla dating app... It’s a dating app, and because most people date vanilla it’s mostly vanilla. Sugar dating doesn’t go against any rule.",
                    "author": null,
                    "id": "fm8ewr1",
                    "parent_id": "t1_fm8emdf",
                    "score": 5,
                    "created_utc": 1585848166.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "From Tinder's T&C: \n\n>You agree that you will not provide your financial information (for example, your credit card or bank account information), or wire or *otherwise send money*, to other users.\n\n...\n\n>By using the Service, you agree that you will not: . . . spam, *solicit money from* or defraud any users. (emphasis added)\n\nSo, yes, Tinder T&C expressly prohibits sugar dating. At least allowance based sugar dating.",
            "author": "This_is_Not_My_Handl",
            "id": "fm90wb8",
            "parent_id": "t3_ftihq1",
            "score": -1,
            "created_utc": 1585859621.0,
            "replies": [
                {
                    "body": "*Send money* =\\= eventually provide money to someone you’ve met, especially in this case where it’s clearly about sending without meeting (give cc/bank information, wire or otherwise send money).\n\n*Solicit money* that would mean asking the users for money, that’s not the case. This is using tinder to meet potential SDs for a M&G. If we don’t have chemistry we never see each other again and that’s the end of the story. \n\nPersonally I rarely ever discuss the terms of the arrangement, especially when we meet free-styling or on Tinder. I say what I like: the type of lifestyle, gifts, and I mention financial support. I and figure out what I get when we start dating (of course that’s riskier and it requires more screening and patience). Because of my tinder profile and the men I choose to meet, it has worked for me so far. I mentioned experience sugar too, that’s because in some cases I don’t even mention “financial support”. Sometimes experience sugar works better with the dynamic we have and it’s still worth it imo.\n\nI think it’s actually one of the reasons I like Tinder so much, arrangements aren’t so formal (I give you X so you give me Y) and it feels a lot more like regular dating and less like a work obligation.",
                    "author": null,
                    "id": "fma2vmd",
                    "parent_id": "t1_fm90wb8",
                    "score": 6,
                    "created_utc": 1585882468.0,
                    "replies": [
                        {
                            "body": ">where it’s clearly about sending without meeting\n\nIs that what the words say? I don't recall reading \"until after you've met in real life\" provision you are describing. Could you quote that bit for me?\n\n>that would mean asking the users for money\n\nIf you *never* ask the user for money, I suppose that's fine. Again, the prohibition isn't soliciting money from users \"before meeting\". If that was what they wanted to write, their lawyers are almost certainly good enough to write that. It's against soliciting money from users *at all*.",
                            "author": "This_is_Not_My_Handl",
                            "id": "fma53jc",
                            "parent_id": "t1_fma2vmd",
                            "score": 1,
                            "created_utc": 1585884048.0,
                            "replies": [
                                {
                                    "body": "“Send”",
                                    "author": null,
                                    "id": "fma55i1",
                                    "parent_id": "t1_fma53jc",
                                    "score": 2,
                                    "created_utc": 1585884088.0,
                                    "replies": [
                                        {
                                            "body": "? \"Send\" is a present and future tense verb. I'm not sure how just the word \"send\" makes your case.",
                                            "author": "This_is_Not_My_Handl",
                                            "id": "fma5eia",
                                            "parent_id": "t1_fma55i1",
                                            "score": 1,
                                            "created_utc": 1585884271.0,
                                            "replies": [
                                                {
                                                    "body": "If we meet and I hand you some cash, am I sending you money?",
                                                    "author": null,
                                                    "id": "fma5i0s",
                                                    "parent_id": "t1_fma5eia",
                                                    "score": 3,
                                                    "created_utc": 1585884341.0,
                                                    "replies": [
                                                        {
                                                            "body": "Interesting question. Can I send an email to someone standing in front of me? Why would cash be different? But if your position is, all other things being equal,  cash transactions don't violate the T&C and sending Venmo does, that's's an interesting take.",
                                                            "author": "This_is_Not_My_Handl",
                                                            "id": "fma605z",
                                                            "parent_id": "t1_fma5i0s",
                                                            "score": 1,
                                                            "created_utc": 1585884708.0,
                                                            "replies": [
                                                                {
                                                                    "body": "You can send an email but if you tell them in person, it’s no longer sending. My position is simply that what I’m doing doesn’t violate the terms. I read them and re-read them, in English and in my native language too to be sure.",
                                                                    "author": null,
                                                                    "id": "fma68g4",
                                                                    "parent_id": "t1_fma605z",
                                                                    "score": 2,
                                                                    "created_utc": 1585884880.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "Well, I'm a lawyer and I read them as prohibiting sugar. But if you don't get banned, you don't get banned 🤷‍♂️",
                                                                            "author": "This_is_Not_My_Handl",
                                                                            "id": "fma6fkm",
                                                                            "parent_id": "t1_fma68g4",
                                                                            "score": 1,
                                                                            "created_utc": 1585885027.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "Interesting! I’m sure that some things go against the rules, such as asking for a M&G fee, asking for ppm (also not allowed on SA), and surely others. \n\nUnfortunately all you need in order to get banned on tinder is for enough people to press “report”, they don’t investigate. People in my location don’t care but I’ve traveled to other places and was reported several times in the same area.",
                                                                                    "author": null,
                                                                                    "id": "fma7kde",
                                                                                    "parent_id": "t1_fma6fkm",
                                                                                    "score": 1,
                                                                                    "created_utc": 1585885875.0,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "So Tindr or SA are the best 2 platforms??😜",
            "author": null,
            "id": "fm7ra6f",
            "parent_id": "t3_ftihq1",
            "score": 0,
            "created_utc": 1585835049.0,
            "replies": []
        },
        {
            "body": "This is akin to PUAs using SA to find hookups.",
            "author": "geekxp",
            "id": "fm9h6em",
            "parent_id": "t3_ftihq1",
            "score": -2,
            "created_utc": 1585868656.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "fm7s0mv",
            "parent_id": "t1_fm7jlhr",
            "score": 14,
            "created_utc": 1585835515.0,
            "replies": [
                {
                    "body": "💀💀💀",
                    "author": "LikeHoney99",
                    "id": "fm862kg",
                    "parent_id": "t1_fm7s0mv",
                    "score": 0,
                    "created_utc": 1585843489.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[removed]",
            "author": null,
            "id": "fm7jv11",
            "parent_id": "t1_fm7jlhr",
            "score": 13,
            "created_utc": 1585829426.0,
            "replies": [
                {
                    "body": "You build your net worth by investing in stocks, bonds, real estate. The same logic applies. It's my opinion and opinions are like assholes everyone has one😂😂😂",
                    "author": "slimfitexec",
                    "id": "fm7k16j",
                    "parent_id": "t1_fm7jv11",
                    "score": -1,
                    "created_utc": 1585829578.0,
                    "replies": [
                        {
                            "body": "\"In order to be successful in sugar dating, you have to use multiple platforms\" is not an opinion.   It is a inaccurate statement of something you believe to be a fact.",
                            "author": "UseTheForceRey",
                            "id": "fm84ft7",
                            "parent_id": "t1_fm7k16j",
                            "score": 14,
                            "created_utc": 1585842617.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "agree",
            "author": "_mimi97",
            "id": "fm979fw",
            "parent_id": "t1_fm8c4ln",
            "score": 1,
            "created_utc": 1585863053.0,
            "replies": []
        },
        {
            "body": "Is it easy to tell by reading your bio and looking at your pictures that you are looking for a SB? On tinder I assume most people aren’t into sugar dating and swipe left unless there is a hint in their profile, so that might be it.",
            "author": null,
            "id": "fm849v2",
            "parent_id": "t1_fm7t1kp",
            "score": 5,
            "created_utc": 1585842529.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "fm86z7e",
                    "parent_id": "t1_fm849v2",
                    "score": 2,
                    "created_utc": 1585843978.0,
                    "replies": [
                        {
                            "body": "Strange! Maybe it has something to do with your location.",
                            "author": null,
                            "id": "fm875zf",
                            "parent_id": "t1_fm86z7e",
                            "score": 3,
                            "created_utc": 1585844076.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "fm970yg",
                                    "parent_id": "t1_fm875zf",
                                    "score": 3,
                                    "created_utc": 1585862925.0,
                                    "replies": [
                                        {
                                            "body": "Will it work if I post a bikini shot with no head? Or does tinder require faces?",
                                            "author": "testing1to3",
                                            "id": "fsxtvx6",
                                            "parent_id": "t1_fm970yg",
                                            "score": 1,
                                            "created_utc": 1591331251.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I use it too, I’m not limiting myself to just Tinder. Best to use multiple platforms.",
            "author": null,
            "id": "fm7ggfn",
            "parent_id": "t1_fm7aly6",
            "score": 6,
            "created_utc": 1585826098.0,
            "replies": []
        },
        {
            "body": "I get that, ideally it would be so much better to be able to write “looking for a sugar relationship” on your bio but in some locations that profile won’t last more than a day, even though there is no real reason to report this based on the terms of use.",
            "author": null,
            "id": "fm8ielv",
            "parent_id": "t1_fm8hi7e",
            "score": 3,
            "created_utc": 1585849952.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "fm8jaap",
                    "parent_id": "t1_fm8ielv",
                    "score": 4,
                    "created_utc": 1585850398.0,
                    "replies": [
                        {
                            "body": "It just opens up new opportunities... I met people on Tinder who weren’t on SA. I also saw SA people on Tinder, recognized their pictures. Tinder is easy to download and everyone knows the app whereas SA is niche. I don’t see the harm in being on both. \n\nI agree with what you’re saying about being clear, and that why in my post I talk about what I put in my bio and pictures (usually they get what I’m about, at least experience sugar) and I recommend to move to another platform ASAP and talk about sugar dating there. There’s no point even for a SB in wasting time talking to someone who isn’t on the same page.",
                            "author": null,
                            "id": "fm8kfso",
                            "parent_id": "t1_fm8jaap",
                            "score": 5,
                            "created_utc": 1585850996.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Then swipe left? I see profiles I find annoying all the time on tinder, it’s never occurred to me to report anyone. You’re wasting more time by reporting than by just moving on",
            "author": null,
            "id": "fm7ic6w",
            "parent_id": "t1_fm7i93i",
            "score": 19,
            "created_utc": 1585828017.0,
            "replies": [
                {
                    "body": "I know Ranger seems pretty annoyed and, at first, I was skeptical but then I looked into it and he's right.\n\n[https://www.gq-magazine.co.uk/lifestyle/article/why-do-people-on-tinder-list-their-instagram](https://www.gq-magazine.co.uk/lifestyle/article/why-do-people-on-tinder-list-their-instagram)\n\nEliminate Instagram from Tinder and you will clean it up a lot.  You can always give someone your Instagram once you take your conversation off the the app.\n\nTinder would easily weed out people on there just looking for Instagram followers or those who want to rope you in one step more to some onlyfans kind of paysite.",
                    "author": "soicansaywhatiwant",
                    "id": "fma2v22",
                    "parent_id": "t1_fm7ic6w",
                    "score": 2,
                    "created_utc": 1585882457.0,
                    "replies": [
                        {
                            "body": "I’m aware that some people (not just women) use tinder for Instagram followers, that doesn’t mean that any profile that lists their ig handle is using tinder just for Instagram followers. Assuming that is a stretch, and considering you don’t even know that person’s intentions, taking action to report any profile with their handle doesn’t make any sense to me. There are lots of other reasons for which you’d want to list your Instagram account. \n\nFor instance I list an IG for men to be able check my pictures and possibly reach out there if I don’t swipe on them (I’m not always on tinder and don’t swipe for too long, so I might not see their profile for days). It’s not even my main account, it’s a separate one only for dating apps with <15 pictures so I really couldn’t care less care about the number of followers...",
                            "author": null,
                            "id": "fma43y9",
                            "parent_id": "t1_fma2v22",
                            "score": 2,
                            "created_utc": 1585883336.0,
                            "replies": [
                                {
                                    "body": "All good points.  That being said, I would never track anyone down and reach out on Instagram if they didn't swipe right on me.  It strikes me as creepy and desperate.    The entire relationship would get off on the wrong footing.  I would venture to guess a lot of successful people my age feel the same way.\n\nWhen I have an account on Tinder I pay for Gold so I can see ahead of time who swiped right on me and then choose to swipe right on them if I'm intrigued.  Cuts out the endless swiping and narrows things down quite nicely.",
                                    "author": "soicansaywhatiwant",
                                    "id": "fmdff78",
                                    "parent_id": "t1_fma43y9",
                                    "score": 2,
                                    "created_utc": 1585966452.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "[removed]",
                    "author": null,
                    "id": "fm7ifcw",
                    "parent_id": "t1_fm7ic6w",
                    "score": 8,
                    "created_utc": 1585828101.0,
                    "replies": [
                        {
                            "body": "Could be, could be just a lazy bio. There are many empty bios on tinder and IG is an easy way to see what someone is about. \n\nI still don’t get why you’d decide it’s a girl looking for followers and choose to spend time reporting if there isn’t some resentment.",
                            "author": null,
                            "id": "fm7inmq",
                            "parent_id": "t1_fm7ifcw",
                            "score": 9,
                            "created_utc": 1585828317.0,
                            "replies": [
                                {
                                    "body": "[removed]",
                                    "author": null,
                                    "id": "fm7j2s8",
                                    "parent_id": "t1_fm7inmq",
                                    "score": 0,
                                    "created_utc": 1585828712.0,
                                    "replies": [
                                        {
                                            "body": "Check your tone.",
                                            "author": null,
                                            "id": "fm7j4nc",
                                            "parent_id": "t1_fm7j2s8",
                                            "score": 4,
                                            "created_utc": 1585828760.0,
                                            "replies": [
                                                {
                                                    "body": "“Your inside voice is gonna put your ass outside.” \n Leonard Washington",
                                                    "author": "Smitty0808",
                                                    "id": "fm7kgoi",
                                                    "parent_id": "t1_fm7j4nc",
                                                    "score": 8,
                                                    "created_utc": 1585829951.0,
                                                    "replies": []
                                                },
                                                {
                                                    "body": "Anna Oop",
                                                    "author": "LaNouvelleSugar",
                                                    "id": "fmlftm1",
                                                    "parent_id": "t1_fm7j4nc",
                                                    "score": 2,
                                                    "created_utc": 1586185560.0,
                                                    "replies": []
                                                },
                                                {
                                                    "body": "[removed]",
                                                    "author": null,
                                                    "id": "fm7jabk",
                                                    "parent_id": "t1_fm7j4nc",
                                                    "score": -2,
                                                    "created_utc": 1585828903.0,
                                                    "replies": [
                                                        {
                                                            "body": "You *are* being kinda rude, dude.",
                                                            "author": "LikeHoney99",
                                                            "id": "fm866j0",
                                                            "parent_id": "t1_fm7jabk",
                                                            "score": 8,
                                                            "created_utc": 1585843549.0,
                                                            "replies": [
                                                                {
                                                                    "body": "[removed]",
                                                                    "author": null,
                                                                    "id": "fm87gmz",
                                                                    "parent_id": "t1_fm866j0",
                                                                    "score": -4,
                                                                    "created_utc": 1585844231.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "I mean...I could as easily say you’re projecting.",
                                                                            "author": "LikeHoney99",
                                                                            "id": "fm8877j",
                                                                            "parent_id": "t1_fm87gmz",
                                                                            "score": 10,
                                                                            "created_utc": 1585844618.0,
                                                                            "replies": []
                                                                        },
                                                                        {
                                                                            "body": "[deleted]",
                                                                            "author": null,
                                                                            "id": "fm88pu5",
                                                                            "parent_id": "t1_fm87gmz",
                                                                            "score": 7,
                                                                            "created_utc": 1585844891.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "[removed]",
                                                                                    "author": null,
                                                                                    "id": "fm8a5cx",
                                                                                    "parent_id": "t1_fm88pu5",
                                                                                    "score": -2,
                                                                                    "created_utc": 1585845645.0,
                                                                                    "replies": [
                                                                                        {
                                                                                            "body": "[deleted]",
                                                                                            "author": null,
                                                                                            "id": "fm8aehu",
                                                                                            "parent_id": "t1_fm8a5cx",
                                                                                            "score": 6,
                                                                                            "created_utc": 1585845776.0,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "body": "Exactly!",
                                                                                                    "author": "LikeHoney99",
                                                                                                    "id": "fm8bfj1",
                                                                                                    "parent_id": "t1_fm8aehu",
                                                                                                    "score": 2,
                                                                                                    "created_utc": 1585846315.0,
                                                                                                    "replies": []
                                                                                                }
                                                                                            ]
                                                                                        },
                                                                                        {
                                                                                            "body": "I don’t even HAVE IG.....doesn’t make me any less irritated by your attitude 😉",
                                                                                            "author": "LikeHoney99",
                                                                                            "id": "fm8ggth",
                                                                                            "parent_id": "t1_fm8a5cx",
                                                                                            "score": 6,
                                                                                            "created_utc": 1585848960.0,
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "body": "I’m no longer interacting with SDs here who are just here to contradict and are rude on top of that. It’s a waste of time and energy. \n\nI’m not against a healthy discussion and that’s just not it. I wrote a long and detailed post for SBs trying to be as helpful as I could. You picked up on one line that didn’t sit right with you and are now being borderline disrespectful in the way you address me. \n\nYou’re a grown man and you should know better. I’m not replying here any more.",
                                                            "author": null,
                                                            "id": "fm7jrpr",
                                                            "parent_id": "t1_fm7jabk",
                                                            "score": 10,
                                                            "created_utc": 1585829344.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "body": "Are they paying you to do this ?🙄",
                                            "author": "LaNouvelleSugar",
                                            "id": "fmlfwms",
                                            "parent_id": "t1_fm7j2s8",
                                            "score": 2,
                                            "created_utc": 1586185608.0,
                                            "replies": [
                                                {
                                                    "body": "[removed]",
                                                    "author": null,
                                                    "id": "fmliiv5",
                                                    "parent_id": "t1_fmlfwms",
                                                    "score": 1,
                                                    "created_utc": 1586187100.0,
                                                    "replies": [
                                                        {
                                                            "body": "Yeah...you definitely sound spiteful and bitter. That’s not cool dude. Stay safe !",
                                                            "author": "LaNouvelleSugar",
                                                            "id": "fmliu50",
                                                            "parent_id": "t1_fmliiv5",
                                                            "score": 2,
                                                            "created_utc": 1586187274.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "You can create a Tinder profile with a new number, just use Google Voice if you’re in the US or Hushed elsewhere 😊  \nI never got banned in some locations and in others I got banned twice in a week. It really depends on the local culture and dating scene I guess.",
            "author": null,
            "id": "fm8ota4",
            "parent_id": "t1_fm8nug6",
            "score": 1,
            "created_utc": 1585853262.0,
            "replies": [
                {
                    "body": "Nope. I swear they use facial recognition software... I’ve tried diff phone numbers, etc no luck",
                    "author": "urbanhippy123",
                    "id": "fm8owus",
                    "parent_id": "t1_fm8ota4",
                    "score": 5,
                    "created_utc": 1585853313.0,
                    "replies": [
                        {
                            "body": "That’s insane! Never heard that before, it sucks.",
                            "author": null,
                            "id": "fm8p6bh",
                            "parent_id": "t1_fm8owus",
                            "score": 1,
                            "created_utc": 1585853450.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "SA is meant for sugar dating only. Tinder is meant for dating, broad sense. No hypocrisy, and I’m seriously tired of the lack of basic respect from SDs here in the way they speak.",
            "author": null,
            "id": "fm8333q",
            "parent_id": "t1_fm7dp25",
            "score": 12,
            "created_utc": 1585841888.0,
            "replies": [
                {
                    "body": "This is akin to PUAs using SA to find hookups. \n\nSoliciting money for arrangement / dating is against Tinder’s policies, which is why they ban your account. On the contrary, SA can be used for any type of dating, they promote it as a platform for dating successful or attractive people. Even SA is against PPM allowance, they can ban you for it.",
                    "author": "geekxp",
                    "id": "fm9knl4",
                    "parent_id": "t1_fm8333q",
                    "score": 0,
                    "created_utc": 1585870686.0,
                    "replies": []
                },
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "fm84e94",
                    "parent_id": "t1_fm8333q",
                    "score": -3,
                    "created_utc": 1585842594.0,
                    "replies": [
                        {
                            "body": "Well on here it is given. Rule number 1 of SLF\n\n>be respectful to other posters.\n\nYou can disagree and that’s fine, it’s your opinion. The fact is that nowhere on tinder terms of use does it say that the app is intended for one type of dating only, and sugar dating is not against the rules. Most people are into vanilla dating so it’s mostly vanilla.",
                            "author": null,
                            "id": "fm84ri7",
                            "parent_id": "t1_fm84e94",
                            "score": 8,
                            "created_utc": 1585842792.0,
                            "replies": [
                                {
                                    "body": "Nowhere on SA does it say that you have to pay for companionship... they actually say no ppm talk!",
                                    "author": "BigBearSD",
                                    "id": "fm84ugs",
                                    "parent_id": "t1_fm84ri7",
                                    "score": -2,
                                    "created_utc": 1585842836.0,
                                    "replies": [
                                        {
                                            "body": "Seeking **arrangement**, number one **Sugar daddy / sugar baby** website. \n\nWhen you sign up you have to mention if you are a **sugar daddy, sugar momma** or **sugar baby**. I don’t know how much clearer it can be.",
                                            "author": null,
                                            "id": "fm8512g",
                                            "parent_id": "t1_fm84ugs",
                                            "score": 5,
                                            "created_utc": 1585842934.0,
                                            "replies": [
                                                {
                                                    "body": "[deleted]",
                                                    "author": null,
                                                    "id": "fm8oty6",
                                                    "parent_id": "t1_fm8512g",
                                                    "score": 1,
                                                    "created_utc": 1585853271.0,
                                                    "replies": [
                                                        {
                                                            "body": "I’m a fool then... What is sugar dating if it’s not a form of dating?",
                                                            "author": null,
                                                            "id": "fm8ozmt",
                                                            "parent_id": "t1_fm8oty6",
                                                            "score": 2,
                                                            "created_utc": 1585853354.0,
                                                            "replies": [
                                                                {
                                                                    "body": "[deleted]",
                                                                    "author": null,
                                                                    "id": "fm8q5tq",
                                                                    "parent_id": "t1_fm8ozmt",
                                                                    "score": 0,
                                                                    "created_utc": 1585853957.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "Sugar dating is a form of dating to me, therefore I think it’s perfectly fine to look for a SD on a dating app. But what do I know, I’m a fool who has never been on a date.",
                                                                            "author": null,
                                                                            "id": "fm8rt62",
                                                                            "parent_id": "t1_fm8q5tq",
                                                                            "score": 4,
                                                                            "created_utc": 1585854827.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "[deleted]",
                                                                                    "author": null,
                                                                                    "id": "fm8u46k",
                                                                                    "parent_id": "t1_fm8rt62",
                                                                                    "score": 0,
                                                                                    "created_utc": 1585856060.0,
                                                                                    "replies": [
                                                                                        {
                                                                                            "body": "> I am not saying it doesn't work; just that Tinder is not meant for arrangements, it is obviously not allowed and you are rightfully reported when it happens because you are wrong\n\n\nBeing banned just means that some tinder users decide they don’t want arrangements on the app and they report. That doesn’t mean that it’s not allowed. Tinder doesn’t investigate anything. I don’t know how many times I have to repeat that sugar dating doesn’t go against any Tinder rule. \n\nIn my part of the world you’re more likely to get banned if you’re a transgender person than a sugar baby. Doesn’t mean that being trans is against any tinder rule",
                                                                                            "author": null,
                                                                                            "id": "fm8ushj",
                                                                                            "parent_id": "t1_fm8u46k",
                                                                                            "score": 3,
                                                                                            "created_utc": 1585856418.0,
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "fm790qt",
            "parent_id": "t1_fm789du",
            "score": 0,
            "created_utc": 1585817724.0,
            "replies": [
                {
                    "body": "Sperm*\n\nDon't insult the legend! 😉🤣",
                    "author": "BigBearSD",
                    "id": "fm7ane4",
                    "parent_id": "t1_fm790qt",
                    "score": 2,
                    "created_utc": 1585819573.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "It’s been helpful and beneficial to me, which is why I made this post.",
            "author": null,
            "id": "fm85i58",
            "parent_id": "t1_fm85e36",
            "score": 3,
            "created_utc": 1585843188.0,
            "replies": []
        },
        {
            "body": "> Salt Daddy? \n\nImagine going on a site where almost no one is looking for sugar and finding a salt daddy....",
            "author": "UseTheForceRey",
            "id": "fm85lhl",
            "parent_id": "t1_fm78vzu",
            "score": 1,
            "created_utc": 1585843237.0,
            "replies": []
        },
        {
            "body": "It’s not a vanilla dating app... It’s a dating app, and because most people date vanilla it’s mostly vanilla. Sugar dating doesn’t go against any rule.",
            "author": null,
            "id": "fm8ewr1",
            "parent_id": "t1_fm8emdf",
            "score": 5,
            "created_utc": 1585848166.0,
            "replies": []
        },
        {
            "body": "*Send money* =\\= eventually provide money to someone you’ve met, especially in this case where it’s clearly about sending without meeting (give cc/bank information, wire or otherwise send money).\n\n*Solicit money* that would mean asking the users for money, that’s not the case. This is using tinder to meet potential SDs for a M&G. If we don’t have chemistry we never see each other again and that’s the end of the story. \n\nPersonally I rarely ever discuss the terms of the arrangement, especially when we meet free-styling or on Tinder. I say what I like: the type of lifestyle, gifts, and I mention financial support. I and figure out what I get when we start dating (of course that’s riskier and it requires more screening and patience). Because of my tinder profile and the men I choose to meet, it has worked for me so far. I mentioned experience sugar too, that’s because in some cases I don’t even mention “financial support”. Sometimes experience sugar works better with the dynamic we have and it’s still worth it imo.\n\nI think it’s actually one of the reasons I like Tinder so much, arrangements aren’t so formal (I give you X so you give me Y) and it feels a lot more like regular dating and less like a work obligation.",
            "author": null,
            "id": "fma2vmd",
            "parent_id": "t1_fm90wb8",
            "score": 6,
            "created_utc": 1585882468.0,
            "replies": [
                {
                    "body": ">where it’s clearly about sending without meeting\n\nIs that what the words say? I don't recall reading \"until after you've met in real life\" provision you are describing. Could you quote that bit for me?\n\n>that would mean asking the users for money\n\nIf you *never* ask the user for money, I suppose that's fine. Again, the prohibition isn't soliciting money from users \"before meeting\". If that was what they wanted to write, their lawyers are almost certainly good enough to write that. It's against soliciting money from users *at all*.",
                    "author": "This_is_Not_My_Handl",
                    "id": "fma53jc",
                    "parent_id": "t1_fma2vmd",
                    "score": 1,
                    "created_utc": 1585884048.0,
                    "replies": [
                        {
                            "body": "“Send”",
                            "author": null,
                            "id": "fma55i1",
                            "parent_id": "t1_fma53jc",
                            "score": 2,
                            "created_utc": 1585884088.0,
                            "replies": [
                                {
                                    "body": "? \"Send\" is a present and future tense verb. I'm not sure how just the word \"send\" makes your case.",
                                    "author": "This_is_Not_My_Handl",
                                    "id": "fma5eia",
                                    "parent_id": "t1_fma55i1",
                                    "score": 1,
                                    "created_utc": 1585884271.0,
                                    "replies": [
                                        {
                                            "body": "If we meet and I hand you some cash, am I sending you money?",
                                            "author": null,
                                            "id": "fma5i0s",
                                            "parent_id": "t1_fma5eia",
                                            "score": 3,
                                            "created_utc": 1585884341.0,
                                            "replies": [
                                                {
                                                    "body": "Interesting question. Can I send an email to someone standing in front of me? Why would cash be different? But if your position is, all other things being equal,  cash transactions don't violate the T&C and sending Venmo does, that's's an interesting take.",
                                                    "author": "This_is_Not_My_Handl",
                                                    "id": "fma605z",
                                                    "parent_id": "t1_fma5i0s",
                                                    "score": 1,
                                                    "created_utc": 1585884708.0,
                                                    "replies": [
                                                        {
                                                            "body": "You can send an email but if you tell them in person, it’s no longer sending. My position is simply that what I’m doing doesn’t violate the terms. I read them and re-read them, in English and in my native language too to be sure.",
                                                            "author": null,
                                                            "id": "fma68g4",
                                                            "parent_id": "t1_fma605z",
                                                            "score": 2,
                                                            "created_utc": 1585884880.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Well, I'm a lawyer and I read them as prohibiting sugar. But if you don't get banned, you don't get banned 🤷‍♂️",
                                                                    "author": "This_is_Not_My_Handl",
                                                                    "id": "fma6fkm",
                                                                    "parent_id": "t1_fma68g4",
                                                                    "score": 1,
                                                                    "created_utc": 1585885027.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "Interesting! I’m sure that some things go against the rules, such as asking for a M&G fee, asking for ppm (also not allowed on SA), and surely others. \n\nUnfortunately all you need in order to get banned on tinder is for enough people to press “report”, they don’t investigate. People in my location don’t care but I’ve traveled to other places and was reported several times in the same area.",
                                                                            "author": null,
                                                                            "id": "fma7kde",
                                                                            "parent_id": "t1_fma6fkm",
                                                                            "score": 1,
                                                                            "created_utc": 1585885875.0,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "💀💀💀",
            "author": "LikeHoney99",
            "id": "fm862kg",
            "parent_id": "t1_fm7s0mv",
            "score": 0,
            "created_utc": 1585843489.0,
            "replies": []
        },
        {
            "body": "You build your net worth by investing in stocks, bonds, real estate. The same logic applies. It's my opinion and opinions are like assholes everyone has one😂😂😂",
            "author": "slimfitexec",
            "id": "fm7k16j",
            "parent_id": "t1_fm7jv11",
            "score": -1,
            "created_utc": 1585829578.0,
            "replies": [
                {
                    "body": "\"In order to be successful in sugar dating, you have to use multiple platforms\" is not an opinion.   It is a inaccurate statement of something you believe to be a fact.",
                    "author": "UseTheForceRey",
                    "id": "fm84ft7",
                    "parent_id": "t1_fm7k16j",
                    "score": 14,
                    "created_utc": 1585842617.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "fm86z7e",
            "parent_id": "t1_fm849v2",
            "score": 2,
            "created_utc": 1585843978.0,
            "replies": [
                {
                    "body": "Strange! Maybe it has something to do with your location.",
                    "author": null,
                    "id": "fm875zf",
                    "parent_id": "t1_fm86z7e",
                    "score": 3,
                    "created_utc": 1585844076.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "fm970yg",
                            "parent_id": "t1_fm875zf",
                            "score": 3,
                            "created_utc": 1585862925.0,
                            "replies": [
                                {
                                    "body": "Will it work if I post a bikini shot with no head? Or does tinder require faces?",
                                    "author": "testing1to3",
                                    "id": "fsxtvx6",
                                    "parent_id": "t1_fm970yg",
                                    "score": 1,
                                    "created_utc": 1591331251.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "fm8jaap",
            "parent_id": "t1_fm8ielv",
            "score": 4,
            "created_utc": 1585850398.0,
            "replies": [
                {
                    "body": "It just opens up new opportunities... I met people on Tinder who weren’t on SA. I also saw SA people on Tinder, recognized their pictures. Tinder is easy to download and everyone knows the app whereas SA is niche. I don’t see the harm in being on both. \n\nI agree with what you’re saying about being clear, and that why in my post I talk about what I put in my bio and pictures (usually they get what I’m about, at least experience sugar) and I recommend to move to another platform ASAP and talk about sugar dating there. There’s no point even for a SB in wasting time talking to someone who isn’t on the same page.",
                    "author": null,
                    "id": "fm8kfso",
                    "parent_id": "t1_fm8jaap",
                    "score": 5,
                    "created_utc": 1585850996.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I know Ranger seems pretty annoyed and, at first, I was skeptical but then I looked into it and he's right.\n\n[https://www.gq-magazine.co.uk/lifestyle/article/why-do-people-on-tinder-list-their-instagram](https://www.gq-magazine.co.uk/lifestyle/article/why-do-people-on-tinder-list-their-instagram)\n\nEliminate Instagram from Tinder and you will clean it up a lot.  You can always give someone your Instagram once you take your conversation off the the app.\n\nTinder would easily weed out people on there just looking for Instagram followers or those who want to rope you in one step more to some onlyfans kind of paysite.",
            "author": "soicansaywhatiwant",
            "id": "fma2v22",
            "parent_id": "t1_fm7ic6w",
            "score": 2,
            "created_utc": 1585882457.0,
            "replies": [
                {
                    "body": "I’m aware that some people (not just women) use tinder for Instagram followers, that doesn’t mean that any profile that lists their ig handle is using tinder just for Instagram followers. Assuming that is a stretch, and considering you don’t even know that person’s intentions, taking action to report any profile with their handle doesn’t make any sense to me. There are lots of other reasons for which you’d want to list your Instagram account. \n\nFor instance I list an IG for men to be able check my pictures and possibly reach out there if I don’t swipe on them (I’m not always on tinder and don’t swipe for too long, so I might not see their profile for days). It’s not even my main account, it’s a separate one only for dating apps with <15 pictures so I really couldn’t care less care about the number of followers...",
                    "author": null,
                    "id": "fma43y9",
                    "parent_id": "t1_fma2v22",
                    "score": 2,
                    "created_utc": 1585883336.0,
                    "replies": [
                        {
                            "body": "All good points.  That being said, I would never track anyone down and reach out on Instagram if they didn't swipe right on me.  It strikes me as creepy and desperate.    The entire relationship would get off on the wrong footing.  I would venture to guess a lot of successful people my age feel the same way.\n\nWhen I have an account on Tinder I pay for Gold so I can see ahead of time who swiped right on me and then choose to swipe right on them if I'm intrigued.  Cuts out the endless swiping and narrows things down quite nicely.",
                            "author": "soicansaywhatiwant",
                            "id": "fmdff78",
                            "parent_id": "t1_fma43y9",
                            "score": 2,
                            "created_utc": 1585966452.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "[removed]",
            "author": null,
            "id": "fm7ifcw",
            "parent_id": "t1_fm7ic6w",
            "score": 8,
            "created_utc": 1585828101.0,
            "replies": [
                {
                    "body": "Could be, could be just a lazy bio. There are many empty bios on tinder and IG is an easy way to see what someone is about. \n\nI still don’t get why you’d decide it’s a girl looking for followers and choose to spend time reporting if there isn’t some resentment.",
                    "author": null,
                    "id": "fm7inmq",
                    "parent_id": "t1_fm7ifcw",
                    "score": 9,
                    "created_utc": 1585828317.0,
                    "replies": [
                        {
                            "body": "[removed]",
                            "author": null,
                            "id": "fm7j2s8",
                            "parent_id": "t1_fm7inmq",
                            "score": 0,
                            "created_utc": 1585828712.0,
                            "replies": [
                                {
                                    "body": "Check your tone.",
                                    "author": null,
                                    "id": "fm7j4nc",
                                    "parent_id": "t1_fm7j2s8",
                                    "score": 4,
                                    "created_utc": 1585828760.0,
                                    "replies": [
                                        {
                                            "body": "“Your inside voice is gonna put your ass outside.” \n Leonard Washington",
                                            "author": "Smitty0808",
                                            "id": "fm7kgoi",
                                            "parent_id": "t1_fm7j4nc",
                                            "score": 8,
                                            "created_utc": 1585829951.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "Anna Oop",
                                            "author": "LaNouvelleSugar",
                                            "id": "fmlftm1",
                                            "parent_id": "t1_fm7j4nc",
                                            "score": 2,
                                            "created_utc": 1586185560.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "[removed]",
                                            "author": null,
                                            "id": "fm7jabk",
                                            "parent_id": "t1_fm7j4nc",
                                            "score": -2,
                                            "created_utc": 1585828903.0,
                                            "replies": [
                                                {
                                                    "body": "You *are* being kinda rude, dude.",
                                                    "author": "LikeHoney99",
                                                    "id": "fm866j0",
                                                    "parent_id": "t1_fm7jabk",
                                                    "score": 8,
                                                    "created_utc": 1585843549.0,
                                                    "replies": [
                                                        {
                                                            "body": "[removed]",
                                                            "author": null,
                                                            "id": "fm87gmz",
                                                            "parent_id": "t1_fm866j0",
                                                            "score": -4,
                                                            "created_utc": 1585844231.0,
                                                            "replies": [
                                                                {
                                                                    "body": "I mean...I could as easily say you’re projecting.",
                                                                    "author": "LikeHoney99",
                                                                    "id": "fm8877j",
                                                                    "parent_id": "t1_fm87gmz",
                                                                    "score": 10,
                                                                    "created_utc": 1585844618.0,
                                                                    "replies": []
                                                                },
                                                                {
                                                                    "body": "[deleted]",
                                                                    "author": null,
                                                                    "id": "fm88pu5",
                                                                    "parent_id": "t1_fm87gmz",
                                                                    "score": 7,
                                                                    "created_utc": 1585844891.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "[removed]",
                                                                            "author": null,
                                                                            "id": "fm8a5cx",
                                                                            "parent_id": "t1_fm88pu5",
                                                                            "score": -2,
                                                                            "created_utc": 1585845645.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "[deleted]",
                                                                                    "author": null,
                                                                                    "id": "fm8aehu",
                                                                                    "parent_id": "t1_fm8a5cx",
                                                                                    "score": 6,
                                                                                    "created_utc": 1585845776.0,
                                                                                    "replies": [
                                                                                        {
                                                                                            "body": "Exactly!",
                                                                                            "author": "LikeHoney99",
                                                                                            "id": "fm8bfj1",
                                                                                            "parent_id": "t1_fm8aehu",
                                                                                            "score": 2,
                                                                                            "created_utc": 1585846315.0,
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                },
                                                                                {
                                                                                    "body": "I don’t even HAVE IG.....doesn’t make me any less irritated by your attitude 😉",
                                                                                    "author": "LikeHoney99",
                                                                                    "id": "fm8ggth",
                                                                                    "parent_id": "t1_fm8a5cx",
                                                                                    "score": 6,
                                                                                    "created_utc": 1585848960.0,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "body": "I’m no longer interacting with SDs here who are just here to contradict and are rude on top of that. It’s a waste of time and energy. \n\nI’m not against a healthy discussion and that’s just not it. I wrote a long and detailed post for SBs trying to be as helpful as I could. You picked up on one line that didn’t sit right with you and are now being borderline disrespectful in the way you address me. \n\nYou’re a grown man and you should know better. I’m not replying here any more.",
                                                    "author": null,
                                                    "id": "fm7jrpr",
                                                    "parent_id": "t1_fm7jabk",
                                                    "score": 10,
                                                    "created_utc": 1585829344.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "Are they paying you to do this ?🙄",
                                    "author": "LaNouvelleSugar",
                                    "id": "fmlfwms",
                                    "parent_id": "t1_fm7j2s8",
                                    "score": 2,
                                    "created_utc": 1586185608.0,
                                    "replies": [
                                        {
                                            "body": "[removed]",
                                            "author": null,
                                            "id": "fmliiv5",
                                            "parent_id": "t1_fmlfwms",
                                            "score": 1,
                                            "created_utc": 1586187100.0,
                                            "replies": [
                                                {
                                                    "body": "Yeah...you definitely sound spiteful and bitter. That’s not cool dude. Stay safe !",
                                                    "author": "LaNouvelleSugar",
                                                    "id": "fmliu50",
                                                    "parent_id": "t1_fmliiv5",
                                                    "score": 2,
                                                    "created_utc": 1586187274.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Nope. I swear they use facial recognition software... I’ve tried diff phone numbers, etc no luck",
            "author": "urbanhippy123",
            "id": "fm8owus",
            "parent_id": "t1_fm8ota4",
            "score": 5,
            "created_utc": 1585853313.0,
            "replies": [
                {
                    "body": "That’s insane! Never heard that before, it sucks.",
                    "author": null,
                    "id": "fm8p6bh",
                    "parent_id": "t1_fm8owus",
                    "score": 1,
                    "created_utc": 1585853450.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "This is akin to PUAs using SA to find hookups. \n\nSoliciting money for arrangement / dating is against Tinder’s policies, which is why they ban your account. On the contrary, SA can be used for any type of dating, they promote it as a platform for dating successful or attractive people. Even SA is against PPM allowance, they can ban you for it.",
            "author": "geekxp",
            "id": "fm9knl4",
            "parent_id": "t1_fm8333q",
            "score": 0,
            "created_utc": 1585870686.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "fm84e94",
            "parent_id": "t1_fm8333q",
            "score": -3,
            "created_utc": 1585842594.0,
            "replies": [
                {
                    "body": "Well on here it is given. Rule number 1 of SLF\n\n>be respectful to other posters.\n\nYou can disagree and that’s fine, it’s your opinion. The fact is that nowhere on tinder terms of use does it say that the app is intended for one type of dating only, and sugar dating is not against the rules. Most people are into vanilla dating so it’s mostly vanilla.",
                    "author": null,
                    "id": "fm84ri7",
                    "parent_id": "t1_fm84e94",
                    "score": 8,
                    "created_utc": 1585842792.0,
                    "replies": [
                        {
                            "body": "Nowhere on SA does it say that you have to pay for companionship... they actually say no ppm talk!",
                            "author": "BigBearSD",
                            "id": "fm84ugs",
                            "parent_id": "t1_fm84ri7",
                            "score": -2,
                            "created_utc": 1585842836.0,
                            "replies": [
                                {
                                    "body": "Seeking **arrangement**, number one **Sugar daddy / sugar baby** website. \n\nWhen you sign up you have to mention if you are a **sugar daddy, sugar momma** or **sugar baby**. I don’t know how much clearer it can be.",
                                    "author": null,
                                    "id": "fm8512g",
                                    "parent_id": "t1_fm84ugs",
                                    "score": 5,
                                    "created_utc": 1585842934.0,
                                    "replies": [
                                        {
                                            "body": "[deleted]",
                                            "author": null,
                                            "id": "fm8oty6",
                                            "parent_id": "t1_fm8512g",
                                            "score": 1,
                                            "created_utc": 1585853271.0,
                                            "replies": [
                                                {
                                                    "body": "I’m a fool then... What is sugar dating if it’s not a form of dating?",
                                                    "author": null,
                                                    "id": "fm8ozmt",
                                                    "parent_id": "t1_fm8oty6",
                                                    "score": 2,
                                                    "created_utc": 1585853354.0,
                                                    "replies": [
                                                        {
                                                            "body": "[deleted]",
                                                            "author": null,
                                                            "id": "fm8q5tq",
                                                            "parent_id": "t1_fm8ozmt",
                                                            "score": 0,
                                                            "created_utc": 1585853957.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Sugar dating is a form of dating to me, therefore I think it’s perfectly fine to look for a SD on a dating app. But what do I know, I’m a fool who has never been on a date.",
                                                                    "author": null,
                                                                    "id": "fm8rt62",
                                                                    "parent_id": "t1_fm8q5tq",
                                                                    "score": 4,
                                                                    "created_utc": 1585854827.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "[deleted]",
                                                                            "author": null,
                                                                            "id": "fm8u46k",
                                                                            "parent_id": "t1_fm8rt62",
                                                                            "score": 0,
                                                                            "created_utc": 1585856060.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "> I am not saying it doesn't work; just that Tinder is not meant for arrangements, it is obviously not allowed and you are rightfully reported when it happens because you are wrong\n\n\nBeing banned just means that some tinder users decide they don’t want arrangements on the app and they report. That doesn’t mean that it’s not allowed. Tinder doesn’t investigate anything. I don’t know how many times I have to repeat that sugar dating doesn’t go against any Tinder rule. \n\nIn my part of the world you’re more likely to get banned if you’re a transgender person than a sugar baby. Doesn’t mean that being trans is against any tinder rule",
                                                                                    "author": null,
                                                                                    "id": "fm8ushj",
                                                                                    "parent_id": "t1_fm8u46k",
                                                                                    "score": 3,
                                                                                    "created_utc": 1585856418.0,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Sperm*\n\nDon't insult the legend! 😉🤣",
            "author": "BigBearSD",
            "id": "fm7ane4",
            "parent_id": "t1_fm790qt",
            "score": 2,
            "created_utc": 1585819573.0,
            "replies": []
        },
        {
            "body": ">where it’s clearly about sending without meeting\n\nIs that what the words say? I don't recall reading \"until after you've met in real life\" provision you are describing. Could you quote that bit for me?\n\n>that would mean asking the users for money\n\nIf you *never* ask the user for money, I suppose that's fine. Again, the prohibition isn't soliciting money from users \"before meeting\". If that was what they wanted to write, their lawyers are almost certainly good enough to write that. It's against soliciting money from users *at all*.",
            "author": "This_is_Not_My_Handl",
            "id": "fma53jc",
            "parent_id": "t1_fma2vmd",
            "score": 1,
            "created_utc": 1585884048.0,
            "replies": [
                {
                    "body": "“Send”",
                    "author": null,
                    "id": "fma55i1",
                    "parent_id": "t1_fma53jc",
                    "score": 2,
                    "created_utc": 1585884088.0,
                    "replies": [
                        {
                            "body": "? \"Send\" is a present and future tense verb. I'm not sure how just the word \"send\" makes your case.",
                            "author": "This_is_Not_My_Handl",
                            "id": "fma5eia",
                            "parent_id": "t1_fma55i1",
                            "score": 1,
                            "created_utc": 1585884271.0,
                            "replies": [
                                {
                                    "body": "If we meet and I hand you some cash, am I sending you money?",
                                    "author": null,
                                    "id": "fma5i0s",
                                    "parent_id": "t1_fma5eia",
                                    "score": 3,
                                    "created_utc": 1585884341.0,
                                    "replies": [
                                        {
                                            "body": "Interesting question. Can I send an email to someone standing in front of me? Why would cash be different? But if your position is, all other things being equal,  cash transactions don't violate the T&C and sending Venmo does, that's's an interesting take.",
                                            "author": "This_is_Not_My_Handl",
                                            "id": "fma605z",
                                            "parent_id": "t1_fma5i0s",
                                            "score": 1,
                                            "created_utc": 1585884708.0,
                                            "replies": [
                                                {
                                                    "body": "You can send an email but if you tell them in person, it’s no longer sending. My position is simply that what I’m doing doesn’t violate the terms. I read them and re-read them, in English and in my native language too to be sure.",
                                                    "author": null,
                                                    "id": "fma68g4",
                                                    "parent_id": "t1_fma605z",
                                                    "score": 2,
                                                    "created_utc": 1585884880.0,
                                                    "replies": [
                                                        {
                                                            "body": "Well, I'm a lawyer and I read them as prohibiting sugar. But if you don't get banned, you don't get banned 🤷‍♂️",
                                                            "author": "This_is_Not_My_Handl",
                                                            "id": "fma6fkm",
                                                            "parent_id": "t1_fma68g4",
                                                            "score": 1,
                                                            "created_utc": 1585885027.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Interesting! I’m sure that some things go against the rules, such as asking for a M&G fee, asking for ppm (also not allowed on SA), and surely others. \n\nUnfortunately all you need in order to get banned on tinder is for enough people to press “report”, they don’t investigate. People in my location don’t care but I’ve traveled to other places and was reported several times in the same area.",
                                                                    "author": null,
                                                                    "id": "fma7kde",
                                                                    "parent_id": "t1_fma6fkm",
                                                                    "score": 1,
                                                                    "created_utc": 1585885875.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "\"In order to be successful in sugar dating, you have to use multiple platforms\" is not an opinion.   It is a inaccurate statement of something you believe to be a fact.",
            "author": "UseTheForceRey",
            "id": "fm84ft7",
            "parent_id": "t1_fm7k16j",
            "score": 14,
            "created_utc": 1585842617.0,
            "replies": []
        },
        {
            "body": "Strange! Maybe it has something to do with your location.",
            "author": null,
            "id": "fm875zf",
            "parent_id": "t1_fm86z7e",
            "score": 3,
            "created_utc": 1585844076.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "fm970yg",
                    "parent_id": "t1_fm875zf",
                    "score": 3,
                    "created_utc": 1585862925.0,
                    "replies": [
                        {
                            "body": "Will it work if I post a bikini shot with no head? Or does tinder require faces?",
                            "author": "testing1to3",
                            "id": "fsxtvx6",
                            "parent_id": "t1_fm970yg",
                            "score": 1,
                            "created_utc": 1591331251.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "It just opens up new opportunities... I met people on Tinder who weren’t on SA. I also saw SA people on Tinder, recognized their pictures. Tinder is easy to download and everyone knows the app whereas SA is niche. I don’t see the harm in being on both. \n\nI agree with what you’re saying about being clear, and that why in my post I talk about what I put in my bio and pictures (usually they get what I’m about, at least experience sugar) and I recommend to move to another platform ASAP and talk about sugar dating there. There’s no point even for a SB in wasting time talking to someone who isn’t on the same page.",
            "author": null,
            "id": "fm8kfso",
            "parent_id": "t1_fm8jaap",
            "score": 5,
            "created_utc": 1585850996.0,
            "replies": []
        },
        {
            "body": "I’m aware that some people (not just women) use tinder for Instagram followers, that doesn’t mean that any profile that lists their ig handle is using tinder just for Instagram followers. Assuming that is a stretch, and considering you don’t even know that person’s intentions, taking action to report any profile with their handle doesn’t make any sense to me. There are lots of other reasons for which you’d want to list your Instagram account. \n\nFor instance I list an IG for men to be able check my pictures and possibly reach out there if I don’t swipe on them (I’m not always on tinder and don’t swipe for too long, so I might not see their profile for days). It’s not even my main account, it’s a separate one only for dating apps with <15 pictures so I really couldn’t care less care about the number of followers...",
            "author": null,
            "id": "fma43y9",
            "parent_id": "t1_fma2v22",
            "score": 2,
            "created_utc": 1585883336.0,
            "replies": [
                {
                    "body": "All good points.  That being said, I would never track anyone down and reach out on Instagram if they didn't swipe right on me.  It strikes me as creepy and desperate.    The entire relationship would get off on the wrong footing.  I would venture to guess a lot of successful people my age feel the same way.\n\nWhen I have an account on Tinder I pay for Gold so I can see ahead of time who swiped right on me and then choose to swipe right on them if I'm intrigued.  Cuts out the endless swiping and narrows things down quite nicely.",
                    "author": "soicansaywhatiwant",
                    "id": "fmdff78",
                    "parent_id": "t1_fma43y9",
                    "score": 2,
                    "created_utc": 1585966452.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Could be, could be just a lazy bio. There are many empty bios on tinder and IG is an easy way to see what someone is about. \n\nI still don’t get why you’d decide it’s a girl looking for followers and choose to spend time reporting if there isn’t some resentment.",
            "author": null,
            "id": "fm7inmq",
            "parent_id": "t1_fm7ifcw",
            "score": 9,
            "created_utc": 1585828317.0,
            "replies": [
                {
                    "body": "[removed]",
                    "author": null,
                    "id": "fm7j2s8",
                    "parent_id": "t1_fm7inmq",
                    "score": 0,
                    "created_utc": 1585828712.0,
                    "replies": [
                        {
                            "body": "Check your tone.",
                            "author": null,
                            "id": "fm7j4nc",
                            "parent_id": "t1_fm7j2s8",
                            "score": 4,
                            "created_utc": 1585828760.0,
                            "replies": [
                                {
                                    "body": "“Your inside voice is gonna put your ass outside.” \n Leonard Washington",
                                    "author": "Smitty0808",
                                    "id": "fm7kgoi",
                                    "parent_id": "t1_fm7j4nc",
                                    "score": 8,
                                    "created_utc": 1585829951.0,
                                    "replies": []
                                },
                                {
                                    "body": "Anna Oop",
                                    "author": "LaNouvelleSugar",
                                    "id": "fmlftm1",
                                    "parent_id": "t1_fm7j4nc",
                                    "score": 2,
                                    "created_utc": 1586185560.0,
                                    "replies": []
                                },
                                {
                                    "body": "[removed]",
                                    "author": null,
                                    "id": "fm7jabk",
                                    "parent_id": "t1_fm7j4nc",
                                    "score": -2,
                                    "created_utc": 1585828903.0,
                                    "replies": [
                                        {
                                            "body": "You *are* being kinda rude, dude.",
                                            "author": "LikeHoney99",
                                            "id": "fm866j0",
                                            "parent_id": "t1_fm7jabk",
                                            "score": 8,
                                            "created_utc": 1585843549.0,
                                            "replies": [
                                                {
                                                    "body": "[removed]",
                                                    "author": null,
                                                    "id": "fm87gmz",
                                                    "parent_id": "t1_fm866j0",
                                                    "score": -4,
                                                    "created_utc": 1585844231.0,
                                                    "replies": [
                                                        {
                                                            "body": "I mean...I could as easily say you’re projecting.",
                                                            "author": "LikeHoney99",
                                                            "id": "fm8877j",
                                                            "parent_id": "t1_fm87gmz",
                                                            "score": 10,
                                                            "created_utc": 1585844618.0,
                                                            "replies": []
                                                        },
                                                        {
                                                            "body": "[deleted]",
                                                            "author": null,
                                                            "id": "fm88pu5",
                                                            "parent_id": "t1_fm87gmz",
                                                            "score": 7,
                                                            "created_utc": 1585844891.0,
                                                            "replies": [
                                                                {
                                                                    "body": "[removed]",
                                                                    "author": null,
                                                                    "id": "fm8a5cx",
                                                                    "parent_id": "t1_fm88pu5",
                                                                    "score": -2,
                                                                    "created_utc": 1585845645.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "[deleted]",
                                                                            "author": null,
                                                                            "id": "fm8aehu",
                                                                            "parent_id": "t1_fm8a5cx",
                                                                            "score": 6,
                                                                            "created_utc": 1585845776.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "Exactly!",
                                                                                    "author": "LikeHoney99",
                                                                                    "id": "fm8bfj1",
                                                                                    "parent_id": "t1_fm8aehu",
                                                                                    "score": 2,
                                                                                    "created_utc": 1585846315.0,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        },
                                                                        {
                                                                            "body": "I don’t even HAVE IG.....doesn’t make me any less irritated by your attitude 😉",
                                                                            "author": "LikeHoney99",
                                                                            "id": "fm8ggth",
                                                                            "parent_id": "t1_fm8a5cx",
                                                                            "score": 6,
                                                                            "created_utc": 1585848960.0,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "body": "I’m no longer interacting with SDs here who are just here to contradict and are rude on top of that. It’s a waste of time and energy. \n\nI’m not against a healthy discussion and that’s just not it. I wrote a long and detailed post for SBs trying to be as helpful as I could. You picked up on one line that didn’t sit right with you and are now being borderline disrespectful in the way you address me. \n\nYou’re a grown man and you should know better. I’m not replying here any more.",
                                            "author": null,
                                            "id": "fm7jrpr",
                                            "parent_id": "t1_fm7jabk",
                                            "score": 10,
                                            "created_utc": 1585829344.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "Are they paying you to do this ?🙄",
                            "author": "LaNouvelleSugar",
                            "id": "fmlfwms",
                            "parent_id": "t1_fm7j2s8",
                            "score": 2,
                            "created_utc": 1586185608.0,
                            "replies": [
                                {
                                    "body": "[removed]",
                                    "author": null,
                                    "id": "fmliiv5",
                                    "parent_id": "t1_fmlfwms",
                                    "score": 1,
                                    "created_utc": 1586187100.0,
                                    "replies": [
                                        {
                                            "body": "Yeah...you definitely sound spiteful and bitter. That’s not cool dude. Stay safe !",
                                            "author": "LaNouvelleSugar",
                                            "id": "fmliu50",
                                            "parent_id": "t1_fmliiv5",
                                            "score": 2,
                                            "created_utc": 1586187274.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "That’s insane! Never heard that before, it sucks.",
            "author": null,
            "id": "fm8p6bh",
            "parent_id": "t1_fm8owus",
            "score": 1,
            "created_utc": 1585853450.0,
            "replies": []
        },
        {
            "body": "Well on here it is given. Rule number 1 of SLF\n\n>be respectful to other posters.\n\nYou can disagree and that’s fine, it’s your opinion. The fact is that nowhere on tinder terms of use does it say that the app is intended for one type of dating only, and sugar dating is not against the rules. Most people are into vanilla dating so it’s mostly vanilla.",
            "author": null,
            "id": "fm84ri7",
            "parent_id": "t1_fm84e94",
            "score": 8,
            "created_utc": 1585842792.0,
            "replies": [
                {
                    "body": "Nowhere on SA does it say that you have to pay for companionship... they actually say no ppm talk!",
                    "author": "BigBearSD",
                    "id": "fm84ugs",
                    "parent_id": "t1_fm84ri7",
                    "score": -2,
                    "created_utc": 1585842836.0,
                    "replies": [
                        {
                            "body": "Seeking **arrangement**, number one **Sugar daddy / sugar baby** website. \n\nWhen you sign up you have to mention if you are a **sugar daddy, sugar momma** or **sugar baby**. I don’t know how much clearer it can be.",
                            "author": null,
                            "id": "fm8512g",
                            "parent_id": "t1_fm84ugs",
                            "score": 5,
                            "created_utc": 1585842934.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "fm8oty6",
                                    "parent_id": "t1_fm8512g",
                                    "score": 1,
                                    "created_utc": 1585853271.0,
                                    "replies": [
                                        {
                                            "body": "I’m a fool then... What is sugar dating if it’s not a form of dating?",
                                            "author": null,
                                            "id": "fm8ozmt",
                                            "parent_id": "t1_fm8oty6",
                                            "score": 2,
                                            "created_utc": 1585853354.0,
                                            "replies": [
                                                {
                                                    "body": "[deleted]",
                                                    "author": null,
                                                    "id": "fm8q5tq",
                                                    "parent_id": "t1_fm8ozmt",
                                                    "score": 0,
                                                    "created_utc": 1585853957.0,
                                                    "replies": [
                                                        {
                                                            "body": "Sugar dating is a form of dating to me, therefore I think it’s perfectly fine to look for a SD on a dating app. But what do I know, I’m a fool who has never been on a date.",
                                                            "author": null,
                                                            "id": "fm8rt62",
                                                            "parent_id": "t1_fm8q5tq",
                                                            "score": 4,
                                                            "created_utc": 1585854827.0,
                                                            "replies": [
                                                                {
                                                                    "body": "[deleted]",
                                                                    "author": null,
                                                                    "id": "fm8u46k",
                                                                    "parent_id": "t1_fm8rt62",
                                                                    "score": 0,
                                                                    "created_utc": 1585856060.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "> I am not saying it doesn't work; just that Tinder is not meant for arrangements, it is obviously not allowed and you are rightfully reported when it happens because you are wrong\n\n\nBeing banned just means that some tinder users decide they don’t want arrangements on the app and they report. That doesn’t mean that it’s not allowed. Tinder doesn’t investigate anything. I don’t know how many times I have to repeat that sugar dating doesn’t go against any Tinder rule. \n\nIn my part of the world you’re more likely to get banned if you’re a transgender person than a sugar baby. Doesn’t mean that being trans is against any tinder rule",
                                                                            "author": null,
                                                                            "id": "fm8ushj",
                                                                            "parent_id": "t1_fm8u46k",
                                                                            "score": 3,
                                                                            "created_utc": 1585856418.0,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "“Send”",
            "author": null,
            "id": "fma55i1",
            "parent_id": "t1_fma53jc",
            "score": 2,
            "created_utc": 1585884088.0,
            "replies": [
                {
                    "body": "? \"Send\" is a present and future tense verb. I'm not sure how just the word \"send\" makes your case.",
                    "author": "This_is_Not_My_Handl",
                    "id": "fma5eia",
                    "parent_id": "t1_fma55i1",
                    "score": 1,
                    "created_utc": 1585884271.0,
                    "replies": [
                        {
                            "body": "If we meet and I hand you some cash, am I sending you money?",
                            "author": null,
                            "id": "fma5i0s",
                            "parent_id": "t1_fma5eia",
                            "score": 3,
                            "created_utc": 1585884341.0,
                            "replies": [
                                {
                                    "body": "Interesting question. Can I send an email to someone standing in front of me? Why would cash be different? But if your position is, all other things being equal,  cash transactions don't violate the T&C and sending Venmo does, that's's an interesting take.",
                                    "author": "This_is_Not_My_Handl",
                                    "id": "fma605z",
                                    "parent_id": "t1_fma5i0s",
                                    "score": 1,
                                    "created_utc": 1585884708.0,
                                    "replies": [
                                        {
                                            "body": "You can send an email but if you tell them in person, it’s no longer sending. My position is simply that what I’m doing doesn’t violate the terms. I read them and re-read them, in English and in my native language too to be sure.",
                                            "author": null,
                                            "id": "fma68g4",
                                            "parent_id": "t1_fma605z",
                                            "score": 2,
                                            "created_utc": 1585884880.0,
                                            "replies": [
                                                {
                                                    "body": "Well, I'm a lawyer and I read them as prohibiting sugar. But if you don't get banned, you don't get banned 🤷‍♂️",
                                                    "author": "This_is_Not_My_Handl",
                                                    "id": "fma6fkm",
                                                    "parent_id": "t1_fma68g4",
                                                    "score": 1,
                                                    "created_utc": 1585885027.0,
                                                    "replies": [
                                                        {
                                                            "body": "Interesting! I’m sure that some things go against the rules, such as asking for a M&G fee, asking for ppm (also not allowed on SA), and surely others. \n\nUnfortunately all you need in order to get banned on tinder is for enough people to press “report”, they don’t investigate. People in my location don’t care but I’ve traveled to other places and was reported several times in the same area.",
                                                            "author": null,
                                                            "id": "fma7kde",
                                                            "parent_id": "t1_fma6fkm",
                                                            "score": 1,
                                                            "created_utc": 1585885875.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "fm970yg",
            "parent_id": "t1_fm875zf",
            "score": 3,
            "created_utc": 1585862925.0,
            "replies": [
                {
                    "body": "Will it work if I post a bikini shot with no head? Or does tinder require faces?",
                    "author": "testing1to3",
                    "id": "fsxtvx6",
                    "parent_id": "t1_fm970yg",
                    "score": 1,
                    "created_utc": 1591331251.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "All good points.  That being said, I would never track anyone down and reach out on Instagram if they didn't swipe right on me.  It strikes me as creepy and desperate.    The entire relationship would get off on the wrong footing.  I would venture to guess a lot of successful people my age feel the same way.\n\nWhen I have an account on Tinder I pay for Gold so I can see ahead of time who swiped right on me and then choose to swipe right on them if I'm intrigued.  Cuts out the endless swiping and narrows things down quite nicely.",
            "author": "soicansaywhatiwant",
            "id": "fmdff78",
            "parent_id": "t1_fma43y9",
            "score": 2,
            "created_utc": 1585966452.0,
            "replies": []
        },
        {
            "body": "[removed]",
            "author": null,
            "id": "fm7j2s8",
            "parent_id": "t1_fm7inmq",
            "score": 0,
            "created_utc": 1585828712.0,
            "replies": [
                {
                    "body": "Check your tone.",
                    "author": null,
                    "id": "fm7j4nc",
                    "parent_id": "t1_fm7j2s8",
                    "score": 4,
                    "created_utc": 1585828760.0,
                    "replies": [
                        {
                            "body": "“Your inside voice is gonna put your ass outside.” \n Leonard Washington",
                            "author": "Smitty0808",
                            "id": "fm7kgoi",
                            "parent_id": "t1_fm7j4nc",
                            "score": 8,
                            "created_utc": 1585829951.0,
                            "replies": []
                        },
                        {
                            "body": "Anna Oop",
                            "author": "LaNouvelleSugar",
                            "id": "fmlftm1",
                            "parent_id": "t1_fm7j4nc",
                            "score": 2,
                            "created_utc": 1586185560.0,
                            "replies": []
                        },
                        {
                            "body": "[removed]",
                            "author": null,
                            "id": "fm7jabk",
                            "parent_id": "t1_fm7j4nc",
                            "score": -2,
                            "created_utc": 1585828903.0,
                            "replies": [
                                {
                                    "body": "You *are* being kinda rude, dude.",
                                    "author": "LikeHoney99",
                                    "id": "fm866j0",
                                    "parent_id": "t1_fm7jabk",
                                    "score": 8,
                                    "created_utc": 1585843549.0,
                                    "replies": [
                                        {
                                            "body": "[removed]",
                                            "author": null,
                                            "id": "fm87gmz",
                                            "parent_id": "t1_fm866j0",
                                            "score": -4,
                                            "created_utc": 1585844231.0,
                                            "replies": [
                                                {
                                                    "body": "I mean...I could as easily say you’re projecting.",
                                                    "author": "LikeHoney99",
                                                    "id": "fm8877j",
                                                    "parent_id": "t1_fm87gmz",
                                                    "score": 10,
                                                    "created_utc": 1585844618.0,
                                                    "replies": []
                                                },
                                                {
                                                    "body": "[deleted]",
                                                    "author": null,
                                                    "id": "fm88pu5",
                                                    "parent_id": "t1_fm87gmz",
                                                    "score": 7,
                                                    "created_utc": 1585844891.0,
                                                    "replies": [
                                                        {
                                                            "body": "[removed]",
                                                            "author": null,
                                                            "id": "fm8a5cx",
                                                            "parent_id": "t1_fm88pu5",
                                                            "score": -2,
                                                            "created_utc": 1585845645.0,
                                                            "replies": [
                                                                {
                                                                    "body": "[deleted]",
                                                                    "author": null,
                                                                    "id": "fm8aehu",
                                                                    "parent_id": "t1_fm8a5cx",
                                                                    "score": 6,
                                                                    "created_utc": 1585845776.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "Exactly!",
                                                                            "author": "LikeHoney99",
                                                                            "id": "fm8bfj1",
                                                                            "parent_id": "t1_fm8aehu",
                                                                            "score": 2,
                                                                            "created_utc": 1585846315.0,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "body": "I don’t even HAVE IG.....doesn’t make me any less irritated by your attitude 😉",
                                                                    "author": "LikeHoney99",
                                                                    "id": "fm8ggth",
                                                                    "parent_id": "t1_fm8a5cx",
                                                                    "score": 6,
                                                                    "created_utc": 1585848960.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "I’m no longer interacting with SDs here who are just here to contradict and are rude on top of that. It’s a waste of time and energy. \n\nI’m not against a healthy discussion and that’s just not it. I wrote a long and detailed post for SBs trying to be as helpful as I could. You picked up on one line that didn’t sit right with you and are now being borderline disrespectful in the way you address me. \n\nYou’re a grown man and you should know better. I’m not replying here any more.",
                                    "author": null,
                                    "id": "fm7jrpr",
                                    "parent_id": "t1_fm7jabk",
                                    "score": 10,
                                    "created_utc": 1585829344.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Are they paying you to do this ?🙄",
                    "author": "LaNouvelleSugar",
                    "id": "fmlfwms",
                    "parent_id": "t1_fm7j2s8",
                    "score": 2,
                    "created_utc": 1586185608.0,
                    "replies": [
                        {
                            "body": "[removed]",
                            "author": null,
                            "id": "fmliiv5",
                            "parent_id": "t1_fmlfwms",
                            "score": 1,
                            "created_utc": 1586187100.0,
                            "replies": [
                                {
                                    "body": "Yeah...you definitely sound spiteful and bitter. That’s not cool dude. Stay safe !",
                                    "author": "LaNouvelleSugar",
                                    "id": "fmliu50",
                                    "parent_id": "t1_fmliiv5",
                                    "score": 2,
                                    "created_utc": 1586187274.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Nowhere on SA does it say that you have to pay for companionship... they actually say no ppm talk!",
            "author": "BigBearSD",
            "id": "fm84ugs",
            "parent_id": "t1_fm84ri7",
            "score": -2,
            "created_utc": 1585842836.0,
            "replies": [
                {
                    "body": "Seeking **arrangement**, number one **Sugar daddy / sugar baby** website. \n\nWhen you sign up you have to mention if you are a **sugar daddy, sugar momma** or **sugar baby**. I don’t know how much clearer it can be.",
                    "author": null,
                    "id": "fm8512g",
                    "parent_id": "t1_fm84ugs",
                    "score": 5,
                    "created_utc": 1585842934.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "fm8oty6",
                            "parent_id": "t1_fm8512g",
                            "score": 1,
                            "created_utc": 1585853271.0,
                            "replies": [
                                {
                                    "body": "I’m a fool then... What is sugar dating if it’s not a form of dating?",
                                    "author": null,
                                    "id": "fm8ozmt",
                                    "parent_id": "t1_fm8oty6",
                                    "score": 2,
                                    "created_utc": 1585853354.0,
                                    "replies": [
                                        {
                                            "body": "[deleted]",
                                            "author": null,
                                            "id": "fm8q5tq",
                                            "parent_id": "t1_fm8ozmt",
                                            "score": 0,
                                            "created_utc": 1585853957.0,
                                            "replies": [
                                                {
                                                    "body": "Sugar dating is a form of dating to me, therefore I think it’s perfectly fine to look for a SD on a dating app. But what do I know, I’m a fool who has never been on a date.",
                                                    "author": null,
                                                    "id": "fm8rt62",
                                                    "parent_id": "t1_fm8q5tq",
                                                    "score": 4,
                                                    "created_utc": 1585854827.0,
                                                    "replies": [
                                                        {
                                                            "body": "[deleted]",
                                                            "author": null,
                                                            "id": "fm8u46k",
                                                            "parent_id": "t1_fm8rt62",
                                                            "score": 0,
                                                            "created_utc": 1585856060.0,
                                                            "replies": [
                                                                {
                                                                    "body": "> I am not saying it doesn't work; just that Tinder is not meant for arrangements, it is obviously not allowed and you are rightfully reported when it happens because you are wrong\n\n\nBeing banned just means that some tinder users decide they don’t want arrangements on the app and they report. That doesn’t mean that it’s not allowed. Tinder doesn’t investigate anything. I don’t know how many times I have to repeat that sugar dating doesn’t go against any Tinder rule. \n\nIn my part of the world you’re more likely to get banned if you’re a transgender person than a sugar baby. Doesn’t mean that being trans is against any tinder rule",
                                                                    "author": null,
                                                                    "id": "fm8ushj",
                                                                    "parent_id": "t1_fm8u46k",
                                                                    "score": 3,
                                                                    "created_utc": 1585856418.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "? \"Send\" is a present and future tense verb. I'm not sure how just the word \"send\" makes your case.",
            "author": "This_is_Not_My_Handl",
            "id": "fma5eia",
            "parent_id": "t1_fma55i1",
            "score": 1,
            "created_utc": 1585884271.0,
            "replies": [
                {
                    "body": "If we meet and I hand you some cash, am I sending you money?",
                    "author": null,
                    "id": "fma5i0s",
                    "parent_id": "t1_fma5eia",
                    "score": 3,
                    "created_utc": 1585884341.0,
                    "replies": [
                        {
                            "body": "Interesting question. Can I send an email to someone standing in front of me? Why would cash be different? But if your position is, all other things being equal,  cash transactions don't violate the T&C and sending Venmo does, that's's an interesting take.",
                            "author": "This_is_Not_My_Handl",
                            "id": "fma605z",
                            "parent_id": "t1_fma5i0s",
                            "score": 1,
                            "created_utc": 1585884708.0,
                            "replies": [
                                {
                                    "body": "You can send an email but if you tell them in person, it’s no longer sending. My position is simply that what I’m doing doesn’t violate the terms. I read them and re-read them, in English and in my native language too to be sure.",
                                    "author": null,
                                    "id": "fma68g4",
                                    "parent_id": "t1_fma605z",
                                    "score": 2,
                                    "created_utc": 1585884880.0,
                                    "replies": [
                                        {
                                            "body": "Well, I'm a lawyer and I read them as prohibiting sugar. But if you don't get banned, you don't get banned 🤷‍♂️",
                                            "author": "This_is_Not_My_Handl",
                                            "id": "fma6fkm",
                                            "parent_id": "t1_fma68g4",
                                            "score": 1,
                                            "created_utc": 1585885027.0,
                                            "replies": [
                                                {
                                                    "body": "Interesting! I’m sure that some things go against the rules, such as asking for a M&G fee, asking for ppm (also not allowed on SA), and surely others. \n\nUnfortunately all you need in order to get banned on tinder is for enough people to press “report”, they don’t investigate. People in my location don’t care but I’ve traveled to other places and was reported several times in the same area.",
                                                    "author": null,
                                                    "id": "fma7kde",
                                                    "parent_id": "t1_fma6fkm",
                                                    "score": 1,
                                                    "created_utc": 1585885875.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Will it work if I post a bikini shot with no head? Or does tinder require faces?",
            "author": "testing1to3",
            "id": "fsxtvx6",
            "parent_id": "t1_fm970yg",
            "score": 1,
            "created_utc": 1591331251.0,
            "replies": []
        },
        {
            "body": "Check your tone.",
            "author": null,
            "id": "fm7j4nc",
            "parent_id": "t1_fm7j2s8",
            "score": 4,
            "created_utc": 1585828760.0,
            "replies": [
                {
                    "body": "“Your inside voice is gonna put your ass outside.” \n Leonard Washington",
                    "author": "Smitty0808",
                    "id": "fm7kgoi",
                    "parent_id": "t1_fm7j4nc",
                    "score": 8,
                    "created_utc": 1585829951.0,
                    "replies": []
                },
                {
                    "body": "Anna Oop",
                    "author": "LaNouvelleSugar",
                    "id": "fmlftm1",
                    "parent_id": "t1_fm7j4nc",
                    "score": 2,
                    "created_utc": 1586185560.0,
                    "replies": []
                },
                {
                    "body": "[removed]",
                    "author": null,
                    "id": "fm7jabk",
                    "parent_id": "t1_fm7j4nc",
                    "score": -2,
                    "created_utc": 1585828903.0,
                    "replies": [
                        {
                            "body": "You *are* being kinda rude, dude.",
                            "author": "LikeHoney99",
                            "id": "fm866j0",
                            "parent_id": "t1_fm7jabk",
                            "score": 8,
                            "created_utc": 1585843549.0,
                            "replies": [
                                {
                                    "body": "[removed]",
                                    "author": null,
                                    "id": "fm87gmz",
                                    "parent_id": "t1_fm866j0",
                                    "score": -4,
                                    "created_utc": 1585844231.0,
                                    "replies": [
                                        {
                                            "body": "I mean...I could as easily say you’re projecting.",
                                            "author": "LikeHoney99",
                                            "id": "fm8877j",
                                            "parent_id": "t1_fm87gmz",
                                            "score": 10,
                                            "created_utc": 1585844618.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "[deleted]",
                                            "author": null,
                                            "id": "fm88pu5",
                                            "parent_id": "t1_fm87gmz",
                                            "score": 7,
                                            "created_utc": 1585844891.0,
                                            "replies": [
                                                {
                                                    "body": "[removed]",
                                                    "author": null,
                                                    "id": "fm8a5cx",
                                                    "parent_id": "t1_fm88pu5",
                                                    "score": -2,
                                                    "created_utc": 1585845645.0,
                                                    "replies": [
                                                        {
                                                            "body": "[deleted]",
                                                            "author": null,
                                                            "id": "fm8aehu",
                                                            "parent_id": "t1_fm8a5cx",
                                                            "score": 6,
                                                            "created_utc": 1585845776.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Exactly!",
                                                                    "author": "LikeHoney99",
                                                                    "id": "fm8bfj1",
                                                                    "parent_id": "t1_fm8aehu",
                                                                    "score": 2,
                                                                    "created_utc": 1585846315.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "body": "I don’t even HAVE IG.....doesn’t make me any less irritated by your attitude 😉",
                                                            "author": "LikeHoney99",
                                                            "id": "fm8ggth",
                                                            "parent_id": "t1_fm8a5cx",
                                                            "score": 6,
                                                            "created_utc": 1585848960.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "I’m no longer interacting with SDs here who are just here to contradict and are rude on top of that. It’s a waste of time and energy. \n\nI’m not against a healthy discussion and that’s just not it. I wrote a long and detailed post for SBs trying to be as helpful as I could. You picked up on one line that didn’t sit right with you and are now being borderline disrespectful in the way you address me. \n\nYou’re a grown man and you should know better. I’m not replying here any more.",
                            "author": null,
                            "id": "fm7jrpr",
                            "parent_id": "t1_fm7jabk",
                            "score": 10,
                            "created_utc": 1585829344.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Are they paying you to do this ?🙄",
            "author": "LaNouvelleSugar",
            "id": "fmlfwms",
            "parent_id": "t1_fm7j2s8",
            "score": 2,
            "created_utc": 1586185608.0,
            "replies": [
                {
                    "body": "[removed]",
                    "author": null,
                    "id": "fmliiv5",
                    "parent_id": "t1_fmlfwms",
                    "score": 1,
                    "created_utc": 1586187100.0,
                    "replies": [
                        {
                            "body": "Yeah...you definitely sound spiteful and bitter. That’s not cool dude. Stay safe !",
                            "author": "LaNouvelleSugar",
                            "id": "fmliu50",
                            "parent_id": "t1_fmliiv5",
                            "score": 2,
                            "created_utc": 1586187274.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Seeking **arrangement**, number one **Sugar daddy / sugar baby** website. \n\nWhen you sign up you have to mention if you are a **sugar daddy, sugar momma** or **sugar baby**. I don’t know how much clearer it can be.",
            "author": null,
            "id": "fm8512g",
            "parent_id": "t1_fm84ugs",
            "score": 5,
            "created_utc": 1585842934.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "fm8oty6",
                    "parent_id": "t1_fm8512g",
                    "score": 1,
                    "created_utc": 1585853271.0,
                    "replies": [
                        {
                            "body": "I’m a fool then... What is sugar dating if it’s not a form of dating?",
                            "author": null,
                            "id": "fm8ozmt",
                            "parent_id": "t1_fm8oty6",
                            "score": 2,
                            "created_utc": 1585853354.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "fm8q5tq",
                                    "parent_id": "t1_fm8ozmt",
                                    "score": 0,
                                    "created_utc": 1585853957.0,
                                    "replies": [
                                        {
                                            "body": "Sugar dating is a form of dating to me, therefore I think it’s perfectly fine to look for a SD on a dating app. But what do I know, I’m a fool who has never been on a date.",
                                            "author": null,
                                            "id": "fm8rt62",
                                            "parent_id": "t1_fm8q5tq",
                                            "score": 4,
                                            "created_utc": 1585854827.0,
                                            "replies": [
                                                {
                                                    "body": "[deleted]",
                                                    "author": null,
                                                    "id": "fm8u46k",
                                                    "parent_id": "t1_fm8rt62",
                                                    "score": 0,
                                                    "created_utc": 1585856060.0,
                                                    "replies": [
                                                        {
                                                            "body": "> I am not saying it doesn't work; just that Tinder is not meant for arrangements, it is obviously not allowed and you are rightfully reported when it happens because you are wrong\n\n\nBeing banned just means that some tinder users decide they don’t want arrangements on the app and they report. That doesn’t mean that it’s not allowed. Tinder doesn’t investigate anything. I don’t know how many times I have to repeat that sugar dating doesn’t go against any Tinder rule. \n\nIn my part of the world you’re more likely to get banned if you’re a transgender person than a sugar baby. Doesn’t mean that being trans is against any tinder rule",
                                                            "author": null,
                                                            "id": "fm8ushj",
                                                            "parent_id": "t1_fm8u46k",
                                                            "score": 3,
                                                            "created_utc": 1585856418.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "If we meet and I hand you some cash, am I sending you money?",
            "author": null,
            "id": "fma5i0s",
            "parent_id": "t1_fma5eia",
            "score": 3,
            "created_utc": 1585884341.0,
            "replies": [
                {
                    "body": "Interesting question. Can I send an email to someone standing in front of me? Why would cash be different? But if your position is, all other things being equal,  cash transactions don't violate the T&C and sending Venmo does, that's's an interesting take.",
                    "author": "This_is_Not_My_Handl",
                    "id": "fma605z",
                    "parent_id": "t1_fma5i0s",
                    "score": 1,
                    "created_utc": 1585884708.0,
                    "replies": [
                        {
                            "body": "You can send an email but if you tell them in person, it’s no longer sending. My position is simply that what I’m doing doesn’t violate the terms. I read them and re-read them, in English and in my native language too to be sure.",
                            "author": null,
                            "id": "fma68g4",
                            "parent_id": "t1_fma605z",
                            "score": 2,
                            "created_utc": 1585884880.0,
                            "replies": [
                                {
                                    "body": "Well, I'm a lawyer and I read them as prohibiting sugar. But if you don't get banned, you don't get banned 🤷‍♂️",
                                    "author": "This_is_Not_My_Handl",
                                    "id": "fma6fkm",
                                    "parent_id": "t1_fma68g4",
                                    "score": 1,
                                    "created_utc": 1585885027.0,
                                    "replies": [
                                        {
                                            "body": "Interesting! I’m sure that some things go against the rules, such as asking for a M&G fee, asking for ppm (also not allowed on SA), and surely others. \n\nUnfortunately all you need in order to get banned on tinder is for enough people to press “report”, they don’t investigate. People in my location don’t care but I’ve traveled to other places and was reported several times in the same area.",
                                            "author": null,
                                            "id": "fma7kde",
                                            "parent_id": "t1_fma6fkm",
                                            "score": 1,
                                            "created_utc": 1585885875.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "“Your inside voice is gonna put your ass outside.” \n Leonard Washington",
            "author": "Smitty0808",
            "id": "fm7kgoi",
            "parent_id": "t1_fm7j4nc",
            "score": 8,
            "created_utc": 1585829951.0,
            "replies": []
        },
        {
            "body": "Anna Oop",
            "author": "LaNouvelleSugar",
            "id": "fmlftm1",
            "parent_id": "t1_fm7j4nc",
            "score": 2,
            "created_utc": 1586185560.0,
            "replies": []
        },
        {
            "body": "[removed]",
            "author": null,
            "id": "fm7jabk",
            "parent_id": "t1_fm7j4nc",
            "score": -2,
            "created_utc": 1585828903.0,
            "replies": [
                {
                    "body": "You *are* being kinda rude, dude.",
                    "author": "LikeHoney99",
                    "id": "fm866j0",
                    "parent_id": "t1_fm7jabk",
                    "score": 8,
                    "created_utc": 1585843549.0,
                    "replies": [
                        {
                            "body": "[removed]",
                            "author": null,
                            "id": "fm87gmz",
                            "parent_id": "t1_fm866j0",
                            "score": -4,
                            "created_utc": 1585844231.0,
                            "replies": [
                                {
                                    "body": "I mean...I could as easily say you’re projecting.",
                                    "author": "LikeHoney99",
                                    "id": "fm8877j",
                                    "parent_id": "t1_fm87gmz",
                                    "score": 10,
                                    "created_utc": 1585844618.0,
                                    "replies": []
                                },
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "fm88pu5",
                                    "parent_id": "t1_fm87gmz",
                                    "score": 7,
                                    "created_utc": 1585844891.0,
                                    "replies": [
                                        {
                                            "body": "[removed]",
                                            "author": null,
                                            "id": "fm8a5cx",
                                            "parent_id": "t1_fm88pu5",
                                            "score": -2,
                                            "created_utc": 1585845645.0,
                                            "replies": [
                                                {
                                                    "body": "[deleted]",
                                                    "author": null,
                                                    "id": "fm8aehu",
                                                    "parent_id": "t1_fm8a5cx",
                                                    "score": 6,
                                                    "created_utc": 1585845776.0,
                                                    "replies": [
                                                        {
                                                            "body": "Exactly!",
                                                            "author": "LikeHoney99",
                                                            "id": "fm8bfj1",
                                                            "parent_id": "t1_fm8aehu",
                                                            "score": 2,
                                                            "created_utc": 1585846315.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "body": "I don’t even HAVE IG.....doesn’t make me any less irritated by your attitude 😉",
                                                    "author": "LikeHoney99",
                                                    "id": "fm8ggth",
                                                    "parent_id": "t1_fm8a5cx",
                                                    "score": 6,
                                                    "created_utc": 1585848960.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "I’m no longer interacting with SDs here who are just here to contradict and are rude on top of that. It’s a waste of time and energy. \n\nI’m not against a healthy discussion and that’s just not it. I wrote a long and detailed post for SBs trying to be as helpful as I could. You picked up on one line that didn’t sit right with you and are now being borderline disrespectful in the way you address me. \n\nYou’re a grown man and you should know better. I’m not replying here any more.",
                    "author": null,
                    "id": "fm7jrpr",
                    "parent_id": "t1_fm7jabk",
                    "score": 10,
                    "created_utc": 1585829344.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[removed]",
            "author": null,
            "id": "fmliiv5",
            "parent_id": "t1_fmlfwms",
            "score": 1,
            "created_utc": 1586187100.0,
            "replies": [
                {
                    "body": "Yeah...you definitely sound spiteful and bitter. That’s not cool dude. Stay safe !",
                    "author": "LaNouvelleSugar",
                    "id": "fmliu50",
                    "parent_id": "t1_fmliiv5",
                    "score": 2,
                    "created_utc": 1586187274.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "fm8oty6",
            "parent_id": "t1_fm8512g",
            "score": 1,
            "created_utc": 1585853271.0,
            "replies": [
                {
                    "body": "I’m a fool then... What is sugar dating if it’s not a form of dating?",
                    "author": null,
                    "id": "fm8ozmt",
                    "parent_id": "t1_fm8oty6",
                    "score": 2,
                    "created_utc": 1585853354.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "fm8q5tq",
                            "parent_id": "t1_fm8ozmt",
                            "score": 0,
                            "created_utc": 1585853957.0,
                            "replies": [
                                {
                                    "body": "Sugar dating is a form of dating to me, therefore I think it’s perfectly fine to look for a SD on a dating app. But what do I know, I’m a fool who has never been on a date.",
                                    "author": null,
                                    "id": "fm8rt62",
                                    "parent_id": "t1_fm8q5tq",
                                    "score": 4,
                                    "created_utc": 1585854827.0,
                                    "replies": [
                                        {
                                            "body": "[deleted]",
                                            "author": null,
                                            "id": "fm8u46k",
                                            "parent_id": "t1_fm8rt62",
                                            "score": 0,
                                            "created_utc": 1585856060.0,
                                            "replies": [
                                                {
                                                    "body": "> I am not saying it doesn't work; just that Tinder is not meant for arrangements, it is obviously not allowed and you are rightfully reported when it happens because you are wrong\n\n\nBeing banned just means that some tinder users decide they don’t want arrangements on the app and they report. That doesn’t mean that it’s not allowed. Tinder doesn’t investigate anything. I don’t know how many times I have to repeat that sugar dating doesn’t go against any Tinder rule. \n\nIn my part of the world you’re more likely to get banned if you’re a transgender person than a sugar baby. Doesn’t mean that being trans is against any tinder rule",
                                                    "author": null,
                                                    "id": "fm8ushj",
                                                    "parent_id": "t1_fm8u46k",
                                                    "score": 3,
                                                    "created_utc": 1585856418.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Interesting question. Can I send an email to someone standing in front of me? Why would cash be different? But if your position is, all other things being equal,  cash transactions don't violate the T&C and sending Venmo does, that's's an interesting take.",
            "author": "This_is_Not_My_Handl",
            "id": "fma605z",
            "parent_id": "t1_fma5i0s",
            "score": 1,
            "created_utc": 1585884708.0,
            "replies": [
                {
                    "body": "You can send an email but if you tell them in person, it’s no longer sending. My position is simply that what I’m doing doesn’t violate the terms. I read them and re-read them, in English and in my native language too to be sure.",
                    "author": null,
                    "id": "fma68g4",
                    "parent_id": "t1_fma605z",
                    "score": 2,
                    "created_utc": 1585884880.0,
                    "replies": [
                        {
                            "body": "Well, I'm a lawyer and I read them as prohibiting sugar. But if you don't get banned, you don't get banned 🤷‍♂️",
                            "author": "This_is_Not_My_Handl",
                            "id": "fma6fkm",
                            "parent_id": "t1_fma68g4",
                            "score": 1,
                            "created_utc": 1585885027.0,
                            "replies": [
                                {
                                    "body": "Interesting! I’m sure that some things go against the rules, such as asking for a M&G fee, asking for ppm (also not allowed on SA), and surely others. \n\nUnfortunately all you need in order to get banned on tinder is for enough people to press “report”, they don’t investigate. People in my location don’t care but I’ve traveled to other places and was reported several times in the same area.",
                                    "author": null,
                                    "id": "fma7kde",
                                    "parent_id": "t1_fma6fkm",
                                    "score": 1,
                                    "created_utc": 1585885875.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "You *are* being kinda rude, dude.",
            "author": "LikeHoney99",
            "id": "fm866j0",
            "parent_id": "t1_fm7jabk",
            "score": 8,
            "created_utc": 1585843549.0,
            "replies": [
                {
                    "body": "[removed]",
                    "author": null,
                    "id": "fm87gmz",
                    "parent_id": "t1_fm866j0",
                    "score": -4,
                    "created_utc": 1585844231.0,
                    "replies": [
                        {
                            "body": "I mean...I could as easily say you’re projecting.",
                            "author": "LikeHoney99",
                            "id": "fm8877j",
                            "parent_id": "t1_fm87gmz",
                            "score": 10,
                            "created_utc": 1585844618.0,
                            "replies": []
                        },
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "fm88pu5",
                            "parent_id": "t1_fm87gmz",
                            "score": 7,
                            "created_utc": 1585844891.0,
                            "replies": [
                                {
                                    "body": "[removed]",
                                    "author": null,
                                    "id": "fm8a5cx",
                                    "parent_id": "t1_fm88pu5",
                                    "score": -2,
                                    "created_utc": 1585845645.0,
                                    "replies": [
                                        {
                                            "body": "[deleted]",
                                            "author": null,
                                            "id": "fm8aehu",
                                            "parent_id": "t1_fm8a5cx",
                                            "score": 6,
                                            "created_utc": 1585845776.0,
                                            "replies": [
                                                {
                                                    "body": "Exactly!",
                                                    "author": "LikeHoney99",
                                                    "id": "fm8bfj1",
                                                    "parent_id": "t1_fm8aehu",
                                                    "score": 2,
                                                    "created_utc": 1585846315.0,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "body": "I don’t even HAVE IG.....doesn’t make me any less irritated by your attitude 😉",
                                            "author": "LikeHoney99",
                                            "id": "fm8ggth",
                                            "parent_id": "t1_fm8a5cx",
                                            "score": 6,
                                            "created_utc": 1585848960.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I’m no longer interacting with SDs here who are just here to contradict and are rude on top of that. It’s a waste of time and energy. \n\nI’m not against a healthy discussion and that’s just not it. I wrote a long and detailed post for SBs trying to be as helpful as I could. You picked up on one line that didn’t sit right with you and are now being borderline disrespectful in the way you address me. \n\nYou’re a grown man and you should know better. I’m not replying here any more.",
            "author": null,
            "id": "fm7jrpr",
            "parent_id": "t1_fm7jabk",
            "score": 10,
            "created_utc": 1585829344.0,
            "replies": []
        },
        {
            "body": "Yeah...you definitely sound spiteful and bitter. That’s not cool dude. Stay safe !",
            "author": "LaNouvelleSugar",
            "id": "fmliu50",
            "parent_id": "t1_fmliiv5",
            "score": 2,
            "created_utc": 1586187274.0,
            "replies": []
        },
        {
            "body": "I’m a fool then... What is sugar dating if it’s not a form of dating?",
            "author": null,
            "id": "fm8ozmt",
            "parent_id": "t1_fm8oty6",
            "score": 2,
            "created_utc": 1585853354.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "fm8q5tq",
                    "parent_id": "t1_fm8ozmt",
                    "score": 0,
                    "created_utc": 1585853957.0,
                    "replies": [
                        {
                            "body": "Sugar dating is a form of dating to me, therefore I think it’s perfectly fine to look for a SD on a dating app. But what do I know, I’m a fool who has never been on a date.",
                            "author": null,
                            "id": "fm8rt62",
                            "parent_id": "t1_fm8q5tq",
                            "score": 4,
                            "created_utc": 1585854827.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "fm8u46k",
                                    "parent_id": "t1_fm8rt62",
                                    "score": 0,
                                    "created_utc": 1585856060.0,
                                    "replies": [
                                        {
                                            "body": "> I am not saying it doesn't work; just that Tinder is not meant for arrangements, it is obviously not allowed and you are rightfully reported when it happens because you are wrong\n\n\nBeing banned just means that some tinder users decide they don’t want arrangements on the app and they report. That doesn’t mean that it’s not allowed. Tinder doesn’t investigate anything. I don’t know how many times I have to repeat that sugar dating doesn’t go against any Tinder rule. \n\nIn my part of the world you’re more likely to get banned if you’re a transgender person than a sugar baby. Doesn’t mean that being trans is against any tinder rule",
                                            "author": null,
                                            "id": "fm8ushj",
                                            "parent_id": "t1_fm8u46k",
                                            "score": 3,
                                            "created_utc": 1585856418.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "You can send an email but if you tell them in person, it’s no longer sending. My position is simply that what I’m doing doesn’t violate the terms. I read them and re-read them, in English and in my native language too to be sure.",
            "author": null,
            "id": "fma68g4",
            "parent_id": "t1_fma605z",
            "score": 2,
            "created_utc": 1585884880.0,
            "replies": [
                {
                    "body": "Well, I'm a lawyer and I read them as prohibiting sugar. But if you don't get banned, you don't get banned 🤷‍♂️",
                    "author": "This_is_Not_My_Handl",
                    "id": "fma6fkm",
                    "parent_id": "t1_fma68g4",
                    "score": 1,
                    "created_utc": 1585885027.0,
                    "replies": [
                        {
                            "body": "Interesting! I’m sure that some things go against the rules, such as asking for a M&G fee, asking for ppm (also not allowed on SA), and surely others. \n\nUnfortunately all you need in order to get banned on tinder is for enough people to press “report”, they don’t investigate. People in my location don’t care but I’ve traveled to other places and was reported several times in the same area.",
                            "author": null,
                            "id": "fma7kde",
                            "parent_id": "t1_fma6fkm",
                            "score": 1,
                            "created_utc": 1585885875.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "[removed]",
            "author": null,
            "id": "fm87gmz",
            "parent_id": "t1_fm866j0",
            "score": -4,
            "created_utc": 1585844231.0,
            "replies": [
                {
                    "body": "I mean...I could as easily say you’re projecting.",
                    "author": "LikeHoney99",
                    "id": "fm8877j",
                    "parent_id": "t1_fm87gmz",
                    "score": 10,
                    "created_utc": 1585844618.0,
                    "replies": []
                },
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "fm88pu5",
                    "parent_id": "t1_fm87gmz",
                    "score": 7,
                    "created_utc": 1585844891.0,
                    "replies": [
                        {
                            "body": "[removed]",
                            "author": null,
                            "id": "fm8a5cx",
                            "parent_id": "t1_fm88pu5",
                            "score": -2,
                            "created_utc": 1585845645.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "fm8aehu",
                                    "parent_id": "t1_fm8a5cx",
                                    "score": 6,
                                    "created_utc": 1585845776.0,
                                    "replies": [
                                        {
                                            "body": "Exactly!",
                                            "author": "LikeHoney99",
                                            "id": "fm8bfj1",
                                            "parent_id": "t1_fm8aehu",
                                            "score": 2,
                                            "created_utc": 1585846315.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "I don’t even HAVE IG.....doesn’t make me any less irritated by your attitude 😉",
                                    "author": "LikeHoney99",
                                    "id": "fm8ggth",
                                    "parent_id": "t1_fm8a5cx",
                                    "score": 6,
                                    "created_utc": 1585848960.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "fm8q5tq",
            "parent_id": "t1_fm8ozmt",
            "score": 0,
            "created_utc": 1585853957.0,
            "replies": [
                {
                    "body": "Sugar dating is a form of dating to me, therefore I think it’s perfectly fine to look for a SD on a dating app. But what do I know, I’m a fool who has never been on a date.",
                    "author": null,
                    "id": "fm8rt62",
                    "parent_id": "t1_fm8q5tq",
                    "score": 4,
                    "created_utc": 1585854827.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "fm8u46k",
                            "parent_id": "t1_fm8rt62",
                            "score": 0,
                            "created_utc": 1585856060.0,
                            "replies": [
                                {
                                    "body": "> I am not saying it doesn't work; just that Tinder is not meant for arrangements, it is obviously not allowed and you are rightfully reported when it happens because you are wrong\n\n\nBeing banned just means that some tinder users decide they don’t want arrangements on the app and they report. That doesn’t mean that it’s not allowed. Tinder doesn’t investigate anything. I don’t know how many times I have to repeat that sugar dating doesn’t go against any Tinder rule. \n\nIn my part of the world you’re more likely to get banned if you’re a transgender person than a sugar baby. Doesn’t mean that being trans is against any tinder rule",
                                    "author": null,
                                    "id": "fm8ushj",
                                    "parent_id": "t1_fm8u46k",
                                    "score": 3,
                                    "created_utc": 1585856418.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Well, I'm a lawyer and I read them as prohibiting sugar. But if you don't get banned, you don't get banned 🤷‍♂️",
            "author": "This_is_Not_My_Handl",
            "id": "fma6fkm",
            "parent_id": "t1_fma68g4",
            "score": 1,
            "created_utc": 1585885027.0,
            "replies": [
                {
                    "body": "Interesting! I’m sure that some things go against the rules, such as asking for a M&G fee, asking for ppm (also not allowed on SA), and surely others. \n\nUnfortunately all you need in order to get banned on tinder is for enough people to press “report”, they don’t investigate. People in my location don’t care but I’ve traveled to other places and was reported several times in the same area.",
                    "author": null,
                    "id": "fma7kde",
                    "parent_id": "t1_fma6fkm",
                    "score": 1,
                    "created_utc": 1585885875.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I mean...I could as easily say you’re projecting.",
            "author": "LikeHoney99",
            "id": "fm8877j",
            "parent_id": "t1_fm87gmz",
            "score": 10,
            "created_utc": 1585844618.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "fm88pu5",
            "parent_id": "t1_fm87gmz",
            "score": 7,
            "created_utc": 1585844891.0,
            "replies": [
                {
                    "body": "[removed]",
                    "author": null,
                    "id": "fm8a5cx",
                    "parent_id": "t1_fm88pu5",
                    "score": -2,
                    "created_utc": 1585845645.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "fm8aehu",
                            "parent_id": "t1_fm8a5cx",
                            "score": 6,
                            "created_utc": 1585845776.0,
                            "replies": [
                                {
                                    "body": "Exactly!",
                                    "author": "LikeHoney99",
                                    "id": "fm8bfj1",
                                    "parent_id": "t1_fm8aehu",
                                    "score": 2,
                                    "created_utc": 1585846315.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "I don’t even HAVE IG.....doesn’t make me any less irritated by your attitude 😉",
                            "author": "LikeHoney99",
                            "id": "fm8ggth",
                            "parent_id": "t1_fm8a5cx",
                            "score": 6,
                            "created_utc": 1585848960.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Sugar dating is a form of dating to me, therefore I think it’s perfectly fine to look for a SD on a dating app. But what do I know, I’m a fool who has never been on a date.",
            "author": null,
            "id": "fm8rt62",
            "parent_id": "t1_fm8q5tq",
            "score": 4,
            "created_utc": 1585854827.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "fm8u46k",
                    "parent_id": "t1_fm8rt62",
                    "score": 0,
                    "created_utc": 1585856060.0,
                    "replies": [
                        {
                            "body": "> I am not saying it doesn't work; just that Tinder is not meant for arrangements, it is obviously not allowed and you are rightfully reported when it happens because you are wrong\n\n\nBeing banned just means that some tinder users decide they don’t want arrangements on the app and they report. That doesn’t mean that it’s not allowed. Tinder doesn’t investigate anything. I don’t know how many times I have to repeat that sugar dating doesn’t go against any Tinder rule. \n\nIn my part of the world you’re more likely to get banned if you’re a transgender person than a sugar baby. Doesn’t mean that being trans is against any tinder rule",
                            "author": null,
                            "id": "fm8ushj",
                            "parent_id": "t1_fm8u46k",
                            "score": 3,
                            "created_utc": 1585856418.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Interesting! I’m sure that some things go against the rules, such as asking for a M&G fee, asking for ppm (also not allowed on SA), and surely others. \n\nUnfortunately all you need in order to get banned on tinder is for enough people to press “report”, they don’t investigate. People in my location don’t care but I’ve traveled to other places and was reported several times in the same area.",
            "author": null,
            "id": "fma7kde",
            "parent_id": "t1_fma6fkm",
            "score": 1,
            "created_utc": 1585885875.0,
            "replies": []
        },
        {
            "body": "[removed]",
            "author": null,
            "id": "fm8a5cx",
            "parent_id": "t1_fm88pu5",
            "score": -2,
            "created_utc": 1585845645.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "fm8aehu",
                    "parent_id": "t1_fm8a5cx",
                    "score": 6,
                    "created_utc": 1585845776.0,
                    "replies": [
                        {
                            "body": "Exactly!",
                            "author": "LikeHoney99",
                            "id": "fm8bfj1",
                            "parent_id": "t1_fm8aehu",
                            "score": 2,
                            "created_utc": 1585846315.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "I don’t even HAVE IG.....doesn’t make me any less irritated by your attitude 😉",
                    "author": "LikeHoney99",
                    "id": "fm8ggth",
                    "parent_id": "t1_fm8a5cx",
                    "score": 6,
                    "created_utc": 1585848960.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "fm8u46k",
            "parent_id": "t1_fm8rt62",
            "score": 0,
            "created_utc": 1585856060.0,
            "replies": [
                {
                    "body": "> I am not saying it doesn't work; just that Tinder is not meant for arrangements, it is obviously not allowed and you are rightfully reported when it happens because you are wrong\n\n\nBeing banned just means that some tinder users decide they don’t want arrangements on the app and they report. That doesn’t mean that it’s not allowed. Tinder doesn’t investigate anything. I don’t know how many times I have to repeat that sugar dating doesn’t go against any Tinder rule. \n\nIn my part of the world you’re more likely to get banned if you’re a transgender person than a sugar baby. Doesn’t mean that being trans is against any tinder rule",
                    "author": null,
                    "id": "fm8ushj",
                    "parent_id": "t1_fm8u46k",
                    "score": 3,
                    "created_utc": 1585856418.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "fm8aehu",
            "parent_id": "t1_fm8a5cx",
            "score": 6,
            "created_utc": 1585845776.0,
            "replies": [
                {
                    "body": "Exactly!",
                    "author": "LikeHoney99",
                    "id": "fm8bfj1",
                    "parent_id": "t1_fm8aehu",
                    "score": 2,
                    "created_utc": 1585846315.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I don’t even HAVE IG.....doesn’t make me any less irritated by your attitude 😉",
            "author": "LikeHoney99",
            "id": "fm8ggth",
            "parent_id": "t1_fm8a5cx",
            "score": 6,
            "created_utc": 1585848960.0,
            "replies": []
        },
        {
            "body": "> I am not saying it doesn't work; just that Tinder is not meant for arrangements, it is obviously not allowed and you are rightfully reported when it happens because you are wrong\n\n\nBeing banned just means that some tinder users decide they don’t want arrangements on the app and they report. That doesn’t mean that it’s not allowed. Tinder doesn’t investigate anything. I don’t know how many times I have to repeat that sugar dating doesn’t go against any Tinder rule. \n\nIn my part of the world you’re more likely to get banned if you’re a transgender person than a sugar baby. Doesn’t mean that being trans is against any tinder rule",
            "author": null,
            "id": "fm8ushj",
            "parent_id": "t1_fm8u46k",
            "score": 3,
            "created_utc": 1585856418.0,
            "replies": []
        },
        {
            "body": "Exactly!",
            "author": "LikeHoney99",
            "id": "fm8bfj1",
            "parent_id": "t1_fm8aehu",
            "score": 2,
            "created_utc": 1585846315.0,
            "replies": []
        }
    ]
}