{
    "title": "Thoughts on the lifestyle from a 27 year old SD",
    "post_id": "vvgm2o",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/vvgm2o/thoughts_on_the_lifestyle_from_a_27_year_old_sd/",
    "author": "Late_Ad_6293",
    "body": "I’ve noticed many girls telling me that more and more younger guys are trying to get into this lifestyle.\n\nI started when I was 24 so I think I can give you all some wonderful insight.\n\nFirst off, I had money generational wealth. If you don’t have money I HIGHLY suggest you stay away from this lifestyle and work or you will quickly burn away cash that you probably need.\n\nI understand that many younger guys are coming onto this lifestyle because modern dating and dating apps is very much against you. You will NOT find love here. Most of these girls are looking for a fun time and to be paid, that is all. You are in a sense being used, do not think anything other than this. That being said you are also “using” them. That is why often people start to feel that these types of relationship feel “transactional”. If you are nodding your head to all of this then ok congratulations I think you’re ready to jump in. 1. Just because you’re young doesn’t mean girls will lower their allowance expectations for you 2. Don’t want to feel transactional? Get some actual chemistry going on then. Make her laugh. Make it feel normal, otherwise it’s time to leave the bowl or find someone else 3. BE SAFE, it’s very easy in this lifestyle to have multiple partners so stay safe.\n\nI have been robbed, forced into intimacy, blackmailed and scammed. These will happen to you. You can be the smartest man but one mistake led by your other head can land you exactly where I was too.\n\nI have also spent too much money than I probably shouldn’t have.\nGuys, relationships/sex aren’t traits that make a man. Don’t set value of yourself based on that or you will regret it.\n\nThat being all said:\nI am officially going to retire. I noticed I have begun to see women in a darker light which stems from being involved in this lifestyle. Wishing no longer to behave this way I am taking my leave.\n\nEdit:\nPeople seem to think I’ve only had bad experiences.\nI have had WONDERFUL experiences in this lifestyle and even turned sugar relationships into vanilla ones. This lifestyle can be very fun if you have the means and can handle the risks / emotions involved in it. It’s not for everyone but for those that it appeals to, it’s a nice time.",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/vvgm2o/thoughts_on_the_lifestyle_from_a_27_year_old_sd/",
    "score": 106,
    "upvote_ratio": 0.89,
    "created_utc": 1657417528.0,
    "num_comments": 127,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "This is one of the best posts I have seen on this subreddit.\n\nTake care of yourself OP. I think I’m going to retire from this lifestyle as well.",
            "author": null,
            "id": "ifkkf85",
            "parent_id": "t3_vvgm2o",
            "score": 14,
            "created_utc": 1657437843.0,
            "replies": [
                {
                    "body": "To think I just made this post on a whim.",
                    "author": "Late_Ad_6293",
                    "id": "ifklqqp",
                    "parent_id": "t1_ifkkf85",
                    "score": 5,
                    "created_utc": 1657438913.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "ifjqv3p",
            "parent_id": "t3_vvgm2o",
            "score": 32,
            "created_utc": 1657419285.0,
            "replies": [
                {
                    "body": "I like to think my father aged me faster with all of the stuff he threw at me which led me to take on a different mindset in my 20’s",
                    "author": "Late_Ad_6293",
                    "id": "ifjrzsf",
                    "parent_id": "t1_ifjqv3p",
                    "score": 23,
                    "created_utc": 1657419866.0,
                    "replies": [
                        {
                            "body": "That's not necessarily a bad thing tho.\nQuite the opposite actually.\nI basically raised my younger siblings until I became emancipated and finally was able to escape.\n\nDid it suck?\nFuuuuuuuuuuuuuuuuuck YES!!!!\n\nBuuut....\nIt showed me a lot of the World, and taught me to see people in a different way than most do.\n\nBtw, This is usually a trauma response. \nJust because it's caused from something crappy, it DOESNT mean that you can't take and MAKE a shit sandwich into something better....it's all in you!",
                            "author": "JustAsk4Alice",
                            "id": "ifjvzj9",
                            "parent_id": "t1_ifjrzsf",
                            "score": 8,
                            "created_utc": 1657421948.0,
                            "replies": [
                                {
                                    "body": "In hindsight I’m glad he did it wasn’t a bad thing at all.",
                                    "author": "Late_Ad_6293",
                                    "id": "ifjwk4m",
                                    "parent_id": "t1_ifjvzj9",
                                    "score": 9,
                                    "created_utc": 1657422245.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I vanilla dated in Los Angeles. Numerous dates tried to kidnap me. I would jump out at stop signs or stop lights. Numerous men attempting sex when I was asleep. One left my apartment door wide open when I was asleep and thank GOD I wasn’t murdered. \n\nLA is by FAR the craziest place I’ve ever dated in.",
            "author": "MapleSappling",
            "id": "ifjuwo1",
            "parent_id": "t3_vvgm2o",
            "score": 25,
            "created_utc": 1657421381.0,
            "replies": [
                {
                    "body": "Oh yeah I can only speak for younger men, I have NO idea what this life is like for women",
                    "author": "Late_Ad_6293",
                    "id": "ifjwbhx",
                    "parent_id": "t1_ifjuwo1",
                    "score": 8,
                    "created_utc": 1657422120.0,
                    "replies": [
                        {
                            "body": "It’s wild. I think what would have helped me was way more question asking, way more vetting, looking up public records, daytime only dating and in public places, never deleting a single photo or picture.",
                            "author": "MapleSappling",
                            "id": "ifjxhty",
                            "parent_id": "t1_ifjwbhx",
                            "score": 4,
                            "created_utc": 1657422740.0,
                            "replies": [
                                {
                                    "body": "I don’t know about you, but I have become a CSI level stalk master lol. I can trust trust trust, but it works BOTH ways.",
                                    "author": "Kindly-Hour-4650",
                                    "id": "ifldu48",
                                    "parent_id": "t1_ifjxhty",
                                    "score": 3,
                                    "created_utc": 1657459824.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "That sounds crazy .. \nYou make me feel I live in such a sheltered life 😊",
                    "author": null,
                    "id": "ifkf7wx",
                    "parent_id": "t1_ifjuwo1",
                    "score": 1,
                    "created_utc": 1657433796.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "First off, you shouldn't be sugaring as an SD in your 20s, period. That's just way too young. And as you've found out, it gets extremely expensive, even coming in with old money like you, being in the bowl for 4 solid years has set you back a shitload. You should have spent that time getting experience in vanilla relationships , saving and investing as these are your prime earning years. I think a lot of young dudes just think, im not good with women so ill just get a sugar baby and ill be happy because shes having sex with me. Then they realize the woman doesnt really like them and is only seeing them for the money. Paying someone for companionship doesn't automatically make you a good boyfriend / lover.  It can really start to mess with your head and sometimes its better to just be single than directly  paying for companionship lol. I agree with pretty much everything else. The bowl is a black hole.",
            "author": "malcolm_reyn0lds",
            "id": "ifkv0tv",
            "parent_id": "t3_vvgm2o",
            "score": 18,
            "created_utc": 1657446815.0,
            "replies": [
                {
                    "body": "This. I’m glad sugar didn’t exist in its current form when I was in my 20’s. I had the income…. But it would have messed up my life, probably prevented marriage, and my kids…. So much would have gone wrong for me.",
                    "author": "MammothInevitable671",
                    "id": "ifl8txx",
                    "parent_id": "t1_ifkv0tv",
                    "score": 3,
                    "created_utc": 1657457060.0,
                    "replies": [
                        {
                            "body": "I also had the income in my 20s and wish that I had discovered sugar dating and pursued it.  Maybe it would have prevented me from marrying a horrible, evil woman.",
                            "author": "MrBigCoc",
                            "id": "ifmg1b7",
                            "parent_id": "t1_ifl8txx",
                            "score": 3,
                            "created_utc": 1657476649.0,
                            "replies": [
                                {
                                    "body": "You would have still married a horrible woman, just one that was also money hungry.",
                                    "author": "malcolm_reyn0lds",
                                    "id": "ifond4p",
                                    "parent_id": "t1_ifmg1b7",
                                    "score": 1,
                                    "created_utc": 1657513797.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "Seriously. It's a shortcut with major drawbacks. You start getting involved with people who wouldn't be with you if it weren't for the money at a young age and it will really warp your mind and perspective. If you are a young guy with money, invest it. Save. Buy property. Get your ass in the gym and look good. Travel the world and meet new people. Date normally and get better with women. If you are in your 20s with a lot of money and confident in your looks you shouldn't have any problems finding and meeting women.",
                            "author": "malcolm_reyn0lds",
                            "id": "iflf5qr",
                            "parent_id": "t1_ifl8txx",
                            "score": 4,
                            "created_utc": 1657460492.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "You're so right. I started sugaring in my early 30s and I'm glad it wasn't available when I was in my 20s. I would have never pushed myself to date women in the vanilla world.  \n\n\nThe online dating is so bad that SDs and SBs have the same age. That says a lot about the dating market.",
                    "author": "hoptohop",
                    "id": "ifo1t1k",
                    "parent_id": "t1_ifkv0tv",
                    "score": 1,
                    "created_utc": 1657502654.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "This is so refreshing for this forum, and well written OP. \n\nOn a date recently a POT told me how he could never date a stripper, because of her views on men/how men have treated her at work. I told him anyone can become exhausted and get a darker perspective at work - on truly any group of people. \n\nDarlene Bower was a diner waitress in a small town NY, murdered with a hammer by her favorite customer. The instincts you learn in iffy situations really help in the long run. \n\nI didn't bring up the diner waitress who was obsessed over by truckers and locals of the town, but that's just an easy example of a regular person who didn't see people in a 'darker light.' I think the darkness makes you grateful for the well-lit people in your life or that you come to meet. And more careful in dim situations",
            "author": "Dull-Resolution3246",
            "id": "ifl7dyp",
            "parent_id": "t3_vvgm2o",
            "score": 6,
            "created_utc": 1657456171.0,
            "replies": [
                {
                    "body": ">Darlene Bower\n\nI just [read about her death](https://mikedilloninaminorkey.com/1997/01/01/lonely-men-confuse-the-message/) from the perspective of a friend. \"Lonely men confuse the message\". Chilling.",
                    "author": "FunnyFruit100",
                    "id": "ifowd7y",
                    "parent_id": "t1_ifl7dyp",
                    "score": 2,
                    "created_utc": 1657519720.0,
                    "replies": [
                        {
                            "body": "I heard her story on an episode of Small Town Murder. I think OP's post is written in an experienced and thoughtful way. No matter how nice someone is to you, having things in common/having mutual attraction - there's always possibility of risk. Sugaring is dangerous in so many tiers of development. I meant what I said when anyone can work/be involved in something and become wary of a group of people. A stripper, a SD, even a diner waitress. \n\nMistrust is good to learn early on. Knowing when to stop sugaring before becoming jaded is admirable.",
                            "author": "Dull-Resolution3246",
                            "id": "ifozvto",
                            "parent_id": "t1_ifowd7y",
                            "score": 2,
                            "created_utc": 1657522332.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I originally came into this post expecting it to be trash but I was happily surprised. You summed it up well.\n\nI haven’t been robbed but I have been blackmailed and harassed. It’s demoralizing. You really need to treat every initial interaction with trepidation.",
            "author": null,
            "id": "ifjp1ro",
            "parent_id": "t3_vvgm2o",
            "score": 12,
            "created_utc": 1657418357.0,
            "replies": [
                {
                    "body": "Being robbed was what led me to carrying concealed in the State of California. It was actually my FIRST meet and greet believe it or not 😂😂.\n\nHad a walk in the park chatting and then was lead to secluded area where I had a larger gentleman politely ask me for some gas money while my date walked over behind him.",
                    "author": "Late_Ad_6293",
                    "id": "ifjqbzu",
                    "parent_id": "t1_ifjp1ro",
                    "score": 18,
                    "created_utc": 1657419013.0,
                    "replies": [
                        {
                            "body": "What happens now a days?  I never carry cash. Do bums take Venmo now?",
                            "author": "aajniojnoihnoi",
                            "id": "ifjqwzt",
                            "parent_id": "t1_ifjqbzu",
                            "score": 10,
                            "created_utc": 1657419311.0,
                            "replies": [
                                {
                                    "body": "Bahaha, funnily enough another time I was in an attempted robbery I didn’t carry cash and was going to pull the venmo at the end of the day so it was quite the awkward situation.\n\nThis date though had explicitly asked for cash and then even asked to SEE it when the date began. As it was my first date, I didn’t think anything of the red flags.",
                                    "author": "Late_Ad_6293",
                                    "id": "ifjr5z2",
                                    "parent_id": "t1_ifjqwzt",
                                    "score": 11,
                                    "created_utc": 1657419440.0,
                                    "replies": [
                                        {
                                            "body": "Asking to see the cash would have had me making for a quick exit.",
                                            "author": "aajniojnoihnoi",
                                            "id": "ifjsgcc",
                                            "parent_id": "t1_ifjr5z2",
                                            "score": 8,
                                            "created_utc": 1657420108.0,
                                            "replies": [
                                                {
                                                    "body": "I was young, dumb, and new. 🤷‍♂️ no excuses",
                                                    "author": "Late_Ad_6293",
                                                    "id": "ifjsowe",
                                                    "parent_id": "t1_ifjsgcc",
                                                    "score": 6,
                                                    "created_utc": 1657420235.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "I was caught off guard when a Streetwise (local publication that helps the homeless restart their lives) vendor called me out when I said I didn’t have cash by showing me they took Venmo and Zelle.\n\nSo yeah, I think it’s possible they’d hold you at gun point to do that.",
                                    "author": null,
                                    "id": "ifjrnzl",
                                    "parent_id": "t1_ifjqwzt",
                                    "score": 5,
                                    "created_utc": 1657419697.0,
                                    "replies": [
                                        {
                                            "body": "In Mexico they have express kidnappings where they drive you from ATM to ATM until you hit your withdrawal limit.",
                                            "author": "aajniojnoihnoi",
                                            "id": "ifjslc4",
                                            "parent_id": "t1_ifjrnzl",
                                            "score": 6,
                                            "created_utc": 1657420183.0,
                                            "replies": [
                                                {
                                                    "body": "Happens in the US, too.",
                                                    "author": null,
                                                    "id": "ifjsxnv",
                                                    "parent_id": "t1_ifjslc4",
                                                    "score": 1,
                                                    "created_utc": 1657420360.0,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "body": "A lot of street newspapers vendors do accept venmo (and many unhoused people have a cell phone). \n\nI wouldn't classify those folks as bums though. Those are just very poor people trying to make an honest living and unlike panhandlers, they do provide value.",
                                            "author": "LightOLove",
                                            "id": "iflf2nq",
                                            "parent_id": "t1_ifjrnzl",
                                            "score": -1,
                                            "created_utc": 1657460450.0,
                                            "replies": [
                                                {
                                                    "body": "I didn’t call them bums.",
                                                    "author": null,
                                                    "id": "iflhcqp",
                                                    "parent_id": "t1_iflf2nq",
                                                    "score": 1,
                                                    "created_utc": 1657461572.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "Shiiiiit, you joke, there's plllllllenty of Homeless with cashapp and venmo!!!!!😳",
                                    "author": "JustAsk4Alice",
                                    "id": "ifjw8mk",
                                    "parent_id": "t1_ifjqwzt",
                                    "score": 1,
                                    "created_utc": 1657422078.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "Fuck that so fucking hard. I always make sure to have pepper spray because I’m not a fan of firearms at all.",
                            "author": null,
                            "id": "ifjqtzv",
                            "parent_id": "t1_ifjqbzu",
                            "score": 6,
                            "created_utc": 1657419270.0,
                            "replies": []
                        },
                        {
                            "body": "To be fair, you could meet a girl on tinder vanilla dating, you still get robbed .. \n\nI often think it’s never the platform it’s people. \n\nLook at seek, some seek NSA, some seek true love.",
                            "author": null,
                            "id": "ifkfpjx",
                            "parent_id": "t1_ifjqbzu",
                            "score": 2,
                            "created_utc": 1657434158.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "im in my early 30s and started around 25 (am an SD here)\n\n\n\ntotally get why you're retiring..you get jaded real quick humanity in general. the amount of women on these sites that are in LTRs or even married is ..uhh..interesting.",
            "author": "vtec__",
            "id": "ifk7cex",
            "parent_id": "t3_vvgm2o",
            "score": 12,
            "created_utc": 1657428376.0,
            "replies": [
                {
                    "body": "That applies to men as well to be fair… wouldnt blame women for being promiscuous when men are as well",
                    "author": "DarcyBennet81",
                    "id": "ifl9q82",
                    "parent_id": "t1_ifk7cex",
                    "score": 7,
                    "created_utc": 1657457588.0,
                    "replies": [
                        {
                            "body": "a man being promiscuous is very different than a woman being promiscuos. very few men can be in these streets (most dont have the looks or money) while any reasonably attractive woman can be.",
                            "author": "vtec__",
                            "id": "ifldybz",
                            "parent_id": "t1_ifl9q82",
                            "score": -3,
                            "created_utc": 1657459883.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "ifk46zc",
            "parent_id": "t3_vvgm2o",
            "score": 7,
            "created_utc": 1657426476.0,
            "replies": [
                {
                    "body": "I’m not saying I didn’t have great experiences!! Haha I was just giving a warning to what I think is a bunch of  young guys not knowing what they’re going into.\n\nI have had some bad experiences but I’ve had tons of fun in this lifestyle ! I don’t regret a thing. My own personal problems for retiring just come from my own mindset.",
                    "author": "Late_Ad_6293",
                    "id": "ifk53a5",
                    "parent_id": "t1_ifk46zc",
                    "score": 3,
                    "created_utc": 1657426997.0,
                    "replies": [
                        {
                            "body": "Did you date all ages of women? Just curious. I am very particular and if there is even the slightest bit of hesitation or doubt in my mind, I am honest and tell the SD I don't want to move forward. In vanilla dating, I usually dated younger men but in the bowl it's been older. It's a bummer you've had this experience. Hopefully you meet someone with true connection who knows nothing about your wealth at a party or park. Best wishes!",
                            "author": "iamrosieriley",
                            "id": "ifkwy16",
                            "parent_id": "t1_ifk53a5",
                            "score": 1,
                            "created_utc": 1657448485.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "First, I should stop trying to Reddit so sleep deprived. I have been trying to type for far to long now. \n\nBut really what I’m doing is agreeing with you. It’s just becoming maddening. Fuck it.. I’m over this lol",
                    "author": "Kindly-Hour-4650",
                    "id": "ifkzyyf",
                    "parent_id": "t1_ifk46zc",
                    "score": 2,
                    "created_utc": 1657450967.0,
                    "replies": []
                },
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "ifk4on0",
                    "parent_id": "t1_ifk46zc",
                    "score": 1,
                    "created_utc": 1657426763.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Good job leaving the bowl 👏👏👏 specially at your age , it can damage you.",
            "author": "Resolve-Brilliant",
            "id": "ifjvuq7",
            "parent_id": "t3_vvgm2o",
            "score": 5,
            "created_utc": 1657421877.0,
            "replies": []
        },
        {
            "body": "I think long term sugaring is damaging your mentality for both men and women.. \n\nTo be honest, all relationships can seem transactional. A wife and a husband married for 30 years and wife still gets her monthly allowances to pay for all house pills and buy herself stuff. That’s also a type of allowances. \n\nTo me, only time matters. You fuck once it’s a hookup, you fuck a night it’s one night stand. You fuck for a lifetime, it’s marriage. \n\nThere is a difference between I choose you then I take your money and I choose your money first then I take you.",
            "author": null,
            "id": "ifkfipp",
            "parent_id": "t3_vvgm2o",
            "score": 6,
            "created_utc": 1657434018.0,
            "replies": [
                {
                    "body": "Thank you for this. I have to save this one .",
                    "author": "Late_Ad_6293",
                    "id": "ifkkcrh",
                    "parent_id": "t1_ifkfipp",
                    "score": 1,
                    "created_utc": 1657437788.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "How much money did you spend in bowl over years/per year? How often did you get dates? Any long term SRs?",
            "author": "IllustriousCake8030",
            "id": "ifjy6de",
            "parent_id": "t3_vvgm2o",
            "score": 2,
            "created_utc": 1657423106.0,
            "replies": [
                {
                    "body": "I’m pretty sure you can’t disclose that info but anything from 500 to 1200 a date.\n4 long term SR’s. Many short term ones, probably more than 20 less than 30.\nAverage 18-28k a year.\nDates? Depends on the girl but I’d say average 1 date every other week.",
                    "author": "Late_Ad_6293",
                    "id": "ifjytp9",
                    "parent_id": "t1_ifjy6de",
                    "score": 3,
                    "created_utc": 1657423456.0,
                    "replies": [
                        {
                            "body": "Nice! That is not super excessive…i usually do one date per week sometimes 2… I bet you will be back in bowl…..nothing can match the bowl experience :)",
                            "author": "IllustriousCake8030",
                            "id": "ifk2blq",
                            "parent_id": "t1_ifjytp9",
                            "score": 0,
                            "created_utc": 1657425401.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "This post is the GOAT. So much enlightenment. Congrats 🎉🍾🎊",
            "author": "Zealousideal_Reach31",
            "id": "ifl7719",
            "parent_id": "t3_vvgm2o",
            "score": 2,
            "created_utc": 1657456049.0,
            "replies": []
        },
        {
            "body": "The truth is looks don’t mean anything when it comes to personality.\n\n If she is super hot but has no career, goals, etc and wants to just be provided for simply because she is super hot she will probably have narcissism, bpd or other personality disorders. most super hot women who have careers (physician, high finance) end up finding a man they have stuff in common with instead of looking on a sugar dating website. The ones who are rational, educated and understand the world but are also beautiful and are looking for a partner who has money are harder than you think to find.",
            "author": "Famous_Donut9747",
            "id": "iflb7a6",
            "parent_id": "t3_vvgm2o",
            "score": 1,
            "created_utc": 1657458423.0,
            "replies": []
        },
        {
            "body": "I expected to be rolling my eyes at this 27yo SD but damn, OP's wise beyond his years.\n\n>Just because you’re young doesn’t mean girls will lower their allowance expectations for you \n\nSay it louder for all the young \"i'm not old and wrinkly\" splenda SDs in back!",
            "author": "kingporterstomp",
            "id": "ifk1o2q",
            "parent_id": "t3_vvgm2o",
            "score": 5,
            "created_utc": 1657425027.0,
            "replies": []
        },
        {
            "body": "Seems like you need to screen better. But who am I to tell another man how to spend their money? Looks like you had some good times, regardless. Farewell for now!",
            "author": "SDinAsia",
            "id": "ifjp4ib",
            "parent_id": "t3_vvgm2o",
            "score": 3,
            "created_utc": 1657418398.0,
            "replies": [
                {
                    "body": "Bahaha oh I screened but sometimes you just want to believe in the unbelievable !! 😂😂😂 every red flag was going off but I wanted it to be true!!!\n\nIt’s funny cuz as it happened I go “haha I KNEW IT”",
                    "author": "Late_Ad_6293",
                    "id": "ifjpac3",
                    "parent_id": "t1_ifjp4ib",
                    "score": 7,
                    "created_utc": 1657418479.0,
                    "replies": [
                        {
                            "body": "I'm guessing your wealth and youth may have made you a target for unscrupulous women as well, unfortunately.",
                            "author": "SDinAsia",
                            "id": "ifjpssi",
                            "parent_id": "t1_ifjpac3",
                            "score": 2,
                            "created_utc": 1657418740.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "What brought you to the bowl? A wealthy 20-something shouldn’t have too much trouble on the vanilla dating scene.",
            "author": "midwesternguru",
            "id": "ifjp9a8",
            "parent_id": "t3_vvgm2o",
            "score": 2,
            "created_utc": 1657418464.0,
            "replies": [
                {
                    "body": "While I am wealthy, I am not particularly the best looking. I’m fit but I’m sure my face is ugly otherwise I wouldn’t have no matches on the dating apps.\nAlso I wasn’t really looking for relationships. I wanted to meet hot girls and have fun. I live a very busy lifestyle due to my generational wealth. My father lives up my ass and I have very limited free time. I also come from a traditional family that believes in arranged marriages (no my skin color is not brown am not Indian) so having to make time for a girlfriend where it would lead nowhere seemed like a big waste of time for me.\nWith sugaring, I got everything I wanted but with the con of now seeing the female population in a different light.",
                    "author": "Late_Ad_6293",
                    "id": "ifjprf6",
                    "parent_id": "t1_ifjp9a8",
                    "score": 10,
                    "created_utc": 1657418720.0,
                    "replies": [
                        {
                            "body": "Hopefully being out of the bowl will bring some light back to you.",
                            "author": "ShaArt5",
                            "id": "ifjr4ce",
                            "parent_id": "t1_ifjprf6",
                            "score": 4,
                            "created_utc": 1657419417.0,
                            "replies": [
                                {
                                    "body": "Don’t think it will but I am hoping to forget the stuff I saw / heard so I don’t have that negativity in my head.",
                                    "author": "Late_Ad_6293",
                                    "id": "ifjrasu",
                                    "parent_id": "t1_ifjr4ce",
                                    "score": 5,
                                    "created_utc": 1657419510.0,
                                    "replies": [
                                        {
                                            "body": "I hope that for you as well. And that you gain a bit more freedom.",
                                            "author": "ShaArt5",
                                            "id": "ifjrphq",
                                            "parent_id": "t1_ifjrasu",
                                            "score": 4,
                                            "created_utc": 1657419718.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "Remember the bowl attracts a small part of the overall population, and certain tendicies / traits / personal motives are attracted to it more frequently than others. \n\nAnd your approach of meet hot girls and have fun certainly didn’t help you filter away from that. \n\nThat said, good luck in your step away from the bowl and I wish you success outside of it.",
                                            "author": "midwesternguru",
                                            "id": "ifm7zcp",
                                            "parent_id": "t1_ifjrasu",
                                            "score": 2,
                                            "created_utc": 1657473191.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "I might be able to help you with that part.",
                                            "author": "JustAsk4Alice",
                                            "id": "ifjxa09",
                                            "parent_id": "t1_ifjrasu",
                                            "score": 0,
                                            "created_utc": 1657422625.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "Why did you have to clarify that you’re not brown ?",
                            "author": "lizliz1020",
                            "id": "ifjs75q",
                            "parent_id": "t1_ifjprf6",
                            "score": 3,
                            "created_utc": 1657419974.0,
                            "replies": [
                                {
                                    "body": "Because usually when I say arranged marriage people think I am brown or Indian. I am white and slavic. I don’t want people to assume I am representing a group of people that I am not.",
                                    "author": "Late_Ad_6293",
                                    "id": "ifjsj6j",
                                    "parent_id": "t1_ifjs75q",
                                    "score": 13,
                                    "created_utc": 1657420152.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "Now is a better time than ever to break the tradition of arranged marriage in your family, FUCK THAT. Break the cycle now and tell your parents you are absolutely 100% not entering an arranged marriage. \n\nSuch a shitty thing for parents to do to their kids, tradition be damned.",
                            "author": "contento2021",
                            "id": "ifk6tog",
                            "parent_id": "t1_ifjprf6",
                            "score": 3,
                            "created_utc": 1657428050.0,
                            "replies": [
                                {
                                    "body": "Respectfully fuck you. Tradition and my parents are probably the main reasons why I am successful in life. \n\nI never once said I was against arranged marriages, I just said that it would be flawed to lead girls on when I am never going to be seriously committed to the relationship. I am 100% FOR it.",
                                    "author": "Late_Ad_6293",
                                    "id": "ifk73yu",
                                    "parent_id": "t1_ifk6tog",
                                    "score": 5,
                                    "created_utc": 1657428228.0,
                                    "replies": [
                                        {
                                            "body": "Ah so your parents have successfully indoctrinated the next generation of brainless sheep, respectfully. One day you'll get to treat your own kids like chattel!",
                                            "author": "contento2021",
                                            "id": "ifk7d0w",
                                            "parent_id": "t1_ifk73yu",
                                            "score": 4,
                                            "created_utc": 1657428387.0,
                                            "replies": [
                                                {
                                                    "body": "First off did I say I was being forced into it?\n\nMy parents have given me the option to choose. I don’t want to as I am for arranged marriages. My brother chose his own wife as he didn’t believe in arranged.\nYou sir have no idea about how my family works and what I will employ to my own children.\n\nSounds like you’re projecting what happened to you.",
                                                    "author": "Late_Ad_6293",
                                                    "id": "ifk7u4l",
                                                    "parent_id": "t1_ifk7d0w",
                                                    "score": 4,
                                                    "created_utc": 1657428685.0,
                                                    "replies": [
                                                        {
                                                            "body": "Gotta admit... I'm having trouble reconciling how you're simultaneously pro-arranged marriage and yet also attracted to sugar dating.",
                                                            "author": null,
                                                            "id": "ifk9w29",
                                                            "parent_id": "t1_ifk7u4l",
                                                            "score": 4,
                                                            "created_utc": 1657430013.0,
                                                            "replies": [
                                                                {
                                                                    "body": "One can do anything and have fun before marriage and then once marriage happens you can settle down.\n\nThat’s how I think about it.",
                                                                    "author": "Late_Ad_6293",
                                                                    "id": "ifkb0on",
                                                                    "parent_id": "t1_ifk9w29",
                                                                    "score": 3,
                                                                    "created_utc": 1657430780.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "It almost sounds like you're expecting the fun to stop when you're wed though.\n\nI dunno, coming from a family with lots of toxic and failed arranged marriages around me, I don't see the appeal that you're evidently finding in i. You do you if it makes you happy though",
                                                                            "author": null,
                                                                            "id": "ifkbblx",
                                                                            "parent_id": "t1_ifkb0on",
                                                                            "score": 2,
                                                                            "created_utc": 1657430992.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "I don’t expect to cheat on my wife if that’s what you’re suggesting?\n\nSorry to hear the marriages didn’t work in your family",
                                                                                    "author": "Late_Ad_6293",
                                                                                    "id": "ifkkjun",
                                                                                    "parent_id": "t1_ifkbblx",
                                                                                    "score": 1,
                                                                                    "created_utc": 1657437946.0,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "I relate to this so much. Agreed",
                                    "author": "lipstickdiet",
                                    "id": "ifkihtj",
                                    "parent_id": "t1_ifk6tog",
                                    "score": 1,
                                    "created_utc": 1657436305.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "I think this is where you are wrong about your first point. If you are young AND good looking then a lot of SB’s will lower their allowance expectations, and/or offer to date you for free. You are young but not good looking from what you just wrote.",
                            "author": null,
                            "id": "ifjra62",
                            "parent_id": "t1_ifjprf6",
                            "score": 1,
                            "created_utc": 1657419501.0,
                            "replies": [
                                {
                                    "body": "I’d say I’m average. Not ugly, just average.\nMost SB’s would make comments about it. I could tell they were genuine but common sense is common sense. Attractive guys will get better opportunities.\n\nHowever my point is that if a girl is offering you a PPM / allowance she has already made that decision.\n\nMy first point was that some of these guys will go “I’ll give you xx for the date because I’m so young and not ugly so it’s still good right?”\nA few hundred dollars off is expected for being good looking / younger but going 70-90% lower? Good luck partner",
                                    "author": "Late_Ad_6293",
                                    "id": "ifjrqo7",
                                    "parent_id": "t1_ifjra62",
                                    "score": 5,
                                    "created_utc": 1657419736.0,
                                    "replies": [
                                        {
                                            "body": "You’d be surprised.",
                                            "author": null,
                                            "id": "ifjs0pc",
                                            "parent_id": "t1_ifjrqo7",
                                            "score": 2,
                                            "created_utc": 1657419880.0,
                                            "replies": [
                                                {
                                                    "body": "Hey I’ve seen it happen but just setting realistic expectations. That’s rare and often gets messy ;)",
                                                    "author": "Late_Ad_6293",
                                                    "id": "ifjs4gf",
                                                    "parent_id": "t1_ifjs0pc",
                                                    "score": 3,
                                                    "created_utc": 1657419935.0,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "body": "Thought young girls nowadays just hookup .. 🤔\n\nThe white girls in NZ go clubbing on Friday then hookup with a dude when they get drunk, wake up the next day and look at him thinking not too bad, then a relationship is created .. for about 3 weeks then they repeat again ..",
                                            "author": null,
                                            "id": "ifkg5o9",
                                            "parent_id": "t1_ifjrqo7",
                                            "score": 1,
                                            "created_utc": 1657434495.0,
                                            "replies": [
                                                {
                                                    "body": "That’s the same here in the US. If someone really wants to hook up there are plenty of ways for them to do it.\nIf someone is looking for a certain demographic though I think they would have trouble even in the clubs haha",
                                                    "author": "Late_Ad_6293",
                                                    "id": "ifkk5qb",
                                                    "parent_id": "t1_ifkg5o9",
                                                    "score": 1,
                                                    "created_utc": 1657437632.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": ">If you are young AND good looking then a lot of SB’s will lower their allowance expectations, and/or offer to date you for free.\n\nYes and no. Free is a relative term. Some SBs will do that because, after all, they are women and they want to date a hot young dude. There is nothing surprising there.\n\nBut many of those SBs are likely looking for a husband because that is also what women do. They have fun until they find the 'right one'. If the guy is sufficiently wealthy and falling in love, they don't need to lower the price if they're smart.\n\nYou know what, men do the same thing - have fun dating until Mrs. Right comes along.\n\nWhen you marry a girl the price is actually much higher than dating or sugaring. Youth has nothing to do with it really when it comes to marriage, unless that is what you want to have. Several of my friends have met their young wives through the sugar bowl and had very happy marriages. They were happy because the women were young, beautiful, well-mannered, educated and brought up in good families while the men were old, professional, smart and very wealthy. The women knew they would in all likelihood outlast the men by decades and have tons of money by time they were left single widows in the 30-50 age range. So they made sure to treat the husbands like the personal gold mines they were. And that is exactly what happened in one case already; he died and left her wealthy and single. Their first date was a double date with me and another girl. She's now the Merry Widow.",
                                    "author": "StiffHappens",
                                    "id": "ifk6fj2",
                                    "parent_id": "t1_ifjra62",
                                    "score": 2,
                                    "created_utc": 1657427804.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": ">con of now seeing the female population in a different light.\n\nPerhaps I'm misreading you, but I imagine that the way you see \"the female population\" now is more realistic than before. Is so, why is that a con?",
                            "author": "THROW_AWAY_solution",
                            "id": "ifnkag1",
                            "parent_id": "t1_ifjprf6",
                            "score": 1,
                            "created_utc": 1657494221.0,
                            "replies": [
                                {
                                    "body": "I’d like not to believe that all women are lying to their boyfriends / husbands.\nIf that’s realistic than I hope to back to fantasy lol",
                                    "author": "Late_Ad_6293",
                                    "id": "ifnl42l",
                                    "parent_id": "t1_ifnkag1",
                                    "score": 1,
                                    "created_utc": 1657494608.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "A wealthy any-something never has the option of vanilla. It’s always sugar whether either party realises it or not.",
                    "author": "Neither-Ad-2833",
                    "id": "ifjtt69",
                    "parent_id": "t1_ifjp9a8",
                    "score": 9,
                    "created_utc": 1657420810.0,
                    "replies": [
                        {
                            "body": "This!\nUnless you find a unicorn multi-millionaire hottie who's into you, it's sugar whether you met on SA or tinder",
                            "author": "kingporterstomp",
                            "id": "ifk166v",
                            "parent_id": "t1_ifjtt69",
                            "score": 4,
                            "created_utc": 1657424747.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "This seems like a MGTOW rant.\n\nDating apps are fine. I'm a fat middle aged man and I could get dates with fairly attractive women on tinder. I never paid for any dates from tinder. My last LTR started on tinder.\n\nYes, the women are looking for a good time, but so are the men. So what's your point? Everyone wants to have a good time. Everyone wants to have fun.\n\nThe problem here seems to be your misogynistic attitude, not the women.",
            "author": "AShatteredKing",
            "id": "ifjuds0",
            "parent_id": "t3_vvgm2o",
            "score": -1,
            "created_utc": 1657421105.0,
            "replies": [
                {
                    "body": "I would bet money you didn’t get dates from hot 20 something women on tinder. That’s the demographic the OP is likely targeting.",
                    "author": null,
                    "id": "ifjy7zw",
                    "parent_id": "t1_ifjuds0",
                    "score": 11,
                    "created_utc": 1657423131.0,
                    "replies": [
                        {
                            "body": "I dated in college. I would say my three girlfriends in college were way above my league and pretty hot.\n\nDidn’t have time for dating when I was out of college. So you lost the bet.",
                            "author": "Late_Ad_6293",
                            "id": "ifk2v2z",
                            "parent_id": "t1_ifjy7zw",
                            "score": 2,
                            "created_utc": 1657425711.0,
                            "replies": [
                                {
                                    "body": "I was responding to ashatteredking, not you lol.",
                                    "author": null,
                                    "id": "ifk34tl",
                                    "parent_id": "t1_ifk2v2z",
                                    "score": 2,
                                    "created_utc": 1657425864.0,
                                    "replies": [
                                        {
                                            "body": "Ah sorry just reread. I was responding to the notifications.\nMy apologies.",
                                            "author": "Late_Ad_6293",
                                            "id": "ifk3vq9",
                                            "parent_id": "t1_ifk34tl",
                                            "score": 2,
                                            "created_utc": 1657426291.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "2 ex gfs ago, when I was just shy of 40, I dated a girl that was probably a 7 22 year old. Yes, obviously I can date higher quality women if I'm willing to give them an allowance. It doesn't change what I said.",
                            "author": "AShatteredKing",
                            "id": "ifkeusy",
                            "parent_id": "t1_ifjy7zw",
                            "score": 0,
                            "created_utc": 1657433519.0,
                            "replies": [
                                {
                                    "body": "Great, I’ve vanilla dated several younger women from tinder as well. But that doesn’t mean you were able to do it consistently and effortlessly. I’m sure you put in a lot of work to date that 22 yo, and didn’t have a bunch of 22 yo’s lining up to date you on tinder. \n\nIt’s 10x easier to date those hot 22 yo on seeking. Not sure it’s even debatable.",
                                    "author": null,
                                    "id": "ifl4pf2",
                                    "parent_id": "t1_ifkeusy",
                                    "score": 3,
                                    "created_utc": 1657454417.0,
                                    "replies": [
                                        {
                                            "body": "Yes, of course it's easier to date hot 22 yos on seeking. That doesn't change anything I said.",
                                            "author": "AShatteredKing",
                                            "id": "iflmezz",
                                            "parent_id": "t1_ifl4pf2",
                                            "score": 2,
                                            "created_utc": 1657463886.0,
                                            "replies": [
                                                {
                                                    "body": "Great. So you agree with me.",
                                                    "author": null,
                                                    "id": "iflmhyc",
                                                    "parent_id": "t1_iflmezz",
                                                    "score": 1,
                                                    "created_utc": 1657463922.0,
                                                    "replies": [
                                                        {
                                                            "body": "As I said, your point doesn't change anything I said.",
                                                            "author": "AShatteredKing",
                                                            "id": "ifm09eo",
                                                            "parent_id": "t1_iflmhyc",
                                                            "score": 1,
                                                            "created_utc": 1657469903.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "You got me all wrong. This is far from a MGTOW post and it seems some of the guys in this thread agree with me.\nI even said this was for younger men jumping on here because they feel that way about dating now, not that I felt that way.\nAlso that was my point? Everyone wants to have a good time. Clearly you didn’t read this post and just brushed it off. \n\nAlso misogynistic!? I also didn’t blame the women at all in this post 😂 seems to me like you’re doing some projecting my guy",
                    "author": "Late_Ad_6293",
                    "id": "ifjvxh8",
                    "parent_id": "t1_ifjuds0",
                    "score": 7,
                    "created_utc": 1657421918.0,
                    "replies": [
                        {
                            "body": "You are saying that women are just looking to get paid, have fun and the men are being used. How is that not misogynistic rhetoric?",
                            "author": "AShatteredKing",
                            "id": "ifkf1fq",
                            "parent_id": "t1_ifjvxh8",
                            "score": 0,
                            "created_utc": 1657433659.0,
                            "replies": [
                                {
                                    "body": "You’re one of those guys who gets offended everytime a girl says “all men are trash” huh?",
                                    "author": "Late_Ad_6293",
                                    "id": "ifkkf9w",
                                    "parent_id": "t1_ifkf1fq",
                                    "score": 1,
                                    "created_utc": 1657437844.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "What does MGTOW stand for?",
                    "author": "BeneficialBabe",
                    "id": "ifjxprq",
                    "parent_id": "t1_ifjuds0",
                    "score": 2,
                    "created_utc": 1657422858.0,
                    "replies": [
                        {
                            "body": "Men Going Their Own Way - basically incels. OP is def not one",
                            "author": "kingporterstomp",
                            "id": "ifk1b4b",
                            "parent_id": "t1_ifjxprq",
                            "score": 3,
                            "created_utc": 1657424825.0,
                            "replies": [
                                {
                                    "body": "Thank you for answering my question! 😁",
                                    "author": "BeneficialBabe",
                                    "id": "ifk1eb9",
                                    "parent_id": "t1_ifk1b4b",
                                    "score": 2,
                                    "created_utc": 1657424874.0,
                                    "replies": []
                                },
                                {
                                    "body": "No, they are not incels. They are more like radical MRAs that blame women for all their problems and have decided to swear off women.\n\nThe op's rhetoric is exactly like that of the MGTOW.",
                                    "author": "AShatteredKing",
                                    "id": "ifkexj8",
                                    "parent_id": "t1_ifk1b4b",
                                    "score": 2,
                                    "created_utc": 1657433577.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": ">I have been robbed, forced into intimacy, blackmailed and scammed. These will happen to you.\n\nIts refreshing to find a man - and a quite young one at that, that fully understands the risks involved.  But, at the same time, I have to think there are a number of genuinely wholesome people in the bowl.",
            "author": "HappyBear1952",
            "id": "ifk2k44",
            "parent_id": "t3_vvgm2o",
            "score": 1,
            "created_utc": 1657425537.0,
            "replies": []
        },
        {
            "body": "If this isnt too upsettng for you could you shed some light on getting forced into intimacy? Ive been effectively threatened into sex in vanilla (kinda what led me to the bowl) but its hard to imagine in sugar.",
            "author": "JDMultralight",
            "id": "ifk79dg",
            "parent_id": "t3_vvgm2o",
            "score": 1,
            "created_utc": 1657428323.0,
            "replies": [
                {
                    "body": "I know it’s hard to believe that a man could be forced into intimacy but let me shed some light into the situation.\n\nShort term arrangement : met with girl 3 times before and told her what I was comfortable with.\nTo make a long story short she had me tied and performed acts I was not willing to do and then after it was all done told me “you didn’t use a safe word”, we never established one. It felt pretty shit and I even saw her again but I did feel violated and upset for awhile.",
                    "author": "Late_Ad_6293",
                    "id": "ifk7kye",
                    "parent_id": "t1_ifk79dg",
                    "score": 5,
                    "created_utc": 1657428523.0,
                    "replies": [
                        {
                            "body": "That’s insane - so sorry to hear that.",
                            "author": "JDMultralight",
                            "id": "ifk8i3c",
                            "parent_id": "t1_ifk7kye",
                            "score": 1,
                            "created_utc": 1657429109.0,
                            "replies": []
                        },
                        {
                            "body": "Those ropes must have been tight.",
                            "author": "malcolm_reyn0lds",
                            "id": "ifkzh9i",
                            "parent_id": "t1_ifk7kye",
                            "score": 1,
                            "created_utc": 1657450582.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Phew not glossing over the forced intimacy. I’m so sorry that happened to you. That is absolutely awful and not ok.",
            "author": null,
            "id": "ifkbudl",
            "parent_id": "t3_vvgm2o",
            "score": 1,
            "created_utc": 1657431354.0,
            "replies": []
        },
        {
            "body": "If you don't mind the question – what is the ballpark for what you have spent in the \\~3 years since you have joined?",
            "author": "MistakeFar3890",
            "id": "ifkvrjm",
            "parent_id": "t3_vvgm2o",
            "score": 1,
            "created_utc": 1657447465.0,
            "replies": []
        },
        {
            "body": "Wait a second, I have questions… I’m just down rabbit holes today. So you guys had this happen to you as men? Am I missing something here? I thought you were the SD and therefore, the sugar daddy? No?",
            "author": "Kindly-Hour-4650",
            "id": "ifkzqav",
            "parent_id": "t3_vvgm2o",
            "score": 1,
            "created_utc": 1657450783.0,
            "replies": []
        },
        {
            "body": "*You will NOT find love here.*\n\nAre young men looking for LOVE on SA?\n\n *forced into intimacy*\n\nAs an SD you were raped or sexually assaulted in the bowl?",
            "author": "BinghamtonSD",
            "id": "ifl092j",
            "parent_id": "t3_vvgm2o",
            "score": 1,
            "created_utc": 1657451180.0,
            "replies": []
        },
        {
            "body": "Wow ...",
            "author": "meleficent007",
            "id": "ifl5ftg",
            "parent_id": "t3_vvgm2o",
            "score": 1,
            "created_utc": 1657454909.0,
            "replies": []
        },
        {
            "body": "You have done great..you are mature and have put so much of the truth in this one..",
            "author": "meleficent007",
            "id": "ifl5jl3",
            "parent_id": "t3_vvgm2o",
            "score": 1,
            "created_utc": 1657454980.0,
            "replies": []
        },
        {
            "body": "i’m about your age also leaving bowl but with a SB who wanted to turn vanilla. stay safe out there folks",
            "author": "ValueFuck",
            "id": "ifla1zo",
            "parent_id": "t3_vvgm2o",
            "score": 1,
            "created_utc": 1657457777.0,
            "replies": []
        },
        {
            "body": "Well done man. Really. This experience should help you in life. I’ve recently felt what you mentioned. I looked up and thought, “do I even believe in love anymore.",
            "author": null,
            "id": "iflv93j",
            "parent_id": "t3_vvgm2o",
            "score": 1,
            "created_utc": 1657467746.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "iflxk1t",
            "parent_id": "t3_vvgm2o",
            "score": 1,
            "created_utc": 1657468743.0,
            "replies": [
                {
                    "body": "I guess you didn’t read what I was saying?\nDo you think I only had bad experiences?",
                    "author": "Late_Ad_6293",
                    "id": "iflxrrz",
                    "parent_id": "t1_iflxk1t",
                    "score": 1,
                    "created_utc": 1657468832.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "ifm400q",
                            "parent_id": "t1_iflxrrz",
                            "score": 1,
                            "created_utc": 1657471502.0,
                            "replies": [
                                {
                                    "body": "Lol also not trying to scare people away but giving a realistic expectation for people. I’m sure this post will help many potential sd’s looking to join into the lifestyle as they can read the comments as well to get others perspectives as well",
                                    "author": "Late_Ad_6293",
                                    "id": "ifm4pb0",
                                    "parent_id": "t1_ifm400q",
                                    "score": 1,
                                    "created_utc": 1657471804.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Going to double reply to this \n\nI agree that seeking has girls looking for real relationships though that wasn’t what I was looking for. I’ve had a couple SR turn into a vanilla non paid relationship and it just want for me 🤷‍♂️",
                    "author": "Late_Ad_6293",
                    "id": "ifm50oq",
                    "parent_id": "t1_iflxk1t",
                    "score": 1,
                    "created_utc": 1657471935.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "While I agree with most of the OP, I’m in the Midwest United States so most of the SBs I’ve met are kind, sweet, caring women. I’ve had mostly positive experiences and relationships.",
            "author": null,
            "id": "ifm3xxa",
            "parent_id": "t3_vvgm2o",
            "score": 1,
            "created_utc": 1657471477.0,
            "replies": [
                {
                    "body": "Hi\nI keep seeing some sd’s seeing this as “all SB’s are bad”\nI have had far more wonderful experiences than bad ones however the bad does exist and this post is mainly for younger men looking to become a sd. A cautionary post of sorts",
                    "author": "Late_Ad_6293",
                    "id": "ifm49u0",
                    "parent_id": "t1_ifm3xxa",
                    "score": 2,
                    "created_utc": 1657471621.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "What do you mean that you were forced into sex?\n\nI agree with many of your points, that being said I look at this as simply business. I always say a woman can say whatever she wants but I only take woman seriously that date me with NO ALLOWANCE. If there is an allowance involved assume the girl does not give a shit and treat her as such meaning DO NOT DEVELOP FEELINGS FOR ANY OF THESE GIRLS YOU MEET ON SEEKING.\n\nAlso, I found seeking in my 40's after my divorce and I am glad that I did. That being said the quality of woman is going downhill fast and I tell my son all the time to not get married and work on making money. The majority of woman are simply not worth it. I have taken breaks from seeking and came back. That being said if I was in my 20's I would just concentrate on vanilla dating being you are the same girls age.\n\n&#x200B;\n\nI would also like to say that when you pay for a womans companionship they lose respect for you and they will respect the broke guy more than you. The girls on seeking are vanilla dating complete losers. I have many of their instagrams and the dudes they are dating and giving their time for free are a step above a convict. Also, I don't know if it is younger woman in general or girls from seeking but they all seem to take meds for some type of mental disorder wether it is depression or bipolar or some shit like that. Many of them are intelligent and would be great at sales. You have to be to be in this lifestyle, that being said I keep them at arms length.",
            "author": "Shot_Anywhere",
            "id": "ifm8485",
            "parent_id": "t3_vvgm2o",
            "score": 1,
            "created_utc": 1657473249.0,
            "replies": [
                {
                    "body": "I said how in this thread don’t really want to keep saying how it happened.\n\nAlso while I agree with a lot of your post I don’t want to believe most women are how you described or have the mindset you described which is why I’m retiring because being in this lifestyle in my opinions does lead to this thinking we both share right now about them.",
                    "author": "Late_Ad_6293",
                    "id": "ifm9qey",
                    "parent_id": "t1_ifm8485",
                    "score": 1,
                    "created_utc": 1657473941.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "ifmm4af",
            "parent_id": "t3_vvgm2o",
            "score": 1,
            "created_utc": 1657479293.0,
            "replies": [
                {
                    "body": "Please read the other comments, I’ve answered this.",
                    "author": "Late_Ad_6293",
                    "id": "ifmmts4",
                    "parent_id": "t1_ifmm4af",
                    "score": 1,
                    "created_utc": 1657479601.0,
                    "replies": [
                        {
                            "body": "I still don't understand how a full grown man can be forced into intimacy. Not being funny but did they put a gun to your head? It just doesn't compute.",
                            "author": "Shot_Anywhere",
                            "id": "ifmo2in",
                            "parent_id": "t1_ifmmts4",
                            "score": 1,
                            "created_utc": 1657480141.0,
                            "replies": [
                                {
                                    "body": "Read the comments? I was tied up",
                                    "author": "Late_Ad_6293",
                                    "id": "ifmomj4",
                                    "parent_id": "t1_ifmo2in",
                                    "score": 1,
                                    "created_utc": 1657480386.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Wow. I never got into the lifestyle, only ever curious. But reading OP and all these comments safe to say I made a good choice in not trying to be SB, haha. Not my cup of tea. I suppose all types of dating come with highs and lows. Glad you’re choosing you!",
            "author": "unicornmagic675",
            "id": "ifn6gk8",
            "parent_id": "t3_vvgm2o",
            "score": 1,
            "created_utc": 1657488083.0,
            "replies": [
                {
                    "body": "My post was mainly for SD’s not SB’s. I can’t say anything about the lifestyle for SB’s",
                    "author": "Late_Ad_6293",
                    "id": "ifn6stg",
                    "parent_id": "t1_ifn6gk8",
                    "score": 1,
                    "created_utc": 1657488230.0,
                    "replies": [
                        {
                            "body": "Oh I’m aware it’s just interesting to learn about the lifestyle from both sides. I know people can be garbage and seeing what SD can go through just hurts my heart. Something I never really thought about I suppose.",
                            "author": "unicornmagic675",
                            "id": "ifn757o",
                            "parent_id": "t1_ifn6stg",
                            "score": 1,
                            "created_utc": 1657488379.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "In my mind being a sb sounds good but in my heart I just want to be in love. I’m just a hopeless romantic. I’ve never been one I just find the stories interested so I keep getting this page suggested",
            "author": "themagichappensnow",
            "id": "ifnclli",
            "parent_id": "t3_vvgm2o",
            "score": 1,
            "created_utc": 1657490755.0,
            "replies": []
        },
        {
            "body": "Agreed.",
            "author": null,
            "id": "ifo0292",
            "parent_id": "t3_vvgm2o",
            "score": 1,
            "created_utc": 1657501802.0,
            "replies": []
        },
        {
            "body": "Great post \n\nOnly thing I would disagree with from experience is love is certainly possible with the right girl but it was a needle in a haystack",
            "author": "wb19081908",
            "id": "ifoixiw",
            "parent_id": "t3_vvgm2o",
            "score": 1,
            "created_utc": 1657511247.0,
            "replies": []
        },
        {
            "body": "To think I just made this post on a whim.",
            "author": "Late_Ad_6293",
            "id": "ifklqqp",
            "parent_id": "t1_ifkkf85",
            "score": 5,
            "created_utc": 1657438913.0,
            "replies": []
        },
        {
            "body": "I like to think my father aged me faster with all of the stuff he threw at me which led me to take on a different mindset in my 20’s",
            "author": "Late_Ad_6293",
            "id": "ifjrzsf",
            "parent_id": "t1_ifjqv3p",
            "score": 23,
            "created_utc": 1657419866.0,
            "replies": [
                {
                    "body": "That's not necessarily a bad thing tho.\nQuite the opposite actually.\nI basically raised my younger siblings until I became emancipated and finally was able to escape.\n\nDid it suck?\nFuuuuuuuuuuuuuuuuuck YES!!!!\n\nBuuut....\nIt showed me a lot of the World, and taught me to see people in a different way than most do.\n\nBtw, This is usually a trauma response. \nJust because it's caused from something crappy, it DOESNT mean that you can't take and MAKE a shit sandwich into something better....it's all in you!",
                    "author": "JustAsk4Alice",
                    "id": "ifjvzj9",
                    "parent_id": "t1_ifjrzsf",
                    "score": 8,
                    "created_utc": 1657421948.0,
                    "replies": [
                        {
                            "body": "In hindsight I’m glad he did it wasn’t a bad thing at all.",
                            "author": "Late_Ad_6293",
                            "id": "ifjwk4m",
                            "parent_id": "t1_ifjvzj9",
                            "score": 9,
                            "created_utc": 1657422245.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Oh yeah I can only speak for younger men, I have NO idea what this life is like for women",
            "author": "Late_Ad_6293",
            "id": "ifjwbhx",
            "parent_id": "t1_ifjuwo1",
            "score": 8,
            "created_utc": 1657422120.0,
            "replies": [
                {
                    "body": "It’s wild. I think what would have helped me was way more question asking, way more vetting, looking up public records, daytime only dating and in public places, never deleting a single photo or picture.",
                    "author": "MapleSappling",
                    "id": "ifjxhty",
                    "parent_id": "t1_ifjwbhx",
                    "score": 4,
                    "created_utc": 1657422740.0,
                    "replies": [
                        {
                            "body": "I don’t know about you, but I have become a CSI level stalk master lol. I can trust trust trust, but it works BOTH ways.",
                            "author": "Kindly-Hour-4650",
                            "id": "ifldu48",
                            "parent_id": "t1_ifjxhty",
                            "score": 3,
                            "created_utc": 1657459824.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "That sounds crazy .. \nYou make me feel I live in such a sheltered life 😊",
            "author": null,
            "id": "ifkf7wx",
            "parent_id": "t1_ifjuwo1",
            "score": 1,
            "created_utc": 1657433796.0,
            "replies": []
        },
        {
            "body": "This. I’m glad sugar didn’t exist in its current form when I was in my 20’s. I had the income…. But it would have messed up my life, probably prevented marriage, and my kids…. So much would have gone wrong for me.",
            "author": "MammothInevitable671",
            "id": "ifl8txx",
            "parent_id": "t1_ifkv0tv",
            "score": 3,
            "created_utc": 1657457060.0,
            "replies": [
                {
                    "body": "I also had the income in my 20s and wish that I had discovered sugar dating and pursued it.  Maybe it would have prevented me from marrying a horrible, evil woman.",
                    "author": "MrBigCoc",
                    "id": "ifmg1b7",
                    "parent_id": "t1_ifl8txx",
                    "score": 3,
                    "created_utc": 1657476649.0,
                    "replies": [
                        {
                            "body": "You would have still married a horrible woman, just one that was also money hungry.",
                            "author": "malcolm_reyn0lds",
                            "id": "ifond4p",
                            "parent_id": "t1_ifmg1b7",
                            "score": 1,
                            "created_utc": 1657513797.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Seriously. It's a shortcut with major drawbacks. You start getting involved with people who wouldn't be with you if it weren't for the money at a young age and it will really warp your mind and perspective. If you are a young guy with money, invest it. Save. Buy property. Get your ass in the gym and look good. Travel the world and meet new people. Date normally and get better with women. If you are in your 20s with a lot of money and confident in your looks you shouldn't have any problems finding and meeting women.",
                    "author": "malcolm_reyn0lds",
                    "id": "iflf5qr",
                    "parent_id": "t1_ifl8txx",
                    "score": 4,
                    "created_utc": 1657460492.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "You're so right. I started sugaring in my early 30s and I'm glad it wasn't available when I was in my 20s. I would have never pushed myself to date women in the vanilla world.  \n\n\nThe online dating is so bad that SDs and SBs have the same age. That says a lot about the dating market.",
            "author": "hoptohop",
            "id": "ifo1t1k",
            "parent_id": "t1_ifkv0tv",
            "score": 1,
            "created_utc": 1657502654.0,
            "replies": []
        },
        {
            "body": ">Darlene Bower\n\nI just [read about her death](https://mikedilloninaminorkey.com/1997/01/01/lonely-men-confuse-the-message/) from the perspective of a friend. \"Lonely men confuse the message\". Chilling.",
            "author": "FunnyFruit100",
            "id": "ifowd7y",
            "parent_id": "t1_ifl7dyp",
            "score": 2,
            "created_utc": 1657519720.0,
            "replies": [
                {
                    "body": "I heard her story on an episode of Small Town Murder. I think OP's post is written in an experienced and thoughtful way. No matter how nice someone is to you, having things in common/having mutual attraction - there's always possibility of risk. Sugaring is dangerous in so many tiers of development. I meant what I said when anyone can work/be involved in something and become wary of a group of people. A stripper, a SD, even a diner waitress. \n\nMistrust is good to learn early on. Knowing when to stop sugaring before becoming jaded is admirable.",
                    "author": "Dull-Resolution3246",
                    "id": "ifozvto",
                    "parent_id": "t1_ifowd7y",
                    "score": 2,
                    "created_utc": 1657522332.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Being robbed was what led me to carrying concealed in the State of California. It was actually my FIRST meet and greet believe it or not 😂😂.\n\nHad a walk in the park chatting and then was lead to secluded area where I had a larger gentleman politely ask me for some gas money while my date walked over behind him.",
            "author": "Late_Ad_6293",
            "id": "ifjqbzu",
            "parent_id": "t1_ifjp1ro",
            "score": 18,
            "created_utc": 1657419013.0,
            "replies": [
                {
                    "body": "What happens now a days?  I never carry cash. Do bums take Venmo now?",
                    "author": "aajniojnoihnoi",
                    "id": "ifjqwzt",
                    "parent_id": "t1_ifjqbzu",
                    "score": 10,
                    "created_utc": 1657419311.0,
                    "replies": [
                        {
                            "body": "Bahaha, funnily enough another time I was in an attempted robbery I didn’t carry cash and was going to pull the venmo at the end of the day so it was quite the awkward situation.\n\nThis date though had explicitly asked for cash and then even asked to SEE it when the date began. As it was my first date, I didn’t think anything of the red flags.",
                            "author": "Late_Ad_6293",
                            "id": "ifjr5z2",
                            "parent_id": "t1_ifjqwzt",
                            "score": 11,
                            "created_utc": 1657419440.0,
                            "replies": [
                                {
                                    "body": "Asking to see the cash would have had me making for a quick exit.",
                                    "author": "aajniojnoihnoi",
                                    "id": "ifjsgcc",
                                    "parent_id": "t1_ifjr5z2",
                                    "score": 8,
                                    "created_utc": 1657420108.0,
                                    "replies": [
                                        {
                                            "body": "I was young, dumb, and new. 🤷‍♂️ no excuses",
                                            "author": "Late_Ad_6293",
                                            "id": "ifjsowe",
                                            "parent_id": "t1_ifjsgcc",
                                            "score": 6,
                                            "created_utc": 1657420235.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "I was caught off guard when a Streetwise (local publication that helps the homeless restart their lives) vendor called me out when I said I didn’t have cash by showing me they took Venmo and Zelle.\n\nSo yeah, I think it’s possible they’d hold you at gun point to do that.",
                            "author": null,
                            "id": "ifjrnzl",
                            "parent_id": "t1_ifjqwzt",
                            "score": 5,
                            "created_utc": 1657419697.0,
                            "replies": [
                                {
                                    "body": "In Mexico they have express kidnappings where they drive you from ATM to ATM until you hit your withdrawal limit.",
                                    "author": "aajniojnoihnoi",
                                    "id": "ifjslc4",
                                    "parent_id": "t1_ifjrnzl",
                                    "score": 6,
                                    "created_utc": 1657420183.0,
                                    "replies": [
                                        {
                                            "body": "Happens in the US, too.",
                                            "author": null,
                                            "id": "ifjsxnv",
                                            "parent_id": "t1_ifjslc4",
                                            "score": 1,
                                            "created_utc": 1657420360.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "A lot of street newspapers vendors do accept venmo (and many unhoused people have a cell phone). \n\nI wouldn't classify those folks as bums though. Those are just very poor people trying to make an honest living and unlike panhandlers, they do provide value.",
                                    "author": "LightOLove",
                                    "id": "iflf2nq",
                                    "parent_id": "t1_ifjrnzl",
                                    "score": -1,
                                    "created_utc": 1657460450.0,
                                    "replies": [
                                        {
                                            "body": "I didn’t call them bums.",
                                            "author": null,
                                            "id": "iflhcqp",
                                            "parent_id": "t1_iflf2nq",
                                            "score": 1,
                                            "created_utc": 1657461572.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "Shiiiiit, you joke, there's plllllllenty of Homeless with cashapp and venmo!!!!!😳",
                            "author": "JustAsk4Alice",
                            "id": "ifjw8mk",
                            "parent_id": "t1_ifjqwzt",
                            "score": 1,
                            "created_utc": 1657422078.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Fuck that so fucking hard. I always make sure to have pepper spray because I’m not a fan of firearms at all.",
                    "author": null,
                    "id": "ifjqtzv",
                    "parent_id": "t1_ifjqbzu",
                    "score": 6,
                    "created_utc": 1657419270.0,
                    "replies": []
                },
                {
                    "body": "To be fair, you could meet a girl on tinder vanilla dating, you still get robbed .. \n\nI often think it’s never the platform it’s people. \n\nLook at seek, some seek NSA, some seek true love.",
                    "author": null,
                    "id": "ifkfpjx",
                    "parent_id": "t1_ifjqbzu",
                    "score": 2,
                    "created_utc": 1657434158.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "That applies to men as well to be fair… wouldnt blame women for being promiscuous when men are as well",
            "author": "DarcyBennet81",
            "id": "ifl9q82",
            "parent_id": "t1_ifk7cex",
            "score": 7,
            "created_utc": 1657457588.0,
            "replies": [
                {
                    "body": "a man being promiscuous is very different than a woman being promiscuos. very few men can be in these streets (most dont have the looks or money) while any reasonably attractive woman can be.",
                    "author": "vtec__",
                    "id": "ifldybz",
                    "parent_id": "t1_ifl9q82",
                    "score": -3,
                    "created_utc": 1657459883.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I’m not saying I didn’t have great experiences!! Haha I was just giving a warning to what I think is a bunch of  young guys not knowing what they’re going into.\n\nI have had some bad experiences but I’ve had tons of fun in this lifestyle ! I don’t regret a thing. My own personal problems for retiring just come from my own mindset.",
            "author": "Late_Ad_6293",
            "id": "ifk53a5",
            "parent_id": "t1_ifk46zc",
            "score": 3,
            "created_utc": 1657426997.0,
            "replies": [
                {
                    "body": "Did you date all ages of women? Just curious. I am very particular and if there is even the slightest bit of hesitation or doubt in my mind, I am honest and tell the SD I don't want to move forward. In vanilla dating, I usually dated younger men but in the bowl it's been older. It's a bummer you've had this experience. Hopefully you meet someone with true connection who knows nothing about your wealth at a party or park. Best wishes!",
                    "author": "iamrosieriley",
                    "id": "ifkwy16",
                    "parent_id": "t1_ifk53a5",
                    "score": 1,
                    "created_utc": 1657448485.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "First, I should stop trying to Reddit so sleep deprived. I have been trying to type for far to long now. \n\nBut really what I’m doing is agreeing with you. It’s just becoming maddening. Fuck it.. I’m over this lol",
            "author": "Kindly-Hour-4650",
            "id": "ifkzyyf",
            "parent_id": "t1_ifk46zc",
            "score": 2,
            "created_utc": 1657450967.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "ifk4on0",
            "parent_id": "t1_ifk46zc",
            "score": 1,
            "created_utc": 1657426763.0,
            "replies": []
        },
        {
            "body": "Thank you for this. I have to save this one .",
            "author": "Late_Ad_6293",
            "id": "ifkkcrh",
            "parent_id": "t1_ifkfipp",
            "score": 1,
            "created_utc": 1657437788.0,
            "replies": []
        },
        {
            "body": "I’m pretty sure you can’t disclose that info but anything from 500 to 1200 a date.\n4 long term SR’s. Many short term ones, probably more than 20 less than 30.\nAverage 18-28k a year.\nDates? Depends on the girl but I’d say average 1 date every other week.",
            "author": "Late_Ad_6293",
            "id": "ifjytp9",
            "parent_id": "t1_ifjy6de",
            "score": 3,
            "created_utc": 1657423456.0,
            "replies": [
                {
                    "body": "Nice! That is not super excessive…i usually do one date per week sometimes 2… I bet you will be back in bowl…..nothing can match the bowl experience :)",
                    "author": "IllustriousCake8030",
                    "id": "ifk2blq",
                    "parent_id": "t1_ifjytp9",
                    "score": 0,
                    "created_utc": 1657425401.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Bahaha oh I screened but sometimes you just want to believe in the unbelievable !! 😂😂😂 every red flag was going off but I wanted it to be true!!!\n\nIt’s funny cuz as it happened I go “haha I KNEW IT”",
            "author": "Late_Ad_6293",
            "id": "ifjpac3",
            "parent_id": "t1_ifjp4ib",
            "score": 7,
            "created_utc": 1657418479.0,
            "replies": [
                {
                    "body": "I'm guessing your wealth and youth may have made you a target for unscrupulous women as well, unfortunately.",
                    "author": "SDinAsia",
                    "id": "ifjpssi",
                    "parent_id": "t1_ifjpac3",
                    "score": 2,
                    "created_utc": 1657418740.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "While I am wealthy, I am not particularly the best looking. I’m fit but I’m sure my face is ugly otherwise I wouldn’t have no matches on the dating apps.\nAlso I wasn’t really looking for relationships. I wanted to meet hot girls and have fun. I live a very busy lifestyle due to my generational wealth. My father lives up my ass and I have very limited free time. I also come from a traditional family that believes in arranged marriages (no my skin color is not brown am not Indian) so having to make time for a girlfriend where it would lead nowhere seemed like a big waste of time for me.\nWith sugaring, I got everything I wanted but with the con of now seeing the female population in a different light.",
            "author": "Late_Ad_6293",
            "id": "ifjprf6",
            "parent_id": "t1_ifjp9a8",
            "score": 10,
            "created_utc": 1657418720.0,
            "replies": [
                {
                    "body": "Hopefully being out of the bowl will bring some light back to you.",
                    "author": "ShaArt5",
                    "id": "ifjr4ce",
                    "parent_id": "t1_ifjprf6",
                    "score": 4,
                    "created_utc": 1657419417.0,
                    "replies": [
                        {
                            "body": "Don’t think it will but I am hoping to forget the stuff I saw / heard so I don’t have that negativity in my head.",
                            "author": "Late_Ad_6293",
                            "id": "ifjrasu",
                            "parent_id": "t1_ifjr4ce",
                            "score": 5,
                            "created_utc": 1657419510.0,
                            "replies": [
                                {
                                    "body": "I hope that for you as well. And that you gain a bit more freedom.",
                                    "author": "ShaArt5",
                                    "id": "ifjrphq",
                                    "parent_id": "t1_ifjrasu",
                                    "score": 4,
                                    "created_utc": 1657419718.0,
                                    "replies": []
                                },
                                {
                                    "body": "Remember the bowl attracts a small part of the overall population, and certain tendicies / traits / personal motives are attracted to it more frequently than others. \n\nAnd your approach of meet hot girls and have fun certainly didn’t help you filter away from that. \n\nThat said, good luck in your step away from the bowl and I wish you success outside of it.",
                                    "author": "midwesternguru",
                                    "id": "ifm7zcp",
                                    "parent_id": "t1_ifjrasu",
                                    "score": 2,
                                    "created_utc": 1657473191.0,
                                    "replies": []
                                },
                                {
                                    "body": "I might be able to help you with that part.",
                                    "author": "JustAsk4Alice",
                                    "id": "ifjxa09",
                                    "parent_id": "t1_ifjrasu",
                                    "score": 0,
                                    "created_utc": 1657422625.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Why did you have to clarify that you’re not brown ?",
                    "author": "lizliz1020",
                    "id": "ifjs75q",
                    "parent_id": "t1_ifjprf6",
                    "score": 3,
                    "created_utc": 1657419974.0,
                    "replies": [
                        {
                            "body": "Because usually when I say arranged marriage people think I am brown or Indian. I am white and slavic. I don’t want people to assume I am representing a group of people that I am not.",
                            "author": "Late_Ad_6293",
                            "id": "ifjsj6j",
                            "parent_id": "t1_ifjs75q",
                            "score": 13,
                            "created_utc": 1657420152.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Now is a better time than ever to break the tradition of arranged marriage in your family, FUCK THAT. Break the cycle now and tell your parents you are absolutely 100% not entering an arranged marriage. \n\nSuch a shitty thing for parents to do to their kids, tradition be damned.",
                    "author": "contento2021",
                    "id": "ifk6tog",
                    "parent_id": "t1_ifjprf6",
                    "score": 3,
                    "created_utc": 1657428050.0,
                    "replies": [
                        {
                            "body": "Respectfully fuck you. Tradition and my parents are probably the main reasons why I am successful in life. \n\nI never once said I was against arranged marriages, I just said that it would be flawed to lead girls on when I am never going to be seriously committed to the relationship. I am 100% FOR it.",
                            "author": "Late_Ad_6293",
                            "id": "ifk73yu",
                            "parent_id": "t1_ifk6tog",
                            "score": 5,
                            "created_utc": 1657428228.0,
                            "replies": [
                                {
                                    "body": "Ah so your parents have successfully indoctrinated the next generation of brainless sheep, respectfully. One day you'll get to treat your own kids like chattel!",
                                    "author": "contento2021",
                                    "id": "ifk7d0w",
                                    "parent_id": "t1_ifk73yu",
                                    "score": 4,
                                    "created_utc": 1657428387.0,
                                    "replies": [
                                        {
                                            "body": "First off did I say I was being forced into it?\n\nMy parents have given me the option to choose. I don’t want to as I am for arranged marriages. My brother chose his own wife as he didn’t believe in arranged.\nYou sir have no idea about how my family works and what I will employ to my own children.\n\nSounds like you’re projecting what happened to you.",
                                            "author": "Late_Ad_6293",
                                            "id": "ifk7u4l",
                                            "parent_id": "t1_ifk7d0w",
                                            "score": 4,
                                            "created_utc": 1657428685.0,
                                            "replies": [
                                                {
                                                    "body": "Gotta admit... I'm having trouble reconciling how you're simultaneously pro-arranged marriage and yet also attracted to sugar dating.",
                                                    "author": null,
                                                    "id": "ifk9w29",
                                                    "parent_id": "t1_ifk7u4l",
                                                    "score": 4,
                                                    "created_utc": 1657430013.0,
                                                    "replies": [
                                                        {
                                                            "body": "One can do anything and have fun before marriage and then once marriage happens you can settle down.\n\nThat’s how I think about it.",
                                                            "author": "Late_Ad_6293",
                                                            "id": "ifkb0on",
                                                            "parent_id": "t1_ifk9w29",
                                                            "score": 3,
                                                            "created_utc": 1657430780.0,
                                                            "replies": [
                                                                {
                                                                    "body": "It almost sounds like you're expecting the fun to stop when you're wed though.\n\nI dunno, coming from a family with lots of toxic and failed arranged marriages around me, I don't see the appeal that you're evidently finding in i. You do you if it makes you happy though",
                                                                    "author": null,
                                                                    "id": "ifkbblx",
                                                                    "parent_id": "t1_ifkb0on",
                                                                    "score": 2,
                                                                    "created_utc": 1657430992.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "I don’t expect to cheat on my wife if that’s what you’re suggesting?\n\nSorry to hear the marriages didn’t work in your family",
                                                                            "author": "Late_Ad_6293",
                                                                            "id": "ifkkjun",
                                                                            "parent_id": "t1_ifkbblx",
                                                                            "score": 1,
                                                                            "created_utc": 1657437946.0,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "I relate to this so much. Agreed",
                            "author": "lipstickdiet",
                            "id": "ifkihtj",
                            "parent_id": "t1_ifk6tog",
                            "score": 1,
                            "created_utc": 1657436305.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "I think this is where you are wrong about your first point. If you are young AND good looking then a lot of SB’s will lower their allowance expectations, and/or offer to date you for free. You are young but not good looking from what you just wrote.",
                    "author": null,
                    "id": "ifjra62",
                    "parent_id": "t1_ifjprf6",
                    "score": 1,
                    "created_utc": 1657419501.0,
                    "replies": [
                        {
                            "body": "I’d say I’m average. Not ugly, just average.\nMost SB’s would make comments about it. I could tell they were genuine but common sense is common sense. Attractive guys will get better opportunities.\n\nHowever my point is that if a girl is offering you a PPM / allowance she has already made that decision.\n\nMy first point was that some of these guys will go “I’ll give you xx for the date because I’m so young and not ugly so it’s still good right?”\nA few hundred dollars off is expected for being good looking / younger but going 70-90% lower? Good luck partner",
                            "author": "Late_Ad_6293",
                            "id": "ifjrqo7",
                            "parent_id": "t1_ifjra62",
                            "score": 5,
                            "created_utc": 1657419736.0,
                            "replies": [
                                {
                                    "body": "You’d be surprised.",
                                    "author": null,
                                    "id": "ifjs0pc",
                                    "parent_id": "t1_ifjrqo7",
                                    "score": 2,
                                    "created_utc": 1657419880.0,
                                    "replies": [
                                        {
                                            "body": "Hey I’ve seen it happen but just setting realistic expectations. That’s rare and often gets messy ;)",
                                            "author": "Late_Ad_6293",
                                            "id": "ifjs4gf",
                                            "parent_id": "t1_ifjs0pc",
                                            "score": 3,
                                            "created_utc": 1657419935.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "Thought young girls nowadays just hookup .. 🤔\n\nThe white girls in NZ go clubbing on Friday then hookup with a dude when they get drunk, wake up the next day and look at him thinking not too bad, then a relationship is created .. for about 3 weeks then they repeat again ..",
                                    "author": null,
                                    "id": "ifkg5o9",
                                    "parent_id": "t1_ifjrqo7",
                                    "score": 1,
                                    "created_utc": 1657434495.0,
                                    "replies": [
                                        {
                                            "body": "That’s the same here in the US. If someone really wants to hook up there are plenty of ways for them to do it.\nIf someone is looking for a certain demographic though I think they would have trouble even in the clubs haha",
                                            "author": "Late_Ad_6293",
                                            "id": "ifkk5qb",
                                            "parent_id": "t1_ifkg5o9",
                                            "score": 1,
                                            "created_utc": 1657437632.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": ">If you are young AND good looking then a lot of SB’s will lower their allowance expectations, and/or offer to date you for free.\n\nYes and no. Free is a relative term. Some SBs will do that because, after all, they are women and they want to date a hot young dude. There is nothing surprising there.\n\nBut many of those SBs are likely looking for a husband because that is also what women do. They have fun until they find the 'right one'. If the guy is sufficiently wealthy and falling in love, they don't need to lower the price if they're smart.\n\nYou know what, men do the same thing - have fun dating until Mrs. Right comes along.\n\nWhen you marry a girl the price is actually much higher than dating or sugaring. Youth has nothing to do with it really when it comes to marriage, unless that is what you want to have. Several of my friends have met their young wives through the sugar bowl and had very happy marriages. They were happy because the women were young, beautiful, well-mannered, educated and brought up in good families while the men were old, professional, smart and very wealthy. The women knew they would in all likelihood outlast the men by decades and have tons of money by time they were left single widows in the 30-50 age range. So they made sure to treat the husbands like the personal gold mines they were. And that is exactly what happened in one case already; he died and left her wealthy and single. Their first date was a double date with me and another girl. She's now the Merry Widow.",
                            "author": "StiffHappens",
                            "id": "ifk6fj2",
                            "parent_id": "t1_ifjra62",
                            "score": 2,
                            "created_utc": 1657427804.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": ">con of now seeing the female population in a different light.\n\nPerhaps I'm misreading you, but I imagine that the way you see \"the female population\" now is more realistic than before. Is so, why is that a con?",
                    "author": "THROW_AWAY_solution",
                    "id": "ifnkag1",
                    "parent_id": "t1_ifjprf6",
                    "score": 1,
                    "created_utc": 1657494221.0,
                    "replies": [
                        {
                            "body": "I’d like not to believe that all women are lying to their boyfriends / husbands.\nIf that’s realistic than I hope to back to fantasy lol",
                            "author": "Late_Ad_6293",
                            "id": "ifnl42l",
                            "parent_id": "t1_ifnkag1",
                            "score": 1,
                            "created_utc": 1657494608.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "A wealthy any-something never has the option of vanilla. It’s always sugar whether either party realises it or not.",
            "author": "Neither-Ad-2833",
            "id": "ifjtt69",
            "parent_id": "t1_ifjp9a8",
            "score": 9,
            "created_utc": 1657420810.0,
            "replies": [
                {
                    "body": "This!\nUnless you find a unicorn multi-millionaire hottie who's into you, it's sugar whether you met on SA or tinder",
                    "author": "kingporterstomp",
                    "id": "ifk166v",
                    "parent_id": "t1_ifjtt69",
                    "score": 4,
                    "created_utc": 1657424747.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I would bet money you didn’t get dates from hot 20 something women on tinder. That’s the demographic the OP is likely targeting.",
            "author": null,
            "id": "ifjy7zw",
            "parent_id": "t1_ifjuds0",
            "score": 11,
            "created_utc": 1657423131.0,
            "replies": [
                {
                    "body": "I dated in college. I would say my three girlfriends in college were way above my league and pretty hot.\n\nDidn’t have time for dating when I was out of college. So you lost the bet.",
                    "author": "Late_Ad_6293",
                    "id": "ifk2v2z",
                    "parent_id": "t1_ifjy7zw",
                    "score": 2,
                    "created_utc": 1657425711.0,
                    "replies": [
                        {
                            "body": "I was responding to ashatteredking, not you lol.",
                            "author": null,
                            "id": "ifk34tl",
                            "parent_id": "t1_ifk2v2z",
                            "score": 2,
                            "created_utc": 1657425864.0,
                            "replies": [
                                {
                                    "body": "Ah sorry just reread. I was responding to the notifications.\nMy apologies.",
                                    "author": "Late_Ad_6293",
                                    "id": "ifk3vq9",
                                    "parent_id": "t1_ifk34tl",
                                    "score": 2,
                                    "created_utc": 1657426291.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "2 ex gfs ago, when I was just shy of 40, I dated a girl that was probably a 7 22 year old. Yes, obviously I can date higher quality women if I'm willing to give them an allowance. It doesn't change what I said.",
                    "author": "AShatteredKing",
                    "id": "ifkeusy",
                    "parent_id": "t1_ifjy7zw",
                    "score": 0,
                    "created_utc": 1657433519.0,
                    "replies": [
                        {
                            "body": "Great, I’ve vanilla dated several younger women from tinder as well. But that doesn’t mean you were able to do it consistently and effortlessly. I’m sure you put in a lot of work to date that 22 yo, and didn’t have a bunch of 22 yo’s lining up to date you on tinder. \n\nIt’s 10x easier to date those hot 22 yo on seeking. Not sure it’s even debatable.",
                            "author": null,
                            "id": "ifl4pf2",
                            "parent_id": "t1_ifkeusy",
                            "score": 3,
                            "created_utc": 1657454417.0,
                            "replies": [
                                {
                                    "body": "Yes, of course it's easier to date hot 22 yos on seeking. That doesn't change anything I said.",
                                    "author": "AShatteredKing",
                                    "id": "iflmezz",
                                    "parent_id": "t1_ifl4pf2",
                                    "score": 2,
                                    "created_utc": 1657463886.0,
                                    "replies": [
                                        {
                                            "body": "Great. So you agree with me.",
                                            "author": null,
                                            "id": "iflmhyc",
                                            "parent_id": "t1_iflmezz",
                                            "score": 1,
                                            "created_utc": 1657463922.0,
                                            "replies": [
                                                {
                                                    "body": "As I said, your point doesn't change anything I said.",
                                                    "author": "AShatteredKing",
                                                    "id": "ifm09eo",
                                                    "parent_id": "t1_iflmhyc",
                                                    "score": 1,
                                                    "created_utc": 1657469903.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "You got me all wrong. This is far from a MGTOW post and it seems some of the guys in this thread agree with me.\nI even said this was for younger men jumping on here because they feel that way about dating now, not that I felt that way.\nAlso that was my point? Everyone wants to have a good time. Clearly you didn’t read this post and just brushed it off. \n\nAlso misogynistic!? I also didn’t blame the women at all in this post 😂 seems to me like you’re doing some projecting my guy",
            "author": "Late_Ad_6293",
            "id": "ifjvxh8",
            "parent_id": "t1_ifjuds0",
            "score": 7,
            "created_utc": 1657421918.0,
            "replies": [
                {
                    "body": "You are saying that women are just looking to get paid, have fun and the men are being used. How is that not misogynistic rhetoric?",
                    "author": "AShatteredKing",
                    "id": "ifkf1fq",
                    "parent_id": "t1_ifjvxh8",
                    "score": 0,
                    "created_utc": 1657433659.0,
                    "replies": [
                        {
                            "body": "You’re one of those guys who gets offended everytime a girl says “all men are trash” huh?",
                            "author": "Late_Ad_6293",
                            "id": "ifkkf9w",
                            "parent_id": "t1_ifkf1fq",
                            "score": 1,
                            "created_utc": 1657437844.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "What does MGTOW stand for?",
            "author": "BeneficialBabe",
            "id": "ifjxprq",
            "parent_id": "t1_ifjuds0",
            "score": 2,
            "created_utc": 1657422858.0,
            "replies": [
                {
                    "body": "Men Going Their Own Way - basically incels. OP is def not one",
                    "author": "kingporterstomp",
                    "id": "ifk1b4b",
                    "parent_id": "t1_ifjxprq",
                    "score": 3,
                    "created_utc": 1657424825.0,
                    "replies": [
                        {
                            "body": "Thank you for answering my question! 😁",
                            "author": "BeneficialBabe",
                            "id": "ifk1eb9",
                            "parent_id": "t1_ifk1b4b",
                            "score": 2,
                            "created_utc": 1657424874.0,
                            "replies": []
                        },
                        {
                            "body": "No, they are not incels. They are more like radical MRAs that blame women for all their problems and have decided to swear off women.\n\nThe op's rhetoric is exactly like that of the MGTOW.",
                            "author": "AShatteredKing",
                            "id": "ifkexj8",
                            "parent_id": "t1_ifk1b4b",
                            "score": 2,
                            "created_utc": 1657433577.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I know it’s hard to believe that a man could be forced into intimacy but let me shed some light into the situation.\n\nShort term arrangement : met with girl 3 times before and told her what I was comfortable with.\nTo make a long story short she had me tied and performed acts I was not willing to do and then after it was all done told me “you didn’t use a safe word”, we never established one. It felt pretty shit and I even saw her again but I did feel violated and upset for awhile.",
            "author": "Late_Ad_6293",
            "id": "ifk7kye",
            "parent_id": "t1_ifk79dg",
            "score": 5,
            "created_utc": 1657428523.0,
            "replies": [
                {
                    "body": "That’s insane - so sorry to hear that.",
                    "author": "JDMultralight",
                    "id": "ifk8i3c",
                    "parent_id": "t1_ifk7kye",
                    "score": 1,
                    "created_utc": 1657429109.0,
                    "replies": []
                },
                {
                    "body": "Those ropes must have been tight.",
                    "author": "malcolm_reyn0lds",
                    "id": "ifkzh9i",
                    "parent_id": "t1_ifk7kye",
                    "score": 1,
                    "created_utc": 1657450582.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I guess you didn’t read what I was saying?\nDo you think I only had bad experiences?",
            "author": "Late_Ad_6293",
            "id": "iflxrrz",
            "parent_id": "t1_iflxk1t",
            "score": 1,
            "created_utc": 1657468832.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "ifm400q",
                    "parent_id": "t1_iflxrrz",
                    "score": 1,
                    "created_utc": 1657471502.0,
                    "replies": [
                        {
                            "body": "Lol also not trying to scare people away but giving a realistic expectation for people. I’m sure this post will help many potential sd’s looking to join into the lifestyle as they can read the comments as well to get others perspectives as well",
                            "author": "Late_Ad_6293",
                            "id": "ifm4pb0",
                            "parent_id": "t1_ifm400q",
                            "score": 1,
                            "created_utc": 1657471804.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Going to double reply to this \n\nI agree that seeking has girls looking for real relationships though that wasn’t what I was looking for. I’ve had a couple SR turn into a vanilla non paid relationship and it just want for me 🤷‍♂️",
            "author": "Late_Ad_6293",
            "id": "ifm50oq",
            "parent_id": "t1_iflxk1t",
            "score": 1,
            "created_utc": 1657471935.0,
            "replies": []
        },
        {
            "body": "Hi\nI keep seeing some sd’s seeing this as “all SB’s are bad”\nI have had far more wonderful experiences than bad ones however the bad does exist and this post is mainly for younger men looking to become a sd. A cautionary post of sorts",
            "author": "Late_Ad_6293",
            "id": "ifm49u0",
            "parent_id": "t1_ifm3xxa",
            "score": 2,
            "created_utc": 1657471621.0,
            "replies": []
        },
        {
            "body": "I said how in this thread don’t really want to keep saying how it happened.\n\nAlso while I agree with a lot of your post I don’t want to believe most women are how you described or have the mindset you described which is why I’m retiring because being in this lifestyle in my opinions does lead to this thinking we both share right now about them.",
            "author": "Late_Ad_6293",
            "id": "ifm9qey",
            "parent_id": "t1_ifm8485",
            "score": 1,
            "created_utc": 1657473941.0,
            "replies": []
        },
        {
            "body": "Please read the other comments, I’ve answered this.",
            "author": "Late_Ad_6293",
            "id": "ifmmts4",
            "parent_id": "t1_ifmm4af",
            "score": 1,
            "created_utc": 1657479601.0,
            "replies": [
                {
                    "body": "I still don't understand how a full grown man can be forced into intimacy. Not being funny but did they put a gun to your head? It just doesn't compute.",
                    "author": "Shot_Anywhere",
                    "id": "ifmo2in",
                    "parent_id": "t1_ifmmts4",
                    "score": 1,
                    "created_utc": 1657480141.0,
                    "replies": [
                        {
                            "body": "Read the comments? I was tied up",
                            "author": "Late_Ad_6293",
                            "id": "ifmomj4",
                            "parent_id": "t1_ifmo2in",
                            "score": 1,
                            "created_utc": 1657480386.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "My post was mainly for SD’s not SB’s. I can’t say anything about the lifestyle for SB’s",
            "author": "Late_Ad_6293",
            "id": "ifn6stg",
            "parent_id": "t1_ifn6gk8",
            "score": 1,
            "created_utc": 1657488230.0,
            "replies": [
                {
                    "body": "Oh I’m aware it’s just interesting to learn about the lifestyle from both sides. I know people can be garbage and seeing what SD can go through just hurts my heart. Something I never really thought about I suppose.",
                    "author": "unicornmagic675",
                    "id": "ifn757o",
                    "parent_id": "t1_ifn6stg",
                    "score": 1,
                    "created_utc": 1657488379.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "That's not necessarily a bad thing tho.\nQuite the opposite actually.\nI basically raised my younger siblings until I became emancipated and finally was able to escape.\n\nDid it suck?\nFuuuuuuuuuuuuuuuuuck YES!!!!\n\nBuuut....\nIt showed me a lot of the World, and taught me to see people in a different way than most do.\n\nBtw, This is usually a trauma response. \nJust because it's caused from something crappy, it DOESNT mean that you can't take and MAKE a shit sandwich into something better....it's all in you!",
            "author": "JustAsk4Alice",
            "id": "ifjvzj9",
            "parent_id": "t1_ifjrzsf",
            "score": 8,
            "created_utc": 1657421948.0,
            "replies": [
                {
                    "body": "In hindsight I’m glad he did it wasn’t a bad thing at all.",
                    "author": "Late_Ad_6293",
                    "id": "ifjwk4m",
                    "parent_id": "t1_ifjvzj9",
                    "score": 9,
                    "created_utc": 1657422245.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "It’s wild. I think what would have helped me was way more question asking, way more vetting, looking up public records, daytime only dating and in public places, never deleting a single photo or picture.",
            "author": "MapleSappling",
            "id": "ifjxhty",
            "parent_id": "t1_ifjwbhx",
            "score": 4,
            "created_utc": 1657422740.0,
            "replies": [
                {
                    "body": "I don’t know about you, but I have become a CSI level stalk master lol. I can trust trust trust, but it works BOTH ways.",
                    "author": "Kindly-Hour-4650",
                    "id": "ifldu48",
                    "parent_id": "t1_ifjxhty",
                    "score": 3,
                    "created_utc": 1657459824.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I also had the income in my 20s and wish that I had discovered sugar dating and pursued it.  Maybe it would have prevented me from marrying a horrible, evil woman.",
            "author": "MrBigCoc",
            "id": "ifmg1b7",
            "parent_id": "t1_ifl8txx",
            "score": 3,
            "created_utc": 1657476649.0,
            "replies": [
                {
                    "body": "You would have still married a horrible woman, just one that was also money hungry.",
                    "author": "malcolm_reyn0lds",
                    "id": "ifond4p",
                    "parent_id": "t1_ifmg1b7",
                    "score": 1,
                    "created_utc": 1657513797.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Seriously. It's a shortcut with major drawbacks. You start getting involved with people who wouldn't be with you if it weren't for the money at a young age and it will really warp your mind and perspective. If you are a young guy with money, invest it. Save. Buy property. Get your ass in the gym and look good. Travel the world and meet new people. Date normally and get better with women. If you are in your 20s with a lot of money and confident in your looks you shouldn't have any problems finding and meeting women.",
            "author": "malcolm_reyn0lds",
            "id": "iflf5qr",
            "parent_id": "t1_ifl8txx",
            "score": 4,
            "created_utc": 1657460492.0,
            "replies": []
        },
        {
            "body": "I heard her story on an episode of Small Town Murder. I think OP's post is written in an experienced and thoughtful way. No matter how nice someone is to you, having things in common/having mutual attraction - there's always possibility of risk. Sugaring is dangerous in so many tiers of development. I meant what I said when anyone can work/be involved in something and become wary of a group of people. A stripper, a SD, even a diner waitress. \n\nMistrust is good to learn early on. Knowing when to stop sugaring before becoming jaded is admirable.",
            "author": "Dull-Resolution3246",
            "id": "ifozvto",
            "parent_id": "t1_ifowd7y",
            "score": 2,
            "created_utc": 1657522332.0,
            "replies": []
        },
        {
            "body": "What happens now a days?  I never carry cash. Do bums take Venmo now?",
            "author": "aajniojnoihnoi",
            "id": "ifjqwzt",
            "parent_id": "t1_ifjqbzu",
            "score": 10,
            "created_utc": 1657419311.0,
            "replies": [
                {
                    "body": "Bahaha, funnily enough another time I was in an attempted robbery I didn’t carry cash and was going to pull the venmo at the end of the day so it was quite the awkward situation.\n\nThis date though had explicitly asked for cash and then even asked to SEE it when the date began. As it was my first date, I didn’t think anything of the red flags.",
                    "author": "Late_Ad_6293",
                    "id": "ifjr5z2",
                    "parent_id": "t1_ifjqwzt",
                    "score": 11,
                    "created_utc": 1657419440.0,
                    "replies": [
                        {
                            "body": "Asking to see the cash would have had me making for a quick exit.",
                            "author": "aajniojnoihnoi",
                            "id": "ifjsgcc",
                            "parent_id": "t1_ifjr5z2",
                            "score": 8,
                            "created_utc": 1657420108.0,
                            "replies": [
                                {
                                    "body": "I was young, dumb, and new. 🤷‍♂️ no excuses",
                                    "author": "Late_Ad_6293",
                                    "id": "ifjsowe",
                                    "parent_id": "t1_ifjsgcc",
                                    "score": 6,
                                    "created_utc": 1657420235.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "I was caught off guard when a Streetwise (local publication that helps the homeless restart their lives) vendor called me out when I said I didn’t have cash by showing me they took Venmo and Zelle.\n\nSo yeah, I think it’s possible they’d hold you at gun point to do that.",
                    "author": null,
                    "id": "ifjrnzl",
                    "parent_id": "t1_ifjqwzt",
                    "score": 5,
                    "created_utc": 1657419697.0,
                    "replies": [
                        {
                            "body": "In Mexico they have express kidnappings where they drive you from ATM to ATM until you hit your withdrawal limit.",
                            "author": "aajniojnoihnoi",
                            "id": "ifjslc4",
                            "parent_id": "t1_ifjrnzl",
                            "score": 6,
                            "created_utc": 1657420183.0,
                            "replies": [
                                {
                                    "body": "Happens in the US, too.",
                                    "author": null,
                                    "id": "ifjsxnv",
                                    "parent_id": "t1_ifjslc4",
                                    "score": 1,
                                    "created_utc": 1657420360.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "A lot of street newspapers vendors do accept venmo (and many unhoused people have a cell phone). \n\nI wouldn't classify those folks as bums though. Those are just very poor people trying to make an honest living and unlike panhandlers, they do provide value.",
                            "author": "LightOLove",
                            "id": "iflf2nq",
                            "parent_id": "t1_ifjrnzl",
                            "score": -1,
                            "created_utc": 1657460450.0,
                            "replies": [
                                {
                                    "body": "I didn’t call them bums.",
                                    "author": null,
                                    "id": "iflhcqp",
                                    "parent_id": "t1_iflf2nq",
                                    "score": 1,
                                    "created_utc": 1657461572.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Shiiiiit, you joke, there's plllllllenty of Homeless with cashapp and venmo!!!!!😳",
                    "author": "JustAsk4Alice",
                    "id": "ifjw8mk",
                    "parent_id": "t1_ifjqwzt",
                    "score": 1,
                    "created_utc": 1657422078.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Fuck that so fucking hard. I always make sure to have pepper spray because I’m not a fan of firearms at all.",
            "author": null,
            "id": "ifjqtzv",
            "parent_id": "t1_ifjqbzu",
            "score": 6,
            "created_utc": 1657419270.0,
            "replies": []
        },
        {
            "body": "To be fair, you could meet a girl on tinder vanilla dating, you still get robbed .. \n\nI often think it’s never the platform it’s people. \n\nLook at seek, some seek NSA, some seek true love.",
            "author": null,
            "id": "ifkfpjx",
            "parent_id": "t1_ifjqbzu",
            "score": 2,
            "created_utc": 1657434158.0,
            "replies": []
        },
        {
            "body": "a man being promiscuous is very different than a woman being promiscuos. very few men can be in these streets (most dont have the looks or money) while any reasonably attractive woman can be.",
            "author": "vtec__",
            "id": "ifldybz",
            "parent_id": "t1_ifl9q82",
            "score": -3,
            "created_utc": 1657459883.0,
            "replies": []
        },
        {
            "body": "Did you date all ages of women? Just curious. I am very particular and if there is even the slightest bit of hesitation or doubt in my mind, I am honest and tell the SD I don't want to move forward. In vanilla dating, I usually dated younger men but in the bowl it's been older. It's a bummer you've had this experience. Hopefully you meet someone with true connection who knows nothing about your wealth at a party or park. Best wishes!",
            "author": "iamrosieriley",
            "id": "ifkwy16",
            "parent_id": "t1_ifk53a5",
            "score": 1,
            "created_utc": 1657448485.0,
            "replies": []
        },
        {
            "body": "Nice! That is not super excessive…i usually do one date per week sometimes 2… I bet you will be back in bowl…..nothing can match the bowl experience :)",
            "author": "IllustriousCake8030",
            "id": "ifk2blq",
            "parent_id": "t1_ifjytp9",
            "score": 0,
            "created_utc": 1657425401.0,
            "replies": []
        },
        {
            "body": "I'm guessing your wealth and youth may have made you a target for unscrupulous women as well, unfortunately.",
            "author": "SDinAsia",
            "id": "ifjpssi",
            "parent_id": "t1_ifjpac3",
            "score": 2,
            "created_utc": 1657418740.0,
            "replies": []
        },
        {
            "body": "Hopefully being out of the bowl will bring some light back to you.",
            "author": "ShaArt5",
            "id": "ifjr4ce",
            "parent_id": "t1_ifjprf6",
            "score": 4,
            "created_utc": 1657419417.0,
            "replies": [
                {
                    "body": "Don’t think it will but I am hoping to forget the stuff I saw / heard so I don’t have that negativity in my head.",
                    "author": "Late_Ad_6293",
                    "id": "ifjrasu",
                    "parent_id": "t1_ifjr4ce",
                    "score": 5,
                    "created_utc": 1657419510.0,
                    "replies": [
                        {
                            "body": "I hope that for you as well. And that you gain a bit more freedom.",
                            "author": "ShaArt5",
                            "id": "ifjrphq",
                            "parent_id": "t1_ifjrasu",
                            "score": 4,
                            "created_utc": 1657419718.0,
                            "replies": []
                        },
                        {
                            "body": "Remember the bowl attracts a small part of the overall population, and certain tendicies / traits / personal motives are attracted to it more frequently than others. \n\nAnd your approach of meet hot girls and have fun certainly didn’t help you filter away from that. \n\nThat said, good luck in your step away from the bowl and I wish you success outside of it.",
                            "author": "midwesternguru",
                            "id": "ifm7zcp",
                            "parent_id": "t1_ifjrasu",
                            "score": 2,
                            "created_utc": 1657473191.0,
                            "replies": []
                        },
                        {
                            "body": "I might be able to help you with that part.",
                            "author": "JustAsk4Alice",
                            "id": "ifjxa09",
                            "parent_id": "t1_ifjrasu",
                            "score": 0,
                            "created_utc": 1657422625.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Why did you have to clarify that you’re not brown ?",
            "author": "lizliz1020",
            "id": "ifjs75q",
            "parent_id": "t1_ifjprf6",
            "score": 3,
            "created_utc": 1657419974.0,
            "replies": [
                {
                    "body": "Because usually when I say arranged marriage people think I am brown or Indian. I am white and slavic. I don’t want people to assume I am representing a group of people that I am not.",
                    "author": "Late_Ad_6293",
                    "id": "ifjsj6j",
                    "parent_id": "t1_ifjs75q",
                    "score": 13,
                    "created_utc": 1657420152.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Now is a better time than ever to break the tradition of arranged marriage in your family, FUCK THAT. Break the cycle now and tell your parents you are absolutely 100% not entering an arranged marriage. \n\nSuch a shitty thing for parents to do to their kids, tradition be damned.",
            "author": "contento2021",
            "id": "ifk6tog",
            "parent_id": "t1_ifjprf6",
            "score": 3,
            "created_utc": 1657428050.0,
            "replies": [
                {
                    "body": "Respectfully fuck you. Tradition and my parents are probably the main reasons why I am successful in life. \n\nI never once said I was against arranged marriages, I just said that it would be flawed to lead girls on when I am never going to be seriously committed to the relationship. I am 100% FOR it.",
                    "author": "Late_Ad_6293",
                    "id": "ifk73yu",
                    "parent_id": "t1_ifk6tog",
                    "score": 5,
                    "created_utc": 1657428228.0,
                    "replies": [
                        {
                            "body": "Ah so your parents have successfully indoctrinated the next generation of brainless sheep, respectfully. One day you'll get to treat your own kids like chattel!",
                            "author": "contento2021",
                            "id": "ifk7d0w",
                            "parent_id": "t1_ifk73yu",
                            "score": 4,
                            "created_utc": 1657428387.0,
                            "replies": [
                                {
                                    "body": "First off did I say I was being forced into it?\n\nMy parents have given me the option to choose. I don’t want to as I am for arranged marriages. My brother chose his own wife as he didn’t believe in arranged.\nYou sir have no idea about how my family works and what I will employ to my own children.\n\nSounds like you’re projecting what happened to you.",
                                    "author": "Late_Ad_6293",
                                    "id": "ifk7u4l",
                                    "parent_id": "t1_ifk7d0w",
                                    "score": 4,
                                    "created_utc": 1657428685.0,
                                    "replies": [
                                        {
                                            "body": "Gotta admit... I'm having trouble reconciling how you're simultaneously pro-arranged marriage and yet also attracted to sugar dating.",
                                            "author": null,
                                            "id": "ifk9w29",
                                            "parent_id": "t1_ifk7u4l",
                                            "score": 4,
                                            "created_utc": 1657430013.0,
                                            "replies": [
                                                {
                                                    "body": "One can do anything and have fun before marriage and then once marriage happens you can settle down.\n\nThat’s how I think about it.",
                                                    "author": "Late_Ad_6293",
                                                    "id": "ifkb0on",
                                                    "parent_id": "t1_ifk9w29",
                                                    "score": 3,
                                                    "created_utc": 1657430780.0,
                                                    "replies": [
                                                        {
                                                            "body": "It almost sounds like you're expecting the fun to stop when you're wed though.\n\nI dunno, coming from a family with lots of toxic and failed arranged marriages around me, I don't see the appeal that you're evidently finding in i. You do you if it makes you happy though",
                                                            "author": null,
                                                            "id": "ifkbblx",
                                                            "parent_id": "t1_ifkb0on",
                                                            "score": 2,
                                                            "created_utc": 1657430992.0,
                                                            "replies": [
                                                                {
                                                                    "body": "I don’t expect to cheat on my wife if that’s what you’re suggesting?\n\nSorry to hear the marriages didn’t work in your family",
                                                                    "author": "Late_Ad_6293",
                                                                    "id": "ifkkjun",
                                                                    "parent_id": "t1_ifkbblx",
                                                                    "score": 1,
                                                                    "created_utc": 1657437946.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "I relate to this so much. Agreed",
                    "author": "lipstickdiet",
                    "id": "ifkihtj",
                    "parent_id": "t1_ifk6tog",
                    "score": 1,
                    "created_utc": 1657436305.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I think this is where you are wrong about your first point. If you are young AND good looking then a lot of SB’s will lower their allowance expectations, and/or offer to date you for free. You are young but not good looking from what you just wrote.",
            "author": null,
            "id": "ifjra62",
            "parent_id": "t1_ifjprf6",
            "score": 1,
            "created_utc": 1657419501.0,
            "replies": [
                {
                    "body": "I’d say I’m average. Not ugly, just average.\nMost SB’s would make comments about it. I could tell they were genuine but common sense is common sense. Attractive guys will get better opportunities.\n\nHowever my point is that if a girl is offering you a PPM / allowance she has already made that decision.\n\nMy first point was that some of these guys will go “I’ll give you xx for the date because I’m so young and not ugly so it’s still good right?”\nA few hundred dollars off is expected for being good looking / younger but going 70-90% lower? Good luck partner",
                    "author": "Late_Ad_6293",
                    "id": "ifjrqo7",
                    "parent_id": "t1_ifjra62",
                    "score": 5,
                    "created_utc": 1657419736.0,
                    "replies": [
                        {
                            "body": "You’d be surprised.",
                            "author": null,
                            "id": "ifjs0pc",
                            "parent_id": "t1_ifjrqo7",
                            "score": 2,
                            "created_utc": 1657419880.0,
                            "replies": [
                                {
                                    "body": "Hey I’ve seen it happen but just setting realistic expectations. That’s rare and often gets messy ;)",
                                    "author": "Late_Ad_6293",
                                    "id": "ifjs4gf",
                                    "parent_id": "t1_ifjs0pc",
                                    "score": 3,
                                    "created_utc": 1657419935.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "Thought young girls nowadays just hookup .. 🤔\n\nThe white girls in NZ go clubbing on Friday then hookup with a dude when they get drunk, wake up the next day and look at him thinking not too bad, then a relationship is created .. for about 3 weeks then they repeat again ..",
                            "author": null,
                            "id": "ifkg5o9",
                            "parent_id": "t1_ifjrqo7",
                            "score": 1,
                            "created_utc": 1657434495.0,
                            "replies": [
                                {
                                    "body": "That’s the same here in the US. If someone really wants to hook up there are plenty of ways for them to do it.\nIf someone is looking for a certain demographic though I think they would have trouble even in the clubs haha",
                                    "author": "Late_Ad_6293",
                                    "id": "ifkk5qb",
                                    "parent_id": "t1_ifkg5o9",
                                    "score": 1,
                                    "created_utc": 1657437632.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": ">If you are young AND good looking then a lot of SB’s will lower their allowance expectations, and/or offer to date you for free.\n\nYes and no. Free is a relative term. Some SBs will do that because, after all, they are women and they want to date a hot young dude. There is nothing surprising there.\n\nBut many of those SBs are likely looking for a husband because that is also what women do. They have fun until they find the 'right one'. If the guy is sufficiently wealthy and falling in love, they don't need to lower the price if they're smart.\n\nYou know what, men do the same thing - have fun dating until Mrs. Right comes along.\n\nWhen you marry a girl the price is actually much higher than dating or sugaring. Youth has nothing to do with it really when it comes to marriage, unless that is what you want to have. Several of my friends have met their young wives through the sugar bowl and had very happy marriages. They were happy because the women were young, beautiful, well-mannered, educated and brought up in good families while the men were old, professional, smart and very wealthy. The women knew they would in all likelihood outlast the men by decades and have tons of money by time they were left single widows in the 30-50 age range. So they made sure to treat the husbands like the personal gold mines they were. And that is exactly what happened in one case already; he died and left her wealthy and single. Their first date was a double date with me and another girl. She's now the Merry Widow.",
                    "author": "StiffHappens",
                    "id": "ifk6fj2",
                    "parent_id": "t1_ifjra62",
                    "score": 2,
                    "created_utc": 1657427804.0,
                    "replies": []
                }
            ]
        },
        {
            "body": ">con of now seeing the female population in a different light.\n\nPerhaps I'm misreading you, but I imagine that the way you see \"the female population\" now is more realistic than before. Is so, why is that a con?",
            "author": "THROW_AWAY_solution",
            "id": "ifnkag1",
            "parent_id": "t1_ifjprf6",
            "score": 1,
            "created_utc": 1657494221.0,
            "replies": [
                {
                    "body": "I’d like not to believe that all women are lying to their boyfriends / husbands.\nIf that’s realistic than I hope to back to fantasy lol",
                    "author": "Late_Ad_6293",
                    "id": "ifnl42l",
                    "parent_id": "t1_ifnkag1",
                    "score": 1,
                    "created_utc": 1657494608.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "This!\nUnless you find a unicorn multi-millionaire hottie who's into you, it's sugar whether you met on SA or tinder",
            "author": "kingporterstomp",
            "id": "ifk166v",
            "parent_id": "t1_ifjtt69",
            "score": 4,
            "created_utc": 1657424747.0,
            "replies": []
        },
        {
            "body": "I dated in college. I would say my three girlfriends in college were way above my league and pretty hot.\n\nDidn’t have time for dating when I was out of college. So you lost the bet.",
            "author": "Late_Ad_6293",
            "id": "ifk2v2z",
            "parent_id": "t1_ifjy7zw",
            "score": 2,
            "created_utc": 1657425711.0,
            "replies": [
                {
                    "body": "I was responding to ashatteredking, not you lol.",
                    "author": null,
                    "id": "ifk34tl",
                    "parent_id": "t1_ifk2v2z",
                    "score": 2,
                    "created_utc": 1657425864.0,
                    "replies": [
                        {
                            "body": "Ah sorry just reread. I was responding to the notifications.\nMy apologies.",
                            "author": "Late_Ad_6293",
                            "id": "ifk3vq9",
                            "parent_id": "t1_ifk34tl",
                            "score": 2,
                            "created_utc": 1657426291.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "2 ex gfs ago, when I was just shy of 40, I dated a girl that was probably a 7 22 year old. Yes, obviously I can date higher quality women if I'm willing to give them an allowance. It doesn't change what I said.",
            "author": "AShatteredKing",
            "id": "ifkeusy",
            "parent_id": "t1_ifjy7zw",
            "score": 0,
            "created_utc": 1657433519.0,
            "replies": [
                {
                    "body": "Great, I’ve vanilla dated several younger women from tinder as well. But that doesn’t mean you were able to do it consistently and effortlessly. I’m sure you put in a lot of work to date that 22 yo, and didn’t have a bunch of 22 yo’s lining up to date you on tinder. \n\nIt’s 10x easier to date those hot 22 yo on seeking. Not sure it’s even debatable.",
                    "author": null,
                    "id": "ifl4pf2",
                    "parent_id": "t1_ifkeusy",
                    "score": 3,
                    "created_utc": 1657454417.0,
                    "replies": [
                        {
                            "body": "Yes, of course it's easier to date hot 22 yos on seeking. That doesn't change anything I said.",
                            "author": "AShatteredKing",
                            "id": "iflmezz",
                            "parent_id": "t1_ifl4pf2",
                            "score": 2,
                            "created_utc": 1657463886.0,
                            "replies": [
                                {
                                    "body": "Great. So you agree with me.",
                                    "author": null,
                                    "id": "iflmhyc",
                                    "parent_id": "t1_iflmezz",
                                    "score": 1,
                                    "created_utc": 1657463922.0,
                                    "replies": [
                                        {
                                            "body": "As I said, your point doesn't change anything I said.",
                                            "author": "AShatteredKing",
                                            "id": "ifm09eo",
                                            "parent_id": "t1_iflmhyc",
                                            "score": 1,
                                            "created_utc": 1657469903.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "You are saying that women are just looking to get paid, have fun and the men are being used. How is that not misogynistic rhetoric?",
            "author": "AShatteredKing",
            "id": "ifkf1fq",
            "parent_id": "t1_ifjvxh8",
            "score": 0,
            "created_utc": 1657433659.0,
            "replies": [
                {
                    "body": "You’re one of those guys who gets offended everytime a girl says “all men are trash” huh?",
                    "author": "Late_Ad_6293",
                    "id": "ifkkf9w",
                    "parent_id": "t1_ifkf1fq",
                    "score": 1,
                    "created_utc": 1657437844.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Men Going Their Own Way - basically incels. OP is def not one",
            "author": "kingporterstomp",
            "id": "ifk1b4b",
            "parent_id": "t1_ifjxprq",
            "score": 3,
            "created_utc": 1657424825.0,
            "replies": [
                {
                    "body": "Thank you for answering my question! 😁",
                    "author": "BeneficialBabe",
                    "id": "ifk1eb9",
                    "parent_id": "t1_ifk1b4b",
                    "score": 2,
                    "created_utc": 1657424874.0,
                    "replies": []
                },
                {
                    "body": "No, they are not incels. They are more like radical MRAs that blame women for all their problems and have decided to swear off women.\n\nThe op's rhetoric is exactly like that of the MGTOW.",
                    "author": "AShatteredKing",
                    "id": "ifkexj8",
                    "parent_id": "t1_ifk1b4b",
                    "score": 2,
                    "created_utc": 1657433577.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "That’s insane - so sorry to hear that.",
            "author": "JDMultralight",
            "id": "ifk8i3c",
            "parent_id": "t1_ifk7kye",
            "score": 1,
            "created_utc": 1657429109.0,
            "replies": []
        },
        {
            "body": "Those ropes must have been tight.",
            "author": "malcolm_reyn0lds",
            "id": "ifkzh9i",
            "parent_id": "t1_ifk7kye",
            "score": 1,
            "created_utc": 1657450582.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "ifm400q",
            "parent_id": "t1_iflxrrz",
            "score": 1,
            "created_utc": 1657471502.0,
            "replies": [
                {
                    "body": "Lol also not trying to scare people away but giving a realistic expectation for people. I’m sure this post will help many potential sd’s looking to join into the lifestyle as they can read the comments as well to get others perspectives as well",
                    "author": "Late_Ad_6293",
                    "id": "ifm4pb0",
                    "parent_id": "t1_ifm400q",
                    "score": 1,
                    "created_utc": 1657471804.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I still don't understand how a full grown man can be forced into intimacy. Not being funny but did they put a gun to your head? It just doesn't compute.",
            "author": "Shot_Anywhere",
            "id": "ifmo2in",
            "parent_id": "t1_ifmmts4",
            "score": 1,
            "created_utc": 1657480141.0,
            "replies": [
                {
                    "body": "Read the comments? I was tied up",
                    "author": "Late_Ad_6293",
                    "id": "ifmomj4",
                    "parent_id": "t1_ifmo2in",
                    "score": 1,
                    "created_utc": 1657480386.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Oh I’m aware it’s just interesting to learn about the lifestyle from both sides. I know people can be garbage and seeing what SD can go through just hurts my heart. Something I never really thought about I suppose.",
            "author": "unicornmagic675",
            "id": "ifn757o",
            "parent_id": "t1_ifn6stg",
            "score": 1,
            "created_utc": 1657488379.0,
            "replies": []
        },
        {
            "body": "In hindsight I’m glad he did it wasn’t a bad thing at all.",
            "author": "Late_Ad_6293",
            "id": "ifjwk4m",
            "parent_id": "t1_ifjvzj9",
            "score": 9,
            "created_utc": 1657422245.0,
            "replies": []
        },
        {
            "body": "I don’t know about you, but I have become a CSI level stalk master lol. I can trust trust trust, but it works BOTH ways.",
            "author": "Kindly-Hour-4650",
            "id": "ifldu48",
            "parent_id": "t1_ifjxhty",
            "score": 3,
            "created_utc": 1657459824.0,
            "replies": []
        },
        {
            "body": "You would have still married a horrible woman, just one that was also money hungry.",
            "author": "malcolm_reyn0lds",
            "id": "ifond4p",
            "parent_id": "t1_ifmg1b7",
            "score": 1,
            "created_utc": 1657513797.0,
            "replies": []
        },
        {
            "body": "Bahaha, funnily enough another time I was in an attempted robbery I didn’t carry cash and was going to pull the venmo at the end of the day so it was quite the awkward situation.\n\nThis date though had explicitly asked for cash and then even asked to SEE it when the date began. As it was my first date, I didn’t think anything of the red flags.",
            "author": "Late_Ad_6293",
            "id": "ifjr5z2",
            "parent_id": "t1_ifjqwzt",
            "score": 11,
            "created_utc": 1657419440.0,
            "replies": [
                {
                    "body": "Asking to see the cash would have had me making for a quick exit.",
                    "author": "aajniojnoihnoi",
                    "id": "ifjsgcc",
                    "parent_id": "t1_ifjr5z2",
                    "score": 8,
                    "created_utc": 1657420108.0,
                    "replies": [
                        {
                            "body": "I was young, dumb, and new. 🤷‍♂️ no excuses",
                            "author": "Late_Ad_6293",
                            "id": "ifjsowe",
                            "parent_id": "t1_ifjsgcc",
                            "score": 6,
                            "created_utc": 1657420235.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I was caught off guard when a Streetwise (local publication that helps the homeless restart their lives) vendor called me out when I said I didn’t have cash by showing me they took Venmo and Zelle.\n\nSo yeah, I think it’s possible they’d hold you at gun point to do that.",
            "author": null,
            "id": "ifjrnzl",
            "parent_id": "t1_ifjqwzt",
            "score": 5,
            "created_utc": 1657419697.0,
            "replies": [
                {
                    "body": "In Mexico they have express kidnappings where they drive you from ATM to ATM until you hit your withdrawal limit.",
                    "author": "aajniojnoihnoi",
                    "id": "ifjslc4",
                    "parent_id": "t1_ifjrnzl",
                    "score": 6,
                    "created_utc": 1657420183.0,
                    "replies": [
                        {
                            "body": "Happens in the US, too.",
                            "author": null,
                            "id": "ifjsxnv",
                            "parent_id": "t1_ifjslc4",
                            "score": 1,
                            "created_utc": 1657420360.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "A lot of street newspapers vendors do accept venmo (and many unhoused people have a cell phone). \n\nI wouldn't classify those folks as bums though. Those are just very poor people trying to make an honest living and unlike panhandlers, they do provide value.",
                    "author": "LightOLove",
                    "id": "iflf2nq",
                    "parent_id": "t1_ifjrnzl",
                    "score": -1,
                    "created_utc": 1657460450.0,
                    "replies": [
                        {
                            "body": "I didn’t call them bums.",
                            "author": null,
                            "id": "iflhcqp",
                            "parent_id": "t1_iflf2nq",
                            "score": 1,
                            "created_utc": 1657461572.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Shiiiiit, you joke, there's plllllllenty of Homeless with cashapp and venmo!!!!!😳",
            "author": "JustAsk4Alice",
            "id": "ifjw8mk",
            "parent_id": "t1_ifjqwzt",
            "score": 1,
            "created_utc": 1657422078.0,
            "replies": []
        },
        {
            "body": "Don’t think it will but I am hoping to forget the stuff I saw / heard so I don’t have that negativity in my head.",
            "author": "Late_Ad_6293",
            "id": "ifjrasu",
            "parent_id": "t1_ifjr4ce",
            "score": 5,
            "created_utc": 1657419510.0,
            "replies": [
                {
                    "body": "I hope that for you as well. And that you gain a bit more freedom.",
                    "author": "ShaArt5",
                    "id": "ifjrphq",
                    "parent_id": "t1_ifjrasu",
                    "score": 4,
                    "created_utc": 1657419718.0,
                    "replies": []
                },
                {
                    "body": "Remember the bowl attracts a small part of the overall population, and certain tendicies / traits / personal motives are attracted to it more frequently than others. \n\nAnd your approach of meet hot girls and have fun certainly didn’t help you filter away from that. \n\nThat said, good luck in your step away from the bowl and I wish you success outside of it.",
                    "author": "midwesternguru",
                    "id": "ifm7zcp",
                    "parent_id": "t1_ifjrasu",
                    "score": 2,
                    "created_utc": 1657473191.0,
                    "replies": []
                },
                {
                    "body": "I might be able to help you with that part.",
                    "author": "JustAsk4Alice",
                    "id": "ifjxa09",
                    "parent_id": "t1_ifjrasu",
                    "score": 0,
                    "created_utc": 1657422625.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Because usually when I say arranged marriage people think I am brown or Indian. I am white and slavic. I don’t want people to assume I am representing a group of people that I am not.",
            "author": "Late_Ad_6293",
            "id": "ifjsj6j",
            "parent_id": "t1_ifjs75q",
            "score": 13,
            "created_utc": 1657420152.0,
            "replies": []
        },
        {
            "body": "Respectfully fuck you. Tradition and my parents are probably the main reasons why I am successful in life. \n\nI never once said I was against arranged marriages, I just said that it would be flawed to lead girls on when I am never going to be seriously committed to the relationship. I am 100% FOR it.",
            "author": "Late_Ad_6293",
            "id": "ifk73yu",
            "parent_id": "t1_ifk6tog",
            "score": 5,
            "created_utc": 1657428228.0,
            "replies": [
                {
                    "body": "Ah so your parents have successfully indoctrinated the next generation of brainless sheep, respectfully. One day you'll get to treat your own kids like chattel!",
                    "author": "contento2021",
                    "id": "ifk7d0w",
                    "parent_id": "t1_ifk73yu",
                    "score": 4,
                    "created_utc": 1657428387.0,
                    "replies": [
                        {
                            "body": "First off did I say I was being forced into it?\n\nMy parents have given me the option to choose. I don’t want to as I am for arranged marriages. My brother chose his own wife as he didn’t believe in arranged.\nYou sir have no idea about how my family works and what I will employ to my own children.\n\nSounds like you’re projecting what happened to you.",
                            "author": "Late_Ad_6293",
                            "id": "ifk7u4l",
                            "parent_id": "t1_ifk7d0w",
                            "score": 4,
                            "created_utc": 1657428685.0,
                            "replies": [
                                {
                                    "body": "Gotta admit... I'm having trouble reconciling how you're simultaneously pro-arranged marriage and yet also attracted to sugar dating.",
                                    "author": null,
                                    "id": "ifk9w29",
                                    "parent_id": "t1_ifk7u4l",
                                    "score": 4,
                                    "created_utc": 1657430013.0,
                                    "replies": [
                                        {
                                            "body": "One can do anything and have fun before marriage and then once marriage happens you can settle down.\n\nThat’s how I think about it.",
                                            "author": "Late_Ad_6293",
                                            "id": "ifkb0on",
                                            "parent_id": "t1_ifk9w29",
                                            "score": 3,
                                            "created_utc": 1657430780.0,
                                            "replies": [
                                                {
                                                    "body": "It almost sounds like you're expecting the fun to stop when you're wed though.\n\nI dunno, coming from a family with lots of toxic and failed arranged marriages around me, I don't see the appeal that you're evidently finding in i. You do you if it makes you happy though",
                                                    "author": null,
                                                    "id": "ifkbblx",
                                                    "parent_id": "t1_ifkb0on",
                                                    "score": 2,
                                                    "created_utc": 1657430992.0,
                                                    "replies": [
                                                        {
                                                            "body": "I don’t expect to cheat on my wife if that’s what you’re suggesting?\n\nSorry to hear the marriages didn’t work in your family",
                                                            "author": "Late_Ad_6293",
                                                            "id": "ifkkjun",
                                                            "parent_id": "t1_ifkbblx",
                                                            "score": 1,
                                                            "created_utc": 1657437946.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I relate to this so much. Agreed",
            "author": "lipstickdiet",
            "id": "ifkihtj",
            "parent_id": "t1_ifk6tog",
            "score": 1,
            "created_utc": 1657436305.0,
            "replies": []
        },
        {
            "body": "I’d say I’m average. Not ugly, just average.\nMost SB’s would make comments about it. I could tell they were genuine but common sense is common sense. Attractive guys will get better opportunities.\n\nHowever my point is that if a girl is offering you a PPM / allowance she has already made that decision.\n\nMy first point was that some of these guys will go “I’ll give you xx for the date because I’m so young and not ugly so it’s still good right?”\nA few hundred dollars off is expected for being good looking / younger but going 70-90% lower? Good luck partner",
            "author": "Late_Ad_6293",
            "id": "ifjrqo7",
            "parent_id": "t1_ifjra62",
            "score": 5,
            "created_utc": 1657419736.0,
            "replies": [
                {
                    "body": "You’d be surprised.",
                    "author": null,
                    "id": "ifjs0pc",
                    "parent_id": "t1_ifjrqo7",
                    "score": 2,
                    "created_utc": 1657419880.0,
                    "replies": [
                        {
                            "body": "Hey I’ve seen it happen but just setting realistic expectations. That’s rare and often gets messy ;)",
                            "author": "Late_Ad_6293",
                            "id": "ifjs4gf",
                            "parent_id": "t1_ifjs0pc",
                            "score": 3,
                            "created_utc": 1657419935.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Thought young girls nowadays just hookup .. 🤔\n\nThe white girls in NZ go clubbing on Friday then hookup with a dude when they get drunk, wake up the next day and look at him thinking not too bad, then a relationship is created .. for about 3 weeks then they repeat again ..",
                    "author": null,
                    "id": "ifkg5o9",
                    "parent_id": "t1_ifjrqo7",
                    "score": 1,
                    "created_utc": 1657434495.0,
                    "replies": [
                        {
                            "body": "That’s the same here in the US. If someone really wants to hook up there are plenty of ways for them to do it.\nIf someone is looking for a certain demographic though I think they would have trouble even in the clubs haha",
                            "author": "Late_Ad_6293",
                            "id": "ifkk5qb",
                            "parent_id": "t1_ifkg5o9",
                            "score": 1,
                            "created_utc": 1657437632.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": ">If you are young AND good looking then a lot of SB’s will lower their allowance expectations, and/or offer to date you for free.\n\nYes and no. Free is a relative term. Some SBs will do that because, after all, they are women and they want to date a hot young dude. There is nothing surprising there.\n\nBut many of those SBs are likely looking for a husband because that is also what women do. They have fun until they find the 'right one'. If the guy is sufficiently wealthy and falling in love, they don't need to lower the price if they're smart.\n\nYou know what, men do the same thing - have fun dating until Mrs. Right comes along.\n\nWhen you marry a girl the price is actually much higher than dating or sugaring. Youth has nothing to do with it really when it comes to marriage, unless that is what you want to have. Several of my friends have met their young wives through the sugar bowl and had very happy marriages. They were happy because the women were young, beautiful, well-mannered, educated and brought up in good families while the men were old, professional, smart and very wealthy. The women knew they would in all likelihood outlast the men by decades and have tons of money by time they were left single widows in the 30-50 age range. So they made sure to treat the husbands like the personal gold mines they were. And that is exactly what happened in one case already; he died and left her wealthy and single. Their first date was a double date with me and another girl. She's now the Merry Widow.",
            "author": "StiffHappens",
            "id": "ifk6fj2",
            "parent_id": "t1_ifjra62",
            "score": 2,
            "created_utc": 1657427804.0,
            "replies": []
        },
        {
            "body": "I’d like not to believe that all women are lying to their boyfriends / husbands.\nIf that’s realistic than I hope to back to fantasy lol",
            "author": "Late_Ad_6293",
            "id": "ifnl42l",
            "parent_id": "t1_ifnkag1",
            "score": 1,
            "created_utc": 1657494608.0,
            "replies": []
        },
        {
            "body": "I was responding to ashatteredking, not you lol.",
            "author": null,
            "id": "ifk34tl",
            "parent_id": "t1_ifk2v2z",
            "score": 2,
            "created_utc": 1657425864.0,
            "replies": [
                {
                    "body": "Ah sorry just reread. I was responding to the notifications.\nMy apologies.",
                    "author": "Late_Ad_6293",
                    "id": "ifk3vq9",
                    "parent_id": "t1_ifk34tl",
                    "score": 2,
                    "created_utc": 1657426291.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Great, I’ve vanilla dated several younger women from tinder as well. But that doesn’t mean you were able to do it consistently and effortlessly. I’m sure you put in a lot of work to date that 22 yo, and didn’t have a bunch of 22 yo’s lining up to date you on tinder. \n\nIt’s 10x easier to date those hot 22 yo on seeking. Not sure it’s even debatable.",
            "author": null,
            "id": "ifl4pf2",
            "parent_id": "t1_ifkeusy",
            "score": 3,
            "created_utc": 1657454417.0,
            "replies": [
                {
                    "body": "Yes, of course it's easier to date hot 22 yos on seeking. That doesn't change anything I said.",
                    "author": "AShatteredKing",
                    "id": "iflmezz",
                    "parent_id": "t1_ifl4pf2",
                    "score": 2,
                    "created_utc": 1657463886.0,
                    "replies": [
                        {
                            "body": "Great. So you agree with me.",
                            "author": null,
                            "id": "iflmhyc",
                            "parent_id": "t1_iflmezz",
                            "score": 1,
                            "created_utc": 1657463922.0,
                            "replies": [
                                {
                                    "body": "As I said, your point doesn't change anything I said.",
                                    "author": "AShatteredKing",
                                    "id": "ifm09eo",
                                    "parent_id": "t1_iflmhyc",
                                    "score": 1,
                                    "created_utc": 1657469903.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "You’re one of those guys who gets offended everytime a girl says “all men are trash” huh?",
            "author": "Late_Ad_6293",
            "id": "ifkkf9w",
            "parent_id": "t1_ifkf1fq",
            "score": 1,
            "created_utc": 1657437844.0,
            "replies": []
        },
        {
            "body": "Thank you for answering my question! 😁",
            "author": "BeneficialBabe",
            "id": "ifk1eb9",
            "parent_id": "t1_ifk1b4b",
            "score": 2,
            "created_utc": 1657424874.0,
            "replies": []
        },
        {
            "body": "No, they are not incels. They are more like radical MRAs that blame women for all their problems and have decided to swear off women.\n\nThe op's rhetoric is exactly like that of the MGTOW.",
            "author": "AShatteredKing",
            "id": "ifkexj8",
            "parent_id": "t1_ifk1b4b",
            "score": 2,
            "created_utc": 1657433577.0,
            "replies": []
        },
        {
            "body": "Lol also not trying to scare people away but giving a realistic expectation for people. I’m sure this post will help many potential sd’s looking to join into the lifestyle as they can read the comments as well to get others perspectives as well",
            "author": "Late_Ad_6293",
            "id": "ifm4pb0",
            "parent_id": "t1_ifm400q",
            "score": 1,
            "created_utc": 1657471804.0,
            "replies": []
        },
        {
            "body": "Read the comments? I was tied up",
            "author": "Late_Ad_6293",
            "id": "ifmomj4",
            "parent_id": "t1_ifmo2in",
            "score": 1,
            "created_utc": 1657480386.0,
            "replies": []
        },
        {
            "body": "Asking to see the cash would have had me making for a quick exit.",
            "author": "aajniojnoihnoi",
            "id": "ifjsgcc",
            "parent_id": "t1_ifjr5z2",
            "score": 8,
            "created_utc": 1657420108.0,
            "replies": [
                {
                    "body": "I was young, dumb, and new. 🤷‍♂️ no excuses",
                    "author": "Late_Ad_6293",
                    "id": "ifjsowe",
                    "parent_id": "t1_ifjsgcc",
                    "score": 6,
                    "created_utc": 1657420235.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "In Mexico they have express kidnappings where they drive you from ATM to ATM until you hit your withdrawal limit.",
            "author": "aajniojnoihnoi",
            "id": "ifjslc4",
            "parent_id": "t1_ifjrnzl",
            "score": 6,
            "created_utc": 1657420183.0,
            "replies": [
                {
                    "body": "Happens in the US, too.",
                    "author": null,
                    "id": "ifjsxnv",
                    "parent_id": "t1_ifjslc4",
                    "score": 1,
                    "created_utc": 1657420360.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "A lot of street newspapers vendors do accept venmo (and many unhoused people have a cell phone). \n\nI wouldn't classify those folks as bums though. Those are just very poor people trying to make an honest living and unlike panhandlers, they do provide value.",
            "author": "LightOLove",
            "id": "iflf2nq",
            "parent_id": "t1_ifjrnzl",
            "score": -1,
            "created_utc": 1657460450.0,
            "replies": [
                {
                    "body": "I didn’t call them bums.",
                    "author": null,
                    "id": "iflhcqp",
                    "parent_id": "t1_iflf2nq",
                    "score": 1,
                    "created_utc": 1657461572.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I hope that for you as well. And that you gain a bit more freedom.",
            "author": "ShaArt5",
            "id": "ifjrphq",
            "parent_id": "t1_ifjrasu",
            "score": 4,
            "created_utc": 1657419718.0,
            "replies": []
        },
        {
            "body": "Remember the bowl attracts a small part of the overall population, and certain tendicies / traits / personal motives are attracted to it more frequently than others. \n\nAnd your approach of meet hot girls and have fun certainly didn’t help you filter away from that. \n\nThat said, good luck in your step away from the bowl and I wish you success outside of it.",
            "author": "midwesternguru",
            "id": "ifm7zcp",
            "parent_id": "t1_ifjrasu",
            "score": 2,
            "created_utc": 1657473191.0,
            "replies": []
        },
        {
            "body": "I might be able to help you with that part.",
            "author": "JustAsk4Alice",
            "id": "ifjxa09",
            "parent_id": "t1_ifjrasu",
            "score": 0,
            "created_utc": 1657422625.0,
            "replies": []
        },
        {
            "body": "Ah so your parents have successfully indoctrinated the next generation of brainless sheep, respectfully. One day you'll get to treat your own kids like chattel!",
            "author": "contento2021",
            "id": "ifk7d0w",
            "parent_id": "t1_ifk73yu",
            "score": 4,
            "created_utc": 1657428387.0,
            "replies": [
                {
                    "body": "First off did I say I was being forced into it?\n\nMy parents have given me the option to choose. I don’t want to as I am for arranged marriages. My brother chose his own wife as he didn’t believe in arranged.\nYou sir have no idea about how my family works and what I will employ to my own children.\n\nSounds like you’re projecting what happened to you.",
                    "author": "Late_Ad_6293",
                    "id": "ifk7u4l",
                    "parent_id": "t1_ifk7d0w",
                    "score": 4,
                    "created_utc": 1657428685.0,
                    "replies": [
                        {
                            "body": "Gotta admit... I'm having trouble reconciling how you're simultaneously pro-arranged marriage and yet also attracted to sugar dating.",
                            "author": null,
                            "id": "ifk9w29",
                            "parent_id": "t1_ifk7u4l",
                            "score": 4,
                            "created_utc": 1657430013.0,
                            "replies": [
                                {
                                    "body": "One can do anything and have fun before marriage and then once marriage happens you can settle down.\n\nThat’s how I think about it.",
                                    "author": "Late_Ad_6293",
                                    "id": "ifkb0on",
                                    "parent_id": "t1_ifk9w29",
                                    "score": 3,
                                    "created_utc": 1657430780.0,
                                    "replies": [
                                        {
                                            "body": "It almost sounds like you're expecting the fun to stop when you're wed though.\n\nI dunno, coming from a family with lots of toxic and failed arranged marriages around me, I don't see the appeal that you're evidently finding in i. You do you if it makes you happy though",
                                            "author": null,
                                            "id": "ifkbblx",
                                            "parent_id": "t1_ifkb0on",
                                            "score": 2,
                                            "created_utc": 1657430992.0,
                                            "replies": [
                                                {
                                                    "body": "I don’t expect to cheat on my wife if that’s what you’re suggesting?\n\nSorry to hear the marriages didn’t work in your family",
                                                    "author": "Late_Ad_6293",
                                                    "id": "ifkkjun",
                                                    "parent_id": "t1_ifkbblx",
                                                    "score": 1,
                                                    "created_utc": 1657437946.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "You’d be surprised.",
            "author": null,
            "id": "ifjs0pc",
            "parent_id": "t1_ifjrqo7",
            "score": 2,
            "created_utc": 1657419880.0,
            "replies": [
                {
                    "body": "Hey I’ve seen it happen but just setting realistic expectations. That’s rare and often gets messy ;)",
                    "author": "Late_Ad_6293",
                    "id": "ifjs4gf",
                    "parent_id": "t1_ifjs0pc",
                    "score": 3,
                    "created_utc": 1657419935.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Thought young girls nowadays just hookup .. 🤔\n\nThe white girls in NZ go clubbing on Friday then hookup with a dude when they get drunk, wake up the next day and look at him thinking not too bad, then a relationship is created .. for about 3 weeks then they repeat again ..",
            "author": null,
            "id": "ifkg5o9",
            "parent_id": "t1_ifjrqo7",
            "score": 1,
            "created_utc": 1657434495.0,
            "replies": [
                {
                    "body": "That’s the same here in the US. If someone really wants to hook up there are plenty of ways for them to do it.\nIf someone is looking for a certain demographic though I think they would have trouble even in the clubs haha",
                    "author": "Late_Ad_6293",
                    "id": "ifkk5qb",
                    "parent_id": "t1_ifkg5o9",
                    "score": 1,
                    "created_utc": 1657437632.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Ah sorry just reread. I was responding to the notifications.\nMy apologies.",
            "author": "Late_Ad_6293",
            "id": "ifk3vq9",
            "parent_id": "t1_ifk34tl",
            "score": 2,
            "created_utc": 1657426291.0,
            "replies": []
        },
        {
            "body": "Yes, of course it's easier to date hot 22 yos on seeking. That doesn't change anything I said.",
            "author": "AShatteredKing",
            "id": "iflmezz",
            "parent_id": "t1_ifl4pf2",
            "score": 2,
            "created_utc": 1657463886.0,
            "replies": [
                {
                    "body": "Great. So you agree with me.",
                    "author": null,
                    "id": "iflmhyc",
                    "parent_id": "t1_iflmezz",
                    "score": 1,
                    "created_utc": 1657463922.0,
                    "replies": [
                        {
                            "body": "As I said, your point doesn't change anything I said.",
                            "author": "AShatteredKing",
                            "id": "ifm09eo",
                            "parent_id": "t1_iflmhyc",
                            "score": 1,
                            "created_utc": 1657469903.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I was young, dumb, and new. 🤷‍♂️ no excuses",
            "author": "Late_Ad_6293",
            "id": "ifjsowe",
            "parent_id": "t1_ifjsgcc",
            "score": 6,
            "created_utc": 1657420235.0,
            "replies": []
        },
        {
            "body": "Happens in the US, too.",
            "author": null,
            "id": "ifjsxnv",
            "parent_id": "t1_ifjslc4",
            "score": 1,
            "created_utc": 1657420360.0,
            "replies": []
        },
        {
            "body": "I didn’t call them bums.",
            "author": null,
            "id": "iflhcqp",
            "parent_id": "t1_iflf2nq",
            "score": 1,
            "created_utc": 1657461572.0,
            "replies": []
        },
        {
            "body": "First off did I say I was being forced into it?\n\nMy parents have given me the option to choose. I don’t want to as I am for arranged marriages. My brother chose his own wife as he didn’t believe in arranged.\nYou sir have no idea about how my family works and what I will employ to my own children.\n\nSounds like you’re projecting what happened to you.",
            "author": "Late_Ad_6293",
            "id": "ifk7u4l",
            "parent_id": "t1_ifk7d0w",
            "score": 4,
            "created_utc": 1657428685.0,
            "replies": [
                {
                    "body": "Gotta admit... I'm having trouble reconciling how you're simultaneously pro-arranged marriage and yet also attracted to sugar dating.",
                    "author": null,
                    "id": "ifk9w29",
                    "parent_id": "t1_ifk7u4l",
                    "score": 4,
                    "created_utc": 1657430013.0,
                    "replies": [
                        {
                            "body": "One can do anything and have fun before marriage and then once marriage happens you can settle down.\n\nThat’s how I think about it.",
                            "author": "Late_Ad_6293",
                            "id": "ifkb0on",
                            "parent_id": "t1_ifk9w29",
                            "score": 3,
                            "created_utc": 1657430780.0,
                            "replies": [
                                {
                                    "body": "It almost sounds like you're expecting the fun to stop when you're wed though.\n\nI dunno, coming from a family with lots of toxic and failed arranged marriages around me, I don't see the appeal that you're evidently finding in i. You do you if it makes you happy though",
                                    "author": null,
                                    "id": "ifkbblx",
                                    "parent_id": "t1_ifkb0on",
                                    "score": 2,
                                    "created_utc": 1657430992.0,
                                    "replies": [
                                        {
                                            "body": "I don’t expect to cheat on my wife if that’s what you’re suggesting?\n\nSorry to hear the marriages didn’t work in your family",
                                            "author": "Late_Ad_6293",
                                            "id": "ifkkjun",
                                            "parent_id": "t1_ifkbblx",
                                            "score": 1,
                                            "created_utc": 1657437946.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Hey I’ve seen it happen but just setting realistic expectations. That’s rare and often gets messy ;)",
            "author": "Late_Ad_6293",
            "id": "ifjs4gf",
            "parent_id": "t1_ifjs0pc",
            "score": 3,
            "created_utc": 1657419935.0,
            "replies": []
        },
        {
            "body": "That’s the same here in the US. If someone really wants to hook up there are plenty of ways for them to do it.\nIf someone is looking for a certain demographic though I think they would have trouble even in the clubs haha",
            "author": "Late_Ad_6293",
            "id": "ifkk5qb",
            "parent_id": "t1_ifkg5o9",
            "score": 1,
            "created_utc": 1657437632.0,
            "replies": []
        },
        {
            "body": "Great. So you agree with me.",
            "author": null,
            "id": "iflmhyc",
            "parent_id": "t1_iflmezz",
            "score": 1,
            "created_utc": 1657463922.0,
            "replies": [
                {
                    "body": "As I said, your point doesn't change anything I said.",
                    "author": "AShatteredKing",
                    "id": "ifm09eo",
                    "parent_id": "t1_iflmhyc",
                    "score": 1,
                    "created_utc": 1657469903.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Gotta admit... I'm having trouble reconciling how you're simultaneously pro-arranged marriage and yet also attracted to sugar dating.",
            "author": null,
            "id": "ifk9w29",
            "parent_id": "t1_ifk7u4l",
            "score": 4,
            "created_utc": 1657430013.0,
            "replies": [
                {
                    "body": "One can do anything and have fun before marriage and then once marriage happens you can settle down.\n\nThat’s how I think about it.",
                    "author": "Late_Ad_6293",
                    "id": "ifkb0on",
                    "parent_id": "t1_ifk9w29",
                    "score": 3,
                    "created_utc": 1657430780.0,
                    "replies": [
                        {
                            "body": "It almost sounds like you're expecting the fun to stop when you're wed though.\n\nI dunno, coming from a family with lots of toxic and failed arranged marriages around me, I don't see the appeal that you're evidently finding in i. You do you if it makes you happy though",
                            "author": null,
                            "id": "ifkbblx",
                            "parent_id": "t1_ifkb0on",
                            "score": 2,
                            "created_utc": 1657430992.0,
                            "replies": [
                                {
                                    "body": "I don’t expect to cheat on my wife if that’s what you’re suggesting?\n\nSorry to hear the marriages didn’t work in your family",
                                    "author": "Late_Ad_6293",
                                    "id": "ifkkjun",
                                    "parent_id": "t1_ifkbblx",
                                    "score": 1,
                                    "created_utc": 1657437946.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "As I said, your point doesn't change anything I said.",
            "author": "AShatteredKing",
            "id": "ifm09eo",
            "parent_id": "t1_iflmhyc",
            "score": 1,
            "created_utc": 1657469903.0,
            "replies": []
        },
        {
            "body": "One can do anything and have fun before marriage and then once marriage happens you can settle down.\n\nThat’s how I think about it.",
            "author": "Late_Ad_6293",
            "id": "ifkb0on",
            "parent_id": "t1_ifk9w29",
            "score": 3,
            "created_utc": 1657430780.0,
            "replies": [
                {
                    "body": "It almost sounds like you're expecting the fun to stop when you're wed though.\n\nI dunno, coming from a family with lots of toxic and failed arranged marriages around me, I don't see the appeal that you're evidently finding in i. You do you if it makes you happy though",
                    "author": null,
                    "id": "ifkbblx",
                    "parent_id": "t1_ifkb0on",
                    "score": 2,
                    "created_utc": 1657430992.0,
                    "replies": [
                        {
                            "body": "I don’t expect to cheat on my wife if that’s what you’re suggesting?\n\nSorry to hear the marriages didn’t work in your family",
                            "author": "Late_Ad_6293",
                            "id": "ifkkjun",
                            "parent_id": "t1_ifkbblx",
                            "score": 1,
                            "created_utc": 1657437946.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "It almost sounds like you're expecting the fun to stop when you're wed though.\n\nI dunno, coming from a family with lots of toxic and failed arranged marriages around me, I don't see the appeal that you're evidently finding in i. You do you if it makes you happy though",
            "author": null,
            "id": "ifkbblx",
            "parent_id": "t1_ifkb0on",
            "score": 2,
            "created_utc": 1657430992.0,
            "replies": [
                {
                    "body": "I don’t expect to cheat on my wife if that’s what you’re suggesting?\n\nSorry to hear the marriages didn’t work in your family",
                    "author": "Late_Ad_6293",
                    "id": "ifkkjun",
                    "parent_id": "t1_ifkbblx",
                    "score": 1,
                    "created_utc": 1657437946.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I don’t expect to cheat on my wife if that’s what you’re suggesting?\n\nSorry to hear the marriages didn’t work in your family",
            "author": "Late_Ad_6293",
            "id": "ifkkjun",
            "parent_id": "t1_ifkbblx",
            "score": 1,
            "created_utc": 1657437946.0,
            "replies": []
        }
    ]
}