{
    "title": "Might Guy =🐐",
    "post_id": "nhfi9q",
    "post_url": "https://www.reddit.com/r/dankruto/comments/nhfi9q/might_guy/",
    "author": "bertsky7",
    "body": "",
    "url": "https://i.redd.it/04av7lrp9d071.jpg",
    "score": 4323,
    "upvote_ratio": 0.99,
    "created_utc": 1621556240.0,
    "num_comments": 86,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "This may sound cruel but he should've died, there really isn't much point in having him be around in boruto other than cause he's a fun character to have around but it would do his character so much justice that he sacrifices himself",
            "author": "realraptorjesus101",
            "id": "gywu528",
            "parent_id": "t3_nhfi9q",
            "score": 354,
            "created_utc": 1621574080.0,
            "replies": [
                {
                    "body": "He should have died and somehow seriously crippled Madara. Instead Madara still had a fight with Sasuke and Naruto just to get backstabbed",
                    "author": "HughMungusD",
                    "id": "gywutih",
                    "parent_id": "t1_gywu528",
                    "score": 229,
                    "created_utc": 1621574588.0,
                    "replies": [
                        {
                            "body": "There is a lot wrong with the way the war ended. I think kishimoto wanted to do too much in a very short amount of time. Like I bet he knew he didn't want to end the series without 8 gates guy. But then he also didn't want to end it without six paths Naruto and Sasuke. So he sacrificed a potential kamikaze esc fight for guy because the only person left to fight was Madara. It's a shame really cause as much as I love his fight against Madara it just sort of feels like he's buying time and not a genuine battle",
                            "author": "realraptorjesus101",
                            "id": "gywv0t0",
                            "parent_id": "t1_gywutih",
                            "score": 141,
                            "created_utc": 1621574742.0,
                            "replies": [
                                {
                                    "body": "But after Madara was still Kaguya.\n\nThey could have Guy almost legitimately kill Madara, dying in the process - Black Zetsu uses the chance to pull his move on a weakened Madara and then Hagoromo gives his powers to Sasuke and Naruto because he feels his mother.\n\nLike there is a shitload that could have been changed",
                                    "author": "HughMungusD",
                                    "id": "gyx5udt",
                                    "parent_id": "t1_gywv0t0",
                                    "score": 126,
                                    "created_utc": 1621583940.0,
                                    "replies": [
                                        {
                                            "body": "That honestly would have been better.",
                                            "author": "ForsakenMoon13",
                                            "id": "gyy7xsk",
                                            "parent_id": "t1_gyx5udt",
                                            "score": 26,
                                            "created_utc": 1621609330.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "Or Guy kills Obito, then Madara is left for Konoha 11, same difference!",
                                            "author": "mbeezyfan",
                                            "id": "gyy7yu5",
                                            "parent_id": "t1_gyx5udt",
                                            "score": 13,
                                            "created_utc": 1621609343.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "damn man i’ll admit. this would’ve been the coldest moment of the series \n\nif guy died and all that happened just at once it would actually be a hopeless feel while watching the show",
                                            "author": "verifiedjay",
                                            "id": "gyyhzxi",
                                            "parent_id": "t1_gyx5udt",
                                            "score": 8,
                                            "created_utc": 1621613816.0,
                                            "replies": [
                                                {
                                                    "body": "Yeah and itd make sense! You wouldnt be like \"ugh what??? What a fuckin cop out\", rather like \"NOOO!!! EVEN WITH THAT FUCKING MASTERPEICE OUTPUT THEY STILL HAD ANOTHER PLAN???\".",
                                                    "author": "agarwaen163",
                                                    "id": "gyz9dyl",
                                                    "parent_id": "t1_gyyhzxi",
                                                    "score": 6,
                                                    "created_utc": 1621626233.0,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "body": "Sooooo much better",
                                            "author": "agarwaen163",
                                            "id": "gyz99fr",
                                            "parent_id": "t1_gyx5udt",
                                            "score": 4,
                                            "created_utc": 1621626172.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "Yesss bruh.",
                                            "author": "Intelligent-Win-4517",
                                            "id": "gyz9taq",
                                            "parent_id": "t1_gyx5udt",
                                            "score": 2,
                                            "created_utc": 1621626435.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "He should have had Eight Gates Guy finish off Obito, then Madara reveal and plenty of spotlight left for the Protagonist to kill Madara then. It's what I always thought should have happened",
                                    "author": "mbeezyfan",
                                    "id": "gyy7wpd",
                                    "parent_id": "t1_gywv0t0",
                                    "score": 7,
                                    "created_utc": 1621609316.0,
                                    "replies": []
                                },
                                {
                                    "body": "> There is a lot wrong with the way the war ended. I think kishimoto wanted to do too much in a very short amount of time.\n\nSums up a lot with this series actually.",
                                    "author": "DisneyPrincessDVorah",
                                    "id": "gyyehh0",
                                    "parent_id": "t1_gywv0t0",
                                    "score": 5,
                                    "created_utc": 1621612236.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "this",
                            "author": "Radonda",
                            "id": "gyxg2g6",
                            "parent_id": "t1_gywutih",
                            "score": 7,
                            "created_utc": 1621593398.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Yup, I actually agree. Other than that, I wished neji was still alive. He could have grown stronger and probably would be closer to kage level",
                    "author": "Kryllllllyx",
                    "id": "gywz0k5",
                    "parent_id": "t1_gywu528",
                    "score": 42,
                    "created_utc": 1621577942.0,
                    "replies": [
                        {
                            "body": "Neji should have been the Team 7 jonin in boruto! Konohamaru does not deserve it.",
                            "author": "RedBeard695",
                            "id": "gyxoaqc",
                            "parent_id": "t1_gywz0k5",
                            "score": 9,
                            "created_utc": 1621599374.0,
                            "replies": [
                                {
                                    "body": "I don’t really agree that Konohamaru doesn’t deserve it, but I was saying this exact thing to a friend the other day. The dynamic between the stoic Neji leading Team 7 and his rebellious nephew Boruto could’ve been really interesting, but instead one of my favorite characters died a pointless death which basically confirmed that his philosophy in the first Chunin exams was not only not flawed, but correct.",
                                    "author": "peggygotnofear",
                                    "id": "gyxrni7",
                                    "parent_id": "t1_gyxoaqc",
                                    "score": 20,
                                    "created_utc": 1621601344.0,
                                    "replies": [
                                        {
                                            "body": "He literally gave his life to save main family hinata. He was gonna be the head of hyuga, but in the end destiny prevailed.\n\nIt’s almost like the chunin exam fight was retconned.",
                                            "author": "RedBeard695",
                                            "id": "gyxs01m",
                                            "parent_id": "t1_gyxrni7",
                                            "score": 10,
                                            "created_utc": 1621601534.0,
                                            "replies": [
                                                {
                                                    "body": "So, ever since this manga came out people were saying that Naruto was the son of the 4th, it was just a given and no one thought otherwise except aa potential M. Night Shamalamadingdong \"what a twist\" moment. \n\nSo I always saw the Naruto v Neji fight as bullshit. Even before the \"child of prophecy\" stuff came up. \n\nNot only is Naruto a genius, he's a genius of hard work too. He just didn't get stuff easy, which destiny still prevailed and he became strong enough to save the world. \n\nNaruto's win was fate, within the world and not just some \"it's a manga\" meta excuse. Neji just didn't know who he was up against.",
                                                    "author": "DisneyPrincessDVorah",
                                                    "id": "gyygqbc",
                                                    "parent_id": "t1_gyxs01m",
                                                    "score": 9,
                                                    "created_utc": 1621613242.0,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "body": "Well Neji’s ideas were flawed because they came from the false idea that his father was sacrificed forcefully when he chose to die in place of his brother. You can bring up how it’s still the branch house serving the main house but in this situation, clan standing/politics stops being a factor when the situation they faced was full on war between the Leaf and Cloud. Hiashi killed the cloud ninja and so he needed to be killed off to prevent a war, he never wanted his brother to die for his (albeit justified) action. \n\nBut yeah war arc is a mess",
                                            "author": "Sealking13",
                                            "id": "gz0vxyc",
                                            "parent_id": "t1_gyxrni7",
                                            "score": 1,
                                            "created_utc": 1621657820.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "as much as i want to downvote this, you’re right lol",
                                    "author": "verifiedjay",
                                    "id": "gyyi49x",
                                    "parent_id": "t1_gyxoaqc",
                                    "score": 5,
                                    "created_utc": 1621613872.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "Hi at as dad could’ve died and Neji could’ve taken over for poetic justice\nBut that grandpa scene was cute in both to I guess",
                            "author": "Lonesome_Ninja",
                            "id": "gyy0wkp",
                            "parent_id": "t1_gywz0k5",
                            "score": 1,
                            "created_utc": 1621606124.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "I think they kept him alive for Kakashi. It would of been too much for him to lose Guy as well.",
                    "author": "LinkLegend21",
                    "id": "gyxbsll",
                    "parent_id": "t1_gywu528",
                    "score": 17,
                    "created_utc": 1621589471.0,
                    "replies": []
                },
                {
                    "body": "they fought an army of resurrected Master ninjas, one could literally call down world ending meteors and only like a couple characters died, the rest were all generic ninja #1 that didn't matter",
                    "author": "zzuezz",
                    "id": "gyxnddl",
                    "parent_id": "t1_gywu528",
                    "score": 7,
                    "created_utc": 1621598785.0,
                    "replies": []
                },
                {
                    "body": "None of the adults or past adults do anything in Boruto, especially in the manga.   \n\n\nYou could've killed all the old generation in Naruto's war arc and it wouldn't have changed anything in Boruto except maybe Kakashi and Team 7's arc.",
                    "author": "Jordaxio",
                    "id": "gyxg61g",
                    "parent_id": "t1_gywu528",
                    "score": 11,
                    "created_utc": 1621593483.0,
                    "replies": []
                },
                {
                    "body": "A good death is its own reward as they say. That would have been a great death though, but instead they cheesed it and killed off Neji instead who they got rid of with a terrible death.",
                    "author": "SmallerBork",
                    "id": "gyx0lsv",
                    "parent_id": "t1_gywu528",
                    "score": 17,
                    "created_utc": 1621579275.0,
                    "replies": [
                        {
                            "body": "They could have killed Kiba...",
                            "author": "Window2Anime",
                            "id": "gyxe2ko",
                            "parent_id": "t1_gyx0lsv",
                            "score": 11,
                            "created_utc": 1621591615.0,
                            "replies": [
                                {
                                    "body": "No, need him around for the fanfics...",
                                    "author": "ForsakenMoon13",
                                    "id": "gyy83ly",
                                    "parent_id": "t1_gyxe2ko",
                                    "score": 4,
                                    "created_utc": 1621609402.0,
                                    "replies": [
                                        {
                                            "body": "People will still have fanFCC ics even if he died.",
                                            "author": "Window2Anime",
                                            "id": "gyye62z",
                                            "parent_id": "t1_gyy83ly",
                                            "score": 3,
                                            "created_utc": 1621612096.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": ">\tother than cause he's a fun character to have around\n\nWhy is this not reason enough?",
                    "author": "SendMeRobotFeetPics",
                    "id": "gyxpw6h",
                    "parent_id": "t1_gywu528",
                    "score": 4,
                    "created_utc": 1621600334.0,
                    "replies": []
                },
                {
                    "body": "While I agree he should of died I'm glad he lived on for Kakashi's sake. Kakashi had already lost so much throughout his life losing his best bro too would suck mega hard. It warms the cold cochles of my heart that him and Kakashi can still bro out. Him loving was definitely an asspull but it's alright in my book.",
                    "author": "arretez1512",
                    "id": "gyxur8u",
                    "parent_id": "t1_gywu528",
                    "score": 4,
                    "created_utc": 1621603031.0,
                    "replies": []
                },
                {
                    "body": "Counter argument: He could live, but instead of making him crippled in both legs, he would need Hashirama implants in both legs, and wouldn’t be able to go past the fifth gate without risking destroying the implants.",
                    "author": "General_Synnacle",
                    "id": "gyx1cdw",
                    "parent_id": "t1_gywu528",
                    "score": 10,
                    "created_utc": 1621579902.0,
                    "replies": []
                },
                {
                    "body": "after the 'peak of youth is in autumn' speech I really started respecting him and way he was going to die and it would've been much more sensible too after all the flashbacks and stuff but guess it was just interpreted as this cheap stalling act",
                    "author": "Aiden42Fatal",
                    "id": "gyx1zyu",
                    "parent_id": "t1_gywu528",
                    "score": 8,
                    "created_utc": 1621580468.0,
                    "replies": []
                },
                {
                    "body": "“This may sound cruel”\n\n\n>Proceeds to state opinion that’s shared on this sub 10 times a day",
                    "author": "Pac_Zach_Attack",
                    "id": "gyx2fzp",
                    "parent_id": "t1_gywu528",
                    "score": 13,
                    "created_utc": 1621580859.0,
                    "replies": []
                },
                {
                    "body": "Thats sounds like a good idea, but then poor kakashi sensei would have no one left. It would be too cruel of the writers to kill kakashi's one last friend as well. I am glad they kept him alive.",
                    "author": "VermicelliQueasy2221",
                    "id": "iziouew",
                    "parent_id": "t1_gywu528",
                    "score": 1,
                    "created_utc": 1670586899.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I don't know anyone who dislikes Might Guy. I mean the very first episode we see him, he establishes himself as the real deal even if he is goofy af.",
            "author": "sonfoa",
            "id": "gyw5kj6",
            "parent_id": "t3_nhfi9q",
            "score": 125,
            "created_utc": 1621559629.0,
            "replies": [
                {
                    "body": "I loved that Naruto said \"Sorry for not noticing his greatness, I was too busy watching him crawl out from under a turtle\". Guy doesn't refute and Rock doesn't have a witty comeback for it.",
                    "author": "SmallerBork",
                    "id": "gyx0rsz",
                    "parent_id": "t1_gyw5kj6",
                    "score": 47,
                    "created_utc": 1621579418.0,
                    "replies": []
                },
                {
                    "body": "I mean no disrespect towards people who do, but Orly don't think hes funny. Imo he's more annoying if anything, same with Lee, although his fight with Gaara made me like him. I guess it's just not my humor. If I watched more anime maybe I'd find it less weird 乁( •_• )ㄏ\n\nI mean i knew it was coming but its still funny, how i get downvoted bcs i gave my opinion. Respectfully may I add. Welcome to Reddit.",
                    "author": "HisOnlyFriend",
                    "id": "gyx9lav",
                    "parent_id": "t1_gyw5kj6",
                    "score": -11,
                    "created_utc": 1621587336.0,
                    "replies": [
                        {
                            "body": "Nah he's a ridiculous wierdo but in a sense that's kind of his charm. Like, great dude, but in small bursts.\n\nVery small.\n\nFrom a distance.\n\nWhen he's going super beast mode on your enemies and you can cheer him on.",
                            "author": "ForsakenMoon13",
                            "id": "gyy8ebf",
                            "parent_id": "t1_gyx9lav",
                            "score": 4,
                            "created_utc": 1621609536.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I still hate the fact that Guy's glory was taken away by some dumb godlike Naruto powers. Imagine how amazing Guy's legacy would have actually been if he did die a warrior fighting Madara, after he declares Guy as the best ninja in Taijutsu, and the one who first made him feel excited ever since his fight with Hashirama.\n\nI would rather die giving everything I got and nearly killing the most overpowered enemy at the time, than live my remaining life on a fucking wheelchair",
            "author": "dardardarner",
            "id": "gywp2m1",
            "parent_id": "t3_nhfi9q",
            "score": 77,
            "created_utc": 1621570555.0,
            "replies": [
                {
                    "body": "Still gotta deal with Kaguya tho.",
                    "author": "Intelligent-Win-4517",
                    "id": "gyzaqd8",
                    "parent_id": "t1_gywp2m1",
                    "score": 2,
                    "created_utc": 1621626874.0,
                    "replies": [
                        {
                            "body": "Kaguya onwards and Boruto does not exist for me",
                            "author": "dardardarner",
                            "id": "gyzfml6",
                            "parent_id": "t1_gyzaqd8",
                            "score": 8,
                            "created_utc": 1621629227.0,
                            "replies": [
                                {
                                    "body": "Eh, Boruto is meh for me, but I could definitely understand Kaguya. Most interesting thing that came from her character is her damn kids, the Otsutsuki clan lore, creaton of Chakra, and the creation of the Tailed-Beasts.",
                                    "author": "Intelligent-Win-4517",
                                    "id": "gyzgs5g",
                                    "parent_id": "t1_gyzfml6",
                                    "score": 1,
                                    "created_utc": 1621629792.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "You kidding me? Guy-sensei establishes himself as the coolest character in the entire series from his first appearance imo.",
            "author": "MrManOfficial",
            "id": "gywglxo",
            "parent_id": "t3_nhfi9q",
            "score": 59,
            "created_utc": 1621565532.0,
            "replies": [
                {
                    "body": "From the moment guy slaps away Gaara's sand away when he was trying to kill Rock Lee we knew he insanely strong. If only Guy was present when Pain attacked.",
                    "author": "KyuubiBryant",
                    "id": "gyx73kz",
                    "parent_id": "t1_gywglxo",
                    "score": 32,
                    "created_utc": 1621584952.0,
                    "replies": [
                        {
                            "body": "I think someone said that Guy specifically had to been away from the village during Pain’s attack otherwise the eight gates would’ve been used for Pain but it would’ve been like using the one nuke when you still had a ton of baddies still left",
                            "author": "FelneusLeviathan",
                            "id": "gyzgewk",
                            "parent_id": "t1_gyx73kz",
                            "score": 4,
                            "created_utc": 1621629611.0,
                            "replies": [
                                {
                                    "body": "I don't think guy would be able to use Hirodora or the Night guy within the leaf Village due to the destruction it would've caused. Given that Konohamaru took out one of the Pains I reckon both Guy and Lee using the 6th gate alongside Kakashi would've been sufficient against all 6 Pain.",
                                    "author": "KyuubiBryant",
                                    "id": "gyzns47",
                                    "parent_id": "t1_gyzgewk",
                                    "score": 5,
                                    "created_utc": 1621633156.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I always liked Guy since him and Jiraiya are legitimately the only people most villains and the akatsuki didn't dare box unless they had to. Guy and Kakashi are supposedly equal rivals but I don't see Itachi being scared of Kakashi",
            "author": "Jordaxio",
            "id": "gyxfwqy",
            "parent_id": "t3_nhfi9q",
            "score": 16,
            "created_utc": 1621593265.0,
            "replies": [
                {
                    "body": "8 Gates Guy curb stomps Kakashi (one ms)",
                    "author": "Herbb__",
                    "id": "gyzbm3j",
                    "parent_id": "t1_gyxfwqy",
                    "score": 5,
                    "created_utc": 1621627290.0,
                    "replies": [
                        {
                            "body": "Well duh but if you gave Kakashi double MS he'd be more equal to 8 Gates",
                            "author": "Jordaxio",
                            "id": "gyze4vd",
                            "parent_id": "t1_gyzbm3j",
                            "score": 5,
                            "created_utc": 1621628507.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "That path we walk, as we're told \"Don't ever fuck with this man,\" and everyone is pointing at the weirdo with the bowl cut and green spandex talking about his youth - and slowly discovering that yes, you *never ever fuck with Guy* or you will regret it...",
            "author": "designerjeremiah",
            "id": "gyw8wj5",
            "parent_id": "t3_nhfi9q",
            "score": 21,
            "created_utc": 1621561385.0,
            "replies": []
        },
        {
            "body": "Wtf who doesn't love him immediately after meeting seeing him for the first time?",
            "author": "Elad2007",
            "id": "gywyj4d",
            "parent_id": "t3_nhfi9q",
            "score": 10,
            "created_utc": 1621577540.0,
            "replies": []
        },
        {
            "body": "never thought a man with a bowl cut would intimidate me and make me love him as much as might goat.",
            "author": null,
            "id": "gyx11np",
            "parent_id": "t3_nhfi9q",
            "score": 10,
            "created_utc": 1621579648.0,
            "replies": []
        },
        {
            "body": "I wished he somehow crippled Madara or at least permanently damaged him after that glorious Night Guy",
            "author": "NoodleRocket",
            "id": "gyx3a3n",
            "parent_id": "t3_nhfi9q",
            "score": 9,
            "created_utc": 1621581619.0,
            "replies": []
        },
        {
            "body": "Youth is an explosion therefore is art",
            "author": "Sealking13",
            "id": "gywc10x",
            "parent_id": "t3_nhfi9q",
            "score": 26,
            "created_utc": 1621563038.0,
            "replies": [
                {
                    "body": "Might Guy, my man!",
                    "author": "Executive_Meme",
                    "id": "gyxm1hu",
                    "parent_id": "t1_gywc10x",
                    "score": 13,
                    "created_utc": 1621597932.0,
                    "replies": [
                        {
                            "body": "*Hmph!*",
                            "author": "Intelligent-Win-4517",
                            "id": "gyzaxg4",
                            "parent_id": "t1_gyxm1hu",
                            "score": 4,
                            "created_utc": 1621626968.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "How can someone have just 3 episodes for character development and still be in everyone's top 5 .🐐",
            "author": "hariharan7_",
            "id": "gyxbcur",
            "parent_id": "t3_nhfi9q",
            "score": 7,
            "created_utc": 1621589048.0,
            "replies": []
        },
        {
            "body": "Legends state they make the area where he fought into a living room so he could survive the 8 gates.",
            "author": "Anaverageshitposter6",
            "id": "gywfia2",
            "parent_id": "t3_nhfi9q",
            "score": 10,
            "created_utc": 1621564936.0,
            "replies": []
        },
        {
            "body": "Legend says he changed his name to.might goat",
            "author": null,
            "id": "gyxf375",
            "parent_id": "t3_nhfi9q",
            "score": 5,
            "created_utc": 1621592546.0,
            "replies": []
        },
        {
            "body": "Its cause both guy and iruka sensei are the teachers that put in the extra effort in care and it makes us all nostalgic of someone or guy and iruka are that someone even if they aint real",
            "author": "alekchen1234",
            "id": "gywmjih",
            "parent_id": "t3_nhfi9q",
            "score": 8,
            "created_utc": 1621568958.0,
            "replies": []
        },
        {
            "body": "I haven’t gotten to that point in the series yet(I’ve just finished the arc with Kakuzu and Hidan) but I’ve never really disliked Guy. I’ve always thought he was funny.\n\nThe only time I’ve ever been really disappointed by Guy and his team are during the Sasori arc when they spent like 15 episodes just fighting their duplicates.",
            "author": "Beercorn1",
            "id": "gyx1oe3",
            "parent_id": "t3_nhfi9q",
            "score": 3,
            "created_utc": 1621580190.0,
            "replies": [
                {
                    "body": "Filler had to be filled somehow",
                    "author": "FelneusLeviathan",
                    "id": "gyzgxq6",
                    "parent_id": "t1_gyx1oe3",
                    "score": 2,
                    "created_utc": 1621629869.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "he was probably this strong at the start of shippuden. At this time he already mastered the gates. pretty awesome",
            "author": "Stan0t",
            "id": "gyx2s01",
            "parent_id": "t3_nhfi9q",
            "score": 4,
            "created_utc": 1621581158.0,
            "replies": []
        },
        {
            "body": "*this man is kinda annoying. I like him.\n\nFtfy",
            "author": "CombatWombat994",
            "id": "gyx6c2j",
            "parent_id": "t3_nhfi9q",
            "score": 3,
            "created_utc": 1621584376.0,
            "replies": []
        },
        {
            "body": "Guy won me over when he started hitting mfs with “DYNAMIC ENTRY!” 😂🤣😭\n\nOn a serious note though, I don’t need to remind y’all how goated Gaara vs Lee was. After Lee ran that fade on Sasuke, and Gaara was well....Gaara, we knew neither of them were to be played with. But Guy jumps in cool AF and just smacks Gaara’s attack away like it’s nothing.",
            "author": "HanataSanchou",
            "id": "gyxnqh3",
            "parent_id": "t3_nhfi9q",
            "score": 4,
            "created_utc": 1621599016.0,
            "replies": []
        },
        {
            "body": "He was never annoying what is this shit",
            "author": null,
            "id": "gyyjd90",
            "parent_id": "t3_nhfi9q",
            "score": 5,
            "created_utc": 1621614431.0,
            "replies": []
        },
        {
            "body": "Is it weird that I like the side characters more than the main",
            "author": "RipFinCHat",
            "id": "gyz7q70",
            "parent_id": "t3_nhfi9q",
            "score": 5,
            "created_utc": 1621625452.0,
            "replies": [
                {
                    "body": "Nah, alot of people share this sentiment with alot of media.",
                    "author": "Intelligent-Win-4517",
                    "id": "gyzb4ss",
                    "parent_id": "t1_gyz7q70",
                    "score": 1,
                    "created_utc": 1621627065.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Might Guy had the wildest introduction on the show. I legit though he was molesting Lee.",
            "author": "Summerclaw",
            "id": "gywvysx",
            "parent_id": "t3_nhfi9q",
            "score": 7,
            "created_utc": 1621575471.0,
            "replies": [
                {
                    "body": "The end of Shippuden though\n\nhttps://youtu.be/jQHEHB0agcU?t=237\n\nThe animators really drew that, it's even weirder if you go frame by frame.\n\nEven Tenten has to double back, I imagine she's thinking what in the name of the sage of six paths did I just witness.",
                    "author": "SmallerBork",
                    "id": "gyx18le",
                    "parent_id": "t1_gywvysx",
                    "score": 6,
                    "created_utc": 1621579813.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "\"I'm Might Guy!\"\n\"Mighty stupid looking guy\"\nGets me every time 🤣",
            "author": "Vulgaris25",
            "id": "gyxg5et",
            "parent_id": "t3_nhfi9q",
            "score": 3,
            "created_utc": 1621593470.0,
            "replies": []
        },
        {
            "body": "This guy, Rock Lee as well, is such an inspiration to me bro, his childhood being treated like a loser almost looks like my life right now but just like he became a ninja and Rock Lee became the most splendid ninja he could, it's my goal to be a martial artist, I swear everytime he screams \"THE POWER OF YOUTH!!\" it rings me to tears, I'm getting emotional just writing this",
            "author": "uglynerdishere",
            "id": "gyzbaos",
            "parent_id": "t3_nhfi9q",
            "score": 3,
            "created_utc": 1621627142.0,
            "replies": []
        },
        {
            "body": "Guy got robbed, I really hate remembering how amazing that scene is, and then looking at \"Might Wheelchair\"",
            "author": "Haelstrom101",
            "id": "gyx2cn2",
            "parent_id": "t3_nhfi9q",
            "score": 4,
            "created_utc": 1621580775.0,
            "replies": [
                {
                    "body": "Bruh he can still fight even in the wheelchair",
                    "author": "uglynerdishere",
                    "id": "gyzbh1r",
                    "parent_id": "t1_gyx2cn2",
                    "score": 1,
                    "created_utc": 1621627224.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "this = correct",
            "author": "birdgamer66",
            "id": "gyw6xkd",
            "parent_id": "t3_nhfi9q",
            "score": 3,
            "created_utc": 1621560334.0,
            "replies": []
        },
        {
            "body": "Exactly mee he was soo annoying at first",
            "author": "cianmontanarini",
            "id": "gyxjktw",
            "parent_id": "t3_nhfi9q",
            "score": 1,
            "created_utc": 1621596196.0,
            "replies": []
        },
        {
            "body": "Legend says he changed his name to.might goat",
            "author": null,
            "id": "gyxf376",
            "parent_id": "t3_nhfi9q",
            "score": 0,
            "created_utc": 1621592546.0,
            "replies": []
        },
        {
            "body": "nah , guy is still an annoying idiot for me .",
            "author": "AndreiCezar",
            "id": "gyz58m4",
            "parent_id": "t3_nhfi9q",
            "score": -3,
            "created_utc": 1621624286.0,
            "replies": []
        },
        {
            "body": "I am about to rewatch that episode. It’s crazy that this popped up in the few minutes I am on Reddit",
            "author": "CW10ALLSTAR",
            "id": "gyxk11g",
            "parent_id": "t3_nhfi9q",
            "score": 1,
            "created_utc": 1621596526.0,
            "replies": []
        },
        {
            "body": " non american parts if the world think of being the goat a bad thing, I can see this being misunderstood easily.",
            "author": "M_Bros789",
            "id": "gyxl3cs",
            "parent_id": "t3_nhfi9q",
            "score": 1,
            "created_utc": 1621597290.0,
            "replies": []
        },
        {
            "body": "Guy is by far my favorite character in the series",
            "author": "ogbobbyj33",
            "id": "gyy3s3r",
            "parent_id": "t3_nhfi9q",
            "score": 1,
            "created_utc": 1621607457.0,
            "replies": []
        },
        {
            "body": "Might Guy is the GOAT of the entire series, change my mind.\n\nI can't tell you how much Might Guy helped me through college, and I'm not joking.",
            "author": "TuukkaRaskisBack",
            "id": "gyyzs9a",
            "parent_id": "t3_nhfi9q",
            "score": 1,
            "created_utc": 1621621770.0,
            "replies": [
                {
                    "body": "Bruh I already commented this but Rock Lee and Might Guy are really inspiring to me, just like Lee wants to be a splendid ninja I want to be a martial artist. May the power of yuth guide us all!! He really is the GOAT",
                    "author": "uglynerdishere",
                    "id": "gyzbp4y",
                    "parent_id": "t1_gyyzs9a",
                    "score": 2,
                    "created_utc": 1621627331.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "GREAT LESSON GUY SENSEI.",
            "author": "Munsoon22",
            "id": "gyz3h64",
            "parent_id": "t3_nhfi9q",
            "score": 1,
            "created_utc": 1621623464.0,
            "replies": []
        },
        {
            "body": "Might Guy is OP.",
            "author": "Over_Room_1889",
            "id": "gyzahgt",
            "parent_id": "t3_nhfi9q",
            "score": 1,
            "created_utc": 1621626755.0,
            "replies": [
                {
                    "body": "Might Guy IS P",
                    "author": "3727rhfh",
                    "id": "gyzlhgx",
                    "parent_id": "t1_gyzahgt",
                    "score": 1,
                    "created_utc": 1621632068.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "He should have died and somehow seriously crippled Madara. Instead Madara still had a fight with Sasuke and Naruto just to get backstabbed",
            "author": "HughMungusD",
            "id": "gywutih",
            "parent_id": "t1_gywu528",
            "score": 229,
            "created_utc": 1621574588.0,
            "replies": [
                {
                    "body": "There is a lot wrong with the way the war ended. I think kishimoto wanted to do too much in a very short amount of time. Like I bet he knew he didn't want to end the series without 8 gates guy. But then he also didn't want to end it without six paths Naruto and Sasuke. So he sacrificed a potential kamikaze esc fight for guy because the only person left to fight was Madara. It's a shame really cause as much as I love his fight against Madara it just sort of feels like he's buying time and not a genuine battle",
                    "author": "realraptorjesus101",
                    "id": "gywv0t0",
                    "parent_id": "t1_gywutih",
                    "score": 141,
                    "created_utc": 1621574742.0,
                    "replies": [
                        {
                            "body": "But after Madara was still Kaguya.\n\nThey could have Guy almost legitimately kill Madara, dying in the process - Black Zetsu uses the chance to pull his move on a weakened Madara and then Hagoromo gives his powers to Sasuke and Naruto because he feels his mother.\n\nLike there is a shitload that could have been changed",
                            "author": "HughMungusD",
                            "id": "gyx5udt",
                            "parent_id": "t1_gywv0t0",
                            "score": 126,
                            "created_utc": 1621583940.0,
                            "replies": [
                                {
                                    "body": "That honestly would have been better.",
                                    "author": "ForsakenMoon13",
                                    "id": "gyy7xsk",
                                    "parent_id": "t1_gyx5udt",
                                    "score": 26,
                                    "created_utc": 1621609330.0,
                                    "replies": []
                                },
                                {
                                    "body": "Or Guy kills Obito, then Madara is left for Konoha 11, same difference!",
                                    "author": "mbeezyfan",
                                    "id": "gyy7yu5",
                                    "parent_id": "t1_gyx5udt",
                                    "score": 13,
                                    "created_utc": 1621609343.0,
                                    "replies": []
                                },
                                {
                                    "body": "damn man i’ll admit. this would’ve been the coldest moment of the series \n\nif guy died and all that happened just at once it would actually be a hopeless feel while watching the show",
                                    "author": "verifiedjay",
                                    "id": "gyyhzxi",
                                    "parent_id": "t1_gyx5udt",
                                    "score": 8,
                                    "created_utc": 1621613816.0,
                                    "replies": [
                                        {
                                            "body": "Yeah and itd make sense! You wouldnt be like \"ugh what??? What a fuckin cop out\", rather like \"NOOO!!! EVEN WITH THAT FUCKING MASTERPEICE OUTPUT THEY STILL HAD ANOTHER PLAN???\".",
                                            "author": "agarwaen163",
                                            "id": "gyz9dyl",
                                            "parent_id": "t1_gyyhzxi",
                                            "score": 6,
                                            "created_utc": 1621626233.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "Sooooo much better",
                                    "author": "agarwaen163",
                                    "id": "gyz99fr",
                                    "parent_id": "t1_gyx5udt",
                                    "score": 4,
                                    "created_utc": 1621626172.0,
                                    "replies": []
                                },
                                {
                                    "body": "Yesss bruh.",
                                    "author": "Intelligent-Win-4517",
                                    "id": "gyz9taq",
                                    "parent_id": "t1_gyx5udt",
                                    "score": 2,
                                    "created_utc": 1621626435.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "He should have had Eight Gates Guy finish off Obito, then Madara reveal and plenty of spotlight left for the Protagonist to kill Madara then. It's what I always thought should have happened",
                            "author": "mbeezyfan",
                            "id": "gyy7wpd",
                            "parent_id": "t1_gywv0t0",
                            "score": 7,
                            "created_utc": 1621609316.0,
                            "replies": []
                        },
                        {
                            "body": "> There is a lot wrong with the way the war ended. I think kishimoto wanted to do too much in a very short amount of time.\n\nSums up a lot with this series actually.",
                            "author": "DisneyPrincessDVorah",
                            "id": "gyyehh0",
                            "parent_id": "t1_gywv0t0",
                            "score": 5,
                            "created_utc": 1621612236.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "this",
                    "author": "Radonda",
                    "id": "gyxg2g6",
                    "parent_id": "t1_gywutih",
                    "score": 7,
                    "created_utc": 1621593398.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Yup, I actually agree. Other than that, I wished neji was still alive. He could have grown stronger and probably would be closer to kage level",
            "author": "Kryllllllyx",
            "id": "gywz0k5",
            "parent_id": "t1_gywu528",
            "score": 42,
            "created_utc": 1621577942.0,
            "replies": [
                {
                    "body": "Neji should have been the Team 7 jonin in boruto! Konohamaru does not deserve it.",
                    "author": "RedBeard695",
                    "id": "gyxoaqc",
                    "parent_id": "t1_gywz0k5",
                    "score": 9,
                    "created_utc": 1621599374.0,
                    "replies": [
                        {
                            "body": "I don’t really agree that Konohamaru doesn’t deserve it, but I was saying this exact thing to a friend the other day. The dynamic between the stoic Neji leading Team 7 and his rebellious nephew Boruto could’ve been really interesting, but instead one of my favorite characters died a pointless death which basically confirmed that his philosophy in the first Chunin exams was not only not flawed, but correct.",
                            "author": "peggygotnofear",
                            "id": "gyxrni7",
                            "parent_id": "t1_gyxoaqc",
                            "score": 20,
                            "created_utc": 1621601344.0,
                            "replies": [
                                {
                                    "body": "He literally gave his life to save main family hinata. He was gonna be the head of hyuga, but in the end destiny prevailed.\n\nIt’s almost like the chunin exam fight was retconned.",
                                    "author": "RedBeard695",
                                    "id": "gyxs01m",
                                    "parent_id": "t1_gyxrni7",
                                    "score": 10,
                                    "created_utc": 1621601534.0,
                                    "replies": [
                                        {
                                            "body": "So, ever since this manga came out people were saying that Naruto was the son of the 4th, it was just a given and no one thought otherwise except aa potential M. Night Shamalamadingdong \"what a twist\" moment. \n\nSo I always saw the Naruto v Neji fight as bullshit. Even before the \"child of prophecy\" stuff came up. \n\nNot only is Naruto a genius, he's a genius of hard work too. He just didn't get stuff easy, which destiny still prevailed and he became strong enough to save the world. \n\nNaruto's win was fate, within the world and not just some \"it's a manga\" meta excuse. Neji just didn't know who he was up against.",
                                            "author": "DisneyPrincessDVorah",
                                            "id": "gyygqbc",
                                            "parent_id": "t1_gyxs01m",
                                            "score": 9,
                                            "created_utc": 1621613242.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "Well Neji’s ideas were flawed because they came from the false idea that his father was sacrificed forcefully when he chose to die in place of his brother. You can bring up how it’s still the branch house serving the main house but in this situation, clan standing/politics stops being a factor when the situation they faced was full on war between the Leaf and Cloud. Hiashi killed the cloud ninja and so he needed to be killed off to prevent a war, he never wanted his brother to die for his (albeit justified) action. \n\nBut yeah war arc is a mess",
                                    "author": "Sealking13",
                                    "id": "gz0vxyc",
                                    "parent_id": "t1_gyxrni7",
                                    "score": 1,
                                    "created_utc": 1621657820.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "as much as i want to downvote this, you’re right lol",
                            "author": "verifiedjay",
                            "id": "gyyi49x",
                            "parent_id": "t1_gyxoaqc",
                            "score": 5,
                            "created_utc": 1621613872.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Hi at as dad could’ve died and Neji could’ve taken over for poetic justice\nBut that grandpa scene was cute in both to I guess",
                    "author": "Lonesome_Ninja",
                    "id": "gyy0wkp",
                    "parent_id": "t1_gywz0k5",
                    "score": 1,
                    "created_utc": 1621606124.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I think they kept him alive for Kakashi. It would of been too much for him to lose Guy as well.",
            "author": "LinkLegend21",
            "id": "gyxbsll",
            "parent_id": "t1_gywu528",
            "score": 17,
            "created_utc": 1621589471.0,
            "replies": []
        },
        {
            "body": "they fought an army of resurrected Master ninjas, one could literally call down world ending meteors and only like a couple characters died, the rest were all generic ninja #1 that didn't matter",
            "author": "zzuezz",
            "id": "gyxnddl",
            "parent_id": "t1_gywu528",
            "score": 7,
            "created_utc": 1621598785.0,
            "replies": []
        },
        {
            "body": "None of the adults or past adults do anything in Boruto, especially in the manga.   \n\n\nYou could've killed all the old generation in Naruto's war arc and it wouldn't have changed anything in Boruto except maybe Kakashi and Team 7's arc.",
            "author": "Jordaxio",
            "id": "gyxg61g",
            "parent_id": "t1_gywu528",
            "score": 11,
            "created_utc": 1621593483.0,
            "replies": []
        },
        {
            "body": "A good death is its own reward as they say. That would have been a great death though, but instead they cheesed it and killed off Neji instead who they got rid of with a terrible death.",
            "author": "SmallerBork",
            "id": "gyx0lsv",
            "parent_id": "t1_gywu528",
            "score": 17,
            "created_utc": 1621579275.0,
            "replies": [
                {
                    "body": "They could have killed Kiba...",
                    "author": "Window2Anime",
                    "id": "gyxe2ko",
                    "parent_id": "t1_gyx0lsv",
                    "score": 11,
                    "created_utc": 1621591615.0,
                    "replies": [
                        {
                            "body": "No, need him around for the fanfics...",
                            "author": "ForsakenMoon13",
                            "id": "gyy83ly",
                            "parent_id": "t1_gyxe2ko",
                            "score": 4,
                            "created_utc": 1621609402.0,
                            "replies": [
                                {
                                    "body": "People will still have fanFCC ics even if he died.",
                                    "author": "Window2Anime",
                                    "id": "gyye62z",
                                    "parent_id": "t1_gyy83ly",
                                    "score": 3,
                                    "created_utc": 1621612096.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": ">\tother than cause he's a fun character to have around\n\nWhy is this not reason enough?",
            "author": "SendMeRobotFeetPics",
            "id": "gyxpw6h",
            "parent_id": "t1_gywu528",
            "score": 4,
            "created_utc": 1621600334.0,
            "replies": []
        },
        {
            "body": "While I agree he should of died I'm glad he lived on for Kakashi's sake. Kakashi had already lost so much throughout his life losing his best bro too would suck mega hard. It warms the cold cochles of my heart that him and Kakashi can still bro out. Him loving was definitely an asspull but it's alright in my book.",
            "author": "arretez1512",
            "id": "gyxur8u",
            "parent_id": "t1_gywu528",
            "score": 4,
            "created_utc": 1621603031.0,
            "replies": []
        },
        {
            "body": "Counter argument: He could live, but instead of making him crippled in both legs, he would need Hashirama implants in both legs, and wouldn’t be able to go past the fifth gate without risking destroying the implants.",
            "author": "General_Synnacle",
            "id": "gyx1cdw",
            "parent_id": "t1_gywu528",
            "score": 10,
            "created_utc": 1621579902.0,
            "replies": []
        },
        {
            "body": "after the 'peak of youth is in autumn' speech I really started respecting him and way he was going to die and it would've been much more sensible too after all the flashbacks and stuff but guess it was just interpreted as this cheap stalling act",
            "author": "Aiden42Fatal",
            "id": "gyx1zyu",
            "parent_id": "t1_gywu528",
            "score": 8,
            "created_utc": 1621580468.0,
            "replies": []
        },
        {
            "body": "“This may sound cruel”\n\n\n>Proceeds to state opinion that’s shared on this sub 10 times a day",
            "author": "Pac_Zach_Attack",
            "id": "gyx2fzp",
            "parent_id": "t1_gywu528",
            "score": 13,
            "created_utc": 1621580859.0,
            "replies": []
        },
        {
            "body": "Thats sounds like a good idea, but then poor kakashi sensei would have no one left. It would be too cruel of the writers to kill kakashi's one last friend as well. I am glad they kept him alive.",
            "author": "VermicelliQueasy2221",
            "id": "iziouew",
            "parent_id": "t1_gywu528",
            "score": 1,
            "created_utc": 1670586899.0,
            "replies": []
        },
        {
            "body": "I loved that Naruto said \"Sorry for not noticing his greatness, I was too busy watching him crawl out from under a turtle\". Guy doesn't refute and Rock doesn't have a witty comeback for it.",
            "author": "SmallerBork",
            "id": "gyx0rsz",
            "parent_id": "t1_gyw5kj6",
            "score": 47,
            "created_utc": 1621579418.0,
            "replies": []
        },
        {
            "body": "I mean no disrespect towards people who do, but Orly don't think hes funny. Imo he's more annoying if anything, same with Lee, although his fight with Gaara made me like him. I guess it's just not my humor. If I watched more anime maybe I'd find it less weird 乁( •_• )ㄏ\n\nI mean i knew it was coming but its still funny, how i get downvoted bcs i gave my opinion. Respectfully may I add. Welcome to Reddit.",
            "author": "HisOnlyFriend",
            "id": "gyx9lav",
            "parent_id": "t1_gyw5kj6",
            "score": -11,
            "created_utc": 1621587336.0,
            "replies": [
                {
                    "body": "Nah he's a ridiculous wierdo but in a sense that's kind of his charm. Like, great dude, but in small bursts.\n\nVery small.\n\nFrom a distance.\n\nWhen he's going super beast mode on your enemies and you can cheer him on.",
                    "author": "ForsakenMoon13",
                    "id": "gyy8ebf",
                    "parent_id": "t1_gyx9lav",
                    "score": 4,
                    "created_utc": 1621609536.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Still gotta deal with Kaguya tho.",
            "author": "Intelligent-Win-4517",
            "id": "gyzaqd8",
            "parent_id": "t1_gywp2m1",
            "score": 2,
            "created_utc": 1621626874.0,
            "replies": [
                {
                    "body": "Kaguya onwards and Boruto does not exist for me",
                    "author": "dardardarner",
                    "id": "gyzfml6",
                    "parent_id": "t1_gyzaqd8",
                    "score": 8,
                    "created_utc": 1621629227.0,
                    "replies": [
                        {
                            "body": "Eh, Boruto is meh for me, but I could definitely understand Kaguya. Most interesting thing that came from her character is her damn kids, the Otsutsuki clan lore, creaton of Chakra, and the creation of the Tailed-Beasts.",
                            "author": "Intelligent-Win-4517",
                            "id": "gyzgs5g",
                            "parent_id": "t1_gyzfml6",
                            "score": 1,
                            "created_utc": 1621629792.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "From the moment guy slaps away Gaara's sand away when he was trying to kill Rock Lee we knew he insanely strong. If only Guy was present when Pain attacked.",
            "author": "KyuubiBryant",
            "id": "gyx73kz",
            "parent_id": "t1_gywglxo",
            "score": 32,
            "created_utc": 1621584952.0,
            "replies": [
                {
                    "body": "I think someone said that Guy specifically had to been away from the village during Pain’s attack otherwise the eight gates would’ve been used for Pain but it would’ve been like using the one nuke when you still had a ton of baddies still left",
                    "author": "FelneusLeviathan",
                    "id": "gyzgewk",
                    "parent_id": "t1_gyx73kz",
                    "score": 4,
                    "created_utc": 1621629611.0,
                    "replies": [
                        {
                            "body": "I don't think guy would be able to use Hirodora or the Night guy within the leaf Village due to the destruction it would've caused. Given that Konohamaru took out one of the Pains I reckon both Guy and Lee using the 6th gate alongside Kakashi would've been sufficient against all 6 Pain.",
                            "author": "KyuubiBryant",
                            "id": "gyzns47",
                            "parent_id": "t1_gyzgewk",
                            "score": 5,
                            "created_utc": 1621633156.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "8 Gates Guy curb stomps Kakashi (one ms)",
            "author": "Herbb__",
            "id": "gyzbm3j",
            "parent_id": "t1_gyxfwqy",
            "score": 5,
            "created_utc": 1621627290.0,
            "replies": [
                {
                    "body": "Well duh but if you gave Kakashi double MS he'd be more equal to 8 Gates",
                    "author": "Jordaxio",
                    "id": "gyze4vd",
                    "parent_id": "t1_gyzbm3j",
                    "score": 5,
                    "created_utc": 1621628507.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Might Guy, my man!",
            "author": "Executive_Meme",
            "id": "gyxm1hu",
            "parent_id": "t1_gywc10x",
            "score": 13,
            "created_utc": 1621597932.0,
            "replies": [
                {
                    "body": "*Hmph!*",
                    "author": "Intelligent-Win-4517",
                    "id": "gyzaxg4",
                    "parent_id": "t1_gyxm1hu",
                    "score": 4,
                    "created_utc": 1621626968.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Filler had to be filled somehow",
            "author": "FelneusLeviathan",
            "id": "gyzgxq6",
            "parent_id": "t1_gyx1oe3",
            "score": 2,
            "created_utc": 1621629869.0,
            "replies": []
        },
        {
            "body": "Nah, alot of people share this sentiment with alot of media.",
            "author": "Intelligent-Win-4517",
            "id": "gyzb4ss",
            "parent_id": "t1_gyz7q70",
            "score": 1,
            "created_utc": 1621627065.0,
            "replies": []
        },
        {
            "body": "The end of Shippuden though\n\nhttps://youtu.be/jQHEHB0agcU?t=237\n\nThe animators really drew that, it's even weirder if you go frame by frame.\n\nEven Tenten has to double back, I imagine she's thinking what in the name of the sage of six paths did I just witness.",
            "author": "SmallerBork",
            "id": "gyx18le",
            "parent_id": "t1_gywvysx",
            "score": 6,
            "created_utc": 1621579813.0,
            "replies": []
        },
        {
            "body": "Bruh he can still fight even in the wheelchair",
            "author": "uglynerdishere",
            "id": "gyzbh1r",
            "parent_id": "t1_gyx2cn2",
            "score": 1,
            "created_utc": 1621627224.0,
            "replies": []
        },
        {
            "body": "Bruh I already commented this but Rock Lee and Might Guy are really inspiring to me, just like Lee wants to be a splendid ninja I want to be a martial artist. May the power of yuth guide us all!! He really is the GOAT",
            "author": "uglynerdishere",
            "id": "gyzbp4y",
            "parent_id": "t1_gyyzs9a",
            "score": 2,
            "created_utc": 1621627331.0,
            "replies": []
        },
        {
            "body": "Might Guy IS P",
            "author": "3727rhfh",
            "id": "gyzlhgx",
            "parent_id": "t1_gyzahgt",
            "score": 1,
            "created_utc": 1621632068.0,
            "replies": []
        },
        {
            "body": "There is a lot wrong with the way the war ended. I think kishimoto wanted to do too much in a very short amount of time. Like I bet he knew he didn't want to end the series without 8 gates guy. But then he also didn't want to end it without six paths Naruto and Sasuke. So he sacrificed a potential kamikaze esc fight for guy because the only person left to fight was Madara. It's a shame really cause as much as I love his fight against Madara it just sort of feels like he's buying time and not a genuine battle",
            "author": "realraptorjesus101",
            "id": "gywv0t0",
            "parent_id": "t1_gywutih",
            "score": 141,
            "created_utc": 1621574742.0,
            "replies": [
                {
                    "body": "But after Madara was still Kaguya.\n\nThey could have Guy almost legitimately kill Madara, dying in the process - Black Zetsu uses the chance to pull his move on a weakened Madara and then Hagoromo gives his powers to Sasuke and Naruto because he feels his mother.\n\nLike there is a shitload that could have been changed",
                    "author": "HughMungusD",
                    "id": "gyx5udt",
                    "parent_id": "t1_gywv0t0",
                    "score": 126,
                    "created_utc": 1621583940.0,
                    "replies": [
                        {
                            "body": "That honestly would have been better.",
                            "author": "ForsakenMoon13",
                            "id": "gyy7xsk",
                            "parent_id": "t1_gyx5udt",
                            "score": 26,
                            "created_utc": 1621609330.0,
                            "replies": []
                        },
                        {
                            "body": "Or Guy kills Obito, then Madara is left for Konoha 11, same difference!",
                            "author": "mbeezyfan",
                            "id": "gyy7yu5",
                            "parent_id": "t1_gyx5udt",
                            "score": 13,
                            "created_utc": 1621609343.0,
                            "replies": []
                        },
                        {
                            "body": "damn man i’ll admit. this would’ve been the coldest moment of the series \n\nif guy died and all that happened just at once it would actually be a hopeless feel while watching the show",
                            "author": "verifiedjay",
                            "id": "gyyhzxi",
                            "parent_id": "t1_gyx5udt",
                            "score": 8,
                            "created_utc": 1621613816.0,
                            "replies": [
                                {
                                    "body": "Yeah and itd make sense! You wouldnt be like \"ugh what??? What a fuckin cop out\", rather like \"NOOO!!! EVEN WITH THAT FUCKING MASTERPEICE OUTPUT THEY STILL HAD ANOTHER PLAN???\".",
                                    "author": "agarwaen163",
                                    "id": "gyz9dyl",
                                    "parent_id": "t1_gyyhzxi",
                                    "score": 6,
                                    "created_utc": 1621626233.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "Sooooo much better",
                            "author": "agarwaen163",
                            "id": "gyz99fr",
                            "parent_id": "t1_gyx5udt",
                            "score": 4,
                            "created_utc": 1621626172.0,
                            "replies": []
                        },
                        {
                            "body": "Yesss bruh.",
                            "author": "Intelligent-Win-4517",
                            "id": "gyz9taq",
                            "parent_id": "t1_gyx5udt",
                            "score": 2,
                            "created_utc": 1621626435.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "He should have had Eight Gates Guy finish off Obito, then Madara reveal and plenty of spotlight left for the Protagonist to kill Madara then. It's what I always thought should have happened",
                    "author": "mbeezyfan",
                    "id": "gyy7wpd",
                    "parent_id": "t1_gywv0t0",
                    "score": 7,
                    "created_utc": 1621609316.0,
                    "replies": []
                },
                {
                    "body": "> There is a lot wrong with the way the war ended. I think kishimoto wanted to do too much in a very short amount of time.\n\nSums up a lot with this series actually.",
                    "author": "DisneyPrincessDVorah",
                    "id": "gyyehh0",
                    "parent_id": "t1_gywv0t0",
                    "score": 5,
                    "created_utc": 1621612236.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "this",
            "author": "Radonda",
            "id": "gyxg2g6",
            "parent_id": "t1_gywutih",
            "score": 7,
            "created_utc": 1621593398.0,
            "replies": []
        },
        {
            "body": "Neji should have been the Team 7 jonin in boruto! Konohamaru does not deserve it.",
            "author": "RedBeard695",
            "id": "gyxoaqc",
            "parent_id": "t1_gywz0k5",
            "score": 9,
            "created_utc": 1621599374.0,
            "replies": [
                {
                    "body": "I don’t really agree that Konohamaru doesn’t deserve it, but I was saying this exact thing to a friend the other day. The dynamic between the stoic Neji leading Team 7 and his rebellious nephew Boruto could’ve been really interesting, but instead one of my favorite characters died a pointless death which basically confirmed that his philosophy in the first Chunin exams was not only not flawed, but correct.",
                    "author": "peggygotnofear",
                    "id": "gyxrni7",
                    "parent_id": "t1_gyxoaqc",
                    "score": 20,
                    "created_utc": 1621601344.0,
                    "replies": [
                        {
                            "body": "He literally gave his life to save main family hinata. He was gonna be the head of hyuga, but in the end destiny prevailed.\n\nIt’s almost like the chunin exam fight was retconned.",
                            "author": "RedBeard695",
                            "id": "gyxs01m",
                            "parent_id": "t1_gyxrni7",
                            "score": 10,
                            "created_utc": 1621601534.0,
                            "replies": [
                                {
                                    "body": "So, ever since this manga came out people were saying that Naruto was the son of the 4th, it was just a given and no one thought otherwise except aa potential M. Night Shamalamadingdong \"what a twist\" moment. \n\nSo I always saw the Naruto v Neji fight as bullshit. Even before the \"child of prophecy\" stuff came up. \n\nNot only is Naruto a genius, he's a genius of hard work too. He just didn't get stuff easy, which destiny still prevailed and he became strong enough to save the world. \n\nNaruto's win was fate, within the world and not just some \"it's a manga\" meta excuse. Neji just didn't know who he was up against.",
                                    "author": "DisneyPrincessDVorah",
                                    "id": "gyygqbc",
                                    "parent_id": "t1_gyxs01m",
                                    "score": 9,
                                    "created_utc": 1621613242.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "Well Neji’s ideas were flawed because they came from the false idea that his father was sacrificed forcefully when he chose to die in place of his brother. You can bring up how it’s still the branch house serving the main house but in this situation, clan standing/politics stops being a factor when the situation they faced was full on war between the Leaf and Cloud. Hiashi killed the cloud ninja and so he needed to be killed off to prevent a war, he never wanted his brother to die for his (albeit justified) action. \n\nBut yeah war arc is a mess",
                            "author": "Sealking13",
                            "id": "gz0vxyc",
                            "parent_id": "t1_gyxrni7",
                            "score": 1,
                            "created_utc": 1621657820.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "as much as i want to downvote this, you’re right lol",
                    "author": "verifiedjay",
                    "id": "gyyi49x",
                    "parent_id": "t1_gyxoaqc",
                    "score": 5,
                    "created_utc": 1621613872.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Hi at as dad could’ve died and Neji could’ve taken over for poetic justice\nBut that grandpa scene was cute in both to I guess",
            "author": "Lonesome_Ninja",
            "id": "gyy0wkp",
            "parent_id": "t1_gywz0k5",
            "score": 1,
            "created_utc": 1621606124.0,
            "replies": []
        },
        {
            "body": "They could have killed Kiba...",
            "author": "Window2Anime",
            "id": "gyxe2ko",
            "parent_id": "t1_gyx0lsv",
            "score": 11,
            "created_utc": 1621591615.0,
            "replies": [
                {
                    "body": "No, need him around for the fanfics...",
                    "author": "ForsakenMoon13",
                    "id": "gyy83ly",
                    "parent_id": "t1_gyxe2ko",
                    "score": 4,
                    "created_utc": 1621609402.0,
                    "replies": [
                        {
                            "body": "People will still have fanFCC ics even if he died.",
                            "author": "Window2Anime",
                            "id": "gyye62z",
                            "parent_id": "t1_gyy83ly",
                            "score": 3,
                            "created_utc": 1621612096.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Nah he's a ridiculous wierdo but in a sense that's kind of his charm. Like, great dude, but in small bursts.\n\nVery small.\n\nFrom a distance.\n\nWhen he's going super beast mode on your enemies and you can cheer him on.",
            "author": "ForsakenMoon13",
            "id": "gyy8ebf",
            "parent_id": "t1_gyx9lav",
            "score": 4,
            "created_utc": 1621609536.0,
            "replies": []
        },
        {
            "body": "Kaguya onwards and Boruto does not exist for me",
            "author": "dardardarner",
            "id": "gyzfml6",
            "parent_id": "t1_gyzaqd8",
            "score": 8,
            "created_utc": 1621629227.0,
            "replies": [
                {
                    "body": "Eh, Boruto is meh for me, but I could definitely understand Kaguya. Most interesting thing that came from her character is her damn kids, the Otsutsuki clan lore, creaton of Chakra, and the creation of the Tailed-Beasts.",
                    "author": "Intelligent-Win-4517",
                    "id": "gyzgs5g",
                    "parent_id": "t1_gyzfml6",
                    "score": 1,
                    "created_utc": 1621629792.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I think someone said that Guy specifically had to been away from the village during Pain’s attack otherwise the eight gates would’ve been used for Pain but it would’ve been like using the one nuke when you still had a ton of baddies still left",
            "author": "FelneusLeviathan",
            "id": "gyzgewk",
            "parent_id": "t1_gyx73kz",
            "score": 4,
            "created_utc": 1621629611.0,
            "replies": [
                {
                    "body": "I don't think guy would be able to use Hirodora or the Night guy within the leaf Village due to the destruction it would've caused. Given that Konohamaru took out one of the Pains I reckon both Guy and Lee using the 6th gate alongside Kakashi would've been sufficient against all 6 Pain.",
                    "author": "KyuubiBryant",
                    "id": "gyzns47",
                    "parent_id": "t1_gyzgewk",
                    "score": 5,
                    "created_utc": 1621633156.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Well duh but if you gave Kakashi double MS he'd be more equal to 8 Gates",
            "author": "Jordaxio",
            "id": "gyze4vd",
            "parent_id": "t1_gyzbm3j",
            "score": 5,
            "created_utc": 1621628507.0,
            "replies": []
        },
        {
            "body": "*Hmph!*",
            "author": "Intelligent-Win-4517",
            "id": "gyzaxg4",
            "parent_id": "t1_gyxm1hu",
            "score": 4,
            "created_utc": 1621626968.0,
            "replies": []
        },
        {
            "body": "But after Madara was still Kaguya.\n\nThey could have Guy almost legitimately kill Madara, dying in the process - Black Zetsu uses the chance to pull his move on a weakened Madara and then Hagoromo gives his powers to Sasuke and Naruto because he feels his mother.\n\nLike there is a shitload that could have been changed",
            "author": "HughMungusD",
            "id": "gyx5udt",
            "parent_id": "t1_gywv0t0",
            "score": 126,
            "created_utc": 1621583940.0,
            "replies": [
                {
                    "body": "That honestly would have been better.",
                    "author": "ForsakenMoon13",
                    "id": "gyy7xsk",
                    "parent_id": "t1_gyx5udt",
                    "score": 26,
                    "created_utc": 1621609330.0,
                    "replies": []
                },
                {
                    "body": "Or Guy kills Obito, then Madara is left for Konoha 11, same difference!",
                    "author": "mbeezyfan",
                    "id": "gyy7yu5",
                    "parent_id": "t1_gyx5udt",
                    "score": 13,
                    "created_utc": 1621609343.0,
                    "replies": []
                },
                {
                    "body": "damn man i’ll admit. this would’ve been the coldest moment of the series \n\nif guy died and all that happened just at once it would actually be a hopeless feel while watching the show",
                    "author": "verifiedjay",
                    "id": "gyyhzxi",
                    "parent_id": "t1_gyx5udt",
                    "score": 8,
                    "created_utc": 1621613816.0,
                    "replies": [
                        {
                            "body": "Yeah and itd make sense! You wouldnt be like \"ugh what??? What a fuckin cop out\", rather like \"NOOO!!! EVEN WITH THAT FUCKING MASTERPEICE OUTPUT THEY STILL HAD ANOTHER PLAN???\".",
                            "author": "agarwaen163",
                            "id": "gyz9dyl",
                            "parent_id": "t1_gyyhzxi",
                            "score": 6,
                            "created_utc": 1621626233.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Sooooo much better",
                    "author": "agarwaen163",
                    "id": "gyz99fr",
                    "parent_id": "t1_gyx5udt",
                    "score": 4,
                    "created_utc": 1621626172.0,
                    "replies": []
                },
                {
                    "body": "Yesss bruh.",
                    "author": "Intelligent-Win-4517",
                    "id": "gyz9taq",
                    "parent_id": "t1_gyx5udt",
                    "score": 2,
                    "created_utc": 1621626435.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "He should have had Eight Gates Guy finish off Obito, then Madara reveal and plenty of spotlight left for the Protagonist to kill Madara then. It's what I always thought should have happened",
            "author": "mbeezyfan",
            "id": "gyy7wpd",
            "parent_id": "t1_gywv0t0",
            "score": 7,
            "created_utc": 1621609316.0,
            "replies": []
        },
        {
            "body": "> There is a lot wrong with the way the war ended. I think kishimoto wanted to do too much in a very short amount of time.\n\nSums up a lot with this series actually.",
            "author": "DisneyPrincessDVorah",
            "id": "gyyehh0",
            "parent_id": "t1_gywv0t0",
            "score": 5,
            "created_utc": 1621612236.0,
            "replies": []
        },
        {
            "body": "I don’t really agree that Konohamaru doesn’t deserve it, but I was saying this exact thing to a friend the other day. The dynamic between the stoic Neji leading Team 7 and his rebellious nephew Boruto could’ve been really interesting, but instead one of my favorite characters died a pointless death which basically confirmed that his philosophy in the first Chunin exams was not only not flawed, but correct.",
            "author": "peggygotnofear",
            "id": "gyxrni7",
            "parent_id": "t1_gyxoaqc",
            "score": 20,
            "created_utc": 1621601344.0,
            "replies": [
                {
                    "body": "He literally gave his life to save main family hinata. He was gonna be the head of hyuga, but in the end destiny prevailed.\n\nIt’s almost like the chunin exam fight was retconned.",
                    "author": "RedBeard695",
                    "id": "gyxs01m",
                    "parent_id": "t1_gyxrni7",
                    "score": 10,
                    "created_utc": 1621601534.0,
                    "replies": [
                        {
                            "body": "So, ever since this manga came out people were saying that Naruto was the son of the 4th, it was just a given and no one thought otherwise except aa potential M. Night Shamalamadingdong \"what a twist\" moment. \n\nSo I always saw the Naruto v Neji fight as bullshit. Even before the \"child of prophecy\" stuff came up. \n\nNot only is Naruto a genius, he's a genius of hard work too. He just didn't get stuff easy, which destiny still prevailed and he became strong enough to save the world. \n\nNaruto's win was fate, within the world and not just some \"it's a manga\" meta excuse. Neji just didn't know who he was up against.",
                            "author": "DisneyPrincessDVorah",
                            "id": "gyygqbc",
                            "parent_id": "t1_gyxs01m",
                            "score": 9,
                            "created_utc": 1621613242.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Well Neji’s ideas were flawed because they came from the false idea that his father was sacrificed forcefully when he chose to die in place of his brother. You can bring up how it’s still the branch house serving the main house but in this situation, clan standing/politics stops being a factor when the situation they faced was full on war between the Leaf and Cloud. Hiashi killed the cloud ninja and so he needed to be killed off to prevent a war, he never wanted his brother to die for his (albeit justified) action. \n\nBut yeah war arc is a mess",
                    "author": "Sealking13",
                    "id": "gz0vxyc",
                    "parent_id": "t1_gyxrni7",
                    "score": 1,
                    "created_utc": 1621657820.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "as much as i want to downvote this, you’re right lol",
            "author": "verifiedjay",
            "id": "gyyi49x",
            "parent_id": "t1_gyxoaqc",
            "score": 5,
            "created_utc": 1621613872.0,
            "replies": []
        },
        {
            "body": "No, need him around for the fanfics...",
            "author": "ForsakenMoon13",
            "id": "gyy83ly",
            "parent_id": "t1_gyxe2ko",
            "score": 4,
            "created_utc": 1621609402.0,
            "replies": [
                {
                    "body": "People will still have fanFCC ics even if he died.",
                    "author": "Window2Anime",
                    "id": "gyye62z",
                    "parent_id": "t1_gyy83ly",
                    "score": 3,
                    "created_utc": 1621612096.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Eh, Boruto is meh for me, but I could definitely understand Kaguya. Most interesting thing that came from her character is her damn kids, the Otsutsuki clan lore, creaton of Chakra, and the creation of the Tailed-Beasts.",
            "author": "Intelligent-Win-4517",
            "id": "gyzgs5g",
            "parent_id": "t1_gyzfml6",
            "score": 1,
            "created_utc": 1621629792.0,
            "replies": []
        },
        {
            "body": "I don't think guy would be able to use Hirodora or the Night guy within the leaf Village due to the destruction it would've caused. Given that Konohamaru took out one of the Pains I reckon both Guy and Lee using the 6th gate alongside Kakashi would've been sufficient against all 6 Pain.",
            "author": "KyuubiBryant",
            "id": "gyzns47",
            "parent_id": "t1_gyzgewk",
            "score": 5,
            "created_utc": 1621633156.0,
            "replies": []
        },
        {
            "body": "That honestly would have been better.",
            "author": "ForsakenMoon13",
            "id": "gyy7xsk",
            "parent_id": "t1_gyx5udt",
            "score": 26,
            "created_utc": 1621609330.0,
            "replies": []
        },
        {
            "body": "Or Guy kills Obito, then Madara is left for Konoha 11, same difference!",
            "author": "mbeezyfan",
            "id": "gyy7yu5",
            "parent_id": "t1_gyx5udt",
            "score": 13,
            "created_utc": 1621609343.0,
            "replies": []
        },
        {
            "body": "damn man i’ll admit. this would’ve been the coldest moment of the series \n\nif guy died and all that happened just at once it would actually be a hopeless feel while watching the show",
            "author": "verifiedjay",
            "id": "gyyhzxi",
            "parent_id": "t1_gyx5udt",
            "score": 8,
            "created_utc": 1621613816.0,
            "replies": [
                {
                    "body": "Yeah and itd make sense! You wouldnt be like \"ugh what??? What a fuckin cop out\", rather like \"NOOO!!! EVEN WITH THAT FUCKING MASTERPEICE OUTPUT THEY STILL HAD ANOTHER PLAN???\".",
                    "author": "agarwaen163",
                    "id": "gyz9dyl",
                    "parent_id": "t1_gyyhzxi",
                    "score": 6,
                    "created_utc": 1621626233.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Sooooo much better",
            "author": "agarwaen163",
            "id": "gyz99fr",
            "parent_id": "t1_gyx5udt",
            "score": 4,
            "created_utc": 1621626172.0,
            "replies": []
        },
        {
            "body": "Yesss bruh.",
            "author": "Intelligent-Win-4517",
            "id": "gyz9taq",
            "parent_id": "t1_gyx5udt",
            "score": 2,
            "created_utc": 1621626435.0,
            "replies": []
        },
        {
            "body": "He literally gave his life to save main family hinata. He was gonna be the head of hyuga, but in the end destiny prevailed.\n\nIt’s almost like the chunin exam fight was retconned.",
            "author": "RedBeard695",
            "id": "gyxs01m",
            "parent_id": "t1_gyxrni7",
            "score": 10,
            "created_utc": 1621601534.0,
            "replies": [
                {
                    "body": "So, ever since this manga came out people were saying that Naruto was the son of the 4th, it was just a given and no one thought otherwise except aa potential M. Night Shamalamadingdong \"what a twist\" moment. \n\nSo I always saw the Naruto v Neji fight as bullshit. Even before the \"child of prophecy\" stuff came up. \n\nNot only is Naruto a genius, he's a genius of hard work too. He just didn't get stuff easy, which destiny still prevailed and he became strong enough to save the world. \n\nNaruto's win was fate, within the world and not just some \"it's a manga\" meta excuse. Neji just didn't know who he was up against.",
                    "author": "DisneyPrincessDVorah",
                    "id": "gyygqbc",
                    "parent_id": "t1_gyxs01m",
                    "score": 9,
                    "created_utc": 1621613242.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Well Neji’s ideas were flawed because they came from the false idea that his father was sacrificed forcefully when he chose to die in place of his brother. You can bring up how it’s still the branch house serving the main house but in this situation, clan standing/politics stops being a factor when the situation they faced was full on war between the Leaf and Cloud. Hiashi killed the cloud ninja and so he needed to be killed off to prevent a war, he never wanted his brother to die for his (albeit justified) action. \n\nBut yeah war arc is a mess",
            "author": "Sealking13",
            "id": "gz0vxyc",
            "parent_id": "t1_gyxrni7",
            "score": 1,
            "created_utc": 1621657820.0,
            "replies": []
        },
        {
            "body": "People will still have fanFCC ics even if he died.",
            "author": "Window2Anime",
            "id": "gyye62z",
            "parent_id": "t1_gyy83ly",
            "score": 3,
            "created_utc": 1621612096.0,
            "replies": []
        },
        {
            "body": "Yeah and itd make sense! You wouldnt be like \"ugh what??? What a fuckin cop out\", rather like \"NOOO!!! EVEN WITH THAT FUCKING MASTERPEICE OUTPUT THEY STILL HAD ANOTHER PLAN???\".",
            "author": "agarwaen163",
            "id": "gyz9dyl",
            "parent_id": "t1_gyyhzxi",
            "score": 6,
            "created_utc": 1621626233.0,
            "replies": []
        },
        {
            "body": "So, ever since this manga came out people were saying that Naruto was the son of the 4th, it was just a given and no one thought otherwise except aa potential M. Night Shamalamadingdong \"what a twist\" moment. \n\nSo I always saw the Naruto v Neji fight as bullshit. Even before the \"child of prophecy\" stuff came up. \n\nNot only is Naruto a genius, he's a genius of hard work too. He just didn't get stuff easy, which destiny still prevailed and he became strong enough to save the world. \n\nNaruto's win was fate, within the world and not just some \"it's a manga\" meta excuse. Neji just didn't know who he was up against.",
            "author": "DisneyPrincessDVorah",
            "id": "gyygqbc",
            "parent_id": "t1_gyxs01m",
            "score": 9,
            "created_utc": 1621613242.0,
            "replies": []
        }
    ]
}