{
    "title": "THIS FORUM SAVED MY LIFE!! Also, I highly suggest using an alias name and NOT giving a a SD your real details at the beginning.",
    "post_id": "cgdn0r",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/cgdn0r/this_forum_saved_my_life_also_i_highly_suggest/",
    "author": "tremendoyarna420",
    "body": "Okay so I posted about a potential SD that I have been talking to for a couple weeks that wanted me to fly to his city for the first meet and greet. As you guys pointed out the dangers of doing that, I politely declined his request and told him it won’t work between us because of the distance. As an exchange student when I signed up for the site I used an alias name as i don’t want to take any risk of anyone reporting any kind of bullshit about me to immigration ( that’s always a possibility cause people can be mean and jerks). Anyway, after rejecting him today he threatened me that he works for the government he has all my passport info from my name and pics and will report me to immigration unless I agree to his terms. I reported him and blocked him. I am so thankful that I DID NOT go to meet him! This guy is a serious black mailer, tbh I fear he would have raped me when I would have said no to intimacy after the first M&G. Thankyou everyone in this sub who gave me good advise and literally saved my life. Some people questioned why I chose to not reveal my real name , here you go guys , this is why!! Tonight I can still sleep in peace even after getting that nasty threat is because I am under a total fake name on the site, no way he can track me down lol",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/cgdn0r/this_forum_saved_my_life_also_i_highly_suggest/",
    "score": 171,
    "upvote_ratio": 0.98,
    "created_utc": 1563804421.0,
    "num_comments": 40,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "A suggestion for the SB’s out there on at least one pitfall to watch out for.   Early on with current SB, she was using a fake name and was very careful.  One day, I was on LinkedIn and I was looking at who viewed my profile.   And there she was - real name and all.  She did not know that LinkedIn did that, but she inadvertently outed herself.  To this day, I don’t know how she figured out who I was.  \n\nI asked her about it, while assuring her she had nothing to fear from me.  She assured me that my info was safe with her as well, had a laugh about it and moved on.   However, I could have been dangerous, so watch it with social media when you are “creeping” as she puts it.",
            "author": "MrBuzzard",
            "id": "eugi7kt",
            "parent_id": "t3_cgdn0r",
            "score": 43,
            "created_utc": 1563808371.0,
            "replies": [
                {
                    "body": "Yeah smart girl, I didn’t even think about checking their linked in! I certainly will\nNow. I will make a fake LinkedIn to do the background checks!",
                    "author": "tremendoyarna420",
                    "id": "eugixp1",
                    "parent_id": "t1_eugi7kt",
                    "score": 9,
                    "created_utc": 1563808787.0,
                    "replies": [
                        {
                            "body": "I’m so so happy you listened to our advice and decided to disengage sooner rather than later. We’ve read some horror stories on this sub where the person chose not to take advice given and ends up in a bad situation.\n\nThank you for updating us! Good luck sugaring 💗",
                            "author": "slinkyinthebag",
                            "id": "euhy4qy",
                            "parent_id": "t1_eugixp1",
                            "score": 8,
                            "created_utc": 1563836489.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "To snoop LinkedIn privately you need to be a premium member with your setting set to private.",
                    "author": "LotBuilder",
                    "id": "eugmiw9",
                    "parent_id": "t1_eugi7kt",
                    "score": 6,
                    "created_utc": 1563810809.0,
                    "replies": [
                        {
                            "body": "You don't need to be premium for that. You can snoop privately but you don't get to see who has seen your profile",
                            "author": "ch1ps-ah0y",
                            "id": "eugp2fo",
                            "parent_id": "t1_eugmiw9",
                            "score": 14,
                            "created_utc": 1563812211.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Never give our personal info including real name. Even after you meet the person and have gone out on a few dates, I still wouldn't give full real name. There are just way too many weirdos pyschos out there. Will they actually black mail you (that's a legit crime)? Probably not, but the anxiety/stress over it isn't worth it.",
            "author": "sf_degen",
            "id": "eugdjtp",
            "parent_id": "t3_cgdn0r",
            "score": 34,
            "created_utc": 1563805687.0,
            "replies": [
                {
                    "body": "I agree! I am never giving out a SD my real name and anyone who fusses over it better to be avoided. Why would older rich men with all the connections and money in the world be scared of a young girl hiding her identity.",
                    "author": "tremendoyarna420",
                    "id": "eugdotc",
                    "parent_id": "t1_eugdjtp",
                    "score": 26,
                    "created_utc": 1563805770.0,
                    "replies": [
                        {
                            "body": "Exactly! And all of the concerns SDs here bring up concerning “what they’re risking” can all be solved with their money. Rich people have an insane amount of power, how they fuck do they think Epstein got away for this long? Acting like they don’t have the money and legal connections to scare the shit out of the scorned SB who wants to “hurt them”. They really think they’re as helpless as the young, financially struggling girl they’re talking to. Oh i wish I could afford to be that blissfully ignorant about what it is like to be a financially struggling young woman, knowing the cards are always stacked against you in the system of law.",
                            "author": "RussianAsshole",
                            "id": "eui2py9",
                            "parent_id": "t1_eugdotc",
                            "score": 13,
                            "created_utc": 1563839189.0,
                            "replies": []
                        },
                        {
                            "body": "That shit goes two ways.  The older wealthy married man has a lot to lose.  I have been blackmailed by a sugar baby.  I don't know her real name.  Never again.  Hotels and fake names and STD tests until real trust exists.",
                            "author": "stark_emerson",
                            "id": "euhlk7i",
                            "parent_id": "t1_eugdotc",
                            "score": 10,
                            "created_utc": 1563829560.0,
                            "replies": []
                        },
                        {
                            "body": ">Why would older rich men with all the connections and money in the world be scared of a young girl hiding her identity.\n\nBecause some people hide their identity to nefarious reasons and other are just doing to protect themselves.",
                            "author": "ruphun",
                            "id": "eugns7h",
                            "parent_id": "t1_eugdotc",
                            "score": 8,
                            "created_utc": 1563811507.0,
                            "replies": []
                        },
                        {
                            "body": ">Why would older rich men with all the connections and money in the world be scared of a young girl hiding her identity.\n\nuhhh...because they have all the money in the world and obviously have something\n\nto lose?\n\n&#x200B;\n\nA healthy SD/SB relationship is about mutual benefits, RESPECT, openness and honesty...hiding your identity shows you are not trustworthy and probably just out for your own agenda.\n\n&#x200B;\n\nYou sound naive and seem to think sugar daddies are stupid little old rich men waiting to be taken advantage of",
                            "author": "retiredsugardaddy",
                            "id": "euh5t99",
                            "parent_id": "t1_eugdotc",
                            "score": 4,
                            "created_utc": 1563821338.0,
                            "replies": []
                        },
                        {
                            "body": "I’m glad you avoided this pitfall, but I disagree on anonymity.   If you had screened him properly he wouldn’t be making ridiculous threats like being a Mossad agent or whatever.   \n\nYou shouldn’t just jump on a plane to meet anonymous strangers.  That is begging for trouble.   I’d advise avoiding any SD who won’t give you their personal info, work, and references.   You should know who the guy is if for nothing more than reading up on him for dinner conversation topics.    \n\nRegarding your personal info, assume they already have it.  Those “older rich men” don’t want to accidentally have dinner with a bunny boiling psychopath.   They will screen you.  I’d be wary of anyone who would meet you otherwise, and think you are backwards on your risk management plan.",
                            "author": "FlexEconGuy",
                            "id": "eugv46r",
                            "parent_id": "t1_eugdotc",
                            "score": 4,
                            "created_utc": 1563815457.0,
                            "replies": [
                                {
                                    "body": "Not true. I dated high earning people with buildings literally named after them, who had no clue what my real name was. Being rich doesn't mean you're always hiring private investigators\n\nSick of people making rich guys seem like all knowing gods. They're horny men just like the rest of the SDs",
                                    "author": "Chawkleeta",
                                    "id": "euhrgl9",
                                    "parent_id": "t1_eugv46r",
                                    "score": 10,
                                    "created_utc": 1563832740.0,
                                    "replies": [
                                        {
                                            "body": "Well... yeah.  Horny guys are horny guys.  That’s just not at all what I consider “sugar”.   \n\nI don’t know how anyone can look at your comment as anything other than transactional in context and in violation of the rules on this sub.",
                                            "author": "FlexEconGuy",
                                            "id": "eui1rmj",
                                            "parent_id": "t1_euhrgl9",
                                            "score": -4,
                                            "created_utc": 1563838625.0,
                                            "replies": [
                                                {
                                                    "body": "I'm talking about screening and making SBs unnecessarily afraid to withhold their personal information just because a man is wealthy. \n\nMost of the time it's middle management level execs aka 'nobodies',  hiding their identities and demanding a girls personal info. \n\nHigh net worth men, at least here in NYC, are incredibly quick to invite you over to see their homes. And when they have \"fuck you\" money they don't hire investigators. They can just throw you off the roof or into the ocean.",
                                                    "author": "Chawkleeta",
                                                    "id": "eukm5qw",
                                                    "parent_id": "t1_eui1rmj",
                                                    "score": 3,
                                                    "created_utc": 1563890208.0,
                                                    "replies": [
                                                        {
                                                            "body": "100% on the immediate home invitations.   Funny on the flying lessons.",
                                                            "author": "FlexEconGuy",
                                                            "id": "eukpp4b",
                                                            "parent_id": "t1_eukm5qw",
                                                            "score": 1,
                                                            "created_utc": 1563891564.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "I find your recommendation, well, interesting. At what point do you give out all this identifying personal information?  For me, anonymity is critical. And I am fine with the SB doing the same. I have to have real insight into a persons character before I would ever give identifying information to an SB.",
                                    "author": null,
                                    "id": "evstpyn",
                                    "parent_id": "t1_eugv46r",
                                    "score": 1,
                                    "created_utc": 1564755973.0,
                                    "replies": [
                                        {
                                            "body": "I meet SBs in real life, so anonymity is almost impossible.   Also, I’m divorced.  There isn’t any spouse to hide things from.",
                                            "author": "FlexEconGuy",
                                            "id": "evsvh86",
                                            "parent_id": "t1_evstpyn",
                                            "score": 1,
                                            "created_utc": 1564757078.0,
                                            "replies": [
                                                {
                                                    "body": "Well I meet SBs in real life too. In your opinion would the OP have been better off revealing her real information to this person who clearly intended to extort her?  I think that you, as a divorced person have less to lose than I do as a married man or the OP as a foreign student. I’m glad you can be so free with your info. Would you agree that that’s not true for everyone?",
                                                    "author": null,
                                                    "id": "evsw3wb",
                                                    "parent_id": "t1_evsvh86",
                                                    "score": 1,
                                                    "created_utc": 1564757473.0,
                                                    "replies": [
                                                        {
                                                            "body": "Maybe.  I guess it depends on what type of city you live in.  But it would be pointless to try and hide your identity meeting people in a posh urban neighborhood where everyone is a 3rd degree from Kevin Bacon.",
                                                            "author": "FlexEconGuy",
                                                            "id": "evswlwp",
                                                            "parent_id": "t1_evsw3wb",
                                                            "score": 1,
                                                            "created_utc": 1564757786.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "A rich SD with connections is scared of stalking, harassment, violent outbursts, property damage and - in some cases - theft and extortion. I'd need to know who you really are before getting into a long-term SR. And, of course, I'd tell you who I am.\n\nThis anonymity thing is bizarre. If we are in a hotel together, clothes off, unless I lock my wallet and phone in the safe and unless you sleep with yours under your pillow and take them with you when you shower, it's trivial for either of us to figure out who the other is. Some people on this subreddit think the act of using a fake name is a magic talisman.",
                            "author": null,
                            "id": "eugxzum",
                            "parent_id": "t1_eugdotc",
                            "score": 0,
                            "created_utc": 1563817051.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Unless your henchmen put a black hood over SB's head and drive her to an undisclosed location, if she wants to figure out who you are, she will. Your license plates, registration, name at the hotel, mail at your house and more all bleed your personal info. This level of paranoia is bizarre. And how on earth do you establish trust if you don't know each others' names?",
                    "author": null,
                    "id": "eugx23i",
                    "parent_id": "t1_eugdjtp",
                    "score": 7,
                    "created_utc": 1563816481.0,
                    "replies": [
                        {
                            "body": ">This level of paranoia is bizarre. And how on earth do you establish trust if you don't know each others' names?\n\nI agree. I understand wanting to be careful but...\n\n1. Privacy does not exist anymore. The internet cookies, marketing companies, Google, social media and all these geneaology tests record EVERYTHING you do. People can and will be able to find your info if they look hard enough.\n\n2. If you are highly paranoid to the point where you feel you can't ever disclose any true info about yourself, then don't sugar! Simple as that!",
                            "author": "lakoreanita",
                            "id": "eukok4q",
                            "parent_id": "t1_eugx23i",
                            "score": 3,
                            "created_utc": 1563891130.0,
                            "replies": []
                        },
                        {
                            "body": "I think anonymity is absolutely essential to safety until you get to know someone.  I have a plan to prevent someone finding out who I am for every one of the things you mention. Generally I get a sense of people at the M&G as to how trustworthy they are. But I usually won’t give personal information except real first name until during or after a first date. This OP did the right thing and why everyone can’t see how it obviously protected her from bad things is kinda weird.",
                            "author": null,
                            "id": "evsujx9",
                            "parent_id": "t1_eugx23i",
                            "score": 1,
                            "created_utc": 1564756496.0,
                            "replies": []
                        },
                        {
                            "body": ">This level of paranoia is bizarre. And, how on earth do you establish trust if you don't know each others' names?\n\nbecause she's up to no good",
                            "author": "retiredsugardaddy",
                            "id": "euh66iy",
                            "parent_id": "t1_eugx23i",
                            "score": 0,
                            "created_utc": 1563821530.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Agreed!!!!",
                    "author": "Chawkleeta",
                    "id": "euhr4z3",
                    "parent_id": "t1_eugdjtp",
                    "score": 2,
                    "created_utc": 1563832563.0,
                    "replies": []
                },
                {
                    "body": "I don’t get this either. Ever? Really? You are willing to take off your clothes, have sex together, essentially be totally vulnerable together, yet you are worries about a name? If a SB is willing to have sex with me, without knowing my real name or knowing hers is a complete problem for me.",
                    "author": "WCSD74",
                    "id": "euh4cme",
                    "parent_id": "t1_eugdjtp",
                    "score": 1,
                    "created_utc": 1563820579.0,
                    "replies": [
                        {
                            "body": "Totally agree!",
                            "author": "lakoreanita",
                            "id": "euknxb4",
                            "parent_id": "t1_euh4cme",
                            "score": 1,
                            "created_utc": 1563890873.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I say it goes both ways. Never give real name, what you do or anything remotely related to yourself. Too many weirdos out there and it is not worth the hassel. If the person is genuine they will surely understand the reason and most probably will be using an alias too.",
            "author": "mute83",
            "id": "euhkxml",
            "parent_id": "t3_cgdn0r",
            "score": 4,
            "created_utc": 1563829228.0,
            "replies": []
        },
        {
            "body": "Was recently added to instagram by someone on sa. I guess he did a reverse image search. Such creepy behaviour, but I learned my lesson.",
            "author": "prosecco_pour_1",
            "id": "eugj8nb",
            "parent_id": "t3_cgdn0r",
            "score": 8,
            "created_utc": 1563808963.0,
            "replies": [
                {
                    "body": "This is exactly why many people on here recommend using photos that haven't ever been posted online before as your photos on SA",
                    "author": "Particularsb",
                    "id": "eugu0au",
                    "parent_id": "t1_eugj8nb",
                    "score": 18,
                    "created_utc": 1563814858.0,
                    "replies": [
                        {
                            "body": "Lesson learned!",
                            "author": "prosecco_pour_1",
                            "id": "eugv4zw",
                            "parent_id": "t1_eugu0au",
                            "score": 2,
                            "created_utc": 1563815469.0,
                            "replies": []
                        },
                        {
                            "body": "But with facial recognition even if you haven't used the photograph before but there are other photographs of you online, they can come up in a reverse search. So maybe photoshop your eyes a little bigger and your nose a little smaller or vice versa.",
                            "author": "Xatness",
                            "id": "exk9p1m",
                            "parent_id": "t1_eugu0au",
                            "score": 1,
                            "created_utc": 1566380363.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Bang.  That’s the issue.  If you are on any social media at all it takes a toddler a few minutes to see who you are.   If you have zero historical social media use, and have never ever been tagged in a photo by a friend with any historical social media presence, it takes a decent skip tracer less than 24 hours.",
                    "author": "FlexEconGuy",
                    "id": "eugvmb6",
                    "parent_id": "t1_eugj8nb",
                    "score": 4,
                    "created_utc": 1563815721.0,
                    "replies": []
                },
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "eups9za",
                    "parent_id": "t1_eugj8nb",
                    "score": 1,
                    "created_utc": 1563963393.0,
                    "replies": [
                        {
                            "body": "We hadnt spoken/he had not messaged me. He favourited me and then added me to instagram. His user name was the same and so was the photo. \n\nUsually suggested friends are because you have them on Facebook,have their number, are following friends of friends. In my experience, anyways. Not the case with this guy.",
                            "author": "prosecco_pour_1",
                            "id": "eupysmb",
                            "parent_id": "t1_eups9za",
                            "score": 1,
                            "created_utc": 1563967175.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "eupyys4",
                                    "parent_id": "t1_eupysmb",
                                    "score": 1,
                                    "created_utc": 1563967278.0,
                                    "replies": [
                                        {
                                            "body": "I have an app I am prepared to use that gives me a second phone number. And I've taken down the photos that can be found elsewhere.",
                                            "author": "prosecco_pour_1",
                                            "id": "eupz3qw",
                                            "parent_id": "t1_eupyys4",
                                            "score": 1,
                                            "created_utc": 1563967355.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Reading that gave me an actual chill. That is super scary and I am glad that you found this subreddit and that you are ok.",
            "author": "fairiesandhearts",
            "id": "euka1u8",
            "parent_id": "t3_cgdn0r",
            "score": 1,
            "created_utc": 1563885454.0,
            "replies": [
                {
                    "body": "Thankyou, I just joined a few weeks ago and have not met anyone yet but I’ve decided I will quit it for now maybe try again someday idk! I don’t feel it’s for me, this kind of danger is really not worth any relationship.",
                    "author": "tremendoyarna420",
                    "id": "eukeirj",
                    "parent_id": "t1_euka1u8",
                    "score": 1,
                    "created_utc": 1563887222.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "> Some people questioned why I chose to not reveal my real name , here you go guys , this is why!! \n\nI don't think any sane person here would recommend revealing personal details to someone you haven't met, nor does anyone really recommend travelling (flying) to a meet and greet.\n\nWhile some people do have challenges living in a rural area, both SBs and SDs should most often be sugaring local.",
            "author": "gingerdaddy56",
            "id": "eukciu8",
            "parent_id": "t3_cgdn0r",
            "score": 1,
            "created_utc": 1563886452.0,
            "replies": []
        },
        {
            "body": "Yeah smart girl, I didn’t even think about checking their linked in! I certainly will\nNow. I will make a fake LinkedIn to do the background checks!",
            "author": "tremendoyarna420",
            "id": "eugixp1",
            "parent_id": "t1_eugi7kt",
            "score": 9,
            "created_utc": 1563808787.0,
            "replies": [
                {
                    "body": "I’m so so happy you listened to our advice and decided to disengage sooner rather than later. We’ve read some horror stories on this sub where the person chose not to take advice given and ends up in a bad situation.\n\nThank you for updating us! Good luck sugaring 💗",
                    "author": "slinkyinthebag",
                    "id": "euhy4qy",
                    "parent_id": "t1_eugixp1",
                    "score": 8,
                    "created_utc": 1563836489.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "To snoop LinkedIn privately you need to be a premium member with your setting set to private.",
            "author": "LotBuilder",
            "id": "eugmiw9",
            "parent_id": "t1_eugi7kt",
            "score": 6,
            "created_utc": 1563810809.0,
            "replies": [
                {
                    "body": "You don't need to be premium for that. You can snoop privately but you don't get to see who has seen your profile",
                    "author": "ch1ps-ah0y",
                    "id": "eugp2fo",
                    "parent_id": "t1_eugmiw9",
                    "score": 14,
                    "created_utc": 1563812211.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I agree! I am never giving out a SD my real name and anyone who fusses over it better to be avoided. Why would older rich men with all the connections and money in the world be scared of a young girl hiding her identity.",
            "author": "tremendoyarna420",
            "id": "eugdotc",
            "parent_id": "t1_eugdjtp",
            "score": 26,
            "created_utc": 1563805770.0,
            "replies": [
                {
                    "body": "Exactly! And all of the concerns SDs here bring up concerning “what they’re risking” can all be solved with their money. Rich people have an insane amount of power, how they fuck do they think Epstein got away for this long? Acting like they don’t have the money and legal connections to scare the shit out of the scorned SB who wants to “hurt them”. They really think they’re as helpless as the young, financially struggling girl they’re talking to. Oh i wish I could afford to be that blissfully ignorant about what it is like to be a financially struggling young woman, knowing the cards are always stacked against you in the system of law.",
                    "author": "RussianAsshole",
                    "id": "eui2py9",
                    "parent_id": "t1_eugdotc",
                    "score": 13,
                    "created_utc": 1563839189.0,
                    "replies": []
                },
                {
                    "body": "That shit goes two ways.  The older wealthy married man has a lot to lose.  I have been blackmailed by a sugar baby.  I don't know her real name.  Never again.  Hotels and fake names and STD tests until real trust exists.",
                    "author": "stark_emerson",
                    "id": "euhlk7i",
                    "parent_id": "t1_eugdotc",
                    "score": 10,
                    "created_utc": 1563829560.0,
                    "replies": []
                },
                {
                    "body": ">Why would older rich men with all the connections and money in the world be scared of a young girl hiding her identity.\n\nBecause some people hide their identity to nefarious reasons and other are just doing to protect themselves.",
                    "author": "ruphun",
                    "id": "eugns7h",
                    "parent_id": "t1_eugdotc",
                    "score": 8,
                    "created_utc": 1563811507.0,
                    "replies": []
                },
                {
                    "body": ">Why would older rich men with all the connections and money in the world be scared of a young girl hiding her identity.\n\nuhhh...because they have all the money in the world and obviously have something\n\nto lose?\n\n&#x200B;\n\nA healthy SD/SB relationship is about mutual benefits, RESPECT, openness and honesty...hiding your identity shows you are not trustworthy and probably just out for your own agenda.\n\n&#x200B;\n\nYou sound naive and seem to think sugar daddies are stupid little old rich men waiting to be taken advantage of",
                    "author": "retiredsugardaddy",
                    "id": "euh5t99",
                    "parent_id": "t1_eugdotc",
                    "score": 4,
                    "created_utc": 1563821338.0,
                    "replies": []
                },
                {
                    "body": "I’m glad you avoided this pitfall, but I disagree on anonymity.   If you had screened him properly he wouldn’t be making ridiculous threats like being a Mossad agent or whatever.   \n\nYou shouldn’t just jump on a plane to meet anonymous strangers.  That is begging for trouble.   I’d advise avoiding any SD who won’t give you their personal info, work, and references.   You should know who the guy is if for nothing more than reading up on him for dinner conversation topics.    \n\nRegarding your personal info, assume they already have it.  Those “older rich men” don’t want to accidentally have dinner with a bunny boiling psychopath.   They will screen you.  I’d be wary of anyone who would meet you otherwise, and think you are backwards on your risk management plan.",
                    "author": "FlexEconGuy",
                    "id": "eugv46r",
                    "parent_id": "t1_eugdotc",
                    "score": 4,
                    "created_utc": 1563815457.0,
                    "replies": [
                        {
                            "body": "Not true. I dated high earning people with buildings literally named after them, who had no clue what my real name was. Being rich doesn't mean you're always hiring private investigators\n\nSick of people making rich guys seem like all knowing gods. They're horny men just like the rest of the SDs",
                            "author": "Chawkleeta",
                            "id": "euhrgl9",
                            "parent_id": "t1_eugv46r",
                            "score": 10,
                            "created_utc": 1563832740.0,
                            "replies": [
                                {
                                    "body": "Well... yeah.  Horny guys are horny guys.  That’s just not at all what I consider “sugar”.   \n\nI don’t know how anyone can look at your comment as anything other than transactional in context and in violation of the rules on this sub.",
                                    "author": "FlexEconGuy",
                                    "id": "eui1rmj",
                                    "parent_id": "t1_euhrgl9",
                                    "score": -4,
                                    "created_utc": 1563838625.0,
                                    "replies": [
                                        {
                                            "body": "I'm talking about screening and making SBs unnecessarily afraid to withhold their personal information just because a man is wealthy. \n\nMost of the time it's middle management level execs aka 'nobodies',  hiding their identities and demanding a girls personal info. \n\nHigh net worth men, at least here in NYC, are incredibly quick to invite you over to see their homes. And when they have \"fuck you\" money they don't hire investigators. They can just throw you off the roof or into the ocean.",
                                            "author": "Chawkleeta",
                                            "id": "eukm5qw",
                                            "parent_id": "t1_eui1rmj",
                                            "score": 3,
                                            "created_utc": 1563890208.0,
                                            "replies": [
                                                {
                                                    "body": "100% on the immediate home invitations.   Funny on the flying lessons.",
                                                    "author": "FlexEconGuy",
                                                    "id": "eukpp4b",
                                                    "parent_id": "t1_eukm5qw",
                                                    "score": 1,
                                                    "created_utc": 1563891564.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "I find your recommendation, well, interesting. At what point do you give out all this identifying personal information?  For me, anonymity is critical. And I am fine with the SB doing the same. I have to have real insight into a persons character before I would ever give identifying information to an SB.",
                            "author": null,
                            "id": "evstpyn",
                            "parent_id": "t1_eugv46r",
                            "score": 1,
                            "created_utc": 1564755973.0,
                            "replies": [
                                {
                                    "body": "I meet SBs in real life, so anonymity is almost impossible.   Also, I’m divorced.  There isn’t any spouse to hide things from.",
                                    "author": "FlexEconGuy",
                                    "id": "evsvh86",
                                    "parent_id": "t1_evstpyn",
                                    "score": 1,
                                    "created_utc": 1564757078.0,
                                    "replies": [
                                        {
                                            "body": "Well I meet SBs in real life too. In your opinion would the OP have been better off revealing her real information to this person who clearly intended to extort her?  I think that you, as a divorced person have less to lose than I do as a married man or the OP as a foreign student. I’m glad you can be so free with your info. Would you agree that that’s not true for everyone?",
                                            "author": null,
                                            "id": "evsw3wb",
                                            "parent_id": "t1_evsvh86",
                                            "score": 1,
                                            "created_utc": 1564757473.0,
                                            "replies": [
                                                {
                                                    "body": "Maybe.  I guess it depends on what type of city you live in.  But it would be pointless to try and hide your identity meeting people in a posh urban neighborhood where everyone is a 3rd degree from Kevin Bacon.",
                                                    "author": "FlexEconGuy",
                                                    "id": "evswlwp",
                                                    "parent_id": "t1_evsw3wb",
                                                    "score": 1,
                                                    "created_utc": 1564757786.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "A rich SD with connections is scared of stalking, harassment, violent outbursts, property damage and - in some cases - theft and extortion. I'd need to know who you really are before getting into a long-term SR. And, of course, I'd tell you who I am.\n\nThis anonymity thing is bizarre. If we are in a hotel together, clothes off, unless I lock my wallet and phone in the safe and unless you sleep with yours under your pillow and take them with you when you shower, it's trivial for either of us to figure out who the other is. Some people on this subreddit think the act of using a fake name is a magic talisman.",
                    "author": null,
                    "id": "eugxzum",
                    "parent_id": "t1_eugdotc",
                    "score": 0,
                    "created_utc": 1563817051.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Unless your henchmen put a black hood over SB's head and drive her to an undisclosed location, if she wants to figure out who you are, she will. Your license plates, registration, name at the hotel, mail at your house and more all bleed your personal info. This level of paranoia is bizarre. And how on earth do you establish trust if you don't know each others' names?",
            "author": null,
            "id": "eugx23i",
            "parent_id": "t1_eugdjtp",
            "score": 7,
            "created_utc": 1563816481.0,
            "replies": [
                {
                    "body": ">This level of paranoia is bizarre. And how on earth do you establish trust if you don't know each others' names?\n\nI agree. I understand wanting to be careful but...\n\n1. Privacy does not exist anymore. The internet cookies, marketing companies, Google, social media and all these geneaology tests record EVERYTHING you do. People can and will be able to find your info if they look hard enough.\n\n2. If you are highly paranoid to the point where you feel you can't ever disclose any true info about yourself, then don't sugar! Simple as that!",
                    "author": "lakoreanita",
                    "id": "eukok4q",
                    "parent_id": "t1_eugx23i",
                    "score": 3,
                    "created_utc": 1563891130.0,
                    "replies": []
                },
                {
                    "body": "I think anonymity is absolutely essential to safety until you get to know someone.  I have a plan to prevent someone finding out who I am for every one of the things you mention. Generally I get a sense of people at the M&G as to how trustworthy they are. But I usually won’t give personal information except real first name until during or after a first date. This OP did the right thing and why everyone can’t see how it obviously protected her from bad things is kinda weird.",
                    "author": null,
                    "id": "evsujx9",
                    "parent_id": "t1_eugx23i",
                    "score": 1,
                    "created_utc": 1564756496.0,
                    "replies": []
                },
                {
                    "body": ">This level of paranoia is bizarre. And, how on earth do you establish trust if you don't know each others' names?\n\nbecause she's up to no good",
                    "author": "retiredsugardaddy",
                    "id": "euh66iy",
                    "parent_id": "t1_eugx23i",
                    "score": 0,
                    "created_utc": 1563821530.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Agreed!!!!",
            "author": "Chawkleeta",
            "id": "euhr4z3",
            "parent_id": "t1_eugdjtp",
            "score": 2,
            "created_utc": 1563832563.0,
            "replies": []
        },
        {
            "body": "I don’t get this either. Ever? Really? You are willing to take off your clothes, have sex together, essentially be totally vulnerable together, yet you are worries about a name? If a SB is willing to have sex with me, without knowing my real name or knowing hers is a complete problem for me.",
            "author": "WCSD74",
            "id": "euh4cme",
            "parent_id": "t1_eugdjtp",
            "score": 1,
            "created_utc": 1563820579.0,
            "replies": [
                {
                    "body": "Totally agree!",
                    "author": "lakoreanita",
                    "id": "euknxb4",
                    "parent_id": "t1_euh4cme",
                    "score": 1,
                    "created_utc": 1563890873.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "This is exactly why many people on here recommend using photos that haven't ever been posted online before as your photos on SA",
            "author": "Particularsb",
            "id": "eugu0au",
            "parent_id": "t1_eugj8nb",
            "score": 18,
            "created_utc": 1563814858.0,
            "replies": [
                {
                    "body": "Lesson learned!",
                    "author": "prosecco_pour_1",
                    "id": "eugv4zw",
                    "parent_id": "t1_eugu0au",
                    "score": 2,
                    "created_utc": 1563815469.0,
                    "replies": []
                },
                {
                    "body": "But with facial recognition even if you haven't used the photograph before but there are other photographs of you online, they can come up in a reverse search. So maybe photoshop your eyes a little bigger and your nose a little smaller or vice versa.",
                    "author": "Xatness",
                    "id": "exk9p1m",
                    "parent_id": "t1_eugu0au",
                    "score": 1,
                    "created_utc": 1566380363.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Bang.  That’s the issue.  If you are on any social media at all it takes a toddler a few minutes to see who you are.   If you have zero historical social media use, and have never ever been tagged in a photo by a friend with any historical social media presence, it takes a decent skip tracer less than 24 hours.",
            "author": "FlexEconGuy",
            "id": "eugvmb6",
            "parent_id": "t1_eugj8nb",
            "score": 4,
            "created_utc": 1563815721.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "eups9za",
            "parent_id": "t1_eugj8nb",
            "score": 1,
            "created_utc": 1563963393.0,
            "replies": [
                {
                    "body": "We hadnt spoken/he had not messaged me. He favourited me and then added me to instagram. His user name was the same and so was the photo. \n\nUsually suggested friends are because you have them on Facebook,have their number, are following friends of friends. In my experience, anyways. Not the case with this guy.",
                    "author": "prosecco_pour_1",
                    "id": "eupysmb",
                    "parent_id": "t1_eups9za",
                    "score": 1,
                    "created_utc": 1563967175.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "eupyys4",
                            "parent_id": "t1_eupysmb",
                            "score": 1,
                            "created_utc": 1563967278.0,
                            "replies": [
                                {
                                    "body": "I have an app I am prepared to use that gives me a second phone number. And I've taken down the photos that can be found elsewhere.",
                                    "author": "prosecco_pour_1",
                                    "id": "eupz3qw",
                                    "parent_id": "t1_eupyys4",
                                    "score": 1,
                                    "created_utc": 1563967355.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Thankyou, I just joined a few weeks ago and have not met anyone yet but I’ve decided I will quit it for now maybe try again someday idk! I don’t feel it’s for me, this kind of danger is really not worth any relationship.",
            "author": "tremendoyarna420",
            "id": "eukeirj",
            "parent_id": "t1_euka1u8",
            "score": 1,
            "created_utc": 1563887222.0,
            "replies": []
        },
        {
            "body": "I’m so so happy you listened to our advice and decided to disengage sooner rather than later. We’ve read some horror stories on this sub where the person chose not to take advice given and ends up in a bad situation.\n\nThank you for updating us! Good luck sugaring 💗",
            "author": "slinkyinthebag",
            "id": "euhy4qy",
            "parent_id": "t1_eugixp1",
            "score": 8,
            "created_utc": 1563836489.0,
            "replies": []
        },
        {
            "body": "You don't need to be premium for that. You can snoop privately but you don't get to see who has seen your profile",
            "author": "ch1ps-ah0y",
            "id": "eugp2fo",
            "parent_id": "t1_eugmiw9",
            "score": 14,
            "created_utc": 1563812211.0,
            "replies": []
        },
        {
            "body": "Exactly! And all of the concerns SDs here bring up concerning “what they’re risking” can all be solved with their money. Rich people have an insane amount of power, how they fuck do they think Epstein got away for this long? Acting like they don’t have the money and legal connections to scare the shit out of the scorned SB who wants to “hurt them”. They really think they’re as helpless as the young, financially struggling girl they’re talking to. Oh i wish I could afford to be that blissfully ignorant about what it is like to be a financially struggling young woman, knowing the cards are always stacked against you in the system of law.",
            "author": "RussianAsshole",
            "id": "eui2py9",
            "parent_id": "t1_eugdotc",
            "score": 13,
            "created_utc": 1563839189.0,
            "replies": []
        },
        {
            "body": "That shit goes two ways.  The older wealthy married man has a lot to lose.  I have been blackmailed by a sugar baby.  I don't know her real name.  Never again.  Hotels and fake names and STD tests until real trust exists.",
            "author": "stark_emerson",
            "id": "euhlk7i",
            "parent_id": "t1_eugdotc",
            "score": 10,
            "created_utc": 1563829560.0,
            "replies": []
        },
        {
            "body": ">Why would older rich men with all the connections and money in the world be scared of a young girl hiding her identity.\n\nBecause some people hide their identity to nefarious reasons and other are just doing to protect themselves.",
            "author": "ruphun",
            "id": "eugns7h",
            "parent_id": "t1_eugdotc",
            "score": 8,
            "created_utc": 1563811507.0,
            "replies": []
        },
        {
            "body": ">Why would older rich men with all the connections and money in the world be scared of a young girl hiding her identity.\n\nuhhh...because they have all the money in the world and obviously have something\n\nto lose?\n\n&#x200B;\n\nA healthy SD/SB relationship is about mutual benefits, RESPECT, openness and honesty...hiding your identity shows you are not trustworthy and probably just out for your own agenda.\n\n&#x200B;\n\nYou sound naive and seem to think sugar daddies are stupid little old rich men waiting to be taken advantage of",
            "author": "retiredsugardaddy",
            "id": "euh5t99",
            "parent_id": "t1_eugdotc",
            "score": 4,
            "created_utc": 1563821338.0,
            "replies": []
        },
        {
            "body": "I’m glad you avoided this pitfall, but I disagree on anonymity.   If you had screened him properly he wouldn’t be making ridiculous threats like being a Mossad agent or whatever.   \n\nYou shouldn’t just jump on a plane to meet anonymous strangers.  That is begging for trouble.   I’d advise avoiding any SD who won’t give you their personal info, work, and references.   You should know who the guy is if for nothing more than reading up on him for dinner conversation topics.    \n\nRegarding your personal info, assume they already have it.  Those “older rich men” don’t want to accidentally have dinner with a bunny boiling psychopath.   They will screen you.  I’d be wary of anyone who would meet you otherwise, and think you are backwards on your risk management plan.",
            "author": "FlexEconGuy",
            "id": "eugv46r",
            "parent_id": "t1_eugdotc",
            "score": 4,
            "created_utc": 1563815457.0,
            "replies": [
                {
                    "body": "Not true. I dated high earning people with buildings literally named after them, who had no clue what my real name was. Being rich doesn't mean you're always hiring private investigators\n\nSick of people making rich guys seem like all knowing gods. They're horny men just like the rest of the SDs",
                    "author": "Chawkleeta",
                    "id": "euhrgl9",
                    "parent_id": "t1_eugv46r",
                    "score": 10,
                    "created_utc": 1563832740.0,
                    "replies": [
                        {
                            "body": "Well... yeah.  Horny guys are horny guys.  That’s just not at all what I consider “sugar”.   \n\nI don’t know how anyone can look at your comment as anything other than transactional in context and in violation of the rules on this sub.",
                            "author": "FlexEconGuy",
                            "id": "eui1rmj",
                            "parent_id": "t1_euhrgl9",
                            "score": -4,
                            "created_utc": 1563838625.0,
                            "replies": [
                                {
                                    "body": "I'm talking about screening and making SBs unnecessarily afraid to withhold their personal information just because a man is wealthy. \n\nMost of the time it's middle management level execs aka 'nobodies',  hiding their identities and demanding a girls personal info. \n\nHigh net worth men, at least here in NYC, are incredibly quick to invite you over to see their homes. And when they have \"fuck you\" money they don't hire investigators. They can just throw you off the roof or into the ocean.",
                                    "author": "Chawkleeta",
                                    "id": "eukm5qw",
                                    "parent_id": "t1_eui1rmj",
                                    "score": 3,
                                    "created_utc": 1563890208.0,
                                    "replies": [
                                        {
                                            "body": "100% on the immediate home invitations.   Funny on the flying lessons.",
                                            "author": "FlexEconGuy",
                                            "id": "eukpp4b",
                                            "parent_id": "t1_eukm5qw",
                                            "score": 1,
                                            "created_utc": 1563891564.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "I find your recommendation, well, interesting. At what point do you give out all this identifying personal information?  For me, anonymity is critical. And I am fine with the SB doing the same. I have to have real insight into a persons character before I would ever give identifying information to an SB.",
                    "author": null,
                    "id": "evstpyn",
                    "parent_id": "t1_eugv46r",
                    "score": 1,
                    "created_utc": 1564755973.0,
                    "replies": [
                        {
                            "body": "I meet SBs in real life, so anonymity is almost impossible.   Also, I’m divorced.  There isn’t any spouse to hide things from.",
                            "author": "FlexEconGuy",
                            "id": "evsvh86",
                            "parent_id": "t1_evstpyn",
                            "score": 1,
                            "created_utc": 1564757078.0,
                            "replies": [
                                {
                                    "body": "Well I meet SBs in real life too. In your opinion would the OP have been better off revealing her real information to this person who clearly intended to extort her?  I think that you, as a divorced person have less to lose than I do as a married man or the OP as a foreign student. I’m glad you can be so free with your info. Would you agree that that’s not true for everyone?",
                                    "author": null,
                                    "id": "evsw3wb",
                                    "parent_id": "t1_evsvh86",
                                    "score": 1,
                                    "created_utc": 1564757473.0,
                                    "replies": [
                                        {
                                            "body": "Maybe.  I guess it depends on what type of city you live in.  But it would be pointless to try and hide your identity meeting people in a posh urban neighborhood where everyone is a 3rd degree from Kevin Bacon.",
                                            "author": "FlexEconGuy",
                                            "id": "evswlwp",
                                            "parent_id": "t1_evsw3wb",
                                            "score": 1,
                                            "created_utc": 1564757786.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "A rich SD with connections is scared of stalking, harassment, violent outbursts, property damage and - in some cases - theft and extortion. I'd need to know who you really are before getting into a long-term SR. And, of course, I'd tell you who I am.\n\nThis anonymity thing is bizarre. If we are in a hotel together, clothes off, unless I lock my wallet and phone in the safe and unless you sleep with yours under your pillow and take them with you when you shower, it's trivial for either of us to figure out who the other is. Some people on this subreddit think the act of using a fake name is a magic talisman.",
            "author": null,
            "id": "eugxzum",
            "parent_id": "t1_eugdotc",
            "score": 0,
            "created_utc": 1563817051.0,
            "replies": []
        },
        {
            "body": ">This level of paranoia is bizarre. And how on earth do you establish trust if you don't know each others' names?\n\nI agree. I understand wanting to be careful but...\n\n1. Privacy does not exist anymore. The internet cookies, marketing companies, Google, social media and all these geneaology tests record EVERYTHING you do. People can and will be able to find your info if they look hard enough.\n\n2. If you are highly paranoid to the point where you feel you can't ever disclose any true info about yourself, then don't sugar! Simple as that!",
            "author": "lakoreanita",
            "id": "eukok4q",
            "parent_id": "t1_eugx23i",
            "score": 3,
            "created_utc": 1563891130.0,
            "replies": []
        },
        {
            "body": "I think anonymity is absolutely essential to safety until you get to know someone.  I have a plan to prevent someone finding out who I am for every one of the things you mention. Generally I get a sense of people at the M&G as to how trustworthy they are. But I usually won’t give personal information except real first name until during or after a first date. This OP did the right thing and why everyone can’t see how it obviously protected her from bad things is kinda weird.",
            "author": null,
            "id": "evsujx9",
            "parent_id": "t1_eugx23i",
            "score": 1,
            "created_utc": 1564756496.0,
            "replies": []
        },
        {
            "body": ">This level of paranoia is bizarre. And, how on earth do you establish trust if you don't know each others' names?\n\nbecause she's up to no good",
            "author": "retiredsugardaddy",
            "id": "euh66iy",
            "parent_id": "t1_eugx23i",
            "score": 0,
            "created_utc": 1563821530.0,
            "replies": []
        },
        {
            "body": "Totally agree!",
            "author": "lakoreanita",
            "id": "euknxb4",
            "parent_id": "t1_euh4cme",
            "score": 1,
            "created_utc": 1563890873.0,
            "replies": []
        },
        {
            "body": "Lesson learned!",
            "author": "prosecco_pour_1",
            "id": "eugv4zw",
            "parent_id": "t1_eugu0au",
            "score": 2,
            "created_utc": 1563815469.0,
            "replies": []
        },
        {
            "body": "But with facial recognition even if you haven't used the photograph before but there are other photographs of you online, they can come up in a reverse search. So maybe photoshop your eyes a little bigger and your nose a little smaller or vice versa.",
            "author": "Xatness",
            "id": "exk9p1m",
            "parent_id": "t1_eugu0au",
            "score": 1,
            "created_utc": 1566380363.0,
            "replies": []
        },
        {
            "body": "We hadnt spoken/he had not messaged me. He favourited me and then added me to instagram. His user name was the same and so was the photo. \n\nUsually suggested friends are because you have them on Facebook,have their number, are following friends of friends. In my experience, anyways. Not the case with this guy.",
            "author": "prosecco_pour_1",
            "id": "eupysmb",
            "parent_id": "t1_eups9za",
            "score": 1,
            "created_utc": 1563967175.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "eupyys4",
                    "parent_id": "t1_eupysmb",
                    "score": 1,
                    "created_utc": 1563967278.0,
                    "replies": [
                        {
                            "body": "I have an app I am prepared to use that gives me a second phone number. And I've taken down the photos that can be found elsewhere.",
                            "author": "prosecco_pour_1",
                            "id": "eupz3qw",
                            "parent_id": "t1_eupyys4",
                            "score": 1,
                            "created_utc": 1563967355.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Not true. I dated high earning people with buildings literally named after them, who had no clue what my real name was. Being rich doesn't mean you're always hiring private investigators\n\nSick of people making rich guys seem like all knowing gods. They're horny men just like the rest of the SDs",
            "author": "Chawkleeta",
            "id": "euhrgl9",
            "parent_id": "t1_eugv46r",
            "score": 10,
            "created_utc": 1563832740.0,
            "replies": [
                {
                    "body": "Well... yeah.  Horny guys are horny guys.  That’s just not at all what I consider “sugar”.   \n\nI don’t know how anyone can look at your comment as anything other than transactional in context and in violation of the rules on this sub.",
                    "author": "FlexEconGuy",
                    "id": "eui1rmj",
                    "parent_id": "t1_euhrgl9",
                    "score": -4,
                    "created_utc": 1563838625.0,
                    "replies": [
                        {
                            "body": "I'm talking about screening and making SBs unnecessarily afraid to withhold their personal information just because a man is wealthy. \n\nMost of the time it's middle management level execs aka 'nobodies',  hiding their identities and demanding a girls personal info. \n\nHigh net worth men, at least here in NYC, are incredibly quick to invite you over to see their homes. And when they have \"fuck you\" money they don't hire investigators. They can just throw you off the roof or into the ocean.",
                            "author": "Chawkleeta",
                            "id": "eukm5qw",
                            "parent_id": "t1_eui1rmj",
                            "score": 3,
                            "created_utc": 1563890208.0,
                            "replies": [
                                {
                                    "body": "100% on the immediate home invitations.   Funny on the flying lessons.",
                                    "author": "FlexEconGuy",
                                    "id": "eukpp4b",
                                    "parent_id": "t1_eukm5qw",
                                    "score": 1,
                                    "created_utc": 1563891564.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I find your recommendation, well, interesting. At what point do you give out all this identifying personal information?  For me, anonymity is critical. And I am fine with the SB doing the same. I have to have real insight into a persons character before I would ever give identifying information to an SB.",
            "author": null,
            "id": "evstpyn",
            "parent_id": "t1_eugv46r",
            "score": 1,
            "created_utc": 1564755973.0,
            "replies": [
                {
                    "body": "I meet SBs in real life, so anonymity is almost impossible.   Also, I’m divorced.  There isn’t any spouse to hide things from.",
                    "author": "FlexEconGuy",
                    "id": "evsvh86",
                    "parent_id": "t1_evstpyn",
                    "score": 1,
                    "created_utc": 1564757078.0,
                    "replies": [
                        {
                            "body": "Well I meet SBs in real life too. In your opinion would the OP have been better off revealing her real information to this person who clearly intended to extort her?  I think that you, as a divorced person have less to lose than I do as a married man or the OP as a foreign student. I’m glad you can be so free with your info. Would you agree that that’s not true for everyone?",
                            "author": null,
                            "id": "evsw3wb",
                            "parent_id": "t1_evsvh86",
                            "score": 1,
                            "created_utc": 1564757473.0,
                            "replies": [
                                {
                                    "body": "Maybe.  I guess it depends on what type of city you live in.  But it would be pointless to try and hide your identity meeting people in a posh urban neighborhood where everyone is a 3rd degree from Kevin Bacon.",
                                    "author": "FlexEconGuy",
                                    "id": "evswlwp",
                                    "parent_id": "t1_evsw3wb",
                                    "score": 1,
                                    "created_utc": 1564757786.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "eupyys4",
            "parent_id": "t1_eupysmb",
            "score": 1,
            "created_utc": 1563967278.0,
            "replies": [
                {
                    "body": "I have an app I am prepared to use that gives me a second phone number. And I've taken down the photos that can be found elsewhere.",
                    "author": "prosecco_pour_1",
                    "id": "eupz3qw",
                    "parent_id": "t1_eupyys4",
                    "score": 1,
                    "created_utc": 1563967355.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Well... yeah.  Horny guys are horny guys.  That’s just not at all what I consider “sugar”.   \n\nI don’t know how anyone can look at your comment as anything other than transactional in context and in violation of the rules on this sub.",
            "author": "FlexEconGuy",
            "id": "eui1rmj",
            "parent_id": "t1_euhrgl9",
            "score": -4,
            "created_utc": 1563838625.0,
            "replies": [
                {
                    "body": "I'm talking about screening and making SBs unnecessarily afraid to withhold their personal information just because a man is wealthy. \n\nMost of the time it's middle management level execs aka 'nobodies',  hiding their identities and demanding a girls personal info. \n\nHigh net worth men, at least here in NYC, are incredibly quick to invite you over to see their homes. And when they have \"fuck you\" money they don't hire investigators. They can just throw you off the roof or into the ocean.",
                    "author": "Chawkleeta",
                    "id": "eukm5qw",
                    "parent_id": "t1_eui1rmj",
                    "score": 3,
                    "created_utc": 1563890208.0,
                    "replies": [
                        {
                            "body": "100% on the immediate home invitations.   Funny on the flying lessons.",
                            "author": "FlexEconGuy",
                            "id": "eukpp4b",
                            "parent_id": "t1_eukm5qw",
                            "score": 1,
                            "created_utc": 1563891564.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I meet SBs in real life, so anonymity is almost impossible.   Also, I’m divorced.  There isn’t any spouse to hide things from.",
            "author": "FlexEconGuy",
            "id": "evsvh86",
            "parent_id": "t1_evstpyn",
            "score": 1,
            "created_utc": 1564757078.0,
            "replies": [
                {
                    "body": "Well I meet SBs in real life too. In your opinion would the OP have been better off revealing her real information to this person who clearly intended to extort her?  I think that you, as a divorced person have less to lose than I do as a married man or the OP as a foreign student. I’m glad you can be so free with your info. Would you agree that that’s not true for everyone?",
                    "author": null,
                    "id": "evsw3wb",
                    "parent_id": "t1_evsvh86",
                    "score": 1,
                    "created_utc": 1564757473.0,
                    "replies": [
                        {
                            "body": "Maybe.  I guess it depends on what type of city you live in.  But it would be pointless to try and hide your identity meeting people in a posh urban neighborhood where everyone is a 3rd degree from Kevin Bacon.",
                            "author": "FlexEconGuy",
                            "id": "evswlwp",
                            "parent_id": "t1_evsw3wb",
                            "score": 1,
                            "created_utc": 1564757786.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I have an app I am prepared to use that gives me a second phone number. And I've taken down the photos that can be found elsewhere.",
            "author": "prosecco_pour_1",
            "id": "eupz3qw",
            "parent_id": "t1_eupyys4",
            "score": 1,
            "created_utc": 1563967355.0,
            "replies": []
        },
        {
            "body": "I'm talking about screening and making SBs unnecessarily afraid to withhold their personal information just because a man is wealthy. \n\nMost of the time it's middle management level execs aka 'nobodies',  hiding their identities and demanding a girls personal info. \n\nHigh net worth men, at least here in NYC, are incredibly quick to invite you over to see their homes. And when they have \"fuck you\" money they don't hire investigators. They can just throw you off the roof or into the ocean.",
            "author": "Chawkleeta",
            "id": "eukm5qw",
            "parent_id": "t1_eui1rmj",
            "score": 3,
            "created_utc": 1563890208.0,
            "replies": [
                {
                    "body": "100% on the immediate home invitations.   Funny on the flying lessons.",
                    "author": "FlexEconGuy",
                    "id": "eukpp4b",
                    "parent_id": "t1_eukm5qw",
                    "score": 1,
                    "created_utc": 1563891564.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Well I meet SBs in real life too. In your opinion would the OP have been better off revealing her real information to this person who clearly intended to extort her?  I think that you, as a divorced person have less to lose than I do as a married man or the OP as a foreign student. I’m glad you can be so free with your info. Would you agree that that’s not true for everyone?",
            "author": null,
            "id": "evsw3wb",
            "parent_id": "t1_evsvh86",
            "score": 1,
            "created_utc": 1564757473.0,
            "replies": [
                {
                    "body": "Maybe.  I guess it depends on what type of city you live in.  But it would be pointless to try and hide your identity meeting people in a posh urban neighborhood where everyone is a 3rd degree from Kevin Bacon.",
                    "author": "FlexEconGuy",
                    "id": "evswlwp",
                    "parent_id": "t1_evsw3wb",
                    "score": 1,
                    "created_utc": 1564757786.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "100% on the immediate home invitations.   Funny on the flying lessons.",
            "author": "FlexEconGuy",
            "id": "eukpp4b",
            "parent_id": "t1_eukm5qw",
            "score": 1,
            "created_utc": 1563891564.0,
            "replies": []
        },
        {
            "body": "Maybe.  I guess it depends on what type of city you live in.  But it would be pointless to try and hide your identity meeting people in a posh urban neighborhood where everyone is a 3rd degree from Kevin Bacon.",
            "author": "FlexEconGuy",
            "id": "evswlwp",
            "parent_id": "t1_evsw3wb",
            "score": 1,
            "created_utc": 1564757786.0,
            "replies": []
        }
    ]
}