{
    "title": "This isn’t a job, but I expect the best service",
    "post_id": "hgbost",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/hgbost/this_isnt_a_job_but_i_expect_the_best_service/",
    "author": "SomethingSweet_x0",
    "body": "**Preface**: no I’m not stating that sugaring is a legitimate job or should ever qualify as actual employment - before anyone tries to claim that in the comments. \n\nI wanted to comment on a common trope I’ve been recently seeing a lot of on this sub, that goes to the tune of “this shouldn’t feel like work” or “don’t compare this to work, it’s a relationship”. And on the surface- I 100% agree. The last thing I’d want, is to feel like I’m “working” or that sugaring is emotionally draining. Frankly I only engage in SRs that feel enjoyable and don't seem like a chore through meticulous vetting and being incredibly picky. However, not all, but some SDs who I’ve seen preach this idea, also seem to have a very low threshold of what **they** would tolerate from a SB. We have all seen the comments on posts telling other SDs “*dump her!*” or “*sounds like you’ll have to put in a lot of work with that SB, red flag*”. Due to the over-saturation and availability of SBs, they become somewhat “dispensable” to a degree. This rhetoric of “*you shouldn’t look at our relationship as a job, however I will let you go when you aren’t meeting my expectations of service*” seems to almost contradict their request for a “genuine connection”. And yes I used the word “service” intentionally. Do not lie to yourself that the sugar you are providing is to get the good, the bad, and the ugly sides of a SB. Your sugar is meant for the good sides only, and if the slightest hint of a bad trait shows up- They are replaced, reinforcing that you have an expectation of conduct and a SB needs to act accordingly...almost like job. \n\n“*But SomethingSweet, this is a two-way street. My sb can just as easily leave me too if she's not satisfied*”, that is correct. But the message that SBs are conveyed is that “*he’s giving you sugar so you* ***should*** *tolerate more than what you might in other circumstances (ex. vanilla relationship)*”. That is the exact opposite of the messages SDs get. SDs are told, *“if she isn’t living up to your expectation of what you believe your money can get you; start searching for another SB*”. This threat of being replaced only magnifies a SB to feel a pressure to continue to provide this “perfect experience”. It seems almost obvious that someone would feel that the effort they are putting into being *their best self* at all times for their SD, can almost start to feel like work. This isn’t to say that this dynamic should be *different* or changed, it works and is necessary in this subset of relationships to continue.  However the dialogue of “*stop comparing this perfect experience you are giving me to anything remotely like a job*” seems a little absurd for SDs to get riled up about. It’s comical when I hear the same SDs who complain about wanting this “real connection” that includes unlimited passion, mind blowing intimacy, enlightening conversations; are also the ones who can’t fathom why an SB would feel like meeting this standard can feel like a job....especially a job they can lose with all the competition, I mean - more “real” connections, readily available. \n\n**Clarification**\\- this rant is more directed to the specific SDs who get offended when an SB acknowledges or even would appreciate recognition for the amount of effort (and at times, work) they are putting into the SR to keep it as drama-free and as fun as possible. SDs who generously support their SBs and treat them like gold even when they’re imperfect- we see you, we love you, and you are appreciated 💕",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/hgbost/this_isnt_a_job_but_i_expect_the_best_service/",
    "score": 113,
    "upvote_ratio": 0.91,
    "created_utc": 1593191701.0,
    "num_comments": 87,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "MOOD AS FUCK! Often some SD's forget the amount of work it takes to simply get READY! Some SB's spend a full day getting ready out of sheer terror to make sure they look good!",
            "author": "Ipatchcat",
            "id": "fw30dg7",
            "parent_id": "t3_hgbost",
            "score": 69,
            "created_utc": 1593193094.0,
            "replies": [
                {
                    "body": "Right?! Or even just the fact that we essentially have to “check our baggage at the door” regardless of what’s going on in our own personal lives. I get it- it’s why there’s sugar. There’s no denial and I completely accept it too. But for some of these SDs to just assume us SBs are always a 10/10 mood and dressed to the nines is delusional...yet god forbid we slip up and let this facade show and there’s a post about us on SLF about how “we’re such drama” or “not showing effort anymore” 😂😂",
                    "author": "SomethingSweet_x0",
                    "id": "fw31k7t",
                    "parent_id": "t1_fw30dg7",
                    "score": 33,
                    "created_utc": 1593193654.0,
                    "replies": []
                },
                {
                    "body": "Absolutely! This ^^^!!! Certainly not out of terror but out of that I have a very high standard for myself and my appearance and I prefer not casting my pearls before swine as it were.",
                    "author": "testing1to3",
                    "id": "fw34jbb",
                    "parent_id": "t1_fw30dg7",
                    "score": 11,
                    "created_utc": 1593195060.0,
                    "replies": []
                },
                {
                    "body": "One of my SBs has a process to get her mind ready to really get down.  She takes a bath, has a full skin care routine, gets a blow out, puts on sexy lingerie underneath her outfit.  It’s a half day thing.  She has to feel a certain way to completely let loose.  Then she walks into the restaurant and you can see in her eyes that she’s feeling herself as every head in the place turns.",
                    "author": "LotBuilder",
                    "id": "fw3f5n2",
                    "parent_id": "t1_fw30dg7",
                    "score": 15,
                    "created_utc": 1593200209.0,
                    "replies": [
                        {
                            "body": "Exactly!",
                            "author": "testing1to3",
                            "id": "fw3hbmm",
                            "parent_id": "t1_fw3f5n2",
                            "score": 3,
                            "created_utc": 1593201293.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "when my former SB came to our date all dolled up, then broke down crying in front of me bc she just got fired a few hours ago...\n\nI just held her for a good long while.   \n\nAnd then I told her I was amazed and astounded she still came to the date so dolled up, and thanked her 3 or 4 times.  \n\nOne of my best dates of all time and always will be, vanilla or otherwise.  \n\nYou don't have to fit the \"SB Standard formula\" w me, yes its sugar, but so what.  Compassion and humility is sexy af no matter what you're doing.",
                    "author": "Gemini-Fox",
                    "id": "fw3ivze",
                    "parent_id": "t1_fw30dg7",
                    "score": 16,
                    "created_utc": 1593202090.0,
                    "replies": []
                },
                {
                    "body": "Im sure not all men are like me but I put a significant amount of time and money in my appearance on top of everything I do to earn my income.",
                    "author": "saltgrindr",
                    "id": "fw31rmy",
                    "parent_id": "t1_fw30dg7",
                    "score": 10,
                    "created_utc": 1593193750.0,
                    "replies": [
                        {
                            "body": "AMEN to you! There’s been plenty of SDs I’ve met who I’ve actually questioned whether they were wearing clean clothes before coming to a m&g.",
                            "author": "SomethingSweet_x0",
                            "id": "fw34olf",
                            "parent_id": "t1_fw31rmy",
                            "score": 15,
                            "created_utc": 1593195130.0,
                            "replies": [
                                {
                                    "body": ">I’ve actually questioned whether they were wearing clean clothes\n\nBet that put a damper on the mood.",
                                    "author": "TY2022",
                                    "id": "fw3j8pz",
                                    "parent_id": "t1_fw34olf",
                                    "score": 5,
                                    "created_utc": 1593202273.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "You may over estimate what it takes. I have enjoyed my SBs well decked up as well as in their casual clothes, in good moods or not so good moods. Those are often not the problem. The problem is the ATM mentality, lack of respect, lack of punctuality, the incessant flaking, the lying and endless pursuit of other SDs, even something as trivial as constantly checking the phone, the pseudo “oh my phone broke” ghosting are bigger pet peeves than make up or lack therof.",
                    "author": null,
                    "id": "fw3kp85",
                    "parent_id": "t1_fw30dg7",
                    "score": 3,
                    "created_utc": 1593203017.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "“It’s not a job, but it is work.”\n\nThat’s my response to salt.\nNutshell:\nOne wants good grades, they have to WORK at it.\nOne wants to be a great parent, they have to WORK at it.\nOne wants to be successful in business, they have to WORK at it.\nOne wants to be a great friend, they have to WORK at it.\nOne wants a good SR, they have to WORK at it.\nSo yeah...work is definitely involved.😎💋",
            "author": "SunnyWinter85",
            "id": "fw38vzn",
            "parent_id": "t3_hgbost",
            "score": 31,
            "created_utc": 1593197148.0,
            "replies": [
                {
                    "body": "Couldn’t agree more!",
                    "author": "SomethingSweet_x0",
                    "id": "fw39vw4",
                    "parent_id": "t1_fw38vzn",
                    "score": 7,
                    "created_utc": 1593197621.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "There’s a lot of salt coming out of the woodworks here in the comments here, just goes to prove your point. We can’t have good, reasonable posts directed at a certain demographic without hearing an outcry of “what about meeee?” Those people who are counting every favor and gesture towards some arbitrary score for a SB are the same ones who go on and on about how it’s not “transactional” as long as the relationship is all about meeting their needs first. Like I’ve seen some shallow stuff from SB’s and that’s equally distasteful. But somehow penny pinching with your wallet is supposed to be “careful,” “reasonable,” and “good sense,” but start enforcing boundaries about your body and time and suddenly you’re the reason for a SR to get next’ed.",
            "author": "BunsGoSquish",
            "id": "fw34zo6",
            "parent_id": "t3_hgbost",
            "score": 45,
            "created_utc": 1593195274.0,
            "replies": [
                {
                    "body": "😂😂I tried my hardest to make it clear that it’s SOME not ALL. I have met plenty of real SDs that I can be 100% authentically myself and thus a more genuine SR occurs. But my lorrrdddd so much hypocrisy about how SRs should be “easy/carefree” yet if I actually stopped trying so I could experience something “easy” too- I’d get a lecture about how our needs aren’t aligned. \n\nAnd before anyone comes at me- I’d never stop trying for an SD that puts in as much effort, not only through monetary contributions, as I do. We want mutual up in this SR 😂",
                    "author": "SomethingSweet_x0",
                    "id": "fw36ugb",
                    "parent_id": "t1_fw34zo6",
                    "score": 19,
                    "created_utc": 1593196164.0,
                    "replies": [
                        {
                            "body": "Don't spend a second worrying about what anyone says about you or your thesis.  Only one aspect is risk-free: someone will disagree with you.",
                            "author": "TY2022",
                            "id": "fw3jii8",
                            "parent_id": "t1_fw36ugb",
                            "score": 7,
                            "created_utc": 1593202413.0,
                            "replies": [
                                {
                                    "body": "Oh trust me, I expected to make some waves!",
                                    "author": "SomethingSweet_x0",
                                    "id": "fw4dvk4",
                                    "parent_id": "t1_fw3jii8",
                                    "score": 2,
                                    "created_utc": 1593218886.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "If you have met good SDs try to talk about them vs bashing the bad one’s. There are always going to be the bad and rotten apples in a huge basket. We accept that as SDs.",
                            "author": null,
                            "id": "fw3l1vq",
                            "parent_id": "t1_fw36ugb",
                            "score": -7,
                            "created_utc": 1593203196.0,
                            "replies": [
                                {
                                    "body": "People bash bad SBs and bad SDs all the time. The question here is: why are you mad at this post?",
                                    "author": "AfroBabySugg",
                                    "id": "fw3ny5x",
                                    "parent_id": "t1_fw3l1vq",
                                    "score": 9,
                                    "created_utc": 1593204672.0,
                                    "replies": [
                                        {
                                            "body": "Why do you think?",
                                            "author": null,
                                            "id": "fw4gvk6",
                                            "parent_id": "t1_fw3ny5x",
                                            "score": -3,
                                            "created_utc": 1593220720.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Well said. 👏🏻",
            "author": "pumpkinspicedcream",
            "id": "fw31eww",
            "parent_id": "t3_hgbost",
            "score": 11,
            "created_utc": 1593193587.0,
            "replies": []
        },
        {
            "body": "IMO an SD should also be putting in effort to be the best version of themselves for their SB. That's dating - vanilla or sugar. When I'm going to see an SB I make sure to look my best, be clean, well dressed, and wear nice cologne. If she's coming over I'll make an extra effort to get the house tidy and clean. I'll put time and thought into finding a nice place for us to eat or getting the right bottle of wine. I'll go out of my way to be responsive to texts and calls and keep any commitment I make. I put a lot of effort into gifts that show my genuine interest in her as a person. I treat any woman I'm dating, vanilla or sugar, with more care and empathy than I'd treat almost anyone else in my life. Again that's dating. To me an SR should be similar to a vanilla relationship in that both partners should put their best foot forward for the other person, at least at first. As you get comfortable with each other some of that facade begins to slip and that's when you figure out if there is really a deep connection or if you were into the idealized version of the person they presented on the first few dates. But that effort doesn't make it a job even if there is a financial support component. \n\nUsually by putting your best foot forward yourself and making it clear you are not asking for perfection, you can find a connection if there is any chemistry. If a POT can't get over feeling the need to live up to unattainable standards and still views this as a job we just aren't a good fit. No hard feelings.",
            "author": "canavatar12",
            "id": "fw37t0t",
            "parent_id": "t3_hgbost",
            "score": 22,
            "created_utc": 1593196625.0,
            "replies": [
                {
                    "body": "That sounds like SRs I’ve had and frankly how all of them should present themselves. Sadly I think there is a bit of “entitlement” that goes on where an SD has soooo many to pick from that there is little tolerance for when an expectation is not fully met, almost creating this sense that you (an Sb) CANNOT mess up or you’ll be replaced. Granted, I’ve never felt it to that great of an extent- but that’s just sometimes the messages that get presented on this forum. It’s wonderful seeing someone who values themselves and their sbs so highly- your Sb is a lucky gal 🥰",
                    "author": "SomethingSweet_x0",
                    "id": "fw39e8t",
                    "parent_id": "t1_fw37t0t",
                    "score": 12,
                    "created_utc": 1593197387.0,
                    "replies": [
                        {
                            "body": "Very true, there are people in any environment who are totally full of themselves and think they are entitled to perfection for what little they put in. Best to just avoid those people.\n\nAs far as there being so many to pick from, ratio aside, I can say from experience it takes a lot of time and effort to find someone who is a good fit. Sometimes I think SBs psyche themselves out by looking at all the other beautiful women on SA. Just remember, half of them never respond and most of the ones who do are unable to hold an adult conversation or have no intention of meeting up. You might be replaceable but you aren't easily replaceable.",
                            "author": "canavatar12",
                            "id": "fw3bfnp",
                            "parent_id": "t1_fw39e8t",
                            "score": 5,
                            "created_utc": 1593198368.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Great post!",
            "author": "champagne-tits",
            "id": "fw34t4h",
            "parent_id": "t3_hgbost",
            "score": 7,
            "created_utc": 1593195189.0,
            "replies": []
        },
        {
            "body": "And It’s actually funny because the most demanding they are, the less they bring to the table. It’s often the salt daddy with their 3 figures MONTHLY allowance that are the most delusional",
            "author": "Lilipuss25",
            "id": "fw45enm",
            "parent_id": "t3_hgbost",
            "score": 5,
            "created_utc": 1593213913.0,
            "replies": [
                {
                    "body": "Oh you know it! I had one guy insist that wear stockings in 90 degree weather to eat OUTSIDE. I showed up looking great sans the stockings because Um it was the middle of summer and that just doesnt even go with the season and he had the audacity to question my “ability” to be a good Sb. “But somethingsweet don’t you want to impress me?!” Me: yeah which is why I spent two hours getting ready to look wonderful and not have thigh sweat from damn near overheating in stockings! He was an immediate next",
                    "author": "SomethingSweet_x0",
                    "id": "fw4h77f",
                    "parent_id": "t1_fw45enm",
                    "score": 3,
                    "created_utc": 1593220919.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I expect no courtesy from my sugar relationship partners that I am not willing to provide myself.\n\nHealthy relationships require equal, respectful partners.\n\nI totally appreciate your frustration, and dislike the hypocrisy you are describing.\n\nIt comes down, as always, to finding the right partner... which is never easy, no matter which side of the sugar aisle you are on.",
            "author": "GDarn",
            "id": "fw37uar",
            "parent_id": "t3_hgbost",
            "score": 8,
            "created_utc": 1593196642.0,
            "replies": [
                {
                    "body": "Completely agree! I am lucky to say I’ve never felt like my SR is a job or that I couldn’t be authentic to myself- but it’s just more and more apparent that some of the “SDs” on this sub have an expectation that perfection is a requirement for an SR to continue or else you just dump and move on. You certainly don’t sound like one of those guys and for that we thank you 😊",
                    "author": "SomethingSweet_x0",
                    "id": "fw39ots",
                    "parent_id": "t1_fw37uar",
                    "score": 7,
                    "created_utc": 1593197526.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "fw3acmg",
            "parent_id": "t3_hgbost",
            "score": 3,
            "created_utc": 1593197846.0,
            "replies": [
                {
                    "body": "Yep. It’s a double edged sword. On one hand we want to be authentic and show all of our sides to form a legitimate connection, however there is that little voice in our heads that tell us “uh oh if he doesn’t see you as flawless he will pick another girl that can keep up that image”. This whole lifestyle is complicated",
                    "author": "SomethingSweet_x0",
                    "id": "fw3aypv",
                    "parent_id": "t1_fw3acmg",
                    "score": 6,
                    "created_utc": 1593198141.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "fw3gkip",
                            "parent_id": "t1_fw3aypv",
                            "score": 2,
                            "created_utc": 1593200914.0,
                            "replies": [
                                {
                                    "body": "For me personally, I move away from ppm as soon as possible. Having just one amount or allowance totally gets rid of that notion that this date can “cost” this much whereas another date should cost something else",
                                    "author": "SomethingSweet_x0",
                                    "id": "fw3hkkv",
                                    "parent_id": "t1_fw3gkip",
                                    "score": 3,
                                    "created_utc": 1593201419.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I think ultimately the issue is, in the sex economy, women have traditionally maintain the upper hand in almost all respects...\n\n...except in real sugar dating. Suddenly the script is flipped and I think it is difficult to adjust to that. \n\nAll you complain about is true for both parties, generally. Though I admit some men are going to spend more to avoid having to deal with them. Plus it's true of dating in the wild, except that's far less lucrative and men are more desperate.\n\nIt's an interesting perspective tho. I think both SBs and SDs can be more appreciative of what each does to maintain interest and the relationship.",
            "author": "otherwise-sorbet03",
            "id": "fw343a4",
            "parent_id": "t3_hgbost",
            "score": 14,
            "created_utc": 1593194848.0,
            "replies": [
                {
                    "body": "Couldn’t say it better myself. The SRs I’ve had have been nothing but wonderful. We both appreciate one another and can always be candid about our genuine feelings or thoughts. I think my rant was less about personal experiences and more so about some of the comments/posts I read on this sub perpetuating this paradigm- yet no one is just calling it out",
                    "author": "SomethingSweet_x0",
                    "id": "fw35974",
                    "parent_id": "t1_fw343a4",
                    "score": 2,
                    "created_utc": 1593195403.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Thank you for opening up this discussion. \n\nI have this gut feeling that the SBs/SDs that have compatible personalities get distracted by the beauty and dollars. As a result, your profile on SA is treated like a job application: the SD filters and ranks based on profile details, and the SBs are on a waiting list or in a vetting process. If the SB fails the vetting process, they join the waiting list again for multiple SDs. According to Brandon Wade, the seeking/waiting process can take a year before finding something real and meaningful.\n\nI have 11 months to go I guess.\n\nI encourage SBs —who feel like they’re jaded by the sugar experience, to keep improving yourself for your own self-esteem and work your buns off at any creative project/job that you can do. Let SA and sugaring be a hobby if you wish to eventually find the person without feeling the need to be pretentious/treat sugaring as a job you need.",
            "author": "BeautyGr8ce",
            "id": "fw3kv8l",
            "parent_id": "t3_hgbost",
            "score": 6,
            "created_utc": 1593203103.0,
            "replies": [
                {
                    "body": "100% agree with this. And don’t get me wrong, SBs can judge too- it’s all part of the lifestyle. I’m blessed to have met such great SDs that it has allowed me to not get so jaded",
                    "author": "SomethingSweet_x0",
                    "id": "fw4eal3",
                    "parent_id": "t1_fw3kv8l",
                    "score": 3,
                    "created_utc": 1593219137.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "So as someone who's looking to be SB what should I do? I enjoy the idea of putting effort  into how I look and behave for the sake of someone else is satisfying and arousing but only to an extent. When a partner is understanding when I'm tired or I simply can't be that way at the moment that makes me want to be even better later on. \nAgain, I have never been a SB. I have looked into the lifestyle and done some research but I haven't really interacted with other's in the lifestyle. This isn't the same as trying to form a normal relationship so how do I approach finding the right sugar partner...?",
            "author": "TheClearHaribo",
            "id": "fw44h7c",
            "parent_id": "t3_hgbost",
            "score": 3,
            "created_utc": 1593213384.0,
            "replies": [
                {
                    "body": "I can’t really speak for all SRs. My one piece of advice would be to find someone who wants what you want. I know I just ranted about things that could go wrong, but I personally haven’t had a problem finding what I was looking for in terms of someone accepting me for who I am- even when I might not be at my “A” game. That being said, you gotta take the time to look for that and not just settle even if you’re getting a bit impatient by the process",
                    "author": "SomethingSweet_x0",
                    "id": "fw4glrr",
                    "parent_id": "t1_fw44h7c",
                    "score": 2,
                    "created_utc": 1593220551.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I agree-ish. You know my past, and all the BS I have had to put with up. Yet i still pushed through, the good, the bad, the ugly. Can't say anything bad about you though, just our timing has always seemed to suck.",
            "author": "BigBearSD",
            "id": "fw4cu9c",
            "parent_id": "t3_hgbost",
            "score": 3,
            "created_utc": 1593218263.0,
            "replies": [
                {
                    "body": "I don’t think you would ever fall into this category. You always want something real and genuine which is why I always reach back out to you. 💕While you haven’t seen me yet looking like a hot mess, I know I could and you wouldn’t run to SLF to talk about how you need to “move on” because others perceived that I “clearly stopped caring”. You’re a real one",
                    "author": "SomethingSweet_x0",
                    "id": "fw4hgth",
                    "parent_id": "t1_fw4cu9c",
                    "score": 2,
                    "created_utc": 1593221084.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I am going to agree with you.  \n\nSomehow I will still get down voted.  You people are something else.",
            "author": null,
            "id": "fw37pps",
            "parent_id": "t3_hgbost",
            "score": 5,
            "created_utc": 1593196582.0,
            "replies": []
        },
        {
            "body": "Great post. I found it very refreshing. Well said sister!",
            "author": "LittleSugarBrat",
            "id": "fw4zrdm",
            "parent_id": "t3_hgbost",
            "score": 2,
            "created_utc": 1593233335.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "fw2zmzg",
            "parent_id": "t3_hgbost",
            "score": 3,
            "created_utc": 1593192746.0,
            "replies": [
                {
                    "body": "Haha my apologies- being concise has never been a strong suit😂. I’d hope that someone wouldn’t at least directly say it’s a job directly to you- that’d be incredibly rude. All I wanted was to just make light of the glaring parallel and how so many people get butthurt when it’s brought to the surface",
                    "author": "SomethingSweet_x0",
                    "id": "fw311p5",
                    "parent_id": "t1_fw2zmzg",
                    "score": 6,
                    "created_utc": 1593193413.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Love this post",
            "author": null,
            "id": "fw56tss",
            "parent_id": "t3_hgbost",
            "score": 1,
            "created_utc": 1593239247.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "fw3zb65",
            "parent_id": "t3_hgbost",
            "score": 1,
            "created_utc": 1593210555.0,
            "replies": [
                {
                    "body": "I agree- this lifestyle needs endings and beginnings. I don’t even think that putting in work or effort is a bad thing. It’s more when the SDs don’t acknowledge that it happens and get mad when because for them it feels effortless (based on your above mentioned reasons) they assume it’s easy on an SB- which sometimes it’s not as simple. I personally love the SDs I have met and have had SRs with. They treat me with so much respect and they don’t make me feel like I have to be at my best all the time. I think this forum at times can show that negative side of things, especially in posts where individuals ask for advice and the first response is “red flag” to someone getting into one disagreement with their partner. And for that, it almost gets taught that you should value meeting the needs of whom your with first or else you’ll be let go. While that isn’t always the case and plenty of people do put a value on the actual connection many do have the mindset of “this is temporary until I’m bored of you...but I expect you to have genuine attraction and feelings for me or else you are just transactional”, which we all know isn’t true. It’s just the echoed messages I see, so i wanted to rant about it for a bit lol",
                    "author": "SomethingSweet_x0",
                    "id": "fw4fv7g",
                    "parent_id": "t1_fw3zb65",
                    "score": 5,
                    "created_utc": 1593220092.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I would hope that most true SDs understand that SBs aren't having the best day every single date and don't expect them to be \"on\" every date.    Maybe there are SDs who do expect perfection every time, and I'm sorry if you have to deal with a lot of them.   \n\nI do, however, disagree with your point that an SD be willing to move to another SB when the first one is not treating him well means he's not looking for a real relationship.   I expect anyone that I am dating to put effort into treating me well, even in vanilla.   In my SR, I am putting a lot of effort into making my SB happy, not just with the sugar, but with my actions and words.    I absolutely understand she will have some bad days and don't expect her to be \"on her A game\" every date, but it seems pretty fair and reasonable that she should put in a good deal of effort to be a good partner to me.   Again, I'd expect this from a vanilla partner, so I certainly expect it when there's sugar involved as well.",
            "author": "UseTheForceRey",
            "id": "fw3lps6",
            "parent_id": "t3_hgbost",
            "score": 1,
            "created_utc": 1593203535.0,
            "replies": [
                {
                    "body": "I’d agree with that too, so long as it’s mutual. I think part of my thoughts got lost in my rambling. There sometimes feels like this innate pressure to be perfect because of how much other “options” there are. I personally haven’t been with an SD that hasn’t accepted, all aspects of me- but just some of the posts on this sub scream that message. I’m sure you could scroll through this sub over the past week and see thousands of comments from others suggesting to leave her or that there’s “too much drama” or “she’s getting sugar so she should be ok with your additional requests”. Things of that nature. And while I don’t disagree that these things can be mutual to an extent and therefore can be somewhat expected, the more expectations that are required of anyone the less it becomes organic and therefore can almost feel like “work”. I’m not here preaching that an SB should be rocking sweats every day when they see their man, but also I don’t think SBs get as many “chances” for when they don’t live up to SDs preset expectations, whereas an SB seems to “tolerate or look past” certain actions/traits/expectations their SD shows and it’s normalized to do that",
                    "author": "SomethingSweet_x0",
                    "id": "fw4f7qm",
                    "parent_id": "t1_fw3lps6",
                    "score": 2,
                    "created_utc": 1593219690.0,
                    "replies": [
                        {
                            "body": "OK, that's interesting.  Honestly I haven't noticed all of those comments, but I will look harder for them.    Maybe because I am not that demanding with my SB, I assume most SDs are like that and that the complaints are for truly egregious things.",
                            "author": "UseTheForceRey",
                            "id": "fw4fsso",
                            "parent_id": "t1_fw4f7qm",
                            "score": 1,
                            "created_utc": 1593220051.0,
                            "replies": [
                                {
                                    "body": "Well you most likely are a great SD. It’s probably crazy to think that others view it so quid pro quo but sometimes it comes off that way. Keep doing what your doing and making your Sb feel amazing 😊",
                                    "author": "SomethingSweet_x0",
                                    "id": "fw4hmuh",
                                    "parent_id": "t1_fw4fsso",
                                    "score": 2,
                                    "created_utc": 1593221187.0,
                                    "replies": [
                                        {
                                            "body": "Haha, thanks.",
                                            "author": "UseTheForceRey",
                                            "id": "fw4opcd",
                                            "parent_id": "t1_fw4hmuh",
                                            "score": 1,
                                            "created_utc": 1593225635.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "There are a host of reasons for this. I’ll just discuss a few. \n\nIf there is an SD that is giving and allowing in the top 1%, that SB will def have to work to provide the best service. The problem is with everyone else. They want what the 1% has without the premium cost. If a SD is giving the standard allowance, they should not expect as much but they do.\n\nRich mentality. Once you get “successful”, the way you think starts to change. A lot of it becomes about what’s worth your time and it bleeds into everything else. Let’s say I make roughly 200 an hour. I bought something online for 20 but it ended up not being the correct item. Do I spend 1+ hour filling out a return, boxing it back up, stopping by UPS or do I just throw it away in the trash and buy the correct item. Now, I’m not saying a SB is the same as an item. But the way the rich think is something to consider. \n\nThat being said, there are many SDs that still have their head on straight and those are the ones you’re looking for; the same for SBs. Hopefully they can weed through the bad and find each other.",
            "author": "BishopSD",
            "id": "fw5oleb",
            "parent_id": "t3_hgbost",
            "score": 1,
            "created_utc": 1593257070.0,
            "replies": []
        },
        {
            "body": "Let’s no forget how much work and effort it takes to make the money needed to even afford a SB 😉",
            "author": "ruphun",
            "id": "fw314pu",
            "parent_id": "t3_hgbost",
            "score": -3,
            "created_utc": 1593193453.0,
            "replies": [
                {
                    "body": "And we love that you work hard😘 I love appreciating my man for being so dedicated and distinguished, its the allure to this lifestyle. \n\nIt just makes me give an over-exaggerated eye roll when the expectations or list for what some SDs want their Sb to provide is ABCDEFG, and the Sbs should just be thankful to only receive A (sugar). But you don’t sound like one of those kind of guys 🥰",
                    "author": "SomethingSweet_x0",
                    "id": "fw34e0x",
                    "parent_id": "t1_fw314pu",
                    "score": 12,
                    "created_utc": 1593194990.0,
                    "replies": [
                        {
                            "body": "Thx! I try not to be. I love going over and above. It’s the little things that are unexpected that make the difference 😘",
                            "author": "ruphun",
                            "id": "fw37k3c",
                            "parent_id": "t1_fw34e0x",
                            "score": 0,
                            "created_utc": 1593196506.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "I'm betting you're one of those people who would argue about how much a SAHM works versus how much you work. With all the love, of course. 😂",
                    "author": "atypicalsb",
                    "id": "fw31wr4",
                    "parent_id": "t1_fw314pu",
                    "score": 12,
                    "created_utc": 1593193817.0,
                    "replies": [
                        {
                            "body": "I kid I kid. It meant to  a joke 🤣😜",
                            "author": "ruphun",
                            "id": "fw37eqa",
                            "parent_id": "t1_fw31wr4",
                            "score": -2,
                            "created_utc": 1593196436.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I agree, but I am a Socialist.",
            "author": "TY2022",
            "id": "fw32qty",
            "parent_id": "t3_hgbost",
            "score": 0,
            "created_utc": 1593194203.0,
            "replies": [
                {
                    "body": ">I am a Socialist\n\nTell me more about who should pay allowance to your sugar babies.",
                    "author": "GDarn",
                    "id": "fw3850u",
                    "parent_id": "t1_fw32qty",
                    "score": 2,
                    "created_utc": 1593196788.0,
                    "replies": [
                        {
                            "body": "Me, but if I couldn't I'd expect the government to pick up 90% of the cost.  😁",
                            "author": "TY2022",
                            "id": "fw3imdp",
                            "parent_id": "t1_fw3850u",
                            "score": 3,
                            "created_utc": 1593201953.0,
                            "replies": [
                                {
                                    "body": "You do realize that the government would assign you a state approved SB though?",
                                    "author": "GDarn",
                                    "id": "fw3ltxm",
                                    "parent_id": "t1_fw3imdp",
                                    "score": 2,
                                    "created_utc": 1593203594.0,
                                    "replies": [
                                        {
                                            "body": "lololololol\n\nI'm gonna hold out for the [72 virgins](https://en.wikipedia.org/wiki/Houri#Sexual_intercourse_in_Paradise) to avoid mixing church and state.",
                                            "author": "TY2022",
                                            "id": "fw3mn9h",
                                            "parent_id": "t1_fw3ltxm",
                                            "score": 1,
                                            "created_utc": 1593204009.0,
                                            "replies": [
                                                {
                                                    "body": "And I will slowly back away, holding my empty hands  up so they are clearly visible.\n\nNot touching holy war martyr comments with a flagpole, thank you very much :)",
                                                    "author": "GDarn",
                                                    "id": "fw3n8rj",
                                                    "parent_id": "t1_fw3mn9h",
                                                    "score": 1,
                                                    "created_utc": 1593204310.0,
                                                    "replies": [
                                                        {
                                                            "body": "Aha.  By playing zee nuclear card I triumph once again!  Savoir-Faire eez everywhere!",
                                                            "author": "TY2022",
                                                            "id": "fw3oube",
                                                            "parent_id": "t1_fw3n8rj",
                                                            "score": 2,
                                                            "created_utc": 1593205130.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "😂😂",
                                    "author": "a94seek",
                                    "id": "fw3ki1c",
                                    "parent_id": "t1_fw3imdp",
                                    "score": 0,
                                    "created_utc": 1593202917.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Maybe it should be clarified as \"a job you don't want\".  I had too many girls constantly asking \"did you come?\" \"Did you come?\" which breaks my concentration, and when I do, they're out the door in seconds.",
            "author": "nemo69_1999",
            "id": "fw356qv",
            "parent_id": "t3_hgbost",
            "score": 1,
            "created_utc": 1593195370.0,
            "replies": [
                {
                    "body": "Yikes! Those dont sound like a traditional Sbs",
                    "author": "SomethingSweet_x0",
                    "id": "fw3747y",
                    "parent_id": "t1_fw356qv",
                    "score": 7,
                    "created_utc": 1593196294.0,
                    "replies": [
                        {
                            "body": "IKR?  I've never met a girl whom I felt was a traditional SB.  I don't think they exist.",
                            "author": "nemo69_1999",
                            "id": "fw38kyx",
                            "parent_id": "t1_fw3747y",
                            "score": -2,
                            "created_utc": 1593197003.0,
                            "replies": [
                                {
                                    "body": "They exist 😘",
                                    "author": "azucarbebe22",
                                    "id": "fw3ael2",
                                    "parent_id": "t1_fw38kyx",
                                    "score": 3,
                                    "created_utc": 1593197872.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "This sounds like bad screening. Do you have sex with the girls on 1st M&G. Your probably running into either sex worker SB or undercover escorts.",
                    "author": "CspanSF",
                    "id": "fw421wb",
                    "parent_id": "t1_fw356qv",
                    "score": 3,
                    "created_utc": 1593212042.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "fw30euv",
            "parent_id": "t3_hgbost",
            "score": -6,
            "created_utc": 1593193112.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "fw32zwn",
                    "parent_id": "t1_fw30euv",
                    "score": 19,
                    "created_utc": 1593194323.0,
                    "replies": [
                        {
                            "body": "No that’s exactly what i meant! And summed up so much better than I could have written it.",
                            "author": "SomethingSweet_x0",
                            "id": "fw37a8d",
                            "parent_id": "t1_fw32zwn",
                            "score": 8,
                            "created_utc": 1593196375.0,
                            "replies": []
                        },
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "fw33j7n",
                            "parent_id": "t1_fw32zwn",
                            "score": -3,
                            "created_utc": 1593194580.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "fw33ry8",
                                    "parent_id": "t1_fw33j7n",
                                    "score": 8,
                                    "created_utc": 1593194697.0,
                                    "replies": [
                                        {
                                            "body": "[deleted]",
                                            "author": null,
                                            "id": "fw34bkg",
                                            "parent_id": "t1_fw33ry8",
                                            "score": -5,
                                            "created_utc": 1593194959.0,
                                            "replies": [
                                                {
                                                    "body": "[deleted]",
                                                    "author": null,
                                                    "id": "fw378dy",
                                                    "parent_id": "t1_fw34bkg",
                                                    "score": 2,
                                                    "created_utc": 1593196350.0,
                                                    "replies": [
                                                        {
                                                            "body": "[deleted]",
                                                            "author": null,
                                                            "id": "fw3c8cr",
                                                            "parent_id": "t1_fw378dy",
                                                            "score": 0,
                                                            "created_utc": 1593198759.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "So when you said dont do anything you aren't comfortable doing, rubs me the wrong way Hopefully this explains why.\n\nWhen you are raised as a woman or transition to one (especially in certain areas or lifestyles) you don't have the option of  \"don't do anything you're uncomfortable doing.\" I hate to break it too you, but we are LITERALLY taught that we have no power, to be quiet, and even if it sucks to do what our loved ones, jobs and more require.\n\n\\-Boyfriend likes anal and you hate it? Do it anyway, or you are whiny and dont love him. (Heaven forbid YOU ask him to try and he will act like you nearly killed him with a  pinky finger.)\n\n\\- Working at a job and the boss harresses you? He is so nice he wouldnt DARE do that be quiet! (You report it anyway and he is MOVED STORES NOT FIRED)\n\n\\- Your family wants to come over despite you needing space? Why dont you love them? Your a bitch! (Do this to them however and you are a bitch for not giving space enough)\n\nYou have to set boundaries that are not taught to you ever.  So for the rest of your life you have to work on a power imbalance in everything you do, and get used to being called names and more for demanding what you are worth in time, money and space. If you are are lucky and learn them you get to develop thick skin early but STILL have to fight to be heard and boundaries respected.\n\nbeing uncomfortable is a state alot of woman remain in on a daily basis.",
                    "author": "Ipatchcat",
                    "id": "fw33pnj",
                    "parent_id": "t1_fw30euv",
                    "score": 8,
                    "created_utc": 1593194667.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "fw3f5k6",
                            "parent_id": "t1_fw33pnj",
                            "score": 0,
                            "created_utc": 1593200208.0,
                            "replies": [
                                {
                                    "body": ">I believe dating is a simple dynamic\n\nIf something involves the interaction of two people, it's not a simple dynamic.",
                                    "author": "TY2022",
                                    "id": "fw3kjh4",
                                    "parent_id": "t1_fw3f5k6",
                                    "score": 2,
                                    "created_utc": 1593202937.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Of course and by tolerating what SDs want- by no means am I suggesting going against your own set rules/boundaries/morals/etc. I know connections can be built through SRs. I’ve had them before and they are lovely. But those legitimate connections are because I show my true self and they have accepted it. They have been ok with me coming over some days without my hair perfectly done or without wearing a tight dress and heels. Those SDs are the ones who totally rock and anyone would want to go above and beyond to appreciate them fully. \n\nIn terms of dating - you’re 100% right, there is no guarantee anything will last. But the main difference between vanilla and sugar is that in vanilla 9 times out of 10 it’s a “this is what you get, take it or leave it” mentality because who would want to be in a relationship or anything beyond a few dates, with someone that you have to constantly be on “your best behavior” with? I love SRs. They exist for a purpose and its to give people a taste of this fantasy world that no one would be able to maintain if not for the sugar on both ends. The moral of my rant, albeit long winded and confusing, is less about whether connections can form and more so to critique the people who think that being this “perfect Sb” in a “perfect SR” comes without diligent effort and work to make it come off so effortless.",
                    "author": "SomethingSweet_x0",
                    "id": "fw334mh",
                    "parent_id": "t1_fw30euv",
                    "score": 5,
                    "created_utc": 1593194385.0,
                    "replies": []
                },
                {
                    "body": "🙄🙄🙄",
                    "author": "LikeHoney99",
                    "id": "fw31um3",
                    "parent_id": "t1_fw30euv",
                    "score": 7,
                    "created_utc": 1593193789.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I’m in a long term allowance based arrangement.\n\nSome of the attitudes of the SB’S on this forum  make me happy I don’t have someone like them.\nAll about the dollar don’t sell yourself short, multiple SD’S etc.\n\nSo it works both ways.\n\nI have an allowance based  arrangement about equal to monthly rent here. \nSo no cheapskate.\nThey think if you’re not a high roller you shouldn’t be a SD.\n\nYes many guys sound like creeps. I specifically want a real person and all it entails.\n\nGood days bad days no problem.\nDress up or not doesn’t matter.\n\nAs long as you’re real all good",
            "author": "SydSd1",
            "id": "fw5anvg",
            "parent_id": "t3_hgbost",
            "score": 0,
            "created_utc": 1593242892.0,
            "replies": []
        },
        {
            "body": "While it’s not a job,  you should know you are being compensated well and give a better effort than you might in a “real relationship”.  We are not paying for real,  we are paying for the idealized version of a hot younger GF.",
            "author": "LotBuilder",
            "id": "fw3333f",
            "parent_id": "t3_hgbost",
            "score": -6,
            "created_utc": 1593194365.0,
            "replies": [
                {
                    "body": "Then why complain about wanting a “real connection”? Not you specifically, I don’t know you. But for the ones that do.",
                    "author": "pumpkinspicedcream",
                    "id": "fw33y3m",
                    "parent_id": "t1_fw3333f",
                    "score": 13,
                    "created_utc": 1593194778.0,
                    "replies": []
                },
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "fw37m7g",
                    "parent_id": "t1_fw3333f",
                    "score": 9,
                    "created_utc": 1593196535.0,
                    "replies": [
                        {
                            "body": "The only way for it to not feel transactional, is for you to like each other, and that comes with time.   I expect things to feel a little bit transactional in the beginning",
                            "author": "LotBuilder",
                            "id": "fw3du60",
                            "parent_id": "t1_fw37m7g",
                            "score": -2,
                            "created_utc": 1593199553.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": ">We are not paying for real, we are paying for the idealized version of a hot younger GF.\n\nWho is this \"we\" you are talking about?\n\nGod knows it does not include me :)",
                    "author": "GDarn",
                    "id": "fw38cku",
                    "parent_id": "t1_fw3333f",
                    "score": 7,
                    "created_utc": 1593196889.0,
                    "replies": [
                        {
                            "body": "Do you want moodiness, sweatpants, and unshaved legs?   Do you want her to vent to you daily? Do you want to get dragged into doing chores like moving or putting together ikea furniture?  Do you want her to cancel or change plans on you like she would a regular boyfriend?\n\nI don’t want that.  I want to put together a cute smiling version and if part of that is an act… That’s just life.",
                            "author": "LotBuilder",
                            "id": "fw3eexw",
                            "parent_id": "t1_fw38cku",
                            "score": -4,
                            "created_utc": 1593199838.0,
                            "replies": [
                                {
                                    "body": ">I don’t want that. I want to put together a cute smiling version and if part of that is an act… That’s just life.\n\nCool - you do you.\n\nJust understand that when you say \"we\" instead of \"I\", you will get people like me objecting to you speaking on their behalf.\n\nI don't claim to speak for \"us\", nor should you.",
                                    "author": "GDarn",
                                    "id": "fw3frt0",
                                    "parent_id": "t1_fw3eexw",
                                    "score": 6,
                                    "created_utc": 1593200513.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Hey there’s nothing wrong with that mentality! I’m all for men who are looking for the gf “experience” and make that clear from the start. It’s the men that say they want that, but it can not come off as transactional at all, AND THEN get butthurt when they realize she actually isn’t as “connected” like she portrayed",
                    "author": "SomethingSweet_x0",
                    "id": "fw3859v",
                    "parent_id": "t1_fw3333f",
                    "score": 5,
                    "created_utc": 1593196791.0,
                    "replies": [
                        {
                            "body": "I am starting to get to the point of wondering if we need more terminology or distinctions around how we classify SRs.  I want a real emotional connection, which means I want the bad too--like many a man, I enjoy trying to help and solve problems--but I recognize I'm not in the majority.  My SBs definitely know that I'm not the norm but they haven't been able to shift their mindset and continue to want to provide the best (positive) experience even when I ask them to not do so.  Perhaps if we have more ways to classify an SR, we could get people to align upfront rather than find out that we're not aligned even when using the same terminology?  :/",
                            "author": null,
                            "id": "fw39p8l",
                            "parent_id": "t1_fw3859v",
                            "score": 2,
                            "created_utc": 1593197532.0,
                            "replies": [
                                {
                                    "body": "To be fair I think it has to do with other messages received. If everyone else that they seek advice for SRs with is telling them “don’t mess up” or they see other SDs saying that by not always being in a good mood can come off as “dramatic” - it’s no shock why they worry to show those sides. There’s sooooo many sbs and while all of us don’t want to think we will get dumped- it’s always a possibility. I think the last thing we want to do is be a contribution for a premature ending to an SR especially if we can avoid it by putting our best foot forward. I agree though- it’s so much easier to just be authentic and I’m thankful I’ve met SDs who are gracious for me being myself",
                                    "author": "SomethingSweet_x0",
                                    "id": "fw3ao04",
                                    "parent_id": "t1_fw39p8l",
                                    "score": 5,
                                    "created_utc": 1593197997.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Am I in the wrong bowl? Because I'm being gifted for being real AF. That's how my man likes it. 😂",
                    "author": "atypicalsb",
                    "id": "fw34e4g",
                    "parent_id": "t1_fw3333f",
                    "score": 7,
                    "created_utc": 1593194992.0,
                    "replies": [
                        {
                            "body": "Girl I have the types of SRs that you do. I’m 100% me all day err day. But a lot of the SDs I see on here probably would drop me like a bad habit if they saw the real me - makes me thankful that there are some that are appreciative of authentic connections vs superficial “I’m gonna say what you want to hear” so I don’t get dumped",
                            "author": "SomethingSweet_x0",
                            "id": "fw37pbx",
                            "parent_id": "t1_fw34e4g",
                            "score": 7,
                            "created_utc": 1593196577.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "I think that's perfectly fair, if you're paying top dollar for a professional service experience, and are cool if she never really \"likes\" you because she can never relax and be a human being with flaws, feelings, stress, she's always performing and \"on\".",
                    "author": "sugarsenior2",
                    "id": "fw6i9k0",
                    "parent_id": "t1_fw3333f",
                    "score": 3,
                    "created_utc": 1593276473.0,
                    "replies": [
                        {
                            "body": "The reality is that we are hanging out for 4/5 hours per week.  I want the best version of them at that time.  I believe you have to look and feel sexy to be really sexy.  We are all going through stuff,  put that aside for a few hours.  I put forward my best effort too.  My grooming and hygiene is flawless,  my clothes are fresh and clean,  my house is spotless.  It takes effort on my end and I just expect the same in return.  A regular GF that I saw daily would not get the same experience because it’s hard to be date ready 24/7.  As we see each other longer and have extended trips that changes a little.   I’ve been doing this since 2008 and I have had a dozen arrangements that lasted 2-4 years so I’m not overly worried if they like me or not,  they do, my bigger challenge is telling them why they can’t move in.  \n\nIf half my SB’s came over “comfortable” they would be wearing the same yoga pants and crop top covered in pet hair they have been rocking for two days and their hair would smell like the 1/8 of kush they just inhaled mixed with Kombucha and Tzatziki.   I love all my little crazy hippy Gypsies but I need them polish up a little bit before a date.",
                            "author": "LotBuilder",
                            "id": "fw6kgjw",
                            "parent_id": "t1_fw6i9k0",
                            "score": -1,
                            "created_utc": 1593277619.0,
                            "replies": [
                                {
                                    "body": "That's fair.",
                                    "author": "sugarsenior2",
                                    "id": "fwecsek",
                                    "parent_id": "t1_fw6kgjw",
                                    "score": 1,
                                    "created_utc": 1593459063.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Right?! Or even just the fact that we essentially have to “check our baggage at the door” regardless of what’s going on in our own personal lives. I get it- it’s why there’s sugar. There’s no denial and I completely accept it too. But for some of these SDs to just assume us SBs are always a 10/10 mood and dressed to the nines is delusional...yet god forbid we slip up and let this facade show and there’s a post about us on SLF about how “we’re such drama” or “not showing effort anymore” 😂😂",
            "author": "SomethingSweet_x0",
            "id": "fw31k7t",
            "parent_id": "t1_fw30dg7",
            "score": 33,
            "created_utc": 1593193654.0,
            "replies": []
        },
        {
            "body": "Absolutely! This ^^^!!! Certainly not out of terror but out of that I have a very high standard for myself and my appearance and I prefer not casting my pearls before swine as it were.",
            "author": "testing1to3",
            "id": "fw34jbb",
            "parent_id": "t1_fw30dg7",
            "score": 11,
            "created_utc": 1593195060.0,
            "replies": []
        },
        {
            "body": "One of my SBs has a process to get her mind ready to really get down.  She takes a bath, has a full skin care routine, gets a blow out, puts on sexy lingerie underneath her outfit.  It’s a half day thing.  She has to feel a certain way to completely let loose.  Then she walks into the restaurant and you can see in her eyes that she’s feeling herself as every head in the place turns.",
            "author": "LotBuilder",
            "id": "fw3f5n2",
            "parent_id": "t1_fw30dg7",
            "score": 15,
            "created_utc": 1593200209.0,
            "replies": [
                {
                    "body": "Exactly!",
                    "author": "testing1to3",
                    "id": "fw3hbmm",
                    "parent_id": "t1_fw3f5n2",
                    "score": 3,
                    "created_utc": 1593201293.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "when my former SB came to our date all dolled up, then broke down crying in front of me bc she just got fired a few hours ago...\n\nI just held her for a good long while.   \n\nAnd then I told her I was amazed and astounded she still came to the date so dolled up, and thanked her 3 or 4 times.  \n\nOne of my best dates of all time and always will be, vanilla or otherwise.  \n\nYou don't have to fit the \"SB Standard formula\" w me, yes its sugar, but so what.  Compassion and humility is sexy af no matter what you're doing.",
            "author": "Gemini-Fox",
            "id": "fw3ivze",
            "parent_id": "t1_fw30dg7",
            "score": 16,
            "created_utc": 1593202090.0,
            "replies": []
        },
        {
            "body": "Im sure not all men are like me but I put a significant amount of time and money in my appearance on top of everything I do to earn my income.",
            "author": "saltgrindr",
            "id": "fw31rmy",
            "parent_id": "t1_fw30dg7",
            "score": 10,
            "created_utc": 1593193750.0,
            "replies": [
                {
                    "body": "AMEN to you! There’s been plenty of SDs I’ve met who I’ve actually questioned whether they were wearing clean clothes before coming to a m&g.",
                    "author": "SomethingSweet_x0",
                    "id": "fw34olf",
                    "parent_id": "t1_fw31rmy",
                    "score": 15,
                    "created_utc": 1593195130.0,
                    "replies": [
                        {
                            "body": ">I’ve actually questioned whether they were wearing clean clothes\n\nBet that put a damper on the mood.",
                            "author": "TY2022",
                            "id": "fw3j8pz",
                            "parent_id": "t1_fw34olf",
                            "score": 5,
                            "created_utc": 1593202273.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "You may over estimate what it takes. I have enjoyed my SBs well decked up as well as in their casual clothes, in good moods or not so good moods. Those are often not the problem. The problem is the ATM mentality, lack of respect, lack of punctuality, the incessant flaking, the lying and endless pursuit of other SDs, even something as trivial as constantly checking the phone, the pseudo “oh my phone broke” ghosting are bigger pet peeves than make up or lack therof.",
            "author": null,
            "id": "fw3kp85",
            "parent_id": "t1_fw30dg7",
            "score": 3,
            "created_utc": 1593203017.0,
            "replies": []
        },
        {
            "body": "Couldn’t agree more!",
            "author": "SomethingSweet_x0",
            "id": "fw39vw4",
            "parent_id": "t1_fw38vzn",
            "score": 7,
            "created_utc": 1593197621.0,
            "replies": []
        },
        {
            "body": "😂😂I tried my hardest to make it clear that it’s SOME not ALL. I have met plenty of real SDs that I can be 100% authentically myself and thus a more genuine SR occurs. But my lorrrdddd so much hypocrisy about how SRs should be “easy/carefree” yet if I actually stopped trying so I could experience something “easy” too- I’d get a lecture about how our needs aren’t aligned. \n\nAnd before anyone comes at me- I’d never stop trying for an SD that puts in as much effort, not only through monetary contributions, as I do. We want mutual up in this SR 😂",
            "author": "SomethingSweet_x0",
            "id": "fw36ugb",
            "parent_id": "t1_fw34zo6",
            "score": 19,
            "created_utc": 1593196164.0,
            "replies": [
                {
                    "body": "Don't spend a second worrying about what anyone says about you or your thesis.  Only one aspect is risk-free: someone will disagree with you.",
                    "author": "TY2022",
                    "id": "fw3jii8",
                    "parent_id": "t1_fw36ugb",
                    "score": 7,
                    "created_utc": 1593202413.0,
                    "replies": [
                        {
                            "body": "Oh trust me, I expected to make some waves!",
                            "author": "SomethingSweet_x0",
                            "id": "fw4dvk4",
                            "parent_id": "t1_fw3jii8",
                            "score": 2,
                            "created_utc": 1593218886.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "If you have met good SDs try to talk about them vs bashing the bad one’s. There are always going to be the bad and rotten apples in a huge basket. We accept that as SDs.",
                    "author": null,
                    "id": "fw3l1vq",
                    "parent_id": "t1_fw36ugb",
                    "score": -7,
                    "created_utc": 1593203196.0,
                    "replies": [
                        {
                            "body": "People bash bad SBs and bad SDs all the time. The question here is: why are you mad at this post?",
                            "author": "AfroBabySugg",
                            "id": "fw3ny5x",
                            "parent_id": "t1_fw3l1vq",
                            "score": 9,
                            "created_utc": 1593204672.0,
                            "replies": [
                                {
                                    "body": "Why do you think?",
                                    "author": null,
                                    "id": "fw4gvk6",
                                    "parent_id": "t1_fw3ny5x",
                                    "score": -3,
                                    "created_utc": 1593220720.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "That sounds like SRs I’ve had and frankly how all of them should present themselves. Sadly I think there is a bit of “entitlement” that goes on where an SD has soooo many to pick from that there is little tolerance for when an expectation is not fully met, almost creating this sense that you (an Sb) CANNOT mess up or you’ll be replaced. Granted, I’ve never felt it to that great of an extent- but that’s just sometimes the messages that get presented on this forum. It’s wonderful seeing someone who values themselves and their sbs so highly- your Sb is a lucky gal 🥰",
            "author": "SomethingSweet_x0",
            "id": "fw39e8t",
            "parent_id": "t1_fw37t0t",
            "score": 12,
            "created_utc": 1593197387.0,
            "replies": [
                {
                    "body": "Very true, there are people in any environment who are totally full of themselves and think they are entitled to perfection for what little they put in. Best to just avoid those people.\n\nAs far as there being so many to pick from, ratio aside, I can say from experience it takes a lot of time and effort to find someone who is a good fit. Sometimes I think SBs psyche themselves out by looking at all the other beautiful women on SA. Just remember, half of them never respond and most of the ones who do are unable to hold an adult conversation or have no intention of meeting up. You might be replaceable but you aren't easily replaceable.",
                    "author": "canavatar12",
                    "id": "fw3bfnp",
                    "parent_id": "t1_fw39e8t",
                    "score": 5,
                    "created_utc": 1593198368.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Oh you know it! I had one guy insist that wear stockings in 90 degree weather to eat OUTSIDE. I showed up looking great sans the stockings because Um it was the middle of summer and that just doesnt even go with the season and he had the audacity to question my “ability” to be a good Sb. “But somethingsweet don’t you want to impress me?!” Me: yeah which is why I spent two hours getting ready to look wonderful and not have thigh sweat from damn near overheating in stockings! He was an immediate next",
            "author": "SomethingSweet_x0",
            "id": "fw4h77f",
            "parent_id": "t1_fw45enm",
            "score": 3,
            "created_utc": 1593220919.0,
            "replies": []
        },
        {
            "body": "Completely agree! I am lucky to say I’ve never felt like my SR is a job or that I couldn’t be authentic to myself- but it’s just more and more apparent that some of the “SDs” on this sub have an expectation that perfection is a requirement for an SR to continue or else you just dump and move on. You certainly don’t sound like one of those guys and for that we thank you 😊",
            "author": "SomethingSweet_x0",
            "id": "fw39ots",
            "parent_id": "t1_fw37uar",
            "score": 7,
            "created_utc": 1593197526.0,
            "replies": []
        },
        {
            "body": "Yep. It’s a double edged sword. On one hand we want to be authentic and show all of our sides to form a legitimate connection, however there is that little voice in our heads that tell us “uh oh if he doesn’t see you as flawless he will pick another girl that can keep up that image”. This whole lifestyle is complicated",
            "author": "SomethingSweet_x0",
            "id": "fw3aypv",
            "parent_id": "t1_fw3acmg",
            "score": 6,
            "created_utc": 1593198141.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "fw3gkip",
                    "parent_id": "t1_fw3aypv",
                    "score": 2,
                    "created_utc": 1593200914.0,
                    "replies": [
                        {
                            "body": "For me personally, I move away from ppm as soon as possible. Having just one amount or allowance totally gets rid of that notion that this date can “cost” this much whereas another date should cost something else",
                            "author": "SomethingSweet_x0",
                            "id": "fw3hkkv",
                            "parent_id": "t1_fw3gkip",
                            "score": 3,
                            "created_utc": 1593201419.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Couldn’t say it better myself. The SRs I’ve had have been nothing but wonderful. We both appreciate one another and can always be candid about our genuine feelings or thoughts. I think my rant was less about personal experiences and more so about some of the comments/posts I read on this sub perpetuating this paradigm- yet no one is just calling it out",
            "author": "SomethingSweet_x0",
            "id": "fw35974",
            "parent_id": "t1_fw343a4",
            "score": 2,
            "created_utc": 1593195403.0,
            "replies": []
        },
        {
            "body": "100% agree with this. And don’t get me wrong, SBs can judge too- it’s all part of the lifestyle. I’m blessed to have met such great SDs that it has allowed me to not get so jaded",
            "author": "SomethingSweet_x0",
            "id": "fw4eal3",
            "parent_id": "t1_fw3kv8l",
            "score": 3,
            "created_utc": 1593219137.0,
            "replies": []
        },
        {
            "body": "I can’t really speak for all SRs. My one piece of advice would be to find someone who wants what you want. I know I just ranted about things that could go wrong, but I personally haven’t had a problem finding what I was looking for in terms of someone accepting me for who I am- even when I might not be at my “A” game. That being said, you gotta take the time to look for that and not just settle even if you’re getting a bit impatient by the process",
            "author": "SomethingSweet_x0",
            "id": "fw4glrr",
            "parent_id": "t1_fw44h7c",
            "score": 2,
            "created_utc": 1593220551.0,
            "replies": []
        },
        {
            "body": "I don’t think you would ever fall into this category. You always want something real and genuine which is why I always reach back out to you. 💕While you haven’t seen me yet looking like a hot mess, I know I could and you wouldn’t run to SLF to talk about how you need to “move on” because others perceived that I “clearly stopped caring”. You’re a real one",
            "author": "SomethingSweet_x0",
            "id": "fw4hgth",
            "parent_id": "t1_fw4cu9c",
            "score": 2,
            "created_utc": 1593221084.0,
            "replies": []
        },
        {
            "body": "Haha my apologies- being concise has never been a strong suit😂. I’d hope that someone wouldn’t at least directly say it’s a job directly to you- that’d be incredibly rude. All I wanted was to just make light of the glaring parallel and how so many people get butthurt when it’s brought to the surface",
            "author": "SomethingSweet_x0",
            "id": "fw311p5",
            "parent_id": "t1_fw2zmzg",
            "score": 6,
            "created_utc": 1593193413.0,
            "replies": []
        },
        {
            "body": "I agree- this lifestyle needs endings and beginnings. I don’t even think that putting in work or effort is a bad thing. It’s more when the SDs don’t acknowledge that it happens and get mad when because for them it feels effortless (based on your above mentioned reasons) they assume it’s easy on an SB- which sometimes it’s not as simple. I personally love the SDs I have met and have had SRs with. They treat me with so much respect and they don’t make me feel like I have to be at my best all the time. I think this forum at times can show that negative side of things, especially in posts where individuals ask for advice and the first response is “red flag” to someone getting into one disagreement with their partner. And for that, it almost gets taught that you should value meeting the needs of whom your with first or else you’ll be let go. While that isn’t always the case and plenty of people do put a value on the actual connection many do have the mindset of “this is temporary until I’m bored of you...but I expect you to have genuine attraction and feelings for me or else you are just transactional”, which we all know isn’t true. It’s just the echoed messages I see, so i wanted to rant about it for a bit lol",
            "author": "SomethingSweet_x0",
            "id": "fw4fv7g",
            "parent_id": "t1_fw3zb65",
            "score": 5,
            "created_utc": 1593220092.0,
            "replies": []
        },
        {
            "body": "I’d agree with that too, so long as it’s mutual. I think part of my thoughts got lost in my rambling. There sometimes feels like this innate pressure to be perfect because of how much other “options” there are. I personally haven’t been with an SD that hasn’t accepted, all aspects of me- but just some of the posts on this sub scream that message. I’m sure you could scroll through this sub over the past week and see thousands of comments from others suggesting to leave her or that there’s “too much drama” or “she’s getting sugar so she should be ok with your additional requests”. Things of that nature. And while I don’t disagree that these things can be mutual to an extent and therefore can be somewhat expected, the more expectations that are required of anyone the less it becomes organic and therefore can almost feel like “work”. I’m not here preaching that an SB should be rocking sweats every day when they see their man, but also I don’t think SBs get as many “chances” for when they don’t live up to SDs preset expectations, whereas an SB seems to “tolerate or look past” certain actions/traits/expectations their SD shows and it’s normalized to do that",
            "author": "SomethingSweet_x0",
            "id": "fw4f7qm",
            "parent_id": "t1_fw3lps6",
            "score": 2,
            "created_utc": 1593219690.0,
            "replies": [
                {
                    "body": "OK, that's interesting.  Honestly I haven't noticed all of those comments, but I will look harder for them.    Maybe because I am not that demanding with my SB, I assume most SDs are like that and that the complaints are for truly egregious things.",
                    "author": "UseTheForceRey",
                    "id": "fw4fsso",
                    "parent_id": "t1_fw4f7qm",
                    "score": 1,
                    "created_utc": 1593220051.0,
                    "replies": [
                        {
                            "body": "Well you most likely are a great SD. It’s probably crazy to think that others view it so quid pro quo but sometimes it comes off that way. Keep doing what your doing and making your Sb feel amazing 😊",
                            "author": "SomethingSweet_x0",
                            "id": "fw4hmuh",
                            "parent_id": "t1_fw4fsso",
                            "score": 2,
                            "created_utc": 1593221187.0,
                            "replies": [
                                {
                                    "body": "Haha, thanks.",
                                    "author": "UseTheForceRey",
                                    "id": "fw4opcd",
                                    "parent_id": "t1_fw4hmuh",
                                    "score": 1,
                                    "created_utc": 1593225635.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "And we love that you work hard😘 I love appreciating my man for being so dedicated and distinguished, its the allure to this lifestyle. \n\nIt just makes me give an over-exaggerated eye roll when the expectations or list for what some SDs want their Sb to provide is ABCDEFG, and the Sbs should just be thankful to only receive A (sugar). But you don’t sound like one of those kind of guys 🥰",
            "author": "SomethingSweet_x0",
            "id": "fw34e0x",
            "parent_id": "t1_fw314pu",
            "score": 12,
            "created_utc": 1593194990.0,
            "replies": [
                {
                    "body": "Thx! I try not to be. I love going over and above. It’s the little things that are unexpected that make the difference 😘",
                    "author": "ruphun",
                    "id": "fw37k3c",
                    "parent_id": "t1_fw34e0x",
                    "score": 0,
                    "created_utc": 1593196506.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I'm betting you're one of those people who would argue about how much a SAHM works versus how much you work. With all the love, of course. 😂",
            "author": "atypicalsb",
            "id": "fw31wr4",
            "parent_id": "t1_fw314pu",
            "score": 12,
            "created_utc": 1593193817.0,
            "replies": [
                {
                    "body": "I kid I kid. It meant to  a joke 🤣😜",
                    "author": "ruphun",
                    "id": "fw37eqa",
                    "parent_id": "t1_fw31wr4",
                    "score": -2,
                    "created_utc": 1593196436.0,
                    "replies": []
                }
            ]
        },
        {
            "body": ">I am a Socialist\n\nTell me more about who should pay allowance to your sugar babies.",
            "author": "GDarn",
            "id": "fw3850u",
            "parent_id": "t1_fw32qty",
            "score": 2,
            "created_utc": 1593196788.0,
            "replies": [
                {
                    "body": "Me, but if I couldn't I'd expect the government to pick up 90% of the cost.  😁",
                    "author": "TY2022",
                    "id": "fw3imdp",
                    "parent_id": "t1_fw3850u",
                    "score": 3,
                    "created_utc": 1593201953.0,
                    "replies": [
                        {
                            "body": "You do realize that the government would assign you a state approved SB though?",
                            "author": "GDarn",
                            "id": "fw3ltxm",
                            "parent_id": "t1_fw3imdp",
                            "score": 2,
                            "created_utc": 1593203594.0,
                            "replies": [
                                {
                                    "body": "lololololol\n\nI'm gonna hold out for the [72 virgins](https://en.wikipedia.org/wiki/Houri#Sexual_intercourse_in_Paradise) to avoid mixing church and state.",
                                    "author": "TY2022",
                                    "id": "fw3mn9h",
                                    "parent_id": "t1_fw3ltxm",
                                    "score": 1,
                                    "created_utc": 1593204009.0,
                                    "replies": [
                                        {
                                            "body": "And I will slowly back away, holding my empty hands  up so they are clearly visible.\n\nNot touching holy war martyr comments with a flagpole, thank you very much :)",
                                            "author": "GDarn",
                                            "id": "fw3n8rj",
                                            "parent_id": "t1_fw3mn9h",
                                            "score": 1,
                                            "created_utc": 1593204310.0,
                                            "replies": [
                                                {
                                                    "body": "Aha.  By playing zee nuclear card I triumph once again!  Savoir-Faire eez everywhere!",
                                                    "author": "TY2022",
                                                    "id": "fw3oube",
                                                    "parent_id": "t1_fw3n8rj",
                                                    "score": 2,
                                                    "created_utc": 1593205130.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "😂😂",
                            "author": "a94seek",
                            "id": "fw3ki1c",
                            "parent_id": "t1_fw3imdp",
                            "score": 0,
                            "created_utc": 1593202917.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Yikes! Those dont sound like a traditional Sbs",
            "author": "SomethingSweet_x0",
            "id": "fw3747y",
            "parent_id": "t1_fw356qv",
            "score": 7,
            "created_utc": 1593196294.0,
            "replies": [
                {
                    "body": "IKR?  I've never met a girl whom I felt was a traditional SB.  I don't think they exist.",
                    "author": "nemo69_1999",
                    "id": "fw38kyx",
                    "parent_id": "t1_fw3747y",
                    "score": -2,
                    "created_utc": 1593197003.0,
                    "replies": [
                        {
                            "body": "They exist 😘",
                            "author": "azucarbebe22",
                            "id": "fw3ael2",
                            "parent_id": "t1_fw38kyx",
                            "score": 3,
                            "created_utc": 1593197872.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "This sounds like bad screening. Do you have sex with the girls on 1st M&G. Your probably running into either sex worker SB or undercover escorts.",
            "author": "CspanSF",
            "id": "fw421wb",
            "parent_id": "t1_fw356qv",
            "score": 3,
            "created_utc": 1593212042.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "fw32zwn",
            "parent_id": "t1_fw30euv",
            "score": 19,
            "created_utc": 1593194323.0,
            "replies": [
                {
                    "body": "No that’s exactly what i meant! And summed up so much better than I could have written it.",
                    "author": "SomethingSweet_x0",
                    "id": "fw37a8d",
                    "parent_id": "t1_fw32zwn",
                    "score": 8,
                    "created_utc": 1593196375.0,
                    "replies": []
                },
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "fw33j7n",
                    "parent_id": "t1_fw32zwn",
                    "score": -3,
                    "created_utc": 1593194580.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "fw33ry8",
                            "parent_id": "t1_fw33j7n",
                            "score": 8,
                            "created_utc": 1593194697.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "fw34bkg",
                                    "parent_id": "t1_fw33ry8",
                                    "score": -5,
                                    "created_utc": 1593194959.0,
                                    "replies": [
                                        {
                                            "body": "[deleted]",
                                            "author": null,
                                            "id": "fw378dy",
                                            "parent_id": "t1_fw34bkg",
                                            "score": 2,
                                            "created_utc": 1593196350.0,
                                            "replies": [
                                                {
                                                    "body": "[deleted]",
                                                    "author": null,
                                                    "id": "fw3c8cr",
                                                    "parent_id": "t1_fw378dy",
                                                    "score": 0,
                                                    "created_utc": 1593198759.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "So when you said dont do anything you aren't comfortable doing, rubs me the wrong way Hopefully this explains why.\n\nWhen you are raised as a woman or transition to one (especially in certain areas or lifestyles) you don't have the option of  \"don't do anything you're uncomfortable doing.\" I hate to break it too you, but we are LITERALLY taught that we have no power, to be quiet, and even if it sucks to do what our loved ones, jobs and more require.\n\n\\-Boyfriend likes anal and you hate it? Do it anyway, or you are whiny and dont love him. (Heaven forbid YOU ask him to try and he will act like you nearly killed him with a  pinky finger.)\n\n\\- Working at a job and the boss harresses you? He is so nice he wouldnt DARE do that be quiet! (You report it anyway and he is MOVED STORES NOT FIRED)\n\n\\- Your family wants to come over despite you needing space? Why dont you love them? Your a bitch! (Do this to them however and you are a bitch for not giving space enough)\n\nYou have to set boundaries that are not taught to you ever.  So for the rest of your life you have to work on a power imbalance in everything you do, and get used to being called names and more for demanding what you are worth in time, money and space. If you are are lucky and learn them you get to develop thick skin early but STILL have to fight to be heard and boundaries respected.\n\nbeing uncomfortable is a state alot of woman remain in on a daily basis.",
            "author": "Ipatchcat",
            "id": "fw33pnj",
            "parent_id": "t1_fw30euv",
            "score": 8,
            "created_utc": 1593194667.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "fw3f5k6",
                    "parent_id": "t1_fw33pnj",
                    "score": 0,
                    "created_utc": 1593200208.0,
                    "replies": [
                        {
                            "body": ">I believe dating is a simple dynamic\n\nIf something involves the interaction of two people, it's not a simple dynamic.",
                            "author": "TY2022",
                            "id": "fw3kjh4",
                            "parent_id": "t1_fw3f5k6",
                            "score": 2,
                            "created_utc": 1593202937.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Of course and by tolerating what SDs want- by no means am I suggesting going against your own set rules/boundaries/morals/etc. I know connections can be built through SRs. I’ve had them before and they are lovely. But those legitimate connections are because I show my true self and they have accepted it. They have been ok with me coming over some days without my hair perfectly done or without wearing a tight dress and heels. Those SDs are the ones who totally rock and anyone would want to go above and beyond to appreciate them fully. \n\nIn terms of dating - you’re 100% right, there is no guarantee anything will last. But the main difference between vanilla and sugar is that in vanilla 9 times out of 10 it’s a “this is what you get, take it or leave it” mentality because who would want to be in a relationship or anything beyond a few dates, with someone that you have to constantly be on “your best behavior” with? I love SRs. They exist for a purpose and its to give people a taste of this fantasy world that no one would be able to maintain if not for the sugar on both ends. The moral of my rant, albeit long winded and confusing, is less about whether connections can form and more so to critique the people who think that being this “perfect Sb” in a “perfect SR” comes without diligent effort and work to make it come off so effortless.",
            "author": "SomethingSweet_x0",
            "id": "fw334mh",
            "parent_id": "t1_fw30euv",
            "score": 5,
            "created_utc": 1593194385.0,
            "replies": []
        },
        {
            "body": "🙄🙄🙄",
            "author": "LikeHoney99",
            "id": "fw31um3",
            "parent_id": "t1_fw30euv",
            "score": 7,
            "created_utc": 1593193789.0,
            "replies": []
        },
        {
            "body": "Then why complain about wanting a “real connection”? Not you specifically, I don’t know you. But for the ones that do.",
            "author": "pumpkinspicedcream",
            "id": "fw33y3m",
            "parent_id": "t1_fw3333f",
            "score": 13,
            "created_utc": 1593194778.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "fw37m7g",
            "parent_id": "t1_fw3333f",
            "score": 9,
            "created_utc": 1593196535.0,
            "replies": [
                {
                    "body": "The only way for it to not feel transactional, is for you to like each other, and that comes with time.   I expect things to feel a little bit transactional in the beginning",
                    "author": "LotBuilder",
                    "id": "fw3du60",
                    "parent_id": "t1_fw37m7g",
                    "score": -2,
                    "created_utc": 1593199553.0,
                    "replies": []
                }
            ]
        },
        {
            "body": ">We are not paying for real, we are paying for the idealized version of a hot younger GF.\n\nWho is this \"we\" you are talking about?\n\nGod knows it does not include me :)",
            "author": "GDarn",
            "id": "fw38cku",
            "parent_id": "t1_fw3333f",
            "score": 7,
            "created_utc": 1593196889.0,
            "replies": [
                {
                    "body": "Do you want moodiness, sweatpants, and unshaved legs?   Do you want her to vent to you daily? Do you want to get dragged into doing chores like moving or putting together ikea furniture?  Do you want her to cancel or change plans on you like she would a regular boyfriend?\n\nI don’t want that.  I want to put together a cute smiling version and if part of that is an act… That’s just life.",
                    "author": "LotBuilder",
                    "id": "fw3eexw",
                    "parent_id": "t1_fw38cku",
                    "score": -4,
                    "created_utc": 1593199838.0,
                    "replies": [
                        {
                            "body": ">I don’t want that. I want to put together a cute smiling version and if part of that is an act… That’s just life.\n\nCool - you do you.\n\nJust understand that when you say \"we\" instead of \"I\", you will get people like me objecting to you speaking on their behalf.\n\nI don't claim to speak for \"us\", nor should you.",
                            "author": "GDarn",
                            "id": "fw3frt0",
                            "parent_id": "t1_fw3eexw",
                            "score": 6,
                            "created_utc": 1593200513.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Hey there’s nothing wrong with that mentality! I’m all for men who are looking for the gf “experience” and make that clear from the start. It’s the men that say they want that, but it can not come off as transactional at all, AND THEN get butthurt when they realize she actually isn’t as “connected” like she portrayed",
            "author": "SomethingSweet_x0",
            "id": "fw3859v",
            "parent_id": "t1_fw3333f",
            "score": 5,
            "created_utc": 1593196791.0,
            "replies": [
                {
                    "body": "I am starting to get to the point of wondering if we need more terminology or distinctions around how we classify SRs.  I want a real emotional connection, which means I want the bad too--like many a man, I enjoy trying to help and solve problems--but I recognize I'm not in the majority.  My SBs definitely know that I'm not the norm but they haven't been able to shift their mindset and continue to want to provide the best (positive) experience even when I ask them to not do so.  Perhaps if we have more ways to classify an SR, we could get people to align upfront rather than find out that we're not aligned even when using the same terminology?  :/",
                    "author": null,
                    "id": "fw39p8l",
                    "parent_id": "t1_fw3859v",
                    "score": 2,
                    "created_utc": 1593197532.0,
                    "replies": [
                        {
                            "body": "To be fair I think it has to do with other messages received. If everyone else that they seek advice for SRs with is telling them “don’t mess up” or they see other SDs saying that by not always being in a good mood can come off as “dramatic” - it’s no shock why they worry to show those sides. There’s sooooo many sbs and while all of us don’t want to think we will get dumped- it’s always a possibility. I think the last thing we want to do is be a contribution for a premature ending to an SR especially if we can avoid it by putting our best foot forward. I agree though- it’s so much easier to just be authentic and I’m thankful I’ve met SDs who are gracious for me being myself",
                            "author": "SomethingSweet_x0",
                            "id": "fw3ao04",
                            "parent_id": "t1_fw39p8l",
                            "score": 5,
                            "created_utc": 1593197997.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Am I in the wrong bowl? Because I'm being gifted for being real AF. That's how my man likes it. 😂",
            "author": "atypicalsb",
            "id": "fw34e4g",
            "parent_id": "t1_fw3333f",
            "score": 7,
            "created_utc": 1593194992.0,
            "replies": [
                {
                    "body": "Girl I have the types of SRs that you do. I’m 100% me all day err day. But a lot of the SDs I see on here probably would drop me like a bad habit if they saw the real me - makes me thankful that there are some that are appreciative of authentic connections vs superficial “I’m gonna say what you want to hear” so I don’t get dumped",
                    "author": "SomethingSweet_x0",
                    "id": "fw37pbx",
                    "parent_id": "t1_fw34e4g",
                    "score": 7,
                    "created_utc": 1593196577.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I think that's perfectly fair, if you're paying top dollar for a professional service experience, and are cool if she never really \"likes\" you because she can never relax and be a human being with flaws, feelings, stress, she's always performing and \"on\".",
            "author": "sugarsenior2",
            "id": "fw6i9k0",
            "parent_id": "t1_fw3333f",
            "score": 3,
            "created_utc": 1593276473.0,
            "replies": [
                {
                    "body": "The reality is that we are hanging out for 4/5 hours per week.  I want the best version of them at that time.  I believe you have to look and feel sexy to be really sexy.  We are all going through stuff,  put that aside for a few hours.  I put forward my best effort too.  My grooming and hygiene is flawless,  my clothes are fresh and clean,  my house is spotless.  It takes effort on my end and I just expect the same in return.  A regular GF that I saw daily would not get the same experience because it’s hard to be date ready 24/7.  As we see each other longer and have extended trips that changes a little.   I’ve been doing this since 2008 and I have had a dozen arrangements that lasted 2-4 years so I’m not overly worried if they like me or not,  they do, my bigger challenge is telling them why they can’t move in.  \n\nIf half my SB’s came over “comfortable” they would be wearing the same yoga pants and crop top covered in pet hair they have been rocking for two days and their hair would smell like the 1/8 of kush they just inhaled mixed with Kombucha and Tzatziki.   I love all my little crazy hippy Gypsies but I need them polish up a little bit before a date.",
                    "author": "LotBuilder",
                    "id": "fw6kgjw",
                    "parent_id": "t1_fw6i9k0",
                    "score": -1,
                    "created_utc": 1593277619.0,
                    "replies": [
                        {
                            "body": "That's fair.",
                            "author": "sugarsenior2",
                            "id": "fwecsek",
                            "parent_id": "t1_fw6kgjw",
                            "score": 1,
                            "created_utc": 1593459063.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Exactly!",
            "author": "testing1to3",
            "id": "fw3hbmm",
            "parent_id": "t1_fw3f5n2",
            "score": 3,
            "created_utc": 1593201293.0,
            "replies": []
        },
        {
            "body": "AMEN to you! There’s been plenty of SDs I’ve met who I’ve actually questioned whether they were wearing clean clothes before coming to a m&g.",
            "author": "SomethingSweet_x0",
            "id": "fw34olf",
            "parent_id": "t1_fw31rmy",
            "score": 15,
            "created_utc": 1593195130.0,
            "replies": [
                {
                    "body": ">I’ve actually questioned whether they were wearing clean clothes\n\nBet that put a damper on the mood.",
                    "author": "TY2022",
                    "id": "fw3j8pz",
                    "parent_id": "t1_fw34olf",
                    "score": 5,
                    "created_utc": 1593202273.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Don't spend a second worrying about what anyone says about you or your thesis.  Only one aspect is risk-free: someone will disagree with you.",
            "author": "TY2022",
            "id": "fw3jii8",
            "parent_id": "t1_fw36ugb",
            "score": 7,
            "created_utc": 1593202413.0,
            "replies": [
                {
                    "body": "Oh trust me, I expected to make some waves!",
                    "author": "SomethingSweet_x0",
                    "id": "fw4dvk4",
                    "parent_id": "t1_fw3jii8",
                    "score": 2,
                    "created_utc": 1593218886.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "If you have met good SDs try to talk about them vs bashing the bad one’s. There are always going to be the bad and rotten apples in a huge basket. We accept that as SDs.",
            "author": null,
            "id": "fw3l1vq",
            "parent_id": "t1_fw36ugb",
            "score": -7,
            "created_utc": 1593203196.0,
            "replies": [
                {
                    "body": "People bash bad SBs and bad SDs all the time. The question here is: why are you mad at this post?",
                    "author": "AfroBabySugg",
                    "id": "fw3ny5x",
                    "parent_id": "t1_fw3l1vq",
                    "score": 9,
                    "created_utc": 1593204672.0,
                    "replies": [
                        {
                            "body": "Why do you think?",
                            "author": null,
                            "id": "fw4gvk6",
                            "parent_id": "t1_fw3ny5x",
                            "score": -3,
                            "created_utc": 1593220720.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Very true, there are people in any environment who are totally full of themselves and think they are entitled to perfection for what little they put in. Best to just avoid those people.\n\nAs far as there being so many to pick from, ratio aside, I can say from experience it takes a lot of time and effort to find someone who is a good fit. Sometimes I think SBs psyche themselves out by looking at all the other beautiful women on SA. Just remember, half of them never respond and most of the ones who do are unable to hold an adult conversation or have no intention of meeting up. You might be replaceable but you aren't easily replaceable.",
            "author": "canavatar12",
            "id": "fw3bfnp",
            "parent_id": "t1_fw39e8t",
            "score": 5,
            "created_utc": 1593198368.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "fw3gkip",
            "parent_id": "t1_fw3aypv",
            "score": 2,
            "created_utc": 1593200914.0,
            "replies": [
                {
                    "body": "For me personally, I move away from ppm as soon as possible. Having just one amount or allowance totally gets rid of that notion that this date can “cost” this much whereas another date should cost something else",
                    "author": "SomethingSweet_x0",
                    "id": "fw3hkkv",
                    "parent_id": "t1_fw3gkip",
                    "score": 3,
                    "created_utc": 1593201419.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "OK, that's interesting.  Honestly I haven't noticed all of those comments, but I will look harder for them.    Maybe because I am not that demanding with my SB, I assume most SDs are like that and that the complaints are for truly egregious things.",
            "author": "UseTheForceRey",
            "id": "fw4fsso",
            "parent_id": "t1_fw4f7qm",
            "score": 1,
            "created_utc": 1593220051.0,
            "replies": [
                {
                    "body": "Well you most likely are a great SD. It’s probably crazy to think that others view it so quid pro quo but sometimes it comes off that way. Keep doing what your doing and making your Sb feel amazing 😊",
                    "author": "SomethingSweet_x0",
                    "id": "fw4hmuh",
                    "parent_id": "t1_fw4fsso",
                    "score": 2,
                    "created_utc": 1593221187.0,
                    "replies": [
                        {
                            "body": "Haha, thanks.",
                            "author": "UseTheForceRey",
                            "id": "fw4opcd",
                            "parent_id": "t1_fw4hmuh",
                            "score": 1,
                            "created_utc": 1593225635.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Thx! I try not to be. I love going over and above. It’s the little things that are unexpected that make the difference 😘",
            "author": "ruphun",
            "id": "fw37k3c",
            "parent_id": "t1_fw34e0x",
            "score": 0,
            "created_utc": 1593196506.0,
            "replies": []
        },
        {
            "body": "I kid I kid. It meant to  a joke 🤣😜",
            "author": "ruphun",
            "id": "fw37eqa",
            "parent_id": "t1_fw31wr4",
            "score": -2,
            "created_utc": 1593196436.0,
            "replies": []
        },
        {
            "body": "Me, but if I couldn't I'd expect the government to pick up 90% of the cost.  😁",
            "author": "TY2022",
            "id": "fw3imdp",
            "parent_id": "t1_fw3850u",
            "score": 3,
            "created_utc": 1593201953.0,
            "replies": [
                {
                    "body": "You do realize that the government would assign you a state approved SB though?",
                    "author": "GDarn",
                    "id": "fw3ltxm",
                    "parent_id": "t1_fw3imdp",
                    "score": 2,
                    "created_utc": 1593203594.0,
                    "replies": [
                        {
                            "body": "lololololol\n\nI'm gonna hold out for the [72 virgins](https://en.wikipedia.org/wiki/Houri#Sexual_intercourse_in_Paradise) to avoid mixing church and state.",
                            "author": "TY2022",
                            "id": "fw3mn9h",
                            "parent_id": "t1_fw3ltxm",
                            "score": 1,
                            "created_utc": 1593204009.0,
                            "replies": [
                                {
                                    "body": "And I will slowly back away, holding my empty hands  up so they are clearly visible.\n\nNot touching holy war martyr comments with a flagpole, thank you very much :)",
                                    "author": "GDarn",
                                    "id": "fw3n8rj",
                                    "parent_id": "t1_fw3mn9h",
                                    "score": 1,
                                    "created_utc": 1593204310.0,
                                    "replies": [
                                        {
                                            "body": "Aha.  By playing zee nuclear card I triumph once again!  Savoir-Faire eez everywhere!",
                                            "author": "TY2022",
                                            "id": "fw3oube",
                                            "parent_id": "t1_fw3n8rj",
                                            "score": 2,
                                            "created_utc": 1593205130.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "😂😂",
                    "author": "a94seek",
                    "id": "fw3ki1c",
                    "parent_id": "t1_fw3imdp",
                    "score": 0,
                    "created_utc": 1593202917.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "IKR?  I've never met a girl whom I felt was a traditional SB.  I don't think they exist.",
            "author": "nemo69_1999",
            "id": "fw38kyx",
            "parent_id": "t1_fw3747y",
            "score": -2,
            "created_utc": 1593197003.0,
            "replies": [
                {
                    "body": "They exist 😘",
                    "author": "azucarbebe22",
                    "id": "fw3ael2",
                    "parent_id": "t1_fw38kyx",
                    "score": 3,
                    "created_utc": 1593197872.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "No that’s exactly what i meant! And summed up so much better than I could have written it.",
            "author": "SomethingSweet_x0",
            "id": "fw37a8d",
            "parent_id": "t1_fw32zwn",
            "score": 8,
            "created_utc": 1593196375.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "fw33j7n",
            "parent_id": "t1_fw32zwn",
            "score": -3,
            "created_utc": 1593194580.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "fw33ry8",
                    "parent_id": "t1_fw33j7n",
                    "score": 8,
                    "created_utc": 1593194697.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "fw34bkg",
                            "parent_id": "t1_fw33ry8",
                            "score": -5,
                            "created_utc": 1593194959.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "fw378dy",
                                    "parent_id": "t1_fw34bkg",
                                    "score": 2,
                                    "created_utc": 1593196350.0,
                                    "replies": [
                                        {
                                            "body": "[deleted]",
                                            "author": null,
                                            "id": "fw3c8cr",
                                            "parent_id": "t1_fw378dy",
                                            "score": 0,
                                            "created_utc": 1593198759.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "fw3f5k6",
            "parent_id": "t1_fw33pnj",
            "score": 0,
            "created_utc": 1593200208.0,
            "replies": [
                {
                    "body": ">I believe dating is a simple dynamic\n\nIf something involves the interaction of two people, it's not a simple dynamic.",
                    "author": "TY2022",
                    "id": "fw3kjh4",
                    "parent_id": "t1_fw3f5k6",
                    "score": 2,
                    "created_utc": 1593202937.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "The only way for it to not feel transactional, is for you to like each other, and that comes with time.   I expect things to feel a little bit transactional in the beginning",
            "author": "LotBuilder",
            "id": "fw3du60",
            "parent_id": "t1_fw37m7g",
            "score": -2,
            "created_utc": 1593199553.0,
            "replies": []
        },
        {
            "body": "Do you want moodiness, sweatpants, and unshaved legs?   Do you want her to vent to you daily? Do you want to get dragged into doing chores like moving or putting together ikea furniture?  Do you want her to cancel or change plans on you like she would a regular boyfriend?\n\nI don’t want that.  I want to put together a cute smiling version and if part of that is an act… That’s just life.",
            "author": "LotBuilder",
            "id": "fw3eexw",
            "parent_id": "t1_fw38cku",
            "score": -4,
            "created_utc": 1593199838.0,
            "replies": [
                {
                    "body": ">I don’t want that. I want to put together a cute smiling version and if part of that is an act… That’s just life.\n\nCool - you do you.\n\nJust understand that when you say \"we\" instead of \"I\", you will get people like me objecting to you speaking on their behalf.\n\nI don't claim to speak for \"us\", nor should you.",
                    "author": "GDarn",
                    "id": "fw3frt0",
                    "parent_id": "t1_fw3eexw",
                    "score": 6,
                    "created_utc": 1593200513.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I am starting to get to the point of wondering if we need more terminology or distinctions around how we classify SRs.  I want a real emotional connection, which means I want the bad too--like many a man, I enjoy trying to help and solve problems--but I recognize I'm not in the majority.  My SBs definitely know that I'm not the norm but they haven't been able to shift their mindset and continue to want to provide the best (positive) experience even when I ask them to not do so.  Perhaps if we have more ways to classify an SR, we could get people to align upfront rather than find out that we're not aligned even when using the same terminology?  :/",
            "author": null,
            "id": "fw39p8l",
            "parent_id": "t1_fw3859v",
            "score": 2,
            "created_utc": 1593197532.0,
            "replies": [
                {
                    "body": "To be fair I think it has to do with other messages received. If everyone else that they seek advice for SRs with is telling them “don’t mess up” or they see other SDs saying that by not always being in a good mood can come off as “dramatic” - it’s no shock why they worry to show those sides. There’s sooooo many sbs and while all of us don’t want to think we will get dumped- it’s always a possibility. I think the last thing we want to do is be a contribution for a premature ending to an SR especially if we can avoid it by putting our best foot forward. I agree though- it’s so much easier to just be authentic and I’m thankful I’ve met SDs who are gracious for me being myself",
                    "author": "SomethingSweet_x0",
                    "id": "fw3ao04",
                    "parent_id": "t1_fw39p8l",
                    "score": 5,
                    "created_utc": 1593197997.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Girl I have the types of SRs that you do. I’m 100% me all day err day. But a lot of the SDs I see on here probably would drop me like a bad habit if they saw the real me - makes me thankful that there are some that are appreciative of authentic connections vs superficial “I’m gonna say what you want to hear” so I don’t get dumped",
            "author": "SomethingSweet_x0",
            "id": "fw37pbx",
            "parent_id": "t1_fw34e4g",
            "score": 7,
            "created_utc": 1593196577.0,
            "replies": []
        },
        {
            "body": "The reality is that we are hanging out for 4/5 hours per week.  I want the best version of them at that time.  I believe you have to look and feel sexy to be really sexy.  We are all going through stuff,  put that aside for a few hours.  I put forward my best effort too.  My grooming and hygiene is flawless,  my clothes are fresh and clean,  my house is spotless.  It takes effort on my end and I just expect the same in return.  A regular GF that I saw daily would not get the same experience because it’s hard to be date ready 24/7.  As we see each other longer and have extended trips that changes a little.   I’ve been doing this since 2008 and I have had a dozen arrangements that lasted 2-4 years so I’m not overly worried if they like me or not,  they do, my bigger challenge is telling them why they can’t move in.  \n\nIf half my SB’s came over “comfortable” they would be wearing the same yoga pants and crop top covered in pet hair they have been rocking for two days and their hair would smell like the 1/8 of kush they just inhaled mixed with Kombucha and Tzatziki.   I love all my little crazy hippy Gypsies but I need them polish up a little bit before a date.",
            "author": "LotBuilder",
            "id": "fw6kgjw",
            "parent_id": "t1_fw6i9k0",
            "score": -1,
            "created_utc": 1593277619.0,
            "replies": [
                {
                    "body": "That's fair.",
                    "author": "sugarsenior2",
                    "id": "fwecsek",
                    "parent_id": "t1_fw6kgjw",
                    "score": 1,
                    "created_utc": 1593459063.0,
                    "replies": []
                }
            ]
        },
        {
            "body": ">I’ve actually questioned whether they were wearing clean clothes\n\nBet that put a damper on the mood.",
            "author": "TY2022",
            "id": "fw3j8pz",
            "parent_id": "t1_fw34olf",
            "score": 5,
            "created_utc": 1593202273.0,
            "replies": []
        },
        {
            "body": "Oh trust me, I expected to make some waves!",
            "author": "SomethingSweet_x0",
            "id": "fw4dvk4",
            "parent_id": "t1_fw3jii8",
            "score": 2,
            "created_utc": 1593218886.0,
            "replies": []
        },
        {
            "body": "People bash bad SBs and bad SDs all the time. The question here is: why are you mad at this post?",
            "author": "AfroBabySugg",
            "id": "fw3ny5x",
            "parent_id": "t1_fw3l1vq",
            "score": 9,
            "created_utc": 1593204672.0,
            "replies": [
                {
                    "body": "Why do you think?",
                    "author": null,
                    "id": "fw4gvk6",
                    "parent_id": "t1_fw3ny5x",
                    "score": -3,
                    "created_utc": 1593220720.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "For me personally, I move away from ppm as soon as possible. Having just one amount or allowance totally gets rid of that notion that this date can “cost” this much whereas another date should cost something else",
            "author": "SomethingSweet_x0",
            "id": "fw3hkkv",
            "parent_id": "t1_fw3gkip",
            "score": 3,
            "created_utc": 1593201419.0,
            "replies": []
        },
        {
            "body": "Well you most likely are a great SD. It’s probably crazy to think that others view it so quid pro quo but sometimes it comes off that way. Keep doing what your doing and making your Sb feel amazing 😊",
            "author": "SomethingSweet_x0",
            "id": "fw4hmuh",
            "parent_id": "t1_fw4fsso",
            "score": 2,
            "created_utc": 1593221187.0,
            "replies": [
                {
                    "body": "Haha, thanks.",
                    "author": "UseTheForceRey",
                    "id": "fw4opcd",
                    "parent_id": "t1_fw4hmuh",
                    "score": 1,
                    "created_utc": 1593225635.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "You do realize that the government would assign you a state approved SB though?",
            "author": "GDarn",
            "id": "fw3ltxm",
            "parent_id": "t1_fw3imdp",
            "score": 2,
            "created_utc": 1593203594.0,
            "replies": [
                {
                    "body": "lololololol\n\nI'm gonna hold out for the [72 virgins](https://en.wikipedia.org/wiki/Houri#Sexual_intercourse_in_Paradise) to avoid mixing church and state.",
                    "author": "TY2022",
                    "id": "fw3mn9h",
                    "parent_id": "t1_fw3ltxm",
                    "score": 1,
                    "created_utc": 1593204009.0,
                    "replies": [
                        {
                            "body": "And I will slowly back away, holding my empty hands  up so they are clearly visible.\n\nNot touching holy war martyr comments with a flagpole, thank you very much :)",
                            "author": "GDarn",
                            "id": "fw3n8rj",
                            "parent_id": "t1_fw3mn9h",
                            "score": 1,
                            "created_utc": 1593204310.0,
                            "replies": [
                                {
                                    "body": "Aha.  By playing zee nuclear card I triumph once again!  Savoir-Faire eez everywhere!",
                                    "author": "TY2022",
                                    "id": "fw3oube",
                                    "parent_id": "t1_fw3n8rj",
                                    "score": 2,
                                    "created_utc": 1593205130.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "😂😂",
            "author": "a94seek",
            "id": "fw3ki1c",
            "parent_id": "t1_fw3imdp",
            "score": 0,
            "created_utc": 1593202917.0,
            "replies": []
        },
        {
            "body": "They exist 😘",
            "author": "azucarbebe22",
            "id": "fw3ael2",
            "parent_id": "t1_fw38kyx",
            "score": 3,
            "created_utc": 1593197872.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "fw33ry8",
            "parent_id": "t1_fw33j7n",
            "score": 8,
            "created_utc": 1593194697.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "fw34bkg",
                    "parent_id": "t1_fw33ry8",
                    "score": -5,
                    "created_utc": 1593194959.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "fw378dy",
                            "parent_id": "t1_fw34bkg",
                            "score": 2,
                            "created_utc": 1593196350.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "fw3c8cr",
                                    "parent_id": "t1_fw378dy",
                                    "score": 0,
                                    "created_utc": 1593198759.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": ">I believe dating is a simple dynamic\n\nIf something involves the interaction of two people, it's not a simple dynamic.",
            "author": "TY2022",
            "id": "fw3kjh4",
            "parent_id": "t1_fw3f5k6",
            "score": 2,
            "created_utc": 1593202937.0,
            "replies": []
        },
        {
            "body": ">I don’t want that. I want to put together a cute smiling version and if part of that is an act… That’s just life.\n\nCool - you do you.\n\nJust understand that when you say \"we\" instead of \"I\", you will get people like me objecting to you speaking on their behalf.\n\nI don't claim to speak for \"us\", nor should you.",
            "author": "GDarn",
            "id": "fw3frt0",
            "parent_id": "t1_fw3eexw",
            "score": 6,
            "created_utc": 1593200513.0,
            "replies": []
        },
        {
            "body": "To be fair I think it has to do with other messages received. If everyone else that they seek advice for SRs with is telling them “don’t mess up” or they see other SDs saying that by not always being in a good mood can come off as “dramatic” - it’s no shock why they worry to show those sides. There’s sooooo many sbs and while all of us don’t want to think we will get dumped- it’s always a possibility. I think the last thing we want to do is be a contribution for a premature ending to an SR especially if we can avoid it by putting our best foot forward. I agree though- it’s so much easier to just be authentic and I’m thankful I’ve met SDs who are gracious for me being myself",
            "author": "SomethingSweet_x0",
            "id": "fw3ao04",
            "parent_id": "t1_fw39p8l",
            "score": 5,
            "created_utc": 1593197997.0,
            "replies": []
        },
        {
            "body": "That's fair.",
            "author": "sugarsenior2",
            "id": "fwecsek",
            "parent_id": "t1_fw6kgjw",
            "score": 1,
            "created_utc": 1593459063.0,
            "replies": []
        },
        {
            "body": "Why do you think?",
            "author": null,
            "id": "fw4gvk6",
            "parent_id": "t1_fw3ny5x",
            "score": -3,
            "created_utc": 1593220720.0,
            "replies": []
        },
        {
            "body": "Haha, thanks.",
            "author": "UseTheForceRey",
            "id": "fw4opcd",
            "parent_id": "t1_fw4hmuh",
            "score": 1,
            "created_utc": 1593225635.0,
            "replies": []
        },
        {
            "body": "lololololol\n\nI'm gonna hold out for the [72 virgins](https://en.wikipedia.org/wiki/Houri#Sexual_intercourse_in_Paradise) to avoid mixing church and state.",
            "author": "TY2022",
            "id": "fw3mn9h",
            "parent_id": "t1_fw3ltxm",
            "score": 1,
            "created_utc": 1593204009.0,
            "replies": [
                {
                    "body": "And I will slowly back away, holding my empty hands  up so they are clearly visible.\n\nNot touching holy war martyr comments with a flagpole, thank you very much :)",
                    "author": "GDarn",
                    "id": "fw3n8rj",
                    "parent_id": "t1_fw3mn9h",
                    "score": 1,
                    "created_utc": 1593204310.0,
                    "replies": [
                        {
                            "body": "Aha.  By playing zee nuclear card I triumph once again!  Savoir-Faire eez everywhere!",
                            "author": "TY2022",
                            "id": "fw3oube",
                            "parent_id": "t1_fw3n8rj",
                            "score": 2,
                            "created_utc": 1593205130.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "fw34bkg",
            "parent_id": "t1_fw33ry8",
            "score": -5,
            "created_utc": 1593194959.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "fw378dy",
                    "parent_id": "t1_fw34bkg",
                    "score": 2,
                    "created_utc": 1593196350.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "fw3c8cr",
                            "parent_id": "t1_fw378dy",
                            "score": 0,
                            "created_utc": 1593198759.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "And I will slowly back away, holding my empty hands  up so they are clearly visible.\n\nNot touching holy war martyr comments with a flagpole, thank you very much :)",
            "author": "GDarn",
            "id": "fw3n8rj",
            "parent_id": "t1_fw3mn9h",
            "score": 1,
            "created_utc": 1593204310.0,
            "replies": [
                {
                    "body": "Aha.  By playing zee nuclear card I triumph once again!  Savoir-Faire eez everywhere!",
                    "author": "TY2022",
                    "id": "fw3oube",
                    "parent_id": "t1_fw3n8rj",
                    "score": 2,
                    "created_utc": 1593205130.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "fw378dy",
            "parent_id": "t1_fw34bkg",
            "score": 2,
            "created_utc": 1593196350.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "fw3c8cr",
                    "parent_id": "t1_fw378dy",
                    "score": 0,
                    "created_utc": 1593198759.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Aha.  By playing zee nuclear card I triumph once again!  Savoir-Faire eez everywhere!",
            "author": "TY2022",
            "id": "fw3oube",
            "parent_id": "t1_fw3n8rj",
            "score": 2,
            "created_utc": 1593205130.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "fw3c8cr",
            "parent_id": "t1_fw378dy",
            "score": 0,
            "created_utc": 1593198759.0,
            "replies": []
        }
    ]
}