{
    "title": "I’ve always wanted to do long hair... but now, not so sure. Should I go back short, keep growing or just clean it up?? ¯\\_(ツ)_/¯",
    "post_id": "gx79d0",
    "post_url": "https://www.reddit.com/r/malehairadvice/comments/gx79d0/ive_always_wanted_to_do_long_hair_but_now_not_so/",
    "author": "yepsen",
    "body": "",
    "url": "https://i.redd.it/o9dqbzqr64351.jpg",
    "score": 296,
    "upvote_ratio": 0.98,
    "created_utc": 1591372774.0,
    "num_comments": 90,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "I dunno man, have you tried conditioner, blow drying, maybe some volumizer?\n\nLong hair requires some maintenance to look good.",
            "author": "diatonico_",
            "id": "fszuxdz",
            "parent_id": "t3_gx79d0",
            "score": 123,
            "created_utc": 1591379949.0,
            "replies": [
                {
                    "body": "What does blow drying do compared to towel drying? And do you use heat?",
                    "author": "Choice_Garbage",
                    "id": "ft0ghq7",
                    "parent_id": "t1_fszuxdz",
                    "score": 19,
                    "created_utc": 1591390343.0,
                    "replies": [
                        {
                            "body": "Blow drying adds some volume, also allows you to \"shape\" how your hair falls. And yes, I use heat. I have more of a loose comb-over style though, my hair isn't all that long.",
                            "author": "diatonico_",
                            "id": "ft0goyt",
                            "parent_id": "t1_ft0ghq7",
                            "score": 20,
                            "created_utc": 1591390445.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Yeah, I use Moroccan Oil shampoo and conditioner but probably not enough...  guessing 2-3 days as of today/this picture. I was originally thinking a Bradley-Cooper-in-A-Star-Is-Born vibe, so the didn’t want it too shiny and voluminous. \n\nMight just need to rethink what I’m doing with it now that I’ve hit the length. \n\nThank you for your advice!",
                    "author": "yepsen",
                    "id": "ft0vggc",
                    "parent_id": "t1_fszuxdz",
                    "score": 14,
                    "created_utc": 1591397658.0,
                    "replies": [
                        {
                            "body": "Some hair just really hates Moroccan Oil just like some hair really hates Aragan Oil or Coconut Oil. You seem to have wavy/curly hair which tends to be harder to manage than straight hair, have you tried getting advice at r/curlyhair?",
                            "author": "okthenbutwhy",
                            "id": "ft1305o",
                            "parent_id": "t1_ft0vggc",
                            "score": 14,
                            "created_utc": 1591401065.0,
                            "replies": [
                                {
                                    "body": "I had not heard that! I wouldn’t say my hair has disliked it... but maybe I should try something else just to see. Not a lot of experience with this long hair thing.",
                                    "author": "yepsen",
                                    "id": "ft18jfh",
                                    "parent_id": "t1_ft1305o",
                                    "score": 7,
                                    "created_utc": 1591403483.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "Condition every day but only shampoo every couple days. Experiment to find the number that works for you.",
                            "author": "divuthen",
                            "id": "ft22m0c",
                            "parent_id": "t1_ft0vggc",
                            "score": 3,
                            "created_utc": 1591417086.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I’d clean it up, shape it a bit, before deciding.",
            "author": "Syrazhe",
            "id": "fszgo1k",
            "parent_id": "t3_gx79d0",
            "score": 71,
            "created_utc": 1591373149.0,
            "replies": [
                {
                    "body": "Probably for the best, yeah. Just being frustrated with it, I think.",
                    "author": "yepsen",
                    "id": "ft0vjmk",
                    "parent_id": "t1_fszgo1k",
                    "score": 9,
                    "created_utc": 1591397701.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Hair looks a little greasy here. I think if you cleaned up and trimmed the beard you would really get the look you’re going for.",
            "author": "PlusTenStrength",
            "id": "fszuuix",
            "parent_id": "t3_gx79d0",
            "score": 58,
            "created_utc": 1591379911.0,
            "replies": [
                {
                    "body": "Greasy is borderline intentional as I was originally thinking a Bradley-Cooper-in-A-Star-Is-Born vibe, so didn’t want it too shiny and voluminous.\n\nProbably time to rethink the direction more than the length.",
                    "author": "yepsen",
                    "id": "ft0vpwn",
                    "parent_id": "t1_fszuuix",
                    "score": 14,
                    "created_utc": 1591397785.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Idk bro, you have the makings of a norsemen.\nI would let it grow into the mane of the gods.",
            "author": "GeneralBass",
            "id": "fszmr37",
            "parent_id": "t3_gx79d0",
            "score": 69,
            "created_utc": 1591376050.0,
            "replies": [
                {
                    "body": "Haha, I have heard that before and it’s definitely a lowkey motivator",
                    "author": "yepsen",
                    "id": "ft0vic7",
                    "parent_id": "t1_fszmr37",
                    "score": 9,
                    "created_utc": 1591397683.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "As someone who has always had long hair, it requires a lot of work and can get caught in stuff and get annoying. It's worth it if you want the change, but know that it'll be more work than short hair, so be ready for the effort.",
            "author": "Komsur",
            "id": "fszsitb",
            "parent_id": "t3_gx79d0",
            "score": 19,
            "created_utc": 1591378803.0,
            "replies": []
        },
        {
            "body": "keep growing imo. i think in a few months youll look badass",
            "author": "Zoldycke",
            "id": "ft043k9",
            "parent_id": "t3_gx79d0",
            "score": 10,
            "created_utc": 1591384337.0,
            "replies": [
                {
                    "body": "It’s frustrating at times, but I do think I’m sticking with it. Thank you!",
                    "author": "yepsen",
                    "id": "ft0w6mm",
                    "parent_id": "t1_ft043k9",
                    "score": 5,
                    "created_utc": 1591398003.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Keep going! You made it this far.",
            "author": "ANUSTART4YOU",
            "id": "ft04sv8",
            "parent_id": "t3_gx79d0",
            "score": 9,
            "created_utc": 1591384669.0,
            "replies": [
                {
                    "body": "That appears to be the verdict and I’m on board for it!",
                    "author": "yepsen",
                    "id": "ft0xycd",
                    "parent_id": "t1_ft04sv8",
                    "score": 5,
                    "created_utc": 1591398791.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Add some long layers, get some curl friendly shampoo and conditioner r/curlyhair, and wait this stage out, you're like six months away from a really decent ponytail, mainbun, and once you give those lovely curls a proper trim and treatment you'll never think about cutting it again.",
            "author": "aestheticallly",
            "id": "ft02so2",
            "parent_id": "t3_gx79d0",
            "score": 10,
            "created_utc": 1591383718.0,
            "replies": [
                {
                    "body": "I didn’t even realize I had curly hair before I grew this out! I do have Moroccanoil Shampoo & Conditioner and Curl Defining Cream, I just need to gl actually use it more than once or twice a week.\n\nThank you for the advice!",
                    "author": "yepsen",
                    "id": "ft0vxu0",
                    "parent_id": "t1_ft02so2",
                    "score": 3,
                    "created_utc": 1591397889.0,
                    "replies": [
                        {
                            "body": "Oh no, once or twice a week is good for curly hair!  Washing more frequently will actually make you oilier at the roots, I would just make sure to apply more condition at the ends and work up the strand rather than from the top down, and apply your cream to the mid strand and ends as well too, (avoid the root)!\n\nEdit:  this is easiest to acheive by applying with your head upside down btw, you might already know that, but just in case you didnt, if you flip your hair forward after the shower all your hair will hang down and you can just scrunch the curl cream into the ends and avoid your roots.\n\nA light trim on your top layers will also increase the bounce and take the weight off those curls, they'll curl even more.  You have seriously beautiful hair!  I would definitely keep frowning it out if I were you!",
                            "author": "aestheticallly",
                            "id": "ft0y2wg",
                            "parent_id": "t1_ft0vxu0",
                            "score": 3,
                            "created_utc": 1591398847.0,
                            "replies": [
                                {
                                    "body": "I’m definitely sticking with it. Really appreciate you advice.",
                                    "author": "yepsen",
                                    "id": "ft0yg1s",
                                    "parent_id": "t1_ft0y2wg",
                                    "score": 2,
                                    "created_utc": 1591399010.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "let the sides and top grow out more, you're almost out of the \"awkward phase\" and it's lookin good bro",
            "author": "myS_",
            "id": "fszvndr",
            "parent_id": "t3_gx79d0",
            "score": 8,
            "created_utc": 1591380300.0,
            "replies": [
                {
                    "body": "Thank you! I’ll keep with it, just hit a frustrating patch.",
                    "author": "yepsen",
                    "id": "ft0w0av",
                    "parent_id": "t1_fszvndr",
                    "score": 1,
                    "created_utc": 1591397922.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Keep growing and join r/FierceFlow for inspiration!",
            "author": "kapouwy",
            "id": "ft04tl4",
            "parent_id": "t3_gx79d0",
            "score": 4,
            "created_utc": 1591384678.0,
            "replies": [
                {
                    "body": "Based Flow’r Inspo. Thank you!",
                    "author": "yepsen",
                    "id": "ft0w83a",
                    "parent_id": "t1_ft04tl4",
                    "score": 1,
                    "created_utc": 1591398023.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "you’ve almost complete an awkward stage. Don’t cut it for no freakin reason mate!",
            "author": "SashCassh",
            "id": "ft07ul4",
            "parent_id": "t3_gx79d0",
            "score": 3,
            "created_utc": 1591386108.0,
            "replies": [
                {
                    "body": "It’s tough, but I’m sticking with it!",
                    "author": "yepsen",
                    "id": "ft0y1z3",
                    "parent_id": "t1_ft07ul4",
                    "score": 2,
                    "created_utc": 1591398835.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I definitely think that you can rock the longer hair, but you'll need some improvements. I'm a dude with long hair and this is what I've learned:\n\n1. You'll absolutely get more bang for your buck with your hair care if you invest in quality shampoos and conditioners. If the labeling tailors it for men, there's a decent chance you should skip on it. Tresemme products, such as the black bottles or the white and green ones that are free of silicones, are the better choices for someone looking to get something cheap. Again, stay away from shit like \"2-in-1s\".\n\n2. Do some research on how frequently (as well as HOW) you should wash and condition your hair. Create 2 - 3 days on your calendar each week that you dedicate to your hair. I'd get a hold of a routine like this before jumping into something like CGM (curly girl method), which is what r/curlyhair is going to showcase to you. CGM is fantastic, but it's something to implement later if your new to having hair like this at all. \n\n3. Don't touch a straightener, curler, or any other heat tool other than a blow dryer, and learn how to use even that correctly. Heat tools will harm your hair in the long run.\n\n4. You should stick to combing your hair with a wide tooth comb to maintain your curls and waves, but sometimes, a good detangling or paddle brush is good to have. At this length, it won't be too bad, but later on, the tangling and matted hair can be annoying to deal with if you don't comb or brush often enough. There are a ton of theories about how and how often to brush or comb your hair, so experiment and see what works for you.\n\n5. Check out some volumizing products, such as mousse or certain gels, to give your hair more oomph. You don't necessarily want the hair on top to be flat against your head, this is considered a bad look. The best way to combat this is a regular washing schedule, the products mentioned above, as well as certain styling techniques that you can google pretty easily.\n\nEdit: just a hint, but I would stay away from having long facial hair while growing out your head hair. Both at the same time is liable to give one the appearance of a gerbil, and an air of homelessness. Keep the facial hair super clean for now, grow it out later once the hair on your head is long enough to offset it.\n\n\nI hope all of that helps. You'll find a lot of great info in r/curlyhair as well as great inspiration at r/fierceflow",
            "author": "Occultist_Kat",
            "id": "ft0r1aq",
            "parent_id": "t3_gx79d0",
            "score": 5,
            "created_utc": 1591395560.0,
            "replies": [
                {
                    "body": "yo, I've been growing my hair out for 9 months now, I did have the back trimmed around the 5th month, now the back is long again and not even with the top and my sides, should I have it trimmed again? will I still be able to do a full bun if I get the back of my hair trimmed because that's what I'm aiming for.",
                    "author": "dexteretoy",
                    "id": "ft4tf6n",
                    "parent_id": "t1_ft0r1aq",
                    "score": 2,
                    "created_utc": 1591456732.0,
                    "replies": [
                        {
                            "body": "Being able to go \"full bun\" depends more on the top and front of your hair, which needs to be longer to reach the back than the.. well, hair that's already there. But you don't necessarily need them to match up. As long as you don't look like you've got a mullet, you're doing fine (that is, unless you want a mullet).",
                            "author": "Occultist_Kat",
                            "id": "ft54n2o",
                            "parent_id": "t1_ft4tf6n",
                            "score": 2,
                            "created_utc": 1591460368.0,
                            "replies": [
                                {
                                    "body": "thanks man, been thinking for a while actually, i'm terrified af to get a haircut thinking that the barber might cut too much, I have to be very specific i think, I guess I'll have the back trimmed then.",
                                    "author": "dexteretoy",
                                    "id": "ft5o4r1",
                                    "parent_id": "t1_ft54n2o",
                                    "score": 1,
                                    "created_utc": 1591466747.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "This is some top notch recommendary. \n\nThank you! \n\nAnd I’ve had that beard for something in the neighborhood of 15 years so it’s a permanent fixture on this dome. Just need to be a bit more mindful of (and my head hair).",
                    "author": "yepsen",
                    "id": "ft0xs3w",
                    "parent_id": "t1_ft0r1aq",
                    "score": 1,
                    "created_utc": 1591398712.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Head over to the curly girl subreddit and learn to ploop",
            "author": "yall_abunch_ofnerds",
            "id": "ft1zimm",
            "parent_id": "t3_gx79d0",
            "score": 4,
            "created_utc": 1591415591.0,
            "replies": []
        },
        {
            "body": "I have no opinion about the hair, just came to say Wilco is the best!",
            "author": "bd1174",
            "id": "ft0epct",
            "parent_id": "t3_gx79d0",
            "score": 3,
            "created_utc": 1591389458.0,
            "replies": [
                {
                    "body": "Wilco will love you, /u/bd1174",
                    "author": "yepsen",
                    "id": "ft0xc8g",
                    "parent_id": "t1_ft0epct",
                    "score": 1,
                    "created_utc": 1591398528.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Probably wash and maintain it. \n\nToo many guys think they can just not get haircuts and have good long hair, nope.\n\nGet a shampoo, the type is more or less not that important but if you find you hair is dry use a hydrating shampoo. I like phytokeratine extreme. \n\nConditioning is the most important. My recommendations aren’t that useful here because I use a platinum blonde conditioner but I’m sure you can find something. Get moisture pumped into your hair.\n\nDo a hair mask weekly. There are lots of good ones but only one S tier that will strengthen your hair more than anything else: olaplex no. 3. \n\nWhen you’re done masking shampooing and conditioning, lightly towel dry your hair and then apply a small amount of hair oil. I like verb’s ghost oil. You could use other stuff again that’s a platinum blonde thing, but it is really nice and lightweight.\n\nThen blowdry your hair. You could use this time to apply something like a curly hair botanical oil or a blowdry spray instead, or also use a sea salt spray or something. I find I get enough heat protection from hair oil but I have incredibly fine, dead straight hair. You may want to try out something else.\n\n\nAll products here are just stuff I like and and found to work well in years of searching, not necessarily recommendations\n\nTl;dr more than anything you need to better maintain your hair and keep it clean. If your hair gets that oily soon after showering you’re going to want to look for products that help deal with that.",
            "author": "Koiq",
            "id": "ft20izo",
            "parent_id": "t3_gx79d0",
            "score": 3,
            "created_utc": 1591416068.0,
            "replies": []
        },
        {
            "body": "Looks pretty good the way it is. If i had your hair i would keep it exactly this way and would not change a thing. Think a bit longer if you're thinking of going short, but if you really made up your mind go for it why not !!",
            "author": "steve_ali",
            "id": "fszz3p0",
            "parent_id": "t3_gx79d0",
            "score": 6,
            "created_utc": 1591381965.0,
            "replies": [
                {
                    "body": "Sticking with it. I’ve made it this far, let’s see where the road goes! Just probably need to follow some of the above advice and be a bit more intentional along that journey.",
                    "author": "yepsen",
                    "id": "ft0w49n",
                    "parent_id": "t1_fszz3p0",
                    "score": 2,
                    "created_utc": 1591397974.0,
                    "replies": [
                        {
                            "body": "Perfect ! Just a little bit more patience and you are almost there.",
                            "author": "steve_ali",
                            "id": "ft2ei0j",
                            "parent_id": "t1_ft0w49n",
                            "score": 2,
                            "created_utc": 1591423283.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I think your beard ability and natural curl to your hair could make this length look really good! The one current priority I'd say is to just get your hair looking a bit less flat and greasy. I know shampooing every day is taboo for some, but I'd say try it and see if that improves the greasilyness of your hair. Conditioner is good too but that may also add to the shine, so maybe experiment with conditioning a few times a week but shampooing every day. Just some thoughts!",
            "author": "xiofang",
            "id": "ft056ke",
            "parent_id": "t3_gx79d0",
            "score": 2,
            "created_utc": 1591384849.0,
            "replies": [
                {
                    "body": "Yeah, I use Moroccan Oil shampoo and conditioner but probably not enough...  guessing 2-3 days as of today/this picture. I was originally thinking a Bradley-Cooper-in-A-Star-Is-Born vibe, so the didn’t want it too shiny and voluminous. I’ll try playing with how often I do each and hopefully find a decent mix. \n\nMight just need to rethink what I’m doing with it now that I’ve hit the length.\n\nThank you for your advice!",
                    "author": "yepsen",
                    "id": "ft0x3pp",
                    "parent_id": "t1_ft056ke",
                    "score": 1,
                    "created_utc": 1591398431.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I was in the military until the last year and I've been growing it out. Learning a lot. Maybe try using some product and a hair dryer and see how you like it my dude. Give it time first before cutting it",
            "author": "Wolfywallstreet",
            "id": "ft07p6s",
            "parent_id": "t3_gx79d0",
            "score": 2,
            "created_utc": 1591386038.0,
            "replies": [
                {
                    "body": "Definitely sticking with it. The couple folks saying hairdryers are blowing my mind as I was always told to steer clear!",
                    "author": "yepsen",
                    "id": "ft0x6ac",
                    "parent_id": "t1_ft07p6s",
                    "score": 1,
                    "created_utc": 1591398460.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Honestly, it's upto whether you want want to maintain it and your personal preference. But as someone envious of anyone who can grow hair that long, I say keep it. You can trim it to whatever length, whenever. It looks good on you paired with that beard.",
            "author": "snow112",
            "id": "ft09013",
            "parent_id": "t3_gx79d0",
            "score": 2,
            "created_utc": 1591386662.0,
            "replies": [
                {
                    "body": "Thank you! And yes, I’ll be keeping going with it. Just a frustrating phase.",
                    "author": "yepsen",
                    "id": "ft0x9bb",
                    "parent_id": "t1_ft09013",
                    "score": 2,
                    "created_utc": 1591398495.0,
                    "replies": [
                        {
                            "body": "The awkward phase is definitely a bitch and a half. But it's worth it in the long run.",
                            "author": "captainflowers91",
                            "id": "ft1b7yq",
                            "parent_id": "t1_ft0x9bb",
                            "score": 1,
                            "created_utc": 1591404651.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "LET IT RIDE",
            "author": "jdawg1822",
            "id": "ft0m563",
            "parent_id": "t3_gx79d0",
            "score": 2,
            "created_utc": 1591393207.0,
            "replies": []
        },
        {
            "body": "I was in the same boat until recently when I opted to grow my hair out for the first time. The biggest struggle, for me personally, was getting past that \"awkward\" stage when you'll really want to just give in and cut it. I've got curly hair too and I noticed it got a lot more manageable once it got some length to it. \n\nMake sure you're not washing it daily like you might be used to doing with short hair. Personally, I've found washing it 2-3 times a week keeps it from getting too greasy or drying it out. Also, if it feels extremely greasy the day after washing/conditioning try using conditioner just on the base and not actually scrubbing it in at the root. IMO it definitely feels less oily when I do it that way vs conditioning the entire scalp. I've also had a couple of girls recommend dry shampoo. Personally I can't stand the way it feels but they do say it can help cut down on oil between washes.",
            "author": "captainflowers91",
            "id": "ft0maub",
            "parent_id": "t3_gx79d0",
            "score": 2,
            "created_utc": 1591393287.0,
            "replies": [
                {
                    "body": "The Mrs has some dry shampoo I think... might give it a go.",
                    "author": "yepsen",
                    "id": "ft0y7p5",
                    "parent_id": "t1_ft0maub",
                    "score": 1,
                    "created_utc": 1591398907.0,
                    "replies": [
                        {
                            "body": "Not going to lie, I eventually said \"fuck it\" and just started using woman's conditioner. I don't really mind the smell and I haven't had any girls complain yet. A girl recommended \"way to grow\" from \"not your mother's\". It definitely helped with the length and it's not too girly smelling.",
                            "author": "captainflowers91",
                            "id": "ft1b47j",
                            "parent_id": "t1_ft0y7p5",
                            "score": 2,
                            "created_utc": 1591404603.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "https://open.spotify.com/track/6ruIR3LlJFN1uBbBd6ETv4?si=4PBG3teVSmGsmI4cAwu1qQ",
            "author": "jdawg1822",
            "id": "ft0mcmv",
            "parent_id": "t3_gx79d0",
            "score": 2,
            "created_utc": 1591393313.0,
            "replies": [
                {
                    "body": "Haha",
                    "author": "yepsen",
                    "id": "ft0xeww",
                    "parent_id": "t1_ft0mcmv",
                    "score": 1,
                    "created_utc": 1591398557.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "The answer is always to let It grow",
            "author": "Susarn",
            "id": "ft0q8ml",
            "parent_id": "t3_gx79d0",
            "score": 2,
            "created_utc": 1591395188.0,
            "replies": [
                {
                    "body": "Yeah, I’m going with that. Just a frustrating moment with it.",
                    "author": "yepsen",
                    "id": "ft0xgaq",
                    "parent_id": "t1_ft0q8ml",
                    "score": 1,
                    "created_utc": 1591398572.0,
                    "replies": [
                        {
                            "body": "Nice man, I'm happy for you.\n\nI think it's very frustrating to ask for hair advice in this sub when the subject is letting the hair grow or not. Obviously it's not everyone but I think the majority of this sub has a bias against long hair.\n\nI suggest you browse /r/FierceFlow, /r/MajesticManes and /r/curlyhair(your hair is definitely curly/wavy and following their routines is going to do wonders for your hair, it did for mine) for advice, tips and support in letting your hair grow!\nAnd if long hair really don't suit you(it really doesn't suit some people), users there will let you know.",
                            "author": "Susarn",
                            "id": "ft10u4g",
                            "parent_id": "t1_ft0xgaq",
                            "score": 2,
                            "created_utc": 1591400083.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "i think you look more aproachable than you would with short hair.",
            "author": "bangshootshoot",
            "id": "ft0t5m5",
            "parent_id": "t3_gx79d0",
            "score": 2,
            "created_utc": 1591396562.0,
            "replies": []
        },
        {
            "body": "Keep it long for the memory of Kenny Powers.",
            "author": "Roak_Zulu",
            "id": "ft14xxa",
            "parent_id": "t3_gx79d0",
            "score": 2,
            "created_utc": 1591401960.0,
            "replies": []
        },
        {
            "body": "Keep growing it and just experiment with it a million different ways before deciding to chop. Don't wanna wonder if maybe this or that style would've fit your long hair better when it's gone lol.",
            "author": "Gary_FucKing",
            "id": "ft17yd9",
            "parent_id": "t3_gx79d0",
            "score": 2,
            "created_utc": 1591403234.0,
            "replies": []
        },
        {
            "body": "I had very similar hair to you. Shampoo it every second or third day but you can condition it every day, I would highly recommend to allow them to just air dry or blow dry it.",
            "author": "Caxeo",
            "id": "ft18d0e",
            "parent_id": "t3_gx79d0",
            "score": 2,
            "created_utc": 1591403402.0,
            "replies": []
        },
        {
            "body": "At least you have the genetics to try it.",
            "author": null,
            "id": "ft18iz1",
            "parent_id": "t3_gx79d0",
            "score": 2,
            "created_utc": 1591403477.0,
            "replies": []
        },
        {
            "body": "You look like Vigo Mortensen to me look up some of his styles!",
            "author": "GrandMasterFlex",
            "id": "ft1eeny",
            "parent_id": "t3_gx79d0",
            "score": 2,
            "created_utc": 1591406037.0,
            "replies": []
        },
        {
            "body": "You have beautiful curls in your hair but my hairdressers eye can see that you have a lot of build up on your hair that distorts the curl pattern and weighs it down. With your texture you should be able to wash and go but you’ll need a good clarifying shampoo !!!\n\n Try Paul Michelle #3. Scrub not just your scalp but down your hair strands as well. You should do this until your hair squeaks when run it your fingers down the hair shaft. This will make such a big difference because your hair will breath and be more lively. It’s a great secret to great hair. \n\nI actually didn’t know I had texture in my hair until I was introduced to clarifying shampoo and then bam! Waves!! \n\nBuild up is not only from products but it’s also environmental. Like if you don’t have soft water in your shower. Hard water has chlorine and copper and all kinds of stuff. A clear film will come up if you boil tap water. This really distorts the hair over time. Think of clarifying as a deep cleaning! With your hair you should\nDo it every 3-6 weeks! Your hair will be shinier and bouncier and the color will be better as well. What your hair needs is a deep cleaning!!! I think you can totally rock longer hair! Also you’re not alone. Most people don’t use clarifying shampoo and never figure out why they don’t get the full potential out of their hair! Good luck!!!!!!",
            "author": null,
            "id": "ft1gaj2",
            "parent_id": "t3_gx79d0",
            "score": 2,
            "created_utc": 1591406867.0,
            "replies": [
                {
                    "body": "Done. I’ll definitely be ordering some Paul Michelle #3. Thank you!!",
                    "author": "yepsen",
                    "id": "ft1qtjb",
                    "parent_id": "t1_ft1gaj2",
                    "score": 1,
                    "created_utc": 1591411554.0,
                    "replies": [
                        {
                            "body": "So wonderful !!!! 😃😃😃 you’ll need to wash it maybe two to three times the first time since it’s been so long. If you could section your hair or at least scrub it down the shaft between your hands in sections you’ll be a lot more efficient. You will also need a good conditioner for you hair! Any professional one shall do. Depending on the width of your individuals hair strands you will have to decide how heavy of a conditioner your hair likes. Your curls will need to be weighed down just the right amount. Play with professional conditioners! It won’t be as tricky as it sounds! Only brush your curly hair when it’s wet out or the shower. Comb, Scrunch with towel and leave it to dry. You may want a curl cream or leave in conditioner at some point. But if you have a decent hair cut and hair care you should be able to wash and go! 😃",
                            "author": null,
                            "id": "ft2e5i1",
                            "parent_id": "t1_ft1qtjb",
                            "score": 2,
                            "created_utc": 1591423102.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "clean it up a little bit trim it maybe an inch every 3-4 months long hair in my opinions keeps everything stable",
            "author": "retrofrog56",
            "id": "ft1obon",
            "parent_id": "t3_gx79d0",
            "score": 2,
            "created_utc": 1591410433.0,
            "replies": []
        },
        {
            "body": "Dude you look awesome, I saw this and thought I was looking at a Jedi master. Clean the beard up and I might call you Obi-wan kenobi",
            "author": "Swift_Jolteon",
            "id": "ft1xgxc",
            "parent_id": "t3_gx79d0",
            "score": 2,
            "created_utc": 1591414619.0,
            "replies": []
        },
        {
            "body": "My hair is actually in the same position, it's almost the same texture and length as yours but black. The thing is, if you never had long hair before it will take you (and others) some time to get used to seeing yourself like this, it happens when you try a different look. It looks great though, just needs a little neatening up/slight grooming. \n\nExperiment with different hairstyles too; pony tail, one-sided (cover one ear and leave the other side behind your ear), viking braids, etc. i'm currently doing the same. I've always had the same hairstyle 3/4 of my life and lately i've tried different stuff, currently trying shoulder-length hair and i'm half-way there. How i want it to look really motivates me. \n\nIt takes quite some maintenance but it's worth it in the end, you'll learn what works and what doesn't as you go along.",
            "author": "Tomato_Joker",
            "id": "ft24c39",
            "parent_id": "t3_gx79d0",
            "score": 2,
            "created_utc": 1591417931.0,
            "replies": []
        },
        {
            "body": "Keep the length but make it more of a style/maintained.\n\nAlso tidy up the beard.",
            "author": "LockoutFFA",
            "id": "ft2gpzq",
            "parent_id": "t3_gx79d0",
            "score": 2,
            "created_utc": 1591424449.0,
            "replies": []
        },
        {
            "body": "Keep it growing. The awkward phase sucks... But keep pushing through.",
            "author": "Hcdx",
            "id": "ft2mj4i",
            "parent_id": "t3_gx79d0",
            "score": 2,
            "created_utc": 1591426835.0,
            "replies": []
        },
        {
            "body": "Keep growing man, you’re almost past that awkward length. There’s lot of great videos on YouTube on how to style your hair while growing it out. \n\nSide note, it looks like you’re lining your beard up oddly. Does it look off to anyone else?",
            "author": "immediatethor",
            "id": "fszylrn",
            "parent_id": "t3_gx79d0",
            "score": 4,
            "created_utc": 1591381728.0,
            "replies": [
                {
                    "body": "lol, probably. I just hacked at it with some scissor trimmers yesterday. One day I’ll see my barber again... and yes, I will stick with it. Just a frustrating phase.",
                    "author": "yepsen",
                    "id": "ft0wczk",
                    "parent_id": "t1_fszylrn",
                    "score": 1,
                    "created_utc": 1591398090.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "At the very least trim and clean up the hair and beard.  You are a good looking guy and personally I think you would look better with short hair and beard!",
            "author": "Longislandtea12",
            "id": "fszzsig",
            "parent_id": "t3_gx79d0",
            "score": 2,
            "created_utc": 1591382292.0,
            "replies": [
                {
                    "body": "Well thank you! I’ll definitely get a better clean up and trim. Think I’ll keep growing a while to see where it goes based off other feedback... but I might be back to short, that’s a much easier move than the other way!",
                    "author": "yepsen",
                    "id": "ft0wlfe",
                    "parent_id": "t1_fszzsig",
                    "score": 2,
                    "created_utc": 1591398204.0,
                    "replies": [
                        {
                            "body": "You're welcome!",
                            "author": "Longislandtea12",
                            "id": "ft0y8zz",
                            "parent_id": "t1_ft0wlfe",
                            "score": 2,
                            "created_utc": 1591398922.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Something got to go. The beard or the hair.",
            "author": "tommy29016",
            "id": "ft0vr8q",
            "parent_id": "t3_gx79d0",
            "score": 1,
            "created_utc": 1591397802.0,
            "replies": [
                {
                    "body": "False",
                    "author": "yepsen",
                    "id": "ft0yj1d",
                    "parent_id": "t1_ft0vr8q",
                    "score": 1,
                    "created_utc": 1591399047.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I vote short",
            "author": "VeraVera23",
            "id": "ft0ztnb",
            "parent_id": "t3_gx79d0",
            "score": 1,
            "created_utc": 1591399629.0,
            "replies": []
        },
        {
            "body": "I vote short",
            "author": "VeraVera23",
            "id": "ft0zwgi",
            "parent_id": "t3_gx79d0",
            "score": 1,
            "created_utc": 1591399664.0,
            "replies": []
        },
        {
            "body": "Off subject, but has anyone ever told you how much you look like Shawn Crahan (Clown) from Slipknot!?",
            "author": "myclosingspeech",
            "id": "ft181oc",
            "parent_id": "t3_gx79d0",
            "score": 1,
            "created_utc": 1591403273.0,
            "replies": [
                {
                    "body": "Ha, that’s a new one to me",
                    "author": "yepsen",
                    "id": "ft18mvr",
                    "parent_id": "t1_ft181oc",
                    "score": 1,
                    "created_utc": 1591403526.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "You look A LOT like Jujimufu. Like he is your long lost twin. So your hair would probably look pretty good when it's long.",
            "author": "Mirkoniii",
            "id": "ftdb888",
            "parent_id": "t3_gx79d0",
            "score": 1,
            "created_utc": 1591624631.0,
            "replies": [
                {
                    "body": "Well this caused me to google Jujimufu and I think I have some weight-training ahead of me to really pull off the long-lost-twin thing. But I'll take it!",
                    "author": "yepsen",
                    "id": "ftdgm8u",
                    "parent_id": "t1_ftdb888",
                    "score": 1,
                    "created_utc": 1591627633.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Go short",
            "author": "ashareif",
            "id": "fszu6ql",
            "parent_id": "t3_gx79d0",
            "score": 1,
            "created_utc": 1591379592.0,
            "replies": [
                {
                    "body": "Against the grain of the masses. I like it! But I think I’m sticking with growing it for a while nonetheless.",
                    "author": "yepsen",
                    "id": "ft0wfhn",
                    "parent_id": "t1_fszu6ql",
                    "score": 1,
                    "created_utc": 1591398125.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I'd let the hair & the beard really grow out for a while. Give the beard 6 weeks & then go see a barber. If you can't get better thickness on the sides you may need a rethink. The hair needs another 6 months and then a trip to a decent hairdressers, you may have to drop a couple of hundred for them to really sort it out with a proper cut, treatments & stuff to maintain it but that's what you gotta do.",
            "author": "Dave_yenakart",
            "id": "ft04ksb",
            "parent_id": "t3_gx79d0",
            "score": 1,
            "created_utc": 1591384566.0,
            "replies": [
                {
                    "body": "Couple hundred!!?? Ugh. Yeah. I’ll keep going. Definitely a frustrating phase, though.",
                    "author": "yepsen",
                    "id": "ft0wxh5",
                    "parent_id": "t1_ft04ksb",
                    "score": 1,
                    "created_utc": 1591398359.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Do both, get a mullet 🤘🏼",
            "author": "allymarie2020",
            "id": "ft00aex",
            "parent_id": "t3_gx79d0",
            "score": 0,
            "created_utc": 1591382529.0,
            "replies": [
                {
                    "body": "Hell yes. [I’m in!](https://youtu.be/9YKXHbnsShA)",
                    "author": "yepsen",
                    "id": "ft0xw08",
                    "parent_id": "t1_ft00aex",
                    "score": 1,
                    "created_utc": 1591398762.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "What does blow drying do compared to towel drying? And do you use heat?",
            "author": "Choice_Garbage",
            "id": "ft0ghq7",
            "parent_id": "t1_fszuxdz",
            "score": 19,
            "created_utc": 1591390343.0,
            "replies": [
                {
                    "body": "Blow drying adds some volume, also allows you to \"shape\" how your hair falls. And yes, I use heat. I have more of a loose comb-over style though, my hair isn't all that long.",
                    "author": "diatonico_",
                    "id": "ft0goyt",
                    "parent_id": "t1_ft0ghq7",
                    "score": 20,
                    "created_utc": 1591390445.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Yeah, I use Moroccan Oil shampoo and conditioner but probably not enough...  guessing 2-3 days as of today/this picture. I was originally thinking a Bradley-Cooper-in-A-Star-Is-Born vibe, so the didn’t want it too shiny and voluminous. \n\nMight just need to rethink what I’m doing with it now that I’ve hit the length. \n\nThank you for your advice!",
            "author": "yepsen",
            "id": "ft0vggc",
            "parent_id": "t1_fszuxdz",
            "score": 14,
            "created_utc": 1591397658.0,
            "replies": [
                {
                    "body": "Some hair just really hates Moroccan Oil just like some hair really hates Aragan Oil or Coconut Oil. You seem to have wavy/curly hair which tends to be harder to manage than straight hair, have you tried getting advice at r/curlyhair?",
                    "author": "okthenbutwhy",
                    "id": "ft1305o",
                    "parent_id": "t1_ft0vggc",
                    "score": 14,
                    "created_utc": 1591401065.0,
                    "replies": [
                        {
                            "body": "I had not heard that! I wouldn’t say my hair has disliked it... but maybe I should try something else just to see. Not a lot of experience with this long hair thing.",
                            "author": "yepsen",
                            "id": "ft18jfh",
                            "parent_id": "t1_ft1305o",
                            "score": 7,
                            "created_utc": 1591403483.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Condition every day but only shampoo every couple days. Experiment to find the number that works for you.",
                    "author": "divuthen",
                    "id": "ft22m0c",
                    "parent_id": "t1_ft0vggc",
                    "score": 3,
                    "created_utc": 1591417086.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Probably for the best, yeah. Just being frustrated with it, I think.",
            "author": "yepsen",
            "id": "ft0vjmk",
            "parent_id": "t1_fszgo1k",
            "score": 9,
            "created_utc": 1591397701.0,
            "replies": []
        },
        {
            "body": "Greasy is borderline intentional as I was originally thinking a Bradley-Cooper-in-A-Star-Is-Born vibe, so didn’t want it too shiny and voluminous.\n\nProbably time to rethink the direction more than the length.",
            "author": "yepsen",
            "id": "ft0vpwn",
            "parent_id": "t1_fszuuix",
            "score": 14,
            "created_utc": 1591397785.0,
            "replies": []
        },
        {
            "body": "Haha, I have heard that before and it’s definitely a lowkey motivator",
            "author": "yepsen",
            "id": "ft0vic7",
            "parent_id": "t1_fszmr37",
            "score": 9,
            "created_utc": 1591397683.0,
            "replies": []
        },
        {
            "body": "It’s frustrating at times, but I do think I’m sticking with it. Thank you!",
            "author": "yepsen",
            "id": "ft0w6mm",
            "parent_id": "t1_ft043k9",
            "score": 5,
            "created_utc": 1591398003.0,
            "replies": []
        },
        {
            "body": "That appears to be the verdict and I’m on board for it!",
            "author": "yepsen",
            "id": "ft0xycd",
            "parent_id": "t1_ft04sv8",
            "score": 5,
            "created_utc": 1591398791.0,
            "replies": []
        },
        {
            "body": "I didn’t even realize I had curly hair before I grew this out! I do have Moroccanoil Shampoo & Conditioner and Curl Defining Cream, I just need to gl actually use it more than once or twice a week.\n\nThank you for the advice!",
            "author": "yepsen",
            "id": "ft0vxu0",
            "parent_id": "t1_ft02so2",
            "score": 3,
            "created_utc": 1591397889.0,
            "replies": [
                {
                    "body": "Oh no, once or twice a week is good for curly hair!  Washing more frequently will actually make you oilier at the roots, I would just make sure to apply more condition at the ends and work up the strand rather than from the top down, and apply your cream to the mid strand and ends as well too, (avoid the root)!\n\nEdit:  this is easiest to acheive by applying with your head upside down btw, you might already know that, but just in case you didnt, if you flip your hair forward after the shower all your hair will hang down and you can just scrunch the curl cream into the ends and avoid your roots.\n\nA light trim on your top layers will also increase the bounce and take the weight off those curls, they'll curl even more.  You have seriously beautiful hair!  I would definitely keep frowning it out if I were you!",
                    "author": "aestheticallly",
                    "id": "ft0y2wg",
                    "parent_id": "t1_ft0vxu0",
                    "score": 3,
                    "created_utc": 1591398847.0,
                    "replies": [
                        {
                            "body": "I’m definitely sticking with it. Really appreciate you advice.",
                            "author": "yepsen",
                            "id": "ft0yg1s",
                            "parent_id": "t1_ft0y2wg",
                            "score": 2,
                            "created_utc": 1591399010.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Thank you! I’ll keep with it, just hit a frustrating patch.",
            "author": "yepsen",
            "id": "ft0w0av",
            "parent_id": "t1_fszvndr",
            "score": 1,
            "created_utc": 1591397922.0,
            "replies": []
        },
        {
            "body": "Based Flow’r Inspo. Thank you!",
            "author": "yepsen",
            "id": "ft0w83a",
            "parent_id": "t1_ft04tl4",
            "score": 1,
            "created_utc": 1591398023.0,
            "replies": []
        },
        {
            "body": "It’s tough, but I’m sticking with it!",
            "author": "yepsen",
            "id": "ft0y1z3",
            "parent_id": "t1_ft07ul4",
            "score": 2,
            "created_utc": 1591398835.0,
            "replies": []
        },
        {
            "body": "yo, I've been growing my hair out for 9 months now, I did have the back trimmed around the 5th month, now the back is long again and not even with the top and my sides, should I have it trimmed again? will I still be able to do a full bun if I get the back of my hair trimmed because that's what I'm aiming for.",
            "author": "dexteretoy",
            "id": "ft4tf6n",
            "parent_id": "t1_ft0r1aq",
            "score": 2,
            "created_utc": 1591456732.0,
            "replies": [
                {
                    "body": "Being able to go \"full bun\" depends more on the top and front of your hair, which needs to be longer to reach the back than the.. well, hair that's already there. But you don't necessarily need them to match up. As long as you don't look like you've got a mullet, you're doing fine (that is, unless you want a mullet).",
                    "author": "Occultist_Kat",
                    "id": "ft54n2o",
                    "parent_id": "t1_ft4tf6n",
                    "score": 2,
                    "created_utc": 1591460368.0,
                    "replies": [
                        {
                            "body": "thanks man, been thinking for a while actually, i'm terrified af to get a haircut thinking that the barber might cut too much, I have to be very specific i think, I guess I'll have the back trimmed then.",
                            "author": "dexteretoy",
                            "id": "ft5o4r1",
                            "parent_id": "t1_ft54n2o",
                            "score": 1,
                            "created_utc": 1591466747.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "This is some top notch recommendary. \n\nThank you! \n\nAnd I’ve had that beard for something in the neighborhood of 15 years so it’s a permanent fixture on this dome. Just need to be a bit more mindful of (and my head hair).",
            "author": "yepsen",
            "id": "ft0xs3w",
            "parent_id": "t1_ft0r1aq",
            "score": 1,
            "created_utc": 1591398712.0,
            "replies": []
        },
        {
            "body": "Wilco will love you, /u/bd1174",
            "author": "yepsen",
            "id": "ft0xc8g",
            "parent_id": "t1_ft0epct",
            "score": 1,
            "created_utc": 1591398528.0,
            "replies": []
        },
        {
            "body": "Sticking with it. I’ve made it this far, let’s see where the road goes! Just probably need to follow some of the above advice and be a bit more intentional along that journey.",
            "author": "yepsen",
            "id": "ft0w49n",
            "parent_id": "t1_fszz3p0",
            "score": 2,
            "created_utc": 1591397974.0,
            "replies": [
                {
                    "body": "Perfect ! Just a little bit more patience and you are almost there.",
                    "author": "steve_ali",
                    "id": "ft2ei0j",
                    "parent_id": "t1_ft0w49n",
                    "score": 2,
                    "created_utc": 1591423283.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Yeah, I use Moroccan Oil shampoo and conditioner but probably not enough...  guessing 2-3 days as of today/this picture. I was originally thinking a Bradley-Cooper-in-A-Star-Is-Born vibe, so the didn’t want it too shiny and voluminous. I’ll try playing with how often I do each and hopefully find a decent mix. \n\nMight just need to rethink what I’m doing with it now that I’ve hit the length.\n\nThank you for your advice!",
            "author": "yepsen",
            "id": "ft0x3pp",
            "parent_id": "t1_ft056ke",
            "score": 1,
            "created_utc": 1591398431.0,
            "replies": []
        },
        {
            "body": "Definitely sticking with it. The couple folks saying hairdryers are blowing my mind as I was always told to steer clear!",
            "author": "yepsen",
            "id": "ft0x6ac",
            "parent_id": "t1_ft07p6s",
            "score": 1,
            "created_utc": 1591398460.0,
            "replies": []
        },
        {
            "body": "Thank you! And yes, I’ll be keeping going with it. Just a frustrating phase.",
            "author": "yepsen",
            "id": "ft0x9bb",
            "parent_id": "t1_ft09013",
            "score": 2,
            "created_utc": 1591398495.0,
            "replies": [
                {
                    "body": "The awkward phase is definitely a bitch and a half. But it's worth it in the long run.",
                    "author": "captainflowers91",
                    "id": "ft1b7yq",
                    "parent_id": "t1_ft0x9bb",
                    "score": 1,
                    "created_utc": 1591404651.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "The Mrs has some dry shampoo I think... might give it a go.",
            "author": "yepsen",
            "id": "ft0y7p5",
            "parent_id": "t1_ft0maub",
            "score": 1,
            "created_utc": 1591398907.0,
            "replies": [
                {
                    "body": "Not going to lie, I eventually said \"fuck it\" and just started using woman's conditioner. I don't really mind the smell and I haven't had any girls complain yet. A girl recommended \"way to grow\" from \"not your mother's\". It definitely helped with the length and it's not too girly smelling.",
                    "author": "captainflowers91",
                    "id": "ft1b47j",
                    "parent_id": "t1_ft0y7p5",
                    "score": 2,
                    "created_utc": 1591404603.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Haha",
            "author": "yepsen",
            "id": "ft0xeww",
            "parent_id": "t1_ft0mcmv",
            "score": 1,
            "created_utc": 1591398557.0,
            "replies": []
        },
        {
            "body": "Yeah, I’m going with that. Just a frustrating moment with it.",
            "author": "yepsen",
            "id": "ft0xgaq",
            "parent_id": "t1_ft0q8ml",
            "score": 1,
            "created_utc": 1591398572.0,
            "replies": [
                {
                    "body": "Nice man, I'm happy for you.\n\nI think it's very frustrating to ask for hair advice in this sub when the subject is letting the hair grow or not. Obviously it's not everyone but I think the majority of this sub has a bias against long hair.\n\nI suggest you browse /r/FierceFlow, /r/MajesticManes and /r/curlyhair(your hair is definitely curly/wavy and following their routines is going to do wonders for your hair, it did for mine) for advice, tips and support in letting your hair grow!\nAnd if long hair really don't suit you(it really doesn't suit some people), users there will let you know.",
                    "author": "Susarn",
                    "id": "ft10u4g",
                    "parent_id": "t1_ft0xgaq",
                    "score": 2,
                    "created_utc": 1591400083.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Done. I’ll definitely be ordering some Paul Michelle #3. Thank you!!",
            "author": "yepsen",
            "id": "ft1qtjb",
            "parent_id": "t1_ft1gaj2",
            "score": 1,
            "created_utc": 1591411554.0,
            "replies": [
                {
                    "body": "So wonderful !!!! 😃😃😃 you’ll need to wash it maybe two to three times the first time since it’s been so long. If you could section your hair or at least scrub it down the shaft between your hands in sections you’ll be a lot more efficient. You will also need a good conditioner for you hair! Any professional one shall do. Depending on the width of your individuals hair strands you will have to decide how heavy of a conditioner your hair likes. Your curls will need to be weighed down just the right amount. Play with professional conditioners! It won’t be as tricky as it sounds! Only brush your curly hair when it’s wet out or the shower. Comb, Scrunch with towel and leave it to dry. You may want a curl cream or leave in conditioner at some point. But if you have a decent hair cut and hair care you should be able to wash and go! 😃",
                    "author": null,
                    "id": "ft2e5i1",
                    "parent_id": "t1_ft1qtjb",
                    "score": 2,
                    "created_utc": 1591423102.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "lol, probably. I just hacked at it with some scissor trimmers yesterday. One day I’ll see my barber again... and yes, I will stick with it. Just a frustrating phase.",
            "author": "yepsen",
            "id": "ft0wczk",
            "parent_id": "t1_fszylrn",
            "score": 1,
            "created_utc": 1591398090.0,
            "replies": []
        },
        {
            "body": "Well thank you! I’ll definitely get a better clean up and trim. Think I’ll keep growing a while to see where it goes based off other feedback... but I might be back to short, that’s a much easier move than the other way!",
            "author": "yepsen",
            "id": "ft0wlfe",
            "parent_id": "t1_fszzsig",
            "score": 2,
            "created_utc": 1591398204.0,
            "replies": [
                {
                    "body": "You're welcome!",
                    "author": "Longislandtea12",
                    "id": "ft0y8zz",
                    "parent_id": "t1_ft0wlfe",
                    "score": 2,
                    "created_utc": 1591398922.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "False",
            "author": "yepsen",
            "id": "ft0yj1d",
            "parent_id": "t1_ft0vr8q",
            "score": 1,
            "created_utc": 1591399047.0,
            "replies": []
        },
        {
            "body": "Ha, that’s a new one to me",
            "author": "yepsen",
            "id": "ft18mvr",
            "parent_id": "t1_ft181oc",
            "score": 1,
            "created_utc": 1591403526.0,
            "replies": []
        },
        {
            "body": "Well this caused me to google Jujimufu and I think I have some weight-training ahead of me to really pull off the long-lost-twin thing. But I'll take it!",
            "author": "yepsen",
            "id": "ftdgm8u",
            "parent_id": "t1_ftdb888",
            "score": 1,
            "created_utc": 1591627633.0,
            "replies": []
        },
        {
            "body": "Against the grain of the masses. I like it! But I think I’m sticking with growing it for a while nonetheless.",
            "author": "yepsen",
            "id": "ft0wfhn",
            "parent_id": "t1_fszu6ql",
            "score": 1,
            "created_utc": 1591398125.0,
            "replies": []
        },
        {
            "body": "Couple hundred!!?? Ugh. Yeah. I’ll keep going. Definitely a frustrating phase, though.",
            "author": "yepsen",
            "id": "ft0wxh5",
            "parent_id": "t1_ft04ksb",
            "score": 1,
            "created_utc": 1591398359.0,
            "replies": []
        },
        {
            "body": "Hell yes. [I’m in!](https://youtu.be/9YKXHbnsShA)",
            "author": "yepsen",
            "id": "ft0xw08",
            "parent_id": "t1_ft00aex",
            "score": 1,
            "created_utc": 1591398762.0,
            "replies": []
        },
        {
            "body": "Blow drying adds some volume, also allows you to \"shape\" how your hair falls. And yes, I use heat. I have more of a loose comb-over style though, my hair isn't all that long.",
            "author": "diatonico_",
            "id": "ft0goyt",
            "parent_id": "t1_ft0ghq7",
            "score": 20,
            "created_utc": 1591390445.0,
            "replies": []
        },
        {
            "body": "Some hair just really hates Moroccan Oil just like some hair really hates Aragan Oil or Coconut Oil. You seem to have wavy/curly hair which tends to be harder to manage than straight hair, have you tried getting advice at r/curlyhair?",
            "author": "okthenbutwhy",
            "id": "ft1305o",
            "parent_id": "t1_ft0vggc",
            "score": 14,
            "created_utc": 1591401065.0,
            "replies": [
                {
                    "body": "I had not heard that! I wouldn’t say my hair has disliked it... but maybe I should try something else just to see. Not a lot of experience with this long hair thing.",
                    "author": "yepsen",
                    "id": "ft18jfh",
                    "parent_id": "t1_ft1305o",
                    "score": 7,
                    "created_utc": 1591403483.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Condition every day but only shampoo every couple days. Experiment to find the number that works for you.",
            "author": "divuthen",
            "id": "ft22m0c",
            "parent_id": "t1_ft0vggc",
            "score": 3,
            "created_utc": 1591417086.0,
            "replies": []
        },
        {
            "body": "Oh no, once or twice a week is good for curly hair!  Washing more frequently will actually make you oilier at the roots, I would just make sure to apply more condition at the ends and work up the strand rather than from the top down, and apply your cream to the mid strand and ends as well too, (avoid the root)!\n\nEdit:  this is easiest to acheive by applying with your head upside down btw, you might already know that, but just in case you didnt, if you flip your hair forward after the shower all your hair will hang down and you can just scrunch the curl cream into the ends and avoid your roots.\n\nA light trim on your top layers will also increase the bounce and take the weight off those curls, they'll curl even more.  You have seriously beautiful hair!  I would definitely keep frowning it out if I were you!",
            "author": "aestheticallly",
            "id": "ft0y2wg",
            "parent_id": "t1_ft0vxu0",
            "score": 3,
            "created_utc": 1591398847.0,
            "replies": [
                {
                    "body": "I’m definitely sticking with it. Really appreciate you advice.",
                    "author": "yepsen",
                    "id": "ft0yg1s",
                    "parent_id": "t1_ft0y2wg",
                    "score": 2,
                    "created_utc": 1591399010.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Being able to go \"full bun\" depends more on the top and front of your hair, which needs to be longer to reach the back than the.. well, hair that's already there. But you don't necessarily need them to match up. As long as you don't look like you've got a mullet, you're doing fine (that is, unless you want a mullet).",
            "author": "Occultist_Kat",
            "id": "ft54n2o",
            "parent_id": "t1_ft4tf6n",
            "score": 2,
            "created_utc": 1591460368.0,
            "replies": [
                {
                    "body": "thanks man, been thinking for a while actually, i'm terrified af to get a haircut thinking that the barber might cut too much, I have to be very specific i think, I guess I'll have the back trimmed then.",
                    "author": "dexteretoy",
                    "id": "ft5o4r1",
                    "parent_id": "t1_ft54n2o",
                    "score": 1,
                    "created_utc": 1591466747.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Perfect ! Just a little bit more patience and you are almost there.",
            "author": "steve_ali",
            "id": "ft2ei0j",
            "parent_id": "t1_ft0w49n",
            "score": 2,
            "created_utc": 1591423283.0,
            "replies": []
        },
        {
            "body": "The awkward phase is definitely a bitch and a half. But it's worth it in the long run.",
            "author": "captainflowers91",
            "id": "ft1b7yq",
            "parent_id": "t1_ft0x9bb",
            "score": 1,
            "created_utc": 1591404651.0,
            "replies": []
        },
        {
            "body": "Not going to lie, I eventually said \"fuck it\" and just started using woman's conditioner. I don't really mind the smell and I haven't had any girls complain yet. A girl recommended \"way to grow\" from \"not your mother's\". It definitely helped with the length and it's not too girly smelling.",
            "author": "captainflowers91",
            "id": "ft1b47j",
            "parent_id": "t1_ft0y7p5",
            "score": 2,
            "created_utc": 1591404603.0,
            "replies": []
        },
        {
            "body": "Nice man, I'm happy for you.\n\nI think it's very frustrating to ask for hair advice in this sub when the subject is letting the hair grow or not. Obviously it's not everyone but I think the majority of this sub has a bias against long hair.\n\nI suggest you browse /r/FierceFlow, /r/MajesticManes and /r/curlyhair(your hair is definitely curly/wavy and following their routines is going to do wonders for your hair, it did for mine) for advice, tips and support in letting your hair grow!\nAnd if long hair really don't suit you(it really doesn't suit some people), users there will let you know.",
            "author": "Susarn",
            "id": "ft10u4g",
            "parent_id": "t1_ft0xgaq",
            "score": 2,
            "created_utc": 1591400083.0,
            "replies": []
        },
        {
            "body": "So wonderful !!!! 😃😃😃 you’ll need to wash it maybe two to three times the first time since it’s been so long. If you could section your hair or at least scrub it down the shaft between your hands in sections you’ll be a lot more efficient. You will also need a good conditioner for you hair! Any professional one shall do. Depending on the width of your individuals hair strands you will have to decide how heavy of a conditioner your hair likes. Your curls will need to be weighed down just the right amount. Play with professional conditioners! It won’t be as tricky as it sounds! Only brush your curly hair when it’s wet out or the shower. Comb, Scrunch with towel and leave it to dry. You may want a curl cream or leave in conditioner at some point. But if you have a decent hair cut and hair care you should be able to wash and go! 😃",
            "author": null,
            "id": "ft2e5i1",
            "parent_id": "t1_ft1qtjb",
            "score": 2,
            "created_utc": 1591423102.0,
            "replies": []
        },
        {
            "body": "You're welcome!",
            "author": "Longislandtea12",
            "id": "ft0y8zz",
            "parent_id": "t1_ft0wlfe",
            "score": 2,
            "created_utc": 1591398922.0,
            "replies": []
        },
        {
            "body": "I had not heard that! I wouldn’t say my hair has disliked it... but maybe I should try something else just to see. Not a lot of experience with this long hair thing.",
            "author": "yepsen",
            "id": "ft18jfh",
            "parent_id": "t1_ft1305o",
            "score": 7,
            "created_utc": 1591403483.0,
            "replies": []
        },
        {
            "body": "I’m definitely sticking with it. Really appreciate you advice.",
            "author": "yepsen",
            "id": "ft0yg1s",
            "parent_id": "t1_ft0y2wg",
            "score": 2,
            "created_utc": 1591399010.0,
            "replies": []
        },
        {
            "body": "thanks man, been thinking for a while actually, i'm terrified af to get a haircut thinking that the barber might cut too much, I have to be very specific i think, I guess I'll have the back trimmed then.",
            "author": "dexteretoy",
            "id": "ft5o4r1",
            "parent_id": "t1_ft54n2o",
            "score": 1,
            "created_utc": 1591466747.0,
            "replies": []
        }
    ]
}