{
    "title": "Friends and sugaring",
    "post_id": "fvza6b",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/fvza6b/friends_and_sugaring/",
    "author": null,
    "body": "I feel like the friends that give you a hard time about sugaring are always the first ones to be like “throw me something on your wishlist next time” or “can you connect me with someone for a job ect...” or “take me on vacation with you” \n\nThe second they find out “he bought you what?!” Or “ he connected you with who!?!?” Or “he brought you where!?” \n\n(Saying this in a light hearted joking way but true lol. Still love my friends that give me a hard time about sugaring.) 💜\n\nEdit: very unfortunate to hear how some people are treated. In life people will always try to knock you down no matter what it is. So FUCK EM. \nI’m grateful for my friends even the ones who give me a hard time and make dumb jokes towards me about it. If you can’t laugh at yourself what’s the point? \nI’m a ball buster and all my closes friends are too. Im a firm believer if you can’t take the heat step out of the kitchen!!! \nI’m an open book to my closest friends and if anyone I didn’t know personally asked me questions I’m as honest as I can be.",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/fvza6b/friends_and_sugaring/",
    "score": 107,
    "upvote_ratio": 0.97,
    "created_utc": 1586181780.0,
    "num_comments": 38,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "[deleted]",
            "author": null,
            "id": "fmldp58",
            "parent_id": "t3_fvza6b",
            "score": 40,
            "created_utc": 1586184331.0,
            "replies": [
                {
                    "body": "My friends who know about me and my SD are very respectful of my SD. My close friends have met him and we’ve all gone out together before. It was a joke about when they joke with me saying those things. \n\nJust light hearted!! 💜",
                    "author": null,
                    "id": "fmleg4i",
                    "parent_id": "t1_fmldp58",
                    "score": 6,
                    "created_utc": 1586184763.0,
                    "replies": []
                },
                {
                    "body": "This girl gets it. Your sd is very lucky.",
                    "author": "dade_murphy1",
                    "id": "fmmyfle",
                    "parent_id": "t1_fmldp58",
                    "score": 1,
                    "created_utc": 1586214474.0,
                    "replies": []
                },
                {
                    "body": "I like how you dipped your pool in the pond and tested the waters before telling them about sugar. Very wife move.",
                    "author": null,
                    "id": "fmq6k98",
                    "parent_id": "t1_fmldp58",
                    "score": 1,
                    "created_utc": 1586293809.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Have a dude who says he hates girls who sugar cos he doesn’t like the idea of a girl sleeping w a guy for money etc but till today he sends me money hoping I’ll have sex with him :-) \n\nI. Don’t. Get. It.",
            "author": null,
            "id": "fmlcovq",
            "parent_id": "t3_fvza6b",
            "score": 27,
            "created_utc": 1586183741.0,
            "replies": [
                {
                    "body": "Hypocritical. Maybe he finally gave in?",
                    "author": "BigBearSD",
                    "id": "fmld2bo",
                    "parent_id": "t1_fmlcovq",
                    "score": 5,
                    "created_utc": 1586183961.0,
                    "replies": [
                        {
                            "body": "Hmm nah. He still insults me every now and then whenever I reject him, calling me a slut, whore etc.... says he wants to be w me as a boyf and shit. Zzzzzz pls.",
                            "author": null,
                            "id": "fmld5og",
                            "parent_id": "t1_fmld2bo",
                            "score": 13,
                            "created_utc": 1586184016.0,
                            "replies": [
                                {
                                    "body": "sooo fucking hilarious when guys call you a slut. like if i'm such a slut how come i wont sleep with you",
                                    "author": "mangofruitbabe",
                                    "id": "fmlgue2",
                                    "parent_id": "t1_fmld5og",
                                    "score": 19,
                                    "created_utc": 1586186145.0,
                                    "replies": [
                                        {
                                            "body": "Right? 🤣",
                                            "author": "LikeHoney99",
                                            "id": "fmlhvzk",
                                            "parent_id": "t1_fmlgue2",
                                            "score": 1,
                                            "created_utc": 1586186738.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "the worst!",
                    "author": null,
                    "id": "fmm3biv",
                    "parent_id": "t1_fmlcovq",
                    "score": 1,
                    "created_utc": 1586198004.0,
                    "replies": [
                        {
                            "body": "Ugh I know!!",
                            "author": null,
                            "id": "fmm7hyf",
                            "parent_id": "t1_fmm3biv",
                            "score": 1,
                            "created_utc": 1586200213.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Yeah my friends where definitely interested in the lifestyle but ultimately are against it. I won’t lie it does hurt but I understand where they are coming from. To them this is very “out of character” for me which I agree with in some ways. Sugaring has allowed me to expand me horizons and explore my sexuality in ways that have helped me grow so much as a person. It’s pushed me out of my shell and given me experiences that I will always cherish. \n\nI used to tell them about issues I had in sugaring but now I just tell the friends I have made on here because they understand 100% where I’m coming from because they have been through it themselves. \n\nIt’s not all bad though. My ex sd bought my best friends Christmas presents which I thought was sweet gesture. He also invited them out with us on multiple occasions but was sadly shut down because “who wants to party with an old guy” they said. Sometimes I wish they would understand but I feel like they won’t unless they are in the bowl themselves.",
            "author": null,
            "id": "fmlx962",
            "parent_id": "t3_fvza6b",
            "score": 8,
            "created_utc": 1586194884.0,
            "replies": [
                {
                    "body": "In what ways did sugaring helped you explore your sexuality?",
                    "author": "party_dragon",
                    "id": "fmmmk5m",
                    "parent_id": "t1_fmlx962",
                    "score": 1,
                    "created_utc": 1586208030.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "fmnjbi1",
                            "parent_id": "t1_fmmmk5m",
                            "score": 3,
                            "created_utc": 1586227381.0,
                            "replies": [
                                {
                                    "body": "Very true",
                                    "author": "SheHasntHaveherses",
                                    "id": "fmnxozk",
                                    "parent_id": "t1_fmnjbi1",
                                    "score": 1,
                                    "created_utc": 1586238405.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I knew a girl who always complained about family hitting her up for money.   Yet they condemned her for sex work.",
            "author": "sdphilly",
            "id": "fmlc1jd",
            "parent_id": "t3_fvza6b",
            "score": 17,
            "created_utc": 1586183353.0,
            "replies": [
                {
                    "body": "Holier and broke than thou'!",
                    "author": "captainIsBack4u",
                    "id": "fmlcfr4",
                    "parent_id": "t1_fmlc1jd",
                    "score": 11,
                    "created_utc": 1586183586.0,
                    "replies": [
                        {
                            "body": "hahaha!",
                            "author": null,
                            "id": "fmlonrk",
                            "parent_id": "t1_fmlcfr4",
                            "score": 2,
                            "created_utc": 1586190393.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "They're just jealous. I am in my 30s and I did sugaring in my 20s. I would not be where I am today financially if it wasn't for my sugaring past.",
            "author": null,
            "id": "fmloll9",
            "parent_id": "t3_fvza6b",
            "score": 16,
            "created_utc": 1586190361.0,
            "replies": [
                {
                    "body": "I second that emotion.",
                    "author": "lolashowme14",
                    "id": "fmmc1rc",
                    "parent_id": "t1_fmloll9",
                    "score": 0,
                    "created_utc": 1586202579.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I don’t tell them 🤦‍♀️",
            "author": "LikeHoney99",
            "id": "fmlhu4q",
            "parent_id": "t3_fvza6b",
            "score": 7,
            "created_utc": 1586186708.0,
            "replies": []
        },
        {
            "body": "A lot of my friends know I sugar, and never has anyone asked me to get them something from my sugar daddy! How offensive",
            "author": null,
            "id": "fmlmoqn",
            "parent_id": "t3_fvza6b",
            "score": 5,
            "created_utc": 1586189387.0,
            "replies": []
        },
        {
            "body": "This is my PET PEEVE. \n\nIt is 100% true that the people with the most negative things to say about these kinds of relationships are the FIRST to ask for handouts. \n\nI am incredibly spoiled, honestly, so my relationship comes up often in conversations. Without fail, there is always one girl in the group (not of my closest friends, but acquaintances who tag along, etc.) that will ask for money, presents, etc....just because they know me? Like, hello. He is dating *me,* and I am not even entitled to his money!! So what makes you think *you* are???? The audacity of some people, I swear....Like have a little class/tact, pls and thank you. \n\nOn the real, I try not to let this stuff bother me so much anymore and to let it roll off my back because at the end of the day, these people are just jealous! But it still gets me pretty upset and defensive. Luckily, my friends will usually step in before I say something nasty lol.",
            "author": "LoverOfTheSea1997",
            "id": "fmm7v6d",
            "parent_id": "t3_fvza6b",
            "score": 4,
            "created_utc": 1586200412.0,
            "replies": [
                {
                    "body": "You get it.",
                    "author": "dade_murphy1",
                    "id": "fmmyqxk",
                    "parent_id": "t1_fmm7v6d",
                    "score": 2,
                    "created_utc": 1586214646.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I dont tell anyone. People were so judgemental with me. Its a lonely life.",
            "author": "dade_murphy1",
            "id": "fmmyvua",
            "parent_id": "t3_fvza6b",
            "score": 3,
            "created_utc": 1586214724.0,
            "replies": []
        },
        {
            "body": "Lmao when they expect a share from what you get from your SD because its “free money” and I wouldn’t even have it in the first place so I wouldn’t miss it if I gave them a share...No. \n\nSugaring is an actual relationship in a way and in every relationship you get what you give. A relationship takes nurturing, care, love at times, and a SR definitely isnt “free money” being thrown around. \n\nI personally dont tell my friends, they can barely accept the fact that I choose to see older men",
            "author": "aeiuou",
            "id": "fmmcy3u",
            "parent_id": "t3_fvza6b",
            "score": 3,
            "created_utc": 1586203030.0,
            "replies": []
        },
        {
            "body": "When I started with my 3 yr baby many friends shamed her.  As sugar has become more mainstream here they have all filtered back to her asking for help setting up a profile on Seeking.  in most cases she can tell they are not serious about it, not willing to do the work to find a good SD so she tells them to buzz off.  Occasionally she finds one who has moxy and helps her along.",
            "author": "MidwestAmMan",
            "id": "fmlmmzw",
            "parent_id": "t3_fvza6b",
            "score": 5,
            "created_utc": 1586189360.0,
            "replies": []
        },
        {
            "body": "Always",
            "author": "country0409",
            "id": "fmlbdt0",
            "parent_id": "t3_fvza6b",
            "score": 2,
            "created_utc": 1586182957.0,
            "replies": []
        },
        {
            "body": "Reading these comments make me thankful for my few but true friends.",
            "author": "bsbdfw",
            "id": "fmmy0zr",
            "parent_id": "t3_fvza6b",
            "score": 2,
            "created_utc": 1586214252.0,
            "replies": []
        },
        {
            "body": "I told my one female friend about my experience as a sugar daddy and she found it amusing, but told me that she would never consider doing it herself. I actually suggested to her that she make a profile on there and see what she can get, but she steadfastly told me \"I could never have sex with someone for money. If I was on that site I'd just want to get paid but not actually sleep with anyone.\"\n\nI imagine that's what a lot of women feel about sugaring or any kind of sex for money situation. They wouldn't mind the money but sleeping with someone in that situation just doesn't sit well with them.\n\nMakes you appreciate the ones that do so enthusiastically even more.",
            "author": "mrjimmyjsz",
            "id": "fmmybrc",
            "parent_id": "t3_fvza6b",
            "score": 2,
            "created_utc": 1586214415.0,
            "replies": []
        },
        {
            "body": "Lol one of my girlfriend/sometime my sugar baby -when I am in a good mood only🤣-got very defensive about sugaring early on. But then, after a month and knowing how i did, she asked me for free meals, handouts here and there, and everytime we go shopping, she always pushes me to buy stuffs.  The most hilarious thing is where she asked me to buy her Gucci sneaker on her birthday and when I said I dont have money, she told me to ask my SD to buy her shoes. I laughed until my stomach hurts and I told her maybe she can ask him herself, and see how would he react. He probably would give her a polite, funny  rejection reply 🤣\nShe is going back to her country soon, i told her that might buy her Tiffany’s silver for her. Unfortunately, she prefers gold. 🤪",
            "author": "princessindo",
            "id": "fmn0uty",
            "parent_id": "t3_fvza6b",
            "score": 2,
            "created_utc": 1586215866.0,
            "replies": []
        },
        {
            "body": "I tell no one.",
            "author": "PioneerExperience",
            "id": "fmn2icl",
            "parent_id": "t3_fvza6b",
            "score": 2,
            "created_utc": 1586216836.0,
            "replies": []
        },
        {
            "body": "I am shocked to see how many so-called friends make rude comments! \n\nA while ago, I told two close friends that I was considering sugaring. Their response was amazing, and one of them actually started with me. We joke about it all the time. Sure, there has been the occasional « don't forget my Gucci bag » but they know it's unrealistic. I am lucky to be in a milieu where arrangements, and more generally sex work, is tolerated so from time to time I learn that X or Y is doing it too and it never surprises me.",
            "author": "PleaseMoreCoffee",
            "id": "fmo27mj",
            "parent_id": "t3_fvza6b",
            "score": 2,
            "created_utc": 1586242698.0,
            "replies": [
                {
                    "body": "Same here! My friends will make jokes like that too and I love them for it. Always like to think what if once in awhile.",
                    "author": null,
                    "id": "fmoxc19",
                    "parent_id": "t1_fmo27mj",
                    "score": 1,
                    "created_utc": 1586270344.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I had a friend like that. She wasn’t into it but saw I was spoiled. \n\nHas the audacity to ask me to ask him to help her out! I cut her out. I don’t need that negativity. You are not gonna use me. I work hard!",
            "author": null,
            "id": "fmm3fcg",
            "parent_id": "t3_fvza6b",
            "score": 3,
            "created_utc": 1586198061.0,
            "replies": []
        },
        {
            "body": "They clearly only see the shallow surface of sugaring, they see the potential benefits/rewards but don't justify putting any form of effort into it. Sounds like they don't understand the concept of something mutually beneficial, and the fact that many sugar relationships are genuine and to be desired on both sides. Some just don't get it and never will, needless to say they wouldn't make a great sugar companion with this mindset either so would never understand.",
            "author": "sdaddy0",
            "id": "fmmkfhn",
            "parent_id": "t3_fvza6b",
            "score": 1,
            "created_utc": 1586206890.0,
            "replies": []
        },
        {
            "body": "And this is why I don’t let more than my tiny itty bitty circle in on the shit he does for me. And I never will.",
            "author": "adesiderio",
            "id": "fmnibcw",
            "parent_id": "t3_fvza6b",
            "score": 1,
            "created_utc": 1586226709.0,
            "replies": []
        },
        {
            "body": "I've only told this to 2 people and I've had the similar reactions, so I generally keep what I do in the sugar world to myself.",
            "author": "JustCallMeLo",
            "id": "fmntmvz",
            "parent_id": "t3_fvza6b",
            "score": 1,
            "created_utc": 1586234954.0,
            "replies": []
        },
        {
            "body": "From personal experience when I was in college... keep it to yourself!  If I could turn back time, this is what I wish I had done. Some take it as an open invitation to treat you like a ATM or call you a HOE... it always go that way.",
            "author": "SheHasntHaveherses",
            "id": "fmnxiyb",
            "parent_id": "t3_fvza6b",
            "score": 1,
            "created_utc": 1586238256.0,
            "replies": []
        },
        {
            "body": "My friends who know about me and my SD are very respectful of my SD. My close friends have met him and we’ve all gone out together before. It was a joke about when they joke with me saying those things. \n\nJust light hearted!! 💜",
            "author": null,
            "id": "fmleg4i",
            "parent_id": "t1_fmldp58",
            "score": 6,
            "created_utc": 1586184763.0,
            "replies": []
        },
        {
            "body": "This girl gets it. Your sd is very lucky.",
            "author": "dade_murphy1",
            "id": "fmmyfle",
            "parent_id": "t1_fmldp58",
            "score": 1,
            "created_utc": 1586214474.0,
            "replies": []
        },
        {
            "body": "I like how you dipped your pool in the pond and tested the waters before telling them about sugar. Very wife move.",
            "author": null,
            "id": "fmq6k98",
            "parent_id": "t1_fmldp58",
            "score": 1,
            "created_utc": 1586293809.0,
            "replies": []
        },
        {
            "body": "Hypocritical. Maybe he finally gave in?",
            "author": "BigBearSD",
            "id": "fmld2bo",
            "parent_id": "t1_fmlcovq",
            "score": 5,
            "created_utc": 1586183961.0,
            "replies": [
                {
                    "body": "Hmm nah. He still insults me every now and then whenever I reject him, calling me a slut, whore etc.... says he wants to be w me as a boyf and shit. Zzzzzz pls.",
                    "author": null,
                    "id": "fmld5og",
                    "parent_id": "t1_fmld2bo",
                    "score": 13,
                    "created_utc": 1586184016.0,
                    "replies": [
                        {
                            "body": "sooo fucking hilarious when guys call you a slut. like if i'm such a slut how come i wont sleep with you",
                            "author": "mangofruitbabe",
                            "id": "fmlgue2",
                            "parent_id": "t1_fmld5og",
                            "score": 19,
                            "created_utc": 1586186145.0,
                            "replies": [
                                {
                                    "body": "Right? 🤣",
                                    "author": "LikeHoney99",
                                    "id": "fmlhvzk",
                                    "parent_id": "t1_fmlgue2",
                                    "score": 1,
                                    "created_utc": 1586186738.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "the worst!",
            "author": null,
            "id": "fmm3biv",
            "parent_id": "t1_fmlcovq",
            "score": 1,
            "created_utc": 1586198004.0,
            "replies": [
                {
                    "body": "Ugh I know!!",
                    "author": null,
                    "id": "fmm7hyf",
                    "parent_id": "t1_fmm3biv",
                    "score": 1,
                    "created_utc": 1586200213.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "In what ways did sugaring helped you explore your sexuality?",
            "author": "party_dragon",
            "id": "fmmmk5m",
            "parent_id": "t1_fmlx962",
            "score": 1,
            "created_utc": 1586208030.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "fmnjbi1",
                    "parent_id": "t1_fmmmk5m",
                    "score": 3,
                    "created_utc": 1586227381.0,
                    "replies": [
                        {
                            "body": "Very true",
                            "author": "SheHasntHaveherses",
                            "id": "fmnxozk",
                            "parent_id": "t1_fmnjbi1",
                            "score": 1,
                            "created_utc": 1586238405.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Holier and broke than thou'!",
            "author": "captainIsBack4u",
            "id": "fmlcfr4",
            "parent_id": "t1_fmlc1jd",
            "score": 11,
            "created_utc": 1586183586.0,
            "replies": [
                {
                    "body": "hahaha!",
                    "author": null,
                    "id": "fmlonrk",
                    "parent_id": "t1_fmlcfr4",
                    "score": 2,
                    "created_utc": 1586190393.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I second that emotion.",
            "author": "lolashowme14",
            "id": "fmmc1rc",
            "parent_id": "t1_fmloll9",
            "score": 0,
            "created_utc": 1586202579.0,
            "replies": []
        },
        {
            "body": "You get it.",
            "author": "dade_murphy1",
            "id": "fmmyqxk",
            "parent_id": "t1_fmm7v6d",
            "score": 2,
            "created_utc": 1586214646.0,
            "replies": []
        },
        {
            "body": "Same here! My friends will make jokes like that too and I love them for it. Always like to think what if once in awhile.",
            "author": null,
            "id": "fmoxc19",
            "parent_id": "t1_fmo27mj",
            "score": 1,
            "created_utc": 1586270344.0,
            "replies": []
        },
        {
            "body": "Hmm nah. He still insults me every now and then whenever I reject him, calling me a slut, whore etc.... says he wants to be w me as a boyf and shit. Zzzzzz pls.",
            "author": null,
            "id": "fmld5og",
            "parent_id": "t1_fmld2bo",
            "score": 13,
            "created_utc": 1586184016.0,
            "replies": [
                {
                    "body": "sooo fucking hilarious when guys call you a slut. like if i'm such a slut how come i wont sleep with you",
                    "author": "mangofruitbabe",
                    "id": "fmlgue2",
                    "parent_id": "t1_fmld5og",
                    "score": 19,
                    "created_utc": 1586186145.0,
                    "replies": [
                        {
                            "body": "Right? 🤣",
                            "author": "LikeHoney99",
                            "id": "fmlhvzk",
                            "parent_id": "t1_fmlgue2",
                            "score": 1,
                            "created_utc": 1586186738.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Ugh I know!!",
            "author": null,
            "id": "fmm7hyf",
            "parent_id": "t1_fmm3biv",
            "score": 1,
            "created_utc": 1586200213.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "fmnjbi1",
            "parent_id": "t1_fmmmk5m",
            "score": 3,
            "created_utc": 1586227381.0,
            "replies": [
                {
                    "body": "Very true",
                    "author": "SheHasntHaveherses",
                    "id": "fmnxozk",
                    "parent_id": "t1_fmnjbi1",
                    "score": 1,
                    "created_utc": 1586238405.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "hahaha!",
            "author": null,
            "id": "fmlonrk",
            "parent_id": "t1_fmlcfr4",
            "score": 2,
            "created_utc": 1586190393.0,
            "replies": []
        },
        {
            "body": "sooo fucking hilarious when guys call you a slut. like if i'm such a slut how come i wont sleep with you",
            "author": "mangofruitbabe",
            "id": "fmlgue2",
            "parent_id": "t1_fmld5og",
            "score": 19,
            "created_utc": 1586186145.0,
            "replies": [
                {
                    "body": "Right? 🤣",
                    "author": "LikeHoney99",
                    "id": "fmlhvzk",
                    "parent_id": "t1_fmlgue2",
                    "score": 1,
                    "created_utc": 1586186738.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Very true",
            "author": "SheHasntHaveherses",
            "id": "fmnxozk",
            "parent_id": "t1_fmnjbi1",
            "score": 1,
            "created_utc": 1586238405.0,
            "replies": []
        },
        {
            "body": "Right? 🤣",
            "author": "LikeHoney99",
            "id": "fmlhvzk",
            "parent_id": "t1_fmlgue2",
            "score": 1,
            "created_utc": 1586186738.0,
            "replies": []
        }
    ]
}