{
    "title": "Craziest SD Date EVER",
    "post_id": "cn9upj",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/cn9upj/craziest_sd_date_ever/",
    "author": "SapioSugarBabe",
    "body": "Inspired by [this post](https://www.reddit.com/r/sugarlifestyleforum/comments/cn9d4l/blind_date/), I'm going to share a little story about why you should never do a \"blind date.\" \n\nSo, when I was in school, I was on SA, of course. I was new to the site but not the concept, but, I wasn't really aware of how things worked so I talked to a lot of guys with no photos, including Steve\\* (name changed), who seemed really cool, but absolutely refused to share any photos. I didn't see this as a red flag because I was stupid, and he insisted his work made him too well known and he was married and blah blah blah. So, we made a date.\n\nWe were set to meet at a pretty luxe hotel bar, where I actually knew the bartender, Tim\\*, so I knew he'd keep an eye out for me and, when I showed up, of course, he did. There were only three people in the bar when I got there. A couple, and an older man on his laptop, both back on little couches. The bar itself was empty. \n\nMy date was running late, insisting there was traffic. It wasn't a particularly heavy time for traffic, but, I figured he was further out. So, he keeps texting me telling me he's stuck, and I just believe him. We were set to meet at 7:30, and by this time it was probably like 7:35 or so so I wasn't too miffed. I just chatted with Tim, who got me a drink on him and kept me company. \n\nHalf an hour goes by, which I hardly even noticed, and I'm done with my drink. Steve has been texting me, for some reason I'm confident he's not standing me up, so, I decide to order myself a drink. What's $18, eh? \n\nNow it's past 8 and I'm fed up. The bar was still pretty empty so I start texting some friends to see what they're up to that night. I get a notification to my business email that I have a deposit. It was for some work I'd done, so I figured I'd splurge and I asked for a food menu. I gave up on Steve when I ordered a crab cake and another drink. \n\nMy friends get back to me about hanging out, so I finish up, and tell Tim to get me my check while I go to the bathroom. I come back, and it's paid. Tim tells me a guy who had been in the bar (the older man with the laptop) had paid it and left. I was confused, but, also not really a stranger to guys paying my tab, so I asked if he left a number or anything and Tim said nope, just paid in cash, and didn't even stay to get his tip. I decide not to look a gift horse in the mouth and head out, thankful I'd saved like $50. \n\nIt's cold out, so I'm not really focusing on my phone or anything as I make my way to the subway. I finally pull out my phone and it's a text from Steve: \"You looked lovely tonight. Hope you enjoyed your meal.\" \n\n*TL;DR: I met up with a guy with no photos, I thought he never arrived so I had dinner alone, he was actually there the whole time and paid my tab without saying a single word to me.*",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/cn9upj/craziest_sd_date_ever/",
    "score": 94,
    "upvote_ratio": 0.95,
    "created_utc": 1565203709.0,
    "num_comments": 61,
    "links": [
        [
            "https://www.reddit.com/r/sugarlifestyleforum/comments/cn9d4l/blind_date/"
        ]
    ],
    "comments": [
        {
            "body": "Yes, creepy for sure.\n\nI have a different take on it, being paralyzed in fear of talking to women most of my life, to me it seemed like he just panicked and couldn't get the nerve up to even introduce himself. Yet felt bad  standing you up and stiffing you with the bill.\n\nThen at his computer/phone wishing he had had the nerve, thought he could maybe have a second chance by telling you he paid thinking it might come off as appreciated and he might get a second chance.\n\n... but I'm an eternal optimist.\n\nI just know first hand how good intentions + paralyzing fear can cascade into horribly embarrassing situations.",
            "author": "Op1yum",
            "id": "ew8v183",
            "parent_id": "t3_cn9upj",
            "score": 24,
            "created_utc": 1565215590.0,
            "replies": [
                {
                    "body": "I considered that at first but he would have to know that I saw him with his computer when I walked in, so then he'd also have to explain lying about traffic.",
                    "author": "SapioSugarBabe",
                    "id": "ew8wvjx",
                    "parent_id": "t1_ew8v183",
                    "score": 8,
                    "created_utc": 1565216321.0,
                    "replies": [
                        {
                            "body": "Ya but it’s not about logic.. It doesn’t matter really because you reacted in the only sane way regardless of his intentions good, neutral or bad.",
                            "author": "Op1yum",
                            "id": "ew8yw06",
                            "parent_id": "t1_ew8wvjx",
                            "score": 7,
                            "created_utc": 1565217139.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I am definitely not offended by this guy. Odd, but hey, maybe it’s a kink of his. He likes to see a sexy lady “out of his league” and slowly catch or make a relationship.\n\nIf he went out to find a girl in the wild, higher chances of rejection, vs you have semi agreed to date, so he’s playing and having fun with it.\n\nPlus, why not choose a really nice place and have a great dinner and drinks with out even having to make a big ordeal. Nice relaxing dinner to me!",
            "author": "Tanlookinggal",
            "id": "ew88jyk",
            "parent_id": "t3_cn9upj",
            "score": 22,
            "created_utc": 1565205469.0,
            "replies": [
                {
                    "body": "The thing is, there were a lot of factors that had to go right for this to happen if it was his kink. I had to know the bartender and he would have to cover my first drink. He knew I was a broke college student, so why go out on a limb and think I'm gonna spring $20 for a drink while waiting for some dude who's late? How would he know I got paid at that moment and was gonna order dinner? That's what made it weird. If I just left after fifteen minutes, what would've been the point?",
                    "author": "SapioSugarBabe",
                    "id": "ew88tfo",
                    "parent_id": "t1_ew88jyk",
                    "score": 10,
                    "created_utc": 1565205625.0,
                    "replies": [
                        {
                            "body": "That is a good point. For a kink, he would want to somewhat set it up so it goes right.\nI don’t use restrooms often, so if it was me, when would he have paid? I’m sure he would have sent you money if he didn’t catch it in time anyways.",
                            "author": "Tanlookinggal",
                            "id": "ew8cfty",
                            "parent_id": "t1_ew88tfo",
                            "score": 5,
                            "created_utc": 1565207493.0,
                            "replies": []
                        },
                        {
                            "body": "\n\nYOUR TIMING DOESN'T MAKE SENSE TO ME \n\nI'm interested to know how he knew that you would be in the lady's room long enough for him to get his things together (pay his bill?), walk to the bar, ask for your bar bill (including explaining to the bartender why he was attempting to pay it), actually get the cash out, pay the bill, say goodbye to the bartender, gather his things again, walk out of the bar, then walk away (far enough so that you would not be able to catch up with him, or know which direction he headed).    Any suggestions?",
                            "author": "MasterAcct2020",
                            "id": "ew9n9rx",
                            "parent_id": "t1_ew88tfo",
                            "score": 1,
                            "created_utc": 1565228035.0,
                            "replies": [
                                {
                                    "body": "At this bar, they leave your tab in a little glass in front of your spot, and according to Tim the bartender, he just left cash and didn't wait for his change, so it wouldn't have taken all that long. Also, the bathrooms were literally basically on the other side of the lobby so if he overheard me say I was going to the bathroom (which he obviously did), he knew I at the very least had to walk five minutes to get there and five minutes back.",
                                    "author": "SapioSugarBabe",
                                    "id": "ew9one9",
                                    "parent_id": "t1_ew9n9rx",
                                    "score": 4,
                                    "created_utc": 1565228639.0,
                                    "replies": [
                                        {
                                            "body": "👍",
                                            "author": "MasterAcct2020",
                                            "id": "ew9owmp",
                                            "parent_id": "t1_ew9one9",
                                            "score": 0,
                                            "created_utc": 1565228761.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Also, I didn't get a good look at his face and I immediately got on the subway after. How would I know he didn't follow me or something? That's another like, super unsettling thing to me, personally.",
                    "author": "SapioSugarBabe",
                    "id": "ew88ybs",
                    "parent_id": "t1_ew88jyk",
                    "score": 18,
                    "created_utc": 1565205706.0,
                    "replies": [
                        {
                            "body": "That would be the only scary part to me. Like how close does he like to watch, what else is he trying to play out...",
                            "author": "Tanlookinggal",
                            "id": "ew8cknh",
                            "parent_id": "t1_ew88ybs",
                            "score": 9,
                            "created_utc": 1565207549.0,
                            "replies": []
                        },
                        {
                            "body": "“How would I know he didn't follow me or something?”\n\nThat’s the part that would creep me out.  I once had a man approach me in the super market saying he saw me park and followed me in to ask me out.  Talk about stranger danger..  The hair on the back of my neck stood up.",
                            "author": "RestartYourHeart",
                            "id": "ew933p9",
                            "parent_id": "t1_ew88ybs",
                            "score": 6,
                            "created_utc": 1565218900.0,
                            "replies": []
                        },
                        {
                            "body": "Damn boo that’s creepy af, I would be creeped out at the whole situation tbh with you.",
                            "author": "Newlifemn",
                            "id": "ew9pu51",
                            "parent_id": "t1_ew88ybs",
                            "score": 3,
                            "created_utc": 1565229192.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "It's a nervy thing to meet someone in the flesh.  More so when you are older and established.   So this guy tried a cheesy, made-for-TV move.  It probably worked in his mind...just not in reality.   That's the problem with trying out witty banter, or unexpected behavior....the guys in the movies have script writers and choreographers.  \n\nI'm sure, in his mind, he was being cute...mysterious...dramatic.   Romantics like to think the world works that way.   But, reality is usually very straight forward... boring.  And, that's where most of us live.   \n\nSome girls might have been intrigued by this guy.   He rolled the dice that you might be such a girl.    Oops, Craps!",
            "author": "sdphilly",
            "id": "ew8ksvj",
            "parent_id": "t3_cn9upj",
            "score": 5,
            "created_utc": 1565211125.0,
            "replies": []
        },
        {
            "body": "Here again is where the ground rules would kick in for that other SB.  He would have to check in with someone, be seated, and then the SB can decide whether or not to engage.  Control remains with the SB.",
            "author": "Academic_Set",
            "id": "ew85x0w",
            "parent_id": "t3_cn9upj",
            "score": 6,
            "created_utc": 1565203937.0,
            "replies": [
                {
                    "body": "Doesn't really work at a bar without a host/ess.",
                    "author": "SapioSugarBabe",
                    "id": "ew863e9",
                    "parent_id": "t1_ew85x0w",
                    "score": 6,
                    "created_utc": 1565204040.0,
                    "replies": [
                        {
                            "body": "Then find one",
                            "author": "Academic_Set",
                            "id": "ew869wh",
                            "parent_id": "t1_ew863e9",
                            "score": -8,
                            "created_utc": 1565204143.0,
                            "replies": [
                                {
                                    "body": "Lol, lemme go back in time and do that, lol? I'm not disputing about the need for ground rules, but I would go tell the SB that, not respond to a 6 year old story, lol.\n\nOr just DON'T do blind dates at all. Who wants to waste time, makeup, and Uber money just to potentially not wanna talk to a guy AND have to stand him up? Just share pics.",
                                    "author": "SapioSugarBabe",
                                    "id": "ew86d61",
                                    "parent_id": "t1_ew869wh",
                                    "score": 7,
                                    "created_utc": 1565204195.0,
                                    "replies": [
                                        {
                                            "body": "I was not speaking to your experience.  With enough vetting otherwise, a lot can be learned.",
                                            "author": "Academic_Set",
                                            "id": "ew86wyx",
                                            "parent_id": "t1_ew86d61",
                                            "score": -2,
                                            "created_utc": 1565204516.0,
                                            "replies": [
                                                {
                                                    "body": "Anyway, don't do blind dates, girls! Ever! At all!",
                                                    "author": "SapioSugarBabe",
                                                    "id": "ew871zs",
                                                    "parent_id": "t1_ew86wyx",
                                                    "score": 8,
                                                    "created_utc": 1565204598.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Did he ever try to meet you again after that?",
            "author": "sinkyou",
            "id": "ew86uir",
            "parent_id": "t3_cn9upj",
            "score": 2,
            "created_utc": 1565204476.0,
            "replies": [
                {
                    "body": "I blocked him immediately after the creepy text.",
                    "author": "SapioSugarBabe",
                    "id": "ew86xyg",
                    "parent_id": "t1_ew86uir",
                    "score": 10,
                    "created_utc": 1565204532.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Oof. I loved this story! hahaha.",
            "author": "KarmatheHusky",
            "id": "ew8qnc9",
            "parent_id": "t3_cn9upj",
            "score": 2,
            "created_utc": 1565213694.0,
            "replies": [
                {
                    "body": "Honestly, after six years, it's my favorite story to tell, but in the moment it was freaky!",
                    "author": "SapioSugarBabe",
                    "id": "ew8qy8a",
                    "parent_id": "t1_ew8qnc9",
                    "score": 5,
                    "created_utc": 1565213824.0,
                    "replies": [
                        {
                            "body": "I can imagine it was freaky! Especially after having a drink or two, than leaving?!? i'd be a little freaked out.\n\nbut idk, the mysteriousness is sexy affffff to me. hahaha.",
                            "author": "KarmatheHusky",
                            "id": "ew8ufgx",
                            "parent_id": "t1_ew8qy8a",
                            "score": 1,
                            "created_utc": 1565215334.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Do drinks really cost $20 in a bar nowadays?",
            "author": "JDiGi7730",
            "id": "ewajnah",
            "parent_id": "t3_cn9upj",
            "score": 2,
            "created_utc": 1565245099.0,
            "replies": [
                {
                    "body": "At a 5-star hotel bar, yes, lol.",
                    "author": "SapioSugarBabe",
                    "id": "ewavorz",
                    "parent_id": "t1_ewajnah",
                    "score": 1,
                    "created_utc": 1565253002.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Or here is another possibility...\n\nThe guy is there a lot, it's a regular hangout for him, and he knows \"Tim\". It's nothing if you have ongoing rapport with waitstaff at a place you tip VERY well, to let them know, \"Hey, this girl is going to show up waiting for a date. I'll cover her tab for anything she wants.\" and they're more than happy to help. I used to make it a point to secretly pay the meal for someone (or someones) at my favorite place when I lived in Texas - especially if they looked stressed, or seemed to have a lot on their mind, with the explicit instructions to never hint that it was me. \n\nBut I didn't arrange for that \"observe someone I want to know\" from a distance thing. That's just odd to me. Who knows, maybe that was his thing. Or maybe it was he wanted to verify what you looked like first?\n\nIn any case, stranger things have happened.",
            "author": "SDRippington",
            "id": "ew8e4xb",
            "parent_id": "t3_cn9upj",
            "score": 2,
            "created_utc": 1565208208.0,
            "replies": [
                {
                    "body": "Another possibility for what, lol? I'm not speculating on why he did it, I think it's creepy regardless. But also, he KNEW I was a broke college student, so why would I have even bought an $18 drink much less an entire dinner instead of just leaving once he didn't show up? There's too many variables, and I've known Tim for years, it seems pretty weird that he wouldn't have hinted if that was the case since he knew exactly what I was there for. I think he was just a weirdo to be honest, and either way he made me feel extremely unsafe.",
                    "author": "SapioSugarBabe",
                    "id": "ew8ewkl",
                    "parent_id": "t1_ew8e4xb",
                    "score": 3,
                    "created_utc": 1565208542.0,
                    "replies": [
                        {
                            "body": "Oh I don't disagree! And I wasn't clear that you knew Tim - that's totally different.\n\nAgreed people can be extremely weird. Reddit alone proves that!\n\n/S",
                            "author": "SDRippington",
                            "id": "ew8f408",
                            "parent_id": "t1_ew8ewkl",
                            "score": 2,
                            "created_utc": 1565208629.0,
                            "replies": []
                        },
                        {
                            "body": "Orrrr that stranger was just being nice? That could be it, too. The simplest explanation is usually the correct one.",
                            "author": "SDRippington",
                            "id": "ew8f9vc",
                            "parent_id": "t1_ew8ewkl",
                            "score": 0,
                            "created_utc": 1565208699.0,
                            "replies": [
                                {
                                    "body": "Kinda odd for it to be a stranger and then IMMEDIATELY get a text from the guy I was waiting on (who I had not told I was getting a drink or a meal) telling me he hoped I enjoyed my meal.",
                                    "author": "SapioSugarBabe",
                                    "id": "ew8g1o7",
                                    "parent_id": "t1_ew8f9vc",
                                    "score": 3,
                                    "created_utc": 1565209040.0,
                                    "replies": [
                                        {
                                            "body": "Oooo okay - that just went over the creepy line. Creepy AF.\n\nI take back what I said. ICK!",
                                            "author": "SDRippington",
                                            "id": "ew8hdl5",
                                            "parent_id": "t1_ew8g1o7",
                                            "score": 3,
                                            "created_utc": 1565209618.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "Oh I just slowly re-read everything. OMFG yes - that was creepy.",
                                            "author": "SDRippington",
                                            "id": "ew8iimu",
                                            "parent_id": "t1_ew8g1o7",
                                            "score": 2,
                                            "created_utc": 1565210119.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "👍 good one. I wrote a reply up top running through the timing of events and it didn't work out for me. But... Your scenario makes everything work.  +1 to you.",
                    "author": "MasterAcct2020",
                    "id": "ew9ntis",
                    "parent_id": "t1_ew8e4xb",
                    "score": 1,
                    "created_utc": 1565228272.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Damn girl, that is up there for strange and I've seen some shit! I'm super curious what that was about, what a bummer you blocked him lol. Thanks for sharing :)",
            "author": "JooseyJayrod",
            "id": "ew8a22v",
            "parent_id": "t3_cn9upj",
            "score": 1,
            "created_utc": 1565206355.0,
            "replies": [
                {
                    "body": "SAME! I was so curious to hear more. i thought it sounded hott hahahah but im also a pervy SB. \n\n&#x200B;\n\n\\*Thanks for sharing OP",
                    "author": "KarmatheHusky",
                    "id": "ew8ryqq",
                    "parent_id": "t1_ew8a22v",
                    "score": 0,
                    "created_utc": 1565214261.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "What is the point of that??? Ah well, put it down to life experience...",
            "author": "aesthete2061",
            "id": "ewa6ism",
            "parent_id": "t3_cn9upj",
            "score": 1,
            "created_utc": 1565237485.0,
            "replies": []
        },
        {
            "body": "What an asshole.",
            "author": "DallasSugarBaby",
            "id": "ewad3ww",
            "parent_id": "t3_cn9upj",
            "score": 1,
            "created_utc": 1565241193.0,
            "replies": []
        },
        {
            "body": "Good story, but I can guarantee that's not the \"***Craziest SD Date Ever\"!  lol***\n\nI had a girl recently tell me about a first date she had with POT.  Early on in the discussion he mentioned how much she looked like his step daughter.  Later in the discussion, he asked if she would mind if he called her by his step daughters name. ....you see where this is going.  ***CREEPY!!!***",
            "author": "willfromvb",
            "id": "ewb1z1x",
            "parent_id": "t3_cn9upj",
            "score": 1,
            "created_utc": 1565257284.0,
            "replies": [
                {
                    "body": "It's not even the craziest date I've personally had, but the title got clicks. :P Also....eww, lol.",
                    "author": "SapioSugarBabe",
                    "id": "ewc8iak",
                    "parent_id": "t1_ewb1z1x",
                    "score": 1,
                    "created_utc": 1565280188.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "ok, this is officially better and creepier than my story of getting in a car with a pot SB on a first date to drive down an unmarked, unmapped, unpaved country road to her place in the middle of the woods",
            "author": "joc13",
            "id": "ewceth5",
            "parent_id": "t3_cn9upj",
            "score": 1,
            "created_utc": 1565283544.0,
            "replies": []
        },
        {
            "body": "I’m glad you’re safe because, DUDE WTF",
            "author": "ThrowAwayyeayyyeayy",
            "id": "eweb8z3",
            "parent_id": "t3_cn9upj",
            "score": 1,
            "created_utc": 1565319138.0,
            "replies": []
        },
        {
            "body": "Love interesting stories like this! However, your logic seems a bit flawed, tying this event to the SD's refusal to send a photo. For one thing, he could have just as easily sent a fake photo and you would have been just as vulnerable to the same events transpiring. In fact, if this stories teaches anything it is that you shouldn't have sent a photo either. By sending a photo, he was able to easily identify you.",
            "author": "manlicksdog",
            "id": "ewf4qgb",
            "parent_id": "t3_cn9upj",
            "score": 1,
            "created_utc": 1565350999.0,
            "replies": [
                {
                    "body": "I'm not tying it to his refusal to send a photo. The fact that I had no idea what he looked like is what enabled him to do this and, had he followed me or something, I'd have no way of even knowing it was him. That's why I don't do meet ups without a photo or video chat: I need to know who I'm looking for, otherwise I'm leaving myself vulnerable. LOL, I'd NEVER get a date on SA if I didn't have a photo, that's crazy.",
                    "author": "SapioSugarBabe",
                    "id": "ewfnvmd",
                    "parent_id": "t1_ewf4qgb",
                    "score": 1,
                    "created_utc": 1565364804.0,
                    "replies": [
                        {
                            "body": "I still think you are looking at the situation backwards. What a photo provides is false sense of security. I can't tell you how many SBs tell me that they need a photo to show that I'm not an ax murderer, as if somehow you can tell an ax murder by looking at their face. The real reason I don't provide photos is because I'm cautious and rational about protecting my privacy. If anything, reluctance to share a photo shows weakness and vulnerability, which actually gives you an advantage and leverage if you think about it. A person with malicious intentions will just send you a fake photo. \n\nI think SBs can get away with not showing their face if they show tasteful shots of body and/or face obscured by hair. I can get a general sense of a woman's attractiveness without seeing her face. At least, that's how I feel. I'm understanding and respect a woman who values her privacy. To me, it tells me she's real and feels vulnerable, just like I do. It's not a red flag.",
                            "author": "manlicksdog",
                            "id": "ewj9x73",
                            "parent_id": "t1_ewfnvmd",
                            "score": 1,
                            "created_utc": 1565463487.0,
                            "replies": [
                                {
                                    "body": "It's a red flag for me and we can disagree. I'm doing fine and clearly so are you. This story is from six years ago and since I stopped going on dates with people with no photos, I've not only met better looking daddies but, more importantly haven't had any pushback at all, so I'm gonna keep doing it. Thanks though, for the advice, though I don't recall putting that particular tag on the post.",
                                    "author": "SapioSugarBabe",
                                    "id": "ewjc8ul",
                                    "parent_id": "t1_ewj9x73",
                                    "score": 1,
                                    "created_utc": 1565464484.0,
                                    "replies": [
                                        {
                                            "body": "Well, it's true that different methods work for different people. We all have our different priorities...Wasn't really trying to give advice so much as add a different perspective.",
                                            "author": "manlicksdog",
                                            "id": "ewjn1g3",
                                            "parent_id": "t1_ewjc8ul",
                                            "score": 1,
                                            "created_utc": 1565469065.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Weird. I’ve met up with lots of no-pic guys. One was a local newscaster, another was a billionaire philanthropist. The others were just married. I do t think it’s a red flag. I don’t personally do pics.",
            "author": "w-r",
            "id": "ew95cy9",
            "parent_id": "t3_cn9upj",
            "score": 1,
            "created_utc": 1565219902.0,
            "replies": [
                {
                    "body": "If they don't wanna send photos, then we can video chat, but I refuse to meet up without seeing someone's face, now, I don't care how important they claim to be or are, lol.",
                    "author": "SapioSugarBabe",
                    "id": "ew9kp1f",
                    "parent_id": "t1_ew95cy9",
                    "score": 2,
                    "created_utc": 1565226862.0,
                    "replies": [
                        {
                            "body": "I think that’s the stance most ppl take. It makes sense.",
                            "author": "w-r",
                            "id": "ewc6bwk",
                            "parent_id": "t1_ew9kp1f",
                            "score": 1,
                            "created_utc": 1565278956.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "So how does someone “known” sending a pic in advance change anything from them when they meet in person? This always confuses me",
                    "author": "SummerLuv111",
                    "id": "ewe81l4",
                    "parent_id": "t1_ew95cy9",
                    "score": 1,
                    "created_utc": 1565316749.0,
                    "replies": [
                        {
                            "body": "Because in person, you know who is seeing you. Nobody can forward or post or share the experience of spending time with someone. And isn’t that what this life is all about?",
                            "author": "w-r",
                            "id": "ewenw2h",
                            "parent_id": "t1_ewe81l4",
                            "score": 1,
                            "created_utc": 1565330432.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "You walked in and Steve was unimpressed. He was at the same time busy with his million dollar deal. He figured it’s best to focus on the deal vs you but being a gentleman he wanted you to not go back hungry or thirsty and picked up the tab. He may look like he was creepy but maybe he was simply unimpressed.",
            "author": null,
            "id": "ewaxv99",
            "parent_id": "t3_cn9upj",
            "score": 1,
            "created_utc": 1565254528.0,
            "replies": [
                {
                    "body": "I was wondering how long it would take to someone to say I must've just been unattractive as if that's an excuse to freak someone out and make them feel unsafe.",
                    "author": "SapioSugarBabe",
                    "id": "ewc8l19",
                    "parent_id": "t1_ewaxv99",
                    "score": 2,
                    "created_utc": 1565280230.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Sweet!",
            "author": "GSSD",
            "id": "ew8hp5d",
            "parent_id": "t3_cn9upj",
            "score": 0,
            "created_utc": 1565209758.0,
            "replies": []
        },
        {
            "body": "Creeepy!!!",
            "author": null,
            "id": "ew96516",
            "parent_id": "t3_cn9upj",
            "score": 0,
            "created_utc": 1565220248.0,
            "replies": []
        },
        {
            "body": "Tim talked you into the drink, right? Tim or a friend bought you dinner. There never was a Steve. Someone thought you needed a pick-me-up, and that you don't like charity, so they set you up for a night out, and didn't realize it was going to break more creepy than nice.  Steve had a lot of your same interests, to, right? That's why the text with him before the date felt natural. It was someone who knew you, lol.",
            "author": "TastySpermDispenser",
            "id": "ew8h5lk",
            "parent_id": "t3_cn9upj",
            "score": -2,
            "created_utc": 1565209523.0,
            "replies": [
                {
                    "body": "Tim is a gay man I've known since I was 14 who knows I not only love charity and people buying me things but also knew that I was a sugar baby, AND who I didn't tell I was coming until I was on the train there. Me and Steve didn't share any interests, in fact, we connected over our love of banter, not anything we particularly had in common, which is not rare for me as I'm fantastic at banter, lol. And Steve had a premium account on Seeking Arrangement and was verified so that would be quite a lot of work to just buy me dinner, AND to even know who I was from SA because I didn't have face pics then (only in my private photos which I shared halfway through the conversation). That would be a cute idea but it's not plausible at all given....every single other factor of our meeting, lol.",
                    "author": "SapioSugarBabe",
                    "id": "ew8hvcb",
                    "parent_id": "t1_ew8h5lk",
                    "score": 2,
                    "created_utc": 1565209835.0,
                    "replies": [
                        {
                            "body": "Based on this response, I should probably take off my tin foil hat since I am so obviously wrong.  However, my tin foil hat is sexy af, so I'm keeping it on.\n#\nTo be clear, Tim is still a suspect. You told him on the train that you were coming to the bar, but if \"steve\" picked the bar, he already knew that. He also knew you were an sb, and could have just gotten a note from a friend of his, who is an active sd, that he saw your profile. If Tim could have just bought you dinner, no obvious reason for him to do this, so I agree you are right.",
                            "author": "TastySpermDispenser",
                            "id": "ew8j33c",
                            "parent_id": "t1_ew8hvcb",
                            "score": -2,
                            "created_utc": 1565210371.0,
                            "replies": [
                                {
                                    "body": "I picked the bar because I knew Tim. I didn't tell Steve that I knew Tim or anyone at the bar because that defeats the purpose of using that as a safety measure lol.",
                                    "author": "SapioSugarBabe",
                                    "id": "ew8jenh",
                                    "parent_id": "t1_ew8j33c",
                                    "score": 5,
                                    "created_utc": 1565210507.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I considered that at first but he would have to know that I saw him with his computer when I walked in, so then he'd also have to explain lying about traffic.",
            "author": "SapioSugarBabe",
            "id": "ew8wvjx",
            "parent_id": "t1_ew8v183",
            "score": 8,
            "created_utc": 1565216321.0,
            "replies": [
                {
                    "body": "Ya but it’s not about logic.. It doesn’t matter really because you reacted in the only sane way regardless of his intentions good, neutral or bad.",
                    "author": "Op1yum",
                    "id": "ew8yw06",
                    "parent_id": "t1_ew8wvjx",
                    "score": 7,
                    "created_utc": 1565217139.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "The thing is, there were a lot of factors that had to go right for this to happen if it was his kink. I had to know the bartender and he would have to cover my first drink. He knew I was a broke college student, so why go out on a limb and think I'm gonna spring $20 for a drink while waiting for some dude who's late? How would he know I got paid at that moment and was gonna order dinner? That's what made it weird. If I just left after fifteen minutes, what would've been the point?",
            "author": "SapioSugarBabe",
            "id": "ew88tfo",
            "parent_id": "t1_ew88jyk",
            "score": 10,
            "created_utc": 1565205625.0,
            "replies": [
                {
                    "body": "That is a good point. For a kink, he would want to somewhat set it up so it goes right.\nI don’t use restrooms often, so if it was me, when would he have paid? I’m sure he would have sent you money if he didn’t catch it in time anyways.",
                    "author": "Tanlookinggal",
                    "id": "ew8cfty",
                    "parent_id": "t1_ew88tfo",
                    "score": 5,
                    "created_utc": 1565207493.0,
                    "replies": []
                },
                {
                    "body": "\n\nYOUR TIMING DOESN'T MAKE SENSE TO ME \n\nI'm interested to know how he knew that you would be in the lady's room long enough for him to get his things together (pay his bill?), walk to the bar, ask for your bar bill (including explaining to the bartender why he was attempting to pay it), actually get the cash out, pay the bill, say goodbye to the bartender, gather his things again, walk out of the bar, then walk away (far enough so that you would not be able to catch up with him, or know which direction he headed).    Any suggestions?",
                    "author": "MasterAcct2020",
                    "id": "ew9n9rx",
                    "parent_id": "t1_ew88tfo",
                    "score": 1,
                    "created_utc": 1565228035.0,
                    "replies": [
                        {
                            "body": "At this bar, they leave your tab in a little glass in front of your spot, and according to Tim the bartender, he just left cash and didn't wait for his change, so it wouldn't have taken all that long. Also, the bathrooms were literally basically on the other side of the lobby so if he overheard me say I was going to the bathroom (which he obviously did), he knew I at the very least had to walk five minutes to get there and five minutes back.",
                            "author": "SapioSugarBabe",
                            "id": "ew9one9",
                            "parent_id": "t1_ew9n9rx",
                            "score": 4,
                            "created_utc": 1565228639.0,
                            "replies": [
                                {
                                    "body": "👍",
                                    "author": "MasterAcct2020",
                                    "id": "ew9owmp",
                                    "parent_id": "t1_ew9one9",
                                    "score": 0,
                                    "created_utc": 1565228761.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Also, I didn't get a good look at his face and I immediately got on the subway after. How would I know he didn't follow me or something? That's another like, super unsettling thing to me, personally.",
            "author": "SapioSugarBabe",
            "id": "ew88ybs",
            "parent_id": "t1_ew88jyk",
            "score": 18,
            "created_utc": 1565205706.0,
            "replies": [
                {
                    "body": "That would be the only scary part to me. Like how close does he like to watch, what else is he trying to play out...",
                    "author": "Tanlookinggal",
                    "id": "ew8cknh",
                    "parent_id": "t1_ew88ybs",
                    "score": 9,
                    "created_utc": 1565207549.0,
                    "replies": []
                },
                {
                    "body": "“How would I know he didn't follow me or something?”\n\nThat’s the part that would creep me out.  I once had a man approach me in the super market saying he saw me park and followed me in to ask me out.  Talk about stranger danger..  The hair on the back of my neck stood up.",
                    "author": "RestartYourHeart",
                    "id": "ew933p9",
                    "parent_id": "t1_ew88ybs",
                    "score": 6,
                    "created_utc": 1565218900.0,
                    "replies": []
                },
                {
                    "body": "Damn boo that’s creepy af, I would be creeped out at the whole situation tbh with you.",
                    "author": "Newlifemn",
                    "id": "ew9pu51",
                    "parent_id": "t1_ew88ybs",
                    "score": 3,
                    "created_utc": 1565229192.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Doesn't really work at a bar without a host/ess.",
            "author": "SapioSugarBabe",
            "id": "ew863e9",
            "parent_id": "t1_ew85x0w",
            "score": 6,
            "created_utc": 1565204040.0,
            "replies": [
                {
                    "body": "Then find one",
                    "author": "Academic_Set",
                    "id": "ew869wh",
                    "parent_id": "t1_ew863e9",
                    "score": -8,
                    "created_utc": 1565204143.0,
                    "replies": [
                        {
                            "body": "Lol, lemme go back in time and do that, lol? I'm not disputing about the need for ground rules, but I would go tell the SB that, not respond to a 6 year old story, lol.\n\nOr just DON'T do blind dates at all. Who wants to waste time, makeup, and Uber money just to potentially not wanna talk to a guy AND have to stand him up? Just share pics.",
                            "author": "SapioSugarBabe",
                            "id": "ew86d61",
                            "parent_id": "t1_ew869wh",
                            "score": 7,
                            "created_utc": 1565204195.0,
                            "replies": [
                                {
                                    "body": "I was not speaking to your experience.  With enough vetting otherwise, a lot can be learned.",
                                    "author": "Academic_Set",
                                    "id": "ew86wyx",
                                    "parent_id": "t1_ew86d61",
                                    "score": -2,
                                    "created_utc": 1565204516.0,
                                    "replies": [
                                        {
                                            "body": "Anyway, don't do blind dates, girls! Ever! At all!",
                                            "author": "SapioSugarBabe",
                                            "id": "ew871zs",
                                            "parent_id": "t1_ew86wyx",
                                            "score": 8,
                                            "created_utc": 1565204598.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I blocked him immediately after the creepy text.",
            "author": "SapioSugarBabe",
            "id": "ew86xyg",
            "parent_id": "t1_ew86uir",
            "score": 10,
            "created_utc": 1565204532.0,
            "replies": []
        },
        {
            "body": "Honestly, after six years, it's my favorite story to tell, but in the moment it was freaky!",
            "author": "SapioSugarBabe",
            "id": "ew8qy8a",
            "parent_id": "t1_ew8qnc9",
            "score": 5,
            "created_utc": 1565213824.0,
            "replies": [
                {
                    "body": "I can imagine it was freaky! Especially after having a drink or two, than leaving?!? i'd be a little freaked out.\n\nbut idk, the mysteriousness is sexy affffff to me. hahaha.",
                    "author": "KarmatheHusky",
                    "id": "ew8ufgx",
                    "parent_id": "t1_ew8qy8a",
                    "score": 1,
                    "created_utc": 1565215334.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "At a 5-star hotel bar, yes, lol.",
            "author": "SapioSugarBabe",
            "id": "ewavorz",
            "parent_id": "t1_ewajnah",
            "score": 1,
            "created_utc": 1565253002.0,
            "replies": []
        },
        {
            "body": "Another possibility for what, lol? I'm not speculating on why he did it, I think it's creepy regardless. But also, he KNEW I was a broke college student, so why would I have even bought an $18 drink much less an entire dinner instead of just leaving once he didn't show up? There's too many variables, and I've known Tim for years, it seems pretty weird that he wouldn't have hinted if that was the case since he knew exactly what I was there for. I think he was just a weirdo to be honest, and either way he made me feel extremely unsafe.",
            "author": "SapioSugarBabe",
            "id": "ew8ewkl",
            "parent_id": "t1_ew8e4xb",
            "score": 3,
            "created_utc": 1565208542.0,
            "replies": [
                {
                    "body": "Oh I don't disagree! And I wasn't clear that you knew Tim - that's totally different.\n\nAgreed people can be extremely weird. Reddit alone proves that!\n\n/S",
                    "author": "SDRippington",
                    "id": "ew8f408",
                    "parent_id": "t1_ew8ewkl",
                    "score": 2,
                    "created_utc": 1565208629.0,
                    "replies": []
                },
                {
                    "body": "Orrrr that stranger was just being nice? That could be it, too. The simplest explanation is usually the correct one.",
                    "author": "SDRippington",
                    "id": "ew8f9vc",
                    "parent_id": "t1_ew8ewkl",
                    "score": 0,
                    "created_utc": 1565208699.0,
                    "replies": [
                        {
                            "body": "Kinda odd for it to be a stranger and then IMMEDIATELY get a text from the guy I was waiting on (who I had not told I was getting a drink or a meal) telling me he hoped I enjoyed my meal.",
                            "author": "SapioSugarBabe",
                            "id": "ew8g1o7",
                            "parent_id": "t1_ew8f9vc",
                            "score": 3,
                            "created_utc": 1565209040.0,
                            "replies": [
                                {
                                    "body": "Oooo okay - that just went over the creepy line. Creepy AF.\n\nI take back what I said. ICK!",
                                    "author": "SDRippington",
                                    "id": "ew8hdl5",
                                    "parent_id": "t1_ew8g1o7",
                                    "score": 3,
                                    "created_utc": 1565209618.0,
                                    "replies": []
                                },
                                {
                                    "body": "Oh I just slowly re-read everything. OMFG yes - that was creepy.",
                                    "author": "SDRippington",
                                    "id": "ew8iimu",
                                    "parent_id": "t1_ew8g1o7",
                                    "score": 2,
                                    "created_utc": 1565210119.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "👍 good one. I wrote a reply up top running through the timing of events and it didn't work out for me. But... Your scenario makes everything work.  +1 to you.",
            "author": "MasterAcct2020",
            "id": "ew9ntis",
            "parent_id": "t1_ew8e4xb",
            "score": 1,
            "created_utc": 1565228272.0,
            "replies": []
        },
        {
            "body": "SAME! I was so curious to hear more. i thought it sounded hott hahahah but im also a pervy SB. \n\n&#x200B;\n\n\\*Thanks for sharing OP",
            "author": "KarmatheHusky",
            "id": "ew8ryqq",
            "parent_id": "t1_ew8a22v",
            "score": 0,
            "created_utc": 1565214261.0,
            "replies": []
        },
        {
            "body": "It's not even the craziest date I've personally had, but the title got clicks. :P Also....eww, lol.",
            "author": "SapioSugarBabe",
            "id": "ewc8iak",
            "parent_id": "t1_ewb1z1x",
            "score": 1,
            "created_utc": 1565280188.0,
            "replies": []
        },
        {
            "body": "I'm not tying it to his refusal to send a photo. The fact that I had no idea what he looked like is what enabled him to do this and, had he followed me or something, I'd have no way of even knowing it was him. That's why I don't do meet ups without a photo or video chat: I need to know who I'm looking for, otherwise I'm leaving myself vulnerable. LOL, I'd NEVER get a date on SA if I didn't have a photo, that's crazy.",
            "author": "SapioSugarBabe",
            "id": "ewfnvmd",
            "parent_id": "t1_ewf4qgb",
            "score": 1,
            "created_utc": 1565364804.0,
            "replies": [
                {
                    "body": "I still think you are looking at the situation backwards. What a photo provides is false sense of security. I can't tell you how many SBs tell me that they need a photo to show that I'm not an ax murderer, as if somehow you can tell an ax murder by looking at their face. The real reason I don't provide photos is because I'm cautious and rational about protecting my privacy. If anything, reluctance to share a photo shows weakness and vulnerability, which actually gives you an advantage and leverage if you think about it. A person with malicious intentions will just send you a fake photo. \n\nI think SBs can get away with not showing their face if they show tasteful shots of body and/or face obscured by hair. I can get a general sense of a woman's attractiveness without seeing her face. At least, that's how I feel. I'm understanding and respect a woman who values her privacy. To me, it tells me she's real and feels vulnerable, just like I do. It's not a red flag.",
                    "author": "manlicksdog",
                    "id": "ewj9x73",
                    "parent_id": "t1_ewfnvmd",
                    "score": 1,
                    "created_utc": 1565463487.0,
                    "replies": [
                        {
                            "body": "It's a red flag for me and we can disagree. I'm doing fine and clearly so are you. This story is from six years ago and since I stopped going on dates with people with no photos, I've not only met better looking daddies but, more importantly haven't had any pushback at all, so I'm gonna keep doing it. Thanks though, for the advice, though I don't recall putting that particular tag on the post.",
                            "author": "SapioSugarBabe",
                            "id": "ewjc8ul",
                            "parent_id": "t1_ewj9x73",
                            "score": 1,
                            "created_utc": 1565464484.0,
                            "replies": [
                                {
                                    "body": "Well, it's true that different methods work for different people. We all have our different priorities...Wasn't really trying to give advice so much as add a different perspective.",
                                    "author": "manlicksdog",
                                    "id": "ewjn1g3",
                                    "parent_id": "t1_ewjc8ul",
                                    "score": 1,
                                    "created_utc": 1565469065.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "If they don't wanna send photos, then we can video chat, but I refuse to meet up without seeing someone's face, now, I don't care how important they claim to be or are, lol.",
            "author": "SapioSugarBabe",
            "id": "ew9kp1f",
            "parent_id": "t1_ew95cy9",
            "score": 2,
            "created_utc": 1565226862.0,
            "replies": [
                {
                    "body": "I think that’s the stance most ppl take. It makes sense.",
                    "author": "w-r",
                    "id": "ewc6bwk",
                    "parent_id": "t1_ew9kp1f",
                    "score": 1,
                    "created_utc": 1565278956.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "So how does someone “known” sending a pic in advance change anything from them when they meet in person? This always confuses me",
            "author": "SummerLuv111",
            "id": "ewe81l4",
            "parent_id": "t1_ew95cy9",
            "score": 1,
            "created_utc": 1565316749.0,
            "replies": [
                {
                    "body": "Because in person, you know who is seeing you. Nobody can forward or post or share the experience of spending time with someone. And isn’t that what this life is all about?",
                    "author": "w-r",
                    "id": "ewenw2h",
                    "parent_id": "t1_ewe81l4",
                    "score": 1,
                    "created_utc": 1565330432.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I was wondering how long it would take to someone to say I must've just been unattractive as if that's an excuse to freak someone out and make them feel unsafe.",
            "author": "SapioSugarBabe",
            "id": "ewc8l19",
            "parent_id": "t1_ewaxv99",
            "score": 2,
            "created_utc": 1565280230.0,
            "replies": []
        },
        {
            "body": "Tim is a gay man I've known since I was 14 who knows I not only love charity and people buying me things but also knew that I was a sugar baby, AND who I didn't tell I was coming until I was on the train there. Me and Steve didn't share any interests, in fact, we connected over our love of banter, not anything we particularly had in common, which is not rare for me as I'm fantastic at banter, lol. And Steve had a premium account on Seeking Arrangement and was verified so that would be quite a lot of work to just buy me dinner, AND to even know who I was from SA because I didn't have face pics then (only in my private photos which I shared halfway through the conversation). That would be a cute idea but it's not plausible at all given....every single other factor of our meeting, lol.",
            "author": "SapioSugarBabe",
            "id": "ew8hvcb",
            "parent_id": "t1_ew8h5lk",
            "score": 2,
            "created_utc": 1565209835.0,
            "replies": [
                {
                    "body": "Based on this response, I should probably take off my tin foil hat since I am so obviously wrong.  However, my tin foil hat is sexy af, so I'm keeping it on.\n#\nTo be clear, Tim is still a suspect. You told him on the train that you were coming to the bar, but if \"steve\" picked the bar, he already knew that. He also knew you were an sb, and could have just gotten a note from a friend of his, who is an active sd, that he saw your profile. If Tim could have just bought you dinner, no obvious reason for him to do this, so I agree you are right.",
                    "author": "TastySpermDispenser",
                    "id": "ew8j33c",
                    "parent_id": "t1_ew8hvcb",
                    "score": -2,
                    "created_utc": 1565210371.0,
                    "replies": [
                        {
                            "body": "I picked the bar because I knew Tim. I didn't tell Steve that I knew Tim or anyone at the bar because that defeats the purpose of using that as a safety measure lol.",
                            "author": "SapioSugarBabe",
                            "id": "ew8jenh",
                            "parent_id": "t1_ew8j33c",
                            "score": 5,
                            "created_utc": 1565210507.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Ya but it’s not about logic.. It doesn’t matter really because you reacted in the only sane way regardless of his intentions good, neutral or bad.",
            "author": "Op1yum",
            "id": "ew8yw06",
            "parent_id": "t1_ew8wvjx",
            "score": 7,
            "created_utc": 1565217139.0,
            "replies": []
        },
        {
            "body": "That is a good point. For a kink, he would want to somewhat set it up so it goes right.\nI don’t use restrooms often, so if it was me, when would he have paid? I’m sure he would have sent you money if he didn’t catch it in time anyways.",
            "author": "Tanlookinggal",
            "id": "ew8cfty",
            "parent_id": "t1_ew88tfo",
            "score": 5,
            "created_utc": 1565207493.0,
            "replies": []
        },
        {
            "body": "\n\nYOUR TIMING DOESN'T MAKE SENSE TO ME \n\nI'm interested to know how he knew that you would be in the lady's room long enough for him to get his things together (pay his bill?), walk to the bar, ask for your bar bill (including explaining to the bartender why he was attempting to pay it), actually get the cash out, pay the bill, say goodbye to the bartender, gather his things again, walk out of the bar, then walk away (far enough so that you would not be able to catch up with him, or know which direction he headed).    Any suggestions?",
            "author": "MasterAcct2020",
            "id": "ew9n9rx",
            "parent_id": "t1_ew88tfo",
            "score": 1,
            "created_utc": 1565228035.0,
            "replies": [
                {
                    "body": "At this bar, they leave your tab in a little glass in front of your spot, and according to Tim the bartender, he just left cash and didn't wait for his change, so it wouldn't have taken all that long. Also, the bathrooms were literally basically on the other side of the lobby so if he overheard me say I was going to the bathroom (which he obviously did), he knew I at the very least had to walk five minutes to get there and five minutes back.",
                    "author": "SapioSugarBabe",
                    "id": "ew9one9",
                    "parent_id": "t1_ew9n9rx",
                    "score": 4,
                    "created_utc": 1565228639.0,
                    "replies": [
                        {
                            "body": "👍",
                            "author": "MasterAcct2020",
                            "id": "ew9owmp",
                            "parent_id": "t1_ew9one9",
                            "score": 0,
                            "created_utc": 1565228761.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "That would be the only scary part to me. Like how close does he like to watch, what else is he trying to play out...",
            "author": "Tanlookinggal",
            "id": "ew8cknh",
            "parent_id": "t1_ew88ybs",
            "score": 9,
            "created_utc": 1565207549.0,
            "replies": []
        },
        {
            "body": "“How would I know he didn't follow me or something?”\n\nThat’s the part that would creep me out.  I once had a man approach me in the super market saying he saw me park and followed me in to ask me out.  Talk about stranger danger..  The hair on the back of my neck stood up.",
            "author": "RestartYourHeart",
            "id": "ew933p9",
            "parent_id": "t1_ew88ybs",
            "score": 6,
            "created_utc": 1565218900.0,
            "replies": []
        },
        {
            "body": "Damn boo that’s creepy af, I would be creeped out at the whole situation tbh with you.",
            "author": "Newlifemn",
            "id": "ew9pu51",
            "parent_id": "t1_ew88ybs",
            "score": 3,
            "created_utc": 1565229192.0,
            "replies": []
        },
        {
            "body": "Then find one",
            "author": "Academic_Set",
            "id": "ew869wh",
            "parent_id": "t1_ew863e9",
            "score": -8,
            "created_utc": 1565204143.0,
            "replies": [
                {
                    "body": "Lol, lemme go back in time and do that, lol? I'm not disputing about the need for ground rules, but I would go tell the SB that, not respond to a 6 year old story, lol.\n\nOr just DON'T do blind dates at all. Who wants to waste time, makeup, and Uber money just to potentially not wanna talk to a guy AND have to stand him up? Just share pics.",
                    "author": "SapioSugarBabe",
                    "id": "ew86d61",
                    "parent_id": "t1_ew869wh",
                    "score": 7,
                    "created_utc": 1565204195.0,
                    "replies": [
                        {
                            "body": "I was not speaking to your experience.  With enough vetting otherwise, a lot can be learned.",
                            "author": "Academic_Set",
                            "id": "ew86wyx",
                            "parent_id": "t1_ew86d61",
                            "score": -2,
                            "created_utc": 1565204516.0,
                            "replies": [
                                {
                                    "body": "Anyway, don't do blind dates, girls! Ever! At all!",
                                    "author": "SapioSugarBabe",
                                    "id": "ew871zs",
                                    "parent_id": "t1_ew86wyx",
                                    "score": 8,
                                    "created_utc": 1565204598.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I can imagine it was freaky! Especially after having a drink or two, than leaving?!? i'd be a little freaked out.\n\nbut idk, the mysteriousness is sexy affffff to me. hahaha.",
            "author": "KarmatheHusky",
            "id": "ew8ufgx",
            "parent_id": "t1_ew8qy8a",
            "score": 1,
            "created_utc": 1565215334.0,
            "replies": []
        },
        {
            "body": "Oh I don't disagree! And I wasn't clear that you knew Tim - that's totally different.\n\nAgreed people can be extremely weird. Reddit alone proves that!\n\n/S",
            "author": "SDRippington",
            "id": "ew8f408",
            "parent_id": "t1_ew8ewkl",
            "score": 2,
            "created_utc": 1565208629.0,
            "replies": []
        },
        {
            "body": "Orrrr that stranger was just being nice? That could be it, too. The simplest explanation is usually the correct one.",
            "author": "SDRippington",
            "id": "ew8f9vc",
            "parent_id": "t1_ew8ewkl",
            "score": 0,
            "created_utc": 1565208699.0,
            "replies": [
                {
                    "body": "Kinda odd for it to be a stranger and then IMMEDIATELY get a text from the guy I was waiting on (who I had not told I was getting a drink or a meal) telling me he hoped I enjoyed my meal.",
                    "author": "SapioSugarBabe",
                    "id": "ew8g1o7",
                    "parent_id": "t1_ew8f9vc",
                    "score": 3,
                    "created_utc": 1565209040.0,
                    "replies": [
                        {
                            "body": "Oooo okay - that just went over the creepy line. Creepy AF.\n\nI take back what I said. ICK!",
                            "author": "SDRippington",
                            "id": "ew8hdl5",
                            "parent_id": "t1_ew8g1o7",
                            "score": 3,
                            "created_utc": 1565209618.0,
                            "replies": []
                        },
                        {
                            "body": "Oh I just slowly re-read everything. OMFG yes - that was creepy.",
                            "author": "SDRippington",
                            "id": "ew8iimu",
                            "parent_id": "t1_ew8g1o7",
                            "score": 2,
                            "created_utc": 1565210119.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I still think you are looking at the situation backwards. What a photo provides is false sense of security. I can't tell you how many SBs tell me that they need a photo to show that I'm not an ax murderer, as if somehow you can tell an ax murder by looking at their face. The real reason I don't provide photos is because I'm cautious and rational about protecting my privacy. If anything, reluctance to share a photo shows weakness and vulnerability, which actually gives you an advantage and leverage if you think about it. A person with malicious intentions will just send you a fake photo. \n\nI think SBs can get away with not showing their face if they show tasteful shots of body and/or face obscured by hair. I can get a general sense of a woman's attractiveness without seeing her face. At least, that's how I feel. I'm understanding and respect a woman who values her privacy. To me, it tells me she's real and feels vulnerable, just like I do. It's not a red flag.",
            "author": "manlicksdog",
            "id": "ewj9x73",
            "parent_id": "t1_ewfnvmd",
            "score": 1,
            "created_utc": 1565463487.0,
            "replies": [
                {
                    "body": "It's a red flag for me and we can disagree. I'm doing fine and clearly so are you. This story is from six years ago and since I stopped going on dates with people with no photos, I've not only met better looking daddies but, more importantly haven't had any pushback at all, so I'm gonna keep doing it. Thanks though, for the advice, though I don't recall putting that particular tag on the post.",
                    "author": "SapioSugarBabe",
                    "id": "ewjc8ul",
                    "parent_id": "t1_ewj9x73",
                    "score": 1,
                    "created_utc": 1565464484.0,
                    "replies": [
                        {
                            "body": "Well, it's true that different methods work for different people. We all have our different priorities...Wasn't really trying to give advice so much as add a different perspective.",
                            "author": "manlicksdog",
                            "id": "ewjn1g3",
                            "parent_id": "t1_ewjc8ul",
                            "score": 1,
                            "created_utc": 1565469065.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I think that’s the stance most ppl take. It makes sense.",
            "author": "w-r",
            "id": "ewc6bwk",
            "parent_id": "t1_ew9kp1f",
            "score": 1,
            "created_utc": 1565278956.0,
            "replies": []
        },
        {
            "body": "Because in person, you know who is seeing you. Nobody can forward or post or share the experience of spending time with someone. And isn’t that what this life is all about?",
            "author": "w-r",
            "id": "ewenw2h",
            "parent_id": "t1_ewe81l4",
            "score": 1,
            "created_utc": 1565330432.0,
            "replies": []
        },
        {
            "body": "Based on this response, I should probably take off my tin foil hat since I am so obviously wrong.  However, my tin foil hat is sexy af, so I'm keeping it on.\n#\nTo be clear, Tim is still a suspect. You told him on the train that you were coming to the bar, but if \"steve\" picked the bar, he already knew that. He also knew you were an sb, and could have just gotten a note from a friend of his, who is an active sd, that he saw your profile. If Tim could have just bought you dinner, no obvious reason for him to do this, so I agree you are right.",
            "author": "TastySpermDispenser",
            "id": "ew8j33c",
            "parent_id": "t1_ew8hvcb",
            "score": -2,
            "created_utc": 1565210371.0,
            "replies": [
                {
                    "body": "I picked the bar because I knew Tim. I didn't tell Steve that I knew Tim or anyone at the bar because that defeats the purpose of using that as a safety measure lol.",
                    "author": "SapioSugarBabe",
                    "id": "ew8jenh",
                    "parent_id": "t1_ew8j33c",
                    "score": 5,
                    "created_utc": 1565210507.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "At this bar, they leave your tab in a little glass in front of your spot, and according to Tim the bartender, he just left cash and didn't wait for his change, so it wouldn't have taken all that long. Also, the bathrooms were literally basically on the other side of the lobby so if he overheard me say I was going to the bathroom (which he obviously did), he knew I at the very least had to walk five minutes to get there and five minutes back.",
            "author": "SapioSugarBabe",
            "id": "ew9one9",
            "parent_id": "t1_ew9n9rx",
            "score": 4,
            "created_utc": 1565228639.0,
            "replies": [
                {
                    "body": "👍",
                    "author": "MasterAcct2020",
                    "id": "ew9owmp",
                    "parent_id": "t1_ew9one9",
                    "score": 0,
                    "created_utc": 1565228761.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Lol, lemme go back in time and do that, lol? I'm not disputing about the need for ground rules, but I would go tell the SB that, not respond to a 6 year old story, lol.\n\nOr just DON'T do blind dates at all. Who wants to waste time, makeup, and Uber money just to potentially not wanna talk to a guy AND have to stand him up? Just share pics.",
            "author": "SapioSugarBabe",
            "id": "ew86d61",
            "parent_id": "t1_ew869wh",
            "score": 7,
            "created_utc": 1565204195.0,
            "replies": [
                {
                    "body": "I was not speaking to your experience.  With enough vetting otherwise, a lot can be learned.",
                    "author": "Academic_Set",
                    "id": "ew86wyx",
                    "parent_id": "t1_ew86d61",
                    "score": -2,
                    "created_utc": 1565204516.0,
                    "replies": [
                        {
                            "body": "Anyway, don't do blind dates, girls! Ever! At all!",
                            "author": "SapioSugarBabe",
                            "id": "ew871zs",
                            "parent_id": "t1_ew86wyx",
                            "score": 8,
                            "created_utc": 1565204598.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Kinda odd for it to be a stranger and then IMMEDIATELY get a text from the guy I was waiting on (who I had not told I was getting a drink or a meal) telling me he hoped I enjoyed my meal.",
            "author": "SapioSugarBabe",
            "id": "ew8g1o7",
            "parent_id": "t1_ew8f9vc",
            "score": 3,
            "created_utc": 1565209040.0,
            "replies": [
                {
                    "body": "Oooo okay - that just went over the creepy line. Creepy AF.\n\nI take back what I said. ICK!",
                    "author": "SDRippington",
                    "id": "ew8hdl5",
                    "parent_id": "t1_ew8g1o7",
                    "score": 3,
                    "created_utc": 1565209618.0,
                    "replies": []
                },
                {
                    "body": "Oh I just slowly re-read everything. OMFG yes - that was creepy.",
                    "author": "SDRippington",
                    "id": "ew8iimu",
                    "parent_id": "t1_ew8g1o7",
                    "score": 2,
                    "created_utc": 1565210119.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "It's a red flag for me and we can disagree. I'm doing fine and clearly so are you. This story is from six years ago and since I stopped going on dates with people with no photos, I've not only met better looking daddies but, more importantly haven't had any pushback at all, so I'm gonna keep doing it. Thanks though, for the advice, though I don't recall putting that particular tag on the post.",
            "author": "SapioSugarBabe",
            "id": "ewjc8ul",
            "parent_id": "t1_ewj9x73",
            "score": 1,
            "created_utc": 1565464484.0,
            "replies": [
                {
                    "body": "Well, it's true that different methods work for different people. We all have our different priorities...Wasn't really trying to give advice so much as add a different perspective.",
                    "author": "manlicksdog",
                    "id": "ewjn1g3",
                    "parent_id": "t1_ewjc8ul",
                    "score": 1,
                    "created_utc": 1565469065.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I picked the bar because I knew Tim. I didn't tell Steve that I knew Tim or anyone at the bar because that defeats the purpose of using that as a safety measure lol.",
            "author": "SapioSugarBabe",
            "id": "ew8jenh",
            "parent_id": "t1_ew8j33c",
            "score": 5,
            "created_utc": 1565210507.0,
            "replies": []
        },
        {
            "body": "👍",
            "author": "MasterAcct2020",
            "id": "ew9owmp",
            "parent_id": "t1_ew9one9",
            "score": 0,
            "created_utc": 1565228761.0,
            "replies": []
        },
        {
            "body": "I was not speaking to your experience.  With enough vetting otherwise, a lot can be learned.",
            "author": "Academic_Set",
            "id": "ew86wyx",
            "parent_id": "t1_ew86d61",
            "score": -2,
            "created_utc": 1565204516.0,
            "replies": [
                {
                    "body": "Anyway, don't do blind dates, girls! Ever! At all!",
                    "author": "SapioSugarBabe",
                    "id": "ew871zs",
                    "parent_id": "t1_ew86wyx",
                    "score": 8,
                    "created_utc": 1565204598.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Oooo okay - that just went over the creepy line. Creepy AF.\n\nI take back what I said. ICK!",
            "author": "SDRippington",
            "id": "ew8hdl5",
            "parent_id": "t1_ew8g1o7",
            "score": 3,
            "created_utc": 1565209618.0,
            "replies": []
        },
        {
            "body": "Oh I just slowly re-read everything. OMFG yes - that was creepy.",
            "author": "SDRippington",
            "id": "ew8iimu",
            "parent_id": "t1_ew8g1o7",
            "score": 2,
            "created_utc": 1565210119.0,
            "replies": []
        },
        {
            "body": "Well, it's true that different methods work for different people. We all have our different priorities...Wasn't really trying to give advice so much as add a different perspective.",
            "author": "manlicksdog",
            "id": "ewjn1g3",
            "parent_id": "t1_ewjc8ul",
            "score": 1,
            "created_utc": 1565469065.0,
            "replies": []
        },
        {
            "body": "Anyway, don't do blind dates, girls! Ever! At all!",
            "author": "SapioSugarBabe",
            "id": "ew871zs",
            "parent_id": "t1_ew86wyx",
            "score": 8,
            "created_utc": 1565204598.0,
            "replies": []
        }
    ]
}