{
    "title": "he might as well have said this",
    "post_id": "p8rm92",
    "post_url": "https://www.reddit.com/r/dankruto/comments/p8rm92/he_might_as_well_have_said_this/",
    "author": "rogue---ninja",
    "body": "",
    "url": "https://i.redd.it/b0jikoacspi71.png",
    "score": 5357,
    "upvote_ratio": 0.99,
    "created_utc": 1629553112.0,
    "num_comments": 73,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "Sakura: \"I'm pregnant.\"\n\nSasuke: \"What a coincidence I must leave the village for scouting.\"",
            "author": "itsnunyabusiness",
            "id": "h9tac7t",
            "parent_id": "t3_p8rm92",
            "score": 211,
            "created_utc": 1629568461.0,
            "replies": [
                {
                    "body": "\"I also have a dentist appointment at the hidden cloud village\"",
                    "author": "ZandatsuDragon",
                    "id": "h9ub90g",
                    "parent_id": "t1_h9tac7t",
                    "score": 67,
                    "created_utc": 1629585605.0,
                    "replies": [
                        {
                            "body": "“That’s crazy… I have a milk delivery in the hidden stone village”",
                            "author": "wutizgoinoneverybudy",
                            "id": "h9vr195",
                            "parent_id": "t1_h9ub90g",
                            "score": 32,
                            "created_utc": 1629613473.0,
                            "replies": [
                                {
                                    "body": "\"Fuck..Naruto wants me to get another frog wallet for him at the hidden mist village\"",
                                    "author": "ZandatsuDragon",
                                    "id": "h9w5uox",
                                    "parent_id": "t1_h9vr195",
                                    "score": 15,
                                    "created_utc": 1629625959.0,
                                    "replies": [
                                        {
                                            "body": "Naruto and I need to go on a mission... it's very important probably will take a few years idc if you're Hokage you're coming with me Naruto",
                                            "author": "Jaron5_55",
                                            "id": "hcjqw3a",
                                            "parent_id": "t1_h9w5uox",
                                            "score": 2,
                                            "created_utc": 1631443161.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Sasuke: \"Why do you think I'm leaving?  I can see that little speck of weird chakra in you.\"",
                    "author": "NotAStupidRedneck",
                    "id": "h9yt1yy",
                    "parent_id": "t1_h9tac7t",
                    "score": 3,
                    "created_utc": 1629673417.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "He came back, screwed Sakura, and left again what a great dad.",
            "author": "ArtisticGround4678",
            "id": "h9sggkr",
            "parent_id": "t3_p8rm92",
            "score": 470,
            "created_utc": 1629554828.0,
            "replies": [
                {
                    "body": "Given that he pretty much felt nothing for Sakura throughout the whole series, I would say it's more likely Sakura forced herself on him somehow.",
                    "author": "UnoLaLaLa",
                    "id": "h9sn87q",
                    "parent_id": "t1_h9sggkr",
                    "score": 237,
                    "created_utc": 1629558038.0,
                    "replies": [
                        {
                            "body": "There are 2 light novels (Sakura Hide and Sasuke Shinden) that develop their relationship after the war. They're even illustrated by Kishi and are both canon. \n\nI don't want to spoil anything, there's plenty of action, it's not just a love story but the emotional aspects are really well written, it shows that even in OG Naruto Sasuke was half in love with Sakura when he left the village and all sorts of things.. \n\nWhat sucks is that they should have animated those, the action and fights are really good. They also cover Sakura and Sasuke's mission in search of a cure for Naruto's chakra illness. \nAnyway there's no surprise that 90% of the community views their relationship as forced, it was never shown outside the novels.",
                            "author": "CamillionMilk",
                            "id": "h9ssvwu",
                            "parent_id": "t1_h9sn87q",
                            "score": 176,
                            "created_utc": 1629560635.0,
                            "replies": [
                                {
                                    "body": "i've read the novels. the sakura hiden one is quite good and definitely deserved to be animated.but none of those novels cover anything substantial in regards to their \"relationship development\". sakura hiden just shows sakura's POV on certain events which we didnt need bc we know how her love for sasuke is unconditional. and sasuke shinden doesnt mention sakura ANYWHERE let alone how he was \"half in love with sakura\" during part 1 naruto , sakura is only brought up at the last when he sees sakura . \n\nalso as far as i remember one of the OTHER novels state that he was only started to like her romantically after he left for his redemption journey so either one of them is correct or both novels are contradicting themselves which is a good reason to leave it up to the individual fans to decide which aspects of the novels canon \r  \n\r  \nno offence but if you have to rely on novels to show \"relationship development\" then its pointless since most fans of shonen anime fans dont read novels unless they are really hardcore fans.no other canon pairings in anime required novels to develop the relationship",
                                    "author": "rogue---ninja",
                                    "id": "h9sx6v0",
                                    "parent_id": "t1_h9ssvwu",
                                    "score": 90,
                                    "created_utc": 1629562574.0,
                                    "replies": [
                                        {
                                            "body": "That's exactly what I said, it's a shame and also understandable that the fan base mostly dislikes their relationship because it isn't shown to them. Most fans are anime-only, I doubt that even all manga fans have picked up the novels either. \n\nI found out about those novels through a YouTube channel (Naruto Explained) and the dude there goes in a deep dive over the relationship of the two. And I remember the youtube guy going over Sasuke's inner thoughts, his fears, what he thinks of his wife etc, and it was clear he loved and cared for Sakura, he even made her a wedding ring on one of their missions.\n\nI forgot about the other two novels, one was about Kakashi? I'm not sure what's going on there, I'll have to read and see.",
                                            "author": "CamillionMilk",
                                            "id": "h9t0l0w",
                                            "parent_id": "t1_h9sx6v0",
                                            "score": 27,
                                            "created_utc": 1629564092.0,
                                            "replies": [
                                                {
                                                    "body": ">  it's a shame and also understandable that the fan base mostly dislikes their relationship  \n\nNah, SasuSaku was a popular ship in Japan. I don't think it would be canon if Kishimoto's *native audience* didn't somewhat like it. \n\nWesterners typically don't like it because both Sakura and Sasuke are hated here so it makes sense.",
                                                    "author": null,
                                                    "id": "h9t0y21",
                                                    "parent_id": "t1_h9t0l0w",
                                                    "score": 25,
                                                    "created_utc": 1629564251.0,
                                                    "replies": [
                                                        {
                                                            "body": "IDK if I'd say Sasuke is hated exactly. He certainly gets meme'd on, but that's lovingly- I think.",
                                                            "author": "CheshireTsunami",
                                                            "id": "h9tfyi3",
                                                            "parent_id": "t1_h9t0y21",
                                                            "score": 17,
                                                            "created_utc": 1629571003.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Sakura's definitely hated in general while Sasuke is more of a base breaker. it's kinda rare to see people who like both Naruto & Sasuke equally as characters.",
                                                                    "author": null,
                                                                    "id": "h9tlwts",
                                                                    "parent_id": "t1_h9tfyi3",
                                                                    "score": 12,
                                                                    "created_utc": 1629573769.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "I love both their characters",
                                                                            "author": "Jaron5_55",
                                                                            "id": "hcjr20t",
                                                                            "parent_id": "t1_h9tlwts",
                                                                            "score": 1,
                                                                            "created_utc": 1631443296.0,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "body": "Sadly he is. At least on some platforms, people say he's dumb for making the decisions he made as a traumatized child with way too much responsibility who got his life fucked completely by his brother, who on the other hand is loved and praised as if he was the messiah.\n\nI like itachi but holy fuck you can't call this man a hero",
                                                                    "author": "HisOnlyFriend",
                                                                    "id": "h9tzdw0",
                                                                    "parent_id": "t1_h9tfyi3",
                                                                    "score": 9,
                                                                    "created_utc": 1629580001.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "I don't think it is unique to Sasuke.\n\nI think people want characters with messed up backstories who act \"cool\" because lets be honest, trauma isn't pretty. \n\nI often see Katara from ATLA get hated on for \"whining\" about her life and acting like her pain is worse (which I don't even remember?)",
                                                                            "author": null,
                                                                            "id": "h9u4y1l",
                                                                            "parent_id": "t1_h9tzdw0",
                                                                            "score": 5,
                                                                            "created_utc": 1629582592.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "Yeah I get that but people complaining about him being 'emo for no reason' after what he went through kinda bothers me",
                                                                                    "author": "HisOnlyFriend",
                                                                                    "id": "h9u7uo4",
                                                                                    "parent_id": "t1_h9u4y1l",
                                                                                    "score": 2,
                                                                                    "created_utc": 1629583970.0,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "body": "Ehh I was understanding of sasuke until he found out about itachi and still had to have sense knocked into him",
                                                                    "author": "miojunki",
                                                                    "id": "h9tm41h",
                                                                    "parent_id": "t1_h9tfyi3",
                                                                    "score": 4,
                                                                    "created_utc": 1629573864.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "Bruh some ppl rly can't even try to insert themselves in someones situation huh?",
                                                                            "author": "HisOnlyFriend",
                                                                            "id": "h9tz00i",
                                                                            "parent_id": "t1_h9tm41h",
                                                                            "score": 1,
                                                                            "created_utc": 1629579823.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "Seriously, how can people not relate to the feeling of \"because the government forced my brother to do fucked up things i am gonna massacre an entire village full of innocent people that had nothing to do with what happened\"?",
                                                                                    "author": "Spoopanator",
                                                                                    "id": "h9urn03",
                                                                                    "parent_id": "t1_h9tz00i",
                                                                                    "score": 7,
                                                                                    "created_utc": 1629593730.0,
                                                                                    "replies": [
                                                                                        {
                                                                                            "body": "Not like he was only going to kill the elders or anything, but sure",
                                                                                            "author": "HisOnlyFriend",
                                                                                            "id": "h9urrm5",
                                                                                            "parent_id": "t1_h9urn03",
                                                                                            "score": -1,
                                                                                            "created_utc": 1629593793.0,
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "I really want those novels animated as well as gaara hiden",
                                    "author": "tjd317",
                                    "id": "h9tia4a",
                                    "parent_id": "t1_h9ssvwu",
                                    "score": 5,
                                    "created_utc": 1629572071.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "It's much more likely Sasuke married Sakura out of penance. Maybe he grew to love her but who knows.",
                            "author": "sonfoa",
                            "id": "h9so53t",
                            "parent_id": "t1_h9sn87q",
                            "score": 61,
                            "created_utc": 1629558464.0,
                            "replies": [
                                {
                                    "body": "It has nothing to do with \"penance\" or force. Just bad writing. \n\nKishimoto was also projecting his own issues onto his characters from what I heard on Naruto Forums. Apparently he didn't even have his honeymoon until Naruto ended, and would sometimes go long periods of time without seeing his own children. \n\nBut, the key difference between Kishimoto and his characters is that his characters have the power to not neglect their children",
                                    "author": null,
                                    "id": "h9sp1i1",
                                    "parent_id": "t1_h9so53t",
                                    "score": 87,
                                    "created_utc": 1629558886.0,
                                    "replies": [
                                        {
                                            "body": "More couples = more new gen kids",
                                            "author": "MakimaMyBeloved",
                                            "id": "h9ss8ls",
                                            "parent_id": "t1_h9sp1i1",
                                            "score": 32,
                                            "created_utc": 1629560345.0,
                                            "replies": [
                                                {
                                                    "body": "That’s why Kishimoto will kill off all the side characters at the end of Boruto that he doesn’t have to make a third generation. “The age of shinobi has came to an end.”",
                                                    "author": "Ancient_A",
                                                    "id": "h9t3cpw",
                                                    "parent_id": "t1_h9ss8ls",
                                                    "score": 18,
                                                    "created_utc": 1629565320.0,
                                                    "replies": [
                                                        {
                                                            "body": "Foot sweat and period blood",
                                                            "author": "The_Uncommon_Aura",
                                                            "id": "h9t5dug",
                                                            "parent_id": "t1_h9t3cpw",
                                                            "score": 1,
                                                            "created_utc": 1629566234.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "body": "I know it's bad writing. I'm just trying to think of an in-universe explanation as to why Sasuke would marry her.",
                                            "author": "sonfoa",
                                            "id": "h9ss8ts",
                                            "parent_id": "t1_h9sp1i1",
                                            "score": 27,
                                            "created_utc": 1629560348.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "[deleted]",
                                            "author": null,
                                            "id": "h9srff4",
                                            "parent_id": "t1_h9sp1i1",
                                            "score": -5,
                                            "created_utc": 1629559982.0,
                                            "replies": [
                                                {
                                                    "body": "Yes, Kishimoto does nothave the ability to make shadow clones or teleport to them. \n\nMangka are lowkey treated like slaves, just look up his schedule",
                                                    "author": null,
                                                    "id": "h9srtpd",
                                                    "parent_id": "t1_h9srff4",
                                                    "score": 33,
                                                    "created_utc": 1629560157.0,
                                                    "replies": [
                                                        {
                                                            "body": "To be fair, Kishimoto is more than wealthy enough to have retired earlier and spend time with his kids if he wanted to.",
                                                            "author": "metal079",
                                                            "id": "h9thohd",
                                                            "parent_id": "t1_h9srtpd",
                                                            "score": 2,
                                                            "created_utc": 1629571794.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "that’s blatantly false. he thinks of Team 7 multiple times throughout OG Naruto up to him going rouge and in Shippuden",
                            "author": "ReallyUneducated",
                            "id": "h9uicug",
                            "parent_id": "t1_h9sn87q",
                            "score": 2,
                            "created_utc": 1629589123.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "At least he didn't say he was going out to buy cigarettes",
                    "author": "heyyassbutt",
                    "id": "h9ufnhz",
                    "parent_id": "t1_h9sggkr",
                    "score": 4,
                    "created_utc": 1629587793.0,
                    "replies": [
                        {
                            "body": "Well that’s a better story to tell the poor girl",
                            "author": "ArtisticGround4678",
                            "id": "h9ufpbm",
                            "parent_id": "t1_h9ufnhz",
                            "score": 2,
                            "created_utc": 1629587818.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "chad sasuke",
                    "author": "MrLunaticest",
                    "id": "h9t97ge",
                    "parent_id": "t1_h9sggkr",
                    "score": 0,
                    "created_utc": 1629567958.0,
                    "replies": []
                },
                {
                    "body": "That chad, right there!!",
                    "author": "white_fang02",
                    "id": "h9t893k",
                    "parent_id": "t1_h9sggkr",
                    "score": 0,
                    "created_utc": 1629567529.0,
                    "replies": []
                },
                {
                    "body": "yeah...sorry.",
                    "author": null,
                    "id": "h9t73ow",
                    "parent_id": "t1_h9sggkr",
                    "score": 1,
                    "created_utc": 1629567011.0,
                    "replies": [
                        {
                            "body": "Orochimaru is a chad for never regretting his actions \"yes, i want to be immortal, yes i experimented on children, 10/10 would do again\"",
                            "author": null,
                            "id": "h9t846x",
                            "parent_id": "t1_h9t73ow",
                            "score": 14,
                            "created_utc": 1629567467.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "*impregnates sakura*,\n*leaves the village*,\n*comes back and visits the hokage’s office every week without giving a shit for sakura and sarada*",
            "author": "depressed_duck_1015",
            "id": "h9sqxm9",
            "parent_id": "t3_p8rm92",
            "score": 243,
            "created_utc": 1629559758.0,
            "replies": [
                {
                    "body": "#Sigma Grindset",
                    "author": "aryansant",
                    "id": "h9stv3q",
                    "parent_id": "t1_h9sqxm9",
                    "score": 147,
                    "created_utc": 1629561074.0,
                    "replies": []
                },
                {
                    "body": "Sakura's probably his beard.",
                    "author": null,
                    "id": "h9t9udw",
                    "parent_id": "t1_h9sqxm9",
                    "score": 33,
                    "created_utc": 1629568242.0,
                    "replies": [
                        {
                            "body": "It's not very convincing at this point.",
                            "author": "bhavbhav",
                            "id": "h9tt9x5",
                            "parent_id": "t1_h9t9udw",
                            "score": 10,
                            "created_utc": 1629577185.0,
                            "replies": [
                                {
                                    "body": "Whaa? Tbh, its the only explanation for him being gonw but keeping in touch with Nart",
                                    "author": null,
                                    "id": "h9tuf9a",
                                    "parent_id": "t1_h9tt9x5",
                                    "score": 3,
                                    "created_utc": 1629577712.0,
                                    "replies": [
                                        {
                                            "body": "No, I meant his beard is not convincing, lol. 😂 I feel like it's at least a little sus that he communicates with Naruto far more than he does with his own wife.",
                                            "author": "bhavbhav",
                                            "id": "h9tusbk",
                                            "parent_id": "t1_h9tuf9a",
                                            "score": 14,
                                            "created_utc": 1629577877.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "bros before hoes",
                    "author": "SexWithFischl69",
                    "id": "h9tcouv",
                    "parent_id": "t1_h9sqxm9",
                    "score": 21,
                    "created_utc": 1629569513.0,
                    "replies": []
                },
                {
                    "body": "I know it’s a complicated relationship, but seriously, for the first whatever years of Sarada’s life, it seems Sauske just used Sakura as a booty call until Sarada was old enough to kill people",
                    "author": "The84thWolf",
                    "id": "h9upqfq",
                    "parent_id": "t1_h9sqxm9",
                    "score": 10,
                    "created_utc": 1629592783.0,
                    "replies": []
                },
                {
                    "body": "I mean he was with Sakura when she was giving birth",
                    "author": "KingDanner",
                    "id": "h9uq98d",
                    "parent_id": "t1_h9sqxm9",
                    "score": 2,
                    "created_utc": 1629593045.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "They never even had sex. Sasuke just used his rinnegan to teleport sperm inside her womb.",
            "author": null,
            "id": "h9szb0p",
            "parent_id": "t3_p8rm92",
            "score": 147,
            "created_utc": 1629563523.0,
            "replies": [
                {
                    "body": "\"I don't want to touch you\"",
                    "author": null,
                    "id": "h9uhjqd",
                    "parent_id": "t1_h9szb0p",
                    "score": 39,
                    "created_utc": 1629588725.0,
                    "replies": []
                },
                {
                    "body": "This is actually seems like it makes sense",
                    "author": "kwazi1618",
                    "id": "h9w5iav",
                    "parent_id": "t1_h9szb0p",
                    "score": 5,
                    "created_utc": 1629625653.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Hella single mom energy",
            "author": "Rindair0",
            "id": "h9smj84",
            "parent_id": "t3_p8rm92",
            "score": 33,
            "created_utc": 1629557712.0,
            "replies": []
        },
        {
            "body": "Man Kishimoto really hates Sakura.",
            "author": "sonfoa",
            "id": "h9socgi",
            "parent_id": "t3_p8rm92",
            "score": 91,
            "created_utc": 1629558559.0,
            "replies": [
                {
                    "body": "If you're interested in a well written light novel that follows Sasuke and Sakura's journey as ninja, a couple and a team, I recommend the Sasuke Shinden and the Sakura Hiden. They're both canon, not written by Kishimoto but illustrated by him, so there's a good amount of \"expressed emotions\" in them.",
                    "author": "CamillionMilk",
                    "id": "h9ste4z",
                    "parent_id": "t1_h9socgi",
                    "score": 39,
                    "created_utc": 1629560862.0,
                    "replies": [
                        {
                            "body": "I really want to read the novels. Especially the Itachi one.",
                            "author": "Ancient_A",
                            "id": "h9t3hvo",
                            "parent_id": "t1_h9ste4z",
                            "score": 12,
                            "created_utc": 1629565385.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "According to kishimoto he's happy with her character and  actually based her off his wife. He's just bad at writing teenage girls",
                    "author": "WindyCityAssasin2",
                    "id": "h9vpui7",
                    "parent_id": "t1_h9socgi",
                    "score": 4,
                    "created_utc": 1629612600.0,
                    "replies": []
                },
                {
                    "body": "Me too",
                    "author": "mltblt_",
                    "id": "h9srk71",
                    "parent_id": "t1_h9socgi",
                    "score": 6,
                    "created_utc": 1629560041.0,
                    "replies": []
                },
                {
                    "body": "Who doesn’t lol",
                    "author": "masterhal123",
                    "id": "h9svzp8",
                    "parent_id": "t1_h9socgi",
                    "score": 0,
                    "created_utc": 1629562031.0,
                    "replies": []
                },
                {
                    "body": "Don’t we all?",
                    "author": null,
                    "id": "h9tj52n",
                    "parent_id": "t1_h9socgi",
                    "score": -3,
                    "created_utc": 1629572476.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[removed]",
            "author": null,
            "id": "h9tcx3y",
            "parent_id": "t3_p8rm92",
            "score": 14,
            "created_utc": 1629569616.0,
            "replies": [
                {
                    "body": "Hit and dip",
                    "author": "ZandatsuDragon",
                    "id": "h9ubavt",
                    "parent_id": "t1_h9tcx3y",
                    "score": 7,
                    "created_utc": 1629585630.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Someone was challenged to make a love story worse than twilight and they succeeded.",
            "author": "nizzy2k11",
            "id": "h9v4psd",
            "parent_id": "t3_p8rm92",
            "score": 13,
            "created_utc": 1629600164.0,
            "replies": []
        },
        {
            "body": "What a great way to end Sakura’s disappointing character arc.",
            "author": "TheGhost-of-Bob-Ross",
            "id": "h9u5yrh",
            "parent_id": "t3_p8rm92",
            "score": 9,
            "created_utc": 1629583072.0,
            "replies": []
        },
        {
            "body": "\"How romantic!\"- Garbage can with pink hair",
            "author": "Money_Enthusiast_",
            "id": "h9snv1t",
            "parent_id": "t3_p8rm92",
            "score": 26,
            "created_utc": 1629558332.0,
            "replies": [
                {
                    "body": "lol",
                    "author": "masterhal123",
                    "id": "h9sw3oo",
                    "parent_id": "t1_h9snv1t",
                    "score": 0,
                    "created_utc": 1629562080.0,
                    "replies": []
                },
                {
                    "body": "Facts",
                    "author": null,
                    "id": "h9tj64j",
                    "parent_id": "t1_h9snv1t",
                    "score": -2,
                    "created_utc": 1629572489.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "It was implied",
            "author": "AntMan526",
            "id": "h9vjjev",
            "parent_id": "t3_p8rm92",
            "score": 2,
            "created_utc": 1629608303.0,
            "replies": []
        },
        {
            "body": "Even I’m baffled at why he chose to do this, and I actually ship it. Sasuke seriously couldn’t spare at least one visit to his daughter in 12 years?",
            "author": null,
            "id": "h9vucaj",
            "parent_id": "t3_p8rm92",
            "score": 2,
            "created_utc": 1629616024.0,
            "replies": []
        },
        {
            "body": "u/repostsleuthbot",
            "author": "Krish220307",
            "id": "h9tm08q",
            "parent_id": "t3_p8rm92",
            "score": 1,
            "created_utc": 1629573814.0,
            "replies": [
                {
                    "body": "Looks like a repost. I've seen this image 1 time.\n\nFirst seen [Here](https://www.youtube.com/watch?v=dQw4w9WgXcQ) on 2021-08-19 92.76% match.\n\n**Searched Images**: 236,568,933 | **Indexed Posts**: 124,541,320 | **Search Time**: 7.97142s\n\n*Feedback? Hate? Visit [r/repostsleuthbot](https://www.youtube.com/watch?v=6n3pFFPSlW4) - I'm not perfect, but you can help. Report [ [False Positive](https://www.youtube.com/watch?v=d1YBv2mWll0) ]*",
                    "author": "Not_RepostSleuthBot",
                    "id": "h9tm14g",
                    "parent_id": "t1_h9tm08q",
                    "score": 5,
                    "created_utc": 1629573825.0,
                    "replies": []
                },
                {
                    "body": "I didn't find any posts that meet the matching requirements for r/dankruto.\n\nIt might be OC, it might not. Things such as JPEG artifacts and cropping may impact the results.\n\nI did find [this post](https://redd.it/7xiaqg) that is 81.25% similar.  It might be a match but I cannot be certain.\n\n*I'm not perfect, but you can help. Report [ [False Negative](https://www.reddit.com/message/compose/?to=RepostSleuthBot&subject=False%20Negative&message={\"post_id\": \"p8rm92\", \"meme_template\": null}) ]*\n\n[View Search On repostsleuth.com](https://www.repostsleuth.com?postId=p8rm92&sameSub=false&filterOnlyOlder=true&memeFilter=true&filterDeadMatches=false&targetImageMatch=85&targetImageMemeMatch=85)\n\n---\n\n**Scope:** Reddit | **Meme Filter:** False | **Target:** 85% | **Check Title:** False | **Max Age:** Unlimited | **Searched Images:** 239,843,416 | **Search Time:** 0.32892s",
                    "author": "RepostSleuthBot",
                    "id": "h9ub8oc",
                    "parent_id": "t1_h9tm08q",
                    "score": 1,
                    "created_utc": 1629585601.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "😂😂😂😂😂😂😂😂😂😂😂😂🗿😂😂😂😂😂😂😂😂😂😂😂",
            "author": "bruh9000Powerlevel",
            "id": "h9uf4q5",
            "parent_id": "t3_p8rm92",
            "score": 0,
            "created_utc": 1629587533.0,
            "replies": []
        },
        {
            "body": "Oh my god this is amazing",
            "author": "alejandrodeconcord",
            "id": "h9twtj4",
            "parent_id": "t3_p8rm92",
            "score": -3,
            "created_utc": 1629578816.0,
            "replies": []
        },
        {
            "body": "In my opinion she got what came to her he didn't really care she just forced him to look he way",
            "author": null,
            "id": "h9w0vxw",
            "parent_id": "t3_p8rm92",
            "score": 0,
            "created_utc": 1629621506.0,
            "replies": []
        },
        {
            "body": "\"I also have a dentist appointment at the hidden cloud village\"",
            "author": "ZandatsuDragon",
            "id": "h9ub90g",
            "parent_id": "t1_h9tac7t",
            "score": 67,
            "created_utc": 1629585605.0,
            "replies": [
                {
                    "body": "“That’s crazy… I have a milk delivery in the hidden stone village”",
                    "author": "wutizgoinoneverybudy",
                    "id": "h9vr195",
                    "parent_id": "t1_h9ub90g",
                    "score": 32,
                    "created_utc": 1629613473.0,
                    "replies": [
                        {
                            "body": "\"Fuck..Naruto wants me to get another frog wallet for him at the hidden mist village\"",
                            "author": "ZandatsuDragon",
                            "id": "h9w5uox",
                            "parent_id": "t1_h9vr195",
                            "score": 15,
                            "created_utc": 1629625959.0,
                            "replies": [
                                {
                                    "body": "Naruto and I need to go on a mission... it's very important probably will take a few years idc if you're Hokage you're coming with me Naruto",
                                    "author": "Jaron5_55",
                                    "id": "hcjqw3a",
                                    "parent_id": "t1_h9w5uox",
                                    "score": 2,
                                    "created_utc": 1631443161.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Sasuke: \"Why do you think I'm leaving?  I can see that little speck of weird chakra in you.\"",
            "author": "NotAStupidRedneck",
            "id": "h9yt1yy",
            "parent_id": "t1_h9tac7t",
            "score": 3,
            "created_utc": 1629673417.0,
            "replies": []
        },
        {
            "body": "Given that he pretty much felt nothing for Sakura throughout the whole series, I would say it's more likely Sakura forced herself on him somehow.",
            "author": "UnoLaLaLa",
            "id": "h9sn87q",
            "parent_id": "t1_h9sggkr",
            "score": 237,
            "created_utc": 1629558038.0,
            "replies": [
                {
                    "body": "There are 2 light novels (Sakura Hide and Sasuke Shinden) that develop their relationship after the war. They're even illustrated by Kishi and are both canon. \n\nI don't want to spoil anything, there's plenty of action, it's not just a love story but the emotional aspects are really well written, it shows that even in OG Naruto Sasuke was half in love with Sakura when he left the village and all sorts of things.. \n\nWhat sucks is that they should have animated those, the action and fights are really good. They also cover Sakura and Sasuke's mission in search of a cure for Naruto's chakra illness. \nAnyway there's no surprise that 90% of the community views their relationship as forced, it was never shown outside the novels.",
                    "author": "CamillionMilk",
                    "id": "h9ssvwu",
                    "parent_id": "t1_h9sn87q",
                    "score": 176,
                    "created_utc": 1629560635.0,
                    "replies": [
                        {
                            "body": "i've read the novels. the sakura hiden one is quite good and definitely deserved to be animated.but none of those novels cover anything substantial in regards to their \"relationship development\". sakura hiden just shows sakura's POV on certain events which we didnt need bc we know how her love for sasuke is unconditional. and sasuke shinden doesnt mention sakura ANYWHERE let alone how he was \"half in love with sakura\" during part 1 naruto , sakura is only brought up at the last when he sees sakura . \n\nalso as far as i remember one of the OTHER novels state that he was only started to like her romantically after he left for his redemption journey so either one of them is correct or both novels are contradicting themselves which is a good reason to leave it up to the individual fans to decide which aspects of the novels canon \r  \n\r  \nno offence but if you have to rely on novels to show \"relationship development\" then its pointless since most fans of shonen anime fans dont read novels unless they are really hardcore fans.no other canon pairings in anime required novels to develop the relationship",
                            "author": "rogue---ninja",
                            "id": "h9sx6v0",
                            "parent_id": "t1_h9ssvwu",
                            "score": 90,
                            "created_utc": 1629562574.0,
                            "replies": [
                                {
                                    "body": "That's exactly what I said, it's a shame and also understandable that the fan base mostly dislikes their relationship because it isn't shown to them. Most fans are anime-only, I doubt that even all manga fans have picked up the novels either. \n\nI found out about those novels through a YouTube channel (Naruto Explained) and the dude there goes in a deep dive over the relationship of the two. And I remember the youtube guy going over Sasuke's inner thoughts, his fears, what he thinks of his wife etc, and it was clear he loved and cared for Sakura, he even made her a wedding ring on one of their missions.\n\nI forgot about the other two novels, one was about Kakashi? I'm not sure what's going on there, I'll have to read and see.",
                                    "author": "CamillionMilk",
                                    "id": "h9t0l0w",
                                    "parent_id": "t1_h9sx6v0",
                                    "score": 27,
                                    "created_utc": 1629564092.0,
                                    "replies": [
                                        {
                                            "body": ">  it's a shame and also understandable that the fan base mostly dislikes their relationship  \n\nNah, SasuSaku was a popular ship in Japan. I don't think it would be canon if Kishimoto's *native audience* didn't somewhat like it. \n\nWesterners typically don't like it because both Sakura and Sasuke are hated here so it makes sense.",
                                            "author": null,
                                            "id": "h9t0y21",
                                            "parent_id": "t1_h9t0l0w",
                                            "score": 25,
                                            "created_utc": 1629564251.0,
                                            "replies": [
                                                {
                                                    "body": "IDK if I'd say Sasuke is hated exactly. He certainly gets meme'd on, but that's lovingly- I think.",
                                                    "author": "CheshireTsunami",
                                                    "id": "h9tfyi3",
                                                    "parent_id": "t1_h9t0y21",
                                                    "score": 17,
                                                    "created_utc": 1629571003.0,
                                                    "replies": [
                                                        {
                                                            "body": "Sakura's definitely hated in general while Sasuke is more of a base breaker. it's kinda rare to see people who like both Naruto & Sasuke equally as characters.",
                                                            "author": null,
                                                            "id": "h9tlwts",
                                                            "parent_id": "t1_h9tfyi3",
                                                            "score": 12,
                                                            "created_utc": 1629573769.0,
                                                            "replies": [
                                                                {
                                                                    "body": "I love both their characters",
                                                                    "author": "Jaron5_55",
                                                                    "id": "hcjr20t",
                                                                    "parent_id": "t1_h9tlwts",
                                                                    "score": 1,
                                                                    "created_utc": 1631443296.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "body": "Sadly he is. At least on some platforms, people say he's dumb for making the decisions he made as a traumatized child with way too much responsibility who got his life fucked completely by his brother, who on the other hand is loved and praised as if he was the messiah.\n\nI like itachi but holy fuck you can't call this man a hero",
                                                            "author": "HisOnlyFriend",
                                                            "id": "h9tzdw0",
                                                            "parent_id": "t1_h9tfyi3",
                                                            "score": 9,
                                                            "created_utc": 1629580001.0,
                                                            "replies": [
                                                                {
                                                                    "body": "I don't think it is unique to Sasuke.\n\nI think people want characters with messed up backstories who act \"cool\" because lets be honest, trauma isn't pretty. \n\nI often see Katara from ATLA get hated on for \"whining\" about her life and acting like her pain is worse (which I don't even remember?)",
                                                                    "author": null,
                                                                    "id": "h9u4y1l",
                                                                    "parent_id": "t1_h9tzdw0",
                                                                    "score": 5,
                                                                    "created_utc": 1629582592.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "Yeah I get that but people complaining about him being 'emo for no reason' after what he went through kinda bothers me",
                                                                            "author": "HisOnlyFriend",
                                                                            "id": "h9u7uo4",
                                                                            "parent_id": "t1_h9u4y1l",
                                                                            "score": 2,
                                                                            "created_utc": 1629583970.0,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "body": "Ehh I was understanding of sasuke until he found out about itachi and still had to have sense knocked into him",
                                                            "author": "miojunki",
                                                            "id": "h9tm41h",
                                                            "parent_id": "t1_h9tfyi3",
                                                            "score": 4,
                                                            "created_utc": 1629573864.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Bruh some ppl rly can't even try to insert themselves in someones situation huh?",
                                                                    "author": "HisOnlyFriend",
                                                                    "id": "h9tz00i",
                                                                    "parent_id": "t1_h9tm41h",
                                                                    "score": 1,
                                                                    "created_utc": 1629579823.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "Seriously, how can people not relate to the feeling of \"because the government forced my brother to do fucked up things i am gonna massacre an entire village full of innocent people that had nothing to do with what happened\"?",
                                                                            "author": "Spoopanator",
                                                                            "id": "h9urn03",
                                                                            "parent_id": "t1_h9tz00i",
                                                                            "score": 7,
                                                                            "created_utc": 1629593730.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "Not like he was only going to kill the elders or anything, but sure",
                                                                                    "author": "HisOnlyFriend",
                                                                                    "id": "h9urrm5",
                                                                                    "parent_id": "t1_h9urn03",
                                                                                    "score": -1,
                                                                                    "created_utc": 1629593793.0,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "I really want those novels animated as well as gaara hiden",
                            "author": "tjd317",
                            "id": "h9tia4a",
                            "parent_id": "t1_h9ssvwu",
                            "score": 5,
                            "created_utc": 1629572071.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "It's much more likely Sasuke married Sakura out of penance. Maybe he grew to love her but who knows.",
                    "author": "sonfoa",
                    "id": "h9so53t",
                    "parent_id": "t1_h9sn87q",
                    "score": 61,
                    "created_utc": 1629558464.0,
                    "replies": [
                        {
                            "body": "It has nothing to do with \"penance\" or force. Just bad writing. \n\nKishimoto was also projecting his own issues onto his characters from what I heard on Naruto Forums. Apparently he didn't even have his honeymoon until Naruto ended, and would sometimes go long periods of time without seeing his own children. \n\nBut, the key difference between Kishimoto and his characters is that his characters have the power to not neglect their children",
                            "author": null,
                            "id": "h9sp1i1",
                            "parent_id": "t1_h9so53t",
                            "score": 87,
                            "created_utc": 1629558886.0,
                            "replies": [
                                {
                                    "body": "More couples = more new gen kids",
                                    "author": "MakimaMyBeloved",
                                    "id": "h9ss8ls",
                                    "parent_id": "t1_h9sp1i1",
                                    "score": 32,
                                    "created_utc": 1629560345.0,
                                    "replies": [
                                        {
                                            "body": "That’s why Kishimoto will kill off all the side characters at the end of Boruto that he doesn’t have to make a third generation. “The age of shinobi has came to an end.”",
                                            "author": "Ancient_A",
                                            "id": "h9t3cpw",
                                            "parent_id": "t1_h9ss8ls",
                                            "score": 18,
                                            "created_utc": 1629565320.0,
                                            "replies": [
                                                {
                                                    "body": "Foot sweat and period blood",
                                                    "author": "The_Uncommon_Aura",
                                                    "id": "h9t5dug",
                                                    "parent_id": "t1_h9t3cpw",
                                                    "score": 1,
                                                    "created_utc": 1629566234.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "I know it's bad writing. I'm just trying to think of an in-universe explanation as to why Sasuke would marry her.",
                                    "author": "sonfoa",
                                    "id": "h9ss8ts",
                                    "parent_id": "t1_h9sp1i1",
                                    "score": 27,
                                    "created_utc": 1629560348.0,
                                    "replies": []
                                },
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "h9srff4",
                                    "parent_id": "t1_h9sp1i1",
                                    "score": -5,
                                    "created_utc": 1629559982.0,
                                    "replies": [
                                        {
                                            "body": "Yes, Kishimoto does nothave the ability to make shadow clones or teleport to them. \n\nMangka are lowkey treated like slaves, just look up his schedule",
                                            "author": null,
                                            "id": "h9srtpd",
                                            "parent_id": "t1_h9srff4",
                                            "score": 33,
                                            "created_utc": 1629560157.0,
                                            "replies": [
                                                {
                                                    "body": "To be fair, Kishimoto is more than wealthy enough to have retired earlier and spend time with his kids if he wanted to.",
                                                    "author": "metal079",
                                                    "id": "h9thohd",
                                                    "parent_id": "t1_h9srtpd",
                                                    "score": 2,
                                                    "created_utc": 1629571794.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "that’s blatantly false. he thinks of Team 7 multiple times throughout OG Naruto up to him going rouge and in Shippuden",
                    "author": "ReallyUneducated",
                    "id": "h9uicug",
                    "parent_id": "t1_h9sn87q",
                    "score": 2,
                    "created_utc": 1629589123.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "At least he didn't say he was going out to buy cigarettes",
            "author": "heyyassbutt",
            "id": "h9ufnhz",
            "parent_id": "t1_h9sggkr",
            "score": 4,
            "created_utc": 1629587793.0,
            "replies": [
                {
                    "body": "Well that’s a better story to tell the poor girl",
                    "author": "ArtisticGround4678",
                    "id": "h9ufpbm",
                    "parent_id": "t1_h9ufnhz",
                    "score": 2,
                    "created_utc": 1629587818.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "chad sasuke",
            "author": "MrLunaticest",
            "id": "h9t97ge",
            "parent_id": "t1_h9sggkr",
            "score": 0,
            "created_utc": 1629567958.0,
            "replies": []
        },
        {
            "body": "That chad, right there!!",
            "author": "white_fang02",
            "id": "h9t893k",
            "parent_id": "t1_h9sggkr",
            "score": 0,
            "created_utc": 1629567529.0,
            "replies": []
        },
        {
            "body": "yeah...sorry.",
            "author": null,
            "id": "h9t73ow",
            "parent_id": "t1_h9sggkr",
            "score": 1,
            "created_utc": 1629567011.0,
            "replies": [
                {
                    "body": "Orochimaru is a chad for never regretting his actions \"yes, i want to be immortal, yes i experimented on children, 10/10 would do again\"",
                    "author": null,
                    "id": "h9t846x",
                    "parent_id": "t1_h9t73ow",
                    "score": 14,
                    "created_utc": 1629567467.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "#Sigma Grindset",
            "author": "aryansant",
            "id": "h9stv3q",
            "parent_id": "t1_h9sqxm9",
            "score": 147,
            "created_utc": 1629561074.0,
            "replies": []
        },
        {
            "body": "Sakura's probably his beard.",
            "author": null,
            "id": "h9t9udw",
            "parent_id": "t1_h9sqxm9",
            "score": 33,
            "created_utc": 1629568242.0,
            "replies": [
                {
                    "body": "It's not very convincing at this point.",
                    "author": "bhavbhav",
                    "id": "h9tt9x5",
                    "parent_id": "t1_h9t9udw",
                    "score": 10,
                    "created_utc": 1629577185.0,
                    "replies": [
                        {
                            "body": "Whaa? Tbh, its the only explanation for him being gonw but keeping in touch with Nart",
                            "author": null,
                            "id": "h9tuf9a",
                            "parent_id": "t1_h9tt9x5",
                            "score": 3,
                            "created_utc": 1629577712.0,
                            "replies": [
                                {
                                    "body": "No, I meant his beard is not convincing, lol. 😂 I feel like it's at least a little sus that he communicates with Naruto far more than he does with his own wife.",
                                    "author": "bhavbhav",
                                    "id": "h9tusbk",
                                    "parent_id": "t1_h9tuf9a",
                                    "score": 14,
                                    "created_utc": 1629577877.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "bros before hoes",
            "author": "SexWithFischl69",
            "id": "h9tcouv",
            "parent_id": "t1_h9sqxm9",
            "score": 21,
            "created_utc": 1629569513.0,
            "replies": []
        },
        {
            "body": "I know it’s a complicated relationship, but seriously, for the first whatever years of Sarada’s life, it seems Sauske just used Sakura as a booty call until Sarada was old enough to kill people",
            "author": "The84thWolf",
            "id": "h9upqfq",
            "parent_id": "t1_h9sqxm9",
            "score": 10,
            "created_utc": 1629592783.0,
            "replies": []
        },
        {
            "body": "I mean he was with Sakura when she was giving birth",
            "author": "KingDanner",
            "id": "h9uq98d",
            "parent_id": "t1_h9sqxm9",
            "score": 2,
            "created_utc": 1629593045.0,
            "replies": []
        },
        {
            "body": "\"I don't want to touch you\"",
            "author": null,
            "id": "h9uhjqd",
            "parent_id": "t1_h9szb0p",
            "score": 39,
            "created_utc": 1629588725.0,
            "replies": []
        },
        {
            "body": "This is actually seems like it makes sense",
            "author": "kwazi1618",
            "id": "h9w5iav",
            "parent_id": "t1_h9szb0p",
            "score": 5,
            "created_utc": 1629625653.0,
            "replies": []
        },
        {
            "body": "If you're interested in a well written light novel that follows Sasuke and Sakura's journey as ninja, a couple and a team, I recommend the Sasuke Shinden and the Sakura Hiden. They're both canon, not written by Kishimoto but illustrated by him, so there's a good amount of \"expressed emotions\" in them.",
            "author": "CamillionMilk",
            "id": "h9ste4z",
            "parent_id": "t1_h9socgi",
            "score": 39,
            "created_utc": 1629560862.0,
            "replies": [
                {
                    "body": "I really want to read the novels. Especially the Itachi one.",
                    "author": "Ancient_A",
                    "id": "h9t3hvo",
                    "parent_id": "t1_h9ste4z",
                    "score": 12,
                    "created_utc": 1629565385.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "According to kishimoto he's happy with her character and  actually based her off his wife. He's just bad at writing teenage girls",
            "author": "WindyCityAssasin2",
            "id": "h9vpui7",
            "parent_id": "t1_h9socgi",
            "score": 4,
            "created_utc": 1629612600.0,
            "replies": []
        },
        {
            "body": "Me too",
            "author": "mltblt_",
            "id": "h9srk71",
            "parent_id": "t1_h9socgi",
            "score": 6,
            "created_utc": 1629560041.0,
            "replies": []
        },
        {
            "body": "Who doesn’t lol",
            "author": "masterhal123",
            "id": "h9svzp8",
            "parent_id": "t1_h9socgi",
            "score": 0,
            "created_utc": 1629562031.0,
            "replies": []
        },
        {
            "body": "Don’t we all?",
            "author": null,
            "id": "h9tj52n",
            "parent_id": "t1_h9socgi",
            "score": -3,
            "created_utc": 1629572476.0,
            "replies": []
        },
        {
            "body": "Hit and dip",
            "author": "ZandatsuDragon",
            "id": "h9ubavt",
            "parent_id": "t1_h9tcx3y",
            "score": 7,
            "created_utc": 1629585630.0,
            "replies": []
        },
        {
            "body": "lol",
            "author": "masterhal123",
            "id": "h9sw3oo",
            "parent_id": "t1_h9snv1t",
            "score": 0,
            "created_utc": 1629562080.0,
            "replies": []
        },
        {
            "body": "Facts",
            "author": null,
            "id": "h9tj64j",
            "parent_id": "t1_h9snv1t",
            "score": -2,
            "created_utc": 1629572489.0,
            "replies": []
        },
        {
            "body": "Looks like a repost. I've seen this image 1 time.\n\nFirst seen [Here](https://www.youtube.com/watch?v=dQw4w9WgXcQ) on 2021-08-19 92.76% match.\n\n**Searched Images**: 236,568,933 | **Indexed Posts**: 124,541,320 | **Search Time**: 7.97142s\n\n*Feedback? Hate? Visit [r/repostsleuthbot](https://www.youtube.com/watch?v=6n3pFFPSlW4) - I'm not perfect, but you can help. Report [ [False Positive](https://www.youtube.com/watch?v=d1YBv2mWll0) ]*",
            "author": "Not_RepostSleuthBot",
            "id": "h9tm14g",
            "parent_id": "t1_h9tm08q",
            "score": 5,
            "created_utc": 1629573825.0,
            "replies": []
        },
        {
            "body": "I didn't find any posts that meet the matching requirements for r/dankruto.\n\nIt might be OC, it might not. Things such as JPEG artifacts and cropping may impact the results.\n\nI did find [this post](https://redd.it/7xiaqg) that is 81.25% similar.  It might be a match but I cannot be certain.\n\n*I'm not perfect, but you can help. Report [ [False Negative](https://www.reddit.com/message/compose/?to=RepostSleuthBot&subject=False%20Negative&message={\"post_id\": \"p8rm92\", \"meme_template\": null}) ]*\n\n[View Search On repostsleuth.com](https://www.repostsleuth.com?postId=p8rm92&sameSub=false&filterOnlyOlder=true&memeFilter=true&filterDeadMatches=false&targetImageMatch=85&targetImageMemeMatch=85)\n\n---\n\n**Scope:** Reddit | **Meme Filter:** False | **Target:** 85% | **Check Title:** False | **Max Age:** Unlimited | **Searched Images:** 239,843,416 | **Search Time:** 0.32892s",
            "author": "RepostSleuthBot",
            "id": "h9ub8oc",
            "parent_id": "t1_h9tm08q",
            "score": 1,
            "created_utc": 1629585601.0,
            "replies": []
        },
        {
            "body": "“That’s crazy… I have a milk delivery in the hidden stone village”",
            "author": "wutizgoinoneverybudy",
            "id": "h9vr195",
            "parent_id": "t1_h9ub90g",
            "score": 32,
            "created_utc": 1629613473.0,
            "replies": [
                {
                    "body": "\"Fuck..Naruto wants me to get another frog wallet for him at the hidden mist village\"",
                    "author": "ZandatsuDragon",
                    "id": "h9w5uox",
                    "parent_id": "t1_h9vr195",
                    "score": 15,
                    "created_utc": 1629625959.0,
                    "replies": [
                        {
                            "body": "Naruto and I need to go on a mission... it's very important probably will take a few years idc if you're Hokage you're coming with me Naruto",
                            "author": "Jaron5_55",
                            "id": "hcjqw3a",
                            "parent_id": "t1_h9w5uox",
                            "score": 2,
                            "created_utc": 1631443161.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "There are 2 light novels (Sakura Hide and Sasuke Shinden) that develop their relationship after the war. They're even illustrated by Kishi and are both canon. \n\nI don't want to spoil anything, there's plenty of action, it's not just a love story but the emotional aspects are really well written, it shows that even in OG Naruto Sasuke was half in love with Sakura when he left the village and all sorts of things.. \n\nWhat sucks is that they should have animated those, the action and fights are really good. They also cover Sakura and Sasuke's mission in search of a cure for Naruto's chakra illness. \nAnyway there's no surprise that 90% of the community views their relationship as forced, it was never shown outside the novels.",
            "author": "CamillionMilk",
            "id": "h9ssvwu",
            "parent_id": "t1_h9sn87q",
            "score": 176,
            "created_utc": 1629560635.0,
            "replies": [
                {
                    "body": "i've read the novels. the sakura hiden one is quite good and definitely deserved to be animated.but none of those novels cover anything substantial in regards to their \"relationship development\". sakura hiden just shows sakura's POV on certain events which we didnt need bc we know how her love for sasuke is unconditional. and sasuke shinden doesnt mention sakura ANYWHERE let alone how he was \"half in love with sakura\" during part 1 naruto , sakura is only brought up at the last when he sees sakura . \n\nalso as far as i remember one of the OTHER novels state that he was only started to like her romantically after he left for his redemption journey so either one of them is correct or both novels are contradicting themselves which is a good reason to leave it up to the individual fans to decide which aspects of the novels canon \r  \n\r  \nno offence but if you have to rely on novels to show \"relationship development\" then its pointless since most fans of shonen anime fans dont read novels unless they are really hardcore fans.no other canon pairings in anime required novels to develop the relationship",
                    "author": "rogue---ninja",
                    "id": "h9sx6v0",
                    "parent_id": "t1_h9ssvwu",
                    "score": 90,
                    "created_utc": 1629562574.0,
                    "replies": [
                        {
                            "body": "That's exactly what I said, it's a shame and also understandable that the fan base mostly dislikes their relationship because it isn't shown to them. Most fans are anime-only, I doubt that even all manga fans have picked up the novels either. \n\nI found out about those novels through a YouTube channel (Naruto Explained) and the dude there goes in a deep dive over the relationship of the two. And I remember the youtube guy going over Sasuke's inner thoughts, his fears, what he thinks of his wife etc, and it was clear he loved and cared for Sakura, he even made her a wedding ring on one of their missions.\n\nI forgot about the other two novels, one was about Kakashi? I'm not sure what's going on there, I'll have to read and see.",
                            "author": "CamillionMilk",
                            "id": "h9t0l0w",
                            "parent_id": "t1_h9sx6v0",
                            "score": 27,
                            "created_utc": 1629564092.0,
                            "replies": [
                                {
                                    "body": ">  it's a shame and also understandable that the fan base mostly dislikes their relationship  \n\nNah, SasuSaku was a popular ship in Japan. I don't think it would be canon if Kishimoto's *native audience* didn't somewhat like it. \n\nWesterners typically don't like it because both Sakura and Sasuke are hated here so it makes sense.",
                                    "author": null,
                                    "id": "h9t0y21",
                                    "parent_id": "t1_h9t0l0w",
                                    "score": 25,
                                    "created_utc": 1629564251.0,
                                    "replies": [
                                        {
                                            "body": "IDK if I'd say Sasuke is hated exactly. He certainly gets meme'd on, but that's lovingly- I think.",
                                            "author": "CheshireTsunami",
                                            "id": "h9tfyi3",
                                            "parent_id": "t1_h9t0y21",
                                            "score": 17,
                                            "created_utc": 1629571003.0,
                                            "replies": [
                                                {
                                                    "body": "Sakura's definitely hated in general while Sasuke is more of a base breaker. it's kinda rare to see people who like both Naruto & Sasuke equally as characters.",
                                                    "author": null,
                                                    "id": "h9tlwts",
                                                    "parent_id": "t1_h9tfyi3",
                                                    "score": 12,
                                                    "created_utc": 1629573769.0,
                                                    "replies": [
                                                        {
                                                            "body": "I love both their characters",
                                                            "author": "Jaron5_55",
                                                            "id": "hcjr20t",
                                                            "parent_id": "t1_h9tlwts",
                                                            "score": 1,
                                                            "created_utc": 1631443296.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "body": "Sadly he is. At least on some platforms, people say he's dumb for making the decisions he made as a traumatized child with way too much responsibility who got his life fucked completely by his brother, who on the other hand is loved and praised as if he was the messiah.\n\nI like itachi but holy fuck you can't call this man a hero",
                                                    "author": "HisOnlyFriend",
                                                    "id": "h9tzdw0",
                                                    "parent_id": "t1_h9tfyi3",
                                                    "score": 9,
                                                    "created_utc": 1629580001.0,
                                                    "replies": [
                                                        {
                                                            "body": "I don't think it is unique to Sasuke.\n\nI think people want characters with messed up backstories who act \"cool\" because lets be honest, trauma isn't pretty. \n\nI often see Katara from ATLA get hated on for \"whining\" about her life and acting like her pain is worse (which I don't even remember?)",
                                                            "author": null,
                                                            "id": "h9u4y1l",
                                                            "parent_id": "t1_h9tzdw0",
                                                            "score": 5,
                                                            "created_utc": 1629582592.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Yeah I get that but people complaining about him being 'emo for no reason' after what he went through kinda bothers me",
                                                                    "author": "HisOnlyFriend",
                                                                    "id": "h9u7uo4",
                                                                    "parent_id": "t1_h9u4y1l",
                                                                    "score": 2,
                                                                    "created_utc": 1629583970.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "body": "Ehh I was understanding of sasuke until he found out about itachi and still had to have sense knocked into him",
                                                    "author": "miojunki",
                                                    "id": "h9tm41h",
                                                    "parent_id": "t1_h9tfyi3",
                                                    "score": 4,
                                                    "created_utc": 1629573864.0,
                                                    "replies": [
                                                        {
                                                            "body": "Bruh some ppl rly can't even try to insert themselves in someones situation huh?",
                                                            "author": "HisOnlyFriend",
                                                            "id": "h9tz00i",
                                                            "parent_id": "t1_h9tm41h",
                                                            "score": 1,
                                                            "created_utc": 1629579823.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Seriously, how can people not relate to the feeling of \"because the government forced my brother to do fucked up things i am gonna massacre an entire village full of innocent people that had nothing to do with what happened\"?",
                                                                    "author": "Spoopanator",
                                                                    "id": "h9urn03",
                                                                    "parent_id": "t1_h9tz00i",
                                                                    "score": 7,
                                                                    "created_utc": 1629593730.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "Not like he was only going to kill the elders or anything, but sure",
                                                                            "author": "HisOnlyFriend",
                                                                            "id": "h9urrm5",
                                                                            "parent_id": "t1_h9urn03",
                                                                            "score": -1,
                                                                            "created_utc": 1629593793.0,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "I really want those novels animated as well as gaara hiden",
                    "author": "tjd317",
                    "id": "h9tia4a",
                    "parent_id": "t1_h9ssvwu",
                    "score": 5,
                    "created_utc": 1629572071.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "It's much more likely Sasuke married Sakura out of penance. Maybe he grew to love her but who knows.",
            "author": "sonfoa",
            "id": "h9so53t",
            "parent_id": "t1_h9sn87q",
            "score": 61,
            "created_utc": 1629558464.0,
            "replies": [
                {
                    "body": "It has nothing to do with \"penance\" or force. Just bad writing. \n\nKishimoto was also projecting his own issues onto his characters from what I heard on Naruto Forums. Apparently he didn't even have his honeymoon until Naruto ended, and would sometimes go long periods of time without seeing his own children. \n\nBut, the key difference between Kishimoto and his characters is that his characters have the power to not neglect their children",
                    "author": null,
                    "id": "h9sp1i1",
                    "parent_id": "t1_h9so53t",
                    "score": 87,
                    "created_utc": 1629558886.0,
                    "replies": [
                        {
                            "body": "More couples = more new gen kids",
                            "author": "MakimaMyBeloved",
                            "id": "h9ss8ls",
                            "parent_id": "t1_h9sp1i1",
                            "score": 32,
                            "created_utc": 1629560345.0,
                            "replies": [
                                {
                                    "body": "That’s why Kishimoto will kill off all the side characters at the end of Boruto that he doesn’t have to make a third generation. “The age of shinobi has came to an end.”",
                                    "author": "Ancient_A",
                                    "id": "h9t3cpw",
                                    "parent_id": "t1_h9ss8ls",
                                    "score": 18,
                                    "created_utc": 1629565320.0,
                                    "replies": [
                                        {
                                            "body": "Foot sweat and period blood",
                                            "author": "The_Uncommon_Aura",
                                            "id": "h9t5dug",
                                            "parent_id": "t1_h9t3cpw",
                                            "score": 1,
                                            "created_utc": 1629566234.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "I know it's bad writing. I'm just trying to think of an in-universe explanation as to why Sasuke would marry her.",
                            "author": "sonfoa",
                            "id": "h9ss8ts",
                            "parent_id": "t1_h9sp1i1",
                            "score": 27,
                            "created_utc": 1629560348.0,
                            "replies": []
                        },
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "h9srff4",
                            "parent_id": "t1_h9sp1i1",
                            "score": -5,
                            "created_utc": 1629559982.0,
                            "replies": [
                                {
                                    "body": "Yes, Kishimoto does nothave the ability to make shadow clones or teleport to them. \n\nMangka are lowkey treated like slaves, just look up his schedule",
                                    "author": null,
                                    "id": "h9srtpd",
                                    "parent_id": "t1_h9srff4",
                                    "score": 33,
                                    "created_utc": 1629560157.0,
                                    "replies": [
                                        {
                                            "body": "To be fair, Kishimoto is more than wealthy enough to have retired earlier and spend time with his kids if he wanted to.",
                                            "author": "metal079",
                                            "id": "h9thohd",
                                            "parent_id": "t1_h9srtpd",
                                            "score": 2,
                                            "created_utc": 1629571794.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "that’s blatantly false. he thinks of Team 7 multiple times throughout OG Naruto up to him going rouge and in Shippuden",
            "author": "ReallyUneducated",
            "id": "h9uicug",
            "parent_id": "t1_h9sn87q",
            "score": 2,
            "created_utc": 1629589123.0,
            "replies": []
        },
        {
            "body": "Well that’s a better story to tell the poor girl",
            "author": "ArtisticGround4678",
            "id": "h9ufpbm",
            "parent_id": "t1_h9ufnhz",
            "score": 2,
            "created_utc": 1629587818.0,
            "replies": []
        },
        {
            "body": "Orochimaru is a chad for never regretting his actions \"yes, i want to be immortal, yes i experimented on children, 10/10 would do again\"",
            "author": null,
            "id": "h9t846x",
            "parent_id": "t1_h9t73ow",
            "score": 14,
            "created_utc": 1629567467.0,
            "replies": []
        },
        {
            "body": "It's not very convincing at this point.",
            "author": "bhavbhav",
            "id": "h9tt9x5",
            "parent_id": "t1_h9t9udw",
            "score": 10,
            "created_utc": 1629577185.0,
            "replies": [
                {
                    "body": "Whaa? Tbh, its the only explanation for him being gonw but keeping in touch with Nart",
                    "author": null,
                    "id": "h9tuf9a",
                    "parent_id": "t1_h9tt9x5",
                    "score": 3,
                    "created_utc": 1629577712.0,
                    "replies": [
                        {
                            "body": "No, I meant his beard is not convincing, lol. 😂 I feel like it's at least a little sus that he communicates with Naruto far more than he does with his own wife.",
                            "author": "bhavbhav",
                            "id": "h9tusbk",
                            "parent_id": "t1_h9tuf9a",
                            "score": 14,
                            "created_utc": 1629577877.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I really want to read the novels. Especially the Itachi one.",
            "author": "Ancient_A",
            "id": "h9t3hvo",
            "parent_id": "t1_h9ste4z",
            "score": 12,
            "created_utc": 1629565385.0,
            "replies": []
        },
        {
            "body": "\"Fuck..Naruto wants me to get another frog wallet for him at the hidden mist village\"",
            "author": "ZandatsuDragon",
            "id": "h9w5uox",
            "parent_id": "t1_h9vr195",
            "score": 15,
            "created_utc": 1629625959.0,
            "replies": [
                {
                    "body": "Naruto and I need to go on a mission... it's very important probably will take a few years idc if you're Hokage you're coming with me Naruto",
                    "author": "Jaron5_55",
                    "id": "hcjqw3a",
                    "parent_id": "t1_h9w5uox",
                    "score": 2,
                    "created_utc": 1631443161.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "i've read the novels. the sakura hiden one is quite good and definitely deserved to be animated.but none of those novels cover anything substantial in regards to their \"relationship development\". sakura hiden just shows sakura's POV on certain events which we didnt need bc we know how her love for sasuke is unconditional. and sasuke shinden doesnt mention sakura ANYWHERE let alone how he was \"half in love with sakura\" during part 1 naruto , sakura is only brought up at the last when he sees sakura . \n\nalso as far as i remember one of the OTHER novels state that he was only started to like her romantically after he left for his redemption journey so either one of them is correct or both novels are contradicting themselves which is a good reason to leave it up to the individual fans to decide which aspects of the novels canon \r  \n\r  \nno offence but if you have to rely on novels to show \"relationship development\" then its pointless since most fans of shonen anime fans dont read novels unless they are really hardcore fans.no other canon pairings in anime required novels to develop the relationship",
            "author": "rogue---ninja",
            "id": "h9sx6v0",
            "parent_id": "t1_h9ssvwu",
            "score": 90,
            "created_utc": 1629562574.0,
            "replies": [
                {
                    "body": "That's exactly what I said, it's a shame and also understandable that the fan base mostly dislikes their relationship because it isn't shown to them. Most fans are anime-only, I doubt that even all manga fans have picked up the novels either. \n\nI found out about those novels through a YouTube channel (Naruto Explained) and the dude there goes in a deep dive over the relationship of the two. And I remember the youtube guy going over Sasuke's inner thoughts, his fears, what he thinks of his wife etc, and it was clear he loved and cared for Sakura, he even made her a wedding ring on one of their missions.\n\nI forgot about the other two novels, one was about Kakashi? I'm not sure what's going on there, I'll have to read and see.",
                    "author": "CamillionMilk",
                    "id": "h9t0l0w",
                    "parent_id": "t1_h9sx6v0",
                    "score": 27,
                    "created_utc": 1629564092.0,
                    "replies": [
                        {
                            "body": ">  it's a shame and also understandable that the fan base mostly dislikes their relationship  \n\nNah, SasuSaku was a popular ship in Japan. I don't think it would be canon if Kishimoto's *native audience* didn't somewhat like it. \n\nWesterners typically don't like it because both Sakura and Sasuke are hated here so it makes sense.",
                            "author": null,
                            "id": "h9t0y21",
                            "parent_id": "t1_h9t0l0w",
                            "score": 25,
                            "created_utc": 1629564251.0,
                            "replies": [
                                {
                                    "body": "IDK if I'd say Sasuke is hated exactly. He certainly gets meme'd on, but that's lovingly- I think.",
                                    "author": "CheshireTsunami",
                                    "id": "h9tfyi3",
                                    "parent_id": "t1_h9t0y21",
                                    "score": 17,
                                    "created_utc": 1629571003.0,
                                    "replies": [
                                        {
                                            "body": "Sakura's definitely hated in general while Sasuke is more of a base breaker. it's kinda rare to see people who like both Naruto & Sasuke equally as characters.",
                                            "author": null,
                                            "id": "h9tlwts",
                                            "parent_id": "t1_h9tfyi3",
                                            "score": 12,
                                            "created_utc": 1629573769.0,
                                            "replies": [
                                                {
                                                    "body": "I love both their characters",
                                                    "author": "Jaron5_55",
                                                    "id": "hcjr20t",
                                                    "parent_id": "t1_h9tlwts",
                                                    "score": 1,
                                                    "created_utc": 1631443296.0,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "body": "Sadly he is. At least on some platforms, people say he's dumb for making the decisions he made as a traumatized child with way too much responsibility who got his life fucked completely by his brother, who on the other hand is loved and praised as if he was the messiah.\n\nI like itachi but holy fuck you can't call this man a hero",
                                            "author": "HisOnlyFriend",
                                            "id": "h9tzdw0",
                                            "parent_id": "t1_h9tfyi3",
                                            "score": 9,
                                            "created_utc": 1629580001.0,
                                            "replies": [
                                                {
                                                    "body": "I don't think it is unique to Sasuke.\n\nI think people want characters with messed up backstories who act \"cool\" because lets be honest, trauma isn't pretty. \n\nI often see Katara from ATLA get hated on for \"whining\" about her life and acting like her pain is worse (which I don't even remember?)",
                                                    "author": null,
                                                    "id": "h9u4y1l",
                                                    "parent_id": "t1_h9tzdw0",
                                                    "score": 5,
                                                    "created_utc": 1629582592.0,
                                                    "replies": [
                                                        {
                                                            "body": "Yeah I get that but people complaining about him being 'emo for no reason' after what he went through kinda bothers me",
                                                            "author": "HisOnlyFriend",
                                                            "id": "h9u7uo4",
                                                            "parent_id": "t1_h9u4y1l",
                                                            "score": 2,
                                                            "created_utc": 1629583970.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "body": "Ehh I was understanding of sasuke until he found out about itachi and still had to have sense knocked into him",
                                            "author": "miojunki",
                                            "id": "h9tm41h",
                                            "parent_id": "t1_h9tfyi3",
                                            "score": 4,
                                            "created_utc": 1629573864.0,
                                            "replies": [
                                                {
                                                    "body": "Bruh some ppl rly can't even try to insert themselves in someones situation huh?",
                                                    "author": "HisOnlyFriend",
                                                    "id": "h9tz00i",
                                                    "parent_id": "t1_h9tm41h",
                                                    "score": 1,
                                                    "created_utc": 1629579823.0,
                                                    "replies": [
                                                        {
                                                            "body": "Seriously, how can people not relate to the feeling of \"because the government forced my brother to do fucked up things i am gonna massacre an entire village full of innocent people that had nothing to do with what happened\"?",
                                                            "author": "Spoopanator",
                                                            "id": "h9urn03",
                                                            "parent_id": "t1_h9tz00i",
                                                            "score": 7,
                                                            "created_utc": 1629593730.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Not like he was only going to kill the elders or anything, but sure",
                                                                    "author": "HisOnlyFriend",
                                                                    "id": "h9urrm5",
                                                                    "parent_id": "t1_h9urn03",
                                                                    "score": -1,
                                                                    "created_utc": 1629593793.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I really want those novels animated as well as gaara hiden",
            "author": "tjd317",
            "id": "h9tia4a",
            "parent_id": "t1_h9ssvwu",
            "score": 5,
            "created_utc": 1629572071.0,
            "replies": []
        },
        {
            "body": "It has nothing to do with \"penance\" or force. Just bad writing. \n\nKishimoto was also projecting his own issues onto his characters from what I heard on Naruto Forums. Apparently he didn't even have his honeymoon until Naruto ended, and would sometimes go long periods of time without seeing his own children. \n\nBut, the key difference between Kishimoto and his characters is that his characters have the power to not neglect their children",
            "author": null,
            "id": "h9sp1i1",
            "parent_id": "t1_h9so53t",
            "score": 87,
            "created_utc": 1629558886.0,
            "replies": [
                {
                    "body": "More couples = more new gen kids",
                    "author": "MakimaMyBeloved",
                    "id": "h9ss8ls",
                    "parent_id": "t1_h9sp1i1",
                    "score": 32,
                    "created_utc": 1629560345.0,
                    "replies": [
                        {
                            "body": "That’s why Kishimoto will kill off all the side characters at the end of Boruto that he doesn’t have to make a third generation. “The age of shinobi has came to an end.”",
                            "author": "Ancient_A",
                            "id": "h9t3cpw",
                            "parent_id": "t1_h9ss8ls",
                            "score": 18,
                            "created_utc": 1629565320.0,
                            "replies": [
                                {
                                    "body": "Foot sweat and period blood",
                                    "author": "The_Uncommon_Aura",
                                    "id": "h9t5dug",
                                    "parent_id": "t1_h9t3cpw",
                                    "score": 1,
                                    "created_utc": 1629566234.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "I know it's bad writing. I'm just trying to think of an in-universe explanation as to why Sasuke would marry her.",
                    "author": "sonfoa",
                    "id": "h9ss8ts",
                    "parent_id": "t1_h9sp1i1",
                    "score": 27,
                    "created_utc": 1629560348.0,
                    "replies": []
                },
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "h9srff4",
                    "parent_id": "t1_h9sp1i1",
                    "score": -5,
                    "created_utc": 1629559982.0,
                    "replies": [
                        {
                            "body": "Yes, Kishimoto does nothave the ability to make shadow clones or teleport to them. \n\nMangka are lowkey treated like slaves, just look up his schedule",
                            "author": null,
                            "id": "h9srtpd",
                            "parent_id": "t1_h9srff4",
                            "score": 33,
                            "created_utc": 1629560157.0,
                            "replies": [
                                {
                                    "body": "To be fair, Kishimoto is more than wealthy enough to have retired earlier and spend time with his kids if he wanted to.",
                                    "author": "metal079",
                                    "id": "h9thohd",
                                    "parent_id": "t1_h9srtpd",
                                    "score": 2,
                                    "created_utc": 1629571794.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Whaa? Tbh, its the only explanation for him being gonw but keeping in touch with Nart",
            "author": null,
            "id": "h9tuf9a",
            "parent_id": "t1_h9tt9x5",
            "score": 3,
            "created_utc": 1629577712.0,
            "replies": [
                {
                    "body": "No, I meant his beard is not convincing, lol. 😂 I feel like it's at least a little sus that he communicates with Naruto far more than he does with his own wife.",
                    "author": "bhavbhav",
                    "id": "h9tusbk",
                    "parent_id": "t1_h9tuf9a",
                    "score": 14,
                    "created_utc": 1629577877.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Naruto and I need to go on a mission... it's very important probably will take a few years idc if you're Hokage you're coming with me Naruto",
            "author": "Jaron5_55",
            "id": "hcjqw3a",
            "parent_id": "t1_h9w5uox",
            "score": 2,
            "created_utc": 1631443161.0,
            "replies": []
        },
        {
            "body": "That's exactly what I said, it's a shame and also understandable that the fan base mostly dislikes their relationship because it isn't shown to them. Most fans are anime-only, I doubt that even all manga fans have picked up the novels either. \n\nI found out about those novels through a YouTube channel (Naruto Explained) and the dude there goes in a deep dive over the relationship of the two. And I remember the youtube guy going over Sasuke's inner thoughts, his fears, what he thinks of his wife etc, and it was clear he loved and cared for Sakura, he even made her a wedding ring on one of their missions.\n\nI forgot about the other two novels, one was about Kakashi? I'm not sure what's going on there, I'll have to read and see.",
            "author": "CamillionMilk",
            "id": "h9t0l0w",
            "parent_id": "t1_h9sx6v0",
            "score": 27,
            "created_utc": 1629564092.0,
            "replies": [
                {
                    "body": ">  it's a shame and also understandable that the fan base mostly dislikes their relationship  \n\nNah, SasuSaku was a popular ship in Japan. I don't think it would be canon if Kishimoto's *native audience* didn't somewhat like it. \n\nWesterners typically don't like it because both Sakura and Sasuke are hated here so it makes sense.",
                    "author": null,
                    "id": "h9t0y21",
                    "parent_id": "t1_h9t0l0w",
                    "score": 25,
                    "created_utc": 1629564251.0,
                    "replies": [
                        {
                            "body": "IDK if I'd say Sasuke is hated exactly. He certainly gets meme'd on, but that's lovingly- I think.",
                            "author": "CheshireTsunami",
                            "id": "h9tfyi3",
                            "parent_id": "t1_h9t0y21",
                            "score": 17,
                            "created_utc": 1629571003.0,
                            "replies": [
                                {
                                    "body": "Sakura's definitely hated in general while Sasuke is more of a base breaker. it's kinda rare to see people who like both Naruto & Sasuke equally as characters.",
                                    "author": null,
                                    "id": "h9tlwts",
                                    "parent_id": "t1_h9tfyi3",
                                    "score": 12,
                                    "created_utc": 1629573769.0,
                                    "replies": [
                                        {
                                            "body": "I love both their characters",
                                            "author": "Jaron5_55",
                                            "id": "hcjr20t",
                                            "parent_id": "t1_h9tlwts",
                                            "score": 1,
                                            "created_utc": 1631443296.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "Sadly he is. At least on some platforms, people say he's dumb for making the decisions he made as a traumatized child with way too much responsibility who got his life fucked completely by his brother, who on the other hand is loved and praised as if he was the messiah.\n\nI like itachi but holy fuck you can't call this man a hero",
                                    "author": "HisOnlyFriend",
                                    "id": "h9tzdw0",
                                    "parent_id": "t1_h9tfyi3",
                                    "score": 9,
                                    "created_utc": 1629580001.0,
                                    "replies": [
                                        {
                                            "body": "I don't think it is unique to Sasuke.\n\nI think people want characters with messed up backstories who act \"cool\" because lets be honest, trauma isn't pretty. \n\nI often see Katara from ATLA get hated on for \"whining\" about her life and acting like her pain is worse (which I don't even remember?)",
                                            "author": null,
                                            "id": "h9u4y1l",
                                            "parent_id": "t1_h9tzdw0",
                                            "score": 5,
                                            "created_utc": 1629582592.0,
                                            "replies": [
                                                {
                                                    "body": "Yeah I get that but people complaining about him being 'emo for no reason' after what he went through kinda bothers me",
                                                    "author": "HisOnlyFriend",
                                                    "id": "h9u7uo4",
                                                    "parent_id": "t1_h9u4y1l",
                                                    "score": 2,
                                                    "created_utc": 1629583970.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "Ehh I was understanding of sasuke until he found out about itachi and still had to have sense knocked into him",
                                    "author": "miojunki",
                                    "id": "h9tm41h",
                                    "parent_id": "t1_h9tfyi3",
                                    "score": 4,
                                    "created_utc": 1629573864.0,
                                    "replies": [
                                        {
                                            "body": "Bruh some ppl rly can't even try to insert themselves in someones situation huh?",
                                            "author": "HisOnlyFriend",
                                            "id": "h9tz00i",
                                            "parent_id": "t1_h9tm41h",
                                            "score": 1,
                                            "created_utc": 1629579823.0,
                                            "replies": [
                                                {
                                                    "body": "Seriously, how can people not relate to the feeling of \"because the government forced my brother to do fucked up things i am gonna massacre an entire village full of innocent people that had nothing to do with what happened\"?",
                                                    "author": "Spoopanator",
                                                    "id": "h9urn03",
                                                    "parent_id": "t1_h9tz00i",
                                                    "score": 7,
                                                    "created_utc": 1629593730.0,
                                                    "replies": [
                                                        {
                                                            "body": "Not like he was only going to kill the elders or anything, but sure",
                                                            "author": "HisOnlyFriend",
                                                            "id": "h9urrm5",
                                                            "parent_id": "t1_h9urn03",
                                                            "score": -1,
                                                            "created_utc": 1629593793.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "More couples = more new gen kids",
            "author": "MakimaMyBeloved",
            "id": "h9ss8ls",
            "parent_id": "t1_h9sp1i1",
            "score": 32,
            "created_utc": 1629560345.0,
            "replies": [
                {
                    "body": "That’s why Kishimoto will kill off all the side characters at the end of Boruto that he doesn’t have to make a third generation. “The age of shinobi has came to an end.”",
                    "author": "Ancient_A",
                    "id": "h9t3cpw",
                    "parent_id": "t1_h9ss8ls",
                    "score": 18,
                    "created_utc": 1629565320.0,
                    "replies": [
                        {
                            "body": "Foot sweat and period blood",
                            "author": "The_Uncommon_Aura",
                            "id": "h9t5dug",
                            "parent_id": "t1_h9t3cpw",
                            "score": 1,
                            "created_utc": 1629566234.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I know it's bad writing. I'm just trying to think of an in-universe explanation as to why Sasuke would marry her.",
            "author": "sonfoa",
            "id": "h9ss8ts",
            "parent_id": "t1_h9sp1i1",
            "score": 27,
            "created_utc": 1629560348.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "h9srff4",
            "parent_id": "t1_h9sp1i1",
            "score": -5,
            "created_utc": 1629559982.0,
            "replies": [
                {
                    "body": "Yes, Kishimoto does nothave the ability to make shadow clones or teleport to them. \n\nMangka are lowkey treated like slaves, just look up his schedule",
                    "author": null,
                    "id": "h9srtpd",
                    "parent_id": "t1_h9srff4",
                    "score": 33,
                    "created_utc": 1629560157.0,
                    "replies": [
                        {
                            "body": "To be fair, Kishimoto is more than wealthy enough to have retired earlier and spend time with his kids if he wanted to.",
                            "author": "metal079",
                            "id": "h9thohd",
                            "parent_id": "t1_h9srtpd",
                            "score": 2,
                            "created_utc": 1629571794.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "No, I meant his beard is not convincing, lol. 😂 I feel like it's at least a little sus that he communicates with Naruto far more than he does with his own wife.",
            "author": "bhavbhav",
            "id": "h9tusbk",
            "parent_id": "t1_h9tuf9a",
            "score": 14,
            "created_utc": 1629577877.0,
            "replies": []
        },
        {
            "body": ">  it's a shame and also understandable that the fan base mostly dislikes their relationship  \n\nNah, SasuSaku was a popular ship in Japan. I don't think it would be canon if Kishimoto's *native audience* didn't somewhat like it. \n\nWesterners typically don't like it because both Sakura and Sasuke are hated here so it makes sense.",
            "author": null,
            "id": "h9t0y21",
            "parent_id": "t1_h9t0l0w",
            "score": 25,
            "created_utc": 1629564251.0,
            "replies": [
                {
                    "body": "IDK if I'd say Sasuke is hated exactly. He certainly gets meme'd on, but that's lovingly- I think.",
                    "author": "CheshireTsunami",
                    "id": "h9tfyi3",
                    "parent_id": "t1_h9t0y21",
                    "score": 17,
                    "created_utc": 1629571003.0,
                    "replies": [
                        {
                            "body": "Sakura's definitely hated in general while Sasuke is more of a base breaker. it's kinda rare to see people who like both Naruto & Sasuke equally as characters.",
                            "author": null,
                            "id": "h9tlwts",
                            "parent_id": "t1_h9tfyi3",
                            "score": 12,
                            "created_utc": 1629573769.0,
                            "replies": [
                                {
                                    "body": "I love both their characters",
                                    "author": "Jaron5_55",
                                    "id": "hcjr20t",
                                    "parent_id": "t1_h9tlwts",
                                    "score": 1,
                                    "created_utc": 1631443296.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "Sadly he is. At least on some platforms, people say he's dumb for making the decisions he made as a traumatized child with way too much responsibility who got his life fucked completely by his brother, who on the other hand is loved and praised as if he was the messiah.\n\nI like itachi but holy fuck you can't call this man a hero",
                            "author": "HisOnlyFriend",
                            "id": "h9tzdw0",
                            "parent_id": "t1_h9tfyi3",
                            "score": 9,
                            "created_utc": 1629580001.0,
                            "replies": [
                                {
                                    "body": "I don't think it is unique to Sasuke.\n\nI think people want characters with messed up backstories who act \"cool\" because lets be honest, trauma isn't pretty. \n\nI often see Katara from ATLA get hated on for \"whining\" about her life and acting like her pain is worse (which I don't even remember?)",
                                    "author": null,
                                    "id": "h9u4y1l",
                                    "parent_id": "t1_h9tzdw0",
                                    "score": 5,
                                    "created_utc": 1629582592.0,
                                    "replies": [
                                        {
                                            "body": "Yeah I get that but people complaining about him being 'emo for no reason' after what he went through kinda bothers me",
                                            "author": "HisOnlyFriend",
                                            "id": "h9u7uo4",
                                            "parent_id": "t1_h9u4y1l",
                                            "score": 2,
                                            "created_utc": 1629583970.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "Ehh I was understanding of sasuke until he found out about itachi and still had to have sense knocked into him",
                            "author": "miojunki",
                            "id": "h9tm41h",
                            "parent_id": "t1_h9tfyi3",
                            "score": 4,
                            "created_utc": 1629573864.0,
                            "replies": [
                                {
                                    "body": "Bruh some ppl rly can't even try to insert themselves in someones situation huh?",
                                    "author": "HisOnlyFriend",
                                    "id": "h9tz00i",
                                    "parent_id": "t1_h9tm41h",
                                    "score": 1,
                                    "created_utc": 1629579823.0,
                                    "replies": [
                                        {
                                            "body": "Seriously, how can people not relate to the feeling of \"because the government forced my brother to do fucked up things i am gonna massacre an entire village full of innocent people that had nothing to do with what happened\"?",
                                            "author": "Spoopanator",
                                            "id": "h9urn03",
                                            "parent_id": "t1_h9tz00i",
                                            "score": 7,
                                            "created_utc": 1629593730.0,
                                            "replies": [
                                                {
                                                    "body": "Not like he was only going to kill the elders or anything, but sure",
                                                    "author": "HisOnlyFriend",
                                                    "id": "h9urrm5",
                                                    "parent_id": "t1_h9urn03",
                                                    "score": -1,
                                                    "created_utc": 1629593793.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "That’s why Kishimoto will kill off all the side characters at the end of Boruto that he doesn’t have to make a third generation. “The age of shinobi has came to an end.”",
            "author": "Ancient_A",
            "id": "h9t3cpw",
            "parent_id": "t1_h9ss8ls",
            "score": 18,
            "created_utc": 1629565320.0,
            "replies": [
                {
                    "body": "Foot sweat and period blood",
                    "author": "The_Uncommon_Aura",
                    "id": "h9t5dug",
                    "parent_id": "t1_h9t3cpw",
                    "score": 1,
                    "created_utc": 1629566234.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Yes, Kishimoto does nothave the ability to make shadow clones or teleport to them. \n\nMangka are lowkey treated like slaves, just look up his schedule",
            "author": null,
            "id": "h9srtpd",
            "parent_id": "t1_h9srff4",
            "score": 33,
            "created_utc": 1629560157.0,
            "replies": [
                {
                    "body": "To be fair, Kishimoto is more than wealthy enough to have retired earlier and spend time with his kids if he wanted to.",
                    "author": "metal079",
                    "id": "h9thohd",
                    "parent_id": "t1_h9srtpd",
                    "score": 2,
                    "created_utc": 1629571794.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "IDK if I'd say Sasuke is hated exactly. He certainly gets meme'd on, but that's lovingly- I think.",
            "author": "CheshireTsunami",
            "id": "h9tfyi3",
            "parent_id": "t1_h9t0y21",
            "score": 17,
            "created_utc": 1629571003.0,
            "replies": [
                {
                    "body": "Sakura's definitely hated in general while Sasuke is more of a base breaker. it's kinda rare to see people who like both Naruto & Sasuke equally as characters.",
                    "author": null,
                    "id": "h9tlwts",
                    "parent_id": "t1_h9tfyi3",
                    "score": 12,
                    "created_utc": 1629573769.0,
                    "replies": [
                        {
                            "body": "I love both their characters",
                            "author": "Jaron5_55",
                            "id": "hcjr20t",
                            "parent_id": "t1_h9tlwts",
                            "score": 1,
                            "created_utc": 1631443296.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Sadly he is. At least on some platforms, people say he's dumb for making the decisions he made as a traumatized child with way too much responsibility who got his life fucked completely by his brother, who on the other hand is loved and praised as if he was the messiah.\n\nI like itachi but holy fuck you can't call this man a hero",
                    "author": "HisOnlyFriend",
                    "id": "h9tzdw0",
                    "parent_id": "t1_h9tfyi3",
                    "score": 9,
                    "created_utc": 1629580001.0,
                    "replies": [
                        {
                            "body": "I don't think it is unique to Sasuke.\n\nI think people want characters with messed up backstories who act \"cool\" because lets be honest, trauma isn't pretty. \n\nI often see Katara from ATLA get hated on for \"whining\" about her life and acting like her pain is worse (which I don't even remember?)",
                            "author": null,
                            "id": "h9u4y1l",
                            "parent_id": "t1_h9tzdw0",
                            "score": 5,
                            "created_utc": 1629582592.0,
                            "replies": [
                                {
                                    "body": "Yeah I get that but people complaining about him being 'emo for no reason' after what he went through kinda bothers me",
                                    "author": "HisOnlyFriend",
                                    "id": "h9u7uo4",
                                    "parent_id": "t1_h9u4y1l",
                                    "score": 2,
                                    "created_utc": 1629583970.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Ehh I was understanding of sasuke until he found out about itachi and still had to have sense knocked into him",
                    "author": "miojunki",
                    "id": "h9tm41h",
                    "parent_id": "t1_h9tfyi3",
                    "score": 4,
                    "created_utc": 1629573864.0,
                    "replies": [
                        {
                            "body": "Bruh some ppl rly can't even try to insert themselves in someones situation huh?",
                            "author": "HisOnlyFriend",
                            "id": "h9tz00i",
                            "parent_id": "t1_h9tm41h",
                            "score": 1,
                            "created_utc": 1629579823.0,
                            "replies": [
                                {
                                    "body": "Seriously, how can people not relate to the feeling of \"because the government forced my brother to do fucked up things i am gonna massacre an entire village full of innocent people that had nothing to do with what happened\"?",
                                    "author": "Spoopanator",
                                    "id": "h9urn03",
                                    "parent_id": "t1_h9tz00i",
                                    "score": 7,
                                    "created_utc": 1629593730.0,
                                    "replies": [
                                        {
                                            "body": "Not like he was only going to kill the elders or anything, but sure",
                                            "author": "HisOnlyFriend",
                                            "id": "h9urrm5",
                                            "parent_id": "t1_h9urn03",
                                            "score": -1,
                                            "created_utc": 1629593793.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Foot sweat and period blood",
            "author": "The_Uncommon_Aura",
            "id": "h9t5dug",
            "parent_id": "t1_h9t3cpw",
            "score": 1,
            "created_utc": 1629566234.0,
            "replies": []
        },
        {
            "body": "To be fair, Kishimoto is more than wealthy enough to have retired earlier and spend time with his kids if he wanted to.",
            "author": "metal079",
            "id": "h9thohd",
            "parent_id": "t1_h9srtpd",
            "score": 2,
            "created_utc": 1629571794.0,
            "replies": []
        },
        {
            "body": "Sakura's definitely hated in general while Sasuke is more of a base breaker. it's kinda rare to see people who like both Naruto & Sasuke equally as characters.",
            "author": null,
            "id": "h9tlwts",
            "parent_id": "t1_h9tfyi3",
            "score": 12,
            "created_utc": 1629573769.0,
            "replies": [
                {
                    "body": "I love both their characters",
                    "author": "Jaron5_55",
                    "id": "hcjr20t",
                    "parent_id": "t1_h9tlwts",
                    "score": 1,
                    "created_utc": 1631443296.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Sadly he is. At least on some platforms, people say he's dumb for making the decisions he made as a traumatized child with way too much responsibility who got his life fucked completely by his brother, who on the other hand is loved and praised as if he was the messiah.\n\nI like itachi but holy fuck you can't call this man a hero",
            "author": "HisOnlyFriend",
            "id": "h9tzdw0",
            "parent_id": "t1_h9tfyi3",
            "score": 9,
            "created_utc": 1629580001.0,
            "replies": [
                {
                    "body": "I don't think it is unique to Sasuke.\n\nI think people want characters with messed up backstories who act \"cool\" because lets be honest, trauma isn't pretty. \n\nI often see Katara from ATLA get hated on for \"whining\" about her life and acting like her pain is worse (which I don't even remember?)",
                    "author": null,
                    "id": "h9u4y1l",
                    "parent_id": "t1_h9tzdw0",
                    "score": 5,
                    "created_utc": 1629582592.0,
                    "replies": [
                        {
                            "body": "Yeah I get that but people complaining about him being 'emo for no reason' after what he went through kinda bothers me",
                            "author": "HisOnlyFriend",
                            "id": "h9u7uo4",
                            "parent_id": "t1_h9u4y1l",
                            "score": 2,
                            "created_utc": 1629583970.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Ehh I was understanding of sasuke until he found out about itachi and still had to have sense knocked into him",
            "author": "miojunki",
            "id": "h9tm41h",
            "parent_id": "t1_h9tfyi3",
            "score": 4,
            "created_utc": 1629573864.0,
            "replies": [
                {
                    "body": "Bruh some ppl rly can't even try to insert themselves in someones situation huh?",
                    "author": "HisOnlyFriend",
                    "id": "h9tz00i",
                    "parent_id": "t1_h9tm41h",
                    "score": 1,
                    "created_utc": 1629579823.0,
                    "replies": [
                        {
                            "body": "Seriously, how can people not relate to the feeling of \"because the government forced my brother to do fucked up things i am gonna massacre an entire village full of innocent people that had nothing to do with what happened\"?",
                            "author": "Spoopanator",
                            "id": "h9urn03",
                            "parent_id": "t1_h9tz00i",
                            "score": 7,
                            "created_utc": 1629593730.0,
                            "replies": [
                                {
                                    "body": "Not like he was only going to kill the elders or anything, but sure",
                                    "author": "HisOnlyFriend",
                                    "id": "h9urrm5",
                                    "parent_id": "t1_h9urn03",
                                    "score": -1,
                                    "created_utc": 1629593793.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I love both their characters",
            "author": "Jaron5_55",
            "id": "hcjr20t",
            "parent_id": "t1_h9tlwts",
            "score": 1,
            "created_utc": 1631443296.0,
            "replies": []
        },
        {
            "body": "I don't think it is unique to Sasuke.\n\nI think people want characters with messed up backstories who act \"cool\" because lets be honest, trauma isn't pretty. \n\nI often see Katara from ATLA get hated on for \"whining\" about her life and acting like her pain is worse (which I don't even remember?)",
            "author": null,
            "id": "h9u4y1l",
            "parent_id": "t1_h9tzdw0",
            "score": 5,
            "created_utc": 1629582592.0,
            "replies": [
                {
                    "body": "Yeah I get that but people complaining about him being 'emo for no reason' after what he went through kinda bothers me",
                    "author": "HisOnlyFriend",
                    "id": "h9u7uo4",
                    "parent_id": "t1_h9u4y1l",
                    "score": 2,
                    "created_utc": 1629583970.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Bruh some ppl rly can't even try to insert themselves in someones situation huh?",
            "author": "HisOnlyFriend",
            "id": "h9tz00i",
            "parent_id": "t1_h9tm41h",
            "score": 1,
            "created_utc": 1629579823.0,
            "replies": [
                {
                    "body": "Seriously, how can people not relate to the feeling of \"because the government forced my brother to do fucked up things i am gonna massacre an entire village full of innocent people that had nothing to do with what happened\"?",
                    "author": "Spoopanator",
                    "id": "h9urn03",
                    "parent_id": "t1_h9tz00i",
                    "score": 7,
                    "created_utc": 1629593730.0,
                    "replies": [
                        {
                            "body": "Not like he was only going to kill the elders or anything, but sure",
                            "author": "HisOnlyFriend",
                            "id": "h9urrm5",
                            "parent_id": "t1_h9urn03",
                            "score": -1,
                            "created_utc": 1629593793.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Yeah I get that but people complaining about him being 'emo for no reason' after what he went through kinda bothers me",
            "author": "HisOnlyFriend",
            "id": "h9u7uo4",
            "parent_id": "t1_h9u4y1l",
            "score": 2,
            "created_utc": 1629583970.0,
            "replies": []
        },
        {
            "body": "Seriously, how can people not relate to the feeling of \"because the government forced my brother to do fucked up things i am gonna massacre an entire village full of innocent people that had nothing to do with what happened\"?",
            "author": "Spoopanator",
            "id": "h9urn03",
            "parent_id": "t1_h9tz00i",
            "score": 7,
            "created_utc": 1629593730.0,
            "replies": [
                {
                    "body": "Not like he was only going to kill the elders or anything, but sure",
                    "author": "HisOnlyFriend",
                    "id": "h9urrm5",
                    "parent_id": "t1_h9urn03",
                    "score": -1,
                    "created_utc": 1629593793.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Not like he was only going to kill the elders or anything, but sure",
            "author": "HisOnlyFriend",
            "id": "h9urrm5",
            "parent_id": "t1_h9urn03",
            "score": -1,
            "created_utc": 1629593793.0,
            "replies": []
        }
    ]
}