{
    "title": "My pot SD’s wife is... wonderful",
    "post_id": "dbcdqj",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/dbcdqj/my_pot_sds_wife_is_wonderful/",
    "author": "fannyhoney",
    "body": "She is pretty, cute, mom of his child. She’s a researcher and does extremely meaningful work for society, super productive and successful, her track record blew my mind. She also looks outdoorsy and fun. I looked her up and I genuinely admired her and thought I don’t compare. \n\nMy pot has been seeing girls behind her back for 4 years at least. She has no clue. I don’t understand why and how someone would cheat on a woman like that. I just don’t get it. He said he would not change a thing about his life with her and that he loves his family as it is. Why would he be so committed to SA? Why cheat on such women?\n\nEdit: I’m being downvoted left and right and I wanted to say please understand I’m asking out of curiosity. I’m not making any ethical judgment on any lifestyle. I’m part of it myself.\n\nEdit2: Thank you for the insights. I’m getting intimidated by the comments saying I was ill-meaning. I wasn’t. I’m gonna move on with my life and I’m not thinking about this, as some suggested. Setting up a date with my pot and I can’t wait to kiss his sweet lips. Take care ya’ll!",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/dbcdqj/my_pot_sds_wife_is_wonderful/",
    "score": 291,
    "upvote_ratio": 0.87,
    "created_utc": 1569853823.0,
    "num_comments": 177,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "Fellas, Give Op a break. From most of her replies, she has been humble about it all. Seems like she is good, thoughtful, caring person who truly empathized with another human being and trying to put herself in SDs SOs shoes. If nothing else, she was genuinely curious.",
            "author": "captainIsBack4u",
            "id": "f21b68x",
            "parent_id": "t3_dbcdqj",
            "score": 60,
            "created_utc": 1569870123.0,
            "replies": [
                {
                    "body": "deleted  ^^^^^^^^^^^^^^^^0.8717  [^^^What ^^^is ^^^this?](https://pastebin.com/FcrFs94k/50110)",
                    "author": null,
                    "id": "f232azr",
                    "parent_id": "t1_f21b68x",
                    "score": 3,
                    "created_utc": 1569903612.0,
                    "replies": []
                },
                {
                    "body": "If she truly empathized she wouldn’t let herself be used as a tool to hurt someone behind their back, don’t you think?",
                    "author": null,
                    "id": "f21d5nw",
                    "parent_id": "t1_f21b68x",
                    "score": -8,
                    "created_utc": 1569870804.0,
                    "replies": [
                        {
                            "body": "Really now?\n\nOP doesn’t know anything. You don’t know anything. None of us know a damn thing. For all we know, social media could be spot on and she’s an angel and he’s a fucking douchebag. Or. She could be Satan’s Mistress and be a complete harpy hell-demon to live with and sucks his soul to stay young and vibrant - none of us know a thing.\n\nJudge an SR on its merits and leave it at that. Projecting anger at him (or her the OP) without knowing what’s real is wasted emotion.\n\nI feel your statement just came off as wickedly judgmental and projecting  - or did I miss something?",
                            "author": "SDRippington",
                            "id": "f21kx32",
                            "parent_id": "t1_f21d5nw",
                            "score": 18,
                            "created_utc": 1569873435.0,
                            "replies": [
                                {
                                    "body": "This! :)",
                                    "author": "captainIsBack4u",
                                    "id": "f21o8mq",
                                    "parent_id": "t1_f21kx32",
                                    "score": 3,
                                    "created_utc": 1569874609.0,
                                    "replies": []
                                },
                                {
                                    "body": "deleted  ^^^^^^^^^^^^^^^^0.3531  [^^^What ^^^is ^^^this?](https://pastebin.com/FcrFs94k/00714)",
                                    "author": null,
                                    "id": "f232sz3",
                                    "parent_id": "t1_f21kx32",
                                    "score": 3,
                                    "created_utc": 1569904094.0,
                                    "replies": [
                                        {
                                            "body": "So much YES to this!!! 👆🏻👏🏻",
                                            "author": null,
                                            "id": "f23vnn0",
                                            "parent_id": "t1_f232sz3",
                                            "score": 1,
                                            "created_utc": 1569938790.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "Cheating is wrong, PERIOD! Stop trying to make excuses for shitty behavior. Cheating is only ok for you men when YOU are the ones doing it, but not the ones being cheated on. Please quit being a hypocrite!",
                                    "author": null,
                                    "id": "f23vi7r",
                                    "parent_id": "t1_f21kx32",
                                    "score": 2,
                                    "created_utc": 1569938683.0,
                                    "replies": [
                                        {
                                            "body": "> Please quit being a hypocrite!\n\nExactly. This has been my entire point. Everyone in the bowl is a hypocrite by nature of this game itself. I've always said \"own your decision\". I've never said anything but.\n\n_\"Fucking for money is okay, but only under special, specific circumstances that fit my current sense of morality.\"_\n\nWhat. Ever. People are going to have sex with who they want to have sex with under whatever guise of \"willful blindness\" they choose that fits their sense of morality for the day. \n\nOne thing I know with absolute certainty? If it's not you they're having sex with and paying money for that privilege, it most certainly will be with someone else. Nothing hypocritical about that observation. Think about that the next time you collect your PPM.\n\nWe should all be careful of falling off our high horses. Bones could break.",
                                            "author": "SDRippington",
                                            "id": "f23zlmx",
                                            "parent_id": "t1_f23vi7r",
                                            "score": 1,
                                            "created_utc": 1569941502.0,
                                            "replies": [
                                                {
                                                    "body": "AAH, another cheater trying to justify his shitty behavior. Karma will get back at you though, and what you are doing to your wife will come back to you eventually. And boy, that pain will hurt!",
                                                    "author": null,
                                                    "id": "f24irlv",
                                                    "parent_id": "t1_f23zlmx",
                                                    "score": 1,
                                                    "created_utc": 1569953055.0,
                                                    "replies": [
                                                        {
                                                            "body": "Not only are you judgmental AF, you just assumed I’m still married and not already in the middle of an amicable divorce?\n\nTotally not surprised 😊😂😂\n\nKarma already HAS dear by blessing me with women that actually deeply care for me and my wants and desires.\n\nSo please, with all due respect, with sugar on top, go fuck yourself 😂",
                                                            "author": "SDRippington",
                                                            "id": "f24l998",
                                                            "parent_id": "t1_f24irlv",
                                                            "score": 2,
                                                            "created_utc": 1569954851.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "At 18 or 19 one doesnt have all the answers. Assuming here, but what if she went into it thinking the SDs are miserable in their marriages and she can help while being helped. Only to realize that SO looks perfect (from the outside atleast), and hence the post.\n\nAnd empathizing doesnt mean taking food out of your plate to feed others while you go hungry. All you have to have is a caring heart to relate to the hunger someone else feels.",
                            "author": "captainIsBack4u",
                            "id": "f21ik5j",
                            "parent_id": "t1_f21d5nw",
                            "score": 5,
                            "created_utc": 1569872647.0,
                            "replies": [
                                {
                                    "body": "deleted  ^^^^^^^^^^^^^^^^0.4561  [^^^What ^^^is ^^^this?](https://pastebin.com/FcrFs94k/26654)",
                                    "author": null,
                                    "id": "f232x4y",
                                    "parent_id": "t1_f21ik5j",
                                    "score": 1,
                                    "created_utc": 1569904205.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "f22ptux",
                            "parent_id": "t1_f21d5nw",
                            "score": 1,
                            "created_utc": 1569894105.0,
                            "replies": [
                                {
                                    "body": "Uh, she clearly knows the guy is married. What kind of question is that...? Lol",
                                    "author": null,
                                    "id": "f22rb7v",
                                    "parent_id": "t1_f22ptux",
                                    "score": -2,
                                    "created_utc": 1569895140.0,
                                    "replies": [
                                        {
                                            "body": "[deleted]",
                                            "author": null,
                                            "id": "f22s54v",
                                            "parent_id": "t1_f22rb7v",
                                            "score": 0,
                                            "created_utc": 1569895709.0,
                                            "replies": [
                                                {
                                                    "body": "deleted  ^^^^^^^^^^^^^^^^0.7950  [^^^What ^^^is ^^^this?](https://pastebin.com/FcrFs94k/10303)",
                                                    "author": null,
                                                    "id": "f232y8t",
                                                    "parent_id": "t1_f22s54v",
                                                    "score": 1,
                                                    "created_utc": 1569904234.0,
                                                    "replies": []
                                                },
                                                {
                                                    "body": "No it is not, because it takes 2 to cheat!",
                                                    "author": null,
                                                    "id": "f22z2l4",
                                                    "parent_id": "t1_f22s54v",
                                                    "score": -1,
                                                    "created_utc": 1569900751.0,
                                                    "replies": [
                                                        {
                                                            "body": "She’s not cheating. He is. Lmao.",
                                                            "author": "LaNouvelleSugar",
                                                            "id": "f23f9ev",
                                                            "parent_id": "t1_f22z2l4",
                                                            "score": 1,
                                                            "created_utc": 1569921432.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "She isn’t intentionally hurting anyone. The husband is. Are we blaming Op for her choices?",
                            "author": "LaNouvelleSugar",
                            "id": "f23f8iy",
                            "parent_id": "t1_f21d5nw",
                            "score": 1,
                            "created_utc": 1569921390.0,
                            "replies": []
                        },
                        {
                            "body": "You're the tool.  Who said the wife was hurt?",
                            "author": "nerojt",
                            "id": "f23k6mb",
                            "parent_id": "t1_f21d5nw",
                            "score": 0,
                            "created_utc": 1569928656.0,
                            "replies": [
                                {
                                    "body": "So, you are telling me that if and when the wife finds out her husband is a cheater she won’t be hurt. REALLY...??? I hope you are in that wife’s shoes someday, and I will be here waiting to hear about how happy you are that your spouse is cheating on you constantly behind your back! Quit being a hypocrite!!!\n\nPS: Not surprised to find out you are ALSO a cheater though! Typical...",
                                    "author": null,
                                    "id": "f23w77d",
                                    "parent_id": "t1_f23k6mb",
                                    "score": 1,
                                    "created_utc": 1569939177.0,
                                    "replies": [
                                        {
                                            "body": "I've never cheated. Also, the wife has not been hurt.",
                                            "author": "nerojt",
                                            "id": "f25q81m",
                                            "parent_id": "t1_f23w77d",
                                            "score": 2,
                                            "created_utc": 1569980971.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Men often cheat because THEY feel a deficit, something lacking within themselves.… It often has nothing to do with their wives. So they try to fill the void externally… And it never works, but they keep trying.  It’s very unfortunate, and they would do better to get some good therapy rather than inadvertently hurting the wife who probably loves them very much and has no clue about what’s going on.",
            "author": "RealEarthAngel",
            "id": "f20kylv",
            "parent_id": "t3_dbcdqj",
            "score": 97,
            "created_utc": 1569860888.0,
            "replies": [
                {
                    "body": "All of that could be true, or monogamy can be a flawed idea.",
                    "author": "WestSugarer",
                    "id": "f21fn7x",
                    "parent_id": "t1_f20kylv",
                    "score": 12,
                    "created_utc": 1569871675.0,
                    "replies": [
                        {
                            "body": "Not everyone is built to be monogamous and our society only promotes monogamy as the only way to live. Some people can mate forever to one person. Most can't 🤷‍♀️ we need to work on education and acceptance of various lifestyles and relationship choices. \nHim cheating on her behind her back has nothing to do with her or how great she is. Fuck, Jay Z fucked around Beyonce's back. If Beyonce can get cheated on, anyone can get cheated on 😂",
                            "author": "Devon_Bunny",
                            "id": "f21hs2l",
                            "parent_id": "t1_f21fn7x",
                            "score": 30,
                            "created_utc": 1569872382.0,
                            "replies": [
                                {
                                    "body": "> need to work on education and acceptance of various lifestyles and relationship choices.  -  like single",
                                    "author": "pinotandsugar",
                                    "id": "f226830",
                                    "parent_id": "t1_f21hs2l",
                                    "score": 11,
                                    "created_utc": 1569882740.0,
                                    "replies": [
                                        {
                                            "body": "Haha truth or poly 😘",
                                            "author": "theAliasOfAlias",
                                            "id": "f22qmzl",
                                            "parent_id": "t1_f226830",
                                            "score": 2,
                                            "created_utc": 1569894665.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "It’s true I wouldn’t say it. And it’s not either/or. The two are not mutually exclusive.",
                            "author": "RealEarthAngel",
                            "id": "f40cusg",
                            "parent_id": "t1_f21fn7x",
                            "score": 1,
                            "created_utc": 1571294090.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Men cheat because they cheat, deficit or not. To me that is no different than trying to decipher why women get into sugaring when 99% of the rest of the population is getting through their lives the hard way of living within their means and taking extra gigs to cough up rent money and pay down loans.",
                    "author": null,
                    "id": "f22yz8c",
                    "parent_id": "t1_f20kylv",
                    "score": -1,
                    "created_utc": 1569900672.0,
                    "replies": [
                        {
                            "body": "I’m not trying to decipher anything… I simply understand why a lot of men cheat.  People never do things for no reason. Men cheat for a reason and the reason is within them.\nAnd that has nothing to do with why women become SBs. Again, each person has their own reason.  Apples and oranges.",
                            "author": "RealEarthAngel",
                            "id": "f40cmw2",
                            "parent_id": "t1_f22yz8c",
                            "score": 1,
                            "created_utc": 1571293791.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Hope you were careful in your searches and won't pop up in her social media as a friend suggestion.",
            "author": "mike_o212",
            "id": "f20ebh7",
            "parent_id": "t3_dbcdqj",
            "score": 44,
            "created_utc": 1569858657.0,
            "replies": []
        },
        {
            "body": "Maybe he’s just a cheat. Period.",
            "author": "LaNouvelleSugar",
            "id": "f2137uq",
            "parent_id": "t3_dbcdqj",
            "score": 11,
            "created_utc": 1569867315.0,
            "replies": [
                {
                    "body": "And on the flip side, I find the irony endlessly amusing at the women that justify fucking older guys for money simply because the guy is single.\n\nSelective morality is funny AF especially with THIS crowd. 😂😂😂",
                    "author": "SDRippington",
                    "id": "f21lrmm",
                    "parent_id": "t1_f2137uq",
                    "score": 1,
                    "created_utc": 1569873723.0,
                    "replies": [
                        {
                            "body": "So...you’d rather a woman fucked an older guy who was married for money instead of an older guy who is single?",
                            "author": "LaNouvelleSugar",
                            "id": "f21mi43",
                            "parent_id": "t1_f21lrmm",
                            "score": 6,
                            "created_utc": 1569873975.0,
                            "replies": [
                                {
                                    "body": "Wow. You truly missed my point completely didn’t ya?",
                                    "author": "SDRippington",
                                    "id": "f21s4a7",
                                    "parent_id": "t1_f21mi43",
                                    "score": -2,
                                    "created_utc": 1569876070.0,
                                    "replies": [
                                        {
                                            "body": "I really did. Would you kindly explain?",
                                            "author": "LaNouvelleSugar",
                                            "id": "f21sdry",
                                            "parent_id": "t1_f21s4a7",
                                            "score": 4,
                                            "created_utc": 1569876173.0,
                                            "replies": [
                                                {
                                                    "body": "It seems that a few women here exercise selective morality enforcement with respect to societal “norms”\n\nMany women seem perfectly okay to fuck an older guy for money if he’s single, yet they throw shade on fucking an older guy for money if he’s married.\n\nThey don’t even consider the “for money” part really because they benefit. They only consider the “married” part because it’s a choice someone ELSE made and would in part, through some twisted sense of self, would make her feel “dirty” because he’s married - NOT that she’s fucking for cash.\n\nAnd one step further? I’ve known some SB’s that vehemently avoid fucking married OLDER guys but were more than okay to fuck the HOT young married guy for money cuz, well, his wife is obviously a bitch for not taking his gorgeous “D” for a ride, that poor, young, broken man.\n\nI’ve been on this forum (and in the bowl) long enough to see all sides of the selective morality dance. And it never changes. 😂\n\nEDIT: And the downvotes on this is AMAZING which only proves my point about all the butthurt snowflakes that cringe at the truth :)",
                                                    "author": "SDRippington",
                                                    "id": "f21ud7l",
                                                    "parent_id": "t1_f21sdry",
                                                    "score": -1,
                                                    "created_utc": 1569876899.0,
                                                    "replies": [
                                                        {
                                                            "body": "To be perfectly honest, Whether you’re fucking for money or for whatever other reason that’s people’s personal problems. No one here should be judgmental. At all.",
                                                            "author": "LaNouvelleSugar",
                                                            "id": "f23f76j",
                                                            "parent_id": "t1_f21ud7l",
                                                            "score": 1,
                                                            "created_utc": 1569921326.0,
                                                            "replies": [
                                                                {
                                                                    "body": "That’s my point.",
                                                                    "author": "SDRippington",
                                                                    "id": "f23iv4w",
                                                                    "parent_id": "t1_f23f76j",
                                                                    "score": 2,
                                                                    "created_utc": 1569927002.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "Whereas that might be your point, you do sound a bit judgmental yourself. Just letting you know",
                                                                            "author": "LaNouvelleSugar",
                                                                            "id": "f23jgpd",
                                                                            "parent_id": "t1_f23iv4w",
                                                                            "score": 1,
                                                                            "created_utc": 1569927778.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "Of course! Especially towards hypocritical people.\nThe irony is not lost on me.😂",
                                                                                    "author": "SDRippington",
                                                                                    "id": "f23jtvl",
                                                                                    "parent_id": "t1_f23jgpd",
                                                                                    "score": 1,
                                                                                    "created_utc": 1569928231.0,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I feel like I probably have a lot in common with the wife. My guess is that he's probably a very fun, charismatic guy who's also extremely selfish and entitled. And he's probably savvy enough to hide those parts of himself from you. That's the advantage of being in an arm's length pseudo-relationship instead of a marriage.",
            "author": "zinfandelightful",
            "id": "f20piwj",
            "parent_id": "t3_dbcdqj",
            "score": 16,
            "created_utc": 1569862448.0,
            "replies": []
        },
        {
            "body": "Monogamy in and of itself is not flawed. But not everyone is cut out for it.",
            "author": "RealEarthAngel",
            "id": "f21fv2h",
            "parent_id": "t3_dbcdqj",
            "score": 8,
            "created_utc": 1569871750.0,
            "replies": [
                {
                    "body": "In truth almost no one is cut out for it",
                    "author": "doctorcoolpop",
                    "id": "f21vqvt",
                    "parent_id": "t1_f21fv2h",
                    "score": -3,
                    "created_utc": 1569877413.0,
                    "replies": [
                        {
                            "body": "I’ve met enough people who actually are.",
                            "author": "RealEarthAngel",
                            "id": "f40ct11",
                            "parent_id": "t1_f21vqvt",
                            "score": 4,
                            "created_utc": 1571294024.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": ">How do you **know** what's going on (or really NOT going on lol) in their bedroom??\n\nThis, but also the rest of their life too. Many people say they love their family life - that's the required answer. Many people as successful as her (or presumably him) have no idea how to compromise or make a relationship work - doing things your partner likes, or even just having discussions about what they like - in the bedroom, in the kitchen, what to wear to go out, where to buy a house, whose parents to visit on holidays.\n\nAlso possible that she's as wonderful and perfect as you think (unlikely tho IMO) and he's just an a-hole. Or just incapable of connecting permanently and monogamously. Maybe the whole relationship is open and he just doesn't want to tell you that because people look at him weird when he tells you that.\n\nMake sure you get what you want out of the relationship (money, sex, emotional support, mentoring, etc) and don't focus on the rest too much. It's not your fault or your responsibility.",
            "author": "2fast-2curious",
            "id": "f204pvf",
            "parent_id": "t3_dbcdqj",
            "score": 15,
            "created_utc": 1569855249.0,
            "replies": [
                {
                    "body": "Your point about the open relationship may be true. My pot hangs out with me in public places, some are very close to his residence. Granted, it’s at night time, but still potentially visible to his colleagues and family. He even holds my hand so there’s no mistaking of our dynamic. So it could be that they have an open thing going on. Also hanging out at Friday and Saturday night with me makes me wonder what does he tell her (but I never asked because we’re just starting and I don’t want to be nosy). \n\nThe asshole possibility is low. I vetted him, he is an okay person.",
                    "author": "fannyhoney",
                    "id": "f205si1",
                    "parent_id": "t1_f204pvf",
                    "score": 11,
                    "created_utc": 1569855638.0,
                    "replies": [
                        {
                            "body": "Your description of her very closely mirrors a woman I worked for in the past - crazy successful, beautiful, amazing philanthropist, put on a show about helping children, relatively intelligent, ran in the “right,” highly noticeable and affluent circles, had the “perfect family.”\nHer “catch”?  She was a raging, hateful bitch!  Seriously. No one in her life, from the mailman, to her assistant (me), and sadly also to her super sweet, phenomenally successful husband, was beyond the grasp of her wrath.  It was the best paying job, both monetarily and benefits-wise, that I’ve ever had and I high-tailed it out of there in less than 3 months because I have a spine and a mouth, and a snarky attitude at times, and she insisted on testing everyone around her, every day.  She and her husband put on a VERY believable charade, but in reality he’d been diddling his secretary for all of time (hey at least he stuck to the same woman, who was age-appropriate - they were in their late l-70’s lol), were in separate rooms 98% of the time, and only exchanged words via phone and hand-written notes. Granted it was relatively amicable, and I’m sure he had his own faults that contributed to the shit-show.  The thing that I did always appreciate though was that regardless of how things were, they still constantly told one another how much they loved, respected, and appreciated one another.  And it wasn’t for show.  At least it didn’t seem that way.  The son on the other hand - WHEW!  Grumpy thing he was, but completely understandable given the environment. \n\nNot saying that that is definitely, or even likely, the case with your subject here, but its very common.  Some people stay busy and paint a pretty picture on the outside to cover up the inside. Some do it out of insecurity, some because they have a genuine passion for every last thing that they’re involved in (they are highly fortunate, though its not beyond anyone’s grasp!). A LOT do it to be “better than,” to keep up with or out-do someone else, or just because they’re bored. \n\nI saw that you stated that you “vetted” him as well. What were/are your resources for doing so?   (I am curious as I have never really gone off of anything aside from my gut feeling, and I can honestly say it hasn’t steered me wrong as of yet). Again, words and photos can paint a hell of a picture, and as a society highly based on aesthetic and status, it is easily bought into.  Unfortunately, more often than not it is all a facade.   I’d say the “asshole” scenario is a 50/50 chance. \n\nSorry for the novel :) ive been on here for EVER, and have never commented on anything lol\n\nEDIT:  Forgot to include... you said you thought “how do I compare.”  Don’t be hard on yourself.  You are just as capable of attaining the very same things she has. But remember - he is looking elsewhere because he wants someone/something COMPLETELY DIFFERENT.  ;)",
                            "author": null,
                            "id": "f21hfsy",
                            "parent_id": "t1_f205si1",
                            "score": 5,
                            "created_utc": 1569872268.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "f23npjw",
                                    "parent_id": "t1_f21hfsy",
                                    "score": 2,
                                    "created_utc": 1569932385.0,
                                    "replies": [
                                        {
                                            "body": "Hey I’m all about encouragement!  :) we are all smart, and obviously motivated.  If you (or anyone) ever needs to talk or whatever, I am always here!",
                                            "author": null,
                                            "id": "f23tru7",
                                            "parent_id": "t1_f23npjw",
                                            "score": 1,
                                            "created_utc": 1569937415.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "deleted  ^^^^^^^^^^^^^^^^0.3155  [^^^What ^^^is ^^^this?](https://pastebin.com/FcrFs94k/01917)",
                            "author": null,
                            "id": "f232zsp",
                            "parent_id": "t1_f205si1",
                            "score": 1,
                            "created_utc": 1569904275.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "You saw social media, you think that's an accurate representation of a person?",
            "author": "CentralUSGal",
            "id": "f204w0u",
            "parent_id": "t3_dbcdqj",
            "score": 36,
            "created_utc": 1569855315.0,
            "replies": [
                {
                    "body": "I looked her up all over the internet. She has made tons of science contributions and is super cute. I don’t claim to know it all. But I just don’t understand the why in it all. And I can’t ask my POT because we’re new to one another and I don’t want to be intrusive.",
                    "author": "fannyhoney",
                    "id": "f206vhu",
                    "parent_id": "t1_f204w0u",
                    "score": 27,
                    "created_utc": 1569856020.0,
                    "replies": [
                        {
                            "body": "I know you're not saying this, but you seem to be implying if she were a high school grad working as say a waitress that you'd understand him cheating on her more?",
                            "author": "tenmillionplus",
                            "id": "f20n11z",
                            "parent_id": "t1_f206vhu",
                            "score": 10,
                            "created_utc": 1569861590.0,
                            "replies": [
                                {
                                    "body": "Women tend to value education highly in their Male partners while it doesn't really matter the other way around.\n\nIt's not surprising she'd think that because as a women, she'd value if her guy was a researcher.",
                                    "author": "DarkMatter731",
                                    "id": "f20z3es",
                                    "parent_id": "t1_f20n11z",
                                    "score": 5,
                                    "created_utc": 1569865814.0,
                                    "replies": [
                                        {
                                            "body": ">Women tend to value education highly in their Male partners while it doesn't really matter the other way around.\n\nI disagree. Educated men prefer educated women for wives. When was the last time you heard of a doctor marrying a barista? People generally prefer to marry within their class.",
                                            "author": null,
                                            "id": "f22f83t",
                                            "parent_id": "t1_f20z3es",
                                            "score": 11,
                                            "created_utc": 1569887860.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "Yeah I always laugh at these SB profiles that state how many languages they speak ... wow does she know what guys want 🤣",
                                            "author": "lookingforlaughter",
                                            "id": "f23frhx",
                                            "parent_id": "t1_f20z3es",
                                            "score": 3,
                                            "created_utc": 1569922293.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "Pot SBs ask me at every M&G why I am on SA. I am happy when they do, because I know it's on their minds, and want to clear the air. If they don't like my response, we both move on, and if they do, the issue is out of the way.",
                            "author": null,
                            "id": "f494rcp",
                            "parent_id": "t1_f206vhu",
                            "score": 2,
                            "created_utc": 1571456851.0,
                            "replies": []
                        },
                        {
                            "body": ">I looked her up all over the internet...and I don’t want to be intrusive.\n\nThe thing is: you already are intrusive. He just doesn't know it. Just make sure he never finds out that you're researching his wife because if it were me, I would block you immediately.",
                            "author": "AusterlitzSD",
                            "id": "f20ul6a",
                            "parent_id": "t1_f206vhu",
                            "score": 7,
                            "created_utc": 1569864261.0,
                            "replies": [
                                {
                                    "body": "Upvote. Point to note: SB should never be poking nose into SD's home affair.",
                                    "author": "JELxin",
                                    "id": "f211rr8",
                                    "parent_id": "t1_f20ul6a",
                                    "score": 14,
                                    "created_utc": 1569866788.0,
                                    "replies": [
                                        {
                                            "body": "Always the classy SB JELxin",
                                            "author": "AusterlitzSD",
                                            "id": "f21khr4",
                                            "parent_id": "t1_f211rr8",
                                            "score": -1,
                                            "created_utc": 1569873289.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "There shouldn't only be one reason for this action.  What about curiousity?  Which is related to taking an interest in the other party, whcih is what we SDs often complain about SBs lacking!",
                                    "author": "nycballetlover",
                                    "id": "f24wxbv",
                                    "parent_id": "t1_f20ul6a",
                                    "score": 2,
                                    "created_utc": 1569961786.0,
                                    "replies": [
                                        {
                                            "body": "Heh. I had one SB that I researched. She had an alt Intstagram profile of her at the firing range, and discussing competition pistols. Apparently some of her more \"liberal\" friends at college would have lost their shit if they knew.\n\nSo when she came by for our second intimate date I smiled and mentioned I had researched her a little and she was like \"Uh oh. What did you find out?\" I went \"here\", opened a fingerprint lock box sitting on the counter, pulled out my compensated and tricked out .45, plopped it on the counter in front of her and said \"strip it.\" \n\nShe smiled wider than I have ever seen a woman smile and proceeded to tear it down with practiced skill.\n\n(no, I didn't have rounds in the magazine. I wasn't stupid.) LMAO!\n\nAnd yes we're still good friends. But the little shit kept my damn pistol. I offered her that or a laptop later as a gift. She chose the pistol. She's a lifelong keeper. :-)",
                                            "author": "SDRippington",
                                            "id": "f2775na",
                                            "parent_id": "t1_f24wxbv",
                                            "score": 1,
                                            "created_utc": 1570032006.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "I’m an SB and if I was a married SD and found this out I would be pissed the hell off. And this guy is a POT meaning you don’t even really know him? I hope she is careful with this info",
                                    "author": null,
                                    "id": "f21eoc7",
                                    "parent_id": "t1_f20ul6a",
                                    "score": 3,
                                    "created_utc": 1569871337.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Exactly,   That’s a carefully crafted persona.  She sounds very busy which means her husband is likely way down the list of her priorities.",
                    "author": "LotBuilder",
                    "id": "f206lkw",
                    "parent_id": "t1_f204w0u",
                    "score": 17,
                    "created_utc": 1569855925.0,
                    "replies": [
                        {
                            "body": "Lived this. Ex wife was also a scientist, physicist at NASA. Not exactly a part time gig.",
                            "author": "LoftDaddy",
                            "id": "f22f6pk",
                            "parent_id": "t1_f206lkw",
                            "score": 4,
                            "created_utc": 1569887837.0,
                            "replies": [
                                {
                                    "body": "Yeah,  you were an accessory on par with a handbag.  My ex is only an interior designer but her online persona would make her look like the female version of the Dos Equis guy.  I funded that fraud for a long time.",
                                    "author": "LotBuilder",
                                    "id": "f22gg87",
                                    "parent_id": "t1_f22f6pk",
                                    "score": 4,
                                    "created_utc": 1569888527.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "This \\^",
                            "author": "DreamingLurker",
                            "id": "f20kkjc",
                            "parent_id": "t1_f206lkw",
                            "score": 0,
                            "created_utc": 1569860757.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "🤦‍♀️",
                    "author": null,
                    "id": "f21ebig",
                    "parent_id": "t1_f204w0u",
                    "score": 1,
                    "created_utc": 1569871213.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Just a thought, are you looking into this more so for yourself?  I mean if you ever choose to get married, are you worried this will happen to you?  \n\nOr are you looking for tips on what she did wrong so you don't make the same mistakes and make sure this doesn't happen to you?\n\nIn the end he did so because he can.  People don't cheat because of some big reason.  They simply do it because they can.  And those who they cheat with don't care either.  \n\nYou know what he is doing, yet you are with him.  Let me guess the reasoning is he would do it anyway so might as well be with me and get what I can out of it, right?\n\nIf you want to stand on some moral high ground you wouldn't do this with him.  Morality has no place in sugaring.",
            "author": "SDsugarthrowaway",
            "id": "f20mff7",
            "parent_id": "t3_dbcdqj",
            "score": 19,
            "created_utc": 1569861383.0,
            "replies": [
                {
                    "body": "It’s because they can.\n\nI think it was Wall Street 2.  Not the best movie.  But they asked the one guy what his number was (who was suppose to be the CEO of essentially Goldman in the movie) and his answer was more.  Why did he trade in the side when he was making 50 a year.  Because his drive was simply for more.  Most of society was based on that adrenaline.\n\nSame thing here.  What’s better than a happy cute educated wife....having a happy cute educated wife and a 20 a year old mistress.",
                    "author": "chitraders",
                    "id": "f22asuj",
                    "parent_id": "t1_f20mff7",
                    "score": 7,
                    "created_utc": 1569885522.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Why guys cheat have little to do with how wonderful (or not) they partner is",
            "author": "jonscrambler",
            "id": "f20p4lh",
            "parent_id": "t3_dbcdqj",
            "score": 12,
            "created_utc": 1569862310.0,
            "replies": []
        },
        {
            "body": "My (ex)SD’s wife, now ex wife but they were divorcing when we met, was so pretty, kind, and looked like a great mom from her public Instagram. While we were together I heard and saw all about the attempts to buy the kids love with name brand anything (still a little salty a 13 year old was leaving her Gucci shoes haphazard around the house when I would have treasured a pair like a first born kid), send him really mean messages, and just attempt to bully him constantly. Social media ain’t all it’s cracked up to be, and is by no means a reflection of who people truly are. Don’t feel bad for her, maybe she has a side piece too, maybe she doesn’t like sex anymore and it doesn’t bother her enough to divorce knowing he’s likely doing it with someone else. Worry about you honey, there’s not too many good POTs out there and it’d be a shame to pass one up because you were worried about his wife",
            "author": "unobligatedvirgo",
            "id": "f20gn3v",
            "parent_id": "t3_dbcdqj",
            "score": 14,
            "created_utc": 1569859467.0,
            "replies": [
                {
                    "body": "I love this and wish I could upvote 10 more times",
                    "author": null,
                    "id": "f21fno9",
                    "parent_id": "t1_f20gn3v",
                    "score": 3,
                    "created_utc": 1569871680.0,
                    "replies": [
                        {
                            "body": "Aww thanks 😙",
                            "author": "unobligatedvirgo",
                            "id": "f22661c",
                            "parent_id": "t1_f21fno9",
                            "score": -1,
                            "created_utc": 1569882699.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Some people just can't appreciate what they already have.",
            "author": null,
            "id": "f22fn82",
            "parent_id": "t3_dbcdqj",
            "score": 5,
            "created_utc": 1569888085.0,
            "replies": []
        },
        {
            "body": "Men cheat, all the time. Took me two marriages to realize no matter how much they love you, they will run after the cute 20 year old who gives them attention. It's also why I'll never get married again. If you want to fuck around , fine but don't come at me with marriage vows  if you can't stay faithful.",
            "author": "nellybelle1984",
            "id": "f22yxdd",
            "parent_id": "t3_dbcdqj",
            "score": 5,
            "created_utc": 1569900629.0,
            "replies": []
        },
        {
            "body": "My experience with women,  she probably has a clue.  But if she doesn't.  Its not on you.",
            "author": "LifeIsShortImNot",
            "id": "f203hg3",
            "parent_id": "t3_dbcdqj",
            "score": 15,
            "created_utc": 1569854785.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "f2046x4",
                    "parent_id": "t1_f203hg3",
                    "score": 22,
                    "created_utc": 1569855050.0,
                    "replies": [
                        {
                            "body": "Yeah she seems like she’s sharp enough to know something already. If not, she must be super naive which makes me feel bad.",
                            "author": "fannyhoney",
                            "id": "f207mq8",
                            "parent_id": "t1_f2046x4",
                            "score": 7,
                            "created_utc": 1569856282.0,
                            "replies": [
                                {
                                    "body": "You feel bad is she is clueless about it, but not bad if she knew?",
                                    "author": "SDsugarthrowaway",
                                    "id": "f20lo5j",
                                    "parent_id": "t1_f207mq8",
                                    "score": 7,
                                    "created_utc": 1569861124.0,
                                    "replies": []
                                },
                                {
                                    "body": "She isn’t naive. She has made a choice. \n\nAll women know what a man needs. When she isn’t providing it, he is either a miserable fuck or she is choosing to not care about how he is getting his needs met. \n\nIf I suddenly stopped paying all the house bills, but there was always food in the kitchen... I guess I could call it magic.",
                                    "author": "LoftDaddy",
                                    "id": "f22fd9r",
                                    "parent_id": "t1_f207mq8",
                                    "score": -1,
                                    "created_utc": 1569887947.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Yes, then there is this. If the wife really is in tune with her hubby she has already noticed the change in general daily “mood” and can probably but two and two together. Who even knows if the wife even cares if he is cheating, or, she could be cheating herself🤦‍♀️ she could be on the sugar momma site for all we (or he) knows🤣",
                    "author": null,
                    "id": "f21f7ja",
                    "parent_id": "t1_f203hg3",
                    "score": 1,
                    "created_utc": 1569871523.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "In all likelihood the answer is nothing is wrong with her.  In my years I have learned two fundamental truths that I believe apply to this situation.  1. Show me the most accomplished, attractive woman in the world, and I will show you a guy who is tired of her.  2. There is only one thing better to men than a vagina.  That is a new vagina.  Some men can resist this impulse. The ones who don’t have to, don’t.  It may be crude, but it’s the truth.",
            "author": "nhceo",
            "id": "f21n7ia",
            "parent_id": "t3_dbcdqj",
            "score": 7,
            "created_utc": 1569874243.0,
            "replies": []
        },
        {
            "body": "How do you **know** what's going on (or really NOT going on lol) in their bedroom??",
            "author": "DreamingLurker",
            "id": "f2036sf",
            "parent_id": "t3_dbcdqj",
            "score": 16,
            "created_utc": 1569854632.0,
            "replies": [
                {
                    "body": "I don’t claim to know anything about that. But he never mentioned anything bad going (or not going) on so there’s that. And my thinking is, she’s wonderful in general (I haven’t factored sex in but I assume she’s a good person to him overall, which is something he hinted at).",
                    "author": "fannyhoney",
                    "id": "f204m2l",
                    "parent_id": "t1_f2036sf",
                    "score": 10,
                    "created_utc": 1569855209.0,
                    "replies": [
                        {
                            "body": "He would... a lot of guys are like that. They have nothing bad to say even about the worst women. Especially if they have a child with her.\n\nIf he's on SA then something is missing.",
                            "author": "DreamingLurker",
                            "id": "f2058eh",
                            "parent_id": "t1_f204m2l",
                            "score": 13,
                            "created_utc": 1569855434.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "f20wt8e",
            "parent_id": "t3_dbcdqj",
            "score": 8,
            "created_utc": 1569865033.0,
            "replies": [
                {
                    "body": "In this story I’m hoping she is a Sugar Momma",
                    "author": null,
                    "id": "f21fhz5",
                    "parent_id": "t1_f20wt8e",
                    "score": 4,
                    "created_utc": 1569871624.0,
                    "replies": []
                }
            ]
        },
        {
            "body": ">She is pretty, cute, mom of his  child. She’s a researcher and does extremely meaningful work for  society, super productive and successful, her track record blew my mind.  She also looks outdoorsy and fun. I looked her up and I genuinely  admired her and thought I don’t compare.  \n>  \n>My  pot has been seeing girls behind her back for 4 years at least. She has  no clue. I don’t understand why and how someone would cheat on a woman  like that. I just don’t get it. \n\nShe's so great she makes him feel emasculated. She doesn't make him feel \"like a man\" like younger women in need of cash do. Pretty sad how he's willing to risk destroying his marriage and embarrassing his family for sex.",
            "author": null,
            "id": "f21jy38",
            "parent_id": "t3_dbcdqj",
            "score": 9,
            "created_utc": 1569873108.0,
            "replies": []
        },
        {
            "body": "\"Show me a beautiful woman, and I'll show you a man who's tired of fucking her.\"",
            "author": null,
            "id": "f20fsvp",
            "parent_id": "t3_dbcdqj",
            "score": 12,
            "created_utc": 1569859160.0,
            "replies": [
                {
                    "body": "Lol. Alright 😂",
                    "author": "fannyhoney",
                    "id": "f20jxyy",
                    "parent_id": "t1_f20fsvp",
                    "score": 5,
                    "created_utc": 1569860548.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Maybe he just really get turned on by 20 year olds.",
            "author": null,
            "id": "f202yjz",
            "parent_id": "t3_dbcdqj",
            "score": 11,
            "created_utc": 1569854515.0,
            "replies": [
                {
                    "body": "Possibly.",
                    "author": "fannyhoney",
                    "id": "f207s1o",
                    "parent_id": "t1_f202yjz",
                    "score": 7,
                    "created_utc": 1569856333.0,
                    "replies": []
                },
                {
                    "body": "Very probable!",
                    "author": "AusterlitzSD",
                    "id": "f20tu23",
                    "parent_id": "t1_f202yjz",
                    "score": -1,
                    "created_utc": 1569863997.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "They lack empathy and they are not connected to their soul. Empath men are rare in the bowl.",
            "author": "Throwaway9473ll",
            "id": "f21fvzz",
            "parent_id": "t3_dbcdqj",
            "score": 5,
            "created_utc": 1569871757.0,
            "replies": []
        },
        {
            "body": "If she's a successful, productive scientist, she is likely putting in 60+ hours a week and even when she's home, she is likely working/writing grants or papers/analyzing data etc.\n\nSo my guess is dead bedroom/neglect/not enough intimacy",
            "author": "Casual_DM",
            "id": "f217dtn",
            "parent_id": "t3_dbcdqj",
            "score": 5,
            "created_utc": 1569868823.0,
            "replies": [
                {
                    "body": "Wtf is this trash ?? A partner male or female is capable of a healthy bedroom with a hectic career.",
                    "author": "Kitoko30",
                    "id": "f22k01r",
                    "parent_id": "t1_f217dtn",
                    "score": 4,
                    "created_utc": 1569890680.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Women often fall into the fallacy that if a man has a smart, lovely and enticing woman, he has no reason to look elsewhere, so...what did SHE do? What could be wrong? What is missing? What's wrong with HIM? \n\nNothing at all. \n\nHe likes variety or the thrill of a new woman or attention of someone who only see a part of him..\n\nMarriage is a lot more than the feelings that get one up to to ceremony. It is a lot more effort than many expect and for some, they need an outlet. Thus--other bed partners.\n\nHe is looking for SR to make sure he has (fingers crossed) discretion and silence. \n\nDoesn't mean he and she are fighting, are incompatible in bed, or whatever.\n\nIt is his need for another woman that drives him along.\n\nThat's all.\n\nIf you are wondering if you were an accomplished dynamic woman as she is...would you get cheated on, too?\n\nPossibly. \n\nIt is always up to the other person to keep their vow. You cannot make a man not cheat anymore than you can push the moon a bit over to the right in the sky.\n\nDon't overthink. Just either keep on with it or deal seriously only with the unmarried guys.",
            "author": "SpentHis_MilfMoney",
            "id": "f23zi1g",
            "parent_id": "t3_dbcdqj",
            "score": 2,
            "created_utc": 1569941434.0,
            "replies": []
        },
        {
            "body": "It's not cheating if the only sex he's getting is from outside his marriage. And its not a marriage if hes not getting any from his wife. \n\nDead bedroom is a major issue most men/women dont talk about.  A few of my closest friends have confessed this frustration and it all makes sense now. Every thing looks picture perfect on the outside.",
            "author": "joergeie1",
            "id": "f246c1a",
            "parent_id": "t3_dbcdqj",
            "score": 2,
            "created_utc": 1569945682.0,
            "replies": []
        },
        {
            "body": "Not sure why everyone is down voting you so intensely.  I share the same sentiment whenever I'm sleuthing on married POTs. Definitely have a bit of guilt associated with it, but I guess cognitive dissonance can be pretty useful in these situations. It's astounding sometimes how highly some POTs/SDs speak of their wife and how much they love her, but then do something that would probably destroy her if she found out.",
            "author": "--lilith",
            "id": "f20kuum",
            "parent_id": "t3_dbcdqj",
            "score": 7,
            "created_utc": 1569860855.0,
            "replies": [
                {
                    "body": "Thank you for the insight. I have some guilt too and I make an effort to ignore it. On a separate note, you sound pretty cool and smart, I think we would make great friends if you lived where I do.",
                    "author": "fannyhoney",
                    "id": "f20lwrg",
                    "parent_id": "t1_f20kuum",
                    "score": 8,
                    "created_utc": 1569861206.0,
                    "replies": [
                        {
                            "body": "Not a problem! I'm sorry for the amount of negativity being thrown your way on this thread - it's definitely something that us SBs have to deal with in the bowl. I hope your POT becomes your SD and you get the arrangement that you want x",
                            "author": "--lilith",
                            "id": "f22115v",
                            "parent_id": "t1_f20lwrg",
                            "score": 4,
                            "created_utc": 1569879734.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Most of these women already know. It doesn't \"destroy\" them lol. It's just something they turn a blind eye to so they can keep 100% of his $$$$$ and resources in their lives.\n\nTrophy wives are a lot more saavy than SBs when it comes to obtaining and retaining wealth. They're in for the long haul Sugar position.\n\nAnd just like SBs have to \"tolerate\" a lot from SDs for a little money ... trophy wives have to tolerate even more because they **get** more.",
                    "author": "DreamingLurker",
                    "id": "f20mwug",
                    "parent_id": "t1_f20kuum",
                    "score": 7,
                    "created_utc": 1569861549.0,
                    "replies": [
                        {
                            "body": "👀👀👀👀",
                            "author": "windwinter",
                            "id": "f21xxri",
                            "parent_id": "t1_f20mwug",
                            "score": 1,
                            "created_utc": 1569878249.0,
                            "replies": [
                                {
                                    "body": "👂👂👂👂",
                                    "author": "DreamingLurker",
                                    "id": "f22mh5r",
                                    "parent_id": "t1_f21xxri",
                                    "score": 1,
                                    "created_utc": 1569892015.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "> I’m being downvoted left and right and I wanted to say please understand I’m asking out of curiosity. I’m not making any ethical judgment on any lifestyle. I’m part of it myself.\n\nI think it's part of the unwritten rules that you don't pry into someone else's life here. Imagine your reaction if he looked up your parents/siblings and then asked you about it? \"Oh you have a great dad why do you seemingly have daddy issues, and looks like he's well off to provide for you why do you need to do this for money?\"\n\nAt best it's moral grey area in this whole situation that we all turn a blind eye too, once you get past this and actually look into the situation it makes it all the more real. I'm sure married guys and girls involved with married guys are all shivering at this and things became that much more real rather than this built up fantasy life they're in now.",
            "author": "tenmillionplus",
            "id": "f20cw8h",
            "parent_id": "t3_dbcdqj",
            "score": 8,
            "created_utc": 1569858180.0,
            "replies": [
                {
                    "body": "This! Very well said. No one likes a snoop. Being judgmental in the bowl ( on either side) is the biggest paradox that I have noted and usually ends up affecting the person judging more than anyone else.",
                    "author": "supportiveceo",
                    "id": "f20p2ez",
                    "parent_id": "t1_f20cw8h",
                    "score": 4,
                    "created_utc": 1569862289.0,
                    "replies": []
                },
                {
                    "body": "Great answer!",
                    "author": "AusterlitzSD",
                    "id": "f20tslo",
                    "parent_id": "t1_f20cw8h",
                    "score": 2,
                    "created_utc": 1569863980.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Some guys (and girls) just don't want to eat the same meal every night, especially if the meal is only available weekly or even monthly/worse and want to mix in fried chicken with their sushi/filet.",
            "author": "tenmillionplus",
            "id": "f204nc5",
            "parent_id": "t3_dbcdqj",
            "score": 2,
            "created_utc": 1569855223.0,
            "replies": []
        },
        {
            "body": "Speaking from experience here.  Wife is either bad in bed or not interested in sex any more.  Look up dead bedrooms on Google.  Doesn't like to kiss, don't like fooling around, etc.  Grabbing her titty gets a 'hey stop that' in response.  Complete 180 degrees from the honeymoon phase.  After a few tries, we just don't bother any more.",
            "author": "lcsugar",
            "id": "f20lly5",
            "parent_id": "t3_dbcdqj",
            "score": 3,
            "created_utc": 1569861103.0,
            "replies": [
                {
                    "body": "You don’t have to go to Google, Reddit has a huge dead bedroom following.",
                    "author": "SDforreal",
                    "id": "f20n9mo",
                    "parent_id": "t1_f20lly5",
                    "score": 2,
                    "created_utc": 1569861676.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Two reasons assuming no hidden conflicts:    \n\n1)Some men are addicted to sex and the variety of different partners   \n2) Stale bedroom.Just because you love and admire someone doesn't mean the sexual excitement is still there.",
            "author": "GSSD",
            "id": "f2053k3",
            "parent_id": "t3_dbcdqj",
            "score": 2,
            "created_utc": 1569855384.0,
            "replies": []
        },
        {
            "body": "Why would a man cheat on his wife if she is so wonderful, you ask? Let's see:\n\n1. Variety. He might feel the need to be with different women. Wife can't be another person.\n2. Time effect. Familiarity takes some of the fun away that only new relationship can bring back.\n3. The Chase. Many men like the thrill of \"conquering\" a new woman. It makes us feel powerful in some way.\n\nI could go on with other reasons that have nothing to do with the wife per se. It might be that she's not as great as you think, but it's also possible that she is, but your POT still feels the need to jump the fence.",
            "author": "AusterlitzSD",
            "id": "f20wm8k",
            "parent_id": "t3_dbcdqj",
            "score": 2,
            "created_utc": 1569864966.0,
            "replies": []
        },
        {
            "body": "Men can separate love and intimacy.   He may still be in love with his wife, but doesn't get his physical needs met.  Rather then divorce her, he can remain emotionally loyal while satisfying his sexual needs outside of the marriage.",
            "author": "willfromvb",
            "id": "f20q9n7",
            "parent_id": "t3_dbcdqj",
            "score": 2,
            "created_utc": 1569862707.0,
            "replies": []
        },
        {
            "body": "It's not really that hard to understand.   Say you love (insert your fav food here).  While you love it, can you have it everyday for the rest of your life?  No, you need variety once in a while.  \n\nAnd even if you could withstand having the same food everyday for the rest of your life...\nSay you love grapes, but your grapes been sitting in the fridge for 2 weeks/months/years/decades, while there are fresh grapes in the market that you can afford... very tempting to buy and eat the fresh grapes.",
            "author": "iamjusthonest",
            "id": "f21d2it",
            "parent_id": "t3_dbcdqj",
            "score": 1,
            "created_utc": 1569870774.0,
            "replies": [
                {
                    "body": "Your first statement? Yes. Sushi. One meal every day for the rest of my life. Easily. \n\nAnd if I eat grapes in my fridge that have desiccated and become a science experiment? I have emotional issues beyond not buying fresh grapes 😂\n\nI do get your point though. Just being a smart ass 😂",
                    "author": "SDRippington",
                    "id": "f21oabb",
                    "parent_id": "t1_f21d2it",
                    "score": 2,
                    "created_utc": 1569874627.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "He’s cheating because there are girls like you willing to take his $ and help him with that, basically.",
            "author": null,
            "id": "f21cxxn",
            "parent_id": "t3_dbcdqj",
            "score": 3,
            "created_utc": 1569870730.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "f21tyyt",
                    "parent_id": "t1_f21cxxn",
                    "score": 4,
                    "created_utc": 1569876757.0,
                    "replies": [
                        {
                            "body": "I’m a SB too, but I don’t deal with married men. I put myself in their spouses’ shoes, and since I’d hate if that ever happened to me I don’t allow myself to be used as a tool by cheating husbands.\nOne doesn’t have to accept and be ok with what every single SD does to be in the bowl. You know that, right...?",
                            "author": null,
                            "id": "f2227r1",
                            "parent_id": "t1_f21tyyt",
                            "score": 1,
                            "created_utc": 1569880387.0,
                            "replies": [
                                {
                                    "body": "I admire you! 🥰",
                                    "author": "absthaw",
                                    "id": "fkxck23",
                                    "parent_id": "t1_f2227r1",
                                    "score": 2,
                                    "created_utc": 1584625033.0,
                                    "replies": []
                                },
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "f227sxt",
                                    "parent_id": "t1_f2227r1",
                                    "score": 2,
                                    "created_utc": 1569883728.0,
                                    "replies": [
                                        {
                                            "body": "I state in my profile that I don’t deal with married men. Also, they have very limited schedule and so much to hide that it isn’t worth the risk for them to have to lie and trick 2 different women on a daily basis. So, NOT a dream. Just being practical and objective!\n\nAlso, I’m doing my part in stating that I don’t date married men, but I’m not responsible for grown ass men lying about their lives AND cheating. I am responsible for doing MY part though, and I will continue doing it to the best of my abilities!",
                                            "author": null,
                                            "id": "f228zev",
                                            "parent_id": "t1_f227sxt",
                                            "score": -1,
                                            "created_utc": 1569884424.0,
                                            "replies": [
                                                {
                                                    "body": "[deleted]",
                                                    "author": null,
                                                    "id": "f23i67s",
                                                    "parent_id": "t1_f228zev",
                                                    "score": 2,
                                                    "created_utc": 1569926060.0,
                                                    "replies": [
                                                        {
                                                            "body": "Like I said, I have a conscience, and I am responsible for my actions only, and not other people’s.\n\nI will not allow people choosing to hurt and deceive others to influence my behavior. I know right from wrong and that won’t change just because so many other people are ok with hurting their loved ones and living a lie.",
                                                            "author": null,
                                                            "id": "f23w0d0",
                                                            "parent_id": "t1_f23i67s",
                                                            "score": 1,
                                                            "created_utc": 1569939044.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "No, he's cheating because he wants to.",
                    "author": "nerojt",
                    "id": "f23k8vt",
                    "parent_id": "t1_f21cxxn",
                    "score": 2,
                    "created_utc": 1569928729.0,
                    "replies": []
                }
            ]
        },
        {
            "body": ">I don’t understand why and how someone would cheat on a woman like that. I just don’t get it. He said he would not change a thing about his life with her and that he loves his family as it is. Why would he be so committed to SA? Why cheat on such women?\n\nImagine your favorite food, and then imagine the best version of that food you've ever eaten anywhere.  You love it, right?  You wouldn't change a thing about it.  But that still doesn't stop you from wanting to enjoy other foods too.\n\nThat Whitney Houston song \"I'm Every Woman\" always struck me as a woman deluding herself.  No woman, no matter how great, can be every woman that a man wants.  The desire for a variety of women is always there and it can never be satiated, but it doesn't stop us from wanting to try.\n\nSo I hope that explains why he'd want to cheat on her.  \n\nWhy he'd actually do it is a different thing.  When I've been in monogamous relationships, I've always wanted other women too, but have remained faithful because the thought of the pain it would cause to the woman I cared about if she caught me was not worth the risk.  His assessment of that risk/reward is different than mine and I do judge him for it.  Also, he swore a vow to her, in front of their friends and family, and I judge him for breaking that, too.  Unless they've discussed it and she's ok with him doing this, of course.",
            "author": "perv_throaway",
            "id": "f22w80c",
            "parent_id": "t3_dbcdqj",
            "score": 2,
            "created_utc": 1569898580.0,
            "replies": [
                {
                    "body": "> Why he'd actually do it is a different thing. When I've been in monogamous relationships, I've always wanted other women too, but have remained faithful because the thought of the pain it would cause to the woman I cared about if she caught me was not worth the risk. His assessment of that risk/reward is different than mine and I do judge him for it. Also, he swore a vow to her, in front of their friends and family, and I judge him for breaking that, too. Unless they've discussed it and she's ok with him doing this, of course.\n\nI think this is a pretty reasonable take. To be honest, I kind of wish the potential pain + vows part would get mentioned more often.",
                    "author": "sugarfatty",
                    "id": "f234zsn",
                    "parent_id": "t1_f22w80c",
                    "score": 2,
                    "created_utc": 1569906308.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "No one liked my answer last time, but I stand by it:\n#\nImagine you had an eating disorder. Everyone else around you can eat normal quantities of food, but you just crave more. When others say \"no thanks,\" your whole body is electric to keep going. Problem is, if anyone ever found out you eat the way you do, everyone would hate you. You would lose your kids. People would tell you that you make poor dietary choices. But to you, it doesn't affect your family, work, or anything. You can eat and make everyone happy, as long as they don't know. Some days, you wake up, and you really want to be \"normal\". Other days, you wake up, and you look at other people that pass up that good food. Where is their passion? Why do they go on with life when their meals are just tedious? Besides, that rush you get makes you so...different. People find you interesting and fun, because you constantly act hungry.\n#\nSome men chemically can resist sex better than others. Men are told that \"eventually\" they will stop wanting every woman they see. For some men, that's true. For many men, that's bullshit. We want to take care of a family, but a man like that has lust the way that gamblers, substance abusers, and preachers have addictions. It never goes away. Even worse, you can never drink or gamble again. But you can't not ever have sex...\n#\nYou are helping a guy scratch an itch. You make it fun. He wants his real life, but if he tries to do it without sex with other women, I promise, he will become suicidal. I promise, he will be someone different. Sds... when we lose passion... yeah, we die. Of someone said to you, \"yeah, eventually, you will settle down and never laugh at any jokes but the ones your husband tells you.\" How would you feel? \"It's shameful to laugh with someone else!!! How dare you...\" \n#\nHumans make so much of their own misery.",
            "author": "TastySpermDispenser",
            "id": "f20demx",
            "parent_id": "t3_dbcdqj",
            "score": 0,
            "created_utc": 1569858353.0,
            "replies": [
                {
                    "body": "Gold! Nice.",
                    "author": "fannyhoney",
                    "id": "f21d56j",
                    "parent_id": "t1_f20demx",
                    "score": 4,
                    "created_utc": 1569870800.0,
                    "replies": []
                },
                {
                    "body": "At the end of the day - Your wife does sound amazing though brother - what field of research is she in?\n\nJust a little advice though - you might want to next this POT SB - she seems a little nuts (like, the boil your rabbit kind)...",
                    "author": "tankbinding",
                    "id": "f2130ft",
                    "parent_id": "t1_f20demx",
                    "score": 0,
                    "created_utc": 1569867239.0,
                    "replies": [
                        {
                            "body": "Ha, I think you posted this comment to the wrong place. I'm not married, and all of my sbs are the crazy boil-your-rabbit kind. :)",
                            "author": "TastySpermDispenser",
                            "id": "f21605y",
                            "parent_id": "t1_f2130ft",
                            "score": 5,
                            "created_utc": 1569868352.0,
                            "replies": [
                                {
                                    "body": "Which is why you keep a room of caged rabbits on hand.\n\nNot judging. Just saying.\n\n😂",
                                    "author": "SDRippington",
                                    "id": "f21m8ep",
                                    "parent_id": "t1_f21605y",
                                    "score": 2,
                                    "created_utc": 1569873884.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "Rabbit is good eatin’.",
                            "author": "AshcanWhispers",
                            "id": "f21ra4e",
                            "parent_id": "t1_f2130ft",
                            "score": 0,
                            "created_utc": 1569875743.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": ">Imagine you had an eating disorder.\n\nBy this do you mean \"Don't like S'mores?!? or possibly \"Like to eat Peeps rather than make them fight to the death for sport\"?!?",
                    "author": "tankbinding",
                    "id": "f20xjhh",
                    "parent_id": "t1_f20demx",
                    "score": 0,
                    "created_utc": 1569865279.0,
                    "replies": [
                        {
                            "body": "Oh, come on now. We all know those two are mental disorders, not eating ones. :)",
                            "author": "TastySpermDispenser",
                            "id": "f20zyh1",
                            "parent_id": "t1_f20xjhh",
                            "score": 3,
                            "created_utc": 1569866117.0,
                            "replies": []
                        },
                        {
                            "body": "Ugh.\n\nIf I was stuck in a room full of peeps and my choice was to die or eat my way out?\n\nGlad my will is up to date - cuz I’m gonna die...",
                            "author": "SDRippington",
                            "id": "f21m1x5",
                            "parent_id": "t1_f20xjhh",
                            "score": 1,
                            "created_utc": 1569873821.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Check out another forum on Reddit, r/DeadBedrooms.  You will learn many things.  They may not apply to your SD.  However, they very well could.",
            "author": "aotus_trivirgatus",
            "id": "f21al7f",
            "parent_id": "t3_dbcdqj",
            "score": 1,
            "created_utc": 1569869922.0,
            "replies": []
        },
        {
            "body": "I don’t think that’s true as an absolute.",
            "author": "RealEarthAngel",
            "id": "f21vuiw",
            "parent_id": "t3_dbcdqj",
            "score": 1,
            "created_utc": 1569877453.0,
            "replies": []
        },
        {
            "body": "Haha, I've also had SDs who had amazing wives! Like, women who I truly admired even though I never met them. Luckily, their wives knew they were messing around.\nI think people who have been in a relationship for a long time just get bored with each other, especially in the bedroom. It's a normal part of the lifespan of a long term relationship.",
            "author": "lakoreanita",
            "id": "f22ectg",
            "parent_id": "t3_dbcdqj",
            "score": 1,
            "created_utc": 1569887338.0,
            "replies": []
        },
        {
            "body": "It could be your SD is actually polyamorous but not everyone can accept non-monogamy.",
            "author": null,
            "id": "f22j7wf",
            "parent_id": "t3_dbcdqj",
            "score": 1,
            "created_utc": 1569890199.0,
            "replies": []
        },
        {
            "body": "No matter how much he tells you hes happy, hes not. No matter how perfect she seems, shes not. They have drama and shit between each other that only they know about. Dont overthink it. If a man or woman is cheating, they arent happy.",
            "author": "dade_murphy1",
            "id": "f22tsvo",
            "parent_id": "t3_dbcdqj",
            "score": 1,
            "created_utc": 1569896872.0,
            "replies": []
        },
        {
            "body": "Apples and oranges... not a shred of relevance.",
            "author": "RealEarthAngel",
            "id": "f230s3i",
            "parent_id": "t3_dbcdqj",
            "score": 1,
            "created_utc": 1569902236.0,
            "replies": []
        },
        {
            "body": "Maybe they’re polyamorous. Maybe they have an open relationship. Unless you know you just don’t know.",
            "author": "scooberdoober1",
            "id": "f68ubvc",
            "parent_id": "t3_dbcdqj",
            "score": 1,
            "created_utc": 1572731794.0,
            "replies": []
        },
        {
            "body": "She seems like an “independent woman that don’t need no man” men want to feel like a knight in shining armor and needed by a woman. He craves a girl who makes him feel super masculine",
            "author": "Blondie321xox",
            "id": "f8w80co",
            "parent_id": "t3_dbcdqj",
            "score": 1,
            "created_utc": 1574885142.0,
            "replies": []
        },
        {
            "body": "You invest a lot of emotional, economic, and other values in a long term relationship and marriage, especially with kids.  Love goes so much deeper than the physical.  But the physical is still important, and when you have a good life everywhere else,  it is not enough to make you want to break everything off when that disappears. Being in a dead bedroom situation sucks. It hurts. You go through emotions of feeling rejected and unloved, anger, depression.  You talk with your SO to work things out, you understand where they're coming from, they understand where you're coming from, but nothing changes. It's almost worse when your SO agrees to \"try more\" and physical intimacy feels forced and like they're just letting you use them for your pleasure. It's horrible. Where does that leave you? Leave your life?  No, not an option, like I said, so much invested and your love goes deeper than that physical intimacy. BUT, you still need it.  So what?  If your SO isn't open to letting you release that physical need with her permission, then what?  You have 2 choices, leave everything to get those physical needs met, or go behind her back. You've already decided option 1 isn't an option, so...\nIt's easy to think you're a bad person for wanting that and doing that, and others to judge you as such too.  But it so much more complicated. I don't think anyone who has been through this comes to the decision lightly.  I sure as hell haven't. I would love to meet someone who understands that or a married woman who is in the same situation as me.  Someone who understands that it is for that physical release, but that our lives outside of that are great. Anyway, hope that helps. Peace.",
            "author": "RobtheElder",
            "id": "fa0b33t",
            "parent_id": "t3_dbcdqj",
            "score": 1,
            "created_utc": 1575751957.0,
            "replies": []
        },
        {
            "body": "Random thought here:\n\nYou should try to seduce her!!\n\nIn the absence of that, why do that research - would you be ok with your SD adding your dad to his LinkedIn network - and completely researching your parents and siblings (out of curiosity of course)?",
            "author": "tankbinding",
            "id": "f20n0nn",
            "parent_id": "t3_dbcdqj",
            "score": 1,
            "created_utc": 1569861586.0,
            "replies": [
                {
                    "body": "I have no intention to interact with her. It was just a curiosity. I’m not setting out to ruin this man’s life. I really feel like I’m being misunderstood here. He has his life and I’ve got mine. \n\nBut on a separate note, in a different world I’d definitely seduce the shit out of here. She seems like my type.",
                    "author": "fannyhoney",
                    "id": "f20oi5k",
                    "parent_id": "t1_f20n0nn",
                    "score": 10,
                    "created_utc": 1569862097.0,
                    "replies": [
                        {
                            "body": "I won’t judge your curiosity. If I judge anything it’s your decision to bring questions like this to a group that would most likely beat you into submission because of the inherent security risks of the lifestyle. Nobody likes a bunny boiler - which usually starts by the more “inquisitive” ones.\n\nI can say every SB I’ve dated I’ve pretty much crawled up their life and social-ass with a microscope. 90% Mostly to protect ME. 10% or maybe a little less? I really am genuinely curious about what makes them “tick” and how I see whether their lives reflect what I see on all their social media.\n\nIt also gives me awesome insight to gift ideas for them when I see hidden passions they might have they never really share with anyone 😁\n\nThing is? All of my SB’s know me. They also know that I know them. They also know I will answer anything they ever ask honestly, but that comes with the risk they might not like my answers.\n\nFor the most part I’ve picked SB’s that have a solid head on their shoulders and a drive to be more in life then what they are. They’re all go getters, kind, considerate and are very amazing people, and I adore and love each of them in their own way.",
                            "author": "SDRippington",
                            "id": "f21npuy",
                            "parent_id": "t1_f20oi5k",
                            "score": 1,
                            "created_utc": 1569874427.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Quantity or variety of sex at home is inadequate.",
            "author": null,
            "id": "f20pekx",
            "parent_id": "t3_dbcdqj",
            "score": 1,
            "created_utc": 1569862408.0,
            "replies": [
                {
                    "body": "Totally this for me on the variety side of things.   I’m not really into anything all that crazy but my shit has a shelf life. Like to get some good use out of it before I turn back into stardust.",
                    "author": "usa968676",
                    "id": "f20yv61",
                    "parent_id": "t1_f20pekx",
                    "score": 1,
                    "created_utc": 1569865734.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "> I’m not making any ethical judgment on any lifestyle.\n\nOh, but you are, which is why you're getting downvoted.\n\n>Why would he be so committed to SA? Why cheat on such women?\n\nSee, that's an *ethical judgment*. (So is \"behind her back\" but anyway.) \n\nA curious question would've been, \"She seems so perfect. Why does a guy with such a wonderful wife want to spend time with women like me?\"\n\nYou claim \"she has no clue\". How you know this is beyond me. You claim he is \"committed to SA\" when at best you can determine he regularly enjoys time with an SB. Those are not the same.\n\nHow many times a week do they have sex? How many times a month? How many times a year? \n\nHow often does she tell him how wonderful is? Look at him with the wonder and adoration a close SB might? \n\nHow often does he get to give her the most simple life advice and have her be immediately grateful?\n\n**The answers to these questions in no way diminish how wonderful this woman is. She may well be everything you say --- and much much more.**\n\nHe needs something, however, she doesn't provide him. For all we know she needs something he doesn't provide her. He gets the thing(s) he needs from women like you. \n\n&#x200B;\n\n> \"(I haven’t factored sex in but I assume she’s a good person to him overall)\"\n\nSome of us have wives who are *great people overall*. But that doesn't mean we have sex with one another. Some of us never do. We desire it. We want it to feel like something real. It's impossible to do that with true pros (I'd imagine; anyone working by the hour is going to offer limited emotional connection) and yet very doable with a good SB.  \n\n\nTSD wrote: \"Men are told that \"eventually\" they will stop wanting every woman they see.\"\n\nI think they are told that. I think it's almost certainly false for men of normal sex drive/libido who are heterosexual.\n\nFinal thoughts: If I had learned a POT SB had done this research and drawn her own conclusions and judgments like this, I would not only never see her again, I would cut off all means of communication.",
            "author": "marker3000",
            "id": "f20panj",
            "parent_id": "t3_dbcdqj",
            "score": 0,
            "created_utc": 1569862369.0,
            "replies": []
        },
        {
            "body": "Women don't understand men. Men, many of us, like to have multiple partners even if we are very happy with our principal partner. It's biology, like a bull elk with a herd of elk cows. You could ask him why he needs all these females when his main cow is so cool. He would just grunt and paw the ground.",
            "author": "doctorcoolpop",
            "id": "f21vly5",
            "parent_id": "t3_dbcdqj",
            "score": 0,
            "created_utc": 1569877359.0,
            "replies": []
        },
        {
            "body": "Most likely it's a sexless marriage.  Maybe the wife is too busy for him and he needs an outlet.",
            "author": null,
            "id": "f20s9b3",
            "parent_id": "t3_dbcdqj",
            "score": 0,
            "created_utc": 1569863420.0,
            "replies": []
        },
        {
            "body": "**In the spirit of transparency**, you should show your potential SD this thread and see if it bothers him at all (maybe he will try to set up a threesome who knows)...",
            "author": "tankbinding",
            "id": "f212h6v",
            "parent_id": "t3_dbcdqj",
            "score": 0,
            "created_utc": 1569867045.0,
            "replies": [
                {
                    "body": "It won’t happen but wouldn’t that be an interesting sight to see? 😂",
                    "author": "SDRippington",
                    "id": "f21nv61",
                    "parent_id": "t1_f212h6v",
                    "score": 1,
                    "created_utc": 1569874477.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I'm a SB so this is just my two cents. \n\nI don't intend to get married, but if I somehow is married, I think I would cheat too, regardless of how amazing my partner is. \n\nThe geeky stuff: Monogamy is non-natural biologically - that is, we aren't suitable for it biologically. We are the only primate to participate in monogamy and there are actually research on why the human body functions in such a non-monogamous way. Monogamy and marriage makes all the sense socially - helps with raising kids, more financially stable, etc - but we are fundamentally unsuited for it, and that's why we always feel so conflicted and miserable: our moral tells us one thing but we want another. \n\n\nThe normal stuff: when I cheat, I don't simply stop loving my partner. A lot of people have problem understanding this. Now there are some people who actually stop loving their partner, or their marriage is already broken, but that's not your question. I cheat because there is a gap that my partner can't fulfill, and I look for it elsewhere: maybe it's sex, understanding, the feeling of being desired, the need to experience something new. Once I got that part fulfilled elsewhere, I came back to my partner for all his other amazing qualities. I think we live in a culture that tells us there will be that one person that fits our every, EVERY needs, but that's not true.\n\nTldr: just because she's amazing doesn't mean he wouldn't cheat. Just because he cheats doesn't mean she's not amazing.",
            "author": "shuttingsen",
            "id": "f22nfc0",
            "parent_id": "t3_dbcdqj",
            "score": 0,
            "created_utc": 1569892502.0,
            "replies": []
        },
        {
            "body": "EDIT: ONE BIG POINT TO NOTE!!！!SB shouldn't be poking into SD's home affair. Listen to the info SD says about his wife and just forget it! \n\nYou are just the side piece. So don't overthink. At times he gets bored with what's at home and want a little snack (SB). And snacks are  replaceable. :)",
            "author": "JELxin",
            "id": "f206zbf",
            "parent_id": "t3_dbcdqj",
            "score": -2,
            "created_utc": 1569856059.0,
            "replies": [
                {
                    "body": "I’m well aware of my place. I’m just curious. I want to understand men better but I know this doesn’t have consequence on me.",
                    "author": "fannyhoney",
                    "id": "f207a0h",
                    "parent_id": "t1_f206zbf",
                    "score": 5,
                    "created_utc": 1569856161.0,
                    "replies": []
                },
                {
                    "body": "I also feel bad for her in a way.",
                    "author": "fannyhoney",
                    "id": "f207hq6",
                    "parent_id": "t1_f206zbf",
                    "score": 3,
                    "created_utc": 1569856234.0,
                    "replies": [
                        {
                            "body": "Don't have to. She probably knows that he has plenty of snacks outside. And what matters is he brings the cheque home and goes home to the wife. I am speaking as my experience as a mistress. Most wife knows their husband's drama out there. And many will decide to close one eye.",
                            "author": "JELxin",
                            "id": "f20843p",
                            "parent_id": "t1_f207hq6",
                            "score": 0,
                            "created_utc": 1569856458.0,
                            "replies": [
                                {
                                    "body": "Okay but why would someone like her put up with that in the presence of other options? She makes a lot of money too.",
                                    "author": "fannyhoney",
                                    "id": "f208ys0",
                                    "parent_id": "t1_f20843p",
                                    "score": 1,
                                    "created_utc": 1569856766.0,
                                    "replies": [
                                        {
                                            "body": "What other options do you assume she has? Get divorced, be a single mom trying to date? Some women enjoy that, some don't. Find a side piece of her own? How do you know she doesn't have that already?\n\nI think you're putting yourself in her place and thinking about how awful it must be for her. 1 Don't assume you know how she feels about the situation. 2 If she's in some awful situation, most people it's a place of their own choosing.",
                                            "author": "2fast-2curious",
                                            "id": "f209hrc",
                                            "parent_id": "t1_f208ys0",
                                            "score": 7,
                                            "created_utc": 1569856962.0,
                                            "replies": [
                                                {
                                                    "body": "This SB is overthinking. LOL.",
                                                    "author": "JELxin",
                                                    "id": "f20ia7h",
                                                    "parent_id": "t1_f209hrc",
                                                    "score": 2,
                                                    "created_utc": 1569860031.0,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "body": "She's the queen. The queen will always remain in her throne. Whereas you are just the little side piece. Men like to have many woman since ancient times. Whats new? And I sure the wife knows this and enjoys being the queen and many side pieces eyeing her throne. But too bad she probably can't be bothered with the side piece. And she knows this is just a passing phase of you coming inside the picture for awhile. Lol",
                                            "author": "JELxin",
                                            "id": "f20i2yc",
                                            "parent_id": "t1_f208ys0",
                                            "score": 6,
                                            "created_utc": 1569859971.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "Women tend to value men who are higher status than them.  The higher the status the better.  Unfortunately in today’s society, high status men have a lot of options. You’re more likely to be cheated on by a surgeon than a mailman, since the mailman most likely can’t afford to be on SA. But you’re more attracted to the surgeon so you make little deals with yourself and turn a blind eye because of his perceived value. It’s been happening since the beginning of time.  Ask yourself if most women would rather be the wife of a Prince who occasionally strays or the wife of a plumber who is faithful. I think you know the answer.",
                                            "author": "nhceo",
                                            "id": "f21nuv7",
                                            "parent_id": "t1_f208ys0",
                                            "score": 4,
                                            "created_utc": 1569874474.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "We are biologically programmed to impregnate as many women as possible.\nOur society has imposed moral responsibilities and rules which define moral turpitude.\nGuess which road we’re more likely to traverse?",
            "author": "Sah-Bum-Nim",
            "id": "f215ak5",
            "parent_id": "t3_dbcdqj",
            "score": -1,
            "created_utc": 1569868100.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "f21ug6k",
                    "parent_id": "t1_f215ak5",
                    "score": 6,
                    "created_utc": 1569876929.0,
                    "replies": [
                        {
                            "body": "You seem to be somewhat skeptical or is it cynical I can’t tell.?\nWhat runs stringer in my blood is my desire to fuck as many different females as I can not some stupid ass religious marriage vows made up by someone who’s either fucking alter boys or raping nuns.\nTake the college course, Human Growth and Development, you’ll learn that YES we are biologically programmed this way as makes.",
                            "author": "Sah-Bum-Nim",
                            "id": "f3arkw8",
                            "parent_id": "t1_f21ug6k",
                            "score": 1,
                            "created_utc": 1570788143.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "He does it because he can. Furthermore , your snooping walks a fine line of creepy. Read a book, watch a podcast , take care of your mind and body.",
            "author": "agjrpsl",
            "id": "f20hlgs",
            "parent_id": "t3_dbcdqj",
            "score": -2,
            "created_utc": 1569859803.0,
            "replies": [
                {
                    "body": "SBs look up pot SDs all the time. It’s for our safety and to make sure this person is not a pedophile/criminal/psychopath etc. It’s routine for most of us and some SDs do it too. I just happened to stumble upon information that I found bizarre and wanted to share it. I have no intentions of reaching out to her or blackmailing, if that’s what you meant by “creepy”. Peace!",
                    "author": "fannyhoney",
                    "id": "f20jrld",
                    "parent_id": "t1_f20hlgs",
                    "score": 8,
                    "created_utc": 1569860487.0,
                    "replies": [
                        {
                            "body": "“SBs look up pot SDs all the time. It’s for our safety and to make sure this person is not a pedophile/criminal/psychopath etc”\n\nTo be fair, ensuring safety has little to nothing to do with wifey. \n\n“I just happened to stumble upon information that I found bizarre and wanted to share it. “\n\nIts this type of statement that is getting you downvoted. My intent is not to judge or chastise you, simply pointing it out since you mentioned your downvotes. Its not “bizarre” at all, it is indeed quite common, otherwise SA wouldn’t even begin to exist.",
                            "author": null,
                            "id": "f21m667",
                            "parent_id": "t1_f20jrld",
                            "score": 0,
                            "created_utc": 1569873862.0,
                            "replies": []
                        },
                        {
                            "body": "> and to make sure this person is not a pedophile/criminal/psychopath etc\n\nWhat does this even mean? Is there a National Database of Pedophiles, Criminals, and Psychopaths? Does that database also have information about science ladies?\n\nCome on, now. You were creeping on him and his wife out of curiosity, not safety.",
                            "author": "mySLFalt",
                            "id": "f21k0jo",
                            "parent_id": "t1_f20jrld",
                            "score": -1,
                            "created_utc": 1569873129.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "I do podcasts everyday and I was just done reading my book. Can recommend you stuff if you like. 😊",
                    "author": "fannyhoney",
                    "id": "f20j4h0",
                    "parent_id": "t1_f20hlgs",
                    "score": 2,
                    "created_utc": 1569860289.0,
                    "replies": []
                },
                {
                    "body": "Agree with this - every stalker is just \"curious\"! \n\nIf he completely researched her family \"on the internet\" & \"out of curiosity\" - just to try and understand how her relationship with her parents and siblings led her to the life of a \"sex worker\" it would probably seem a lot more \"stalkerish\" to her. While her satisfying her curiosity is probably completely reasonable (although I'm sure diving into the details of his wife's career is out of concern for her safety).\n\nDoes she realise that if her parents found out about her secret lifestyle it would probably ruin their lives??",
                    "author": "tankbinding",
                    "id": "f20oyu3",
                    "parent_id": "t1_f20hlgs",
                    "score": 0,
                    "created_utc": 1569862254.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Because he isn't cheating on her.  He's not planning to have kids with you and grow old with you is he?  He's just doing fun things with someone other than his wife.  I know women have a hard time understanding this.   But its not about her.  He likes to try other women's \"cooking\".  He's not divorcing her for you.  He's just having fun with you on occasion.  She's his partner, you're his friend.",
            "author": "stark_emerson",
            "id": "f20jk1j",
            "parent_id": "t3_dbcdqj",
            "score": -1,
            "created_utc": 1569860421.0,
            "replies": [
                {
                    "body": "No she is a fuck buddy",
                    "author": "sanfran4fun",
                    "id": "f26b3vo",
                    "parent_id": "t1_f20jk1j",
                    "score": 2,
                    "created_utc": 1570001161.0,
                    "replies": []
                }
            ]
        },
        {
            "body": ">My pot has been seeing girls behind her back for 4 years at least. She has no clue. I don’t understand why and how someone would cheat on a woman like that. I just don’t get it.\n\nYour pot, who is not your SD yet, and you have made all of these judgmental statements because you looked up his wife and she look cool online? Maybe she is waiting for him to go on his date with you so she can invite her boy toy over or ride her sybian? Maybe she doesn't care because there is nothing he is going to do to you that he hasn't done to her 1000 times already? Maybe they are comfortable having sex with other people outside of their marriage but still love each other? Sex and love have nothing to do with each other.",
            "author": "OneMOARPlz",
            "id": "f20thd2",
            "parent_id": "t3_dbcdqj",
            "score": -1,
            "created_utc": 1569863865.0,
            "replies": []
        },
        {
            "body": "Some people like some variety.  Some like cheating. Some like to think they are helping someone.",
            "author": "bigmarc1962",
            "id": "f20un3l",
            "parent_id": "t3_dbcdqj",
            "score": 0,
            "created_utc": 1569864281.0,
            "replies": []
        },
        {
            "body": "Look, and this is just my opinion and I will try not to be harsh, by why are you crossing those boundaries and looking up his wife? Why does his wife even come up in convo between you both? And lastly, I don’t know how old you are or if you can get this “picture perfect” is not always perfectly REAL. Simply stated you don’t know what’s really going on behind the walls of their private life. I was raised in a house where you are expected to “present” a certain image publicly but what happened when you shut the front door of MY family home can become scenes from the house of horrors; but there my Catholic parents sit still married, miserable and hate each other. To the rest of the world “we were such a cute family”🤗🤢anyway 🤦‍♀️very rarely will a person honestly lay out and present their true reality and maybe they believe the lies they tell theirselves.",
            "author": null,
            "id": "f21e726",
            "parent_id": "t3_dbcdqj",
            "score": 0,
            "created_utc": 1569871170.0,
            "replies": [
                {
                    "body": "He openly talks about his wife and family quite often without me asking. I got curious. I’m over it now. Thank you.",
                    "author": "fannyhoney",
                    "id": "f21ege3",
                    "parent_id": "t1_f21e726",
                    "score": 5,
                    "created_utc": 1569871260.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Women want a man who is the highest value man they can get. While men want multiple women. It's just a fact of life.",
            "author": null,
            "id": "f20gki6",
            "parent_id": "t3_dbcdqj",
            "score": -4,
            "created_utc": 1569859439.0,
            "replies": []
        },
        {
            "body": "He sleeps with other women because vows are \"till death do us part\" and says nothing about seeking younger women for physical relationships!",
            "author": null,
            "id": "f216nb8",
            "parent_id": "t3_dbcdqj",
            "score": -1,
            "created_utc": 1569868569.0,
            "replies": []
        },
        {
            "body": "Variety is the spice of life",
            "author": "Jamesthesage",
            "id": "f22372c",
            "parent_id": "t3_dbcdqj",
            "score": -1,
            "created_utc": 1569880932.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "f20auss",
            "parent_id": "t3_dbcdqj",
            "score": -4,
            "created_utc": 1569857461.0,
            "replies": [
                {
                    "body": "I’m no flawless 19 yo myself. 😂",
                    "author": "fannyhoney",
                    "id": "f20b4xw",
                    "parent_id": "t1_f20auss",
                    "score": 5,
                    "created_utc": 1569857567.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "deleted  ^^^^^^^^^^^^^^^^0.8717  [^^^What ^^^is ^^^this?](https://pastebin.com/FcrFs94k/50110)",
            "author": null,
            "id": "f232azr",
            "parent_id": "t1_f21b68x",
            "score": 3,
            "created_utc": 1569903612.0,
            "replies": []
        },
        {
            "body": "If she truly empathized she wouldn’t let herself be used as a tool to hurt someone behind their back, don’t you think?",
            "author": null,
            "id": "f21d5nw",
            "parent_id": "t1_f21b68x",
            "score": -8,
            "created_utc": 1569870804.0,
            "replies": [
                {
                    "body": "Really now?\n\nOP doesn’t know anything. You don’t know anything. None of us know a damn thing. For all we know, social media could be spot on and she’s an angel and he’s a fucking douchebag. Or. She could be Satan’s Mistress and be a complete harpy hell-demon to live with and sucks his soul to stay young and vibrant - none of us know a thing.\n\nJudge an SR on its merits and leave it at that. Projecting anger at him (or her the OP) without knowing what’s real is wasted emotion.\n\nI feel your statement just came off as wickedly judgmental and projecting  - or did I miss something?",
                    "author": "SDRippington",
                    "id": "f21kx32",
                    "parent_id": "t1_f21d5nw",
                    "score": 18,
                    "created_utc": 1569873435.0,
                    "replies": [
                        {
                            "body": "This! :)",
                            "author": "captainIsBack4u",
                            "id": "f21o8mq",
                            "parent_id": "t1_f21kx32",
                            "score": 3,
                            "created_utc": 1569874609.0,
                            "replies": []
                        },
                        {
                            "body": "deleted  ^^^^^^^^^^^^^^^^0.3531  [^^^What ^^^is ^^^this?](https://pastebin.com/FcrFs94k/00714)",
                            "author": null,
                            "id": "f232sz3",
                            "parent_id": "t1_f21kx32",
                            "score": 3,
                            "created_utc": 1569904094.0,
                            "replies": [
                                {
                                    "body": "So much YES to this!!! 👆🏻👏🏻",
                                    "author": null,
                                    "id": "f23vnn0",
                                    "parent_id": "t1_f232sz3",
                                    "score": 1,
                                    "created_utc": 1569938790.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "Cheating is wrong, PERIOD! Stop trying to make excuses for shitty behavior. Cheating is only ok for you men when YOU are the ones doing it, but not the ones being cheated on. Please quit being a hypocrite!",
                            "author": null,
                            "id": "f23vi7r",
                            "parent_id": "t1_f21kx32",
                            "score": 2,
                            "created_utc": 1569938683.0,
                            "replies": [
                                {
                                    "body": "> Please quit being a hypocrite!\n\nExactly. This has been my entire point. Everyone in the bowl is a hypocrite by nature of this game itself. I've always said \"own your decision\". I've never said anything but.\n\n_\"Fucking for money is okay, but only under special, specific circumstances that fit my current sense of morality.\"_\n\nWhat. Ever. People are going to have sex with who they want to have sex with under whatever guise of \"willful blindness\" they choose that fits their sense of morality for the day. \n\nOne thing I know with absolute certainty? If it's not you they're having sex with and paying money for that privilege, it most certainly will be with someone else. Nothing hypocritical about that observation. Think about that the next time you collect your PPM.\n\nWe should all be careful of falling off our high horses. Bones could break.",
                                    "author": "SDRippington",
                                    "id": "f23zlmx",
                                    "parent_id": "t1_f23vi7r",
                                    "score": 1,
                                    "created_utc": 1569941502.0,
                                    "replies": [
                                        {
                                            "body": "AAH, another cheater trying to justify his shitty behavior. Karma will get back at you though, and what you are doing to your wife will come back to you eventually. And boy, that pain will hurt!",
                                            "author": null,
                                            "id": "f24irlv",
                                            "parent_id": "t1_f23zlmx",
                                            "score": 1,
                                            "created_utc": 1569953055.0,
                                            "replies": [
                                                {
                                                    "body": "Not only are you judgmental AF, you just assumed I’m still married and not already in the middle of an amicable divorce?\n\nTotally not surprised 😊😂😂\n\nKarma already HAS dear by blessing me with women that actually deeply care for me and my wants and desires.\n\nSo please, with all due respect, with sugar on top, go fuck yourself 😂",
                                                    "author": "SDRippington",
                                                    "id": "f24l998",
                                                    "parent_id": "t1_f24irlv",
                                                    "score": 2,
                                                    "created_utc": 1569954851.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "At 18 or 19 one doesnt have all the answers. Assuming here, but what if she went into it thinking the SDs are miserable in their marriages and she can help while being helped. Only to realize that SO looks perfect (from the outside atleast), and hence the post.\n\nAnd empathizing doesnt mean taking food out of your plate to feed others while you go hungry. All you have to have is a caring heart to relate to the hunger someone else feels.",
                    "author": "captainIsBack4u",
                    "id": "f21ik5j",
                    "parent_id": "t1_f21d5nw",
                    "score": 5,
                    "created_utc": 1569872647.0,
                    "replies": [
                        {
                            "body": "deleted  ^^^^^^^^^^^^^^^^0.4561  [^^^What ^^^is ^^^this?](https://pastebin.com/FcrFs94k/26654)",
                            "author": null,
                            "id": "f232x4y",
                            "parent_id": "t1_f21ik5j",
                            "score": 1,
                            "created_utc": 1569904205.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "f22ptux",
                    "parent_id": "t1_f21d5nw",
                    "score": 1,
                    "created_utc": 1569894105.0,
                    "replies": [
                        {
                            "body": "Uh, she clearly knows the guy is married. What kind of question is that...? Lol",
                            "author": null,
                            "id": "f22rb7v",
                            "parent_id": "t1_f22ptux",
                            "score": -2,
                            "created_utc": 1569895140.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "f22s54v",
                                    "parent_id": "t1_f22rb7v",
                                    "score": 0,
                                    "created_utc": 1569895709.0,
                                    "replies": [
                                        {
                                            "body": "deleted  ^^^^^^^^^^^^^^^^0.7950  [^^^What ^^^is ^^^this?](https://pastebin.com/FcrFs94k/10303)",
                                            "author": null,
                                            "id": "f232y8t",
                                            "parent_id": "t1_f22s54v",
                                            "score": 1,
                                            "created_utc": 1569904234.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "No it is not, because it takes 2 to cheat!",
                                            "author": null,
                                            "id": "f22z2l4",
                                            "parent_id": "t1_f22s54v",
                                            "score": -1,
                                            "created_utc": 1569900751.0,
                                            "replies": [
                                                {
                                                    "body": "She’s not cheating. He is. Lmao.",
                                                    "author": "LaNouvelleSugar",
                                                    "id": "f23f9ev",
                                                    "parent_id": "t1_f22z2l4",
                                                    "score": 1,
                                                    "created_utc": 1569921432.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "She isn’t intentionally hurting anyone. The husband is. Are we blaming Op for her choices?",
                    "author": "LaNouvelleSugar",
                    "id": "f23f8iy",
                    "parent_id": "t1_f21d5nw",
                    "score": 1,
                    "created_utc": 1569921390.0,
                    "replies": []
                },
                {
                    "body": "You're the tool.  Who said the wife was hurt?",
                    "author": "nerojt",
                    "id": "f23k6mb",
                    "parent_id": "t1_f21d5nw",
                    "score": 0,
                    "created_utc": 1569928656.0,
                    "replies": [
                        {
                            "body": "So, you are telling me that if and when the wife finds out her husband is a cheater she won’t be hurt. REALLY...??? I hope you are in that wife’s shoes someday, and I will be here waiting to hear about how happy you are that your spouse is cheating on you constantly behind your back! Quit being a hypocrite!!!\n\nPS: Not surprised to find out you are ALSO a cheater though! Typical...",
                            "author": null,
                            "id": "f23w77d",
                            "parent_id": "t1_f23k6mb",
                            "score": 1,
                            "created_utc": 1569939177.0,
                            "replies": [
                                {
                                    "body": "I've never cheated. Also, the wife has not been hurt.",
                                    "author": "nerojt",
                                    "id": "f25q81m",
                                    "parent_id": "t1_f23w77d",
                                    "score": 2,
                                    "created_utc": 1569980971.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "All of that could be true, or monogamy can be a flawed idea.",
            "author": "WestSugarer",
            "id": "f21fn7x",
            "parent_id": "t1_f20kylv",
            "score": 12,
            "created_utc": 1569871675.0,
            "replies": [
                {
                    "body": "Not everyone is built to be monogamous and our society only promotes monogamy as the only way to live. Some people can mate forever to one person. Most can't 🤷‍♀️ we need to work on education and acceptance of various lifestyles and relationship choices. \nHim cheating on her behind her back has nothing to do with her or how great she is. Fuck, Jay Z fucked around Beyonce's back. If Beyonce can get cheated on, anyone can get cheated on 😂",
                    "author": "Devon_Bunny",
                    "id": "f21hs2l",
                    "parent_id": "t1_f21fn7x",
                    "score": 30,
                    "created_utc": 1569872382.0,
                    "replies": [
                        {
                            "body": "> need to work on education and acceptance of various lifestyles and relationship choices.  -  like single",
                            "author": "pinotandsugar",
                            "id": "f226830",
                            "parent_id": "t1_f21hs2l",
                            "score": 11,
                            "created_utc": 1569882740.0,
                            "replies": [
                                {
                                    "body": "Haha truth or poly 😘",
                                    "author": "theAliasOfAlias",
                                    "id": "f22qmzl",
                                    "parent_id": "t1_f226830",
                                    "score": 2,
                                    "created_utc": 1569894665.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "It’s true I wouldn’t say it. And it’s not either/or. The two are not mutually exclusive.",
                    "author": "RealEarthAngel",
                    "id": "f40cusg",
                    "parent_id": "t1_f21fn7x",
                    "score": 1,
                    "created_utc": 1571294090.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Men cheat because they cheat, deficit or not. To me that is no different than trying to decipher why women get into sugaring when 99% of the rest of the population is getting through their lives the hard way of living within their means and taking extra gigs to cough up rent money and pay down loans.",
            "author": null,
            "id": "f22yz8c",
            "parent_id": "t1_f20kylv",
            "score": -1,
            "created_utc": 1569900672.0,
            "replies": [
                {
                    "body": "I’m not trying to decipher anything… I simply understand why a lot of men cheat.  People never do things for no reason. Men cheat for a reason and the reason is within them.\nAnd that has nothing to do with why women become SBs. Again, each person has their own reason.  Apples and oranges.",
                    "author": "RealEarthAngel",
                    "id": "f40cmw2",
                    "parent_id": "t1_f22yz8c",
                    "score": 1,
                    "created_utc": 1571293791.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "And on the flip side, I find the irony endlessly amusing at the women that justify fucking older guys for money simply because the guy is single.\n\nSelective morality is funny AF especially with THIS crowd. 😂😂😂",
            "author": "SDRippington",
            "id": "f21lrmm",
            "parent_id": "t1_f2137uq",
            "score": 1,
            "created_utc": 1569873723.0,
            "replies": [
                {
                    "body": "So...you’d rather a woman fucked an older guy who was married for money instead of an older guy who is single?",
                    "author": "LaNouvelleSugar",
                    "id": "f21mi43",
                    "parent_id": "t1_f21lrmm",
                    "score": 6,
                    "created_utc": 1569873975.0,
                    "replies": [
                        {
                            "body": "Wow. You truly missed my point completely didn’t ya?",
                            "author": "SDRippington",
                            "id": "f21s4a7",
                            "parent_id": "t1_f21mi43",
                            "score": -2,
                            "created_utc": 1569876070.0,
                            "replies": [
                                {
                                    "body": "I really did. Would you kindly explain?",
                                    "author": "LaNouvelleSugar",
                                    "id": "f21sdry",
                                    "parent_id": "t1_f21s4a7",
                                    "score": 4,
                                    "created_utc": 1569876173.0,
                                    "replies": [
                                        {
                                            "body": "It seems that a few women here exercise selective morality enforcement with respect to societal “norms”\n\nMany women seem perfectly okay to fuck an older guy for money if he’s single, yet they throw shade on fucking an older guy for money if he’s married.\n\nThey don’t even consider the “for money” part really because they benefit. They only consider the “married” part because it’s a choice someone ELSE made and would in part, through some twisted sense of self, would make her feel “dirty” because he’s married - NOT that she’s fucking for cash.\n\nAnd one step further? I’ve known some SB’s that vehemently avoid fucking married OLDER guys but were more than okay to fuck the HOT young married guy for money cuz, well, his wife is obviously a bitch for not taking his gorgeous “D” for a ride, that poor, young, broken man.\n\nI’ve been on this forum (and in the bowl) long enough to see all sides of the selective morality dance. And it never changes. 😂\n\nEDIT: And the downvotes on this is AMAZING which only proves my point about all the butthurt snowflakes that cringe at the truth :)",
                                            "author": "SDRippington",
                                            "id": "f21ud7l",
                                            "parent_id": "t1_f21sdry",
                                            "score": -1,
                                            "created_utc": 1569876899.0,
                                            "replies": [
                                                {
                                                    "body": "To be perfectly honest, Whether you’re fucking for money or for whatever other reason that’s people’s personal problems. No one here should be judgmental. At all.",
                                                    "author": "LaNouvelleSugar",
                                                    "id": "f23f76j",
                                                    "parent_id": "t1_f21ud7l",
                                                    "score": 1,
                                                    "created_utc": 1569921326.0,
                                                    "replies": [
                                                        {
                                                            "body": "That’s my point.",
                                                            "author": "SDRippington",
                                                            "id": "f23iv4w",
                                                            "parent_id": "t1_f23f76j",
                                                            "score": 2,
                                                            "created_utc": 1569927002.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Whereas that might be your point, you do sound a bit judgmental yourself. Just letting you know",
                                                                    "author": "LaNouvelleSugar",
                                                                    "id": "f23jgpd",
                                                                    "parent_id": "t1_f23iv4w",
                                                                    "score": 1,
                                                                    "created_utc": 1569927778.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "Of course! Especially towards hypocritical people.\nThe irony is not lost on me.😂",
                                                                            "author": "SDRippington",
                                                                            "id": "f23jtvl",
                                                                            "parent_id": "t1_f23jgpd",
                                                                            "score": 1,
                                                                            "created_utc": 1569928231.0,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "In truth almost no one is cut out for it",
            "author": "doctorcoolpop",
            "id": "f21vqvt",
            "parent_id": "t1_f21fv2h",
            "score": -3,
            "created_utc": 1569877413.0,
            "replies": [
                {
                    "body": "I’ve met enough people who actually are.",
                    "author": "RealEarthAngel",
                    "id": "f40ct11",
                    "parent_id": "t1_f21vqvt",
                    "score": 4,
                    "created_utc": 1571294024.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Your point about the open relationship may be true. My pot hangs out with me in public places, some are very close to his residence. Granted, it’s at night time, but still potentially visible to his colleagues and family. He even holds my hand so there’s no mistaking of our dynamic. So it could be that they have an open thing going on. Also hanging out at Friday and Saturday night with me makes me wonder what does he tell her (but I never asked because we’re just starting and I don’t want to be nosy). \n\nThe asshole possibility is low. I vetted him, he is an okay person.",
            "author": "fannyhoney",
            "id": "f205si1",
            "parent_id": "t1_f204pvf",
            "score": 11,
            "created_utc": 1569855638.0,
            "replies": [
                {
                    "body": "Your description of her very closely mirrors a woman I worked for in the past - crazy successful, beautiful, amazing philanthropist, put on a show about helping children, relatively intelligent, ran in the “right,” highly noticeable and affluent circles, had the “perfect family.”\nHer “catch”?  She was a raging, hateful bitch!  Seriously. No one in her life, from the mailman, to her assistant (me), and sadly also to her super sweet, phenomenally successful husband, was beyond the grasp of her wrath.  It was the best paying job, both monetarily and benefits-wise, that I’ve ever had and I high-tailed it out of there in less than 3 months because I have a spine and a mouth, and a snarky attitude at times, and she insisted on testing everyone around her, every day.  She and her husband put on a VERY believable charade, but in reality he’d been diddling his secretary for all of time (hey at least he stuck to the same woman, who was age-appropriate - they were in their late l-70’s lol), were in separate rooms 98% of the time, and only exchanged words via phone and hand-written notes. Granted it was relatively amicable, and I’m sure he had his own faults that contributed to the shit-show.  The thing that I did always appreciate though was that regardless of how things were, they still constantly told one another how much they loved, respected, and appreciated one another.  And it wasn’t for show.  At least it didn’t seem that way.  The son on the other hand - WHEW!  Grumpy thing he was, but completely understandable given the environment. \n\nNot saying that that is definitely, or even likely, the case with your subject here, but its very common.  Some people stay busy and paint a pretty picture on the outside to cover up the inside. Some do it out of insecurity, some because they have a genuine passion for every last thing that they’re involved in (they are highly fortunate, though its not beyond anyone’s grasp!). A LOT do it to be “better than,” to keep up with or out-do someone else, or just because they’re bored. \n\nI saw that you stated that you “vetted” him as well. What were/are your resources for doing so?   (I am curious as I have never really gone off of anything aside from my gut feeling, and I can honestly say it hasn’t steered me wrong as of yet). Again, words and photos can paint a hell of a picture, and as a society highly based on aesthetic and status, it is easily bought into.  Unfortunately, more often than not it is all a facade.   I’d say the “asshole” scenario is a 50/50 chance. \n\nSorry for the novel :) ive been on here for EVER, and have never commented on anything lol\n\nEDIT:  Forgot to include... you said you thought “how do I compare.”  Don’t be hard on yourself.  You are just as capable of attaining the very same things she has. But remember - he is looking elsewhere because he wants someone/something COMPLETELY DIFFERENT.  ;)",
                    "author": null,
                    "id": "f21hfsy",
                    "parent_id": "t1_f205si1",
                    "score": 5,
                    "created_utc": 1569872268.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "f23npjw",
                            "parent_id": "t1_f21hfsy",
                            "score": 2,
                            "created_utc": 1569932385.0,
                            "replies": [
                                {
                                    "body": "Hey I’m all about encouragement!  :) we are all smart, and obviously motivated.  If you (or anyone) ever needs to talk or whatever, I am always here!",
                                    "author": null,
                                    "id": "f23tru7",
                                    "parent_id": "t1_f23npjw",
                                    "score": 1,
                                    "created_utc": 1569937415.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "deleted  ^^^^^^^^^^^^^^^^0.3155  [^^^What ^^^is ^^^this?](https://pastebin.com/FcrFs94k/01917)",
                    "author": null,
                    "id": "f232zsp",
                    "parent_id": "t1_f205si1",
                    "score": 1,
                    "created_utc": 1569904275.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I looked her up all over the internet. She has made tons of science contributions and is super cute. I don’t claim to know it all. But I just don’t understand the why in it all. And I can’t ask my POT because we’re new to one another and I don’t want to be intrusive.",
            "author": "fannyhoney",
            "id": "f206vhu",
            "parent_id": "t1_f204w0u",
            "score": 27,
            "created_utc": 1569856020.0,
            "replies": [
                {
                    "body": "I know you're not saying this, but you seem to be implying if she were a high school grad working as say a waitress that you'd understand him cheating on her more?",
                    "author": "tenmillionplus",
                    "id": "f20n11z",
                    "parent_id": "t1_f206vhu",
                    "score": 10,
                    "created_utc": 1569861590.0,
                    "replies": [
                        {
                            "body": "Women tend to value education highly in their Male partners while it doesn't really matter the other way around.\n\nIt's not surprising she'd think that because as a women, she'd value if her guy was a researcher.",
                            "author": "DarkMatter731",
                            "id": "f20z3es",
                            "parent_id": "t1_f20n11z",
                            "score": 5,
                            "created_utc": 1569865814.0,
                            "replies": [
                                {
                                    "body": ">Women tend to value education highly in their Male partners while it doesn't really matter the other way around.\n\nI disagree. Educated men prefer educated women for wives. When was the last time you heard of a doctor marrying a barista? People generally prefer to marry within their class.",
                                    "author": null,
                                    "id": "f22f83t",
                                    "parent_id": "t1_f20z3es",
                                    "score": 11,
                                    "created_utc": 1569887860.0,
                                    "replies": []
                                },
                                {
                                    "body": "Yeah I always laugh at these SB profiles that state how many languages they speak ... wow does she know what guys want 🤣",
                                    "author": "lookingforlaughter",
                                    "id": "f23frhx",
                                    "parent_id": "t1_f20z3es",
                                    "score": 3,
                                    "created_utc": 1569922293.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Pot SBs ask me at every M&G why I am on SA. I am happy when they do, because I know it's on their minds, and want to clear the air. If they don't like my response, we both move on, and if they do, the issue is out of the way.",
                    "author": null,
                    "id": "f494rcp",
                    "parent_id": "t1_f206vhu",
                    "score": 2,
                    "created_utc": 1571456851.0,
                    "replies": []
                },
                {
                    "body": ">I looked her up all over the internet...and I don’t want to be intrusive.\n\nThe thing is: you already are intrusive. He just doesn't know it. Just make sure he never finds out that you're researching his wife because if it were me, I would block you immediately.",
                    "author": "AusterlitzSD",
                    "id": "f20ul6a",
                    "parent_id": "t1_f206vhu",
                    "score": 7,
                    "created_utc": 1569864261.0,
                    "replies": [
                        {
                            "body": "Upvote. Point to note: SB should never be poking nose into SD's home affair.",
                            "author": "JELxin",
                            "id": "f211rr8",
                            "parent_id": "t1_f20ul6a",
                            "score": 14,
                            "created_utc": 1569866788.0,
                            "replies": [
                                {
                                    "body": "Always the classy SB JELxin",
                                    "author": "AusterlitzSD",
                                    "id": "f21khr4",
                                    "parent_id": "t1_f211rr8",
                                    "score": -1,
                                    "created_utc": 1569873289.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "There shouldn't only be one reason for this action.  What about curiousity?  Which is related to taking an interest in the other party, whcih is what we SDs often complain about SBs lacking!",
                            "author": "nycballetlover",
                            "id": "f24wxbv",
                            "parent_id": "t1_f20ul6a",
                            "score": 2,
                            "created_utc": 1569961786.0,
                            "replies": [
                                {
                                    "body": "Heh. I had one SB that I researched. She had an alt Intstagram profile of her at the firing range, and discussing competition pistols. Apparently some of her more \"liberal\" friends at college would have lost their shit if they knew.\n\nSo when she came by for our second intimate date I smiled and mentioned I had researched her a little and she was like \"Uh oh. What did you find out?\" I went \"here\", opened a fingerprint lock box sitting on the counter, pulled out my compensated and tricked out .45, plopped it on the counter in front of her and said \"strip it.\" \n\nShe smiled wider than I have ever seen a woman smile and proceeded to tear it down with practiced skill.\n\n(no, I didn't have rounds in the magazine. I wasn't stupid.) LMAO!\n\nAnd yes we're still good friends. But the little shit kept my damn pistol. I offered her that or a laptop later as a gift. She chose the pistol. She's a lifelong keeper. :-)",
                                    "author": "SDRippington",
                                    "id": "f2775na",
                                    "parent_id": "t1_f24wxbv",
                                    "score": 1,
                                    "created_utc": 1570032006.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "I’m an SB and if I was a married SD and found this out I would be pissed the hell off. And this guy is a POT meaning you don’t even really know him? I hope she is careful with this info",
                            "author": null,
                            "id": "f21eoc7",
                            "parent_id": "t1_f20ul6a",
                            "score": 3,
                            "created_utc": 1569871337.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Exactly,   That’s a carefully crafted persona.  She sounds very busy which means her husband is likely way down the list of her priorities.",
            "author": "LotBuilder",
            "id": "f206lkw",
            "parent_id": "t1_f204w0u",
            "score": 17,
            "created_utc": 1569855925.0,
            "replies": [
                {
                    "body": "Lived this. Ex wife was also a scientist, physicist at NASA. Not exactly a part time gig.",
                    "author": "LoftDaddy",
                    "id": "f22f6pk",
                    "parent_id": "t1_f206lkw",
                    "score": 4,
                    "created_utc": 1569887837.0,
                    "replies": [
                        {
                            "body": "Yeah,  you were an accessory on par with a handbag.  My ex is only an interior designer but her online persona would make her look like the female version of the Dos Equis guy.  I funded that fraud for a long time.",
                            "author": "LotBuilder",
                            "id": "f22gg87",
                            "parent_id": "t1_f22f6pk",
                            "score": 4,
                            "created_utc": 1569888527.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "This \\^",
                    "author": "DreamingLurker",
                    "id": "f20kkjc",
                    "parent_id": "t1_f206lkw",
                    "score": 0,
                    "created_utc": 1569860757.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "🤦‍♀️",
            "author": null,
            "id": "f21ebig",
            "parent_id": "t1_f204w0u",
            "score": 1,
            "created_utc": 1569871213.0,
            "replies": []
        },
        {
            "body": "It’s because they can.\n\nI think it was Wall Street 2.  Not the best movie.  But they asked the one guy what his number was (who was suppose to be the CEO of essentially Goldman in the movie) and his answer was more.  Why did he trade in the side when he was making 50 a year.  Because his drive was simply for more.  Most of society was based on that adrenaline.\n\nSame thing here.  What’s better than a happy cute educated wife....having a happy cute educated wife and a 20 a year old mistress.",
            "author": "chitraders",
            "id": "f22asuj",
            "parent_id": "t1_f20mff7",
            "score": 7,
            "created_utc": 1569885522.0,
            "replies": []
        },
        {
            "body": "I love this and wish I could upvote 10 more times",
            "author": null,
            "id": "f21fno9",
            "parent_id": "t1_f20gn3v",
            "score": 3,
            "created_utc": 1569871680.0,
            "replies": [
                {
                    "body": "Aww thanks 😙",
                    "author": "unobligatedvirgo",
                    "id": "f22661c",
                    "parent_id": "t1_f21fno9",
                    "score": -1,
                    "created_utc": 1569882699.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "f2046x4",
            "parent_id": "t1_f203hg3",
            "score": 22,
            "created_utc": 1569855050.0,
            "replies": [
                {
                    "body": "Yeah she seems like she’s sharp enough to know something already. If not, she must be super naive which makes me feel bad.",
                    "author": "fannyhoney",
                    "id": "f207mq8",
                    "parent_id": "t1_f2046x4",
                    "score": 7,
                    "created_utc": 1569856282.0,
                    "replies": [
                        {
                            "body": "You feel bad is she is clueless about it, but not bad if she knew?",
                            "author": "SDsugarthrowaway",
                            "id": "f20lo5j",
                            "parent_id": "t1_f207mq8",
                            "score": 7,
                            "created_utc": 1569861124.0,
                            "replies": []
                        },
                        {
                            "body": "She isn’t naive. She has made a choice. \n\nAll women know what a man needs. When she isn’t providing it, he is either a miserable fuck or she is choosing to not care about how he is getting his needs met. \n\nIf I suddenly stopped paying all the house bills, but there was always food in the kitchen... I guess I could call it magic.",
                            "author": "LoftDaddy",
                            "id": "f22fd9r",
                            "parent_id": "t1_f207mq8",
                            "score": -1,
                            "created_utc": 1569887947.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Yes, then there is this. If the wife really is in tune with her hubby she has already noticed the change in general daily “mood” and can probably but two and two together. Who even knows if the wife even cares if he is cheating, or, she could be cheating herself🤦‍♀️ she could be on the sugar momma site for all we (or he) knows🤣",
            "author": null,
            "id": "f21f7ja",
            "parent_id": "t1_f203hg3",
            "score": 1,
            "created_utc": 1569871523.0,
            "replies": []
        },
        {
            "body": "I don’t claim to know anything about that. But he never mentioned anything bad going (or not going) on so there’s that. And my thinking is, she’s wonderful in general (I haven’t factored sex in but I assume she’s a good person to him overall, which is something he hinted at).",
            "author": "fannyhoney",
            "id": "f204m2l",
            "parent_id": "t1_f2036sf",
            "score": 10,
            "created_utc": 1569855209.0,
            "replies": [
                {
                    "body": "He would... a lot of guys are like that. They have nothing bad to say even about the worst women. Especially if they have a child with her.\n\nIf he's on SA then something is missing.",
                    "author": "DreamingLurker",
                    "id": "f2058eh",
                    "parent_id": "t1_f204m2l",
                    "score": 13,
                    "created_utc": 1569855434.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "In this story I’m hoping she is a Sugar Momma",
            "author": null,
            "id": "f21fhz5",
            "parent_id": "t1_f20wt8e",
            "score": 4,
            "created_utc": 1569871624.0,
            "replies": []
        },
        {
            "body": "Lol. Alright 😂",
            "author": "fannyhoney",
            "id": "f20jxyy",
            "parent_id": "t1_f20fsvp",
            "score": 5,
            "created_utc": 1569860548.0,
            "replies": []
        },
        {
            "body": "Possibly.",
            "author": "fannyhoney",
            "id": "f207s1o",
            "parent_id": "t1_f202yjz",
            "score": 7,
            "created_utc": 1569856333.0,
            "replies": []
        },
        {
            "body": "Very probable!",
            "author": "AusterlitzSD",
            "id": "f20tu23",
            "parent_id": "t1_f202yjz",
            "score": -1,
            "created_utc": 1569863997.0,
            "replies": []
        },
        {
            "body": "Wtf is this trash ?? A partner male or female is capable of a healthy bedroom with a hectic career.",
            "author": "Kitoko30",
            "id": "f22k01r",
            "parent_id": "t1_f217dtn",
            "score": 4,
            "created_utc": 1569890680.0,
            "replies": []
        },
        {
            "body": "Thank you for the insight. I have some guilt too and I make an effort to ignore it. On a separate note, you sound pretty cool and smart, I think we would make great friends if you lived where I do.",
            "author": "fannyhoney",
            "id": "f20lwrg",
            "parent_id": "t1_f20kuum",
            "score": 8,
            "created_utc": 1569861206.0,
            "replies": [
                {
                    "body": "Not a problem! I'm sorry for the amount of negativity being thrown your way on this thread - it's definitely something that us SBs have to deal with in the bowl. I hope your POT becomes your SD and you get the arrangement that you want x",
                    "author": "--lilith",
                    "id": "f22115v",
                    "parent_id": "t1_f20lwrg",
                    "score": 4,
                    "created_utc": 1569879734.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Most of these women already know. It doesn't \"destroy\" them lol. It's just something they turn a blind eye to so they can keep 100% of his $$$$$ and resources in their lives.\n\nTrophy wives are a lot more saavy than SBs when it comes to obtaining and retaining wealth. They're in for the long haul Sugar position.\n\nAnd just like SBs have to \"tolerate\" a lot from SDs for a little money ... trophy wives have to tolerate even more because they **get** more.",
            "author": "DreamingLurker",
            "id": "f20mwug",
            "parent_id": "t1_f20kuum",
            "score": 7,
            "created_utc": 1569861549.0,
            "replies": [
                {
                    "body": "👀👀👀👀",
                    "author": "windwinter",
                    "id": "f21xxri",
                    "parent_id": "t1_f20mwug",
                    "score": 1,
                    "created_utc": 1569878249.0,
                    "replies": [
                        {
                            "body": "👂👂👂👂",
                            "author": "DreamingLurker",
                            "id": "f22mh5r",
                            "parent_id": "t1_f21xxri",
                            "score": 1,
                            "created_utc": 1569892015.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "This! Very well said. No one likes a snoop. Being judgmental in the bowl ( on either side) is the biggest paradox that I have noted and usually ends up affecting the person judging more than anyone else.",
            "author": "supportiveceo",
            "id": "f20p2ez",
            "parent_id": "t1_f20cw8h",
            "score": 4,
            "created_utc": 1569862289.0,
            "replies": []
        },
        {
            "body": "Great answer!",
            "author": "AusterlitzSD",
            "id": "f20tslo",
            "parent_id": "t1_f20cw8h",
            "score": 2,
            "created_utc": 1569863980.0,
            "replies": []
        },
        {
            "body": "You don’t have to go to Google, Reddit has a huge dead bedroom following.",
            "author": "SDforreal",
            "id": "f20n9mo",
            "parent_id": "t1_f20lly5",
            "score": 2,
            "created_utc": 1569861676.0,
            "replies": []
        },
        {
            "body": "Your first statement? Yes. Sushi. One meal every day for the rest of my life. Easily. \n\nAnd if I eat grapes in my fridge that have desiccated and become a science experiment? I have emotional issues beyond not buying fresh grapes 😂\n\nI do get your point though. Just being a smart ass 😂",
            "author": "SDRippington",
            "id": "f21oabb",
            "parent_id": "t1_f21d2it",
            "score": 2,
            "created_utc": 1569874627.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "f21tyyt",
            "parent_id": "t1_f21cxxn",
            "score": 4,
            "created_utc": 1569876757.0,
            "replies": [
                {
                    "body": "I’m a SB too, but I don’t deal with married men. I put myself in their spouses’ shoes, and since I’d hate if that ever happened to me I don’t allow myself to be used as a tool by cheating husbands.\nOne doesn’t have to accept and be ok with what every single SD does to be in the bowl. You know that, right...?",
                    "author": null,
                    "id": "f2227r1",
                    "parent_id": "t1_f21tyyt",
                    "score": 1,
                    "created_utc": 1569880387.0,
                    "replies": [
                        {
                            "body": "I admire you! 🥰",
                            "author": "absthaw",
                            "id": "fkxck23",
                            "parent_id": "t1_f2227r1",
                            "score": 2,
                            "created_utc": 1584625033.0,
                            "replies": []
                        },
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "f227sxt",
                            "parent_id": "t1_f2227r1",
                            "score": 2,
                            "created_utc": 1569883728.0,
                            "replies": [
                                {
                                    "body": "I state in my profile that I don’t deal with married men. Also, they have very limited schedule and so much to hide that it isn’t worth the risk for them to have to lie and trick 2 different women on a daily basis. So, NOT a dream. Just being practical and objective!\n\nAlso, I’m doing my part in stating that I don’t date married men, but I’m not responsible for grown ass men lying about their lives AND cheating. I am responsible for doing MY part though, and I will continue doing it to the best of my abilities!",
                                    "author": null,
                                    "id": "f228zev",
                                    "parent_id": "t1_f227sxt",
                                    "score": -1,
                                    "created_utc": 1569884424.0,
                                    "replies": [
                                        {
                                            "body": "[deleted]",
                                            "author": null,
                                            "id": "f23i67s",
                                            "parent_id": "t1_f228zev",
                                            "score": 2,
                                            "created_utc": 1569926060.0,
                                            "replies": [
                                                {
                                                    "body": "Like I said, I have a conscience, and I am responsible for my actions only, and not other people’s.\n\nI will not allow people choosing to hurt and deceive others to influence my behavior. I know right from wrong and that won’t change just because so many other people are ok with hurting their loved ones and living a lie.",
                                                    "author": null,
                                                    "id": "f23w0d0",
                                                    "parent_id": "t1_f23i67s",
                                                    "score": 1,
                                                    "created_utc": 1569939044.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "No, he's cheating because he wants to.",
            "author": "nerojt",
            "id": "f23k8vt",
            "parent_id": "t1_f21cxxn",
            "score": 2,
            "created_utc": 1569928729.0,
            "replies": []
        },
        {
            "body": "> Why he'd actually do it is a different thing. When I've been in monogamous relationships, I've always wanted other women too, but have remained faithful because the thought of the pain it would cause to the woman I cared about if she caught me was not worth the risk. His assessment of that risk/reward is different than mine and I do judge him for it. Also, he swore a vow to her, in front of their friends and family, and I judge him for breaking that, too. Unless they've discussed it and she's ok with him doing this, of course.\n\nI think this is a pretty reasonable take. To be honest, I kind of wish the potential pain + vows part would get mentioned more often.",
            "author": "sugarfatty",
            "id": "f234zsn",
            "parent_id": "t1_f22w80c",
            "score": 2,
            "created_utc": 1569906308.0,
            "replies": []
        },
        {
            "body": "Gold! Nice.",
            "author": "fannyhoney",
            "id": "f21d56j",
            "parent_id": "t1_f20demx",
            "score": 4,
            "created_utc": 1569870800.0,
            "replies": []
        },
        {
            "body": "At the end of the day - Your wife does sound amazing though brother - what field of research is she in?\n\nJust a little advice though - you might want to next this POT SB - she seems a little nuts (like, the boil your rabbit kind)...",
            "author": "tankbinding",
            "id": "f2130ft",
            "parent_id": "t1_f20demx",
            "score": 0,
            "created_utc": 1569867239.0,
            "replies": [
                {
                    "body": "Ha, I think you posted this comment to the wrong place. I'm not married, and all of my sbs are the crazy boil-your-rabbit kind. :)",
                    "author": "TastySpermDispenser",
                    "id": "f21605y",
                    "parent_id": "t1_f2130ft",
                    "score": 5,
                    "created_utc": 1569868352.0,
                    "replies": [
                        {
                            "body": "Which is why you keep a room of caged rabbits on hand.\n\nNot judging. Just saying.\n\n😂",
                            "author": "SDRippington",
                            "id": "f21m8ep",
                            "parent_id": "t1_f21605y",
                            "score": 2,
                            "created_utc": 1569873884.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Rabbit is good eatin’.",
                    "author": "AshcanWhispers",
                    "id": "f21ra4e",
                    "parent_id": "t1_f2130ft",
                    "score": 0,
                    "created_utc": 1569875743.0,
                    "replies": []
                }
            ]
        },
        {
            "body": ">Imagine you had an eating disorder.\n\nBy this do you mean \"Don't like S'mores?!? or possibly \"Like to eat Peeps rather than make them fight to the death for sport\"?!?",
            "author": "tankbinding",
            "id": "f20xjhh",
            "parent_id": "t1_f20demx",
            "score": 0,
            "created_utc": 1569865279.0,
            "replies": [
                {
                    "body": "Oh, come on now. We all know those two are mental disorders, not eating ones. :)",
                    "author": "TastySpermDispenser",
                    "id": "f20zyh1",
                    "parent_id": "t1_f20xjhh",
                    "score": 3,
                    "created_utc": 1569866117.0,
                    "replies": []
                },
                {
                    "body": "Ugh.\n\nIf I was stuck in a room full of peeps and my choice was to die or eat my way out?\n\nGlad my will is up to date - cuz I’m gonna die...",
                    "author": "SDRippington",
                    "id": "f21m1x5",
                    "parent_id": "t1_f20xjhh",
                    "score": 1,
                    "created_utc": 1569873821.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I have no intention to interact with her. It was just a curiosity. I’m not setting out to ruin this man’s life. I really feel like I’m being misunderstood here. He has his life and I’ve got mine. \n\nBut on a separate note, in a different world I’d definitely seduce the shit out of here. She seems like my type.",
            "author": "fannyhoney",
            "id": "f20oi5k",
            "parent_id": "t1_f20n0nn",
            "score": 10,
            "created_utc": 1569862097.0,
            "replies": [
                {
                    "body": "I won’t judge your curiosity. If I judge anything it’s your decision to bring questions like this to a group that would most likely beat you into submission because of the inherent security risks of the lifestyle. Nobody likes a bunny boiler - which usually starts by the more “inquisitive” ones.\n\nI can say every SB I’ve dated I’ve pretty much crawled up their life and social-ass with a microscope. 90% Mostly to protect ME. 10% or maybe a little less? I really am genuinely curious about what makes them “tick” and how I see whether their lives reflect what I see on all their social media.\n\nIt also gives me awesome insight to gift ideas for them when I see hidden passions they might have they never really share with anyone 😁\n\nThing is? All of my SB’s know me. They also know that I know them. They also know I will answer anything they ever ask honestly, but that comes with the risk they might not like my answers.\n\nFor the most part I’ve picked SB’s that have a solid head on their shoulders and a drive to be more in life then what they are. They’re all go getters, kind, considerate and are very amazing people, and I adore and love each of them in their own way.",
                    "author": "SDRippington",
                    "id": "f21npuy",
                    "parent_id": "t1_f20oi5k",
                    "score": 1,
                    "created_utc": 1569874427.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Totally this for me on the variety side of things.   I’m not really into anything all that crazy but my shit has a shelf life. Like to get some good use out of it before I turn back into stardust.",
            "author": "usa968676",
            "id": "f20yv61",
            "parent_id": "t1_f20pekx",
            "score": 1,
            "created_utc": 1569865734.0,
            "replies": []
        },
        {
            "body": "It won’t happen but wouldn’t that be an interesting sight to see? 😂",
            "author": "SDRippington",
            "id": "f21nv61",
            "parent_id": "t1_f212h6v",
            "score": 1,
            "created_utc": 1569874477.0,
            "replies": []
        },
        {
            "body": "I’m well aware of my place. I’m just curious. I want to understand men better but I know this doesn’t have consequence on me.",
            "author": "fannyhoney",
            "id": "f207a0h",
            "parent_id": "t1_f206zbf",
            "score": 5,
            "created_utc": 1569856161.0,
            "replies": []
        },
        {
            "body": "I also feel bad for her in a way.",
            "author": "fannyhoney",
            "id": "f207hq6",
            "parent_id": "t1_f206zbf",
            "score": 3,
            "created_utc": 1569856234.0,
            "replies": [
                {
                    "body": "Don't have to. She probably knows that he has plenty of snacks outside. And what matters is he brings the cheque home and goes home to the wife. I am speaking as my experience as a mistress. Most wife knows their husband's drama out there. And many will decide to close one eye.",
                    "author": "JELxin",
                    "id": "f20843p",
                    "parent_id": "t1_f207hq6",
                    "score": 0,
                    "created_utc": 1569856458.0,
                    "replies": [
                        {
                            "body": "Okay but why would someone like her put up with that in the presence of other options? She makes a lot of money too.",
                            "author": "fannyhoney",
                            "id": "f208ys0",
                            "parent_id": "t1_f20843p",
                            "score": 1,
                            "created_utc": 1569856766.0,
                            "replies": [
                                {
                                    "body": "What other options do you assume she has? Get divorced, be a single mom trying to date? Some women enjoy that, some don't. Find a side piece of her own? How do you know she doesn't have that already?\n\nI think you're putting yourself in her place and thinking about how awful it must be for her. 1 Don't assume you know how she feels about the situation. 2 If she's in some awful situation, most people it's a place of their own choosing.",
                                    "author": "2fast-2curious",
                                    "id": "f209hrc",
                                    "parent_id": "t1_f208ys0",
                                    "score": 7,
                                    "created_utc": 1569856962.0,
                                    "replies": [
                                        {
                                            "body": "This SB is overthinking. LOL.",
                                            "author": "JELxin",
                                            "id": "f20ia7h",
                                            "parent_id": "t1_f209hrc",
                                            "score": 2,
                                            "created_utc": 1569860031.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "She's the queen. The queen will always remain in her throne. Whereas you are just the little side piece. Men like to have many woman since ancient times. Whats new? And I sure the wife knows this and enjoys being the queen and many side pieces eyeing her throne. But too bad she probably can't be bothered with the side piece. And she knows this is just a passing phase of you coming inside the picture for awhile. Lol",
                                    "author": "JELxin",
                                    "id": "f20i2yc",
                                    "parent_id": "t1_f208ys0",
                                    "score": 6,
                                    "created_utc": 1569859971.0,
                                    "replies": []
                                },
                                {
                                    "body": "Women tend to value men who are higher status than them.  The higher the status the better.  Unfortunately in today’s society, high status men have a lot of options. You’re more likely to be cheated on by a surgeon than a mailman, since the mailman most likely can’t afford to be on SA. But you’re more attracted to the surgeon so you make little deals with yourself and turn a blind eye because of his perceived value. It’s been happening since the beginning of time.  Ask yourself if most women would rather be the wife of a Prince who occasionally strays or the wife of a plumber who is faithful. I think you know the answer.",
                                    "author": "nhceo",
                                    "id": "f21nuv7",
                                    "parent_id": "t1_f208ys0",
                                    "score": 4,
                                    "created_utc": 1569874474.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "f21ug6k",
            "parent_id": "t1_f215ak5",
            "score": 6,
            "created_utc": 1569876929.0,
            "replies": [
                {
                    "body": "You seem to be somewhat skeptical or is it cynical I can’t tell.?\nWhat runs stringer in my blood is my desire to fuck as many different females as I can not some stupid ass religious marriage vows made up by someone who’s either fucking alter boys or raping nuns.\nTake the college course, Human Growth and Development, you’ll learn that YES we are biologically programmed this way as makes.",
                    "author": "Sah-Bum-Nim",
                    "id": "f3arkw8",
                    "parent_id": "t1_f21ug6k",
                    "score": 1,
                    "created_utc": 1570788143.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "SBs look up pot SDs all the time. It’s for our safety and to make sure this person is not a pedophile/criminal/psychopath etc. It’s routine for most of us and some SDs do it too. I just happened to stumble upon information that I found bizarre and wanted to share it. I have no intentions of reaching out to her or blackmailing, if that’s what you meant by “creepy”. Peace!",
            "author": "fannyhoney",
            "id": "f20jrld",
            "parent_id": "t1_f20hlgs",
            "score": 8,
            "created_utc": 1569860487.0,
            "replies": [
                {
                    "body": "“SBs look up pot SDs all the time. It’s for our safety and to make sure this person is not a pedophile/criminal/psychopath etc”\n\nTo be fair, ensuring safety has little to nothing to do with wifey. \n\n“I just happened to stumble upon information that I found bizarre and wanted to share it. “\n\nIts this type of statement that is getting you downvoted. My intent is not to judge or chastise you, simply pointing it out since you mentioned your downvotes. Its not “bizarre” at all, it is indeed quite common, otherwise SA wouldn’t even begin to exist.",
                    "author": null,
                    "id": "f21m667",
                    "parent_id": "t1_f20jrld",
                    "score": 0,
                    "created_utc": 1569873862.0,
                    "replies": []
                },
                {
                    "body": "> and to make sure this person is not a pedophile/criminal/psychopath etc\n\nWhat does this even mean? Is there a National Database of Pedophiles, Criminals, and Psychopaths? Does that database also have information about science ladies?\n\nCome on, now. You were creeping on him and his wife out of curiosity, not safety.",
                    "author": "mySLFalt",
                    "id": "f21k0jo",
                    "parent_id": "t1_f20jrld",
                    "score": -1,
                    "created_utc": 1569873129.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I do podcasts everyday and I was just done reading my book. Can recommend you stuff if you like. 😊",
            "author": "fannyhoney",
            "id": "f20j4h0",
            "parent_id": "t1_f20hlgs",
            "score": 2,
            "created_utc": 1569860289.0,
            "replies": []
        },
        {
            "body": "Agree with this - every stalker is just \"curious\"! \n\nIf he completely researched her family \"on the internet\" & \"out of curiosity\" - just to try and understand how her relationship with her parents and siblings led her to the life of a \"sex worker\" it would probably seem a lot more \"stalkerish\" to her. While her satisfying her curiosity is probably completely reasonable (although I'm sure diving into the details of his wife's career is out of concern for her safety).\n\nDoes she realise that if her parents found out about her secret lifestyle it would probably ruin their lives??",
            "author": "tankbinding",
            "id": "f20oyu3",
            "parent_id": "t1_f20hlgs",
            "score": 0,
            "created_utc": 1569862254.0,
            "replies": []
        },
        {
            "body": "No she is a fuck buddy",
            "author": "sanfran4fun",
            "id": "f26b3vo",
            "parent_id": "t1_f20jk1j",
            "score": 2,
            "created_utc": 1570001161.0,
            "replies": []
        },
        {
            "body": "He openly talks about his wife and family quite often without me asking. I got curious. I’m over it now. Thank you.",
            "author": "fannyhoney",
            "id": "f21ege3",
            "parent_id": "t1_f21e726",
            "score": 5,
            "created_utc": 1569871260.0,
            "replies": []
        },
        {
            "body": "I’m no flawless 19 yo myself. 😂",
            "author": "fannyhoney",
            "id": "f20b4xw",
            "parent_id": "t1_f20auss",
            "score": 5,
            "created_utc": 1569857567.0,
            "replies": []
        },
        {
            "body": "Really now?\n\nOP doesn’t know anything. You don’t know anything. None of us know a damn thing. For all we know, social media could be spot on and she’s an angel and he’s a fucking douchebag. Or. She could be Satan’s Mistress and be a complete harpy hell-demon to live with and sucks his soul to stay young and vibrant - none of us know a thing.\n\nJudge an SR on its merits and leave it at that. Projecting anger at him (or her the OP) without knowing what’s real is wasted emotion.\n\nI feel your statement just came off as wickedly judgmental and projecting  - or did I miss something?",
            "author": "SDRippington",
            "id": "f21kx32",
            "parent_id": "t1_f21d5nw",
            "score": 18,
            "created_utc": 1569873435.0,
            "replies": [
                {
                    "body": "This! :)",
                    "author": "captainIsBack4u",
                    "id": "f21o8mq",
                    "parent_id": "t1_f21kx32",
                    "score": 3,
                    "created_utc": 1569874609.0,
                    "replies": []
                },
                {
                    "body": "deleted  ^^^^^^^^^^^^^^^^0.3531  [^^^What ^^^is ^^^this?](https://pastebin.com/FcrFs94k/00714)",
                    "author": null,
                    "id": "f232sz3",
                    "parent_id": "t1_f21kx32",
                    "score": 3,
                    "created_utc": 1569904094.0,
                    "replies": [
                        {
                            "body": "So much YES to this!!! 👆🏻👏🏻",
                            "author": null,
                            "id": "f23vnn0",
                            "parent_id": "t1_f232sz3",
                            "score": 1,
                            "created_utc": 1569938790.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Cheating is wrong, PERIOD! Stop trying to make excuses for shitty behavior. Cheating is only ok for you men when YOU are the ones doing it, but not the ones being cheated on. Please quit being a hypocrite!",
                    "author": null,
                    "id": "f23vi7r",
                    "parent_id": "t1_f21kx32",
                    "score": 2,
                    "created_utc": 1569938683.0,
                    "replies": [
                        {
                            "body": "> Please quit being a hypocrite!\n\nExactly. This has been my entire point. Everyone in the bowl is a hypocrite by nature of this game itself. I've always said \"own your decision\". I've never said anything but.\n\n_\"Fucking for money is okay, but only under special, specific circumstances that fit my current sense of morality.\"_\n\nWhat. Ever. People are going to have sex with who they want to have sex with under whatever guise of \"willful blindness\" they choose that fits their sense of morality for the day. \n\nOne thing I know with absolute certainty? If it's not you they're having sex with and paying money for that privilege, it most certainly will be with someone else. Nothing hypocritical about that observation. Think about that the next time you collect your PPM.\n\nWe should all be careful of falling off our high horses. Bones could break.",
                            "author": "SDRippington",
                            "id": "f23zlmx",
                            "parent_id": "t1_f23vi7r",
                            "score": 1,
                            "created_utc": 1569941502.0,
                            "replies": [
                                {
                                    "body": "AAH, another cheater trying to justify his shitty behavior. Karma will get back at you though, and what you are doing to your wife will come back to you eventually. And boy, that pain will hurt!",
                                    "author": null,
                                    "id": "f24irlv",
                                    "parent_id": "t1_f23zlmx",
                                    "score": 1,
                                    "created_utc": 1569953055.0,
                                    "replies": [
                                        {
                                            "body": "Not only are you judgmental AF, you just assumed I’m still married and not already in the middle of an amicable divorce?\n\nTotally not surprised 😊😂😂\n\nKarma already HAS dear by blessing me with women that actually deeply care for me and my wants and desires.\n\nSo please, with all due respect, with sugar on top, go fuck yourself 😂",
                                            "author": "SDRippington",
                                            "id": "f24l998",
                                            "parent_id": "t1_f24irlv",
                                            "score": 2,
                                            "created_utc": 1569954851.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "At 18 or 19 one doesnt have all the answers. Assuming here, but what if she went into it thinking the SDs are miserable in their marriages and she can help while being helped. Only to realize that SO looks perfect (from the outside atleast), and hence the post.\n\nAnd empathizing doesnt mean taking food out of your plate to feed others while you go hungry. All you have to have is a caring heart to relate to the hunger someone else feels.",
            "author": "captainIsBack4u",
            "id": "f21ik5j",
            "parent_id": "t1_f21d5nw",
            "score": 5,
            "created_utc": 1569872647.0,
            "replies": [
                {
                    "body": "deleted  ^^^^^^^^^^^^^^^^0.4561  [^^^What ^^^is ^^^this?](https://pastebin.com/FcrFs94k/26654)",
                    "author": null,
                    "id": "f232x4y",
                    "parent_id": "t1_f21ik5j",
                    "score": 1,
                    "created_utc": 1569904205.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "f22ptux",
            "parent_id": "t1_f21d5nw",
            "score": 1,
            "created_utc": 1569894105.0,
            "replies": [
                {
                    "body": "Uh, she clearly knows the guy is married. What kind of question is that...? Lol",
                    "author": null,
                    "id": "f22rb7v",
                    "parent_id": "t1_f22ptux",
                    "score": -2,
                    "created_utc": 1569895140.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "f22s54v",
                            "parent_id": "t1_f22rb7v",
                            "score": 0,
                            "created_utc": 1569895709.0,
                            "replies": [
                                {
                                    "body": "deleted  ^^^^^^^^^^^^^^^^0.7950  [^^^What ^^^is ^^^this?](https://pastebin.com/FcrFs94k/10303)",
                                    "author": null,
                                    "id": "f232y8t",
                                    "parent_id": "t1_f22s54v",
                                    "score": 1,
                                    "created_utc": 1569904234.0,
                                    "replies": []
                                },
                                {
                                    "body": "No it is not, because it takes 2 to cheat!",
                                    "author": null,
                                    "id": "f22z2l4",
                                    "parent_id": "t1_f22s54v",
                                    "score": -1,
                                    "created_utc": 1569900751.0,
                                    "replies": [
                                        {
                                            "body": "She’s not cheating. He is. Lmao.",
                                            "author": "LaNouvelleSugar",
                                            "id": "f23f9ev",
                                            "parent_id": "t1_f22z2l4",
                                            "score": 1,
                                            "created_utc": 1569921432.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "She isn’t intentionally hurting anyone. The husband is. Are we blaming Op for her choices?",
            "author": "LaNouvelleSugar",
            "id": "f23f8iy",
            "parent_id": "t1_f21d5nw",
            "score": 1,
            "created_utc": 1569921390.0,
            "replies": []
        },
        {
            "body": "You're the tool.  Who said the wife was hurt?",
            "author": "nerojt",
            "id": "f23k6mb",
            "parent_id": "t1_f21d5nw",
            "score": 0,
            "created_utc": 1569928656.0,
            "replies": [
                {
                    "body": "So, you are telling me that if and when the wife finds out her husband is a cheater she won’t be hurt. REALLY...??? I hope you are in that wife’s shoes someday, and I will be here waiting to hear about how happy you are that your spouse is cheating on you constantly behind your back! Quit being a hypocrite!!!\n\nPS: Not surprised to find out you are ALSO a cheater though! Typical...",
                    "author": null,
                    "id": "f23w77d",
                    "parent_id": "t1_f23k6mb",
                    "score": 1,
                    "created_utc": 1569939177.0,
                    "replies": [
                        {
                            "body": "I've never cheated. Also, the wife has not been hurt.",
                            "author": "nerojt",
                            "id": "f25q81m",
                            "parent_id": "t1_f23w77d",
                            "score": 2,
                            "created_utc": 1569980971.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Not everyone is built to be monogamous and our society only promotes monogamy as the only way to live. Some people can mate forever to one person. Most can't 🤷‍♀️ we need to work on education and acceptance of various lifestyles and relationship choices. \nHim cheating on her behind her back has nothing to do with her or how great she is. Fuck, Jay Z fucked around Beyonce's back. If Beyonce can get cheated on, anyone can get cheated on 😂",
            "author": "Devon_Bunny",
            "id": "f21hs2l",
            "parent_id": "t1_f21fn7x",
            "score": 30,
            "created_utc": 1569872382.0,
            "replies": [
                {
                    "body": "> need to work on education and acceptance of various lifestyles and relationship choices.  -  like single",
                    "author": "pinotandsugar",
                    "id": "f226830",
                    "parent_id": "t1_f21hs2l",
                    "score": 11,
                    "created_utc": 1569882740.0,
                    "replies": [
                        {
                            "body": "Haha truth or poly 😘",
                            "author": "theAliasOfAlias",
                            "id": "f22qmzl",
                            "parent_id": "t1_f226830",
                            "score": 2,
                            "created_utc": 1569894665.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "It’s true I wouldn’t say it. And it’s not either/or. The two are not mutually exclusive.",
            "author": "RealEarthAngel",
            "id": "f40cusg",
            "parent_id": "t1_f21fn7x",
            "score": 1,
            "created_utc": 1571294090.0,
            "replies": []
        },
        {
            "body": "I’m not trying to decipher anything… I simply understand why a lot of men cheat.  People never do things for no reason. Men cheat for a reason and the reason is within them.\nAnd that has nothing to do with why women become SBs. Again, each person has their own reason.  Apples and oranges.",
            "author": "RealEarthAngel",
            "id": "f40cmw2",
            "parent_id": "t1_f22yz8c",
            "score": 1,
            "created_utc": 1571293791.0,
            "replies": []
        },
        {
            "body": "So...you’d rather a woman fucked an older guy who was married for money instead of an older guy who is single?",
            "author": "LaNouvelleSugar",
            "id": "f21mi43",
            "parent_id": "t1_f21lrmm",
            "score": 6,
            "created_utc": 1569873975.0,
            "replies": [
                {
                    "body": "Wow. You truly missed my point completely didn’t ya?",
                    "author": "SDRippington",
                    "id": "f21s4a7",
                    "parent_id": "t1_f21mi43",
                    "score": -2,
                    "created_utc": 1569876070.0,
                    "replies": [
                        {
                            "body": "I really did. Would you kindly explain?",
                            "author": "LaNouvelleSugar",
                            "id": "f21sdry",
                            "parent_id": "t1_f21s4a7",
                            "score": 4,
                            "created_utc": 1569876173.0,
                            "replies": [
                                {
                                    "body": "It seems that a few women here exercise selective morality enforcement with respect to societal “norms”\n\nMany women seem perfectly okay to fuck an older guy for money if he’s single, yet they throw shade on fucking an older guy for money if he’s married.\n\nThey don’t even consider the “for money” part really because they benefit. They only consider the “married” part because it’s a choice someone ELSE made and would in part, through some twisted sense of self, would make her feel “dirty” because he’s married - NOT that she’s fucking for cash.\n\nAnd one step further? I’ve known some SB’s that vehemently avoid fucking married OLDER guys but were more than okay to fuck the HOT young married guy for money cuz, well, his wife is obviously a bitch for not taking his gorgeous “D” for a ride, that poor, young, broken man.\n\nI’ve been on this forum (and in the bowl) long enough to see all sides of the selective morality dance. And it never changes. 😂\n\nEDIT: And the downvotes on this is AMAZING which only proves my point about all the butthurt snowflakes that cringe at the truth :)",
                                    "author": "SDRippington",
                                    "id": "f21ud7l",
                                    "parent_id": "t1_f21sdry",
                                    "score": -1,
                                    "created_utc": 1569876899.0,
                                    "replies": [
                                        {
                                            "body": "To be perfectly honest, Whether you’re fucking for money or for whatever other reason that’s people’s personal problems. No one here should be judgmental. At all.",
                                            "author": "LaNouvelleSugar",
                                            "id": "f23f76j",
                                            "parent_id": "t1_f21ud7l",
                                            "score": 1,
                                            "created_utc": 1569921326.0,
                                            "replies": [
                                                {
                                                    "body": "That’s my point.",
                                                    "author": "SDRippington",
                                                    "id": "f23iv4w",
                                                    "parent_id": "t1_f23f76j",
                                                    "score": 2,
                                                    "created_utc": 1569927002.0,
                                                    "replies": [
                                                        {
                                                            "body": "Whereas that might be your point, you do sound a bit judgmental yourself. Just letting you know",
                                                            "author": "LaNouvelleSugar",
                                                            "id": "f23jgpd",
                                                            "parent_id": "t1_f23iv4w",
                                                            "score": 1,
                                                            "created_utc": 1569927778.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Of course! Especially towards hypocritical people.\nThe irony is not lost on me.😂",
                                                                    "author": "SDRippington",
                                                                    "id": "f23jtvl",
                                                                    "parent_id": "t1_f23jgpd",
                                                                    "score": 1,
                                                                    "created_utc": 1569928231.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I’ve met enough people who actually are.",
            "author": "RealEarthAngel",
            "id": "f40ct11",
            "parent_id": "t1_f21vqvt",
            "score": 4,
            "created_utc": 1571294024.0,
            "replies": []
        },
        {
            "body": "Your description of her very closely mirrors a woman I worked for in the past - crazy successful, beautiful, amazing philanthropist, put on a show about helping children, relatively intelligent, ran in the “right,” highly noticeable and affluent circles, had the “perfect family.”\nHer “catch”?  She was a raging, hateful bitch!  Seriously. No one in her life, from the mailman, to her assistant (me), and sadly also to her super sweet, phenomenally successful husband, was beyond the grasp of her wrath.  It was the best paying job, both monetarily and benefits-wise, that I’ve ever had and I high-tailed it out of there in less than 3 months because I have a spine and a mouth, and a snarky attitude at times, and she insisted on testing everyone around her, every day.  She and her husband put on a VERY believable charade, but in reality he’d been diddling his secretary for all of time (hey at least he stuck to the same woman, who was age-appropriate - they were in their late l-70’s lol), were in separate rooms 98% of the time, and only exchanged words via phone and hand-written notes. Granted it was relatively amicable, and I’m sure he had his own faults that contributed to the shit-show.  The thing that I did always appreciate though was that regardless of how things were, they still constantly told one another how much they loved, respected, and appreciated one another.  And it wasn’t for show.  At least it didn’t seem that way.  The son on the other hand - WHEW!  Grumpy thing he was, but completely understandable given the environment. \n\nNot saying that that is definitely, or even likely, the case with your subject here, but its very common.  Some people stay busy and paint a pretty picture on the outside to cover up the inside. Some do it out of insecurity, some because they have a genuine passion for every last thing that they’re involved in (they are highly fortunate, though its not beyond anyone’s grasp!). A LOT do it to be “better than,” to keep up with or out-do someone else, or just because they’re bored. \n\nI saw that you stated that you “vetted” him as well. What were/are your resources for doing so?   (I am curious as I have never really gone off of anything aside from my gut feeling, and I can honestly say it hasn’t steered me wrong as of yet). Again, words and photos can paint a hell of a picture, and as a society highly based on aesthetic and status, it is easily bought into.  Unfortunately, more often than not it is all a facade.   I’d say the “asshole” scenario is a 50/50 chance. \n\nSorry for the novel :) ive been on here for EVER, and have never commented on anything lol\n\nEDIT:  Forgot to include... you said you thought “how do I compare.”  Don’t be hard on yourself.  You are just as capable of attaining the very same things she has. But remember - he is looking elsewhere because he wants someone/something COMPLETELY DIFFERENT.  ;)",
            "author": null,
            "id": "f21hfsy",
            "parent_id": "t1_f205si1",
            "score": 5,
            "created_utc": 1569872268.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "f23npjw",
                    "parent_id": "t1_f21hfsy",
                    "score": 2,
                    "created_utc": 1569932385.0,
                    "replies": [
                        {
                            "body": "Hey I’m all about encouragement!  :) we are all smart, and obviously motivated.  If you (or anyone) ever needs to talk or whatever, I am always here!",
                            "author": null,
                            "id": "f23tru7",
                            "parent_id": "t1_f23npjw",
                            "score": 1,
                            "created_utc": 1569937415.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "deleted  ^^^^^^^^^^^^^^^^0.3155  [^^^What ^^^is ^^^this?](https://pastebin.com/FcrFs94k/01917)",
            "author": null,
            "id": "f232zsp",
            "parent_id": "t1_f205si1",
            "score": 1,
            "created_utc": 1569904275.0,
            "replies": []
        },
        {
            "body": "I know you're not saying this, but you seem to be implying if she were a high school grad working as say a waitress that you'd understand him cheating on her more?",
            "author": "tenmillionplus",
            "id": "f20n11z",
            "parent_id": "t1_f206vhu",
            "score": 10,
            "created_utc": 1569861590.0,
            "replies": [
                {
                    "body": "Women tend to value education highly in their Male partners while it doesn't really matter the other way around.\n\nIt's not surprising she'd think that because as a women, she'd value if her guy was a researcher.",
                    "author": "DarkMatter731",
                    "id": "f20z3es",
                    "parent_id": "t1_f20n11z",
                    "score": 5,
                    "created_utc": 1569865814.0,
                    "replies": [
                        {
                            "body": ">Women tend to value education highly in their Male partners while it doesn't really matter the other way around.\n\nI disagree. Educated men prefer educated women for wives. When was the last time you heard of a doctor marrying a barista? People generally prefer to marry within their class.",
                            "author": null,
                            "id": "f22f83t",
                            "parent_id": "t1_f20z3es",
                            "score": 11,
                            "created_utc": 1569887860.0,
                            "replies": []
                        },
                        {
                            "body": "Yeah I always laugh at these SB profiles that state how many languages they speak ... wow does she know what guys want 🤣",
                            "author": "lookingforlaughter",
                            "id": "f23frhx",
                            "parent_id": "t1_f20z3es",
                            "score": 3,
                            "created_utc": 1569922293.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Pot SBs ask me at every M&G why I am on SA. I am happy when they do, because I know it's on their minds, and want to clear the air. If they don't like my response, we both move on, and if they do, the issue is out of the way.",
            "author": null,
            "id": "f494rcp",
            "parent_id": "t1_f206vhu",
            "score": 2,
            "created_utc": 1571456851.0,
            "replies": []
        },
        {
            "body": ">I looked her up all over the internet...and I don’t want to be intrusive.\n\nThe thing is: you already are intrusive. He just doesn't know it. Just make sure he never finds out that you're researching his wife because if it were me, I would block you immediately.",
            "author": "AusterlitzSD",
            "id": "f20ul6a",
            "parent_id": "t1_f206vhu",
            "score": 7,
            "created_utc": 1569864261.0,
            "replies": [
                {
                    "body": "Upvote. Point to note: SB should never be poking nose into SD's home affair.",
                    "author": "JELxin",
                    "id": "f211rr8",
                    "parent_id": "t1_f20ul6a",
                    "score": 14,
                    "created_utc": 1569866788.0,
                    "replies": [
                        {
                            "body": "Always the classy SB JELxin",
                            "author": "AusterlitzSD",
                            "id": "f21khr4",
                            "parent_id": "t1_f211rr8",
                            "score": -1,
                            "created_utc": 1569873289.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "There shouldn't only be one reason for this action.  What about curiousity?  Which is related to taking an interest in the other party, whcih is what we SDs often complain about SBs lacking!",
                    "author": "nycballetlover",
                    "id": "f24wxbv",
                    "parent_id": "t1_f20ul6a",
                    "score": 2,
                    "created_utc": 1569961786.0,
                    "replies": [
                        {
                            "body": "Heh. I had one SB that I researched. She had an alt Intstagram profile of her at the firing range, and discussing competition pistols. Apparently some of her more \"liberal\" friends at college would have lost their shit if they knew.\n\nSo when she came by for our second intimate date I smiled and mentioned I had researched her a little and she was like \"Uh oh. What did you find out?\" I went \"here\", opened a fingerprint lock box sitting on the counter, pulled out my compensated and tricked out .45, plopped it on the counter in front of her and said \"strip it.\" \n\nShe smiled wider than I have ever seen a woman smile and proceeded to tear it down with practiced skill.\n\n(no, I didn't have rounds in the magazine. I wasn't stupid.) LMAO!\n\nAnd yes we're still good friends. But the little shit kept my damn pistol. I offered her that or a laptop later as a gift. She chose the pistol. She's a lifelong keeper. :-)",
                            "author": "SDRippington",
                            "id": "f2775na",
                            "parent_id": "t1_f24wxbv",
                            "score": 1,
                            "created_utc": 1570032006.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "I’m an SB and if I was a married SD and found this out I would be pissed the hell off. And this guy is a POT meaning you don’t even really know him? I hope she is careful with this info",
                    "author": null,
                    "id": "f21eoc7",
                    "parent_id": "t1_f20ul6a",
                    "score": 3,
                    "created_utc": 1569871337.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Lived this. Ex wife was also a scientist, physicist at NASA. Not exactly a part time gig.",
            "author": "LoftDaddy",
            "id": "f22f6pk",
            "parent_id": "t1_f206lkw",
            "score": 4,
            "created_utc": 1569887837.0,
            "replies": [
                {
                    "body": "Yeah,  you were an accessory on par with a handbag.  My ex is only an interior designer but her online persona would make her look like the female version of the Dos Equis guy.  I funded that fraud for a long time.",
                    "author": "LotBuilder",
                    "id": "f22gg87",
                    "parent_id": "t1_f22f6pk",
                    "score": 4,
                    "created_utc": 1569888527.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "This \\^",
            "author": "DreamingLurker",
            "id": "f20kkjc",
            "parent_id": "t1_f206lkw",
            "score": 0,
            "created_utc": 1569860757.0,
            "replies": []
        },
        {
            "body": "Aww thanks 😙",
            "author": "unobligatedvirgo",
            "id": "f22661c",
            "parent_id": "t1_f21fno9",
            "score": -1,
            "created_utc": 1569882699.0,
            "replies": []
        },
        {
            "body": "Yeah she seems like she’s sharp enough to know something already. If not, she must be super naive which makes me feel bad.",
            "author": "fannyhoney",
            "id": "f207mq8",
            "parent_id": "t1_f2046x4",
            "score": 7,
            "created_utc": 1569856282.0,
            "replies": [
                {
                    "body": "You feel bad is she is clueless about it, but not bad if she knew?",
                    "author": "SDsugarthrowaway",
                    "id": "f20lo5j",
                    "parent_id": "t1_f207mq8",
                    "score": 7,
                    "created_utc": 1569861124.0,
                    "replies": []
                },
                {
                    "body": "She isn’t naive. She has made a choice. \n\nAll women know what a man needs. When she isn’t providing it, he is either a miserable fuck or she is choosing to not care about how he is getting his needs met. \n\nIf I suddenly stopped paying all the house bills, but there was always food in the kitchen... I guess I could call it magic.",
                    "author": "LoftDaddy",
                    "id": "f22fd9r",
                    "parent_id": "t1_f207mq8",
                    "score": -1,
                    "created_utc": 1569887947.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "He would... a lot of guys are like that. They have nothing bad to say even about the worst women. Especially if they have a child with her.\n\nIf he's on SA then something is missing.",
            "author": "DreamingLurker",
            "id": "f2058eh",
            "parent_id": "t1_f204m2l",
            "score": 13,
            "created_utc": 1569855434.0,
            "replies": []
        },
        {
            "body": "Not a problem! I'm sorry for the amount of negativity being thrown your way on this thread - it's definitely something that us SBs have to deal with in the bowl. I hope your POT becomes your SD and you get the arrangement that you want x",
            "author": "--lilith",
            "id": "f22115v",
            "parent_id": "t1_f20lwrg",
            "score": 4,
            "created_utc": 1569879734.0,
            "replies": []
        },
        {
            "body": "👀👀👀👀",
            "author": "windwinter",
            "id": "f21xxri",
            "parent_id": "t1_f20mwug",
            "score": 1,
            "created_utc": 1569878249.0,
            "replies": [
                {
                    "body": "👂👂👂👂",
                    "author": "DreamingLurker",
                    "id": "f22mh5r",
                    "parent_id": "t1_f21xxri",
                    "score": 1,
                    "created_utc": 1569892015.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I’m a SB too, but I don’t deal with married men. I put myself in their spouses’ shoes, and since I’d hate if that ever happened to me I don’t allow myself to be used as a tool by cheating husbands.\nOne doesn’t have to accept and be ok with what every single SD does to be in the bowl. You know that, right...?",
            "author": null,
            "id": "f2227r1",
            "parent_id": "t1_f21tyyt",
            "score": 1,
            "created_utc": 1569880387.0,
            "replies": [
                {
                    "body": "I admire you! 🥰",
                    "author": "absthaw",
                    "id": "fkxck23",
                    "parent_id": "t1_f2227r1",
                    "score": 2,
                    "created_utc": 1584625033.0,
                    "replies": []
                },
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "f227sxt",
                    "parent_id": "t1_f2227r1",
                    "score": 2,
                    "created_utc": 1569883728.0,
                    "replies": [
                        {
                            "body": "I state in my profile that I don’t deal with married men. Also, they have very limited schedule and so much to hide that it isn’t worth the risk for them to have to lie and trick 2 different women on a daily basis. So, NOT a dream. Just being practical and objective!\n\nAlso, I’m doing my part in stating that I don’t date married men, but I’m not responsible for grown ass men lying about their lives AND cheating. I am responsible for doing MY part though, and I will continue doing it to the best of my abilities!",
                            "author": null,
                            "id": "f228zev",
                            "parent_id": "t1_f227sxt",
                            "score": -1,
                            "created_utc": 1569884424.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "f23i67s",
                                    "parent_id": "t1_f228zev",
                                    "score": 2,
                                    "created_utc": 1569926060.0,
                                    "replies": [
                                        {
                                            "body": "Like I said, I have a conscience, and I am responsible for my actions only, and not other people’s.\n\nI will not allow people choosing to hurt and deceive others to influence my behavior. I know right from wrong and that won’t change just because so many other people are ok with hurting their loved ones and living a lie.",
                                            "author": null,
                                            "id": "f23w0d0",
                                            "parent_id": "t1_f23i67s",
                                            "score": 1,
                                            "created_utc": 1569939044.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Ha, I think you posted this comment to the wrong place. I'm not married, and all of my sbs are the crazy boil-your-rabbit kind. :)",
            "author": "TastySpermDispenser",
            "id": "f21605y",
            "parent_id": "t1_f2130ft",
            "score": 5,
            "created_utc": 1569868352.0,
            "replies": [
                {
                    "body": "Which is why you keep a room of caged rabbits on hand.\n\nNot judging. Just saying.\n\n😂",
                    "author": "SDRippington",
                    "id": "f21m8ep",
                    "parent_id": "t1_f21605y",
                    "score": 2,
                    "created_utc": 1569873884.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Rabbit is good eatin’.",
            "author": "AshcanWhispers",
            "id": "f21ra4e",
            "parent_id": "t1_f2130ft",
            "score": 0,
            "created_utc": 1569875743.0,
            "replies": []
        },
        {
            "body": "Oh, come on now. We all know those two are mental disorders, not eating ones. :)",
            "author": "TastySpermDispenser",
            "id": "f20zyh1",
            "parent_id": "t1_f20xjhh",
            "score": 3,
            "created_utc": 1569866117.0,
            "replies": []
        },
        {
            "body": "Ugh.\n\nIf I was stuck in a room full of peeps and my choice was to die or eat my way out?\n\nGlad my will is up to date - cuz I’m gonna die...",
            "author": "SDRippington",
            "id": "f21m1x5",
            "parent_id": "t1_f20xjhh",
            "score": 1,
            "created_utc": 1569873821.0,
            "replies": []
        },
        {
            "body": "I won’t judge your curiosity. If I judge anything it’s your decision to bring questions like this to a group that would most likely beat you into submission because of the inherent security risks of the lifestyle. Nobody likes a bunny boiler - which usually starts by the more “inquisitive” ones.\n\nI can say every SB I’ve dated I’ve pretty much crawled up their life and social-ass with a microscope. 90% Mostly to protect ME. 10% or maybe a little less? I really am genuinely curious about what makes them “tick” and how I see whether their lives reflect what I see on all their social media.\n\nIt also gives me awesome insight to gift ideas for them when I see hidden passions they might have they never really share with anyone 😁\n\nThing is? All of my SB’s know me. They also know that I know them. They also know I will answer anything they ever ask honestly, but that comes with the risk they might not like my answers.\n\nFor the most part I’ve picked SB’s that have a solid head on their shoulders and a drive to be more in life then what they are. They’re all go getters, kind, considerate and are very amazing people, and I adore and love each of them in their own way.",
            "author": "SDRippington",
            "id": "f21npuy",
            "parent_id": "t1_f20oi5k",
            "score": 1,
            "created_utc": 1569874427.0,
            "replies": []
        },
        {
            "body": "Don't have to. She probably knows that he has plenty of snacks outside. And what matters is he brings the cheque home and goes home to the wife. I am speaking as my experience as a mistress. Most wife knows their husband's drama out there. And many will decide to close one eye.",
            "author": "JELxin",
            "id": "f20843p",
            "parent_id": "t1_f207hq6",
            "score": 0,
            "created_utc": 1569856458.0,
            "replies": [
                {
                    "body": "Okay but why would someone like her put up with that in the presence of other options? She makes a lot of money too.",
                    "author": "fannyhoney",
                    "id": "f208ys0",
                    "parent_id": "t1_f20843p",
                    "score": 1,
                    "created_utc": 1569856766.0,
                    "replies": [
                        {
                            "body": "What other options do you assume she has? Get divorced, be a single mom trying to date? Some women enjoy that, some don't. Find a side piece of her own? How do you know she doesn't have that already?\n\nI think you're putting yourself in her place and thinking about how awful it must be for her. 1 Don't assume you know how she feels about the situation. 2 If she's in some awful situation, most people it's a place of their own choosing.",
                            "author": "2fast-2curious",
                            "id": "f209hrc",
                            "parent_id": "t1_f208ys0",
                            "score": 7,
                            "created_utc": 1569856962.0,
                            "replies": [
                                {
                                    "body": "This SB is overthinking. LOL.",
                                    "author": "JELxin",
                                    "id": "f20ia7h",
                                    "parent_id": "t1_f209hrc",
                                    "score": 2,
                                    "created_utc": 1569860031.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "She's the queen. The queen will always remain in her throne. Whereas you are just the little side piece. Men like to have many woman since ancient times. Whats new? And I sure the wife knows this and enjoys being the queen and many side pieces eyeing her throne. But too bad she probably can't be bothered with the side piece. And she knows this is just a passing phase of you coming inside the picture for awhile. Lol",
                            "author": "JELxin",
                            "id": "f20i2yc",
                            "parent_id": "t1_f208ys0",
                            "score": 6,
                            "created_utc": 1569859971.0,
                            "replies": []
                        },
                        {
                            "body": "Women tend to value men who are higher status than them.  The higher the status the better.  Unfortunately in today’s society, high status men have a lot of options. You’re more likely to be cheated on by a surgeon than a mailman, since the mailman most likely can’t afford to be on SA. But you’re more attracted to the surgeon so you make little deals with yourself and turn a blind eye because of his perceived value. It’s been happening since the beginning of time.  Ask yourself if most women would rather be the wife of a Prince who occasionally strays or the wife of a plumber who is faithful. I think you know the answer.",
                            "author": "nhceo",
                            "id": "f21nuv7",
                            "parent_id": "t1_f208ys0",
                            "score": 4,
                            "created_utc": 1569874474.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "You seem to be somewhat skeptical or is it cynical I can’t tell.?\nWhat runs stringer in my blood is my desire to fuck as many different females as I can not some stupid ass religious marriage vows made up by someone who’s either fucking alter boys or raping nuns.\nTake the college course, Human Growth and Development, you’ll learn that YES we are biologically programmed this way as makes.",
            "author": "Sah-Bum-Nim",
            "id": "f3arkw8",
            "parent_id": "t1_f21ug6k",
            "score": 1,
            "created_utc": 1570788143.0,
            "replies": []
        },
        {
            "body": "“SBs look up pot SDs all the time. It’s for our safety and to make sure this person is not a pedophile/criminal/psychopath etc”\n\nTo be fair, ensuring safety has little to nothing to do with wifey. \n\n“I just happened to stumble upon information that I found bizarre and wanted to share it. “\n\nIts this type of statement that is getting you downvoted. My intent is not to judge or chastise you, simply pointing it out since you mentioned your downvotes. Its not “bizarre” at all, it is indeed quite common, otherwise SA wouldn’t even begin to exist.",
            "author": null,
            "id": "f21m667",
            "parent_id": "t1_f20jrld",
            "score": 0,
            "created_utc": 1569873862.0,
            "replies": []
        },
        {
            "body": "> and to make sure this person is not a pedophile/criminal/psychopath etc\n\nWhat does this even mean? Is there a National Database of Pedophiles, Criminals, and Psychopaths? Does that database also have information about science ladies?\n\nCome on, now. You were creeping on him and his wife out of curiosity, not safety.",
            "author": "mySLFalt",
            "id": "f21k0jo",
            "parent_id": "t1_f20jrld",
            "score": -1,
            "created_utc": 1569873129.0,
            "replies": []
        },
        {
            "body": "This! :)",
            "author": "captainIsBack4u",
            "id": "f21o8mq",
            "parent_id": "t1_f21kx32",
            "score": 3,
            "created_utc": 1569874609.0,
            "replies": []
        },
        {
            "body": "deleted  ^^^^^^^^^^^^^^^^0.3531  [^^^What ^^^is ^^^this?](https://pastebin.com/FcrFs94k/00714)",
            "author": null,
            "id": "f232sz3",
            "parent_id": "t1_f21kx32",
            "score": 3,
            "created_utc": 1569904094.0,
            "replies": [
                {
                    "body": "So much YES to this!!! 👆🏻👏🏻",
                    "author": null,
                    "id": "f23vnn0",
                    "parent_id": "t1_f232sz3",
                    "score": 1,
                    "created_utc": 1569938790.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Cheating is wrong, PERIOD! Stop trying to make excuses for shitty behavior. Cheating is only ok for you men when YOU are the ones doing it, but not the ones being cheated on. Please quit being a hypocrite!",
            "author": null,
            "id": "f23vi7r",
            "parent_id": "t1_f21kx32",
            "score": 2,
            "created_utc": 1569938683.0,
            "replies": [
                {
                    "body": "> Please quit being a hypocrite!\n\nExactly. This has been my entire point. Everyone in the bowl is a hypocrite by nature of this game itself. I've always said \"own your decision\". I've never said anything but.\n\n_\"Fucking for money is okay, but only under special, specific circumstances that fit my current sense of morality.\"_\n\nWhat. Ever. People are going to have sex with who they want to have sex with under whatever guise of \"willful blindness\" they choose that fits their sense of morality for the day. \n\nOne thing I know with absolute certainty? If it's not you they're having sex with and paying money for that privilege, it most certainly will be with someone else. Nothing hypocritical about that observation. Think about that the next time you collect your PPM.\n\nWe should all be careful of falling off our high horses. Bones could break.",
                    "author": "SDRippington",
                    "id": "f23zlmx",
                    "parent_id": "t1_f23vi7r",
                    "score": 1,
                    "created_utc": 1569941502.0,
                    "replies": [
                        {
                            "body": "AAH, another cheater trying to justify his shitty behavior. Karma will get back at you though, and what you are doing to your wife will come back to you eventually. And boy, that pain will hurt!",
                            "author": null,
                            "id": "f24irlv",
                            "parent_id": "t1_f23zlmx",
                            "score": 1,
                            "created_utc": 1569953055.0,
                            "replies": [
                                {
                                    "body": "Not only are you judgmental AF, you just assumed I’m still married and not already in the middle of an amicable divorce?\n\nTotally not surprised 😊😂😂\n\nKarma already HAS dear by blessing me with women that actually deeply care for me and my wants and desires.\n\nSo please, with all due respect, with sugar on top, go fuck yourself 😂",
                                    "author": "SDRippington",
                                    "id": "f24l998",
                                    "parent_id": "t1_f24irlv",
                                    "score": 2,
                                    "created_utc": 1569954851.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "deleted  ^^^^^^^^^^^^^^^^0.4561  [^^^What ^^^is ^^^this?](https://pastebin.com/FcrFs94k/26654)",
            "author": null,
            "id": "f232x4y",
            "parent_id": "t1_f21ik5j",
            "score": 1,
            "created_utc": 1569904205.0,
            "replies": []
        },
        {
            "body": "Uh, she clearly knows the guy is married. What kind of question is that...? Lol",
            "author": null,
            "id": "f22rb7v",
            "parent_id": "t1_f22ptux",
            "score": -2,
            "created_utc": 1569895140.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "f22s54v",
                    "parent_id": "t1_f22rb7v",
                    "score": 0,
                    "created_utc": 1569895709.0,
                    "replies": [
                        {
                            "body": "deleted  ^^^^^^^^^^^^^^^^0.7950  [^^^What ^^^is ^^^this?](https://pastebin.com/FcrFs94k/10303)",
                            "author": null,
                            "id": "f232y8t",
                            "parent_id": "t1_f22s54v",
                            "score": 1,
                            "created_utc": 1569904234.0,
                            "replies": []
                        },
                        {
                            "body": "No it is not, because it takes 2 to cheat!",
                            "author": null,
                            "id": "f22z2l4",
                            "parent_id": "t1_f22s54v",
                            "score": -1,
                            "created_utc": 1569900751.0,
                            "replies": [
                                {
                                    "body": "She’s not cheating. He is. Lmao.",
                                    "author": "LaNouvelleSugar",
                                    "id": "f23f9ev",
                                    "parent_id": "t1_f22z2l4",
                                    "score": 1,
                                    "created_utc": 1569921432.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "So, you are telling me that if and when the wife finds out her husband is a cheater she won’t be hurt. REALLY...??? I hope you are in that wife’s shoes someday, and I will be here waiting to hear about how happy you are that your spouse is cheating on you constantly behind your back! Quit being a hypocrite!!!\n\nPS: Not surprised to find out you are ALSO a cheater though! Typical...",
            "author": null,
            "id": "f23w77d",
            "parent_id": "t1_f23k6mb",
            "score": 1,
            "created_utc": 1569939177.0,
            "replies": [
                {
                    "body": "I've never cheated. Also, the wife has not been hurt.",
                    "author": "nerojt",
                    "id": "f25q81m",
                    "parent_id": "t1_f23w77d",
                    "score": 2,
                    "created_utc": 1569980971.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "> need to work on education and acceptance of various lifestyles and relationship choices.  -  like single",
            "author": "pinotandsugar",
            "id": "f226830",
            "parent_id": "t1_f21hs2l",
            "score": 11,
            "created_utc": 1569882740.0,
            "replies": [
                {
                    "body": "Haha truth or poly 😘",
                    "author": "theAliasOfAlias",
                    "id": "f22qmzl",
                    "parent_id": "t1_f226830",
                    "score": 2,
                    "created_utc": 1569894665.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Wow. You truly missed my point completely didn’t ya?",
            "author": "SDRippington",
            "id": "f21s4a7",
            "parent_id": "t1_f21mi43",
            "score": -2,
            "created_utc": 1569876070.0,
            "replies": [
                {
                    "body": "I really did. Would you kindly explain?",
                    "author": "LaNouvelleSugar",
                    "id": "f21sdry",
                    "parent_id": "t1_f21s4a7",
                    "score": 4,
                    "created_utc": 1569876173.0,
                    "replies": [
                        {
                            "body": "It seems that a few women here exercise selective morality enforcement with respect to societal “norms”\n\nMany women seem perfectly okay to fuck an older guy for money if he’s single, yet they throw shade on fucking an older guy for money if he’s married.\n\nThey don’t even consider the “for money” part really because they benefit. They only consider the “married” part because it’s a choice someone ELSE made and would in part, through some twisted sense of self, would make her feel “dirty” because he’s married - NOT that she’s fucking for cash.\n\nAnd one step further? I’ve known some SB’s that vehemently avoid fucking married OLDER guys but were more than okay to fuck the HOT young married guy for money cuz, well, his wife is obviously a bitch for not taking his gorgeous “D” for a ride, that poor, young, broken man.\n\nI’ve been on this forum (and in the bowl) long enough to see all sides of the selective morality dance. And it never changes. 😂\n\nEDIT: And the downvotes on this is AMAZING which only proves my point about all the butthurt snowflakes that cringe at the truth :)",
                            "author": "SDRippington",
                            "id": "f21ud7l",
                            "parent_id": "t1_f21sdry",
                            "score": -1,
                            "created_utc": 1569876899.0,
                            "replies": [
                                {
                                    "body": "To be perfectly honest, Whether you’re fucking for money or for whatever other reason that’s people’s personal problems. No one here should be judgmental. At all.",
                                    "author": "LaNouvelleSugar",
                                    "id": "f23f76j",
                                    "parent_id": "t1_f21ud7l",
                                    "score": 1,
                                    "created_utc": 1569921326.0,
                                    "replies": [
                                        {
                                            "body": "That’s my point.",
                                            "author": "SDRippington",
                                            "id": "f23iv4w",
                                            "parent_id": "t1_f23f76j",
                                            "score": 2,
                                            "created_utc": 1569927002.0,
                                            "replies": [
                                                {
                                                    "body": "Whereas that might be your point, you do sound a bit judgmental yourself. Just letting you know",
                                                    "author": "LaNouvelleSugar",
                                                    "id": "f23jgpd",
                                                    "parent_id": "t1_f23iv4w",
                                                    "score": 1,
                                                    "created_utc": 1569927778.0,
                                                    "replies": [
                                                        {
                                                            "body": "Of course! Especially towards hypocritical people.\nThe irony is not lost on me.😂",
                                                            "author": "SDRippington",
                                                            "id": "f23jtvl",
                                                            "parent_id": "t1_f23jgpd",
                                                            "score": 1,
                                                            "created_utc": 1569928231.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "f23npjw",
            "parent_id": "t1_f21hfsy",
            "score": 2,
            "created_utc": 1569932385.0,
            "replies": [
                {
                    "body": "Hey I’m all about encouragement!  :) we are all smart, and obviously motivated.  If you (or anyone) ever needs to talk or whatever, I am always here!",
                    "author": null,
                    "id": "f23tru7",
                    "parent_id": "t1_f23npjw",
                    "score": 1,
                    "created_utc": 1569937415.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Women tend to value education highly in their Male partners while it doesn't really matter the other way around.\n\nIt's not surprising she'd think that because as a women, she'd value if her guy was a researcher.",
            "author": "DarkMatter731",
            "id": "f20z3es",
            "parent_id": "t1_f20n11z",
            "score": 5,
            "created_utc": 1569865814.0,
            "replies": [
                {
                    "body": ">Women tend to value education highly in their Male partners while it doesn't really matter the other way around.\n\nI disagree. Educated men prefer educated women for wives. When was the last time you heard of a doctor marrying a barista? People generally prefer to marry within their class.",
                    "author": null,
                    "id": "f22f83t",
                    "parent_id": "t1_f20z3es",
                    "score": 11,
                    "created_utc": 1569887860.0,
                    "replies": []
                },
                {
                    "body": "Yeah I always laugh at these SB profiles that state how many languages they speak ... wow does she know what guys want 🤣",
                    "author": "lookingforlaughter",
                    "id": "f23frhx",
                    "parent_id": "t1_f20z3es",
                    "score": 3,
                    "created_utc": 1569922293.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Upvote. Point to note: SB should never be poking nose into SD's home affair.",
            "author": "JELxin",
            "id": "f211rr8",
            "parent_id": "t1_f20ul6a",
            "score": 14,
            "created_utc": 1569866788.0,
            "replies": [
                {
                    "body": "Always the classy SB JELxin",
                    "author": "AusterlitzSD",
                    "id": "f21khr4",
                    "parent_id": "t1_f211rr8",
                    "score": -1,
                    "created_utc": 1569873289.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "There shouldn't only be one reason for this action.  What about curiousity?  Which is related to taking an interest in the other party, whcih is what we SDs often complain about SBs lacking!",
            "author": "nycballetlover",
            "id": "f24wxbv",
            "parent_id": "t1_f20ul6a",
            "score": 2,
            "created_utc": 1569961786.0,
            "replies": [
                {
                    "body": "Heh. I had one SB that I researched. She had an alt Intstagram profile of her at the firing range, and discussing competition pistols. Apparently some of her more \"liberal\" friends at college would have lost their shit if they knew.\n\nSo when she came by for our second intimate date I smiled and mentioned I had researched her a little and she was like \"Uh oh. What did you find out?\" I went \"here\", opened a fingerprint lock box sitting on the counter, pulled out my compensated and tricked out .45, plopped it on the counter in front of her and said \"strip it.\" \n\nShe smiled wider than I have ever seen a woman smile and proceeded to tear it down with practiced skill.\n\n(no, I didn't have rounds in the magazine. I wasn't stupid.) LMAO!\n\nAnd yes we're still good friends. But the little shit kept my damn pistol. I offered her that or a laptop later as a gift. She chose the pistol. She's a lifelong keeper. :-)",
                    "author": "SDRippington",
                    "id": "f2775na",
                    "parent_id": "t1_f24wxbv",
                    "score": 1,
                    "created_utc": 1570032006.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I’m an SB and if I was a married SD and found this out I would be pissed the hell off. And this guy is a POT meaning you don’t even really know him? I hope she is careful with this info",
            "author": null,
            "id": "f21eoc7",
            "parent_id": "t1_f20ul6a",
            "score": 3,
            "created_utc": 1569871337.0,
            "replies": []
        },
        {
            "body": "Yeah,  you were an accessory on par with a handbag.  My ex is only an interior designer but her online persona would make her look like the female version of the Dos Equis guy.  I funded that fraud for a long time.",
            "author": "LotBuilder",
            "id": "f22gg87",
            "parent_id": "t1_f22f6pk",
            "score": 4,
            "created_utc": 1569888527.0,
            "replies": []
        },
        {
            "body": "You feel bad is she is clueless about it, but not bad if she knew?",
            "author": "SDsugarthrowaway",
            "id": "f20lo5j",
            "parent_id": "t1_f207mq8",
            "score": 7,
            "created_utc": 1569861124.0,
            "replies": []
        },
        {
            "body": "She isn’t naive. She has made a choice. \n\nAll women know what a man needs. When she isn’t providing it, he is either a miserable fuck or she is choosing to not care about how he is getting his needs met. \n\nIf I suddenly stopped paying all the house bills, but there was always food in the kitchen... I guess I could call it magic.",
            "author": "LoftDaddy",
            "id": "f22fd9r",
            "parent_id": "t1_f207mq8",
            "score": -1,
            "created_utc": 1569887947.0,
            "replies": []
        },
        {
            "body": "👂👂👂👂",
            "author": "DreamingLurker",
            "id": "f22mh5r",
            "parent_id": "t1_f21xxri",
            "score": 1,
            "created_utc": 1569892015.0,
            "replies": []
        },
        {
            "body": "I admire you! 🥰",
            "author": "absthaw",
            "id": "fkxck23",
            "parent_id": "t1_f2227r1",
            "score": 2,
            "created_utc": 1584625033.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "f227sxt",
            "parent_id": "t1_f2227r1",
            "score": 2,
            "created_utc": 1569883728.0,
            "replies": [
                {
                    "body": "I state in my profile that I don’t deal with married men. Also, they have very limited schedule and so much to hide that it isn’t worth the risk for them to have to lie and trick 2 different women on a daily basis. So, NOT a dream. Just being practical and objective!\n\nAlso, I’m doing my part in stating that I don’t date married men, but I’m not responsible for grown ass men lying about their lives AND cheating. I am responsible for doing MY part though, and I will continue doing it to the best of my abilities!",
                    "author": null,
                    "id": "f228zev",
                    "parent_id": "t1_f227sxt",
                    "score": -1,
                    "created_utc": 1569884424.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "f23i67s",
                            "parent_id": "t1_f228zev",
                            "score": 2,
                            "created_utc": 1569926060.0,
                            "replies": [
                                {
                                    "body": "Like I said, I have a conscience, and I am responsible for my actions only, and not other people’s.\n\nI will not allow people choosing to hurt and deceive others to influence my behavior. I know right from wrong and that won’t change just because so many other people are ok with hurting their loved ones and living a lie.",
                                    "author": null,
                                    "id": "f23w0d0",
                                    "parent_id": "t1_f23i67s",
                                    "score": 1,
                                    "created_utc": 1569939044.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Which is why you keep a room of caged rabbits on hand.\n\nNot judging. Just saying.\n\n😂",
            "author": "SDRippington",
            "id": "f21m8ep",
            "parent_id": "t1_f21605y",
            "score": 2,
            "created_utc": 1569873884.0,
            "replies": []
        },
        {
            "body": "Okay but why would someone like her put up with that in the presence of other options? She makes a lot of money too.",
            "author": "fannyhoney",
            "id": "f208ys0",
            "parent_id": "t1_f20843p",
            "score": 1,
            "created_utc": 1569856766.0,
            "replies": [
                {
                    "body": "What other options do you assume she has? Get divorced, be a single mom trying to date? Some women enjoy that, some don't. Find a side piece of her own? How do you know she doesn't have that already?\n\nI think you're putting yourself in her place and thinking about how awful it must be for her. 1 Don't assume you know how she feels about the situation. 2 If she's in some awful situation, most people it's a place of their own choosing.",
                    "author": "2fast-2curious",
                    "id": "f209hrc",
                    "parent_id": "t1_f208ys0",
                    "score": 7,
                    "created_utc": 1569856962.0,
                    "replies": [
                        {
                            "body": "This SB is overthinking. LOL.",
                            "author": "JELxin",
                            "id": "f20ia7h",
                            "parent_id": "t1_f209hrc",
                            "score": 2,
                            "created_utc": 1569860031.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "She's the queen. The queen will always remain in her throne. Whereas you are just the little side piece. Men like to have many woman since ancient times. Whats new? And I sure the wife knows this and enjoys being the queen and many side pieces eyeing her throne. But too bad she probably can't be bothered with the side piece. And she knows this is just a passing phase of you coming inside the picture for awhile. Lol",
                    "author": "JELxin",
                    "id": "f20i2yc",
                    "parent_id": "t1_f208ys0",
                    "score": 6,
                    "created_utc": 1569859971.0,
                    "replies": []
                },
                {
                    "body": "Women tend to value men who are higher status than them.  The higher the status the better.  Unfortunately in today’s society, high status men have a lot of options. You’re more likely to be cheated on by a surgeon than a mailman, since the mailman most likely can’t afford to be on SA. But you’re more attracted to the surgeon so you make little deals with yourself and turn a blind eye because of his perceived value. It’s been happening since the beginning of time.  Ask yourself if most women would rather be the wife of a Prince who occasionally strays or the wife of a plumber who is faithful. I think you know the answer.",
                    "author": "nhceo",
                    "id": "f21nuv7",
                    "parent_id": "t1_f208ys0",
                    "score": 4,
                    "created_utc": 1569874474.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "So much YES to this!!! 👆🏻👏🏻",
            "author": null,
            "id": "f23vnn0",
            "parent_id": "t1_f232sz3",
            "score": 1,
            "created_utc": 1569938790.0,
            "replies": []
        },
        {
            "body": "> Please quit being a hypocrite!\n\nExactly. This has been my entire point. Everyone in the bowl is a hypocrite by nature of this game itself. I've always said \"own your decision\". I've never said anything but.\n\n_\"Fucking for money is okay, but only under special, specific circumstances that fit my current sense of morality.\"_\n\nWhat. Ever. People are going to have sex with who they want to have sex with under whatever guise of \"willful blindness\" they choose that fits their sense of morality for the day. \n\nOne thing I know with absolute certainty? If it's not you they're having sex with and paying money for that privilege, it most certainly will be with someone else. Nothing hypocritical about that observation. Think about that the next time you collect your PPM.\n\nWe should all be careful of falling off our high horses. Bones could break.",
            "author": "SDRippington",
            "id": "f23zlmx",
            "parent_id": "t1_f23vi7r",
            "score": 1,
            "created_utc": 1569941502.0,
            "replies": [
                {
                    "body": "AAH, another cheater trying to justify his shitty behavior. Karma will get back at you though, and what you are doing to your wife will come back to you eventually. And boy, that pain will hurt!",
                    "author": null,
                    "id": "f24irlv",
                    "parent_id": "t1_f23zlmx",
                    "score": 1,
                    "created_utc": 1569953055.0,
                    "replies": [
                        {
                            "body": "Not only are you judgmental AF, you just assumed I’m still married and not already in the middle of an amicable divorce?\n\nTotally not surprised 😊😂😂\n\nKarma already HAS dear by blessing me with women that actually deeply care for me and my wants and desires.\n\nSo please, with all due respect, with sugar on top, go fuck yourself 😂",
                            "author": "SDRippington",
                            "id": "f24l998",
                            "parent_id": "t1_f24irlv",
                            "score": 2,
                            "created_utc": 1569954851.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "f22s54v",
            "parent_id": "t1_f22rb7v",
            "score": 0,
            "created_utc": 1569895709.0,
            "replies": [
                {
                    "body": "deleted  ^^^^^^^^^^^^^^^^0.7950  [^^^What ^^^is ^^^this?](https://pastebin.com/FcrFs94k/10303)",
                    "author": null,
                    "id": "f232y8t",
                    "parent_id": "t1_f22s54v",
                    "score": 1,
                    "created_utc": 1569904234.0,
                    "replies": []
                },
                {
                    "body": "No it is not, because it takes 2 to cheat!",
                    "author": null,
                    "id": "f22z2l4",
                    "parent_id": "t1_f22s54v",
                    "score": -1,
                    "created_utc": 1569900751.0,
                    "replies": [
                        {
                            "body": "She’s not cheating. He is. Lmao.",
                            "author": "LaNouvelleSugar",
                            "id": "f23f9ev",
                            "parent_id": "t1_f22z2l4",
                            "score": 1,
                            "created_utc": 1569921432.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I've never cheated. Also, the wife has not been hurt.",
            "author": "nerojt",
            "id": "f25q81m",
            "parent_id": "t1_f23w77d",
            "score": 2,
            "created_utc": 1569980971.0,
            "replies": []
        },
        {
            "body": "Haha truth or poly 😘",
            "author": "theAliasOfAlias",
            "id": "f22qmzl",
            "parent_id": "t1_f226830",
            "score": 2,
            "created_utc": 1569894665.0,
            "replies": []
        },
        {
            "body": "I really did. Would you kindly explain?",
            "author": "LaNouvelleSugar",
            "id": "f21sdry",
            "parent_id": "t1_f21s4a7",
            "score": 4,
            "created_utc": 1569876173.0,
            "replies": [
                {
                    "body": "It seems that a few women here exercise selective morality enforcement with respect to societal “norms”\n\nMany women seem perfectly okay to fuck an older guy for money if he’s single, yet they throw shade on fucking an older guy for money if he’s married.\n\nThey don’t even consider the “for money” part really because they benefit. They only consider the “married” part because it’s a choice someone ELSE made and would in part, through some twisted sense of self, would make her feel “dirty” because he’s married - NOT that she’s fucking for cash.\n\nAnd one step further? I’ve known some SB’s that vehemently avoid fucking married OLDER guys but were more than okay to fuck the HOT young married guy for money cuz, well, his wife is obviously a bitch for not taking his gorgeous “D” for a ride, that poor, young, broken man.\n\nI’ve been on this forum (and in the bowl) long enough to see all sides of the selective morality dance. And it never changes. 😂\n\nEDIT: And the downvotes on this is AMAZING which only proves my point about all the butthurt snowflakes that cringe at the truth :)",
                    "author": "SDRippington",
                    "id": "f21ud7l",
                    "parent_id": "t1_f21sdry",
                    "score": -1,
                    "created_utc": 1569876899.0,
                    "replies": [
                        {
                            "body": "To be perfectly honest, Whether you’re fucking for money or for whatever other reason that’s people’s personal problems. No one here should be judgmental. At all.",
                            "author": "LaNouvelleSugar",
                            "id": "f23f76j",
                            "parent_id": "t1_f21ud7l",
                            "score": 1,
                            "created_utc": 1569921326.0,
                            "replies": [
                                {
                                    "body": "That’s my point.",
                                    "author": "SDRippington",
                                    "id": "f23iv4w",
                                    "parent_id": "t1_f23f76j",
                                    "score": 2,
                                    "created_utc": 1569927002.0,
                                    "replies": [
                                        {
                                            "body": "Whereas that might be your point, you do sound a bit judgmental yourself. Just letting you know",
                                            "author": "LaNouvelleSugar",
                                            "id": "f23jgpd",
                                            "parent_id": "t1_f23iv4w",
                                            "score": 1,
                                            "created_utc": 1569927778.0,
                                            "replies": [
                                                {
                                                    "body": "Of course! Especially towards hypocritical people.\nThe irony is not lost on me.😂",
                                                    "author": "SDRippington",
                                                    "id": "f23jtvl",
                                                    "parent_id": "t1_f23jgpd",
                                                    "score": 1,
                                                    "created_utc": 1569928231.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Hey I’m all about encouragement!  :) we are all smart, and obviously motivated.  If you (or anyone) ever needs to talk or whatever, I am always here!",
            "author": null,
            "id": "f23tru7",
            "parent_id": "t1_f23npjw",
            "score": 1,
            "created_utc": 1569937415.0,
            "replies": []
        },
        {
            "body": ">Women tend to value education highly in their Male partners while it doesn't really matter the other way around.\n\nI disagree. Educated men prefer educated women for wives. When was the last time you heard of a doctor marrying a barista? People generally prefer to marry within their class.",
            "author": null,
            "id": "f22f83t",
            "parent_id": "t1_f20z3es",
            "score": 11,
            "created_utc": 1569887860.0,
            "replies": []
        },
        {
            "body": "Yeah I always laugh at these SB profiles that state how many languages they speak ... wow does she know what guys want 🤣",
            "author": "lookingforlaughter",
            "id": "f23frhx",
            "parent_id": "t1_f20z3es",
            "score": 3,
            "created_utc": 1569922293.0,
            "replies": []
        },
        {
            "body": "Always the classy SB JELxin",
            "author": "AusterlitzSD",
            "id": "f21khr4",
            "parent_id": "t1_f211rr8",
            "score": -1,
            "created_utc": 1569873289.0,
            "replies": []
        },
        {
            "body": "Heh. I had one SB that I researched. She had an alt Intstagram profile of her at the firing range, and discussing competition pistols. Apparently some of her more \"liberal\" friends at college would have lost their shit if they knew.\n\nSo when she came by for our second intimate date I smiled and mentioned I had researched her a little and she was like \"Uh oh. What did you find out?\" I went \"here\", opened a fingerprint lock box sitting on the counter, pulled out my compensated and tricked out .45, plopped it on the counter in front of her and said \"strip it.\" \n\nShe smiled wider than I have ever seen a woman smile and proceeded to tear it down with practiced skill.\n\n(no, I didn't have rounds in the magazine. I wasn't stupid.) LMAO!\n\nAnd yes we're still good friends. But the little shit kept my damn pistol. I offered her that or a laptop later as a gift. She chose the pistol. She's a lifelong keeper. :-)",
            "author": "SDRippington",
            "id": "f2775na",
            "parent_id": "t1_f24wxbv",
            "score": 1,
            "created_utc": 1570032006.0,
            "replies": []
        },
        {
            "body": "I state in my profile that I don’t deal with married men. Also, they have very limited schedule and so much to hide that it isn’t worth the risk for them to have to lie and trick 2 different women on a daily basis. So, NOT a dream. Just being practical and objective!\n\nAlso, I’m doing my part in stating that I don’t date married men, but I’m not responsible for grown ass men lying about their lives AND cheating. I am responsible for doing MY part though, and I will continue doing it to the best of my abilities!",
            "author": null,
            "id": "f228zev",
            "parent_id": "t1_f227sxt",
            "score": -1,
            "created_utc": 1569884424.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "f23i67s",
                    "parent_id": "t1_f228zev",
                    "score": 2,
                    "created_utc": 1569926060.0,
                    "replies": [
                        {
                            "body": "Like I said, I have a conscience, and I am responsible for my actions only, and not other people’s.\n\nI will not allow people choosing to hurt and deceive others to influence my behavior. I know right from wrong and that won’t change just because so many other people are ok with hurting their loved ones and living a lie.",
                            "author": null,
                            "id": "f23w0d0",
                            "parent_id": "t1_f23i67s",
                            "score": 1,
                            "created_utc": 1569939044.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "What other options do you assume she has? Get divorced, be a single mom trying to date? Some women enjoy that, some don't. Find a side piece of her own? How do you know she doesn't have that already?\n\nI think you're putting yourself in her place and thinking about how awful it must be for her. 1 Don't assume you know how she feels about the situation. 2 If she's in some awful situation, most people it's a place of their own choosing.",
            "author": "2fast-2curious",
            "id": "f209hrc",
            "parent_id": "t1_f208ys0",
            "score": 7,
            "created_utc": 1569856962.0,
            "replies": [
                {
                    "body": "This SB is overthinking. LOL.",
                    "author": "JELxin",
                    "id": "f20ia7h",
                    "parent_id": "t1_f209hrc",
                    "score": 2,
                    "created_utc": 1569860031.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "She's the queen. The queen will always remain in her throne. Whereas you are just the little side piece. Men like to have many woman since ancient times. Whats new? And I sure the wife knows this and enjoys being the queen and many side pieces eyeing her throne. But too bad she probably can't be bothered with the side piece. And she knows this is just a passing phase of you coming inside the picture for awhile. Lol",
            "author": "JELxin",
            "id": "f20i2yc",
            "parent_id": "t1_f208ys0",
            "score": 6,
            "created_utc": 1569859971.0,
            "replies": []
        },
        {
            "body": "Women tend to value men who are higher status than them.  The higher the status the better.  Unfortunately in today’s society, high status men have a lot of options. You’re more likely to be cheated on by a surgeon than a mailman, since the mailman most likely can’t afford to be on SA. But you’re more attracted to the surgeon so you make little deals with yourself and turn a blind eye because of his perceived value. It’s been happening since the beginning of time.  Ask yourself if most women would rather be the wife of a Prince who occasionally strays or the wife of a plumber who is faithful. I think you know the answer.",
            "author": "nhceo",
            "id": "f21nuv7",
            "parent_id": "t1_f208ys0",
            "score": 4,
            "created_utc": 1569874474.0,
            "replies": []
        },
        {
            "body": "AAH, another cheater trying to justify his shitty behavior. Karma will get back at you though, and what you are doing to your wife will come back to you eventually. And boy, that pain will hurt!",
            "author": null,
            "id": "f24irlv",
            "parent_id": "t1_f23zlmx",
            "score": 1,
            "created_utc": 1569953055.0,
            "replies": [
                {
                    "body": "Not only are you judgmental AF, you just assumed I’m still married and not already in the middle of an amicable divorce?\n\nTotally not surprised 😊😂😂\n\nKarma already HAS dear by blessing me with women that actually deeply care for me and my wants and desires.\n\nSo please, with all due respect, with sugar on top, go fuck yourself 😂",
                    "author": "SDRippington",
                    "id": "f24l998",
                    "parent_id": "t1_f24irlv",
                    "score": 2,
                    "created_utc": 1569954851.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "deleted  ^^^^^^^^^^^^^^^^0.7950  [^^^What ^^^is ^^^this?](https://pastebin.com/FcrFs94k/10303)",
            "author": null,
            "id": "f232y8t",
            "parent_id": "t1_f22s54v",
            "score": 1,
            "created_utc": 1569904234.0,
            "replies": []
        },
        {
            "body": "No it is not, because it takes 2 to cheat!",
            "author": null,
            "id": "f22z2l4",
            "parent_id": "t1_f22s54v",
            "score": -1,
            "created_utc": 1569900751.0,
            "replies": [
                {
                    "body": "She’s not cheating. He is. Lmao.",
                    "author": "LaNouvelleSugar",
                    "id": "f23f9ev",
                    "parent_id": "t1_f22z2l4",
                    "score": 1,
                    "created_utc": 1569921432.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "It seems that a few women here exercise selective morality enforcement with respect to societal “norms”\n\nMany women seem perfectly okay to fuck an older guy for money if he’s single, yet they throw shade on fucking an older guy for money if he’s married.\n\nThey don’t even consider the “for money” part really because they benefit. They only consider the “married” part because it’s a choice someone ELSE made and would in part, through some twisted sense of self, would make her feel “dirty” because he’s married - NOT that she’s fucking for cash.\n\nAnd one step further? I’ve known some SB’s that vehemently avoid fucking married OLDER guys but were more than okay to fuck the HOT young married guy for money cuz, well, his wife is obviously a bitch for not taking his gorgeous “D” for a ride, that poor, young, broken man.\n\nI’ve been on this forum (and in the bowl) long enough to see all sides of the selective morality dance. And it never changes. 😂\n\nEDIT: And the downvotes on this is AMAZING which only proves my point about all the butthurt snowflakes that cringe at the truth :)",
            "author": "SDRippington",
            "id": "f21ud7l",
            "parent_id": "t1_f21sdry",
            "score": -1,
            "created_utc": 1569876899.0,
            "replies": [
                {
                    "body": "To be perfectly honest, Whether you’re fucking for money or for whatever other reason that’s people’s personal problems. No one here should be judgmental. At all.",
                    "author": "LaNouvelleSugar",
                    "id": "f23f76j",
                    "parent_id": "t1_f21ud7l",
                    "score": 1,
                    "created_utc": 1569921326.0,
                    "replies": [
                        {
                            "body": "That’s my point.",
                            "author": "SDRippington",
                            "id": "f23iv4w",
                            "parent_id": "t1_f23f76j",
                            "score": 2,
                            "created_utc": 1569927002.0,
                            "replies": [
                                {
                                    "body": "Whereas that might be your point, you do sound a bit judgmental yourself. Just letting you know",
                                    "author": "LaNouvelleSugar",
                                    "id": "f23jgpd",
                                    "parent_id": "t1_f23iv4w",
                                    "score": 1,
                                    "created_utc": 1569927778.0,
                                    "replies": [
                                        {
                                            "body": "Of course! Especially towards hypocritical people.\nThe irony is not lost on me.😂",
                                            "author": "SDRippington",
                                            "id": "f23jtvl",
                                            "parent_id": "t1_f23jgpd",
                                            "score": 1,
                                            "created_utc": 1569928231.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "f23i67s",
            "parent_id": "t1_f228zev",
            "score": 2,
            "created_utc": 1569926060.0,
            "replies": [
                {
                    "body": "Like I said, I have a conscience, and I am responsible for my actions only, and not other people’s.\n\nI will not allow people choosing to hurt and deceive others to influence my behavior. I know right from wrong and that won’t change just because so many other people are ok with hurting their loved ones and living a lie.",
                    "author": null,
                    "id": "f23w0d0",
                    "parent_id": "t1_f23i67s",
                    "score": 1,
                    "created_utc": 1569939044.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "This SB is overthinking. LOL.",
            "author": "JELxin",
            "id": "f20ia7h",
            "parent_id": "t1_f209hrc",
            "score": 2,
            "created_utc": 1569860031.0,
            "replies": []
        },
        {
            "body": "Not only are you judgmental AF, you just assumed I’m still married and not already in the middle of an amicable divorce?\n\nTotally not surprised 😊😂😂\n\nKarma already HAS dear by blessing me with women that actually deeply care for me and my wants and desires.\n\nSo please, with all due respect, with sugar on top, go fuck yourself 😂",
            "author": "SDRippington",
            "id": "f24l998",
            "parent_id": "t1_f24irlv",
            "score": 2,
            "created_utc": 1569954851.0,
            "replies": []
        },
        {
            "body": "She’s not cheating. He is. Lmao.",
            "author": "LaNouvelleSugar",
            "id": "f23f9ev",
            "parent_id": "t1_f22z2l4",
            "score": 1,
            "created_utc": 1569921432.0,
            "replies": []
        },
        {
            "body": "To be perfectly honest, Whether you’re fucking for money or for whatever other reason that’s people’s personal problems. No one here should be judgmental. At all.",
            "author": "LaNouvelleSugar",
            "id": "f23f76j",
            "parent_id": "t1_f21ud7l",
            "score": 1,
            "created_utc": 1569921326.0,
            "replies": [
                {
                    "body": "That’s my point.",
                    "author": "SDRippington",
                    "id": "f23iv4w",
                    "parent_id": "t1_f23f76j",
                    "score": 2,
                    "created_utc": 1569927002.0,
                    "replies": [
                        {
                            "body": "Whereas that might be your point, you do sound a bit judgmental yourself. Just letting you know",
                            "author": "LaNouvelleSugar",
                            "id": "f23jgpd",
                            "parent_id": "t1_f23iv4w",
                            "score": 1,
                            "created_utc": 1569927778.0,
                            "replies": [
                                {
                                    "body": "Of course! Especially towards hypocritical people.\nThe irony is not lost on me.😂",
                                    "author": "SDRippington",
                                    "id": "f23jtvl",
                                    "parent_id": "t1_f23jgpd",
                                    "score": 1,
                                    "created_utc": 1569928231.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Like I said, I have a conscience, and I am responsible for my actions only, and not other people’s.\n\nI will not allow people choosing to hurt and deceive others to influence my behavior. I know right from wrong and that won’t change just because so many other people are ok with hurting their loved ones and living a lie.",
            "author": null,
            "id": "f23w0d0",
            "parent_id": "t1_f23i67s",
            "score": 1,
            "created_utc": 1569939044.0,
            "replies": []
        },
        {
            "body": "That’s my point.",
            "author": "SDRippington",
            "id": "f23iv4w",
            "parent_id": "t1_f23f76j",
            "score": 2,
            "created_utc": 1569927002.0,
            "replies": [
                {
                    "body": "Whereas that might be your point, you do sound a bit judgmental yourself. Just letting you know",
                    "author": "LaNouvelleSugar",
                    "id": "f23jgpd",
                    "parent_id": "t1_f23iv4w",
                    "score": 1,
                    "created_utc": 1569927778.0,
                    "replies": [
                        {
                            "body": "Of course! Especially towards hypocritical people.\nThe irony is not lost on me.😂",
                            "author": "SDRippington",
                            "id": "f23jtvl",
                            "parent_id": "t1_f23jgpd",
                            "score": 1,
                            "created_utc": 1569928231.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Whereas that might be your point, you do sound a bit judgmental yourself. Just letting you know",
            "author": "LaNouvelleSugar",
            "id": "f23jgpd",
            "parent_id": "t1_f23iv4w",
            "score": 1,
            "created_utc": 1569927778.0,
            "replies": [
                {
                    "body": "Of course! Especially towards hypocritical people.\nThe irony is not lost on me.😂",
                    "author": "SDRippington",
                    "id": "f23jtvl",
                    "parent_id": "t1_f23jgpd",
                    "score": 1,
                    "created_utc": 1569928231.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Of course! Especially towards hypocritical people.\nThe irony is not lost on me.😂",
            "author": "SDRippington",
            "id": "f23jtvl",
            "parent_id": "t1_f23jgpd",
            "score": 1,
            "created_utc": 1569928231.0,
            "replies": []
        }
    ]
}