{
    "title": "As a barber, here is my advice for the question of “how do I get my hair to look like this photo”",
    "post_id": "9kfm9v",
    "post_url": "https://www.reddit.com/r/malehairadvice/comments/9kfm9v/as_a_barber_here_is_my_advice_for_the_question_of/",
    "author": "onlyusemefade",
    "body": "",
    "url": "https://i.redd.it/nhzpv223bkp11.jpg",
    "score": 1034,
    "upvote_ratio": 0.96,
    "created_utc": 1538394470.0,
    "num_comments": 78,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "Did exactly this and ended up with my shit fucked up. It really depends on the barber.",
            "author": "Mineshort",
            "id": "e6yoz9f",
            "parent_id": "t3_9kfm9v",
            "score": 205,
            "created_utc": 1538395964.0,
            "replies": [
                {
                    "body": "I think multiple angles helps ",
                    "author": "JAM3SBND",
                    "id": "e6zf492",
                    "parent_id": "t1_e6yoz9f",
                    "score": 40,
                    "created_utc": 1538420163.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "e70qlve",
                            "parent_id": "t1_e6zf492",
                            "score": 13,
                            "created_utc": 1538474859.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "What if I just show up and say \"do what you want\"? That'll end well, right?",
            "author": null,
            "id": "e6yp1uq",
            "parent_id": "t3_9kfm9v",
            "score": 56,
            "created_utc": 1538396064.0,
            "replies": [
                {
                    "body": "If you do this the barber will just try to read what cuts you've received in the past and do the same thing.",
                    "author": "Luph",
                    "id": "e6ytfnb",
                    "parent_id": "t1_e6yp1uq",
                    "score": 41,
                    "created_utc": 1538401234.0,
                    "replies": []
                },
                {
                    "body": "Again it depends on the barber, most will know what’s best for your face shape and hair type etc",
                    "author": "onlyusemefade",
                    "id": "e6yp733",
                    "parent_id": "t1_e6yp1uq",
                    "score": 21,
                    "created_utc": 1538396264.0,
                    "replies": []
                },
                {
                    "body": "Worked for me. I got there and said. Do what you want but i want a rough separation between the top and the side and try to hide that me hairline is receding. \n\nSo she let more length in front in top and did something else for the rest. I then took a picture with my phone of all angles and bring it back to her everytime I go. \n\nHad the same haircut for a year now. ",
                    "author": null,
                    "id": "e70ufb5",
                    "parent_id": "t1_e6yp1uq",
                    "score": 4,
                    "created_utc": 1538481399.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Tbh we need more inspo albums sorted by hair length, style and face shape. I have massive cheekbones, a big forehead and beady little eyes and it’s difficult to see haircuts/ styles that would suit my facial structure ",
            "author": null,
            "id": "e6yqmfa",
            "parent_id": "t3_9kfm9v",
            "score": 43,
            "created_utc": 1538398105.0,
            "replies": [
                {
                    "body": "> massive cheekbones, a big forehead and beady little eyes\n\nlmao i feel like i'm being targeted",
                    "author": null,
                    "id": "e705d3v",
                    "parent_id": "t1_e6yqmfa",
                    "score": 13,
                    "created_utc": 1538443703.0,
                    "replies": [
                        {
                            "body": "Isn’t it hard to get inspo for your hair?",
                            "author": null,
                            "id": "e705fbh",
                            "parent_id": "t1_e705d3v",
                            "score": 1,
                            "created_utc": 1538443765.0,
                            "replies": [
                                {
                                    "body": "Not really tbph, I feel like there's lots of actors and models who have those three things.",
                                    "author": null,
                                    "id": "e705obd",
                                    "parent_id": "t1_e705fbh",
                                    "score": 2,
                                    "created_utc": 1538444010.0,
                                    "replies": [
                                        {
                                            "body": "Fair enough. I just don’t see myself looking even remotely similar to any actors or models",
                                            "author": null,
                                            "id": "e706vwr",
                                            "parent_id": "t1_e705obd",
                                            "score": 1,
                                            "created_utc": 1538445169.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "You know what? No this is a lazy cop out. This sub would be super helpful if it had people that knew what they were talking about and were willing to describe a haircut in barber terms. I, as well as many others have taken pictures in to a barber who have waved off you showing them a picture and still wanted to know what we want. Seeing some other person have a haircut with some features we like doesn’t always help. Telling them what we like about a pictured hair style would be gold. Instead it’s a bunch of gate keeping arm chair barbers yelling “short on the sides long on the top dur dur dur”.  If all it took were the words long and short to describe a haircut we’d all look perfect. ",
            "author": "_your_face",
            "id": "e6yqtcz",
            "parent_id": "t3_9kfm9v",
            "score": 127,
            "created_utc": 1538398326.0,
            "replies": [
                {
                    "body": "The problem with pictures is that you have a guy that comes in looking like Paul Giamatti and has a picture of David Beckham with him.\n\nIf you bring a picture, most of the time you can't even get the style anyway. Your hair texture could be different. The shape of your face. The direction your hair grows, clowlicks etc. \n\nYour best bet is to have a picture taken when you get a cut you like and also ask the barber to write down the clipper numbers he used and take that with you next time.\n\n&#x200B;",
                    "author": "the_nomads",
                    "id": "e6ysy0a",
                    "parent_id": "t1_e6yqtcz",
                    "score": 57,
                    "created_utc": 1538400717.0,
                    "replies": [
                        {
                            "body": "I've literally shown pictures of myself to barbers before and not received the same cut. To me getting a good cut is half speaking barber language and half a crap shoot on which barber you choose.",
                            "author": "Luph",
                            "id": "e6ytcox",
                            "parent_id": "t1_e6ysy0a",
                            "score": 48,
                            "created_utc": 1538401149.0,
                            "replies": [
                                {
                                    "body": "Sounds like bad barbers then. A good barber listens and then interprets and then does what the customer wants. If it is a case of unreasonable expectations on the part of the customer, then the barber needs to communicate that.\nPart of being a barber, in fact the biggest part, is communication. It's also up to him to really understand what it is you want. Unfortunately, these days most barbers are scrubs that thought it would be a fun job and don't know what they are doing. They can do a mean fade, but it's usually the same one they give to everybody no matter what.\nDoing a men's regular should be the easiest thing in the world, especially if the instructions were clear. If the instructions were not clear on the customer's part, it's still  the barber's fault if the cut didn't come out right. A good barber knows not to start cutting until everybody is clear on how the cut will come out.",
                                    "author": "the_nomads",
                                    "id": "e6yupvy",
                                    "parent_id": "t1_e6ytcox",
                                    "score": 10,
                                    "created_utc": 1538402534.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "well said",
                            "author": "iDream3d",
                            "id": "e6yu28w",
                            "parent_id": "t1_e6ysy0a",
                            "score": 3,
                            "created_utc": 1538401873.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "I still give people advice on this sub, the point of this is that if you’ve got a picture and that is exactly what you want then you should show it to your barber, \nIf there’s parts of a photo someone likes but they’d like the top longer or the sides shorter or whatever I’m happy to put it into Lehman’s terms for anyone ",
                    "author": "onlyusemefade",
                    "id": "e6yqz54",
                    "parent_id": "t1_e6yqtcz",
                    "score": 5,
                    "created_utc": 1538398509.0,
                    "replies": [
                        {
                            "body": "r/boneappletea I just found this sub today and I already have the opportunity to use it.",
                            "author": null,
                            "id": "e6yrudx",
                            "parent_id": "t1_e6yqz54",
                            "score": 8,
                            "created_utc": 1538399505.0,
                            "replies": [
                                {
                                    "body": "What did I do!!? ",
                                    "author": "onlyusemefade",
                                    "id": "e6yt1ov",
                                    "parent_id": "t1_e6yrudx",
                                    "score": 5,
                                    "created_utc": 1538400828.0,
                                    "replies": [
                                        {
                                            "body": "layman's terms",
                                            "author": "stale_nuts",
                                            "id": "e6yx18y",
                                            "parent_id": "t1_e6yt1ov",
                                            "score": 8,
                                            "created_utc": 1538404771.0,
                                            "replies": [
                                                {
                                                    "body": "Ah so it has nothing to do with the former arsenal and Germany goalkeeper? ",
                                                    "author": "onlyusemefade",
                                                    "id": "e6yxcjf",
                                                    "parent_id": "t1_e6yx18y",
                                                    "score": 10,
                                                    "created_utc": 1538405067.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "Here's a sneak peek of /r/BoneAppleTea using the [top posts](https://np.reddit.com/r/BoneAppleTea/top/?sort=top&t=all) of all time!\n\n\\#1: [Sorry, Kevin \\[Legit\\]](https://i.imgur.com/Db4X9Gt.png) | [434 comments](https://np.reddit.com/r/BoneAppleTea/comments/9h3nca/sorry_kevin_legit/)  \n\\#2: [\\[Legit\\] Leonardo DiCaprio the painter](https://i.redd.it/yzsodx5wg6c11.png) | [170 comments](https://np.reddit.com/r/BoneAppleTea/comments/91wyv2/legit_leonardo_dicaprio_the_painter/)  \n\\#3: [\\[Legit\\] Keep us posted](https://i.redd.it/g0pte2s6k9k11.jpg) | [81 comments](https://np.reddit.com/r/BoneAppleTea/comments/9cya9r/legit_keep_us_posted/)\n\n----\n^^I'm ^^a ^^bot, ^^beep ^^boop ^^| ^^Downvote ^^to ^^remove ^^| [^^Contact ^^me](https://www.reddit.com/message/compose/?to=sneakpeekbot) ^^| [^^Info](https://np.reddit.com/r/sneakpeekbot/) ^^| [^^Opt-out](https://np.reddit.com/r/sneakpeekbot/comments/8wfgsm/blacklist/)",
                                    "author": "sneakpeekbot",
                                    "id": "e6yrv0s",
                                    "parent_id": "t1_e6yrudx",
                                    "score": 2,
                                    "created_utc": 1538399525.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Theres not exactly a lot of barber terms out there to match every hairstyle. And if is that really is the case for you, get a new barber.",
                    "author": "LoyaltyLlama",
                    "id": "e6yv34d",
                    "parent_id": "t1_e6yqtcz",
                    "score": 3,
                    "created_utc": 1538402898.0,
                    "replies": []
                },
                {
                    "body": "I mean I guess I kind of agree but if you honestly have a barber waving off a picture of what you’re wanting then you should look for a better barber. That’s honestly really poor service. Either that or you’re showing them a pic of something that can’t be achieved with your hair type- which is on you more than anything else. \n\nWhat would be more helpful if the sub had rules against just posting a pick of some male model asking how to achieve the look- at least provide details pics of how their own hair looks. Would actually provide substance for actual discussion. For a lot of these posts there’s not really much more advise to give then the standard cookie cutter answer. Which to be fair, while unoriginal is still decent advise. \n\nEDIT: I’ll also add that barber terms aren’t really standardized across the industry. An Ivy League to one guy is a something entirely different to another. Pics help prevent misunderstanding in general ",
                    "author": "Wolfsnatch",
                    "id": "e70acpz",
                    "parent_id": "t1_e6yqtcz",
                    "score": 1,
                    "created_utc": 1538448493.0,
                    "replies": []
                },
                {
                    "body": "honestly, if you take a photo to your \"barber\" and he doesn't understand what you want then there is no way he going to understand if you explain it to him.  You may need to switch barbers.  i switched barbers countless times, until i found one i clicked with and who understood what i wanted to where i dont have to explain anymore.  i sit in the chair and let him do his thing.",
                    "author": "iDream3d",
                    "id": "e6yttu9",
                    "parent_id": "t1_e6yqtcz",
                    "score": 1,
                    "created_utc": 1538401637.0,
                    "replies": [
                        {
                            "body": "Ah yes. Show a picture, didn’t work? New barber! More of that useless advice. Why are people even in this sub if all they want to do is tell people to take a picture to their barber? It would be much more useful if this sub did what it was intended and tell a person that a haircut is a tapered whatever, #2 clipper, textured scissor cut etc etc. But naw, everyone shows up to tell people they shouldn’t bother posting and just show a picture of some model and not be able to explain what they like about a cut. I swear the sub thinks we can just use two words “long,short” and be able to explain a styling. If long and short is all it took to do a cut there wouldn’t be barber schools and every haircut would be perfect.",
                            "author": "_your_face",
                            "id": "e6yzd76",
                            "parent_id": "t1_e6yttu9",
                            "score": 5,
                            "created_utc": 1538406881.0,
                            "replies": [
                                {
                                    "body": "[removed]",
                                    "author": null,
                                    "id": "e6yzjte",
                                    "parent_id": "t1_e6yzd76",
                                    "score": -4,
                                    "created_utc": 1538407045.0,
                                    "replies": [
                                        {
                                            "body": "Again, why are you even here? Is every person supposed to be a barber or they are a child? Sharing barber knowledge and information is the point of this sub. Please improve the place by unsubscribing. ",
                                            "author": "_your_face",
                                            "id": "e6yzwp7",
                                            "parent_id": "t1_e6yzjte",
                                            "score": 8,
                                            "created_utc": 1538407358.0,
                                            "replies": [
                                                {
                                                    "body": "Im here because i appreciate the way i look and im always looking for new techniques, new looks and to try new things.  not sit here and have someone hold my hand while getting my hair cut.  does your mom still take you?  You should have a decent understanding of your face, head shape and what styles fit your head.  you show your barber the picture and the walk him through while he is cutting.  \"  no leave that side longer\"  \"can you fade the sides shorter\"  its all about communication.. seems like you just dont have a back bone to correct a barber when they mess your hair up.  Its perfectly normal to switch barbers.  i did that 5 times until i found the right one.  no one can do for you what you cant do yourself.  i will stay subscribed and i will continue to post.  go learn how to groom yourself.  i really hope you know how to bathe as well?  or does mom still do that for you too?  ",
                                                    "author": "iDream3d",
                                                    "id": "e6z0apz",
                                                    "parent_id": "t1_e6yzwp7",
                                                    "score": 1,
                                                    "created_utc": 1538407699.0,
                                                    "replies": [
                                                        {
                                                            "body": "The Mum jokes are not only petty but weak at that, and don’t even make sense. \nYou guys are basically agreeing as well. You want to learn stuff about hair cuts. So does that guy. Sometimes a photo might help you get your point across sure, but the point of this sub is to help people with everything that can’t be conveyed in a photo, or to give a barber more specific descriptions about what you want.\nHow is anyone supposed to know what they want if they can’t explain it? Knowing more terms would be helpful for me, I’d like to know more about what styles suit what head shapes, and what techniques produce certain looks. Hence, I joined this sub.\nYou guys are saying the same things, but then you make these childish jokes in an attempt to make him look bad. Not only do I not see the reason, but it also just makes you look like immature. You can do better than this, I’m sure. \n\nOr does Mummy still help you write your Reddit comments? See how pathetic it is?",
                                                            "author": "NumerousImprovements",
                                                            "id": "e6zml9d",
                                                            "parent_id": "t1_e6z0apz",
                                                            "score": 2,
                                                            "created_utc": 1538426171.0,
                                                            "replies": [
                                                                {
                                                                    "body": "There is something called communication.  i dont know all the terms a barber uses, and sometimes i forget what number i get on the sides too.  But you have the power of the internet as well as your words to explain what you want.  this guy is acting like its the end of the world if we dont tell him the name of a hair cut.  my point being a barber is going to understand you more if you show a picture vs if you tell him a dumb ass name for a hair cut.  He is acting like its our fault that he cant find a barber to work with his hair.  and i simply put that he shows a picture or find a new barber.  he didnt like that answer and decided that he had the authority to tell me to unsubscribe just because he is mentally challenged.  All you need to do is watch what your barber is doing and correct him.  you start with a higher guardand work your way down.  its trial and error.  nothing we say will help him with his barber.  all barbers use different lingo.  a fade to one barber is the equivalent to a taper for another.  its his responsibility to manage his own head not ours.  we cant put words in his mouth so he can come back and blame everyone here for a bad hair cut.  plus, i never insulted his mom.  i just asked if his mom still wipes when he uses the bathroom.. lol",
                                                                    "author": "iDream3d",
                                                                    "id": "e6zn60d",
                                                                    "parent_id": "t1_e6zml9d",
                                                                    "score": 1,
                                                                    "created_utc": 1538426627.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "Oh I agree with a lot of what you said, but you say he has the internet at his disposal... that’s what Reddit is. It’s a great resource to learn more. I just think you can’t really tell him his hairstyle is his responsibility and also be subscribed to this subreddit. The two things don’t contradict each other but you seem to be saying that they do. I think he just phrased some things badly.\n\nTo focus on actually solving something though... Maybe what people should be doing is, instead of asking “how can I get my barber to do this haircut?” They should instead be specifying that they want to know some more ways to describe that particular cut to their barber, like “how can I describe the fringe on this hairstyle?”. This helps anything people could want; ability to google further images, ability to describe it to a barber, etc. Then that covers most posts here. \n",
                                                                            "author": "NumerousImprovements",
                                                                            "id": "e6zqkd0",
                                                                            "parent_id": "t1_e6zn60d",
                                                                            "score": 5,
                                                                            "created_utc": 1538429493.0,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "The problem you're likely not seeing is that we do this _and then we still don't get what we want_. I have lost count of the number of times I've taken a photo with me _and walked out not resembling it at all_.",
            "author": "henrebotha",
            "id": "e6ysftf",
            "parent_id": "t3_9kfm9v",
            "score": 15,
            "created_utc": 1538400172.0,
            "replies": [
                {
                    "body": "Yes this has happened many times to me too, I showed the barber a picture of the fade I got and of the back of my head. When I came out the fade he gave me was way too high for my liking and he ignored the back... ",
                    "author": "Sypherior",
                    "id": "e6ywopg",
                    "parent_id": "t1_e6ysftf",
                    "score": 3,
                    "created_utc": 1538404446.0,
                    "replies": []
                },
                {
                    "body": "Yeah it can be the case with some barbers, me included if it’s something I’m not used to doing very often ",
                    "author": "onlyusemefade",
                    "id": "e6ysyw0",
                    "parent_id": "t1_e6ysftf",
                    "score": 1,
                    "created_utc": 1538400743.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "What if I don't know what I want? I thought that was kind of the point of this sub...",
            "author": "rabbit358",
            "id": "e6ywbbu",
            "parent_id": "t3_9kfm9v",
            "score": 12,
            "created_utc": 1538404090.0,
            "replies": [
                {
                    "body": "It is!! This is for when people post a picture saying that they want *that* hairstyle but don’t know how to describe it. If you don’t know what you want then ask away! ",
                    "author": "onlyusemefade",
                    "id": "e6ywh02",
                    "parent_id": "t1_e6ywbbu",
                    "score": -5,
                    "created_utc": 1538404244.0,
                    "replies": [
                        {
                            "body": "I feel like a lot of people posting those pictures are asking for *styling* tips, rather than/in addition to how to get the cut. I've seen several threads (and I'm a very casual visitor) just over the last few weeks where people have asked for both and only had replies saying \"show the pic to the barber\". Which really is not helpful in the slightest.",
                            "author": "Lorenzo_Insigne",
                            "id": "e70rc7t",
                            "parent_id": "t1_e6ywh02",
                            "score": 3,
                            "created_utc": 1538476326.0,
                            "replies": [
                                {
                                    "body": "No they are a lot of the time. This post needs to be taken with a pinch of salt. I’ve got no problem with any posts on this sub ",
                                    "author": "onlyusemefade",
                                    "id": "e70re0k",
                                    "parent_id": "t1_e70rc7t",
                                    "score": 1,
                                    "created_utc": 1538476420.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Ground breaking.",
            "author": "Nottzmaster",
            "id": "e6yo5bm",
            "parent_id": "t3_9kfm9v",
            "score": 49,
            "created_utc": 1538394750.0,
            "replies": []
        },
        {
            "body": "\"How do I get my hair to look like this photo?\"\n\n\"Do you have a photo?\"\n\n\"No\"",
            "author": "skibbidy-wop",
            "id": "e6ysb9p",
            "parent_id": "t3_9kfm9v",
            "score": 10,
            "created_utc": 1538400035.0,
            "replies": []
        },
        {
            "body": "I've gotten \"I can't do it. I can't see what it looks like from the front/back/side/<whatever side that isn't visible in the photo>\" and obviously if it's just some photo of just some guy then he's not gonna be having pictures of the same haircut from like 5 different angles so like, ¯\\\\\\_(ツ)_/¯ ",
            "author": "xerxerneas",
            "id": "e6ytdj2",
            "parent_id": "t3_9kfm9v",
            "score": 5,
            "created_utc": 1538401174.0,
            "replies": [
                {
                    "body": "Unless the angle is like a mugshot you can get a fairly good idea of what the rest should look like from one photo, plus it’s not as though you’d be showing them a style that they’d never seen or done before ",
                    "author": "onlyusemefade",
                    "id": "e6ytig4",
                    "parent_id": "t1_e6ytdj2",
                    "score": 0,
                    "created_utc": 1538401315.0,
                    "replies": [
                        {
                            "body": "I've gotten this reaction from at least 7 diff barbers/hairdressers (we've got a lot here in Singapore) and most of them really aren't confident in giving a contemporary haircut unless they can see a reference from all sides, else it's just a bland run of the mill cut for school kids :/",
                            "author": "xerxerneas",
                            "id": "e6z1qj6",
                            "parent_id": "t1_e6ytig4",
                            "score": 7,
                            "created_utc": 1538408942.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "There is so much more to a hairstyle then just what the barber can do....\n\nPeople need information like what product to use, how to shampoo and/or condition their hair. They want to know if they should be blow drying it to get the look or towel drying.\n\nThe idea that the buck starts and stops with the barber is bullshit.",
            "author": "fuck_off_email",
            "id": "e6yvy0r",
            "parent_id": "t3_9kfm9v",
            "score": 7,
            "created_utc": 1538403736.0,
            "replies": [
                {
                    "body": "Of course they do, styling and upkeep isn’t what my post is about, it was supposed to be a little tongue in cheek, ",
                    "author": "onlyusemefade",
                    "id": "e6ywese",
                    "parent_id": "t1_e6yvy0r",
                    "score": 0,
                    "created_utc": 1538404184.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Also, a picture of YOU with the haircut you want, from a couple well lit angles will also work wonders\n\n\nSource: barber ",
            "author": "FragGrenade",
            "id": "e6yobjb",
            "parent_id": "t3_9kfm9v",
            "score": 33,
            "created_utc": 1538395008.0,
            "replies": [
                {
                    "body": "So to get the haircut you brings picture of you already wearing the haircut\n",
                    "author": "4937658460",
                    "id": "e6z3a1u",
                    "parent_id": "t1_e6yobjb",
                    "score": 24,
                    "created_utc": 1538410273.0,
                    "replies": [
                        {
                            "body": "Lmao. I don't get this either. 😂 Can't bring a picture of you with said haircut if you've never had it before which is most cases for bringing a photo/posting on here for suggestions.",
                            "author": "ReddtKeyboardWarrior",
                            "id": "e6z4srn",
                            "parent_id": "t1_e6z3a1u",
                            "score": 21,
                            "created_utc": 1538411568.0,
                            "replies": [
                                {
                                    "body": "It's different, but related, advice. They're saying, once you get a cut you like, take good photos of it from multiple angles, and it'll be a lot easier for anybody, not just the person who last cut your hair, to reproduce it.",
                                    "author": "isarl",
                                    "id": "e6z89yb",
                                    "parent_id": "t1_e6z4srn",
                                    "score": 3,
                                    "created_utc": 1538414491.0,
                                    "replies": [
                                        {
                                            "body": "Thank you ",
                                            "author": "FragGrenade",
                                            "id": "e6zm9pg",
                                            "parent_id": "t1_e6z89yb",
                                            "score": 1,
                                            "created_utc": 1538425915.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "Yes, photoshop onto your hed",
                            "author": "sangotenrs",
                            "id": "e6zg2o0",
                            "parent_id": "t1_e6z3a1u",
                            "score": 2,
                            "created_utc": 1538420948.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "That’s even better ",
                    "author": "onlyusemefade",
                    "id": "e6yoc4f",
                    "parent_id": "t1_e6yobjb",
                    "score": 9,
                    "created_utc": 1538395033.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "For me, this doesn't work 80% of the time. Sadly. My hair does what it wants",
            "author": "Jonah_Snow",
            "id": "e6ysj7n",
            "parent_id": "t3_9kfm9v",
            "score": 4,
            "created_utc": 1538400278.0,
            "replies": [
                {
                    "body": "It’s the case with a lot of hair, some is way more difficult to tame, it’s often trial and error to find what’s right ",
                    "author": "onlyusemefade",
                    "id": "e6yswoh",
                    "parent_id": "t1_e6ysj7n",
                    "score": 1,
                    "created_utc": 1538400678.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "This is brilliant! But I like asking random people on the internet.",
            "author": "CommonChris",
            "id": "e6yogxg",
            "parent_id": "t3_9kfm9v",
            "score": 7,
            "created_utc": 1538395227.0,
            "replies": [
                {
                    "body": "Hey there’s nothing wrong with asking other people’s advice! ",
                    "author": "onlyusemefade",
                    "id": "e6yoi42",
                    "parent_id": "t1_e6yogxg",
                    "score": 2,
                    "created_utc": 1538395275.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "As someone who got his hair totally fucked up this isn’t always true. I went to the “best” barber in my city and showed a picture of exactly what I wanted. He said no problem and would ask to keep the picture out while he cut. The end result was devastating. It was so bad I decided to shave my entire head. I’ve talked to most barbers and some prefer you tell them instead of show them.",
            "author": "thereturnoffaraam",
            "id": "e6zd6fx",
            "parent_id": "t3_9kfm9v",
            "score": 2,
            "created_utc": 1538418573.0,
            "replies": []
        },
        {
            "body": "Didn’t this sub have a rule about “what should I ask for” posts? I feel as if it was addressed by mods at one point though I may be crazy ",
            "author": "Mrminecrafthimself",
            "id": "e6yq4eb",
            "parent_id": "t3_9kfm9v",
            "score": 1,
            "created_utc": 1538397486.0,
            "replies": []
        },
        {
            "body": "Can you put arrows on the ‘yes’ and ‘no’ lines please? It’s bugging me",
            "author": null,
            "id": "e6yrbsb",
            "parent_id": "t3_9kfm9v",
            "score": 1,
            "created_utc": 1538398908.0,
            "replies": [
                {
                    "body": "I knew this would get said hahaha",
                    "author": "onlyusemefade",
                    "id": "e6yrci3",
                    "parent_id": "t1_e6yrbsb",
                    "score": 1,
                    "created_utc": 1538398932.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Oldschool cod youtube wactcher I see.",
            "author": "Mrfatmanjunior",
            "id": "e6yrvhx",
            "parent_id": "t3_9kfm9v",
            "score": 1,
            "created_utc": 1538399540.0,
            "replies": [
                {
                    "body": "Good spot my man ",
                    "author": "onlyusemefade",
                    "id": "e6ysvol",
                    "parent_id": "t1_e6yrvhx",
                    "score": 1,
                    "created_utc": 1538400647.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I dont know how many post i see, of men posting a picture asking how to explain this to their barber?  Like they looked for the picture, posted it to this subreddit, and gave it a title with a description. ",
            "author": "iDream3d",
            "id": "e6ytaur",
            "parent_id": "t3_9kfm9v",
            "score": 1,
            "created_utc": 1538401095.0,
            "replies": []
        },
        {
            "body": "So profound",
            "author": "skillaz1",
            "id": "e6yv0d0",
            "parent_id": "t3_9kfm9v",
            "score": 1,
            "created_utc": 1538402821.0,
            "replies": []
        },
        {
            "body": "Doesn't work, barber can't make my hair grow.",
            "author": "ageofempires16",
            "id": "e6zkmwt",
            "parent_id": "t3_9kfm9v",
            "score": 1,
            "created_utc": 1538424607.0,
            "replies": [
                {
                    "body": "You make a good point ",
                    "author": "onlyusemefade",
                    "id": "e6zknys",
                    "parent_id": "t1_e6zkmwt",
                    "score": 1,
                    "created_utc": 1538424633.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "It's the classic paradox. Which came first, the pic or the cut? The cosmic cut.",
            "author": "Jamesisawake",
            "id": "e6zlal9",
            "parent_id": "t3_9kfm9v",
            "score": 1,
            "created_utc": 1538425129.0,
            "replies": []
        },
        {
            "body": "do people really show pictures to their barber? /s",
            "author": "ROCKLOBSTER154",
            "id": "e6zmh8i",
            "parent_id": "t3_9kfm9v",
            "score": 1,
            "created_utc": 1538426082.0,
            "replies": [
                {
                    "body": "Can confirm ",
                    "author": "onlyusemefade",
                    "id": "e6zmi5z",
                    "parent_id": "t1_e6zmh8i",
                    "score": 1,
                    "created_utc": 1538426103.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "It never works. IT NEVER WORKS. \n\nI have showed photos to barbers plenty of times, and they always still do their own thing and don't pay attention to the photo at all. ",
            "author": "BuboTitan",
            "id": "e6zvf06",
            "parent_id": "t3_9kfm9v",
            "score": 1,
            "created_utc": 1538433864.0,
            "replies": [
                {
                    "body": "It never works *for you*",
                    "author": "onlyusemefade",
                    "id": "e6zx6gu",
                    "parent_id": "t1_e6zvf06",
                    "score": 1,
                    "created_utc": 1538435606.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Thing is, I don’t even know if that hair would even suit me",
            "author": "Jinium",
            "id": "e70chju",
            "parent_id": "t3_9kfm9v",
            "score": 1,
            "created_utc": 1538450581.0,
            "replies": [
                {
                    "body": "That’s what this sub is for!! ",
                    "author": "onlyusemefade",
                    "id": "e70ps52",
                    "parent_id": "t1_e70chju",
                    "score": 1,
                    "created_utc": 1538473095.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I went to a barber with a photo, he was bit of a dick. I showed him the pic and said please get me this length. I didnt even say style. And he went on to tell me about how he cant make me look like him because I have a weak jawline. Son of a bitch.",
            "author": "Broda10",
            "id": "e70yqc8",
            "parent_id": "t3_9kfm9v",
            "score": 1,
            "created_utc": 1538486502.0,
            "replies": [
                {
                    "body": "I take it you’re not going back ",
                    "author": "onlyusemefade",
                    "id": "e70yrq6",
                    "parent_id": "t1_e70yqc8",
                    "score": 1,
                    "created_utc": 1538486541.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Directions too confusing, got dick stuck in fan.",
            "author": "FlipterBulb",
            "id": "e6yowwj",
            "parent_id": "t3_9kfm9v",
            "score": 1,
            "created_utc": 1538395869.0,
            "replies": []
        },
        {
            "body": "I think multiple angles helps ",
            "author": "JAM3SBND",
            "id": "e6zf492",
            "parent_id": "t1_e6yoz9f",
            "score": 40,
            "created_utc": 1538420163.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "e70qlve",
                    "parent_id": "t1_e6zf492",
                    "score": 13,
                    "created_utc": 1538474859.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "If you do this the barber will just try to read what cuts you've received in the past and do the same thing.",
            "author": "Luph",
            "id": "e6ytfnb",
            "parent_id": "t1_e6yp1uq",
            "score": 41,
            "created_utc": 1538401234.0,
            "replies": []
        },
        {
            "body": "Again it depends on the barber, most will know what’s best for your face shape and hair type etc",
            "author": "onlyusemefade",
            "id": "e6yp733",
            "parent_id": "t1_e6yp1uq",
            "score": 21,
            "created_utc": 1538396264.0,
            "replies": []
        },
        {
            "body": "Worked for me. I got there and said. Do what you want but i want a rough separation between the top and the side and try to hide that me hairline is receding. \n\nSo she let more length in front in top and did something else for the rest. I then took a picture with my phone of all angles and bring it back to her everytime I go. \n\nHad the same haircut for a year now. ",
            "author": null,
            "id": "e70ufb5",
            "parent_id": "t1_e6yp1uq",
            "score": 4,
            "created_utc": 1538481399.0,
            "replies": []
        },
        {
            "body": "> massive cheekbones, a big forehead and beady little eyes\n\nlmao i feel like i'm being targeted",
            "author": null,
            "id": "e705d3v",
            "parent_id": "t1_e6yqmfa",
            "score": 13,
            "created_utc": 1538443703.0,
            "replies": [
                {
                    "body": "Isn’t it hard to get inspo for your hair?",
                    "author": null,
                    "id": "e705fbh",
                    "parent_id": "t1_e705d3v",
                    "score": 1,
                    "created_utc": 1538443765.0,
                    "replies": [
                        {
                            "body": "Not really tbph, I feel like there's lots of actors and models who have those three things.",
                            "author": null,
                            "id": "e705obd",
                            "parent_id": "t1_e705fbh",
                            "score": 2,
                            "created_utc": 1538444010.0,
                            "replies": [
                                {
                                    "body": "Fair enough. I just don’t see myself looking even remotely similar to any actors or models",
                                    "author": null,
                                    "id": "e706vwr",
                                    "parent_id": "t1_e705obd",
                                    "score": 1,
                                    "created_utc": 1538445169.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "The problem with pictures is that you have a guy that comes in looking like Paul Giamatti and has a picture of David Beckham with him.\n\nIf you bring a picture, most of the time you can't even get the style anyway. Your hair texture could be different. The shape of your face. The direction your hair grows, clowlicks etc. \n\nYour best bet is to have a picture taken when you get a cut you like and also ask the barber to write down the clipper numbers he used and take that with you next time.\n\n&#x200B;",
            "author": "the_nomads",
            "id": "e6ysy0a",
            "parent_id": "t1_e6yqtcz",
            "score": 57,
            "created_utc": 1538400717.0,
            "replies": [
                {
                    "body": "I've literally shown pictures of myself to barbers before and not received the same cut. To me getting a good cut is half speaking barber language and half a crap shoot on which barber you choose.",
                    "author": "Luph",
                    "id": "e6ytcox",
                    "parent_id": "t1_e6ysy0a",
                    "score": 48,
                    "created_utc": 1538401149.0,
                    "replies": [
                        {
                            "body": "Sounds like bad barbers then. A good barber listens and then interprets and then does what the customer wants. If it is a case of unreasonable expectations on the part of the customer, then the barber needs to communicate that.\nPart of being a barber, in fact the biggest part, is communication. It's also up to him to really understand what it is you want. Unfortunately, these days most barbers are scrubs that thought it would be a fun job and don't know what they are doing. They can do a mean fade, but it's usually the same one they give to everybody no matter what.\nDoing a men's regular should be the easiest thing in the world, especially if the instructions were clear. If the instructions were not clear on the customer's part, it's still  the barber's fault if the cut didn't come out right. A good barber knows not to start cutting until everybody is clear on how the cut will come out.",
                            "author": "the_nomads",
                            "id": "e6yupvy",
                            "parent_id": "t1_e6ytcox",
                            "score": 10,
                            "created_utc": 1538402534.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "well said",
                    "author": "iDream3d",
                    "id": "e6yu28w",
                    "parent_id": "t1_e6ysy0a",
                    "score": 3,
                    "created_utc": 1538401873.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I still give people advice on this sub, the point of this is that if you’ve got a picture and that is exactly what you want then you should show it to your barber, \nIf there’s parts of a photo someone likes but they’d like the top longer or the sides shorter or whatever I’m happy to put it into Lehman’s terms for anyone ",
            "author": "onlyusemefade",
            "id": "e6yqz54",
            "parent_id": "t1_e6yqtcz",
            "score": 5,
            "created_utc": 1538398509.0,
            "replies": [
                {
                    "body": "r/boneappletea I just found this sub today and I already have the opportunity to use it.",
                    "author": null,
                    "id": "e6yrudx",
                    "parent_id": "t1_e6yqz54",
                    "score": 8,
                    "created_utc": 1538399505.0,
                    "replies": [
                        {
                            "body": "What did I do!!? ",
                            "author": "onlyusemefade",
                            "id": "e6yt1ov",
                            "parent_id": "t1_e6yrudx",
                            "score": 5,
                            "created_utc": 1538400828.0,
                            "replies": [
                                {
                                    "body": "layman's terms",
                                    "author": "stale_nuts",
                                    "id": "e6yx18y",
                                    "parent_id": "t1_e6yt1ov",
                                    "score": 8,
                                    "created_utc": 1538404771.0,
                                    "replies": [
                                        {
                                            "body": "Ah so it has nothing to do with the former arsenal and Germany goalkeeper? ",
                                            "author": "onlyusemefade",
                                            "id": "e6yxcjf",
                                            "parent_id": "t1_e6yx18y",
                                            "score": 10,
                                            "created_utc": 1538405067.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "Here's a sneak peek of /r/BoneAppleTea using the [top posts](https://np.reddit.com/r/BoneAppleTea/top/?sort=top&t=all) of all time!\n\n\\#1: [Sorry, Kevin \\[Legit\\]](https://i.imgur.com/Db4X9Gt.png) | [434 comments](https://np.reddit.com/r/BoneAppleTea/comments/9h3nca/sorry_kevin_legit/)  \n\\#2: [\\[Legit\\] Leonardo DiCaprio the painter](https://i.redd.it/yzsodx5wg6c11.png) | [170 comments](https://np.reddit.com/r/BoneAppleTea/comments/91wyv2/legit_leonardo_dicaprio_the_painter/)  \n\\#3: [\\[Legit\\] Keep us posted](https://i.redd.it/g0pte2s6k9k11.jpg) | [81 comments](https://np.reddit.com/r/BoneAppleTea/comments/9cya9r/legit_keep_us_posted/)\n\n----\n^^I'm ^^a ^^bot, ^^beep ^^boop ^^| ^^Downvote ^^to ^^remove ^^| [^^Contact ^^me](https://www.reddit.com/message/compose/?to=sneakpeekbot) ^^| [^^Info](https://np.reddit.com/r/sneakpeekbot/) ^^| [^^Opt-out](https://np.reddit.com/r/sneakpeekbot/comments/8wfgsm/blacklist/)",
                            "author": "sneakpeekbot",
                            "id": "e6yrv0s",
                            "parent_id": "t1_e6yrudx",
                            "score": 2,
                            "created_utc": 1538399525.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Theres not exactly a lot of barber terms out there to match every hairstyle. And if is that really is the case for you, get a new barber.",
            "author": "LoyaltyLlama",
            "id": "e6yv34d",
            "parent_id": "t1_e6yqtcz",
            "score": 3,
            "created_utc": 1538402898.0,
            "replies": []
        },
        {
            "body": "I mean I guess I kind of agree but if you honestly have a barber waving off a picture of what you’re wanting then you should look for a better barber. That’s honestly really poor service. Either that or you’re showing them a pic of something that can’t be achieved with your hair type- which is on you more than anything else. \n\nWhat would be more helpful if the sub had rules against just posting a pick of some male model asking how to achieve the look- at least provide details pics of how their own hair looks. Would actually provide substance for actual discussion. For a lot of these posts there’s not really much more advise to give then the standard cookie cutter answer. Which to be fair, while unoriginal is still decent advise. \n\nEDIT: I’ll also add that barber terms aren’t really standardized across the industry. An Ivy League to one guy is a something entirely different to another. Pics help prevent misunderstanding in general ",
            "author": "Wolfsnatch",
            "id": "e70acpz",
            "parent_id": "t1_e6yqtcz",
            "score": 1,
            "created_utc": 1538448493.0,
            "replies": []
        },
        {
            "body": "honestly, if you take a photo to your \"barber\" and he doesn't understand what you want then there is no way he going to understand if you explain it to him.  You may need to switch barbers.  i switched barbers countless times, until i found one i clicked with and who understood what i wanted to where i dont have to explain anymore.  i sit in the chair and let him do his thing.",
            "author": "iDream3d",
            "id": "e6yttu9",
            "parent_id": "t1_e6yqtcz",
            "score": 1,
            "created_utc": 1538401637.0,
            "replies": [
                {
                    "body": "Ah yes. Show a picture, didn’t work? New barber! More of that useless advice. Why are people even in this sub if all they want to do is tell people to take a picture to their barber? It would be much more useful if this sub did what it was intended and tell a person that a haircut is a tapered whatever, #2 clipper, textured scissor cut etc etc. But naw, everyone shows up to tell people they shouldn’t bother posting and just show a picture of some model and not be able to explain what they like about a cut. I swear the sub thinks we can just use two words “long,short” and be able to explain a styling. If long and short is all it took to do a cut there wouldn’t be barber schools and every haircut would be perfect.",
                    "author": "_your_face",
                    "id": "e6yzd76",
                    "parent_id": "t1_e6yttu9",
                    "score": 5,
                    "created_utc": 1538406881.0,
                    "replies": [
                        {
                            "body": "[removed]",
                            "author": null,
                            "id": "e6yzjte",
                            "parent_id": "t1_e6yzd76",
                            "score": -4,
                            "created_utc": 1538407045.0,
                            "replies": [
                                {
                                    "body": "Again, why are you even here? Is every person supposed to be a barber or they are a child? Sharing barber knowledge and information is the point of this sub. Please improve the place by unsubscribing. ",
                                    "author": "_your_face",
                                    "id": "e6yzwp7",
                                    "parent_id": "t1_e6yzjte",
                                    "score": 8,
                                    "created_utc": 1538407358.0,
                                    "replies": [
                                        {
                                            "body": "Im here because i appreciate the way i look and im always looking for new techniques, new looks and to try new things.  not sit here and have someone hold my hand while getting my hair cut.  does your mom still take you?  You should have a decent understanding of your face, head shape and what styles fit your head.  you show your barber the picture and the walk him through while he is cutting.  \"  no leave that side longer\"  \"can you fade the sides shorter\"  its all about communication.. seems like you just dont have a back bone to correct a barber when they mess your hair up.  Its perfectly normal to switch barbers.  i did that 5 times until i found the right one.  no one can do for you what you cant do yourself.  i will stay subscribed and i will continue to post.  go learn how to groom yourself.  i really hope you know how to bathe as well?  or does mom still do that for you too?  ",
                                            "author": "iDream3d",
                                            "id": "e6z0apz",
                                            "parent_id": "t1_e6yzwp7",
                                            "score": 1,
                                            "created_utc": 1538407699.0,
                                            "replies": [
                                                {
                                                    "body": "The Mum jokes are not only petty but weak at that, and don’t even make sense. \nYou guys are basically agreeing as well. You want to learn stuff about hair cuts. So does that guy. Sometimes a photo might help you get your point across sure, but the point of this sub is to help people with everything that can’t be conveyed in a photo, or to give a barber more specific descriptions about what you want.\nHow is anyone supposed to know what they want if they can’t explain it? Knowing more terms would be helpful for me, I’d like to know more about what styles suit what head shapes, and what techniques produce certain looks. Hence, I joined this sub.\nYou guys are saying the same things, but then you make these childish jokes in an attempt to make him look bad. Not only do I not see the reason, but it also just makes you look like immature. You can do better than this, I’m sure. \n\nOr does Mummy still help you write your Reddit comments? See how pathetic it is?",
                                                    "author": "NumerousImprovements",
                                                    "id": "e6zml9d",
                                                    "parent_id": "t1_e6z0apz",
                                                    "score": 2,
                                                    "created_utc": 1538426171.0,
                                                    "replies": [
                                                        {
                                                            "body": "There is something called communication.  i dont know all the terms a barber uses, and sometimes i forget what number i get on the sides too.  But you have the power of the internet as well as your words to explain what you want.  this guy is acting like its the end of the world if we dont tell him the name of a hair cut.  my point being a barber is going to understand you more if you show a picture vs if you tell him a dumb ass name for a hair cut.  He is acting like its our fault that he cant find a barber to work with his hair.  and i simply put that he shows a picture or find a new barber.  he didnt like that answer and decided that he had the authority to tell me to unsubscribe just because he is mentally challenged.  All you need to do is watch what your barber is doing and correct him.  you start with a higher guardand work your way down.  its trial and error.  nothing we say will help him with his barber.  all barbers use different lingo.  a fade to one barber is the equivalent to a taper for another.  its his responsibility to manage his own head not ours.  we cant put words in his mouth so he can come back and blame everyone here for a bad hair cut.  plus, i never insulted his mom.  i just asked if his mom still wipes when he uses the bathroom.. lol",
                                                            "author": "iDream3d",
                                                            "id": "e6zn60d",
                                                            "parent_id": "t1_e6zml9d",
                                                            "score": 1,
                                                            "created_utc": 1538426627.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Oh I agree with a lot of what you said, but you say he has the internet at his disposal... that’s what Reddit is. It’s a great resource to learn more. I just think you can’t really tell him his hairstyle is his responsibility and also be subscribed to this subreddit. The two things don’t contradict each other but you seem to be saying that they do. I think he just phrased some things badly.\n\nTo focus on actually solving something though... Maybe what people should be doing is, instead of asking “how can I get my barber to do this haircut?” They should instead be specifying that they want to know some more ways to describe that particular cut to their barber, like “how can I describe the fringe on this hairstyle?”. This helps anything people could want; ability to google further images, ability to describe it to a barber, etc. Then that covers most posts here. \n",
                                                                    "author": "NumerousImprovements",
                                                                    "id": "e6zqkd0",
                                                                    "parent_id": "t1_e6zn60d",
                                                                    "score": 5,
                                                                    "created_utc": 1538429493.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Yes this has happened many times to me too, I showed the barber a picture of the fade I got and of the back of my head. When I came out the fade he gave me was way too high for my liking and he ignored the back... ",
            "author": "Sypherior",
            "id": "e6ywopg",
            "parent_id": "t1_e6ysftf",
            "score": 3,
            "created_utc": 1538404446.0,
            "replies": []
        },
        {
            "body": "Yeah it can be the case with some barbers, me included if it’s something I’m not used to doing very often ",
            "author": "onlyusemefade",
            "id": "e6ysyw0",
            "parent_id": "t1_e6ysftf",
            "score": 1,
            "created_utc": 1538400743.0,
            "replies": []
        },
        {
            "body": "It is!! This is for when people post a picture saying that they want *that* hairstyle but don’t know how to describe it. If you don’t know what you want then ask away! ",
            "author": "onlyusemefade",
            "id": "e6ywh02",
            "parent_id": "t1_e6ywbbu",
            "score": -5,
            "created_utc": 1538404244.0,
            "replies": [
                {
                    "body": "I feel like a lot of people posting those pictures are asking for *styling* tips, rather than/in addition to how to get the cut. I've seen several threads (and I'm a very casual visitor) just over the last few weeks where people have asked for both and only had replies saying \"show the pic to the barber\". Which really is not helpful in the slightest.",
                    "author": "Lorenzo_Insigne",
                    "id": "e70rc7t",
                    "parent_id": "t1_e6ywh02",
                    "score": 3,
                    "created_utc": 1538476326.0,
                    "replies": [
                        {
                            "body": "No they are a lot of the time. This post needs to be taken with a pinch of salt. I’ve got no problem with any posts on this sub ",
                            "author": "onlyusemefade",
                            "id": "e70re0k",
                            "parent_id": "t1_e70rc7t",
                            "score": 1,
                            "created_utc": 1538476420.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Unless the angle is like a mugshot you can get a fairly good idea of what the rest should look like from one photo, plus it’s not as though you’d be showing them a style that they’d never seen or done before ",
            "author": "onlyusemefade",
            "id": "e6ytig4",
            "parent_id": "t1_e6ytdj2",
            "score": 0,
            "created_utc": 1538401315.0,
            "replies": [
                {
                    "body": "I've gotten this reaction from at least 7 diff barbers/hairdressers (we've got a lot here in Singapore) and most of them really aren't confident in giving a contemporary haircut unless they can see a reference from all sides, else it's just a bland run of the mill cut for school kids :/",
                    "author": "xerxerneas",
                    "id": "e6z1qj6",
                    "parent_id": "t1_e6ytig4",
                    "score": 7,
                    "created_utc": 1538408942.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Of course they do, styling and upkeep isn’t what my post is about, it was supposed to be a little tongue in cheek, ",
            "author": "onlyusemefade",
            "id": "e6ywese",
            "parent_id": "t1_e6yvy0r",
            "score": 0,
            "created_utc": 1538404184.0,
            "replies": []
        },
        {
            "body": "So to get the haircut you brings picture of you already wearing the haircut\n",
            "author": "4937658460",
            "id": "e6z3a1u",
            "parent_id": "t1_e6yobjb",
            "score": 24,
            "created_utc": 1538410273.0,
            "replies": [
                {
                    "body": "Lmao. I don't get this either. 😂 Can't bring a picture of you with said haircut if you've never had it before which is most cases for bringing a photo/posting on here for suggestions.",
                    "author": "ReddtKeyboardWarrior",
                    "id": "e6z4srn",
                    "parent_id": "t1_e6z3a1u",
                    "score": 21,
                    "created_utc": 1538411568.0,
                    "replies": [
                        {
                            "body": "It's different, but related, advice. They're saying, once you get a cut you like, take good photos of it from multiple angles, and it'll be a lot easier for anybody, not just the person who last cut your hair, to reproduce it.",
                            "author": "isarl",
                            "id": "e6z89yb",
                            "parent_id": "t1_e6z4srn",
                            "score": 3,
                            "created_utc": 1538414491.0,
                            "replies": [
                                {
                                    "body": "Thank you ",
                                    "author": "FragGrenade",
                                    "id": "e6zm9pg",
                                    "parent_id": "t1_e6z89yb",
                                    "score": 1,
                                    "created_utc": 1538425915.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Yes, photoshop onto your hed",
                    "author": "sangotenrs",
                    "id": "e6zg2o0",
                    "parent_id": "t1_e6z3a1u",
                    "score": 2,
                    "created_utc": 1538420948.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "That’s even better ",
            "author": "onlyusemefade",
            "id": "e6yoc4f",
            "parent_id": "t1_e6yobjb",
            "score": 9,
            "created_utc": 1538395033.0,
            "replies": []
        },
        {
            "body": "It’s the case with a lot of hair, some is way more difficult to tame, it’s often trial and error to find what’s right ",
            "author": "onlyusemefade",
            "id": "e6yswoh",
            "parent_id": "t1_e6ysj7n",
            "score": 1,
            "created_utc": 1538400678.0,
            "replies": []
        },
        {
            "body": "Hey there’s nothing wrong with asking other people’s advice! ",
            "author": "onlyusemefade",
            "id": "e6yoi42",
            "parent_id": "t1_e6yogxg",
            "score": 2,
            "created_utc": 1538395275.0,
            "replies": []
        },
        {
            "body": "I knew this would get said hahaha",
            "author": "onlyusemefade",
            "id": "e6yrci3",
            "parent_id": "t1_e6yrbsb",
            "score": 1,
            "created_utc": 1538398932.0,
            "replies": []
        },
        {
            "body": "Good spot my man ",
            "author": "onlyusemefade",
            "id": "e6ysvol",
            "parent_id": "t1_e6yrvhx",
            "score": 1,
            "created_utc": 1538400647.0,
            "replies": []
        },
        {
            "body": "You make a good point ",
            "author": "onlyusemefade",
            "id": "e6zknys",
            "parent_id": "t1_e6zkmwt",
            "score": 1,
            "created_utc": 1538424633.0,
            "replies": []
        },
        {
            "body": "Can confirm ",
            "author": "onlyusemefade",
            "id": "e6zmi5z",
            "parent_id": "t1_e6zmh8i",
            "score": 1,
            "created_utc": 1538426103.0,
            "replies": []
        },
        {
            "body": "It never works *for you*",
            "author": "onlyusemefade",
            "id": "e6zx6gu",
            "parent_id": "t1_e6zvf06",
            "score": 1,
            "created_utc": 1538435606.0,
            "replies": []
        },
        {
            "body": "That’s what this sub is for!! ",
            "author": "onlyusemefade",
            "id": "e70ps52",
            "parent_id": "t1_e70chju",
            "score": 1,
            "created_utc": 1538473095.0,
            "replies": []
        },
        {
            "body": "I take it you’re not going back ",
            "author": "onlyusemefade",
            "id": "e70yrq6",
            "parent_id": "t1_e70yqc8",
            "score": 1,
            "created_utc": 1538486541.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "e70qlve",
            "parent_id": "t1_e6zf492",
            "score": 13,
            "created_utc": 1538474859.0,
            "replies": []
        },
        {
            "body": "Isn’t it hard to get inspo for your hair?",
            "author": null,
            "id": "e705fbh",
            "parent_id": "t1_e705d3v",
            "score": 1,
            "created_utc": 1538443765.0,
            "replies": [
                {
                    "body": "Not really tbph, I feel like there's lots of actors and models who have those three things.",
                    "author": null,
                    "id": "e705obd",
                    "parent_id": "t1_e705fbh",
                    "score": 2,
                    "created_utc": 1538444010.0,
                    "replies": [
                        {
                            "body": "Fair enough. I just don’t see myself looking even remotely similar to any actors or models",
                            "author": null,
                            "id": "e706vwr",
                            "parent_id": "t1_e705obd",
                            "score": 1,
                            "created_utc": 1538445169.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I've literally shown pictures of myself to barbers before and not received the same cut. To me getting a good cut is half speaking barber language and half a crap shoot on which barber you choose.",
            "author": "Luph",
            "id": "e6ytcox",
            "parent_id": "t1_e6ysy0a",
            "score": 48,
            "created_utc": 1538401149.0,
            "replies": [
                {
                    "body": "Sounds like bad barbers then. A good barber listens and then interprets and then does what the customer wants. If it is a case of unreasonable expectations on the part of the customer, then the barber needs to communicate that.\nPart of being a barber, in fact the biggest part, is communication. It's also up to him to really understand what it is you want. Unfortunately, these days most barbers are scrubs that thought it would be a fun job and don't know what they are doing. They can do a mean fade, but it's usually the same one they give to everybody no matter what.\nDoing a men's regular should be the easiest thing in the world, especially if the instructions were clear. If the instructions were not clear on the customer's part, it's still  the barber's fault if the cut didn't come out right. A good barber knows not to start cutting until everybody is clear on how the cut will come out.",
                    "author": "the_nomads",
                    "id": "e6yupvy",
                    "parent_id": "t1_e6ytcox",
                    "score": 10,
                    "created_utc": 1538402534.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "well said",
            "author": "iDream3d",
            "id": "e6yu28w",
            "parent_id": "t1_e6ysy0a",
            "score": 3,
            "created_utc": 1538401873.0,
            "replies": []
        },
        {
            "body": "r/boneappletea I just found this sub today and I already have the opportunity to use it.",
            "author": null,
            "id": "e6yrudx",
            "parent_id": "t1_e6yqz54",
            "score": 8,
            "created_utc": 1538399505.0,
            "replies": [
                {
                    "body": "What did I do!!? ",
                    "author": "onlyusemefade",
                    "id": "e6yt1ov",
                    "parent_id": "t1_e6yrudx",
                    "score": 5,
                    "created_utc": 1538400828.0,
                    "replies": [
                        {
                            "body": "layman's terms",
                            "author": "stale_nuts",
                            "id": "e6yx18y",
                            "parent_id": "t1_e6yt1ov",
                            "score": 8,
                            "created_utc": 1538404771.0,
                            "replies": [
                                {
                                    "body": "Ah so it has nothing to do with the former arsenal and Germany goalkeeper? ",
                                    "author": "onlyusemefade",
                                    "id": "e6yxcjf",
                                    "parent_id": "t1_e6yx18y",
                                    "score": 10,
                                    "created_utc": 1538405067.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Here's a sneak peek of /r/BoneAppleTea using the [top posts](https://np.reddit.com/r/BoneAppleTea/top/?sort=top&t=all) of all time!\n\n\\#1: [Sorry, Kevin \\[Legit\\]](https://i.imgur.com/Db4X9Gt.png) | [434 comments](https://np.reddit.com/r/BoneAppleTea/comments/9h3nca/sorry_kevin_legit/)  \n\\#2: [\\[Legit\\] Leonardo DiCaprio the painter](https://i.redd.it/yzsodx5wg6c11.png) | [170 comments](https://np.reddit.com/r/BoneAppleTea/comments/91wyv2/legit_leonardo_dicaprio_the_painter/)  \n\\#3: [\\[Legit\\] Keep us posted](https://i.redd.it/g0pte2s6k9k11.jpg) | [81 comments](https://np.reddit.com/r/BoneAppleTea/comments/9cya9r/legit_keep_us_posted/)\n\n----\n^^I'm ^^a ^^bot, ^^beep ^^boop ^^| ^^Downvote ^^to ^^remove ^^| [^^Contact ^^me](https://www.reddit.com/message/compose/?to=sneakpeekbot) ^^| [^^Info](https://np.reddit.com/r/sneakpeekbot/) ^^| [^^Opt-out](https://np.reddit.com/r/sneakpeekbot/comments/8wfgsm/blacklist/)",
                    "author": "sneakpeekbot",
                    "id": "e6yrv0s",
                    "parent_id": "t1_e6yrudx",
                    "score": 2,
                    "created_utc": 1538399525.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Ah yes. Show a picture, didn’t work? New barber! More of that useless advice. Why are people even in this sub if all they want to do is tell people to take a picture to their barber? It would be much more useful if this sub did what it was intended and tell a person that a haircut is a tapered whatever, #2 clipper, textured scissor cut etc etc. But naw, everyone shows up to tell people they shouldn’t bother posting and just show a picture of some model and not be able to explain what they like about a cut. I swear the sub thinks we can just use two words “long,short” and be able to explain a styling. If long and short is all it took to do a cut there wouldn’t be barber schools and every haircut would be perfect.",
            "author": "_your_face",
            "id": "e6yzd76",
            "parent_id": "t1_e6yttu9",
            "score": 5,
            "created_utc": 1538406881.0,
            "replies": [
                {
                    "body": "[removed]",
                    "author": null,
                    "id": "e6yzjte",
                    "parent_id": "t1_e6yzd76",
                    "score": -4,
                    "created_utc": 1538407045.0,
                    "replies": [
                        {
                            "body": "Again, why are you even here? Is every person supposed to be a barber or they are a child? Sharing barber knowledge and information is the point of this sub. Please improve the place by unsubscribing. ",
                            "author": "_your_face",
                            "id": "e6yzwp7",
                            "parent_id": "t1_e6yzjte",
                            "score": 8,
                            "created_utc": 1538407358.0,
                            "replies": [
                                {
                                    "body": "Im here because i appreciate the way i look and im always looking for new techniques, new looks and to try new things.  not sit here and have someone hold my hand while getting my hair cut.  does your mom still take you?  You should have a decent understanding of your face, head shape and what styles fit your head.  you show your barber the picture and the walk him through while he is cutting.  \"  no leave that side longer\"  \"can you fade the sides shorter\"  its all about communication.. seems like you just dont have a back bone to correct a barber when they mess your hair up.  Its perfectly normal to switch barbers.  i did that 5 times until i found the right one.  no one can do for you what you cant do yourself.  i will stay subscribed and i will continue to post.  go learn how to groom yourself.  i really hope you know how to bathe as well?  or does mom still do that for you too?  ",
                                    "author": "iDream3d",
                                    "id": "e6z0apz",
                                    "parent_id": "t1_e6yzwp7",
                                    "score": 1,
                                    "created_utc": 1538407699.0,
                                    "replies": [
                                        {
                                            "body": "The Mum jokes are not only petty but weak at that, and don’t even make sense. \nYou guys are basically agreeing as well. You want to learn stuff about hair cuts. So does that guy. Sometimes a photo might help you get your point across sure, but the point of this sub is to help people with everything that can’t be conveyed in a photo, or to give a barber more specific descriptions about what you want.\nHow is anyone supposed to know what they want if they can’t explain it? Knowing more terms would be helpful for me, I’d like to know more about what styles suit what head shapes, and what techniques produce certain looks. Hence, I joined this sub.\nYou guys are saying the same things, but then you make these childish jokes in an attempt to make him look bad. Not only do I not see the reason, but it also just makes you look like immature. You can do better than this, I’m sure. \n\nOr does Mummy still help you write your Reddit comments? See how pathetic it is?",
                                            "author": "NumerousImprovements",
                                            "id": "e6zml9d",
                                            "parent_id": "t1_e6z0apz",
                                            "score": 2,
                                            "created_utc": 1538426171.0,
                                            "replies": [
                                                {
                                                    "body": "There is something called communication.  i dont know all the terms a barber uses, and sometimes i forget what number i get on the sides too.  But you have the power of the internet as well as your words to explain what you want.  this guy is acting like its the end of the world if we dont tell him the name of a hair cut.  my point being a barber is going to understand you more if you show a picture vs if you tell him a dumb ass name for a hair cut.  He is acting like its our fault that he cant find a barber to work with his hair.  and i simply put that he shows a picture or find a new barber.  he didnt like that answer and decided that he had the authority to tell me to unsubscribe just because he is mentally challenged.  All you need to do is watch what your barber is doing and correct him.  you start with a higher guardand work your way down.  its trial and error.  nothing we say will help him with his barber.  all barbers use different lingo.  a fade to one barber is the equivalent to a taper for another.  its his responsibility to manage his own head not ours.  we cant put words in his mouth so he can come back and blame everyone here for a bad hair cut.  plus, i never insulted his mom.  i just asked if his mom still wipes when he uses the bathroom.. lol",
                                                    "author": "iDream3d",
                                                    "id": "e6zn60d",
                                                    "parent_id": "t1_e6zml9d",
                                                    "score": 1,
                                                    "created_utc": 1538426627.0,
                                                    "replies": [
                                                        {
                                                            "body": "Oh I agree with a lot of what you said, but you say he has the internet at his disposal... that’s what Reddit is. It’s a great resource to learn more. I just think you can’t really tell him his hairstyle is his responsibility and also be subscribed to this subreddit. The two things don’t contradict each other but you seem to be saying that they do. I think he just phrased some things badly.\n\nTo focus on actually solving something though... Maybe what people should be doing is, instead of asking “how can I get my barber to do this haircut?” They should instead be specifying that they want to know some more ways to describe that particular cut to their barber, like “how can I describe the fringe on this hairstyle?”. This helps anything people could want; ability to google further images, ability to describe it to a barber, etc. Then that covers most posts here. \n",
                                                            "author": "NumerousImprovements",
                                                            "id": "e6zqkd0",
                                                            "parent_id": "t1_e6zn60d",
                                                            "score": 5,
                                                            "created_utc": 1538429493.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I feel like a lot of people posting those pictures are asking for *styling* tips, rather than/in addition to how to get the cut. I've seen several threads (and I'm a very casual visitor) just over the last few weeks where people have asked for both and only had replies saying \"show the pic to the barber\". Which really is not helpful in the slightest.",
            "author": "Lorenzo_Insigne",
            "id": "e70rc7t",
            "parent_id": "t1_e6ywh02",
            "score": 3,
            "created_utc": 1538476326.0,
            "replies": [
                {
                    "body": "No they are a lot of the time. This post needs to be taken with a pinch of salt. I’ve got no problem with any posts on this sub ",
                    "author": "onlyusemefade",
                    "id": "e70re0k",
                    "parent_id": "t1_e70rc7t",
                    "score": 1,
                    "created_utc": 1538476420.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I've gotten this reaction from at least 7 diff barbers/hairdressers (we've got a lot here in Singapore) and most of them really aren't confident in giving a contemporary haircut unless they can see a reference from all sides, else it's just a bland run of the mill cut for school kids :/",
            "author": "xerxerneas",
            "id": "e6z1qj6",
            "parent_id": "t1_e6ytig4",
            "score": 7,
            "created_utc": 1538408942.0,
            "replies": []
        },
        {
            "body": "Lmao. I don't get this either. 😂 Can't bring a picture of you with said haircut if you've never had it before which is most cases for bringing a photo/posting on here for suggestions.",
            "author": "ReddtKeyboardWarrior",
            "id": "e6z4srn",
            "parent_id": "t1_e6z3a1u",
            "score": 21,
            "created_utc": 1538411568.0,
            "replies": [
                {
                    "body": "It's different, but related, advice. They're saying, once you get a cut you like, take good photos of it from multiple angles, and it'll be a lot easier for anybody, not just the person who last cut your hair, to reproduce it.",
                    "author": "isarl",
                    "id": "e6z89yb",
                    "parent_id": "t1_e6z4srn",
                    "score": 3,
                    "created_utc": 1538414491.0,
                    "replies": [
                        {
                            "body": "Thank you ",
                            "author": "FragGrenade",
                            "id": "e6zm9pg",
                            "parent_id": "t1_e6z89yb",
                            "score": 1,
                            "created_utc": 1538425915.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Yes, photoshop onto your hed",
            "author": "sangotenrs",
            "id": "e6zg2o0",
            "parent_id": "t1_e6z3a1u",
            "score": 2,
            "created_utc": 1538420948.0,
            "replies": []
        },
        {
            "body": "Not really tbph, I feel like there's lots of actors and models who have those three things.",
            "author": null,
            "id": "e705obd",
            "parent_id": "t1_e705fbh",
            "score": 2,
            "created_utc": 1538444010.0,
            "replies": [
                {
                    "body": "Fair enough. I just don’t see myself looking even remotely similar to any actors or models",
                    "author": null,
                    "id": "e706vwr",
                    "parent_id": "t1_e705obd",
                    "score": 1,
                    "created_utc": 1538445169.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Sounds like bad barbers then. A good barber listens and then interprets and then does what the customer wants. If it is a case of unreasonable expectations on the part of the customer, then the barber needs to communicate that.\nPart of being a barber, in fact the biggest part, is communication. It's also up to him to really understand what it is you want. Unfortunately, these days most barbers are scrubs that thought it would be a fun job and don't know what they are doing. They can do a mean fade, but it's usually the same one they give to everybody no matter what.\nDoing a men's regular should be the easiest thing in the world, especially if the instructions were clear. If the instructions were not clear on the customer's part, it's still  the barber's fault if the cut didn't come out right. A good barber knows not to start cutting until everybody is clear on how the cut will come out.",
            "author": "the_nomads",
            "id": "e6yupvy",
            "parent_id": "t1_e6ytcox",
            "score": 10,
            "created_utc": 1538402534.0,
            "replies": []
        },
        {
            "body": "What did I do!!? ",
            "author": "onlyusemefade",
            "id": "e6yt1ov",
            "parent_id": "t1_e6yrudx",
            "score": 5,
            "created_utc": 1538400828.0,
            "replies": [
                {
                    "body": "layman's terms",
                    "author": "stale_nuts",
                    "id": "e6yx18y",
                    "parent_id": "t1_e6yt1ov",
                    "score": 8,
                    "created_utc": 1538404771.0,
                    "replies": [
                        {
                            "body": "Ah so it has nothing to do with the former arsenal and Germany goalkeeper? ",
                            "author": "onlyusemefade",
                            "id": "e6yxcjf",
                            "parent_id": "t1_e6yx18y",
                            "score": 10,
                            "created_utc": 1538405067.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Here's a sneak peek of /r/BoneAppleTea using the [top posts](https://np.reddit.com/r/BoneAppleTea/top/?sort=top&t=all) of all time!\n\n\\#1: [Sorry, Kevin \\[Legit\\]](https://i.imgur.com/Db4X9Gt.png) | [434 comments](https://np.reddit.com/r/BoneAppleTea/comments/9h3nca/sorry_kevin_legit/)  \n\\#2: [\\[Legit\\] Leonardo DiCaprio the painter](https://i.redd.it/yzsodx5wg6c11.png) | [170 comments](https://np.reddit.com/r/BoneAppleTea/comments/91wyv2/legit_leonardo_dicaprio_the_painter/)  \n\\#3: [\\[Legit\\] Keep us posted](https://i.redd.it/g0pte2s6k9k11.jpg) | [81 comments](https://np.reddit.com/r/BoneAppleTea/comments/9cya9r/legit_keep_us_posted/)\n\n----\n^^I'm ^^a ^^bot, ^^beep ^^boop ^^| ^^Downvote ^^to ^^remove ^^| [^^Contact ^^me](https://www.reddit.com/message/compose/?to=sneakpeekbot) ^^| [^^Info](https://np.reddit.com/r/sneakpeekbot/) ^^| [^^Opt-out](https://np.reddit.com/r/sneakpeekbot/comments/8wfgsm/blacklist/)",
            "author": "sneakpeekbot",
            "id": "e6yrv0s",
            "parent_id": "t1_e6yrudx",
            "score": 2,
            "created_utc": 1538399525.0,
            "replies": []
        },
        {
            "body": "[removed]",
            "author": null,
            "id": "e6yzjte",
            "parent_id": "t1_e6yzd76",
            "score": -4,
            "created_utc": 1538407045.0,
            "replies": [
                {
                    "body": "Again, why are you even here? Is every person supposed to be a barber or they are a child? Sharing barber knowledge and information is the point of this sub. Please improve the place by unsubscribing. ",
                    "author": "_your_face",
                    "id": "e6yzwp7",
                    "parent_id": "t1_e6yzjte",
                    "score": 8,
                    "created_utc": 1538407358.0,
                    "replies": [
                        {
                            "body": "Im here because i appreciate the way i look and im always looking for new techniques, new looks and to try new things.  not sit here and have someone hold my hand while getting my hair cut.  does your mom still take you?  You should have a decent understanding of your face, head shape and what styles fit your head.  you show your barber the picture and the walk him through while he is cutting.  \"  no leave that side longer\"  \"can you fade the sides shorter\"  its all about communication.. seems like you just dont have a back bone to correct a barber when they mess your hair up.  Its perfectly normal to switch barbers.  i did that 5 times until i found the right one.  no one can do for you what you cant do yourself.  i will stay subscribed and i will continue to post.  go learn how to groom yourself.  i really hope you know how to bathe as well?  or does mom still do that for you too?  ",
                            "author": "iDream3d",
                            "id": "e6z0apz",
                            "parent_id": "t1_e6yzwp7",
                            "score": 1,
                            "created_utc": 1538407699.0,
                            "replies": [
                                {
                                    "body": "The Mum jokes are not only petty but weak at that, and don’t even make sense. \nYou guys are basically agreeing as well. You want to learn stuff about hair cuts. So does that guy. Sometimes a photo might help you get your point across sure, but the point of this sub is to help people with everything that can’t be conveyed in a photo, or to give a barber more specific descriptions about what you want.\nHow is anyone supposed to know what they want if they can’t explain it? Knowing more terms would be helpful for me, I’d like to know more about what styles suit what head shapes, and what techniques produce certain looks. Hence, I joined this sub.\nYou guys are saying the same things, but then you make these childish jokes in an attempt to make him look bad. Not only do I not see the reason, but it also just makes you look like immature. You can do better than this, I’m sure. \n\nOr does Mummy still help you write your Reddit comments? See how pathetic it is?",
                                    "author": "NumerousImprovements",
                                    "id": "e6zml9d",
                                    "parent_id": "t1_e6z0apz",
                                    "score": 2,
                                    "created_utc": 1538426171.0,
                                    "replies": [
                                        {
                                            "body": "There is something called communication.  i dont know all the terms a barber uses, and sometimes i forget what number i get on the sides too.  But you have the power of the internet as well as your words to explain what you want.  this guy is acting like its the end of the world if we dont tell him the name of a hair cut.  my point being a barber is going to understand you more if you show a picture vs if you tell him a dumb ass name for a hair cut.  He is acting like its our fault that he cant find a barber to work with his hair.  and i simply put that he shows a picture or find a new barber.  he didnt like that answer and decided that he had the authority to tell me to unsubscribe just because he is mentally challenged.  All you need to do is watch what your barber is doing and correct him.  you start with a higher guardand work your way down.  its trial and error.  nothing we say will help him with his barber.  all barbers use different lingo.  a fade to one barber is the equivalent to a taper for another.  its his responsibility to manage his own head not ours.  we cant put words in his mouth so he can come back and blame everyone here for a bad hair cut.  plus, i never insulted his mom.  i just asked if his mom still wipes when he uses the bathroom.. lol",
                                            "author": "iDream3d",
                                            "id": "e6zn60d",
                                            "parent_id": "t1_e6zml9d",
                                            "score": 1,
                                            "created_utc": 1538426627.0,
                                            "replies": [
                                                {
                                                    "body": "Oh I agree with a lot of what you said, but you say he has the internet at his disposal... that’s what Reddit is. It’s a great resource to learn more. I just think you can’t really tell him his hairstyle is his responsibility and also be subscribed to this subreddit. The two things don’t contradict each other but you seem to be saying that they do. I think he just phrased some things badly.\n\nTo focus on actually solving something though... Maybe what people should be doing is, instead of asking “how can I get my barber to do this haircut?” They should instead be specifying that they want to know some more ways to describe that particular cut to their barber, like “how can I describe the fringe on this hairstyle?”. This helps anything people could want; ability to google further images, ability to describe it to a barber, etc. Then that covers most posts here. \n",
                                                    "author": "NumerousImprovements",
                                                    "id": "e6zqkd0",
                                                    "parent_id": "t1_e6zn60d",
                                                    "score": 5,
                                                    "created_utc": 1538429493.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "No they are a lot of the time. This post needs to be taken with a pinch of salt. I’ve got no problem with any posts on this sub ",
            "author": "onlyusemefade",
            "id": "e70re0k",
            "parent_id": "t1_e70rc7t",
            "score": 1,
            "created_utc": 1538476420.0,
            "replies": []
        },
        {
            "body": "It's different, but related, advice. They're saying, once you get a cut you like, take good photos of it from multiple angles, and it'll be a lot easier for anybody, not just the person who last cut your hair, to reproduce it.",
            "author": "isarl",
            "id": "e6z89yb",
            "parent_id": "t1_e6z4srn",
            "score": 3,
            "created_utc": 1538414491.0,
            "replies": [
                {
                    "body": "Thank you ",
                    "author": "FragGrenade",
                    "id": "e6zm9pg",
                    "parent_id": "t1_e6z89yb",
                    "score": 1,
                    "created_utc": 1538425915.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Fair enough. I just don’t see myself looking even remotely similar to any actors or models",
            "author": null,
            "id": "e706vwr",
            "parent_id": "t1_e705obd",
            "score": 1,
            "created_utc": 1538445169.0,
            "replies": []
        },
        {
            "body": "layman's terms",
            "author": "stale_nuts",
            "id": "e6yx18y",
            "parent_id": "t1_e6yt1ov",
            "score": 8,
            "created_utc": 1538404771.0,
            "replies": [
                {
                    "body": "Ah so it has nothing to do with the former arsenal and Germany goalkeeper? ",
                    "author": "onlyusemefade",
                    "id": "e6yxcjf",
                    "parent_id": "t1_e6yx18y",
                    "score": 10,
                    "created_utc": 1538405067.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Again, why are you even here? Is every person supposed to be a barber or they are a child? Sharing barber knowledge and information is the point of this sub. Please improve the place by unsubscribing. ",
            "author": "_your_face",
            "id": "e6yzwp7",
            "parent_id": "t1_e6yzjte",
            "score": 8,
            "created_utc": 1538407358.0,
            "replies": [
                {
                    "body": "Im here because i appreciate the way i look and im always looking for new techniques, new looks and to try new things.  not sit here and have someone hold my hand while getting my hair cut.  does your mom still take you?  You should have a decent understanding of your face, head shape and what styles fit your head.  you show your barber the picture and the walk him through while he is cutting.  \"  no leave that side longer\"  \"can you fade the sides shorter\"  its all about communication.. seems like you just dont have a back bone to correct a barber when they mess your hair up.  Its perfectly normal to switch barbers.  i did that 5 times until i found the right one.  no one can do for you what you cant do yourself.  i will stay subscribed and i will continue to post.  go learn how to groom yourself.  i really hope you know how to bathe as well?  or does mom still do that for you too?  ",
                    "author": "iDream3d",
                    "id": "e6z0apz",
                    "parent_id": "t1_e6yzwp7",
                    "score": 1,
                    "created_utc": 1538407699.0,
                    "replies": [
                        {
                            "body": "The Mum jokes are not only petty but weak at that, and don’t even make sense. \nYou guys are basically agreeing as well. You want to learn stuff about hair cuts. So does that guy. Sometimes a photo might help you get your point across sure, but the point of this sub is to help people with everything that can’t be conveyed in a photo, or to give a barber more specific descriptions about what you want.\nHow is anyone supposed to know what they want if they can’t explain it? Knowing more terms would be helpful for me, I’d like to know more about what styles suit what head shapes, and what techniques produce certain looks. Hence, I joined this sub.\nYou guys are saying the same things, but then you make these childish jokes in an attempt to make him look bad. Not only do I not see the reason, but it also just makes you look like immature. You can do better than this, I’m sure. \n\nOr does Mummy still help you write your Reddit comments? See how pathetic it is?",
                            "author": "NumerousImprovements",
                            "id": "e6zml9d",
                            "parent_id": "t1_e6z0apz",
                            "score": 2,
                            "created_utc": 1538426171.0,
                            "replies": [
                                {
                                    "body": "There is something called communication.  i dont know all the terms a barber uses, and sometimes i forget what number i get on the sides too.  But you have the power of the internet as well as your words to explain what you want.  this guy is acting like its the end of the world if we dont tell him the name of a hair cut.  my point being a barber is going to understand you more if you show a picture vs if you tell him a dumb ass name for a hair cut.  He is acting like its our fault that he cant find a barber to work with his hair.  and i simply put that he shows a picture or find a new barber.  he didnt like that answer and decided that he had the authority to tell me to unsubscribe just because he is mentally challenged.  All you need to do is watch what your barber is doing and correct him.  you start with a higher guardand work your way down.  its trial and error.  nothing we say will help him with his barber.  all barbers use different lingo.  a fade to one barber is the equivalent to a taper for another.  its his responsibility to manage his own head not ours.  we cant put words in his mouth so he can come back and blame everyone here for a bad hair cut.  plus, i never insulted his mom.  i just asked if his mom still wipes when he uses the bathroom.. lol",
                                    "author": "iDream3d",
                                    "id": "e6zn60d",
                                    "parent_id": "t1_e6zml9d",
                                    "score": 1,
                                    "created_utc": 1538426627.0,
                                    "replies": [
                                        {
                                            "body": "Oh I agree with a lot of what you said, but you say he has the internet at his disposal... that’s what Reddit is. It’s a great resource to learn more. I just think you can’t really tell him his hairstyle is his responsibility and also be subscribed to this subreddit. The two things don’t contradict each other but you seem to be saying that they do. I think he just phrased some things badly.\n\nTo focus on actually solving something though... Maybe what people should be doing is, instead of asking “how can I get my barber to do this haircut?” They should instead be specifying that they want to know some more ways to describe that particular cut to their barber, like “how can I describe the fringe on this hairstyle?”. This helps anything people could want; ability to google further images, ability to describe it to a barber, etc. Then that covers most posts here. \n",
                                            "author": "NumerousImprovements",
                                            "id": "e6zqkd0",
                                            "parent_id": "t1_e6zn60d",
                                            "score": 5,
                                            "created_utc": 1538429493.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Thank you ",
            "author": "FragGrenade",
            "id": "e6zm9pg",
            "parent_id": "t1_e6z89yb",
            "score": 1,
            "created_utc": 1538425915.0,
            "replies": []
        },
        {
            "body": "Ah so it has nothing to do with the former arsenal and Germany goalkeeper? ",
            "author": "onlyusemefade",
            "id": "e6yxcjf",
            "parent_id": "t1_e6yx18y",
            "score": 10,
            "created_utc": 1538405067.0,
            "replies": []
        },
        {
            "body": "Im here because i appreciate the way i look and im always looking for new techniques, new looks and to try new things.  not sit here and have someone hold my hand while getting my hair cut.  does your mom still take you?  You should have a decent understanding of your face, head shape and what styles fit your head.  you show your barber the picture and the walk him through while he is cutting.  \"  no leave that side longer\"  \"can you fade the sides shorter\"  its all about communication.. seems like you just dont have a back bone to correct a barber when they mess your hair up.  Its perfectly normal to switch barbers.  i did that 5 times until i found the right one.  no one can do for you what you cant do yourself.  i will stay subscribed and i will continue to post.  go learn how to groom yourself.  i really hope you know how to bathe as well?  or does mom still do that for you too?  ",
            "author": "iDream3d",
            "id": "e6z0apz",
            "parent_id": "t1_e6yzwp7",
            "score": 1,
            "created_utc": 1538407699.0,
            "replies": [
                {
                    "body": "The Mum jokes are not only petty but weak at that, and don’t even make sense. \nYou guys are basically agreeing as well. You want to learn stuff about hair cuts. So does that guy. Sometimes a photo might help you get your point across sure, but the point of this sub is to help people with everything that can’t be conveyed in a photo, or to give a barber more specific descriptions about what you want.\nHow is anyone supposed to know what they want if they can’t explain it? Knowing more terms would be helpful for me, I’d like to know more about what styles suit what head shapes, and what techniques produce certain looks. Hence, I joined this sub.\nYou guys are saying the same things, but then you make these childish jokes in an attempt to make him look bad. Not only do I not see the reason, but it also just makes you look like immature. You can do better than this, I’m sure. \n\nOr does Mummy still help you write your Reddit comments? See how pathetic it is?",
                    "author": "NumerousImprovements",
                    "id": "e6zml9d",
                    "parent_id": "t1_e6z0apz",
                    "score": 2,
                    "created_utc": 1538426171.0,
                    "replies": [
                        {
                            "body": "There is something called communication.  i dont know all the terms a barber uses, and sometimes i forget what number i get on the sides too.  But you have the power of the internet as well as your words to explain what you want.  this guy is acting like its the end of the world if we dont tell him the name of a hair cut.  my point being a barber is going to understand you more if you show a picture vs if you tell him a dumb ass name for a hair cut.  He is acting like its our fault that he cant find a barber to work with his hair.  and i simply put that he shows a picture or find a new barber.  he didnt like that answer and decided that he had the authority to tell me to unsubscribe just because he is mentally challenged.  All you need to do is watch what your barber is doing and correct him.  you start with a higher guardand work your way down.  its trial and error.  nothing we say will help him with his barber.  all barbers use different lingo.  a fade to one barber is the equivalent to a taper for another.  its his responsibility to manage his own head not ours.  we cant put words in his mouth so he can come back and blame everyone here for a bad hair cut.  plus, i never insulted his mom.  i just asked if his mom still wipes when he uses the bathroom.. lol",
                            "author": "iDream3d",
                            "id": "e6zn60d",
                            "parent_id": "t1_e6zml9d",
                            "score": 1,
                            "created_utc": 1538426627.0,
                            "replies": [
                                {
                                    "body": "Oh I agree with a lot of what you said, but you say he has the internet at his disposal... that’s what Reddit is. It’s a great resource to learn more. I just think you can’t really tell him his hairstyle is his responsibility and also be subscribed to this subreddit. The two things don’t contradict each other but you seem to be saying that they do. I think he just phrased some things badly.\n\nTo focus on actually solving something though... Maybe what people should be doing is, instead of asking “how can I get my barber to do this haircut?” They should instead be specifying that they want to know some more ways to describe that particular cut to their barber, like “how can I describe the fringe on this hairstyle?”. This helps anything people could want; ability to google further images, ability to describe it to a barber, etc. Then that covers most posts here. \n",
                                    "author": "NumerousImprovements",
                                    "id": "e6zqkd0",
                                    "parent_id": "t1_e6zn60d",
                                    "score": 5,
                                    "created_utc": 1538429493.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "The Mum jokes are not only petty but weak at that, and don’t even make sense. \nYou guys are basically agreeing as well. You want to learn stuff about hair cuts. So does that guy. Sometimes a photo might help you get your point across sure, but the point of this sub is to help people with everything that can’t be conveyed in a photo, or to give a barber more specific descriptions about what you want.\nHow is anyone supposed to know what they want if they can’t explain it? Knowing more terms would be helpful for me, I’d like to know more about what styles suit what head shapes, and what techniques produce certain looks. Hence, I joined this sub.\nYou guys are saying the same things, but then you make these childish jokes in an attempt to make him look bad. Not only do I not see the reason, but it also just makes you look like immature. You can do better than this, I’m sure. \n\nOr does Mummy still help you write your Reddit comments? See how pathetic it is?",
            "author": "NumerousImprovements",
            "id": "e6zml9d",
            "parent_id": "t1_e6z0apz",
            "score": 2,
            "created_utc": 1538426171.0,
            "replies": [
                {
                    "body": "There is something called communication.  i dont know all the terms a barber uses, and sometimes i forget what number i get on the sides too.  But you have the power of the internet as well as your words to explain what you want.  this guy is acting like its the end of the world if we dont tell him the name of a hair cut.  my point being a barber is going to understand you more if you show a picture vs if you tell him a dumb ass name for a hair cut.  He is acting like its our fault that he cant find a barber to work with his hair.  and i simply put that he shows a picture or find a new barber.  he didnt like that answer and decided that he had the authority to tell me to unsubscribe just because he is mentally challenged.  All you need to do is watch what your barber is doing and correct him.  you start with a higher guardand work your way down.  its trial and error.  nothing we say will help him with his barber.  all barbers use different lingo.  a fade to one barber is the equivalent to a taper for another.  its his responsibility to manage his own head not ours.  we cant put words in his mouth so he can come back and blame everyone here for a bad hair cut.  plus, i never insulted his mom.  i just asked if his mom still wipes when he uses the bathroom.. lol",
                    "author": "iDream3d",
                    "id": "e6zn60d",
                    "parent_id": "t1_e6zml9d",
                    "score": 1,
                    "created_utc": 1538426627.0,
                    "replies": [
                        {
                            "body": "Oh I agree with a lot of what you said, but you say he has the internet at his disposal... that’s what Reddit is. It’s a great resource to learn more. I just think you can’t really tell him his hairstyle is his responsibility and also be subscribed to this subreddit. The two things don’t contradict each other but you seem to be saying that they do. I think he just phrased some things badly.\n\nTo focus on actually solving something though... Maybe what people should be doing is, instead of asking “how can I get my barber to do this haircut?” They should instead be specifying that they want to know some more ways to describe that particular cut to their barber, like “how can I describe the fringe on this hairstyle?”. This helps anything people could want; ability to google further images, ability to describe it to a barber, etc. Then that covers most posts here. \n",
                            "author": "NumerousImprovements",
                            "id": "e6zqkd0",
                            "parent_id": "t1_e6zn60d",
                            "score": 5,
                            "created_utc": 1538429493.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "There is something called communication.  i dont know all the terms a barber uses, and sometimes i forget what number i get on the sides too.  But you have the power of the internet as well as your words to explain what you want.  this guy is acting like its the end of the world if we dont tell him the name of a hair cut.  my point being a barber is going to understand you more if you show a picture vs if you tell him a dumb ass name for a hair cut.  He is acting like its our fault that he cant find a barber to work with his hair.  and i simply put that he shows a picture or find a new barber.  he didnt like that answer and decided that he had the authority to tell me to unsubscribe just because he is mentally challenged.  All you need to do is watch what your barber is doing and correct him.  you start with a higher guardand work your way down.  its trial and error.  nothing we say will help him with his barber.  all barbers use different lingo.  a fade to one barber is the equivalent to a taper for another.  its his responsibility to manage his own head not ours.  we cant put words in his mouth so he can come back and blame everyone here for a bad hair cut.  plus, i never insulted his mom.  i just asked if his mom still wipes when he uses the bathroom.. lol",
            "author": "iDream3d",
            "id": "e6zn60d",
            "parent_id": "t1_e6zml9d",
            "score": 1,
            "created_utc": 1538426627.0,
            "replies": [
                {
                    "body": "Oh I agree with a lot of what you said, but you say he has the internet at his disposal... that’s what Reddit is. It’s a great resource to learn more. I just think you can’t really tell him his hairstyle is his responsibility and also be subscribed to this subreddit. The two things don’t contradict each other but you seem to be saying that they do. I think he just phrased some things badly.\n\nTo focus on actually solving something though... Maybe what people should be doing is, instead of asking “how can I get my barber to do this haircut?” They should instead be specifying that they want to know some more ways to describe that particular cut to their barber, like “how can I describe the fringe on this hairstyle?”. This helps anything people could want; ability to google further images, ability to describe it to a barber, etc. Then that covers most posts here. \n",
                    "author": "NumerousImprovements",
                    "id": "e6zqkd0",
                    "parent_id": "t1_e6zn60d",
                    "score": 5,
                    "created_utc": 1538429493.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Oh I agree with a lot of what you said, but you say he has the internet at his disposal... that’s what Reddit is. It’s a great resource to learn more. I just think you can’t really tell him his hairstyle is his responsibility and also be subscribed to this subreddit. The two things don’t contradict each other but you seem to be saying that they do. I think he just phrased some things badly.\n\nTo focus on actually solving something though... Maybe what people should be doing is, instead of asking “how can I get my barber to do this haircut?” They should instead be specifying that they want to know some more ways to describe that particular cut to their barber, like “how can I describe the fringe on this hairstyle?”. This helps anything people could want; ability to google further images, ability to describe it to a barber, etc. Then that covers most posts here. \n",
            "author": "NumerousImprovements",
            "id": "e6zqkd0",
            "parent_id": "t1_e6zn60d",
            "score": 5,
            "created_utc": 1538429493.0,
            "replies": []
        }
    ]
}