{
    "title": "The first glimpse of her.",
    "post_id": "kfunoa",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/kfunoa/the_first_glimpse_of_her/",
    "author": "realitytomydreams",
    "body": "One of the moments I always cherish on dates with my SB is that very first glimpse of her that I see for that day. When she appears from behind the door to pick me up from the entrance of her apartment or when she appears in my line of sight waiting for me near the parking garage close to her apartment.\n\nA smile automatically forms on my face as I see this beautiful woman appearing before my eyes.\n\nToday we decided to have a short little date on her lunch break and I made my way to her family home in the suburbs where she has her dog with her.\n\nAs I turned round the corner to her house, I saw my SB and her dog waiting adorably for me at the sidewalk and the biggest smile automatically formed on my face.\n\nShe introduced me to her dog and her dog’s tail was wagging which I hope is a good sign 😆\n\nAnd now I will always have this adorable memory of her and her dog waiting for me. The two of them so perfect individually and together.\n\nIt’s been six months since we’ve been in a SR and I still get so excited whenever I catch that first glimpse of my SB for the day. \n\nAnd I hope that excitement will last for as long as it can. ❤️",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/kfunoa/the_first_glimpse_of_her/",
    "score": 197,
    "upvote_ratio": 0.95,
    "created_utc": 1608328762.0,
    "num_comments": 35,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "Been with my current SB 4 years in January. I see her 2-3 times a week, text daily, and we usually talk 1 or 2 hours on the phone most days. I'm still crazy about her. The excitement of seeing her, getting a text, or seeing her call pop up is still there every time.",
            "author": "longknight8883",
            "id": "ggayn0m",
            "parent_id": "t3_kfunoa",
            "score": 49,
            "created_utc": 1608332106.0,
            "replies": [
                {
                    "body": ">The excitement of seeing her, getting a text, or seeing her call pop up\n\nI'm with OP. First glimpse of her when I see her that day. the moments running up to first seeing her... wondering what's she's wearing today, seeing her smile when she makes eye contact\n\ntxt/call doesn't compare",
                    "author": "bluelunarmonkey",
                    "id": "ggb49i7",
                    "parent_id": "t1_ggayn0m",
                    "score": 10,
                    "created_utc": 1608335246.0,
                    "replies": []
                },
                {
                    "body": "2-3 times a week!!! 1-2 hours phone calls a day??? \n\nHopefully she is well taking care of because people don’t even see their friends  like that",
                    "author": "TrixieKittykat",
                    "id": "ggdg0en",
                    "parent_id": "t1_ggayn0m",
                    "score": 8,
                    "created_utc": 1608395652.0,
                    "replies": []
                },
                {
                    "body": "Is there a physical RL?",
                    "author": "Iriec2",
                    "id": "ggdry5s",
                    "parent_id": "t1_ggayn0m",
                    "score": 1,
                    "created_utc": 1608400580.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "The first time I saw my SGF (26) in real life, I (51) was sitting in a nice Italian Restaurant (Angelines in Charlotte, NC) and waiting for her Uber to arrive. The moment she walked in the door, I was stunned. She was BEAUTIFUL! She was wearing a pinkish club dress and high heels... It turns out that this is ALL she was wearing. 😍\n\nWe ended up having a great dinner and conversation. She asked me if I had ever tried pickle back with whiskey. I hadn't... and while I will never drink that again in life, we ended up having a couple of those in addition to the double Titos and Ginger that I prefer. Whenever she mentions pickle back she does this cute little thing with her tongue on her teeth. I don't know how to describe it. ❤️\n\nI am not sure if I am an anomaly, but I tell all of the girls that I have met on SA the same thing. I thank them for dinner and conversation and give them the money they requested for PPM right then. Then, I ask them if they would be interested in continuing the evening. In her case, she smiled and said \"Absolutely!\". \n\nWhen we left the restaurant to walk to my car (which was parked a few blocks away in a parking garage due to President Trump visiting for a campaign rally), we found that the entire area was locked down due to an impromptu Black Lives Matter protest (which I support btw). There were walls of police blocking every path to my car except the ramp where the cars drive out. This ramp begins underground, so it is a very steep incline. I picked her up and carried her down the ramp and she was giggling and shreeking the entire way down. Once we got to the bottom and I put her down, she grabbed me and kissed me. 😍\n\nWe spent the rest of the evening talking and ultimately ended up in bed laying in each other's arms exhausted from making love.\n\nFast forward 4 months and now she is my SGF (kinda vanilla but I'm still giving her support - read spoil her). I have been frustrated at points and she probably has too (we both suffer from anxiety) ... But all of that fades as soon as we see each other. She wraps her arms around me kisses me so passionately every time I pick her up and every time I drop her off. Many times we sit in the car at the end of the night with her asking me for more kisses...\n\nI am 3x divorced. I have fallen for her (for the record, she told me first). Will it last long term? I sure hope so... But I am a realist and a romantic. It is better to love and lost than to never have loved at all. She is so beautiful, intelligent and sweetly naughty and is an amazing lover. She really makes me look forward to my week. She makes me feel like I have a purpose in my personal life.",
            "author": "stonedoubt",
            "id": "ggb6llj",
            "parent_id": "t3_kfunoa",
            "score": 46,
            "created_utc": 1608336573.0,
            "replies": [
                {
                    "body": "> She makes me feel like I have a purpose in my personal life.\n\nultimate sugar sweetness",
                    "author": "pinotandsugar",
                    "id": "ggbpclh",
                    "parent_id": "t1_ggb6llj",
                    "score": 17,
                    "created_utc": 1608347665.0,
                    "replies": []
                },
                {
                    "body": "I have this kind of arrangement with my current SD, we have been together 4 years now and are as close as ever.  It can last long term, absolutely! Don't let anxiety get the better of you!",
                    "author": "Lolly_Jaw",
                    "id": "ggczl7t",
                    "parent_id": "t1_ggb6llj",
                    "score": 4,
                    "created_utc": 1608387567.0,
                    "replies": []
                },
                {
                    "body": "I met my very first sugar babe today. We met for lunch in a very popular little cafe. When she walked thru’ the door I knew I liked her. We spent nearly three hours talking, laughing and exchanging ideas. When we parted there was a very European kiss kiss goodbye. We have been chatting since by text. We are arranging our next rendezvous as soon as possible.",
                    "author": "New_Sympathy7182",
                    "id": "ggewiiq",
                    "parent_id": "t1_ggb6llj",
                    "score": 2,
                    "created_utc": 1608419059.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "You know you are with the right person when you get excited just thinking about them.",
            "author": "dade_murphy1",
            "id": "ggb28cz",
            "parent_id": "t3_kfunoa",
            "score": 16,
            "created_utc": 1608334103.0,
            "replies": []
        },
        {
            "body": "Goals af. My first m&g tonight, hoping it ends up in something like this. Adorable.",
            "author": "Careless-Ad-1775",
            "id": "ggaxnu1",
            "parent_id": "t3_kfunoa",
            "score": 19,
            "created_utc": 1608331579.0,
            "replies": [
                {
                    "body": "Goodluck!!",
                    "author": "Ghanaiantoffee",
                    "id": "ggaxrhq",
                    "parent_id": "t1_ggaxnu1",
                    "score": 2,
                    "created_utc": 1608331634.0,
                    "replies": [
                        {
                            "body": "Thank you!! 🤞🏼🤞🏼🤞🏼",
                            "author": "Careless-Ad-1775",
                            "id": "ggaxsxz",
                            "parent_id": "t1_ggaxrhq",
                            "score": 3,
                            "created_utc": 1608331655.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I wanna be the girl my SD gushes about to his therapist",
            "author": "misswanderlust_",
            "id": "ggbw1kl",
            "parent_id": "t3_kfunoa",
            "score": 8,
            "created_utc": 1608351983.0,
            "replies": [
                {
                    "body": "*I wanna be the*\n\n*Girl my SD gushes about*\n\n*To his therapist*\n\n\\- misswanderlust\\_\n\n---\n\n^(I detect haikus. And sometimes, successfully.) ^[Learn&#32;more&#32;about&#32;me.](https://www.reddit.com/r/haikusbot/)\n\n^(Opt out of replies: \"haikusbot opt out\" | Delete my comment: \"haikusbot delete\")",
                    "author": "haikusbot",
                    "id": "ggbw2e9",
                    "parent_id": "t1_ggbw1kl",
                    "score": 7,
                    "created_utc": 1608351998.0,
                    "replies": [
                        {
                            "body": "lol did not mean to make a haiku, that was completely coincidental",
                            "author": "misswanderlust_",
                            "id": "ggbw6x6",
                            "parent_id": "t1_ggbw2e9",
                            "score": 7,
                            "created_utc": 1608352084.0,
                            "replies": [
                                {
                                    "body": "Lana is that you??",
                                    "author": "LostAngelesThrowaway",
                                    "id": "gghk3pt",
                                    "parent_id": "t1_ggbw6x6",
                                    "score": 2,
                                    "created_utc": 1608479059.0,
                                    "replies": [
                                        {
                                            "body": "haha no :P",
                                            "author": "misswanderlust_",
                                            "id": "ggip0aa",
                                            "parent_id": "t1_gghk3pt",
                                            "score": 1,
                                            "created_utc": 1608499070.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "This is so cute and sweet. ;u;",
            "author": "bambiibutts",
            "id": "ggayhk2",
            "parent_id": "t3_kfunoa",
            "score": 5,
            "created_utc": 1608332024.0,
            "replies": []
        },
        {
            "body": "Awww! This is adorable.  I smiled through reading the entire post.",
            "author": "That_Millenial_Girl",
            "id": "ggb1p8w",
            "parent_id": "t3_kfunoa",
            "score": 5,
            "created_utc": 1608333806.0,
            "replies": []
        },
        {
            "body": "Dogs are *excellent* judges of character. \n\nI love stories like this. So pure. I'm genuinely happy for you both! Keep treating her right and she'll keep making you happy.",
            "author": "FoxyFreckles1989",
            "id": "ggc4rm4",
            "parent_id": "t3_kfunoa",
            "score": 5,
            "created_utc": 1608358260.0,
            "replies": []
        },
        {
            "body": "When you're with the right person, it's like your heart has no sense of \"routine\" and still skips a beat every time you see them. Heck, when I was in the perfect SR with an amazing gorgeous woman, one of my favorite things would be to see them coming back to the table at a restaurant or club after going to the restroom. Even though we'd been together for hours already, the 5 minutes of absence made her shimmering visage brand new and magical all over again.",
            "author": "roscoe7585",
            "id": "ggdd3si",
            "parent_id": "t3_kfunoa",
            "score": 3,
            "created_utc": 1608394404.0,
            "replies": []
        },
        {
            "body": "This is awfully sweet!!",
            "author": "Ghanaiantoffee",
            "id": "ggaxql8",
            "parent_id": "t3_kfunoa",
            "score": 2,
            "created_utc": 1608331621.0,
            "replies": []
        },
        {
            "body": "I need this in my life",
            "author": "Such-Ear-1141",
            "id": "ggayu48",
            "parent_id": "t3_kfunoa",
            "score": 2,
            "created_utc": 1608332216.0,
            "replies": [
                {
                    "body": "me too!",
                    "author": "minniemouse39",
                    "id": "ggbpdt8",
                    "parent_id": "t1_ggayu48",
                    "score": 2,
                    "created_utc": 1608347687.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "You and me. All I ever desire is to see that smile. It warms the heart so much. More than anything in the world.",
            "author": "SingleCondition4",
            "id": "ggb7i2o",
            "parent_id": "t3_kfunoa",
            "score": 2,
            "created_utc": 1608337103.0,
            "replies": []
        },
        {
            "body": "This is so darling.",
            "author": null,
            "id": "ggb9zhz",
            "parent_id": "t3_kfunoa",
            "score": 2,
            "created_utc": 1608338561.0,
            "replies": []
        },
        {
            "body": "Aw! This is really cute, happy for you both ❤️",
            "author": null,
            "id": "ggbauie",
            "parent_id": "t3_kfunoa",
            "score": 2,
            "created_utc": 1608339055.0,
            "replies": []
        },
        {
            "body": "This is so sweet! What a lucky lady!",
            "author": "Klutzy_Assistance_98",
            "id": "ggbmwmy",
            "parent_id": "t3_kfunoa",
            "score": 2,
            "created_utc": 1608346156.0,
            "replies": []
        },
        {
            "body": "Omg this is honestly heartwarming!! So great to know that this can exist. I can't wait until I find the right SR for me 🥰",
            "author": "brattyscarlet",
            "id": "ggbss8i",
            "parent_id": "t3_kfunoa",
            "score": 2,
            "created_utc": 1608349852.0,
            "replies": []
        },
        {
            "body": "so frickin cute!",
            "author": "misswanderlust_",
            "id": "ggbvo1m",
            "parent_id": "t3_kfunoa",
            "score": 2,
            "created_utc": 1608351731.0,
            "replies": []
        },
        {
            "body": "This is so sweet x",
            "author": "babygoodluck",
            "id": "ggbx4ap",
            "parent_id": "t3_kfunoa",
            "score": 2,
            "created_utc": 1608352702.0,
            "replies": []
        },
        {
            "body": "Just adorable!! This made my day and hopeful to having an SR as beautiful as this ♡",
            "author": null,
            "id": "ggc7gxa",
            "parent_id": "t3_kfunoa",
            "score": 2,
            "created_utc": 1608360581.0,
            "replies": []
        },
        {
            "body": "I want my SD to feel this way about me 😭",
            "author": "leftswingfling",
            "id": "ggczkpw",
            "parent_id": "t3_kfunoa",
            "score": 2,
            "created_utc": 1608387558.0,
            "replies": []
        },
        {
            "body": "She works for a courier service making special deliveries and pick ups. So her entire day is spent driving between businesses and usually to the airport once or twice a day.  So we typically talk while she's driving.  It's hard to listen to music all day everyday and be isolated from people in general due to the nature of the job. She also has a lot of family issues both with the immediate family and the extended family.  I kind of serve as a significant other, a therapist, a best friend, a teacher, a mentor, and whatever else she needs. \nSince we talk and text so much everyday when we see each other in person sometimes she walks through the door stripping her clothes off because she is ready for physical attention and intimacy",
            "author": "longknight8883",
            "id": "ggdj8k5",
            "parent_id": "t3_kfunoa",
            "score": 2,
            "created_utc": 1608396979.0,
            "replies": []
        },
        {
            "body": "Yes! Because we talk and text so much, she is usually stripping her clothes off as she comes through the door. The sex is great. She likes being dominated. She enjoys trying new things as long as you start slow.",
            "author": "longknight8883",
            "id": "ggdvcdl",
            "parent_id": "t3_kfunoa",
            "score": 1,
            "created_utc": 1608402027.0,
            "replies": []
        },
        {
            "body": ">The excitement of seeing her, getting a text, or seeing her call pop up\n\nI'm with OP. First glimpse of her when I see her that day. the moments running up to first seeing her... wondering what's she's wearing today, seeing her smile when she makes eye contact\n\ntxt/call doesn't compare",
            "author": "bluelunarmonkey",
            "id": "ggb49i7",
            "parent_id": "t1_ggayn0m",
            "score": 10,
            "created_utc": 1608335246.0,
            "replies": []
        },
        {
            "body": "2-3 times a week!!! 1-2 hours phone calls a day??? \n\nHopefully she is well taking care of because people don’t even see their friends  like that",
            "author": "TrixieKittykat",
            "id": "ggdg0en",
            "parent_id": "t1_ggayn0m",
            "score": 8,
            "created_utc": 1608395652.0,
            "replies": []
        },
        {
            "body": "Is there a physical RL?",
            "author": "Iriec2",
            "id": "ggdry5s",
            "parent_id": "t1_ggayn0m",
            "score": 1,
            "created_utc": 1608400580.0,
            "replies": []
        },
        {
            "body": "> She makes me feel like I have a purpose in my personal life.\n\nultimate sugar sweetness",
            "author": "pinotandsugar",
            "id": "ggbpclh",
            "parent_id": "t1_ggb6llj",
            "score": 17,
            "created_utc": 1608347665.0,
            "replies": []
        },
        {
            "body": "I have this kind of arrangement with my current SD, we have been together 4 years now and are as close as ever.  It can last long term, absolutely! Don't let anxiety get the better of you!",
            "author": "Lolly_Jaw",
            "id": "ggczl7t",
            "parent_id": "t1_ggb6llj",
            "score": 4,
            "created_utc": 1608387567.0,
            "replies": []
        },
        {
            "body": "I met my very first sugar babe today. We met for lunch in a very popular little cafe. When she walked thru’ the door I knew I liked her. We spent nearly three hours talking, laughing and exchanging ideas. When we parted there was a very European kiss kiss goodbye. We have been chatting since by text. We are arranging our next rendezvous as soon as possible.",
            "author": "New_Sympathy7182",
            "id": "ggewiiq",
            "parent_id": "t1_ggb6llj",
            "score": 2,
            "created_utc": 1608419059.0,
            "replies": []
        },
        {
            "body": "Goodluck!!",
            "author": "Ghanaiantoffee",
            "id": "ggaxrhq",
            "parent_id": "t1_ggaxnu1",
            "score": 2,
            "created_utc": 1608331634.0,
            "replies": [
                {
                    "body": "Thank you!! 🤞🏼🤞🏼🤞🏼",
                    "author": "Careless-Ad-1775",
                    "id": "ggaxsxz",
                    "parent_id": "t1_ggaxrhq",
                    "score": 3,
                    "created_utc": 1608331655.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "*I wanna be the*\n\n*Girl my SD gushes about*\n\n*To his therapist*\n\n\\- misswanderlust\\_\n\n---\n\n^(I detect haikus. And sometimes, successfully.) ^[Learn&#32;more&#32;about&#32;me.](https://www.reddit.com/r/haikusbot/)\n\n^(Opt out of replies: \"haikusbot opt out\" | Delete my comment: \"haikusbot delete\")",
            "author": "haikusbot",
            "id": "ggbw2e9",
            "parent_id": "t1_ggbw1kl",
            "score": 7,
            "created_utc": 1608351998.0,
            "replies": [
                {
                    "body": "lol did not mean to make a haiku, that was completely coincidental",
                    "author": "misswanderlust_",
                    "id": "ggbw6x6",
                    "parent_id": "t1_ggbw2e9",
                    "score": 7,
                    "created_utc": 1608352084.0,
                    "replies": [
                        {
                            "body": "Lana is that you??",
                            "author": "LostAngelesThrowaway",
                            "id": "gghk3pt",
                            "parent_id": "t1_ggbw6x6",
                            "score": 2,
                            "created_utc": 1608479059.0,
                            "replies": [
                                {
                                    "body": "haha no :P",
                                    "author": "misswanderlust_",
                                    "id": "ggip0aa",
                                    "parent_id": "t1_gghk3pt",
                                    "score": 1,
                                    "created_utc": 1608499070.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "me too!",
            "author": "minniemouse39",
            "id": "ggbpdt8",
            "parent_id": "t1_ggayu48",
            "score": 2,
            "created_utc": 1608347687.0,
            "replies": []
        },
        {
            "body": "Thank you!! 🤞🏼🤞🏼🤞🏼",
            "author": "Careless-Ad-1775",
            "id": "ggaxsxz",
            "parent_id": "t1_ggaxrhq",
            "score": 3,
            "created_utc": 1608331655.0,
            "replies": []
        },
        {
            "body": "lol did not mean to make a haiku, that was completely coincidental",
            "author": "misswanderlust_",
            "id": "ggbw6x6",
            "parent_id": "t1_ggbw2e9",
            "score": 7,
            "created_utc": 1608352084.0,
            "replies": [
                {
                    "body": "Lana is that you??",
                    "author": "LostAngelesThrowaway",
                    "id": "gghk3pt",
                    "parent_id": "t1_ggbw6x6",
                    "score": 2,
                    "created_utc": 1608479059.0,
                    "replies": [
                        {
                            "body": "haha no :P",
                            "author": "misswanderlust_",
                            "id": "ggip0aa",
                            "parent_id": "t1_gghk3pt",
                            "score": 1,
                            "created_utc": 1608499070.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Lana is that you??",
            "author": "LostAngelesThrowaway",
            "id": "gghk3pt",
            "parent_id": "t1_ggbw6x6",
            "score": 2,
            "created_utc": 1608479059.0,
            "replies": [
                {
                    "body": "haha no :P",
                    "author": "misswanderlust_",
                    "id": "ggip0aa",
                    "parent_id": "t1_gghk3pt",
                    "score": 1,
                    "created_utc": 1608499070.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "haha no :P",
            "author": "misswanderlust_",
            "id": "ggip0aa",
            "parent_id": "t1_gghk3pt",
            "score": 1,
            "created_utc": 1608499070.0,
            "replies": []
        }
    ]
}