{
    "title": "SDs Love to Pretend STDs Don’t Exist😒",
    "post_id": "zl86fg",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/zl86fg/sds_love_to_pretend_stds_dont_exist/",
    "author": "Typical-Equivalent89",
    "body": "It’s absurd that SDs ask if you’re on birth control and once you say yes, they assume unprotected sex is on the table. So you care more about having a baby then an incurable STD? \n\nThen they respond with a, “Don’t worry, I’m clean.” as if that random sentence from a complete stranger on the interweb, is supposed to quell my fears. \n\nIt really is disgusting that they care so little about it. Why is unknown, raw vagina so thrilling to them?!\n\nEDIT: 😂 of course I know men love raw sex, I like it too after vetting and testing. The keyword in that sentence is UNKNOWN aka risky. Yes, we as a society do it all the time in vanilla dating but isn’t sugaring a form of sex work? And if so, shouldn’t we be a little more apprehensive? Some of you in these comments haven’t been tested in over a decade and it shows.",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/zl86fg/sds_love_to_pretend_stds_dont_exist/",
    "score": 156,
    "upvote_ratio": 0.86,
    "created_utc": 1670968411.0,
    "num_comments": 137,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "It amazes me how some SDs will worry about how to pay for their account, a burner phone, excuses to be out of the house, a million other details EXCEPT for how to avoid explaining chlamydia to their wife until after it happens lol",
            "author": "MJline",
            "id": "j055jxl",
            "parent_id": "t3_zl86fg",
            "score": 85,
            "created_utc": 1670988434.0,
            "replies": [
                {
                    "body": "THIS! They’re obsessing over using a VPN just to log into seeking but couldn’t care less about Herpes 😂 got it.",
                    "author": "Typical-Equivalent89",
                    "id": "j0573og",
                    "parent_id": "t1_j055jxl",
                    "score": 42,
                    "created_utc": 1670989183.0,
                    "replies": []
                },
                {
                    "body": "This is how my ex- neighbor discovered his wife was cheating on him & gave him genital warts. See, back in the day before digital took over, you could pick up wireless (not cell) phones on police scanners. My dad was running thru the channels and heard the phone call. We knew who it was since we could only pick up the signals from a limited distance & he mentioned her by name.",
                    "author": "MrRetrdO",
                    "id": "j05gz3t",
                    "parent_id": "t1_j055jxl",
                    "score": 19,
                    "created_utc": 1670994406.0,
                    "replies": [
                        {
                            "body": "Oh that's true. One time tho, I was clicking the off and on button and my wireless phone picked up a random conversation lol",
                            "author": "thedoctor321",
                            "id": "j092qny",
                            "parent_id": "t1_j05gz3t",
                            "score": 2,
                            "created_utc": 1671059343.0,
                            "replies": [
                                {
                                    "body": "Yep. Those were fun times! Its how found out the other neighbor talks to her dead mother too. \n\nEver since then, my Dad refused to get a wireless phone in the house. We still have a working rotary wall phone in the basement.",
                                    "author": "MrRetrdO",
                                    "id": "j0ajtqf",
                                    "parent_id": "t1_j092qny",
                                    "score": 2,
                                    "created_utc": 1671085088.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "And how can any SB trust a married SD to be monogamous to her or honest about his sexual practices when he’s lying to his own wife???",
                    "author": "xxfitprincess",
                    "id": "j0akylc",
                    "parent_id": "t1_j055jxl",
                    "score": 5,
                    "created_utc": 1671085866.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "That's sketch AF. \n\nI'm big on testing regularly, at the end of a relationship or before one starts, just for the sake of transparency. \n\nI cover the bill obviously, and consider it a red flag if she's not ok with it.\n\nHe should care about STDs and STIs more than birth control in my opinion.",
            "author": "Dry-Metal-2167",
            "id": "j05a6bx",
            "parent_id": "t3_zl86fg",
            "score": 16,
            "created_utc": 1670990724.0,
            "replies": []
        },
        {
            "body": "I’m just gonna put this here…. https://www.sfcityclinic.org/patient-education-resources/std-risk-chart",
            "author": "Few-Dog-6206",
            "id": "j05oowc",
            "parent_id": "t3_zl86fg",
            "score": 14,
            "created_utc": 1670999159.0,
            "replies": [
                {
                    "body": "thank you",
                    "author": "daddyangeldust",
                    "id": "j078w9n",
                    "parent_id": "t1_j05oowc",
                    "score": 1,
                    "created_utc": 1671033984.0,
                    "replies": [
                        {
                            "body": "This is what I send to potential sds when we discuss protection. Bjs are covered and you can feel free to daty. Here’s why. \nBut it’s important to note, that this is purely for educational purposes, because if you’ve attempted to challenge my boundaries we’re not a match. I deal with respectful, polite men, or no one at all. Babies, I encourage you all to do the same.",
                            "author": "Few-Dog-6206",
                            "id": "j08b06i",
                            "parent_id": "t1_j078w9n",
                            "score": 6,
                            "created_utc": 1671048518.0,
                            "replies": [
                                {
                                    "body": "That's smart. Same here. I was naive and I gave someone oral when I was younger. Contracted God knows what but my doctor knew it was from oral and I had infections so bad for months they had to remove my tonsils. Never a-freaking-gain. It sucks (pun intended lol ) cus I like doing it too. I wish STDs just didn't exist.",
                                    "author": "daddyangeldust",
                                    "id": "j0afyqu",
                                    "parent_id": "t1_j08b06i",
                                    "score": 7,
                                    "created_utc": 1671082576.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I'm the guy that brings enough condoms for multiple rounds. Don't fucking bother telling me anything about it feeling less good, I don't care, condom is a must.",
            "author": "ObvThrowAway4Reason",
            "id": "j07do02",
            "parent_id": "t3_zl86fg",
            "score": 7,
            "created_utc": 1671035865.0,
            "replies": []
        },
        {
            "body": "In general people like to pretend they don’t exist. I can’t tell you how many people I know who take their sexual health for granted every single day. It’s disturbing. And we wonder why incurable diseases are running rampant. \n\nPretty soon HSV2 will be “normalized” like HSV1 is. Let’s not even count all the different STD’s there are. It’s sickening. People wanting to jump into sex on a second meeting with someone they legitimately know nothing about and don’t wonder who they slept with last week or yesterday for that matter. Take your sexual health seriously. You may only have one chance.",
            "author": "blndy2022",
            "id": "j04alg2",
            "parent_id": "t3_zl86fg",
            "score": 12,
            "created_utc": 1670974504.0,
            "replies": [
                {
                    "body": "And HSV2 and HSV1 are quite literally the exact same virus… 1 is oral and 2 is genital, you can transfer 1 orally to someone’s genitals and vice Versa. It’s the lack of general sex education but participating in sex work that’s astounding to me 😵‍💫🥱",
                    "author": "Feisty_Rhubarb5402",
                    "id": "j05p8rg",
                    "parent_id": "t1_j04alg2",
                    "score": 6,
                    "created_utc": 1670999545.0,
                    "replies": [
                        {
                            "body": "THIS. Their post was really sad to me. Dehumanizing really. I have hsv2 that I got when I was young from my 2nd partner going down on me. I always tell partners/sugars beforehand because everyone deserves autonomy in their sexual health. I literally keep it in my profile that I have hsv2. That being said, there are MANY people who are willing to take that risk and not used condoms. It kind of baffles me, but at the same time I don’t hate it because well, I’m still getting laid and all the other fun sugar stuff. Everyone who requires testing and condoms is absolutely right.",
                            "author": "Letmehearyourhaikus",
                            "id": "j05uisk",
                            "parent_id": "t1_j05p8rg",
                            "score": 5,
                            "created_utc": 1671003484.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "j06fk5m",
                                    "parent_id": "t1_j05uisk",
                                    "score": -1,
                                    "created_utc": 1671020295.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "Participating in sex at all and the lack of education on the matter is terrifying.",
                            "author": "blndy2022",
                            "id": "j073gek",
                            "parent_id": "t1_j05p8rg",
                            "score": 3,
                            "created_utc": 1671031839.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "j05p07v",
                    "parent_id": "t1_j04alg2",
                    "score": 0,
                    "created_utc": 1670999378.0,
                    "replies": [
                        {
                            "body": "STD discussion should be normalized, having STD’s and passing them around without a care in the world or not being STD tested between partners should NEVER be normalized. Not sharing your status should not be normalized. That is the entire point. I am not shaming anyone who has an STD. The lack of care about if you do or don’t have one is the issue and it’s disturbing. If you’re not taking care of your sexual health, if you haven’t been checked, if you don’t know and you’re engaging in sexual activity with someone it’s disgusting and should not be normalized. You’re risking not just your health but someone else’s. That’s not ok. That should not be normalized.",
                            "author": "blndy2022",
                            "id": "j0741ls",
                            "parent_id": "t1_j05p07v",
                            "score": 7,
                            "created_utc": 1671032078.0,
                            "replies": [
                                {
                                    "body": "Which is what I said",
                                    "author": "Feisty_Rhubarb5402",
                                    "id": "j0ncvm5",
                                    "parent_id": "t1_j0741ls",
                                    "score": 0,
                                    "created_utc": 1671321154.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Condoms only until both parties are exclusive with each and fully tested. Wrap it up boys!!",
            "author": "vincentvega094",
            "id": "j045cop",
            "parent_id": "t3_zl86fg",
            "score": 15,
            "created_utc": 1670972301.0,
            "replies": [
                {
                    "body": "Men cannot be tested for the 200+ strains of HPV, which can ruin fertility and cause many cancers 🙃",
                    "author": "hotcollegegirl420",
                    "id": "j0vbzze",
                    "parent_id": "t1_j045cop",
                    "score": 2,
                    "created_utc": 1671473898.0,
                    "replies": [
                        {
                            "body": "Right but you still can get it while using condom, I got it from my last SB I’m in treatment now, no sex for some time with or without condoms 🫤",
                            "author": "RealBlondHunter",
                            "id": "j0x484f",
                            "parent_id": "t1_j0vbzze",
                            "score": 1,
                            "created_utc": 1671500647.0,
                            "replies": [
                                {
                                    "body": "Treatment for HPV? That doesn’t exist unless you are talking about cancer treatment",
                                    "author": "hotcollegegirl420",
                                    "id": "j0xivcz",
                                    "parent_id": "t1_j0x484f",
                                    "score": 1,
                                    "created_utc": 1671507407.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Or the classic “I don’t like how condoms feel, they irritate me” it’s like yes, and chlamydia also irritates me.",
            "author": null,
            "id": "j0754aw",
            "parent_id": "t3_zl86fg",
            "score": 9,
            "created_utc": 1671032500.0,
            "replies": []
        },
        {
            "body": ">Why is unknown, raw vagina so thrilling to them?!\n\nMost likely because of age and ED, they can't keep it up with a condom.",
            "author": "A-touchofreality",
            "id": "j04bgqa",
            "parent_id": "t3_zl86fg",
            "score": 11,
            "created_utc": 1670974873.0,
            "replies": [
                {
                    "body": "Because young guys hate natural sex, right oh learned mentor?",
                    "author": "tempsdforfuns",
                    "id": "j04gefd",
                    "parent_id": "t1_j04bgqa",
                    "score": -7,
                    "created_utc": 1670977007.0,
                    "replies": [
                        {
                            "body": "Oof, did I hit a nerve there?\n\nBut no off course not, they like it too! Everybody does!\n\nBut they like it because it feels better, not because they cannot perform with a condom.",
                            "author": "A-touchofreality",
                            "id": "j04mrie",
                            "parent_id": "t1_j04gefd",
                            "score": 6,
                            "created_utc": 1670979804.0,
                            "replies": [
                                {
                                    "body": "It’s cute that you think you can “hit a nerve.”  \n\n100% of men prefer natural sex for obvious reasons.  I’d expect a “sugar mentor” to understand this.",
                                    "author": "tempsdforfuns",
                                    "id": "j050v4a",
                                    "parent_id": "t1_j04mrie",
                                    "score": -6,
                                    "created_utc": 1670986192.0,
                                    "replies": [
                                        {
                                            "body": ">Everybody does!\n\nReading comprehension problems too?",
                                            "author": "A-touchofreality",
                                            "id": "j05zncz",
                                            "parent_id": "t1_j050v4a",
                                            "score": 5,
                                            "created_utc": 1671007623.0,
                                            "replies": [
                                                {
                                                    "body": "I… saw that comment?  You made a silly attempt to claim I have ED or something because I pointed out that we all like natural sex… even though you also pointed it out.  Your comment (like most of your “mentoring”) added no value.",
                                                    "author": "tempsdforfuns",
                                                    "id": "j06u5e1",
                                                    "parent_id": "t1_j05zncz",
                                                    "score": 2,
                                                    "created_utc": 1671027913.0,
                                                    "replies": [
                                                        {
                                                            "body": "The 'mentor' in my flair does seem to strike a nerve too, does it? How dare a *woman* call herself that!? /s\n\nI will leave it to the other participants to decide if my mentoring is adding value or not. If you don't like it, just skip it? Or even better, block me so you don't have to see my silly woman comments anymore?\n\nCheers!",
                                                            "author": "A-touchofreality",
                                                            "id": "j06vs1g",
                                                            "parent_id": "t1_j06u5e1",
                                                            "score": 2,
                                                            "created_utc": 1671028636.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Anyone with the audacity to consider themselves a “sugar mentor” is very annoying, yes.  Not sure what your gender has to do with it.",
                                                                    "author": "tempsdforfuns",
                                                                    "id": "j08cysf",
                                                                    "parent_id": "t1_j06vs1g",
                                                                    "score": 2,
                                                                    "created_utc": 1671049238.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "\"Complete stranger on the interweb.\"\n\nNever have I ever heard somone use that phrase to describe an SD.",
            "author": "TastySpermDevice",
            "id": "j03xoqy",
            "parent_id": "t3_zl86fg",
            "score": 11,
            "created_utc": 1670969249.0,
            "replies": [
                {
                    "body": "😂😂😂",
                    "author": "Typical-Equivalent89",
                    "id": "j04dfdk",
                    "parent_id": "t1_j03xoqy",
                    "score": 4,
                    "created_utc": 1670975713.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I bring this up pretty early, it’s a screening point for me as I’m sure it is for people who want to be immediately raw. I won’t do that, and I would consider anyone who would try to guilt or manipulate me into doing something I’m not comfortable with as most assuredly not a match for me. I wouldn’t go raw with someone I’m just developing trust with. After some time, I’m happy to revisit the conversation if we are happy together and exclusive but the ideal person for me cares about his sexual health and my sexual health as well. Raw sex feels the best, it’s certainly no lie. It feels better for everyone involved and more intimate. But what feels even better is intimacy with a person who wants you to feel comfortable. Does it hurt my chances? Sure. Will it hurt yours? Most certainly. But you can’t get rid of some of those STDs and I think it’s a good boundary to have.",
            "author": "Empressofthemall",
            "id": "j052sic",
            "parent_id": "t3_zl86fg",
            "score": 3,
            "created_utc": 1670987101.0,
            "replies": []
        },
        {
            "body": "Everyone has something they like to pretend doesn't exist. In sugar dating maybe it's STDs, maybe it's the possibility of getting caught, maybe it's that they have to do absolutely nothing and get everything in return.\n\nSame in vanilla dating. How many men have you dated? How many have you slept with? How many wore a condom? How many did you get tested before doing so? Was it a full panel or just the standard pee in a cup results? How many did you kiss? Did they have HSV or HPV-1? Would you even know if they did (going back to question about how many people you dated did you ask to get tested). Ask around those questions to your friends. Hookup culture is alive and well and not isolated to just Tinder.\n\nAs for why men like to go without condoms, it simply feels better. Despite knowing the repercussions men still prefer it. But if you require it and I don't want it, then we just don't match and rather than trying one of trying to convince the other our way is the right we should move on to the next POT.\n\nThe best thing anyone can do for their own personal sanity is to not fixate on those they don't match with and spend their energy on those they do.",
            "author": "Suspicious_Run_",
            "id": "j03yzuy",
            "parent_id": "t3_zl86fg",
            "score": 16,
            "created_utc": 1670969775.0,
            "replies": [
                {
                    "body": "I agree and understand this is common. Simply a rant on my experience and how I feel about it. I just personally don’t want someone to assume I will have raw sex with them just because I’m on BC and then get upset when I dont “trust” that they are clean.",
                    "author": "Typical-Equivalent89",
                    "id": "j04dxp8",
                    "parent_id": "t1_j03yzuy",
                    "score": 6,
                    "created_utc": 1670975935.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "If you and the SD enter an exclusive arrangement, you both test prior, you on BC and him a vasectomy, is there a problem?\n\nI agree that safe sex is important, but ai also think there are conditions when protection isn't needed if both consent to it.  Any SD wanting raw sex immediately is a red flag, just like it would be in a vanilla relationship. Months into a relationship (vanilla or sugar) it's just a choice couples make together.",
            "author": "whataatrip",
            "id": "j041t9q",
            "parent_id": "t3_zl86fg",
            "score": 11,
            "created_utc": 1670970891.0,
            "replies": [
                {
                    "body": "Hpv cannot be tested for in men, and it can give both parties reproductive, oral, throat, and anal cancers. It has no symptoms until it’s too late",
                    "author": "hotcollegegirl420",
                    "id": "j05nruc",
                    "parent_id": "t1_j041t9q",
                    "score": 13,
                    "created_utc": 1670998527.0,
                    "replies": [
                        {
                            "body": "there's a vaccine for that",
                            "author": "throwawaymeter",
                            "id": "j084ocu",
                            "parent_id": "t1_j05nruc",
                            "score": 0,
                            "created_utc": 1671046176.0,
                            "replies": [
                                {
                                    "body": "Lol no, there’s a vaccine that *helps* protect against 9 of the 200+ strains, but does not even grant full immunity against those 9",
                                    "author": "hotcollegegirl420",
                                    "id": "j086wjg",
                                    "parent_id": "t1_j084ocu",
                                    "score": 5,
                                    "created_utc": 1671047008.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "It can be tested for - at least a few of the strains. But finding a testing center that can do so..? I live outside a major metro area and tried valiantly to find testing options with a previous gentleman partner, to no avail. Sigh. But the tests do exist.",
                            "author": "BlueButterfly222SB",
                            "id": "j088c6p",
                            "parent_id": "t1_j05nruc",
                            "score": 0,
                            "created_utc": 1671047537.0,
                            "replies": [
                                {
                                    "body": "It can be tested for in women with Pap smears of the cervix only. There is no way to test for it at all in men!\n\n I work with HPV causing HELA cell cultures in a research lab. There is currently no way at all to test in men",
                                    "author": "hotcollegegirl420",
                                    "id": "j08sy0r",
                                    "parent_id": "t1_j088c6p",
                                    "score": 4,
                                    "created_utc": 1671055279.0,
                                    "replies": [
                                        {
                                            "body": "Oh no. I must have been misinformed. Sigh. I think we can all agree that we wish there was a test for both genders!",
                                            "author": "BlueButterfly222SB",
                                            "id": "j091xaf",
                                            "parent_id": "t1_j08sy0r",
                                            "score": 3,
                                            "created_utc": 1671058999.0,
                                            "replies": [
                                                {
                                                    "body": "Oh absolutely, I don’t quite understand why there isn’t and why it is so gender specific when all genders can clearly get and transmit it. But it’s horrifying how misinformed EVERYONE is about HPV, the risks are really underestimated",
                                                    "author": "hotcollegegirl420",
                                                    "id": "j095mk4",
                                                    "parent_id": "t1_j091xaf",
                                                    "score": 3,
                                                    "created_utc": 1671060567.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "I agree, with consent and test results I’m in. The irritation comes from the backlash I’ve received from wanting to be responsible and their attempts to manipulate me into raw sex.",
                    "author": "Typical-Equivalent89",
                    "id": "j04e81x",
                    "parent_id": "t1_j041t9q",
                    "score": 12,
                    "created_utc": 1670976061.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "The vast majority of vanilla dates behave the same way… not sure why you’re acting like this is a sugar thing.",
            "author": "tempsdforfuns",
            "id": "j03w5cx",
            "parent_id": "t3_zl86fg",
            "score": 26,
            "created_utc": 1670968642.0,
            "replies": [
                {
                    "body": "Not acting like it’s a sugar thing, just venting about my multiple experiences with SDs who assume raw sex is on the table and don’t take their health or my health as serious as I feel it needs to be taken.",
                    "author": "Typical-Equivalent89",
                    "id": "j04egvr",
                    "parent_id": "t1_j03w5cx",
                    "score": 19,
                    "created_utc": 1670976169.0,
                    "replies": [
                        {
                            "body": "You’re always free to say no.",
                            "author": "UnearthlyDinosaur",
                            "id": "j0553gv",
                            "parent_id": "t1_j04egvr",
                            "score": -8,
                            "created_utc": 1670988213.0,
                            "replies": [
                                {
                                    "body": "And I do ☺️",
                                    "author": "Typical-Equivalent89",
                                    "id": "j056t08",
                                    "parent_id": "t1_j0553gv",
                                    "score": 19,
                                    "created_utc": 1670989039.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I was having sex with one SB who showed me her test results.  I told her upfront I wanted exclusivity for the sake of our health. I explained that I can’t get her pregnant and got tested as well.  She was not on BC wether pill or iud format.  Was it me that was the one that had to text her to say you better get tested for chlamydia?  No it was not. It was her.  It’s not a man thing, its a live up to your word thing.  Fortunately for me I came up negative and once the dust settled I realized I never had sex with her after she slept with an ex that gave her the clap.",
            "author": "DomDaddyNW",
            "id": "j05czks",
            "parent_id": "t3_zl86fg",
            "score": 6,
            "created_utc": 1670992209.0,
            "replies": []
        },
        {
            "body": "For sure. And also just men in general. I’m 25, and I’ve been with loads of vanilla dick. I think we used a condom like… twice. I didn’t really know about STDs, luckily I never got anything that wasn’t curable with an antibiotic, but good lord. I’m definitely educating my kids much better than I was in this topic. \n\nIt feels much better to be in control much more though now, because standing my ground on condoms or nexting a POT.",
            "author": "Wheresthechimney",
            "id": "j04r2ko",
            "parent_id": "t3_zl86fg",
            "score": 6,
            "created_utc": 1670981745.0,
            "replies": []
        },
        {
            "body": "You’re right, I blame a mix of porn and entitlement",
            "author": "Equivalent_Newt_6969",
            "id": "j03xygf",
            "parent_id": "t3_zl86fg",
            "score": 11,
            "created_utc": 1670969359.0,
            "replies": [
                {
                    "body": "Makes sense.  No one would know you could have sex without a condom if there wasn’t porn.",
                    "author": "tempsdforfuns",
                    "id": "j04gg9e",
                    "parent_id": "t1_j03xygf",
                    "score": -2,
                    "created_utc": 1670977029.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Yes what you said is true. Men can be reckless with going into everywoman raw.  \n\n\nAt the same time, you would be SHOCKED at the amount of women in the bowl who engage in unprotected sex unprovoked.",
            "author": "southernslick",
            "id": "j04lz8k",
            "parent_id": "t3_zl86fg",
            "score": 4,
            "created_utc": 1670979450.0,
            "replies": []
        },
        {
            "body": " I wouldn't raw dog it with someone I didn't trust and who wasn't monogamous (at least for vaginal and anal). But a test isn't 100% necessary for me, as long as the trust is there and they are very open and honest. I would take a test if she asked, and have. \nI prefer raw, but understand the risks and trust and all of that.",
            "author": "BigBearSD",
            "id": "j049u2d",
            "parent_id": "t3_zl86fg",
            "score": 5,
            "created_utc": 1670974182.0,
            "replies": [
                {
                    "body": "I had a guy I was supposed to marry lie to me about HSV2.  I’ve been tested at least 6 times since that happened, and we often used protection, but it blew my mind that he thought he could get away with not telling and legitimately didn’t care enough about me and my body/sexual health not to disclose.  The only way I found out was by demanding to see his bloodwork results.\n\nA good friend of mine has HPV, lets guys in raw, and has never once disclosed her status because she thinks “it’s not a big deal.”",
                    "author": "mistressita",
                    "id": "j04mitg",
                    "parent_id": "t1_j049u2d",
                    "score": 13,
                    "created_utc": 1670979693.0,
                    "replies": [
                        {
                            "body": "One, I’m sorry that happened to you. Horrible. Two, I hope your friend sees the error of her ways and starts being more responsible. Men and women need to be vigilant and protect each other.",
                            "author": "Typical-Equivalent89",
                            "id": "j04qz0u",
                            "parent_id": "t1_j04mitg",
                            "score": 7,
                            "created_utc": 1670981701.0,
                            "replies": [
                                {
                                    "body": "Agreed",
                                    "author": "mistressita",
                                    "id": "j06fyn3",
                                    "parent_id": "t1_j04qz0u",
                                    "score": 1,
                                    "created_utc": 1671020548.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "Ehh that's not going to really change anything for me. But sounds like you have a shitty friend.",
                            "author": "BigBearSD",
                            "id": "j04u14j",
                            "parent_id": "t1_j04mitg",
                            "score": 0,
                            "created_utc": 1670983074.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": ">(at least for vaginal and anal).\n\nand oral, right? you know you can get STIs from oral, right?",
                    "author": "AspiringSplendaBaby",
                    "id": "j04hnsa",
                    "parent_id": "t1_j049u2d",
                    "score": 0,
                    "created_utc": 1670977551.0,
                    "replies": [
                        {
                            "body": "No... no SD likes condom BJs.",
                            "author": "BigBearSD",
                            "id": "j04htav",
                            "parent_id": "t1_j04hnsa",
                            "score": 3,
                            "created_utc": 1670977617.0,
                            "replies": [
                                {
                                    "body": "lol. back to the title and subject of the original post. if it matters for anal, it matters for oral...",
                                    "author": "AspiringSplendaBaby",
                                    "id": "j04hwmj",
                                    "parent_id": "t1_j04htav",
                                    "score": 2,
                                    "created_utc": 1670977658.0,
                                    "replies": [
                                        {
                                            "body": "There's a significantly lower chance of catching an STI from unprotected oral than unprotected vaginal/anal (especially anal). So, it's not exactly accurate to say they should be weighed as equal risks: it doesn't necessarily follow that \"if it matters for anal, it matters for oral.\" \n\nIf someone is uncomfortable with taking on any level of risk and insists on condom use for all sex acts, I won't begrudge them that viewpoint at all. But the risk levels are not equal in allowing a new SD to slip PiV bareback vs giving them an uncovered BJ. Statistically, the former is far more reckless than the latter. Again, if it's still out of range of someone's risk tolerance, then certainly don't do either.",
                                            "author": "Intrepid_Egg_7722",
                                            "id": "j055vz7",
                                            "parent_id": "t1_j04hwmj",
                                            "score": 2,
                                            "created_utc": 1670988596.0,
                                            "replies": [
                                                {
                                                    "body": "that's fair.",
                                                    "author": "AspiringSplendaBaby",
                                                    "id": "j057iyy",
                                                    "parent_id": "t1_j055vz7",
                                                    "score": 3,
                                                    "created_utc": 1670989395.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Once I turned 30 a switch flipped and I started to care way more about sexual health.  Kinda weird when older people seem dumber in regards to it.\n\nWith that being said, there is no better feeling than new raw vagina, straight up.  I’ve just learned to think with my big head a lot more.",
            "author": "BigPoppa3232",
            "id": "j040530",
            "parent_id": "t3_zl86fg",
            "score": 5,
            "created_utc": 1670970232.0,
            "replies": [
                {
                    "body": "Thank you, I understand it feels amazing. My concern is that it’s unknown, from a stranger lol and people are willing to just dive in and cross their fingers. I just can’t compute. A switch flipped for me as well and just don’t see why taking time to get tested is so difficult…",
                    "author": "Typical-Equivalent89",
                    "id": "j04dcsa",
                    "parent_id": "t1_j040530",
                    "score": 2,
                    "created_utc": 1670975682.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I would also expect that these men that can afford to be SDs would be more intelligent then vanilla poor boy from tinder 😂. I do not have unprotected sex and insist on testing before getting serious even in vanilla. Thousands of men and no STD 🫡.",
            "author": "idontlikespiderplant",
            "id": "j04v0w7",
            "parent_id": "t3_zl86fg",
            "score": 4,
            "created_utc": 1670983533.0,
            "replies": [
                {
                    "body": "I read 📖this as men 👨‍🦰who can afford STD's (like healthcare 🏥🚑⚕️🩺💊etc.) and I mean that's also 👍correct, so.",
                    "author": null,
                    "id": "j04zt2r",
                    "parent_id": "t1_j04v0w7",
                    "score": 3,
                    "created_utc": 1670985707.0,
                    "replies": []
                },
                {
                    "body": "Thousands? 😇😇😇\n\n🫡",
                    "author": "ftrikn",
                    "id": "j05ibed",
                    "parent_id": "t1_j04v0w7",
                    "score": 2,
                    "created_utc": 1670995166.0,
                    "replies": [
                        {
                            "body": "Blame it on the spider plant.",
                            "author": "highfructoseSD",
                            "id": "j05oj1j",
                            "parent_id": "t1_j05ibed",
                            "score": 1,
                            "created_utc": 1670999045.0,
                            "replies": [
                                {
                                    "body": ":D",
                                    "author": "idontlikespiderplant",
                                    "id": "j0z1qc0",
                                    "parent_id": "t1_j05oj1j",
                                    "score": 1,
                                    "created_utc": 1671544819.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "Sex worker since 17.",
                            "author": "idontlikespiderplant",
                            "id": "j0z1pa1",
                            "parent_id": "t1_j05ibed",
                            "score": 1,
                            "created_utc": 1671544804.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "SDs r old men  just remind them even ghonnera can cause dementia like symptoms in the elderly",
            "author": "nomie_turtles",
            "id": "j04sdga",
            "parent_id": "t3_zl86fg",
            "score": 2,
            "created_utc": 1670982331.0,
            "replies": []
        },
        {
            "body": "I was so scared of the STD when I had sex with multiple people, and I did few times test in 2020, I think the main reason to get cold feet to do that is the fear of STD",
            "author": null,
            "id": "j05t958",
            "parent_id": "t3_zl86fg",
            "score": 2,
            "created_utc": 1671002487.0,
            "replies": []
        },
        {
            "body": "RIGHT like 🤯🤯🤯🤯",
            "author": "whatsupmynameisSofia",
            "id": "j05yuyd",
            "parent_id": "t3_zl86fg",
            "score": 2,
            "created_utc": 1671006965.0,
            "replies": []
        },
        {
            "body": "Well, you know that golden penises are impervious to infection ? So if you have one of those you are bullet proof.",
            "author": "GSSD",
            "id": "j07e8k6",
            "parent_id": "t3_zl86fg",
            "score": 2,
            "created_utc": 1671036085.0,
            "replies": []
        },
        {
            "body": "Good for you ladies, I agree, unprotected sex for what? Not worth the risk. Only creeps with something weird going on would want to risk it",
            "author": null,
            "id": "j07erox",
            "parent_id": "t3_zl86fg",
            "score": 2,
            "created_utc": 1671036292.0,
            "replies": []
        },
        {
            "body": "Agreed, once we exchanged numbers I'm asked if I'm on birth control and the excuse that condoms make thier dick go limp when I say condoms are mandatory. Guys just don't care.",
            "author": "Aggressive_Pop403",
            "id": "j07jnis",
            "parent_id": "t3_zl86fg",
            "score": 2,
            "created_utc": 1671038162.0,
            "replies": []
        },
        {
            "body": "Trust me. I'm a professional. Lol",
            "author": "LunchBucketSandwich",
            "id": "j042z5b",
            "parent_id": "t3_zl86fg",
            "score": 4,
            "created_utc": 1670971360.0,
            "replies": []
        },
        {
            "body": "There are lots of single mothers around that prove that condoms are not enough used in vanilla dating too",
            "author": "GuyFromParis",
            "id": "j05hn91",
            "parent_id": "t3_zl86fg",
            "score": 3,
            "created_utc": 1670994783.0,
            "replies": [
                {
                    "body": "Valid Point!",
                    "author": "Typical-Equivalent89",
                    "id": "j07l4k7",
                    "parent_id": "t1_j05hn91",
                    "score": 1,
                    "created_utc": 1671038720.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "The truth is a lot of SB’s (and vanilla girls) are ok with raw sex.",
            "author": "NewYorkSD",
            "id": "j043b1u",
            "parent_id": "t3_zl86fg",
            "score": 7,
            "created_utc": 1670971498.0,
            "replies": [
                {
                    "body": "Not just \"okay\" with it, but actually want and prefer it too. I've had SBs leading the conversation of us getting to safe raw sex as soon as possible and it's never been an issue. I'm sick of the notion that it's only men who want raw sex and that women are victims to his needs... it's just not like that in reality.",
                    "author": "dapperswaggered",
                    "id": "j0464xh",
                    "parent_id": "t1_j043b1u",
                    "score": 4,
                    "created_utc": 1670972629.0,
                    "replies": [
                        {
                            "body": "Agreed! I’ve had SB’s pull the condom off of me because they wanted me to have sex with them raw.",
                            "author": "NewYorkSD",
                            "id": "j04694c",
                            "parent_id": "t1_j0464xh",
                            "score": 2,
                            "created_utc": 1670972679.0,
                            "replies": [
                                {
                                    "body": "This whole condom thing is becoming a shaming tactic for SDs.\n\nAbout 80% of my past SBs were ok with no condom on the first date.",
                                    "author": "UnearthlyDinosaur",
                                    "id": "j055agk",
                                    "parent_id": "t1_j04694c",
                                    "score": 2,
                                    "created_utc": 1670988306.0,
                                    "replies": [
                                        {
                                            "body": "Agreed, I’d say my experience is almost identical, 80-90% are perfectly fine with no condoms, and that 10-20% is for birth control.  Several who were not on birth control were fine with pulling out.  As much as I despise condoms, I’ve been the one requiring them more than my SBs",
                                            "author": "blk-tye",
                                            "id": "j05rrvl",
                                            "parent_id": "t1_j055agk",
                                            "score": 0,
                                            "created_utc": 1671001372.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "Agreed. We see this same type of post all the time.",
                                            "author": "NewYorkSD",
                                            "id": "j055dvu",
                                            "parent_id": "t1_j055agk",
                                            "score": 0,
                                            "created_utc": 1670988353.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Thank you. Someone needs to say it.",
                    "author": "UnearthlyDinosaur",
                    "id": "j055608",
                    "parent_id": "t1_j043b1u",
                    "score": -5,
                    "created_utc": 1670988246.0,
                    "replies": [
                        {
                            "body": "It’s all fun and games until you have genital warts but you two carry on lol. Did you not just see the post stating someone who knowingly has HPV continues to have unprotected sex and not disclose their status to their partners?! Hope you stay safe and disease free.",
                            "author": "Typical-Equivalent89",
                            "id": "j058rxg",
                            "parent_id": "t1_j055608",
                            "score": 10,
                            "created_utc": 1670990015.0,
                            "replies": [
                                {
                                    "body": "That part.\n\nAnd she’s not even a shitty person - she was raped at an early and lets guys do it because she goes into fight or flight mode and freezes in the moment and allows it.  \n\nLiterally, the very next woman those guys sleep with is at risk for HPV.  It’s like playing Russian Roulette with your health - and I promise when an SB is having full reconstruction in her reproductive parts, SD will not be standing by her.",
                                    "author": "mistressita",
                                    "id": "j06fv0k",
                                    "parent_id": "t1_j058rxg",
                                    "score": 3,
                                    "created_utc": 1671020485.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Like girls never hook up with a guy IRL and don't use condoms. Got it...",
            "author": "SD1070",
            "id": "j0410il",
            "parent_id": "t3_zl86fg",
            "score": 5,
            "created_utc": 1670970566.0,
            "replies": []
        },
        {
            "body": "> It really is disgusting that they care so little about it.\n\nThat is indeed true, but as tempsd pointed out, this is hardly a thing unique to sugaring.\n\n> Why is unknown, raw vagina so thrilling to them?!\n\nI'm hoping that's a rhetorical question.",
            "author": "FLRAdvocate",
            "id": "j03welt",
            "parent_id": "t3_zl86fg",
            "score": 5,
            "created_utc": 1670968741.0,
            "replies": [
                {
                    "body": "lol, this SB has no idea what men like.",
                    "author": "UnearthlyDinosaur",
                    "id": "j05553z",
                    "parent_id": "t1_j03welt",
                    "score": -2,
                    "created_utc": 1670988235.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "The data just isn't there for oral/vaginal to make it a serious enough concern. Higher risk cohorts should give it more thought. But I haven't seen the horror stories. Not to say they don't exist. But of all the myriad problems SLF users experience I haven't seen STIs mentioned at a level that would make me think it was a problem in our community. And the CDC data shows it isn't a serious problem for oral/vaginal more broadly. \n\nIt's become normalized in the community to the point now that happening upon an unwilling partner is much more the exception. Condoms in SRs seem to be the outlier. \n\nOf course that isn't best case scenario from an epidemiological perspective. But we're broadly a low risk group so I'm not super worried about it. And it's become so entrenched now that I don't see it changing.",
            "author": "KPackCorey",
            "id": "j04fycj",
            "parent_id": "t3_zl86fg",
            "score": 5,
            "created_utc": 1670976815.0,
            "replies": []
        },
        {
            "body": ">Why is unknown, raw vagina so thrilling to them?!\n\nBecause it feels amazing, it's as simple as that. Nothing to do with unknown, raw sex feels better than condoms. \n\nIf you don't want to have unprotected sex, then just say so, you are an adult and it is not rocket science. There are ways to reduce your risk, as discussed by other people here. Not sure why you had to bring SDs into it, plenty of raw sex is happening in vanilla dating too.",
            "author": "chemistryromance",
            "id": "j0499qz",
            "parent_id": "t3_zl86fg",
            "score": 4,
            "created_utc": 1670973945.0,
            "replies": [
                {
                    "body": "We love victim blaming 😍",
                    "author": null,
                    "id": "j075dw8",
                    "parent_id": "t1_j0499qz",
                    "score": 3,
                    "created_utc": 1671032606.0,
                    "replies": [
                        {
                            "body": "Op is a victim because men want to have sex with her without wearing a condom? That definition would make all women victims lol",
                            "author": "chemistryromance",
                            "id": "j07jk0w",
                            "parent_id": "t1_j075dw8",
                            "score": -1,
                            "created_utc": 1671038124.0,
                            "replies": [
                                {
                                    "body": "No. I’m saying the person that is bitching to her about why she shouldn’t be upset, is a problem. It’s assholes like YOU that are the problem. Do better.",
                                    "author": null,
                                    "id": "j08bqx4",
                                    "parent_id": "t1_j07jk0w",
                                    "score": 2,
                                    "created_utc": 1671048790.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "It’s a vent/rant for a reason, not a think piece on unprotected sex in today’s society. I brought up SDs because they have been the most adamant about having condom less sex as soon as possible without ever mentioning testing.",
                    "author": "Typical-Equivalent89",
                    "id": "j04cbx9",
                    "parent_id": "t1_j0499qz",
                    "score": 7,
                    "created_utc": 1670975242.0,
                    "replies": [
                        {
                            "body": "To be honest, I hate these kind of provocative posts because it pitches SBs against SDs and starts a 'Us vs Them' argument.",
                            "author": "chemistryromance",
                            "id": "j04hawt",
                            "parent_id": "t1_j04cbx9",
                            "score": 1,
                            "created_utc": 1670977397.0,
                            "replies": [
                                {
                                    "body": "OP is just a man hater it seems.\n\nI’ve had plenty of SBs ask me for xxxx before we even have intimacy but I’m not on SLF whining about it. I just said “no.”",
                                    "author": "UnearthlyDinosaur",
                                    "id": "j055j70",
                                    "parent_id": "t1_j04hawt",
                                    "score": -4,
                                    "created_utc": 1670988425.0,
                                    "replies": [
                                        {
                                            "body": "I know right.",
                                            "author": "chemistryromance",
                                            "id": "j05y4os",
                                            "parent_id": "t1_j055j70",
                                            "score": -5,
                                            "created_utc": 1671006370.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "SDs are less adamant about condomless sex tha. SBs. You may not like to hear it but raw is really more the norm in SR. Maybe your post should have just been a vent about raw rather than blaming men when it’s kinda the opposite most of the time",
                            "author": "Gold-Leading3602",
                            "id": "j3eq9xt",
                            "parent_id": "t1_j04cbx9",
                            "score": 1,
                            "created_utc": 1673140361.0,
                            "replies": [
                                {
                                    "body": "Maybe it’s the opposite based on your experiences and point of view, definitely not the case on my side of the fence.",
                                    "author": "Typical-Equivalent89",
                                    "id": "j3fdfqa",
                                    "parent_id": "t1_j3eq9xt",
                                    "score": 1,
                                    "created_utc": 1673150851.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I've had unprotected sex in some of my arrangements but before I begin a new sugar arrangement I always get tested and I require the SB to get tested also before we ever have sex. I got a vasectomy 3 years ago so unwanted pregnancies is not a concern.",
            "author": "Kooky-Ad-1792",
            "id": "j0514yy",
            "parent_id": "t3_zl86fg",
            "score": 2,
            "created_utc": 1670986317.0,
            "replies": []
        },
        {
            "body": "As a guy that just listens to the girls preference on condoms, why is it thrilling? Cuz a girl that really really likes you outright demands no condoms. Yes it has happened multiple times vanilla dating with girls. \n\nAs I get more experienced I realize that young women make rules for some men, and break them for others. Realizing what man you are is thrilling or humbling. \n\nCurrent SB demanded raw second date. I agreed first date as she asked. Naturally I get tested after each partner and never had a STI.",
            "author": "NotARussianBot1984",
            "id": "j0512pu",
            "parent_id": "t3_zl86fg",
            "score": 2,
            "created_utc": 1670986288.0,
            "replies": []
        },
        {
            "body": "Agreed. Amazing the amount of Russian roulette apparently happening. 🧐",
            "author": null,
            "id": "j03yd44",
            "parent_id": "t3_zl86fg",
            "score": 0,
            "created_utc": 1670969521.0,
            "replies": []
        },
        {
            "body": "It's a personal choice, and not exclusive to men, plenty of women want and expect unprotected sex especially in a long term arrangement/relationship. A majority of sugar relationships occur without any STD related issues. Only a small portion of people in sugar dating (or any dating really) expect condom usage for all encounters, that's a minority perspective, so if that's where you stand it's best to let it be known and discussed early on because few are going to be of the same opinion.",
            "author": "dapperswaggered",
            "id": "j045a8s",
            "parent_id": "t3_zl86fg",
            "score": 2,
            "created_utc": 1670972273.0,
            "replies": [
                {
                    "body": "I love how you replied as if you have scientific data backing these claims. Please show me the peer reviewed research stating a majority of sugar relationships occur without any STD related issues 🧐.",
                    "author": "Typical-Equivalent89",
                    "id": "j04cwrf",
                    "parent_id": "t1_j045a8s",
                    "score": 1,
                    "created_utc": 1670975493.0,
                    "replies": [
                        {
                            "body": "Most research is biased and highly subjective and not really that conducive of real world scenarios as only select types of people are chosen and willing to participate, you can draw multiple positive or negative conclusion you want from results. The baseline (people outside of sugar dating) are likely to be of the more monogamous types, and less likely to be the type that sleep around a lot recklessly.\n\nBut if you're looking for an article... [https://pubmed.ncbi.nlm.nih.gov/34410199/](https://pubmed.ncbi.nlm.nih.gov/34410199/)\n\n>\"sugar dating women were twice as likely to have been diagnosed with an STI but were more than six times as likely to have been tested for STIs.\"\n\nSix times more likely to have been tested for STI's with only twice as high of diagnosed cases... if you were to have everyone else who was sexually active and in a casual sex/dating based lifestyles I guarantee you will find much more than two times the cases with six times the tests being conducted. Same with covid, the more they tested the more positive cases were found and the more the panic ensued. Therefore, sugar dating is actually lower or at least on par with the rates of casual dating, and people are actually more concerned about testing and ensuring safety.",
                            "author": "dapperswaggered",
                            "id": "j04pvj3",
                            "parent_id": "t1_j04cwrf",
                            "score": 0,
                            "created_utc": 1670981198.0,
                            "replies": [
                                {
                                    "body": "Got it, so there isn’t legit research stating majority of sugar relationships occur without any STD related issues that you could find. Thank you for doing that labor. The article you did find was an interesting read.",
                                    "author": "Typical-Equivalent89",
                                    "id": "j0584mp",
                                    "parent_id": "t1_j04pvj3",
                                    "score": 2,
                                    "created_utc": 1670989696.0,
                                    "replies": [
                                        {
                                            "body": "Is there any research to indicate that sugar dating leads to higher rates compared to vanilla and with similar large pool sizes of people with similar backgrounds and lifestyles and similar rates of testing? Didn’t think so. Clearly don’t know how to comprehend or are one to presume worse case scenarios or are a hypochondriac. Thanks for the rant.",
                                            "author": "dapperswaggered",
                                            "id": "j05pyji",
                                            "parent_id": "t1_j0584mp",
                                            "score": 0,
                                            "created_utc": 1671000052.0,
                                            "replies": [
                                                {
                                                    "body": "Please, that’s what this forum is for. It’s full of rants and complaints. You were spewing your opinions as facts and couldn’t back up your claims. That’s it, that’s all. Finding something related and making correlations doesn’t count.",
                                                    "author": "Typical-Equivalent89",
                                                    "id": "j07q0jn",
                                                    "parent_id": "t1_j05pyji",
                                                    "score": 2,
                                                    "created_utc": 1671040573.0,
                                                    "replies": [
                                                        {
                                                            "body": "It's not just an opinion, it's based on personal experience and also what's reflected often among this forum where people treat sugar dating more like actual dating with a long term partner and where unprotected sex is implied.\n\nWith your statement \"isn’t sugaring a form of sex work?\" you clearly should be more concerned about protection and only looking for those who will always feel the same way, but there are plenty of us who do treat it more like a long term relationship and the risks are pretty low but obviously always present.",
                                                            "author": "dapperswaggered",
                                                            "id": "j08jfea",
                                                            "parent_id": "t1_j07q0jn",
                                                            "score": 2,
                                                            "created_utc": 1671051636.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Nasty",
            "author": "Key-Significance-644",
            "id": "j0455d2",
            "parent_id": "t3_zl86fg",
            "score": 1,
            "created_utc": 1670972217.0,
            "replies": []
        },
        {
            "body": "Seems easy to fix. Demand they bring an STD test to the M&G, you do the same. All people should be tested every 8-12 weeks. I expect this of anyone I sleep with. There’s free sex health clinics in most cities, and if there isn’t then STDcheck.com is the way to do it.\n\nIf you want men who use condoms, then put it in your profile. It will hurt your chances but if it’s a boundary for you it’s a boundary.\n\nPersonally, I don’t like condoms and I’m not going to give a woman tens of thousands when the sex isn’t great. Sex with condoms is never great. It can be good, just not great. I empathize with women having the risk of pregnancy. I wish there were better options for men than vasectomy’s (which are considered permanent, because the reversibility declines rapidly), or condoms which guys tend to hate. Woman have a lot more options, some of which have significant risks.",
            "author": "atxsuda",
            "id": "j04sxxg",
            "parent_id": "t3_zl86fg",
            "score": 1,
            "created_utc": 1670982589.0,
            "replies": []
        },
        {
            "body": "So I agree with your general premise that there should be more concern about STDs and that condoms should be used at the beginning of a relationship. However...\n\n*So you care more about having a baby then an incurable STD?*\n\nYES! A heck of a lot more!! These two concerns are not even in the same ballpark! Unless a disease is fatal, it cannot be at the same level as (potentially) creating a new life.\n\n*Why is unknown, raw vagina so thrilling to them?!*\n\nThat one is funny! :) If you know anything about men, then you should know that it is literally our greatest pleasure! If you cannot understand why, then just accept as a given that it is our nature to chase it. Btw if it was not the case, women would have much less power over men.",
            "author": "AusterlitzSD",
            "id": "j04tgjq",
            "parent_id": "t3_zl86fg",
            "score": 3,
            "created_utc": 1670982817.0,
            "replies": [
                {
                    "body": "The irony of your last sentence is not lost on me 😝",
                    "author": "P0sitiveViibes777",
                    "id": "j3ocscy",
                    "parent_id": "t1_j04tgjq",
                    "score": 1,
                    "created_utc": 1673306443.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Already ditching your dream SD eh.. lol",
            "author": "malcolm_reyn0lds",
            "id": "j04jkgb",
            "parent_id": "t3_zl86fg",
            "score": 1,
            "created_utc": 1670978384.0,
            "replies": [
                {
                    "body": "Sadly, he lied about being married and then tried to skimp on our agreed upon allowance. So yeah ditched him quick after that.",
                    "author": "Typical-Equivalent89",
                    "id": "j04ldc0",
                    "parent_id": "t1_j04jkgb",
                    "score": 4,
                    "created_utc": 1670979174.0,
                    "replies": [
                        {
                            "body": "Just gotta assume they are all married. Sorry to hear that",
                            "author": "malcolm_reyn0lds",
                            "id": "j04mmsb",
                            "parent_id": "t1_j04ldc0",
                            "score": 1,
                            "created_utc": 1670979742.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "“Why is unknown, raw vagina so thrilling to them?”\n\nBruh",
            "author": "UnearthlyDinosaur",
            "id": "j0551di",
            "parent_id": "t3_zl86fg",
            "score": 1,
            "created_utc": 1670988184.0,
            "replies": [
                {
                    "body": "😂 sorry but UNKNOWN, raw dick makes me nervous. I don’t care if it’s attached to Drake or\nPresident Obama! So the fact that some SDs demand it is crazy to me. Might as well go to a glory hole lol. Why is that deemed risky and gross but an untested partner isn’t? Just because you can see their face and you want to “believe” they’re safe or they “look” clean all of a sudden there’s less risk… hmmm",
                    "author": "Typical-Equivalent89",
                    "id": "j056ra4",
                    "parent_id": "t1_j0551di",
                    "score": 6,
                    "created_utc": 1670989016.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "If you wear a condom did you really have sex?",
            "author": "Professional-Fudge45",
            "id": "j06h2r1",
            "parent_id": "t3_zl86fg",
            "score": 1,
            "created_utc": 1671021255.0,
            "replies": []
        },
        {
            "body": "i let the woman take the lead, sugar or vanilla.  if they hop on raw, i don't question it.  if they ask for a condom, i will always have one ready to go.  if it's an ambiguous situation, i will ask if they want to use one.\n\ni'd say 80% of women, whether SB or vanilla, have not asked me to use a condom",
            "author": "throwawaymeter",
            "id": "j084fs2",
            "parent_id": "t3_zl86fg",
            "score": 1,
            "created_utc": 1671046089.0,
            "replies": []
        },
        {
            "body": "My penis is strangely shaped, it’s not that long but it’s very thick.  There isn’t a great fit out there.  I have to make do but it’s not a lot of fun.",
            "author": "Starshogun1",
            "id": "j05iaj8",
            "parent_id": "t3_zl86fg",
            "score": -1,
            "created_utc": 1670995152.0,
            "replies": [
                {
                    "body": "I’m sorry to hear that 😔",
                    "author": "Typical-Equivalent89",
                    "id": "j07lbmu",
                    "parent_id": "t1_j05iaj8",
                    "score": 1,
                    "created_utc": 1671038794.0,
                    "replies": []
                },
                {
                    "body": "Custom condoms? Myonecondoms.com",
                    "author": "love_more88",
                    "id": "j06u2hi",
                    "parent_id": "t1_j05iaj8",
                    "score": 1,
                    "created_utc": 1671027877.0,
                    "replies": [
                        {
                            "body": "A friend of mine uses these for his unusually shaped cock, and has fantastic things to say about the company. His condoms are custom made just for him. In his case, he's very thick at the base, akin to a pyramid, and shared that normal condoms simply weren't working. His sex life changed happily for the better after custom condoms.",
                            "author": "BlueButterfly222SB",
                            "id": "j08c5nj",
                            "parent_id": "t1_j06u2hi",
                            "score": 2,
                            "created_utc": 1671048934.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Biology",
            "author": "MGTOWManofMystery",
            "id": "j051y1v",
            "parent_id": "t3_zl86fg",
            "score": -2,
            "created_utc": 1670986697.0,
            "replies": []
        },
        {
            "body": "[removed]",
            "author": null,
            "id": "j07vny9",
            "parent_id": "t3_zl86fg",
            "score": 1,
            "created_utc": 1671042739.0,
            "replies": [
                {
                    "body": "Rule #4: No \"value for money\" discussion\n\nDiscussions about how to get the most value for your money are not allowed. Posts asking for or assigning a monetary value to sexual acts are not allowed. Assigning a monetary worth to individuals based on race, age, size,looks, etc., are not allowed. Posts about how much allowance/ppm to ask for, give, is average, for such and such area or situation, are no longer be allowed on SLF. Any posts with dollar amounts that are in reference to PPMs and/or allowances are no longer allowed.\n\nAlso see the [Allowance Master Thread](https://www.reddit.com/r/sugarlifestyleforum/comments/dezl91/allowance_master_thread_20192020/).",
                    "author": "sugarlifestyleforum-ModTeam",
                    "id": "j08bifa",
                    "parent_id": "t1_j07vny9",
                    "score": 1,
                    "created_utc": 1671048704.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "You're not the first SB from whom I hear of it. Additionally, any SD who inquires with you about unprotected sex is inquiring with others, so he may have been clean as of his last exam (if he truly had one), but now - who knows.\n\nFrom this side of the bowl, let me tell you that not all guys would pursue unprotected sex. Some of them (or at least one) will not have unprotected sex with anyone in this context. Pregnancy is the \"original STI\" but hardly the only one.\n\nFuture SD",
            "author": "FutureSD617",
            "id": "j0hso38",
            "parent_id": "t3_zl86fg",
            "score": 1,
            "created_utc": 1671217764.0,
            "replies": []
        },
        {
            "body": "Most STDs are in semen as long as they don’t bust in you it’s 99% no risk of std",
            "author": "Decamillionaires",
            "id": "j0q6d33",
            "parent_id": "t3_zl86fg",
            "score": 1,
            "created_utc": 1671381154.0,
            "replies": []
        },
        {
            "body": "Yeah I’m fkng dumb I got tested before my last SB without asking her to get tested as well… Well now I got HPV and fucked for some time until I’m not contagious.\n\nAt least it wasn’t anything really serious  (As a man), but I need to be responsible and not to have sex with other women in the meanwhile…. But man I was mad when I found out, most likely mad with me for not asking for a test 🤦‍♂️\n\nWill never happen on any type of relationship I run into.\n\nShe is 20 and I’m 37 I’m just surprised how young she got a SDT and surprised how stupid that after 37 years of taking care I took a wrong step..\n\nBTW now I know HPV can be transmitted even when using condoms, so be sure you get vaccinated 🤷‍♂️",
            "author": "RealBlondHunter",
            "id": "j0x1jtc",
            "parent_id": "t3_zl86fg",
            "score": 1,
            "created_utc": 1671499429.0,
            "replies": [
                {
                    "body": "Wow, I’m sorry you’re going through this. Thank you for sharing your experience as so many in the comments like to pretend these situations aren’t happening in our community. I had a scare in my early 20’s before sugaring and since then it’s been a non-negotiable. Pleasure is temporary, we only get one body.",
                    "author": "Typical-Equivalent89",
                    "id": "j1emv1g",
                    "parent_id": "t1_j0x1jtc",
                    "score": 1,
                    "created_utc": 1671822796.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "THIS! They’re obsessing over using a VPN just to log into seeking but couldn’t care less about Herpes 😂 got it.",
            "author": "Typical-Equivalent89",
            "id": "j0573og",
            "parent_id": "t1_j055jxl",
            "score": 42,
            "created_utc": 1670989183.0,
            "replies": []
        },
        {
            "body": "This is how my ex- neighbor discovered his wife was cheating on him & gave him genital warts. See, back in the day before digital took over, you could pick up wireless (not cell) phones on police scanners. My dad was running thru the channels and heard the phone call. We knew who it was since we could only pick up the signals from a limited distance & he mentioned her by name.",
            "author": "MrRetrdO",
            "id": "j05gz3t",
            "parent_id": "t1_j055jxl",
            "score": 19,
            "created_utc": 1670994406.0,
            "replies": [
                {
                    "body": "Oh that's true. One time tho, I was clicking the off and on button and my wireless phone picked up a random conversation lol",
                    "author": "thedoctor321",
                    "id": "j092qny",
                    "parent_id": "t1_j05gz3t",
                    "score": 2,
                    "created_utc": 1671059343.0,
                    "replies": [
                        {
                            "body": "Yep. Those were fun times! Its how found out the other neighbor talks to her dead mother too. \n\nEver since then, my Dad refused to get a wireless phone in the house. We still have a working rotary wall phone in the basement.",
                            "author": "MrRetrdO",
                            "id": "j0ajtqf",
                            "parent_id": "t1_j092qny",
                            "score": 2,
                            "created_utc": 1671085088.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "And how can any SB trust a married SD to be monogamous to her or honest about his sexual practices when he’s lying to his own wife???",
            "author": "xxfitprincess",
            "id": "j0akylc",
            "parent_id": "t1_j055jxl",
            "score": 5,
            "created_utc": 1671085866.0,
            "replies": []
        },
        {
            "body": "thank you",
            "author": "daddyangeldust",
            "id": "j078w9n",
            "parent_id": "t1_j05oowc",
            "score": 1,
            "created_utc": 1671033984.0,
            "replies": [
                {
                    "body": "This is what I send to potential sds when we discuss protection. Bjs are covered and you can feel free to daty. Here’s why. \nBut it’s important to note, that this is purely for educational purposes, because if you’ve attempted to challenge my boundaries we’re not a match. I deal with respectful, polite men, or no one at all. Babies, I encourage you all to do the same.",
                    "author": "Few-Dog-6206",
                    "id": "j08b06i",
                    "parent_id": "t1_j078w9n",
                    "score": 6,
                    "created_utc": 1671048518.0,
                    "replies": [
                        {
                            "body": "That's smart. Same here. I was naive and I gave someone oral when I was younger. Contracted God knows what but my doctor knew it was from oral and I had infections so bad for months they had to remove my tonsils. Never a-freaking-gain. It sucks (pun intended lol ) cus I like doing it too. I wish STDs just didn't exist.",
                            "author": "daddyangeldust",
                            "id": "j0afyqu",
                            "parent_id": "t1_j08b06i",
                            "score": 7,
                            "created_utc": 1671082576.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "And HSV2 and HSV1 are quite literally the exact same virus… 1 is oral and 2 is genital, you can transfer 1 orally to someone’s genitals and vice Versa. It’s the lack of general sex education but participating in sex work that’s astounding to me 😵‍💫🥱",
            "author": "Feisty_Rhubarb5402",
            "id": "j05p8rg",
            "parent_id": "t1_j04alg2",
            "score": 6,
            "created_utc": 1670999545.0,
            "replies": [
                {
                    "body": "THIS. Their post was really sad to me. Dehumanizing really. I have hsv2 that I got when I was young from my 2nd partner going down on me. I always tell partners/sugars beforehand because everyone deserves autonomy in their sexual health. I literally keep it in my profile that I have hsv2. That being said, there are MANY people who are willing to take that risk and not used condoms. It kind of baffles me, but at the same time I don’t hate it because well, I’m still getting laid and all the other fun sugar stuff. Everyone who requires testing and condoms is absolutely right.",
                    "author": "Letmehearyourhaikus",
                    "id": "j05uisk",
                    "parent_id": "t1_j05p8rg",
                    "score": 5,
                    "created_utc": 1671003484.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "j06fk5m",
                            "parent_id": "t1_j05uisk",
                            "score": -1,
                            "created_utc": 1671020295.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Participating in sex at all and the lack of education on the matter is terrifying.",
                    "author": "blndy2022",
                    "id": "j073gek",
                    "parent_id": "t1_j05p8rg",
                    "score": 3,
                    "created_utc": 1671031839.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "j05p07v",
            "parent_id": "t1_j04alg2",
            "score": 0,
            "created_utc": 1670999378.0,
            "replies": [
                {
                    "body": "STD discussion should be normalized, having STD’s and passing them around without a care in the world or not being STD tested between partners should NEVER be normalized. Not sharing your status should not be normalized. That is the entire point. I am not shaming anyone who has an STD. The lack of care about if you do or don’t have one is the issue and it’s disturbing. If you’re not taking care of your sexual health, if you haven’t been checked, if you don’t know and you’re engaging in sexual activity with someone it’s disgusting and should not be normalized. You’re risking not just your health but someone else’s. That’s not ok. That should not be normalized.",
                    "author": "blndy2022",
                    "id": "j0741ls",
                    "parent_id": "t1_j05p07v",
                    "score": 7,
                    "created_utc": 1671032078.0,
                    "replies": [
                        {
                            "body": "Which is what I said",
                            "author": "Feisty_Rhubarb5402",
                            "id": "j0ncvm5",
                            "parent_id": "t1_j0741ls",
                            "score": 0,
                            "created_utc": 1671321154.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Men cannot be tested for the 200+ strains of HPV, which can ruin fertility and cause many cancers 🙃",
            "author": "hotcollegegirl420",
            "id": "j0vbzze",
            "parent_id": "t1_j045cop",
            "score": 2,
            "created_utc": 1671473898.0,
            "replies": [
                {
                    "body": "Right but you still can get it while using condom, I got it from my last SB I’m in treatment now, no sex for some time with or without condoms 🫤",
                    "author": "RealBlondHunter",
                    "id": "j0x484f",
                    "parent_id": "t1_j0vbzze",
                    "score": 1,
                    "created_utc": 1671500647.0,
                    "replies": [
                        {
                            "body": "Treatment for HPV? That doesn’t exist unless you are talking about cancer treatment",
                            "author": "hotcollegegirl420",
                            "id": "j0xivcz",
                            "parent_id": "t1_j0x484f",
                            "score": 1,
                            "created_utc": 1671507407.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Because young guys hate natural sex, right oh learned mentor?",
            "author": "tempsdforfuns",
            "id": "j04gefd",
            "parent_id": "t1_j04bgqa",
            "score": -7,
            "created_utc": 1670977007.0,
            "replies": [
                {
                    "body": "Oof, did I hit a nerve there?\n\nBut no off course not, they like it too! Everybody does!\n\nBut they like it because it feels better, not because they cannot perform with a condom.",
                    "author": "A-touchofreality",
                    "id": "j04mrie",
                    "parent_id": "t1_j04gefd",
                    "score": 6,
                    "created_utc": 1670979804.0,
                    "replies": [
                        {
                            "body": "It’s cute that you think you can “hit a nerve.”  \n\n100% of men prefer natural sex for obvious reasons.  I’d expect a “sugar mentor” to understand this.",
                            "author": "tempsdforfuns",
                            "id": "j050v4a",
                            "parent_id": "t1_j04mrie",
                            "score": -6,
                            "created_utc": 1670986192.0,
                            "replies": [
                                {
                                    "body": ">Everybody does!\n\nReading comprehension problems too?",
                                    "author": "A-touchofreality",
                                    "id": "j05zncz",
                                    "parent_id": "t1_j050v4a",
                                    "score": 5,
                                    "created_utc": 1671007623.0,
                                    "replies": [
                                        {
                                            "body": "I… saw that comment?  You made a silly attempt to claim I have ED or something because I pointed out that we all like natural sex… even though you also pointed it out.  Your comment (like most of your “mentoring”) added no value.",
                                            "author": "tempsdforfuns",
                                            "id": "j06u5e1",
                                            "parent_id": "t1_j05zncz",
                                            "score": 2,
                                            "created_utc": 1671027913.0,
                                            "replies": [
                                                {
                                                    "body": "The 'mentor' in my flair does seem to strike a nerve too, does it? How dare a *woman* call herself that!? /s\n\nI will leave it to the other participants to decide if my mentoring is adding value or not. If you don't like it, just skip it? Or even better, block me so you don't have to see my silly woman comments anymore?\n\nCheers!",
                                                    "author": "A-touchofreality",
                                                    "id": "j06vs1g",
                                                    "parent_id": "t1_j06u5e1",
                                                    "score": 2,
                                                    "created_utc": 1671028636.0,
                                                    "replies": [
                                                        {
                                                            "body": "Anyone with the audacity to consider themselves a “sugar mentor” is very annoying, yes.  Not sure what your gender has to do with it.",
                                                            "author": "tempsdforfuns",
                                                            "id": "j08cysf",
                                                            "parent_id": "t1_j06vs1g",
                                                            "score": 2,
                                                            "created_utc": 1671049238.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "😂😂😂",
            "author": "Typical-Equivalent89",
            "id": "j04dfdk",
            "parent_id": "t1_j03xoqy",
            "score": 4,
            "created_utc": 1670975713.0,
            "replies": []
        },
        {
            "body": "I agree and understand this is common. Simply a rant on my experience and how I feel about it. I just personally don’t want someone to assume I will have raw sex with them just because I’m on BC and then get upset when I dont “trust” that they are clean.",
            "author": "Typical-Equivalent89",
            "id": "j04dxp8",
            "parent_id": "t1_j03yzuy",
            "score": 6,
            "created_utc": 1670975935.0,
            "replies": []
        },
        {
            "body": "Hpv cannot be tested for in men, and it can give both parties reproductive, oral, throat, and anal cancers. It has no symptoms until it’s too late",
            "author": "hotcollegegirl420",
            "id": "j05nruc",
            "parent_id": "t1_j041t9q",
            "score": 13,
            "created_utc": 1670998527.0,
            "replies": [
                {
                    "body": "there's a vaccine for that",
                    "author": "throwawaymeter",
                    "id": "j084ocu",
                    "parent_id": "t1_j05nruc",
                    "score": 0,
                    "created_utc": 1671046176.0,
                    "replies": [
                        {
                            "body": "Lol no, there’s a vaccine that *helps* protect against 9 of the 200+ strains, but does not even grant full immunity against those 9",
                            "author": "hotcollegegirl420",
                            "id": "j086wjg",
                            "parent_id": "t1_j084ocu",
                            "score": 5,
                            "created_utc": 1671047008.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "It can be tested for - at least a few of the strains. But finding a testing center that can do so..? I live outside a major metro area and tried valiantly to find testing options with a previous gentleman partner, to no avail. Sigh. But the tests do exist.",
                    "author": "BlueButterfly222SB",
                    "id": "j088c6p",
                    "parent_id": "t1_j05nruc",
                    "score": 0,
                    "created_utc": 1671047537.0,
                    "replies": [
                        {
                            "body": "It can be tested for in women with Pap smears of the cervix only. There is no way to test for it at all in men!\n\n I work with HPV causing HELA cell cultures in a research lab. There is currently no way at all to test in men",
                            "author": "hotcollegegirl420",
                            "id": "j08sy0r",
                            "parent_id": "t1_j088c6p",
                            "score": 4,
                            "created_utc": 1671055279.0,
                            "replies": [
                                {
                                    "body": "Oh no. I must have been misinformed. Sigh. I think we can all agree that we wish there was a test for both genders!",
                                    "author": "BlueButterfly222SB",
                                    "id": "j091xaf",
                                    "parent_id": "t1_j08sy0r",
                                    "score": 3,
                                    "created_utc": 1671058999.0,
                                    "replies": [
                                        {
                                            "body": "Oh absolutely, I don’t quite understand why there isn’t and why it is so gender specific when all genders can clearly get and transmit it. But it’s horrifying how misinformed EVERYONE is about HPV, the risks are really underestimated",
                                            "author": "hotcollegegirl420",
                                            "id": "j095mk4",
                                            "parent_id": "t1_j091xaf",
                                            "score": 3,
                                            "created_utc": 1671060567.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I agree, with consent and test results I’m in. The irritation comes from the backlash I’ve received from wanting to be responsible and their attempts to manipulate me into raw sex.",
            "author": "Typical-Equivalent89",
            "id": "j04e81x",
            "parent_id": "t1_j041t9q",
            "score": 12,
            "created_utc": 1670976061.0,
            "replies": []
        },
        {
            "body": "Not acting like it’s a sugar thing, just venting about my multiple experiences with SDs who assume raw sex is on the table and don’t take their health or my health as serious as I feel it needs to be taken.",
            "author": "Typical-Equivalent89",
            "id": "j04egvr",
            "parent_id": "t1_j03w5cx",
            "score": 19,
            "created_utc": 1670976169.0,
            "replies": [
                {
                    "body": "You’re always free to say no.",
                    "author": "UnearthlyDinosaur",
                    "id": "j0553gv",
                    "parent_id": "t1_j04egvr",
                    "score": -8,
                    "created_utc": 1670988213.0,
                    "replies": [
                        {
                            "body": "And I do ☺️",
                            "author": "Typical-Equivalent89",
                            "id": "j056t08",
                            "parent_id": "t1_j0553gv",
                            "score": 19,
                            "created_utc": 1670989039.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Makes sense.  No one would know you could have sex without a condom if there wasn’t porn.",
            "author": "tempsdforfuns",
            "id": "j04gg9e",
            "parent_id": "t1_j03xygf",
            "score": -2,
            "created_utc": 1670977029.0,
            "replies": []
        },
        {
            "body": "I had a guy I was supposed to marry lie to me about HSV2.  I’ve been tested at least 6 times since that happened, and we often used protection, but it blew my mind that he thought he could get away with not telling and legitimately didn’t care enough about me and my body/sexual health not to disclose.  The only way I found out was by demanding to see his bloodwork results.\n\nA good friend of mine has HPV, lets guys in raw, and has never once disclosed her status because she thinks “it’s not a big deal.”",
            "author": "mistressita",
            "id": "j04mitg",
            "parent_id": "t1_j049u2d",
            "score": 13,
            "created_utc": 1670979693.0,
            "replies": [
                {
                    "body": "One, I’m sorry that happened to you. Horrible. Two, I hope your friend sees the error of her ways and starts being more responsible. Men and women need to be vigilant and protect each other.",
                    "author": "Typical-Equivalent89",
                    "id": "j04qz0u",
                    "parent_id": "t1_j04mitg",
                    "score": 7,
                    "created_utc": 1670981701.0,
                    "replies": [
                        {
                            "body": "Agreed",
                            "author": "mistressita",
                            "id": "j06fyn3",
                            "parent_id": "t1_j04qz0u",
                            "score": 1,
                            "created_utc": 1671020548.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Ehh that's not going to really change anything for me. But sounds like you have a shitty friend.",
                    "author": "BigBearSD",
                    "id": "j04u14j",
                    "parent_id": "t1_j04mitg",
                    "score": 0,
                    "created_utc": 1670983074.0,
                    "replies": []
                }
            ]
        },
        {
            "body": ">(at least for vaginal and anal).\n\nand oral, right? you know you can get STIs from oral, right?",
            "author": "AspiringSplendaBaby",
            "id": "j04hnsa",
            "parent_id": "t1_j049u2d",
            "score": 0,
            "created_utc": 1670977551.0,
            "replies": [
                {
                    "body": "No... no SD likes condom BJs.",
                    "author": "BigBearSD",
                    "id": "j04htav",
                    "parent_id": "t1_j04hnsa",
                    "score": 3,
                    "created_utc": 1670977617.0,
                    "replies": [
                        {
                            "body": "lol. back to the title and subject of the original post. if it matters for anal, it matters for oral...",
                            "author": "AspiringSplendaBaby",
                            "id": "j04hwmj",
                            "parent_id": "t1_j04htav",
                            "score": 2,
                            "created_utc": 1670977658.0,
                            "replies": [
                                {
                                    "body": "There's a significantly lower chance of catching an STI from unprotected oral than unprotected vaginal/anal (especially anal). So, it's not exactly accurate to say they should be weighed as equal risks: it doesn't necessarily follow that \"if it matters for anal, it matters for oral.\" \n\nIf someone is uncomfortable with taking on any level of risk and insists on condom use for all sex acts, I won't begrudge them that viewpoint at all. But the risk levels are not equal in allowing a new SD to slip PiV bareback vs giving them an uncovered BJ. Statistically, the former is far more reckless than the latter. Again, if it's still out of range of someone's risk tolerance, then certainly don't do either.",
                                    "author": "Intrepid_Egg_7722",
                                    "id": "j055vz7",
                                    "parent_id": "t1_j04hwmj",
                                    "score": 2,
                                    "created_utc": 1670988596.0,
                                    "replies": [
                                        {
                                            "body": "that's fair.",
                                            "author": "AspiringSplendaBaby",
                                            "id": "j057iyy",
                                            "parent_id": "t1_j055vz7",
                                            "score": 3,
                                            "created_utc": 1670989395.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Thank you, I understand it feels amazing. My concern is that it’s unknown, from a stranger lol and people are willing to just dive in and cross their fingers. I just can’t compute. A switch flipped for me as well and just don’t see why taking time to get tested is so difficult…",
            "author": "Typical-Equivalent89",
            "id": "j04dcsa",
            "parent_id": "t1_j040530",
            "score": 2,
            "created_utc": 1670975682.0,
            "replies": []
        },
        {
            "body": "I read 📖this as men 👨‍🦰who can afford STD's (like healthcare 🏥🚑⚕️🩺💊etc.) and I mean that's also 👍correct, so.",
            "author": null,
            "id": "j04zt2r",
            "parent_id": "t1_j04v0w7",
            "score": 3,
            "created_utc": 1670985707.0,
            "replies": []
        },
        {
            "body": "Thousands? 😇😇😇\n\n🫡",
            "author": "ftrikn",
            "id": "j05ibed",
            "parent_id": "t1_j04v0w7",
            "score": 2,
            "created_utc": 1670995166.0,
            "replies": [
                {
                    "body": "Blame it on the spider plant.",
                    "author": "highfructoseSD",
                    "id": "j05oj1j",
                    "parent_id": "t1_j05ibed",
                    "score": 1,
                    "created_utc": 1670999045.0,
                    "replies": [
                        {
                            "body": ":D",
                            "author": "idontlikespiderplant",
                            "id": "j0z1qc0",
                            "parent_id": "t1_j05oj1j",
                            "score": 1,
                            "created_utc": 1671544819.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Sex worker since 17.",
                    "author": "idontlikespiderplant",
                    "id": "j0z1pa1",
                    "parent_id": "t1_j05ibed",
                    "score": 1,
                    "created_utc": 1671544804.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Valid Point!",
            "author": "Typical-Equivalent89",
            "id": "j07l4k7",
            "parent_id": "t1_j05hn91",
            "score": 1,
            "created_utc": 1671038720.0,
            "replies": []
        },
        {
            "body": "Not just \"okay\" with it, but actually want and prefer it too. I've had SBs leading the conversation of us getting to safe raw sex as soon as possible and it's never been an issue. I'm sick of the notion that it's only men who want raw sex and that women are victims to his needs... it's just not like that in reality.",
            "author": "dapperswaggered",
            "id": "j0464xh",
            "parent_id": "t1_j043b1u",
            "score": 4,
            "created_utc": 1670972629.0,
            "replies": [
                {
                    "body": "Agreed! I’ve had SB’s pull the condom off of me because they wanted me to have sex with them raw.",
                    "author": "NewYorkSD",
                    "id": "j04694c",
                    "parent_id": "t1_j0464xh",
                    "score": 2,
                    "created_utc": 1670972679.0,
                    "replies": [
                        {
                            "body": "This whole condom thing is becoming a shaming tactic for SDs.\n\nAbout 80% of my past SBs were ok with no condom on the first date.",
                            "author": "UnearthlyDinosaur",
                            "id": "j055agk",
                            "parent_id": "t1_j04694c",
                            "score": 2,
                            "created_utc": 1670988306.0,
                            "replies": [
                                {
                                    "body": "Agreed, I’d say my experience is almost identical, 80-90% are perfectly fine with no condoms, and that 10-20% is for birth control.  Several who were not on birth control were fine with pulling out.  As much as I despise condoms, I’ve been the one requiring them more than my SBs",
                                    "author": "blk-tye",
                                    "id": "j05rrvl",
                                    "parent_id": "t1_j055agk",
                                    "score": 0,
                                    "created_utc": 1671001372.0,
                                    "replies": []
                                },
                                {
                                    "body": "Agreed. We see this same type of post all the time.",
                                    "author": "NewYorkSD",
                                    "id": "j055dvu",
                                    "parent_id": "t1_j055agk",
                                    "score": 0,
                                    "created_utc": 1670988353.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Thank you. Someone needs to say it.",
            "author": "UnearthlyDinosaur",
            "id": "j055608",
            "parent_id": "t1_j043b1u",
            "score": -5,
            "created_utc": 1670988246.0,
            "replies": [
                {
                    "body": "It’s all fun and games until you have genital warts but you two carry on lol. Did you not just see the post stating someone who knowingly has HPV continues to have unprotected sex and not disclose their status to their partners?! Hope you stay safe and disease free.",
                    "author": "Typical-Equivalent89",
                    "id": "j058rxg",
                    "parent_id": "t1_j055608",
                    "score": 10,
                    "created_utc": 1670990015.0,
                    "replies": [
                        {
                            "body": "That part.\n\nAnd she’s not even a shitty person - she was raped at an early and lets guys do it because she goes into fight or flight mode and freezes in the moment and allows it.  \n\nLiterally, the very next woman those guys sleep with is at risk for HPV.  It’s like playing Russian Roulette with your health - and I promise when an SB is having full reconstruction in her reproductive parts, SD will not be standing by her.",
                            "author": "mistressita",
                            "id": "j06fv0k",
                            "parent_id": "t1_j058rxg",
                            "score": 3,
                            "created_utc": 1671020485.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "lol, this SB has no idea what men like.",
            "author": "UnearthlyDinosaur",
            "id": "j05553z",
            "parent_id": "t1_j03welt",
            "score": -2,
            "created_utc": 1670988235.0,
            "replies": []
        },
        {
            "body": "We love victim blaming 😍",
            "author": null,
            "id": "j075dw8",
            "parent_id": "t1_j0499qz",
            "score": 3,
            "created_utc": 1671032606.0,
            "replies": [
                {
                    "body": "Op is a victim because men want to have sex with her without wearing a condom? That definition would make all women victims lol",
                    "author": "chemistryromance",
                    "id": "j07jk0w",
                    "parent_id": "t1_j075dw8",
                    "score": -1,
                    "created_utc": 1671038124.0,
                    "replies": [
                        {
                            "body": "No. I’m saying the person that is bitching to her about why she shouldn’t be upset, is a problem. It’s assholes like YOU that are the problem. Do better.",
                            "author": null,
                            "id": "j08bqx4",
                            "parent_id": "t1_j07jk0w",
                            "score": 2,
                            "created_utc": 1671048790.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "It’s a vent/rant for a reason, not a think piece on unprotected sex in today’s society. I brought up SDs because they have been the most adamant about having condom less sex as soon as possible without ever mentioning testing.",
            "author": "Typical-Equivalent89",
            "id": "j04cbx9",
            "parent_id": "t1_j0499qz",
            "score": 7,
            "created_utc": 1670975242.0,
            "replies": [
                {
                    "body": "To be honest, I hate these kind of provocative posts because it pitches SBs against SDs and starts a 'Us vs Them' argument.",
                    "author": "chemistryromance",
                    "id": "j04hawt",
                    "parent_id": "t1_j04cbx9",
                    "score": 1,
                    "created_utc": 1670977397.0,
                    "replies": [
                        {
                            "body": "OP is just a man hater it seems.\n\nI’ve had plenty of SBs ask me for xxxx before we even have intimacy but I’m not on SLF whining about it. I just said “no.”",
                            "author": "UnearthlyDinosaur",
                            "id": "j055j70",
                            "parent_id": "t1_j04hawt",
                            "score": -4,
                            "created_utc": 1670988425.0,
                            "replies": [
                                {
                                    "body": "I know right.",
                                    "author": "chemistryromance",
                                    "id": "j05y4os",
                                    "parent_id": "t1_j055j70",
                                    "score": -5,
                                    "created_utc": 1671006370.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "SDs are less adamant about condomless sex tha. SBs. You may not like to hear it but raw is really more the norm in SR. Maybe your post should have just been a vent about raw rather than blaming men when it’s kinda the opposite most of the time",
                    "author": "Gold-Leading3602",
                    "id": "j3eq9xt",
                    "parent_id": "t1_j04cbx9",
                    "score": 1,
                    "created_utc": 1673140361.0,
                    "replies": [
                        {
                            "body": "Maybe it’s the opposite based on your experiences and point of view, definitely not the case on my side of the fence.",
                            "author": "Typical-Equivalent89",
                            "id": "j3fdfqa",
                            "parent_id": "t1_j3eq9xt",
                            "score": 1,
                            "created_utc": 1673150851.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I love how you replied as if you have scientific data backing these claims. Please show me the peer reviewed research stating a majority of sugar relationships occur without any STD related issues 🧐.",
            "author": "Typical-Equivalent89",
            "id": "j04cwrf",
            "parent_id": "t1_j045a8s",
            "score": 1,
            "created_utc": 1670975493.0,
            "replies": [
                {
                    "body": "Most research is biased and highly subjective and not really that conducive of real world scenarios as only select types of people are chosen and willing to participate, you can draw multiple positive or negative conclusion you want from results. The baseline (people outside of sugar dating) are likely to be of the more monogamous types, and less likely to be the type that sleep around a lot recklessly.\n\nBut if you're looking for an article... [https://pubmed.ncbi.nlm.nih.gov/34410199/](https://pubmed.ncbi.nlm.nih.gov/34410199/)\n\n>\"sugar dating women were twice as likely to have been diagnosed with an STI but were more than six times as likely to have been tested for STIs.\"\n\nSix times more likely to have been tested for STI's with only twice as high of diagnosed cases... if you were to have everyone else who was sexually active and in a casual sex/dating based lifestyles I guarantee you will find much more than two times the cases with six times the tests being conducted. Same with covid, the more they tested the more positive cases were found and the more the panic ensued. Therefore, sugar dating is actually lower or at least on par with the rates of casual dating, and people are actually more concerned about testing and ensuring safety.",
                    "author": "dapperswaggered",
                    "id": "j04pvj3",
                    "parent_id": "t1_j04cwrf",
                    "score": 0,
                    "created_utc": 1670981198.0,
                    "replies": [
                        {
                            "body": "Got it, so there isn’t legit research stating majority of sugar relationships occur without any STD related issues that you could find. Thank you for doing that labor. The article you did find was an interesting read.",
                            "author": "Typical-Equivalent89",
                            "id": "j0584mp",
                            "parent_id": "t1_j04pvj3",
                            "score": 2,
                            "created_utc": 1670989696.0,
                            "replies": [
                                {
                                    "body": "Is there any research to indicate that sugar dating leads to higher rates compared to vanilla and with similar large pool sizes of people with similar backgrounds and lifestyles and similar rates of testing? Didn’t think so. Clearly don’t know how to comprehend or are one to presume worse case scenarios or are a hypochondriac. Thanks for the rant.",
                                    "author": "dapperswaggered",
                                    "id": "j05pyji",
                                    "parent_id": "t1_j0584mp",
                                    "score": 0,
                                    "created_utc": 1671000052.0,
                                    "replies": [
                                        {
                                            "body": "Please, that’s what this forum is for. It’s full of rants and complaints. You were spewing your opinions as facts and couldn’t back up your claims. That’s it, that’s all. Finding something related and making correlations doesn’t count.",
                                            "author": "Typical-Equivalent89",
                                            "id": "j07q0jn",
                                            "parent_id": "t1_j05pyji",
                                            "score": 2,
                                            "created_utc": 1671040573.0,
                                            "replies": [
                                                {
                                                    "body": "It's not just an opinion, it's based on personal experience and also what's reflected often among this forum where people treat sugar dating more like actual dating with a long term partner and where unprotected sex is implied.\n\nWith your statement \"isn’t sugaring a form of sex work?\" you clearly should be more concerned about protection and only looking for those who will always feel the same way, but there are plenty of us who do treat it more like a long term relationship and the risks are pretty low but obviously always present.",
                                                    "author": "dapperswaggered",
                                                    "id": "j08jfea",
                                                    "parent_id": "t1_j07q0jn",
                                                    "score": 2,
                                                    "created_utc": 1671051636.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "The irony of your last sentence is not lost on me 😝",
            "author": "P0sitiveViibes777",
            "id": "j3ocscy",
            "parent_id": "t1_j04tgjq",
            "score": 1,
            "created_utc": 1673306443.0,
            "replies": []
        },
        {
            "body": "Sadly, he lied about being married and then tried to skimp on our agreed upon allowance. So yeah ditched him quick after that.",
            "author": "Typical-Equivalent89",
            "id": "j04ldc0",
            "parent_id": "t1_j04jkgb",
            "score": 4,
            "created_utc": 1670979174.0,
            "replies": [
                {
                    "body": "Just gotta assume they are all married. Sorry to hear that",
                    "author": "malcolm_reyn0lds",
                    "id": "j04mmsb",
                    "parent_id": "t1_j04ldc0",
                    "score": 1,
                    "created_utc": 1670979742.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "😂 sorry but UNKNOWN, raw dick makes me nervous. I don’t care if it’s attached to Drake or\nPresident Obama! So the fact that some SDs demand it is crazy to me. Might as well go to a glory hole lol. Why is that deemed risky and gross but an untested partner isn’t? Just because you can see their face and you want to “believe” they’re safe or they “look” clean all of a sudden there’s less risk… hmmm",
            "author": "Typical-Equivalent89",
            "id": "j056ra4",
            "parent_id": "t1_j0551di",
            "score": 6,
            "created_utc": 1670989016.0,
            "replies": []
        },
        {
            "body": "I’m sorry to hear that 😔",
            "author": "Typical-Equivalent89",
            "id": "j07lbmu",
            "parent_id": "t1_j05iaj8",
            "score": 1,
            "created_utc": 1671038794.0,
            "replies": []
        },
        {
            "body": "Custom condoms? Myonecondoms.com",
            "author": "love_more88",
            "id": "j06u2hi",
            "parent_id": "t1_j05iaj8",
            "score": 1,
            "created_utc": 1671027877.0,
            "replies": [
                {
                    "body": "A friend of mine uses these for his unusually shaped cock, and has fantastic things to say about the company. His condoms are custom made just for him. In his case, he's very thick at the base, akin to a pyramid, and shared that normal condoms simply weren't working. His sex life changed happily for the better after custom condoms.",
                    "author": "BlueButterfly222SB",
                    "id": "j08c5nj",
                    "parent_id": "t1_j06u2hi",
                    "score": 2,
                    "created_utc": 1671048934.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Rule #4: No \"value for money\" discussion\n\nDiscussions about how to get the most value for your money are not allowed. Posts asking for or assigning a monetary value to sexual acts are not allowed. Assigning a monetary worth to individuals based on race, age, size,looks, etc., are not allowed. Posts about how much allowance/ppm to ask for, give, is average, for such and such area or situation, are no longer be allowed on SLF. Any posts with dollar amounts that are in reference to PPMs and/or allowances are no longer allowed.\n\nAlso see the [Allowance Master Thread](https://www.reddit.com/r/sugarlifestyleforum/comments/dezl91/allowance_master_thread_20192020/).",
            "author": "sugarlifestyleforum-ModTeam",
            "id": "j08bifa",
            "parent_id": "t1_j07vny9",
            "score": 1,
            "created_utc": 1671048704.0,
            "replies": []
        },
        {
            "body": "Wow, I’m sorry you’re going through this. Thank you for sharing your experience as so many in the comments like to pretend these situations aren’t happening in our community. I had a scare in my early 20’s before sugaring and since then it’s been a non-negotiable. Pleasure is temporary, we only get one body.",
            "author": "Typical-Equivalent89",
            "id": "j1emv1g",
            "parent_id": "t1_j0x1jtc",
            "score": 1,
            "created_utc": 1671822796.0,
            "replies": []
        },
        {
            "body": "Oh that's true. One time tho, I was clicking the off and on button and my wireless phone picked up a random conversation lol",
            "author": "thedoctor321",
            "id": "j092qny",
            "parent_id": "t1_j05gz3t",
            "score": 2,
            "created_utc": 1671059343.0,
            "replies": [
                {
                    "body": "Yep. Those were fun times! Its how found out the other neighbor talks to her dead mother too. \n\nEver since then, my Dad refused to get a wireless phone in the house. We still have a working rotary wall phone in the basement.",
                    "author": "MrRetrdO",
                    "id": "j0ajtqf",
                    "parent_id": "t1_j092qny",
                    "score": 2,
                    "created_utc": 1671085088.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "This is what I send to potential sds when we discuss protection. Bjs are covered and you can feel free to daty. Here’s why. \nBut it’s important to note, that this is purely for educational purposes, because if you’ve attempted to challenge my boundaries we’re not a match. I deal with respectful, polite men, or no one at all. Babies, I encourage you all to do the same.",
            "author": "Few-Dog-6206",
            "id": "j08b06i",
            "parent_id": "t1_j078w9n",
            "score": 6,
            "created_utc": 1671048518.0,
            "replies": [
                {
                    "body": "That's smart. Same here. I was naive and I gave someone oral when I was younger. Contracted God knows what but my doctor knew it was from oral and I had infections so bad for months they had to remove my tonsils. Never a-freaking-gain. It sucks (pun intended lol ) cus I like doing it too. I wish STDs just didn't exist.",
                    "author": "daddyangeldust",
                    "id": "j0afyqu",
                    "parent_id": "t1_j08b06i",
                    "score": 7,
                    "created_utc": 1671082576.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "THIS. Their post was really sad to me. Dehumanizing really. I have hsv2 that I got when I was young from my 2nd partner going down on me. I always tell partners/sugars beforehand because everyone deserves autonomy in their sexual health. I literally keep it in my profile that I have hsv2. That being said, there are MANY people who are willing to take that risk and not used condoms. It kind of baffles me, but at the same time I don’t hate it because well, I’m still getting laid and all the other fun sugar stuff. Everyone who requires testing and condoms is absolutely right.",
            "author": "Letmehearyourhaikus",
            "id": "j05uisk",
            "parent_id": "t1_j05p8rg",
            "score": 5,
            "created_utc": 1671003484.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "j06fk5m",
                    "parent_id": "t1_j05uisk",
                    "score": -1,
                    "created_utc": 1671020295.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Participating in sex at all and the lack of education on the matter is terrifying.",
            "author": "blndy2022",
            "id": "j073gek",
            "parent_id": "t1_j05p8rg",
            "score": 3,
            "created_utc": 1671031839.0,
            "replies": []
        },
        {
            "body": "STD discussion should be normalized, having STD’s and passing them around without a care in the world or not being STD tested between partners should NEVER be normalized. Not sharing your status should not be normalized. That is the entire point. I am not shaming anyone who has an STD. The lack of care about if you do or don’t have one is the issue and it’s disturbing. If you’re not taking care of your sexual health, if you haven’t been checked, if you don’t know and you’re engaging in sexual activity with someone it’s disgusting and should not be normalized. You’re risking not just your health but someone else’s. That’s not ok. That should not be normalized.",
            "author": "blndy2022",
            "id": "j0741ls",
            "parent_id": "t1_j05p07v",
            "score": 7,
            "created_utc": 1671032078.0,
            "replies": [
                {
                    "body": "Which is what I said",
                    "author": "Feisty_Rhubarb5402",
                    "id": "j0ncvm5",
                    "parent_id": "t1_j0741ls",
                    "score": 0,
                    "created_utc": 1671321154.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Right but you still can get it while using condom, I got it from my last SB I’m in treatment now, no sex for some time with or without condoms 🫤",
            "author": "RealBlondHunter",
            "id": "j0x484f",
            "parent_id": "t1_j0vbzze",
            "score": 1,
            "created_utc": 1671500647.0,
            "replies": [
                {
                    "body": "Treatment for HPV? That doesn’t exist unless you are talking about cancer treatment",
                    "author": "hotcollegegirl420",
                    "id": "j0xivcz",
                    "parent_id": "t1_j0x484f",
                    "score": 1,
                    "created_utc": 1671507407.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Oof, did I hit a nerve there?\n\nBut no off course not, they like it too! Everybody does!\n\nBut they like it because it feels better, not because they cannot perform with a condom.",
            "author": "A-touchofreality",
            "id": "j04mrie",
            "parent_id": "t1_j04gefd",
            "score": 6,
            "created_utc": 1670979804.0,
            "replies": [
                {
                    "body": "It’s cute that you think you can “hit a nerve.”  \n\n100% of men prefer natural sex for obvious reasons.  I’d expect a “sugar mentor” to understand this.",
                    "author": "tempsdforfuns",
                    "id": "j050v4a",
                    "parent_id": "t1_j04mrie",
                    "score": -6,
                    "created_utc": 1670986192.0,
                    "replies": [
                        {
                            "body": ">Everybody does!\n\nReading comprehension problems too?",
                            "author": "A-touchofreality",
                            "id": "j05zncz",
                            "parent_id": "t1_j050v4a",
                            "score": 5,
                            "created_utc": 1671007623.0,
                            "replies": [
                                {
                                    "body": "I… saw that comment?  You made a silly attempt to claim I have ED or something because I pointed out that we all like natural sex… even though you also pointed it out.  Your comment (like most of your “mentoring”) added no value.",
                                    "author": "tempsdforfuns",
                                    "id": "j06u5e1",
                                    "parent_id": "t1_j05zncz",
                                    "score": 2,
                                    "created_utc": 1671027913.0,
                                    "replies": [
                                        {
                                            "body": "The 'mentor' in my flair does seem to strike a nerve too, does it? How dare a *woman* call herself that!? /s\n\nI will leave it to the other participants to decide if my mentoring is adding value or not. If you don't like it, just skip it? Or even better, block me so you don't have to see my silly woman comments anymore?\n\nCheers!",
                                            "author": "A-touchofreality",
                                            "id": "j06vs1g",
                                            "parent_id": "t1_j06u5e1",
                                            "score": 2,
                                            "created_utc": 1671028636.0,
                                            "replies": [
                                                {
                                                    "body": "Anyone with the audacity to consider themselves a “sugar mentor” is very annoying, yes.  Not sure what your gender has to do with it.",
                                                    "author": "tempsdforfuns",
                                                    "id": "j08cysf",
                                                    "parent_id": "t1_j06vs1g",
                                                    "score": 2,
                                                    "created_utc": 1671049238.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "there's a vaccine for that",
            "author": "throwawaymeter",
            "id": "j084ocu",
            "parent_id": "t1_j05nruc",
            "score": 0,
            "created_utc": 1671046176.0,
            "replies": [
                {
                    "body": "Lol no, there’s a vaccine that *helps* protect against 9 of the 200+ strains, but does not even grant full immunity against those 9",
                    "author": "hotcollegegirl420",
                    "id": "j086wjg",
                    "parent_id": "t1_j084ocu",
                    "score": 5,
                    "created_utc": 1671047008.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "It can be tested for - at least a few of the strains. But finding a testing center that can do so..? I live outside a major metro area and tried valiantly to find testing options with a previous gentleman partner, to no avail. Sigh. But the tests do exist.",
            "author": "BlueButterfly222SB",
            "id": "j088c6p",
            "parent_id": "t1_j05nruc",
            "score": 0,
            "created_utc": 1671047537.0,
            "replies": [
                {
                    "body": "It can be tested for in women with Pap smears of the cervix only. There is no way to test for it at all in men!\n\n I work with HPV causing HELA cell cultures in a research lab. There is currently no way at all to test in men",
                    "author": "hotcollegegirl420",
                    "id": "j08sy0r",
                    "parent_id": "t1_j088c6p",
                    "score": 4,
                    "created_utc": 1671055279.0,
                    "replies": [
                        {
                            "body": "Oh no. I must have been misinformed. Sigh. I think we can all agree that we wish there was a test for both genders!",
                            "author": "BlueButterfly222SB",
                            "id": "j091xaf",
                            "parent_id": "t1_j08sy0r",
                            "score": 3,
                            "created_utc": 1671058999.0,
                            "replies": [
                                {
                                    "body": "Oh absolutely, I don’t quite understand why there isn’t and why it is so gender specific when all genders can clearly get and transmit it. But it’s horrifying how misinformed EVERYONE is about HPV, the risks are really underestimated",
                                    "author": "hotcollegegirl420",
                                    "id": "j095mk4",
                                    "parent_id": "t1_j091xaf",
                                    "score": 3,
                                    "created_utc": 1671060567.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "You’re always free to say no.",
            "author": "UnearthlyDinosaur",
            "id": "j0553gv",
            "parent_id": "t1_j04egvr",
            "score": -8,
            "created_utc": 1670988213.0,
            "replies": [
                {
                    "body": "And I do ☺️",
                    "author": "Typical-Equivalent89",
                    "id": "j056t08",
                    "parent_id": "t1_j0553gv",
                    "score": 19,
                    "created_utc": 1670989039.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "One, I’m sorry that happened to you. Horrible. Two, I hope your friend sees the error of her ways and starts being more responsible. Men and women need to be vigilant and protect each other.",
            "author": "Typical-Equivalent89",
            "id": "j04qz0u",
            "parent_id": "t1_j04mitg",
            "score": 7,
            "created_utc": 1670981701.0,
            "replies": [
                {
                    "body": "Agreed",
                    "author": "mistressita",
                    "id": "j06fyn3",
                    "parent_id": "t1_j04qz0u",
                    "score": 1,
                    "created_utc": 1671020548.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Ehh that's not going to really change anything for me. But sounds like you have a shitty friend.",
            "author": "BigBearSD",
            "id": "j04u14j",
            "parent_id": "t1_j04mitg",
            "score": 0,
            "created_utc": 1670983074.0,
            "replies": []
        },
        {
            "body": "No... no SD likes condom BJs.",
            "author": "BigBearSD",
            "id": "j04htav",
            "parent_id": "t1_j04hnsa",
            "score": 3,
            "created_utc": 1670977617.0,
            "replies": [
                {
                    "body": "lol. back to the title and subject of the original post. if it matters for anal, it matters for oral...",
                    "author": "AspiringSplendaBaby",
                    "id": "j04hwmj",
                    "parent_id": "t1_j04htav",
                    "score": 2,
                    "created_utc": 1670977658.0,
                    "replies": [
                        {
                            "body": "There's a significantly lower chance of catching an STI from unprotected oral than unprotected vaginal/anal (especially anal). So, it's not exactly accurate to say they should be weighed as equal risks: it doesn't necessarily follow that \"if it matters for anal, it matters for oral.\" \n\nIf someone is uncomfortable with taking on any level of risk and insists on condom use for all sex acts, I won't begrudge them that viewpoint at all. But the risk levels are not equal in allowing a new SD to slip PiV bareback vs giving them an uncovered BJ. Statistically, the former is far more reckless than the latter. Again, if it's still out of range of someone's risk tolerance, then certainly don't do either.",
                            "author": "Intrepid_Egg_7722",
                            "id": "j055vz7",
                            "parent_id": "t1_j04hwmj",
                            "score": 2,
                            "created_utc": 1670988596.0,
                            "replies": [
                                {
                                    "body": "that's fair.",
                                    "author": "AspiringSplendaBaby",
                                    "id": "j057iyy",
                                    "parent_id": "t1_j055vz7",
                                    "score": 3,
                                    "created_utc": 1670989395.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Blame it on the spider plant.",
            "author": "highfructoseSD",
            "id": "j05oj1j",
            "parent_id": "t1_j05ibed",
            "score": 1,
            "created_utc": 1670999045.0,
            "replies": [
                {
                    "body": ":D",
                    "author": "idontlikespiderplant",
                    "id": "j0z1qc0",
                    "parent_id": "t1_j05oj1j",
                    "score": 1,
                    "created_utc": 1671544819.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Sex worker since 17.",
            "author": "idontlikespiderplant",
            "id": "j0z1pa1",
            "parent_id": "t1_j05ibed",
            "score": 1,
            "created_utc": 1671544804.0,
            "replies": []
        },
        {
            "body": "Agreed! I’ve had SB’s pull the condom off of me because they wanted me to have sex with them raw.",
            "author": "NewYorkSD",
            "id": "j04694c",
            "parent_id": "t1_j0464xh",
            "score": 2,
            "created_utc": 1670972679.0,
            "replies": [
                {
                    "body": "This whole condom thing is becoming a shaming tactic for SDs.\n\nAbout 80% of my past SBs were ok with no condom on the first date.",
                    "author": "UnearthlyDinosaur",
                    "id": "j055agk",
                    "parent_id": "t1_j04694c",
                    "score": 2,
                    "created_utc": 1670988306.0,
                    "replies": [
                        {
                            "body": "Agreed, I’d say my experience is almost identical, 80-90% are perfectly fine with no condoms, and that 10-20% is for birth control.  Several who were not on birth control were fine with pulling out.  As much as I despise condoms, I’ve been the one requiring them more than my SBs",
                            "author": "blk-tye",
                            "id": "j05rrvl",
                            "parent_id": "t1_j055agk",
                            "score": 0,
                            "created_utc": 1671001372.0,
                            "replies": []
                        },
                        {
                            "body": "Agreed. We see this same type of post all the time.",
                            "author": "NewYorkSD",
                            "id": "j055dvu",
                            "parent_id": "t1_j055agk",
                            "score": 0,
                            "created_utc": 1670988353.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "It’s all fun and games until you have genital warts but you two carry on lol. Did you not just see the post stating someone who knowingly has HPV continues to have unprotected sex and not disclose their status to their partners?! Hope you stay safe and disease free.",
            "author": "Typical-Equivalent89",
            "id": "j058rxg",
            "parent_id": "t1_j055608",
            "score": 10,
            "created_utc": 1670990015.0,
            "replies": [
                {
                    "body": "That part.\n\nAnd she’s not even a shitty person - she was raped at an early and lets guys do it because she goes into fight or flight mode and freezes in the moment and allows it.  \n\nLiterally, the very next woman those guys sleep with is at risk for HPV.  It’s like playing Russian Roulette with your health - and I promise when an SB is having full reconstruction in her reproductive parts, SD will not be standing by her.",
                    "author": "mistressita",
                    "id": "j06fv0k",
                    "parent_id": "t1_j058rxg",
                    "score": 3,
                    "created_utc": 1671020485.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Op is a victim because men want to have sex with her without wearing a condom? That definition would make all women victims lol",
            "author": "chemistryromance",
            "id": "j07jk0w",
            "parent_id": "t1_j075dw8",
            "score": -1,
            "created_utc": 1671038124.0,
            "replies": [
                {
                    "body": "No. I’m saying the person that is bitching to her about why she shouldn’t be upset, is a problem. It’s assholes like YOU that are the problem. Do better.",
                    "author": null,
                    "id": "j08bqx4",
                    "parent_id": "t1_j07jk0w",
                    "score": 2,
                    "created_utc": 1671048790.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "To be honest, I hate these kind of provocative posts because it pitches SBs against SDs and starts a 'Us vs Them' argument.",
            "author": "chemistryromance",
            "id": "j04hawt",
            "parent_id": "t1_j04cbx9",
            "score": 1,
            "created_utc": 1670977397.0,
            "replies": [
                {
                    "body": "OP is just a man hater it seems.\n\nI’ve had plenty of SBs ask me for xxxx before we even have intimacy but I’m not on SLF whining about it. I just said “no.”",
                    "author": "UnearthlyDinosaur",
                    "id": "j055j70",
                    "parent_id": "t1_j04hawt",
                    "score": -4,
                    "created_utc": 1670988425.0,
                    "replies": [
                        {
                            "body": "I know right.",
                            "author": "chemistryromance",
                            "id": "j05y4os",
                            "parent_id": "t1_j055j70",
                            "score": -5,
                            "created_utc": 1671006370.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "SDs are less adamant about condomless sex tha. SBs. You may not like to hear it but raw is really more the norm in SR. Maybe your post should have just been a vent about raw rather than blaming men when it’s kinda the opposite most of the time",
            "author": "Gold-Leading3602",
            "id": "j3eq9xt",
            "parent_id": "t1_j04cbx9",
            "score": 1,
            "created_utc": 1673140361.0,
            "replies": [
                {
                    "body": "Maybe it’s the opposite based on your experiences and point of view, definitely not the case on my side of the fence.",
                    "author": "Typical-Equivalent89",
                    "id": "j3fdfqa",
                    "parent_id": "t1_j3eq9xt",
                    "score": 1,
                    "created_utc": 1673150851.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Most research is biased and highly subjective and not really that conducive of real world scenarios as only select types of people are chosen and willing to participate, you can draw multiple positive or negative conclusion you want from results. The baseline (people outside of sugar dating) are likely to be of the more monogamous types, and less likely to be the type that sleep around a lot recklessly.\n\nBut if you're looking for an article... [https://pubmed.ncbi.nlm.nih.gov/34410199/](https://pubmed.ncbi.nlm.nih.gov/34410199/)\n\n>\"sugar dating women were twice as likely to have been diagnosed with an STI but were more than six times as likely to have been tested for STIs.\"\n\nSix times more likely to have been tested for STI's with only twice as high of diagnosed cases... if you were to have everyone else who was sexually active and in a casual sex/dating based lifestyles I guarantee you will find much more than two times the cases with six times the tests being conducted. Same with covid, the more they tested the more positive cases were found and the more the panic ensued. Therefore, sugar dating is actually lower or at least on par with the rates of casual dating, and people are actually more concerned about testing and ensuring safety.",
            "author": "dapperswaggered",
            "id": "j04pvj3",
            "parent_id": "t1_j04cwrf",
            "score": 0,
            "created_utc": 1670981198.0,
            "replies": [
                {
                    "body": "Got it, so there isn’t legit research stating majority of sugar relationships occur without any STD related issues that you could find. Thank you for doing that labor. The article you did find was an interesting read.",
                    "author": "Typical-Equivalent89",
                    "id": "j0584mp",
                    "parent_id": "t1_j04pvj3",
                    "score": 2,
                    "created_utc": 1670989696.0,
                    "replies": [
                        {
                            "body": "Is there any research to indicate that sugar dating leads to higher rates compared to vanilla and with similar large pool sizes of people with similar backgrounds and lifestyles and similar rates of testing? Didn’t think so. Clearly don’t know how to comprehend or are one to presume worse case scenarios or are a hypochondriac. Thanks for the rant.",
                            "author": "dapperswaggered",
                            "id": "j05pyji",
                            "parent_id": "t1_j0584mp",
                            "score": 0,
                            "created_utc": 1671000052.0,
                            "replies": [
                                {
                                    "body": "Please, that’s what this forum is for. It’s full of rants and complaints. You were spewing your opinions as facts and couldn’t back up your claims. That’s it, that’s all. Finding something related and making correlations doesn’t count.",
                                    "author": "Typical-Equivalent89",
                                    "id": "j07q0jn",
                                    "parent_id": "t1_j05pyji",
                                    "score": 2,
                                    "created_utc": 1671040573.0,
                                    "replies": [
                                        {
                                            "body": "It's not just an opinion, it's based on personal experience and also what's reflected often among this forum where people treat sugar dating more like actual dating with a long term partner and where unprotected sex is implied.\n\nWith your statement \"isn’t sugaring a form of sex work?\" you clearly should be more concerned about protection and only looking for those who will always feel the same way, but there are plenty of us who do treat it more like a long term relationship and the risks are pretty low but obviously always present.",
                                            "author": "dapperswaggered",
                                            "id": "j08jfea",
                                            "parent_id": "t1_j07q0jn",
                                            "score": 2,
                                            "created_utc": 1671051636.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Just gotta assume they are all married. Sorry to hear that",
            "author": "malcolm_reyn0lds",
            "id": "j04mmsb",
            "parent_id": "t1_j04ldc0",
            "score": 1,
            "created_utc": 1670979742.0,
            "replies": []
        },
        {
            "body": "A friend of mine uses these for his unusually shaped cock, and has fantastic things to say about the company. His condoms are custom made just for him. In his case, he's very thick at the base, akin to a pyramid, and shared that normal condoms simply weren't working. His sex life changed happily for the better after custom condoms.",
            "author": "BlueButterfly222SB",
            "id": "j08c5nj",
            "parent_id": "t1_j06u2hi",
            "score": 2,
            "created_utc": 1671048934.0,
            "replies": []
        },
        {
            "body": "Yep. Those were fun times! Its how found out the other neighbor talks to her dead mother too. \n\nEver since then, my Dad refused to get a wireless phone in the house. We still have a working rotary wall phone in the basement.",
            "author": "MrRetrdO",
            "id": "j0ajtqf",
            "parent_id": "t1_j092qny",
            "score": 2,
            "created_utc": 1671085088.0,
            "replies": []
        },
        {
            "body": "That's smart. Same here. I was naive and I gave someone oral when I was younger. Contracted God knows what but my doctor knew it was from oral and I had infections so bad for months they had to remove my tonsils. Never a-freaking-gain. It sucks (pun intended lol ) cus I like doing it too. I wish STDs just didn't exist.",
            "author": "daddyangeldust",
            "id": "j0afyqu",
            "parent_id": "t1_j08b06i",
            "score": 7,
            "created_utc": 1671082576.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "j06fk5m",
            "parent_id": "t1_j05uisk",
            "score": -1,
            "created_utc": 1671020295.0,
            "replies": []
        },
        {
            "body": "Which is what I said",
            "author": "Feisty_Rhubarb5402",
            "id": "j0ncvm5",
            "parent_id": "t1_j0741ls",
            "score": 0,
            "created_utc": 1671321154.0,
            "replies": []
        },
        {
            "body": "Treatment for HPV? That doesn’t exist unless you are talking about cancer treatment",
            "author": "hotcollegegirl420",
            "id": "j0xivcz",
            "parent_id": "t1_j0x484f",
            "score": 1,
            "created_utc": 1671507407.0,
            "replies": []
        },
        {
            "body": "It’s cute that you think you can “hit a nerve.”  \n\n100% of men prefer natural sex for obvious reasons.  I’d expect a “sugar mentor” to understand this.",
            "author": "tempsdforfuns",
            "id": "j050v4a",
            "parent_id": "t1_j04mrie",
            "score": -6,
            "created_utc": 1670986192.0,
            "replies": [
                {
                    "body": ">Everybody does!\n\nReading comprehension problems too?",
                    "author": "A-touchofreality",
                    "id": "j05zncz",
                    "parent_id": "t1_j050v4a",
                    "score": 5,
                    "created_utc": 1671007623.0,
                    "replies": [
                        {
                            "body": "I… saw that comment?  You made a silly attempt to claim I have ED or something because I pointed out that we all like natural sex… even though you also pointed it out.  Your comment (like most of your “mentoring”) added no value.",
                            "author": "tempsdforfuns",
                            "id": "j06u5e1",
                            "parent_id": "t1_j05zncz",
                            "score": 2,
                            "created_utc": 1671027913.0,
                            "replies": [
                                {
                                    "body": "The 'mentor' in my flair does seem to strike a nerve too, does it? How dare a *woman* call herself that!? /s\n\nI will leave it to the other participants to decide if my mentoring is adding value or not. If you don't like it, just skip it? Or even better, block me so you don't have to see my silly woman comments anymore?\n\nCheers!",
                                    "author": "A-touchofreality",
                                    "id": "j06vs1g",
                                    "parent_id": "t1_j06u5e1",
                                    "score": 2,
                                    "created_utc": 1671028636.0,
                                    "replies": [
                                        {
                                            "body": "Anyone with the audacity to consider themselves a “sugar mentor” is very annoying, yes.  Not sure what your gender has to do with it.",
                                            "author": "tempsdforfuns",
                                            "id": "j08cysf",
                                            "parent_id": "t1_j06vs1g",
                                            "score": 2,
                                            "created_utc": 1671049238.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Lol no, there’s a vaccine that *helps* protect against 9 of the 200+ strains, but does not even grant full immunity against those 9",
            "author": "hotcollegegirl420",
            "id": "j086wjg",
            "parent_id": "t1_j084ocu",
            "score": 5,
            "created_utc": 1671047008.0,
            "replies": []
        },
        {
            "body": "It can be tested for in women with Pap smears of the cervix only. There is no way to test for it at all in men!\n\n I work with HPV causing HELA cell cultures in a research lab. There is currently no way at all to test in men",
            "author": "hotcollegegirl420",
            "id": "j08sy0r",
            "parent_id": "t1_j088c6p",
            "score": 4,
            "created_utc": 1671055279.0,
            "replies": [
                {
                    "body": "Oh no. I must have been misinformed. Sigh. I think we can all agree that we wish there was a test for both genders!",
                    "author": "BlueButterfly222SB",
                    "id": "j091xaf",
                    "parent_id": "t1_j08sy0r",
                    "score": 3,
                    "created_utc": 1671058999.0,
                    "replies": [
                        {
                            "body": "Oh absolutely, I don’t quite understand why there isn’t and why it is so gender specific when all genders can clearly get and transmit it. But it’s horrifying how misinformed EVERYONE is about HPV, the risks are really underestimated",
                            "author": "hotcollegegirl420",
                            "id": "j095mk4",
                            "parent_id": "t1_j091xaf",
                            "score": 3,
                            "created_utc": 1671060567.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "And I do ☺️",
            "author": "Typical-Equivalent89",
            "id": "j056t08",
            "parent_id": "t1_j0553gv",
            "score": 19,
            "created_utc": 1670989039.0,
            "replies": []
        },
        {
            "body": "Agreed",
            "author": "mistressita",
            "id": "j06fyn3",
            "parent_id": "t1_j04qz0u",
            "score": 1,
            "created_utc": 1671020548.0,
            "replies": []
        },
        {
            "body": "lol. back to the title and subject of the original post. if it matters for anal, it matters for oral...",
            "author": "AspiringSplendaBaby",
            "id": "j04hwmj",
            "parent_id": "t1_j04htav",
            "score": 2,
            "created_utc": 1670977658.0,
            "replies": [
                {
                    "body": "There's a significantly lower chance of catching an STI from unprotected oral than unprotected vaginal/anal (especially anal). So, it's not exactly accurate to say they should be weighed as equal risks: it doesn't necessarily follow that \"if it matters for anal, it matters for oral.\" \n\nIf someone is uncomfortable with taking on any level of risk and insists on condom use for all sex acts, I won't begrudge them that viewpoint at all. But the risk levels are not equal in allowing a new SD to slip PiV bareback vs giving them an uncovered BJ. Statistically, the former is far more reckless than the latter. Again, if it's still out of range of someone's risk tolerance, then certainly don't do either.",
                    "author": "Intrepid_Egg_7722",
                    "id": "j055vz7",
                    "parent_id": "t1_j04hwmj",
                    "score": 2,
                    "created_utc": 1670988596.0,
                    "replies": [
                        {
                            "body": "that's fair.",
                            "author": "AspiringSplendaBaby",
                            "id": "j057iyy",
                            "parent_id": "t1_j055vz7",
                            "score": 3,
                            "created_utc": 1670989395.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": ":D",
            "author": "idontlikespiderplant",
            "id": "j0z1qc0",
            "parent_id": "t1_j05oj1j",
            "score": 1,
            "created_utc": 1671544819.0,
            "replies": []
        },
        {
            "body": "This whole condom thing is becoming a shaming tactic for SDs.\n\nAbout 80% of my past SBs were ok with no condom on the first date.",
            "author": "UnearthlyDinosaur",
            "id": "j055agk",
            "parent_id": "t1_j04694c",
            "score": 2,
            "created_utc": 1670988306.0,
            "replies": [
                {
                    "body": "Agreed, I’d say my experience is almost identical, 80-90% are perfectly fine with no condoms, and that 10-20% is for birth control.  Several who were not on birth control were fine with pulling out.  As much as I despise condoms, I’ve been the one requiring them more than my SBs",
                    "author": "blk-tye",
                    "id": "j05rrvl",
                    "parent_id": "t1_j055agk",
                    "score": 0,
                    "created_utc": 1671001372.0,
                    "replies": []
                },
                {
                    "body": "Agreed. We see this same type of post all the time.",
                    "author": "NewYorkSD",
                    "id": "j055dvu",
                    "parent_id": "t1_j055agk",
                    "score": 0,
                    "created_utc": 1670988353.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "That part.\n\nAnd she’s not even a shitty person - she was raped at an early and lets guys do it because she goes into fight or flight mode and freezes in the moment and allows it.  \n\nLiterally, the very next woman those guys sleep with is at risk for HPV.  It’s like playing Russian Roulette with your health - and I promise when an SB is having full reconstruction in her reproductive parts, SD will not be standing by her.",
            "author": "mistressita",
            "id": "j06fv0k",
            "parent_id": "t1_j058rxg",
            "score": 3,
            "created_utc": 1671020485.0,
            "replies": []
        },
        {
            "body": "No. I’m saying the person that is bitching to her about why she shouldn’t be upset, is a problem. It’s assholes like YOU that are the problem. Do better.",
            "author": null,
            "id": "j08bqx4",
            "parent_id": "t1_j07jk0w",
            "score": 2,
            "created_utc": 1671048790.0,
            "replies": []
        },
        {
            "body": "OP is just a man hater it seems.\n\nI’ve had plenty of SBs ask me for xxxx before we even have intimacy but I’m not on SLF whining about it. I just said “no.”",
            "author": "UnearthlyDinosaur",
            "id": "j055j70",
            "parent_id": "t1_j04hawt",
            "score": -4,
            "created_utc": 1670988425.0,
            "replies": [
                {
                    "body": "I know right.",
                    "author": "chemistryromance",
                    "id": "j05y4os",
                    "parent_id": "t1_j055j70",
                    "score": -5,
                    "created_utc": 1671006370.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Maybe it’s the opposite based on your experiences and point of view, definitely not the case on my side of the fence.",
            "author": "Typical-Equivalent89",
            "id": "j3fdfqa",
            "parent_id": "t1_j3eq9xt",
            "score": 1,
            "created_utc": 1673150851.0,
            "replies": []
        },
        {
            "body": "Got it, so there isn’t legit research stating majority of sugar relationships occur without any STD related issues that you could find. Thank you for doing that labor. The article you did find was an interesting read.",
            "author": "Typical-Equivalent89",
            "id": "j0584mp",
            "parent_id": "t1_j04pvj3",
            "score": 2,
            "created_utc": 1670989696.0,
            "replies": [
                {
                    "body": "Is there any research to indicate that sugar dating leads to higher rates compared to vanilla and with similar large pool sizes of people with similar backgrounds and lifestyles and similar rates of testing? Didn’t think so. Clearly don’t know how to comprehend or are one to presume worse case scenarios or are a hypochondriac. Thanks for the rant.",
                    "author": "dapperswaggered",
                    "id": "j05pyji",
                    "parent_id": "t1_j0584mp",
                    "score": 0,
                    "created_utc": 1671000052.0,
                    "replies": [
                        {
                            "body": "Please, that’s what this forum is for. It’s full of rants and complaints. You were spewing your opinions as facts and couldn’t back up your claims. That’s it, that’s all. Finding something related and making correlations doesn’t count.",
                            "author": "Typical-Equivalent89",
                            "id": "j07q0jn",
                            "parent_id": "t1_j05pyji",
                            "score": 2,
                            "created_utc": 1671040573.0,
                            "replies": [
                                {
                                    "body": "It's not just an opinion, it's based on personal experience and also what's reflected often among this forum where people treat sugar dating more like actual dating with a long term partner and where unprotected sex is implied.\n\nWith your statement \"isn’t sugaring a form of sex work?\" you clearly should be more concerned about protection and only looking for those who will always feel the same way, but there are plenty of us who do treat it more like a long term relationship and the risks are pretty low but obviously always present.",
                                    "author": "dapperswaggered",
                                    "id": "j08jfea",
                                    "parent_id": "t1_j07q0jn",
                                    "score": 2,
                                    "created_utc": 1671051636.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": ">Everybody does!\n\nReading comprehension problems too?",
            "author": "A-touchofreality",
            "id": "j05zncz",
            "parent_id": "t1_j050v4a",
            "score": 5,
            "created_utc": 1671007623.0,
            "replies": [
                {
                    "body": "I… saw that comment?  You made a silly attempt to claim I have ED or something because I pointed out that we all like natural sex… even though you also pointed it out.  Your comment (like most of your “mentoring”) added no value.",
                    "author": "tempsdforfuns",
                    "id": "j06u5e1",
                    "parent_id": "t1_j05zncz",
                    "score": 2,
                    "created_utc": 1671027913.0,
                    "replies": [
                        {
                            "body": "The 'mentor' in my flair does seem to strike a nerve too, does it? How dare a *woman* call herself that!? /s\n\nI will leave it to the other participants to decide if my mentoring is adding value or not. If you don't like it, just skip it? Or even better, block me so you don't have to see my silly woman comments anymore?\n\nCheers!",
                            "author": "A-touchofreality",
                            "id": "j06vs1g",
                            "parent_id": "t1_j06u5e1",
                            "score": 2,
                            "created_utc": 1671028636.0,
                            "replies": [
                                {
                                    "body": "Anyone with the audacity to consider themselves a “sugar mentor” is very annoying, yes.  Not sure what your gender has to do with it.",
                                    "author": "tempsdforfuns",
                                    "id": "j08cysf",
                                    "parent_id": "t1_j06vs1g",
                                    "score": 2,
                                    "created_utc": 1671049238.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Oh no. I must have been misinformed. Sigh. I think we can all agree that we wish there was a test for both genders!",
            "author": "BlueButterfly222SB",
            "id": "j091xaf",
            "parent_id": "t1_j08sy0r",
            "score": 3,
            "created_utc": 1671058999.0,
            "replies": [
                {
                    "body": "Oh absolutely, I don’t quite understand why there isn’t and why it is so gender specific when all genders can clearly get and transmit it. But it’s horrifying how misinformed EVERYONE is about HPV, the risks are really underestimated",
                    "author": "hotcollegegirl420",
                    "id": "j095mk4",
                    "parent_id": "t1_j091xaf",
                    "score": 3,
                    "created_utc": 1671060567.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "There's a significantly lower chance of catching an STI from unprotected oral than unprotected vaginal/anal (especially anal). So, it's not exactly accurate to say they should be weighed as equal risks: it doesn't necessarily follow that \"if it matters for anal, it matters for oral.\" \n\nIf someone is uncomfortable with taking on any level of risk and insists on condom use for all sex acts, I won't begrudge them that viewpoint at all. But the risk levels are not equal in allowing a new SD to slip PiV bareback vs giving them an uncovered BJ. Statistically, the former is far more reckless than the latter. Again, if it's still out of range of someone's risk tolerance, then certainly don't do either.",
            "author": "Intrepid_Egg_7722",
            "id": "j055vz7",
            "parent_id": "t1_j04hwmj",
            "score": 2,
            "created_utc": 1670988596.0,
            "replies": [
                {
                    "body": "that's fair.",
                    "author": "AspiringSplendaBaby",
                    "id": "j057iyy",
                    "parent_id": "t1_j055vz7",
                    "score": 3,
                    "created_utc": 1670989395.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Agreed, I’d say my experience is almost identical, 80-90% are perfectly fine with no condoms, and that 10-20% is for birth control.  Several who were not on birth control were fine with pulling out.  As much as I despise condoms, I’ve been the one requiring them more than my SBs",
            "author": "blk-tye",
            "id": "j05rrvl",
            "parent_id": "t1_j055agk",
            "score": 0,
            "created_utc": 1671001372.0,
            "replies": []
        },
        {
            "body": "Agreed. We see this same type of post all the time.",
            "author": "NewYorkSD",
            "id": "j055dvu",
            "parent_id": "t1_j055agk",
            "score": 0,
            "created_utc": 1670988353.0,
            "replies": []
        },
        {
            "body": "I know right.",
            "author": "chemistryromance",
            "id": "j05y4os",
            "parent_id": "t1_j055j70",
            "score": -5,
            "created_utc": 1671006370.0,
            "replies": []
        },
        {
            "body": "Is there any research to indicate that sugar dating leads to higher rates compared to vanilla and with similar large pool sizes of people with similar backgrounds and lifestyles and similar rates of testing? Didn’t think so. Clearly don’t know how to comprehend or are one to presume worse case scenarios or are a hypochondriac. Thanks for the rant.",
            "author": "dapperswaggered",
            "id": "j05pyji",
            "parent_id": "t1_j0584mp",
            "score": 0,
            "created_utc": 1671000052.0,
            "replies": [
                {
                    "body": "Please, that’s what this forum is for. It’s full of rants and complaints. You were spewing your opinions as facts and couldn’t back up your claims. That’s it, that’s all. Finding something related and making correlations doesn’t count.",
                    "author": "Typical-Equivalent89",
                    "id": "j07q0jn",
                    "parent_id": "t1_j05pyji",
                    "score": 2,
                    "created_utc": 1671040573.0,
                    "replies": [
                        {
                            "body": "It's not just an opinion, it's based on personal experience and also what's reflected often among this forum where people treat sugar dating more like actual dating with a long term partner and where unprotected sex is implied.\n\nWith your statement \"isn’t sugaring a form of sex work?\" you clearly should be more concerned about protection and only looking for those who will always feel the same way, but there are plenty of us who do treat it more like a long term relationship and the risks are pretty low but obviously always present.",
                            "author": "dapperswaggered",
                            "id": "j08jfea",
                            "parent_id": "t1_j07q0jn",
                            "score": 2,
                            "created_utc": 1671051636.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I… saw that comment?  You made a silly attempt to claim I have ED or something because I pointed out that we all like natural sex… even though you also pointed it out.  Your comment (like most of your “mentoring”) added no value.",
            "author": "tempsdforfuns",
            "id": "j06u5e1",
            "parent_id": "t1_j05zncz",
            "score": 2,
            "created_utc": 1671027913.0,
            "replies": [
                {
                    "body": "The 'mentor' in my flair does seem to strike a nerve too, does it? How dare a *woman* call herself that!? /s\n\nI will leave it to the other participants to decide if my mentoring is adding value or not. If you don't like it, just skip it? Or even better, block me so you don't have to see my silly woman comments anymore?\n\nCheers!",
                    "author": "A-touchofreality",
                    "id": "j06vs1g",
                    "parent_id": "t1_j06u5e1",
                    "score": 2,
                    "created_utc": 1671028636.0,
                    "replies": [
                        {
                            "body": "Anyone with the audacity to consider themselves a “sugar mentor” is very annoying, yes.  Not sure what your gender has to do with it.",
                            "author": "tempsdforfuns",
                            "id": "j08cysf",
                            "parent_id": "t1_j06vs1g",
                            "score": 2,
                            "created_utc": 1671049238.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Oh absolutely, I don’t quite understand why there isn’t and why it is so gender specific when all genders can clearly get and transmit it. But it’s horrifying how misinformed EVERYONE is about HPV, the risks are really underestimated",
            "author": "hotcollegegirl420",
            "id": "j095mk4",
            "parent_id": "t1_j091xaf",
            "score": 3,
            "created_utc": 1671060567.0,
            "replies": []
        },
        {
            "body": "that's fair.",
            "author": "AspiringSplendaBaby",
            "id": "j057iyy",
            "parent_id": "t1_j055vz7",
            "score": 3,
            "created_utc": 1670989395.0,
            "replies": []
        },
        {
            "body": "Please, that’s what this forum is for. It’s full of rants and complaints. You were spewing your opinions as facts and couldn’t back up your claims. That’s it, that’s all. Finding something related and making correlations doesn’t count.",
            "author": "Typical-Equivalent89",
            "id": "j07q0jn",
            "parent_id": "t1_j05pyji",
            "score": 2,
            "created_utc": 1671040573.0,
            "replies": [
                {
                    "body": "It's not just an opinion, it's based on personal experience and also what's reflected often among this forum where people treat sugar dating more like actual dating with a long term partner and where unprotected sex is implied.\n\nWith your statement \"isn’t sugaring a form of sex work?\" you clearly should be more concerned about protection and only looking for those who will always feel the same way, but there are plenty of us who do treat it more like a long term relationship and the risks are pretty low but obviously always present.",
                    "author": "dapperswaggered",
                    "id": "j08jfea",
                    "parent_id": "t1_j07q0jn",
                    "score": 2,
                    "created_utc": 1671051636.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "The 'mentor' in my flair does seem to strike a nerve too, does it? How dare a *woman* call herself that!? /s\n\nI will leave it to the other participants to decide if my mentoring is adding value or not. If you don't like it, just skip it? Or even better, block me so you don't have to see my silly woman comments anymore?\n\nCheers!",
            "author": "A-touchofreality",
            "id": "j06vs1g",
            "parent_id": "t1_j06u5e1",
            "score": 2,
            "created_utc": 1671028636.0,
            "replies": [
                {
                    "body": "Anyone with the audacity to consider themselves a “sugar mentor” is very annoying, yes.  Not sure what your gender has to do with it.",
                    "author": "tempsdforfuns",
                    "id": "j08cysf",
                    "parent_id": "t1_j06vs1g",
                    "score": 2,
                    "created_utc": 1671049238.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "It's not just an opinion, it's based on personal experience and also what's reflected often among this forum where people treat sugar dating more like actual dating with a long term partner and where unprotected sex is implied.\n\nWith your statement \"isn’t sugaring a form of sex work?\" you clearly should be more concerned about protection and only looking for those who will always feel the same way, but there are plenty of us who do treat it more like a long term relationship and the risks are pretty low but obviously always present.",
            "author": "dapperswaggered",
            "id": "j08jfea",
            "parent_id": "t1_j07q0jn",
            "score": 2,
            "created_utc": 1671051636.0,
            "replies": []
        },
        {
            "body": "Anyone with the audacity to consider themselves a “sugar mentor” is very annoying, yes.  Not sure what your gender has to do with it.",
            "author": "tempsdforfuns",
            "id": "j08cysf",
            "parent_id": "t1_j06vs1g",
            "score": 2,
            "created_utc": 1671049238.0,
            "replies": []
        }
    ]
}