{
    "title": "Ghosted and Stood Up",
    "post_id": "nhtsjr",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/nhtsjr/ghosted_and_stood_up/",
    "author": "UnspokenRequest",
    "body": "Wow does being ghosted and stood up suck. Had a \ngreat M&G last week.  Set up 2nd date for last night and I show up to the restaurant and get our seat.  She warned me she would be a little late.  Well she never showed up or messaged and still hasn't.  Obviously first thought is I hope nothing has happened to her but she logged on to SA this morning.  So my guess she found someone else. \n\nWhy can't people just be adults and just tell someone they aren't interested. That's so much better than being ignored.",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/nhtsjr/ghosted_and_stood_up/",
    "score": 129,
    "upvote_ratio": 0.98,
    "created_utc": 1621607163.0,
    "num_comments": 54,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "This is an example of why I go to the bar to wait.  If they don't show, I'll have a few drinks and chat to those around me, haha.",
            "author": "sinvortex",
            "id": "gyygzlx",
            "parent_id": "t3_nhtsjr",
            "score": 48,
            "created_utc": 1621613360.0,
            "replies": [
                {
                    "body": "^ this. M&G at the bar and convert to apps, then dinner if it’s going great. Stood up at actual date is super harsh",
                    "author": "daddoms",
                    "id": "gyyozoc",
                    "parent_id": "t1_gyygzlx",
                    "score": 18,
                    "created_utc": 1621616931.0,
                    "replies": []
                },
                {
                    "body": "This will be my plan going forward",
                    "author": "UnspokenRequest",
                    "id": "gyyh5zs",
                    "parent_id": "t1_gyygzlx",
                    "score": 9,
                    "created_utc": 1621613442.0,
                    "replies": []
                },
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "gyz2xov",
                    "parent_id": "t1_gyygzlx",
                    "score": 5,
                    "created_utc": 1621623216.0,
                    "replies": [
                        {
                            "body": "I've only had one stand me up, and in all my years of doing this, thats pretty good.  But I find it awkward just sitting alone at a table in the middle of a dining room anyways, and my comfort zone is the bar area, haha.",
                            "author": "sinvortex",
                            "id": "gyz9f6z",
                            "parent_id": "t1_gyz2xov",
                            "score": 3,
                            "created_utc": 1621626249.0,
                            "replies": []
                        },
                        {
                            "body": "I'm always nervous meeting a POT for the first time but that's why I take precautions like telling a friend that I'm going on a date and that I'll let her know I'm okay.",
                            "author": "TwoInSympathy",
                            "id": "gz01g4o",
                            "parent_id": "t1_gyz2xov",
                            "score": 2,
                            "created_utc": 1621640164.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Wow this LITERALLY just happened to me yesterday! We were supposed to meet for coffee at 11 and I had told him the day before I might have to raincheck because I only had a half tank of gas that needed to last me the rest of the week. He said no no, I’ve got some cash for you, please come anyway and I even asked are you sure because this is first meeting and he insisted. I sent him a message apologizing because I was running late due to some unexpected traffic but I was on my way (it’s an hour drive for me). He doesn’t respond or read it. I get there at 11:20 and message him again, hey I just pulled in, are you here? Walk in, get myself a green tea, look around, nope. Message again, still doesn’t read it. I stayed there for 3 hours and decided to leave. Never been stood up before like that. Messaged him saying I hope he is okay and hopes nothing serious has happened. He’s always had his status hidden so I don’t know if he’s been online but he certainly hasn’t read my messages. \n\nNow I’m worried about meeting long distance because if they just decide not to show it’s costing me which is the total opposite of the point here. I was lookin so cute too 🥲 favorite little black heels and all 🥲",
            "author": "wishinteen15",
            "id": "gyyg57w",
            "parent_id": "t3_nhtsjr",
            "score": 14,
            "created_utc": 1621612978.0,
            "replies": [
                {
                    "body": "I’m just curious... why wait three hours? For me it’s 20 minutes before I leave when someone doesn’t communicate... am I too hasty?",
                    "author": null,
                    "id": "gyyj6b1",
                    "parent_id": "t1_gyyg57w",
                    "score": 13,
                    "created_utc": 1621614345.0,
                    "replies": [
                        {
                            "body": "No that’s a good question. It was a cute little coffee shop next to some water. I stayed for myself but also in waiting. I decided wellp, if I’m gonna get stood up I might as well enjoy the view 😅",
                            "author": "wishinteen15",
                            "id": "gyyjh1x",
                            "parent_id": "t1_gyyj6b1",
                            "score": 12,
                            "created_utc": 1621614480.0,
                            "replies": [
                                {
                                    "body": "If you chose to stay for yourself, I completely understand and support that. However please never wait more than 30mins for someone you haven't heard from. You deserve SO much better. Good luck in the future 💜",
                                    "author": "Heartless_Weeknd",
                                    "id": "gyzn7sb",
                                    "parent_id": "t1_gyyjh1x",
                                    "score": 16,
                                    "created_utc": 1621632887.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "The single most infuriating behavior I've encountered since jumping into the bowl last fall. It's happened enough to me over these first several months that my reaction has transitioned from \"angry\" too \"oh well\". But I can't deny that it still sucks down deep. Some people have no compassion or empathy or are just effing cruel.\n\nI've been in a handful of situations where I decided not to continue into the pending SR, or realized my interest had waned, or even chose a better option. In each case it took 30 seconds to write and send a text saying basically \"... thanks for your time and efforts but I'm choosing/going/moving elsewhere. Good luck\". 30 seconds! It's not even face to face - how awkward or hard can it really be? \n\n I can't imagine standing someone up.  My most recent experience... plans for our 2nd intimate date - she texts me \"on my way - kissy-face emoji\"  (from 45 minutes away). 1.5 hours later I've finished dinner, chatted up a young lady/fellow solo diner, and am heading home alone.  Never heard another word from her. What goes through the mind of someone willing and able to play that game I wonder? Dinner was good though. \"Oh well\"\n\nSugaring claims to support clear communication about all sorts of \"relationship\" details, from the mundane to the most seriously intimate. Yet some people can't bring themselves to just say \"sorry, changed my mind\". 'Effing cowards!",
            "author": "CaptBrewster",
            "id": "gyz768o",
            "parent_id": "t3_nhtsjr",
            "score": 6,
            "created_utc": 1621625191.0,
            "replies": [
                {
                    "body": "Just a TON of broken girls in the bowl. Standing someone up from what they come from...no big deal.",
                    "author": "Tough-Raisin1514",
                    "id": "gz03c2v",
                    "parent_id": "t1_gyz768o",
                    "score": 2,
                    "created_utc": 1621641198.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Sorry man. That sort of stuff is an unfortunate side of the bowl. Has never happened to me with a POT.\n\nHowever, I had a couple month SB who got comfortable, too comfortable, real quickly and did that sort of stuff a lot on dates. Yet, my dumbass for a few times sent the weekly allowance before our dates like clockwork. I remember once I was so lived, I drove an hour to meet her for lunch (took off work early and everything), am waiting for her to arrive. She went to school / worked 5 minutes away. About 15 minutes late she said she was on her way and would be there in 10 minutes, sorry for the delay... after waiting almost two hours and not hearing from her further, I sheepishly with my tail between my legs got up and left. She contacted me a few hours later and said she had a last minute client and felt it was inappropriate to text (I was livid, and said she could have at least texted me an apology and that she couldn't make it). Sadly it took a couple more no shows and cancelations for me to finally end things. She always had very sappy and horrible excuses (dog got hit by a car was one she used to leave a 5 star date early, AA sponsor died, her brother died - which i found out was her getting engaged thanks to social media... didnt know she was not single). Yeah she then tried extorting me. She was a horrible human being.\nThankfully haven't had that sort of stuff in over two years. Have had drama of course, but not that flakey cancelling not showing up stuff.\n\nIt comes with the bowl. Sorry that happened man. Let her know how you feel and move on.",
            "author": "BigBearSD",
            "id": "gyy49zp",
            "parent_id": "t3_nhtsjr",
            "score": 18,
            "created_utc": 1621607685.0,
            "replies": [
                {
                    "body": "Tried to extort you???? Do tell...",
                    "author": "Tough-Raisin1514",
                    "id": "gyyniow",
                    "parent_id": "t1_gyy49zp",
                    "score": 5,
                    "created_utc": 1621616281.0,
                    "replies": []
                },
                {
                    "body": ">Yet, my dumbass for a few times sent the weekly allowance before our dates like clockwork.\n\nNever ever, ever, ever, do this. You qualify as lord SIMPdom and are encouraging terrible shitty behavior by young women. This shittifies the pool for everyone.",
                    "author": null,
                    "id": "gyyzq7j",
                    "parent_id": "t1_gyy49zp",
                    "score": -6,
                    "created_utc": 1621621745.0,
                    "replies": [
                        {
                            "body": "This would have been almost three years ago at the start, and yeah, i know. i learned my lesson the hard way. But thanks for your amazingly wonderful insight!",
                            "author": "BigBearSD",
                            "id": "gyz0qsx",
                            "parent_id": "t1_gyyzq7j",
                            "score": 3,
                            "created_utc": 1621622211.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Poor guy she got engaged to such a liar.",
                    "author": "wb19081908",
                    "id": "gyzxwgq",
                    "parent_id": "t1_gyy49zp",
                    "score": 1,
                    "created_utc": 1621638272.0,
                    "replies": [
                        {
                            "body": "Yeah that's my thought exactly too...",
                            "author": "BigBearSD",
                            "id": "gz1kted",
                            "parent_id": "t1_gyzxwgq",
                            "score": 1,
                            "created_utc": 1621680322.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I had a M&G flake on me last night.  half hr before pulls the \"I am at hairdresser and been waiting 2 hrs, can we reschedule\"   I literally have heard that excuse 5 times before.\n\nTell her no, we can push dinner back.  she says 1.5 hrs late.  Then 15 min before rescheduled time calls and asks OK if her BF comes....WTF.\n\nSo tell her no dinner Ill buy them a drink ...then didnt hear back.  so many game players on SA",
            "author": "Buckeyechamp21",
            "id": "gyy5hpd",
            "parent_id": "t3_nhtsjr",
            "score": 11,
            "created_utc": 1621608239.0,
            "replies": [
                {
                    "body": "Maybe it’s a turn off (or maybe it’s not lol) but I would much rather send a text saying “I’m coming but my hair looks like shit” opposed to making anyone wait 1.5 hours on me, let alone 5 minutes... the BF part I literally LOL’d at... what is wrong with people 🤦🏻‍♀️",
                    "author": "AllieCat6300",
                    "id": "gyydqxj",
                    "parent_id": "t1_gyy5hpd",
                    "score": 9,
                    "created_utc": 1621611906.0,
                    "replies": [
                        {
                            "body": "I think the was trying to repel him with that answer, or at least I hope she was because if not, that's wild.   \n\n\nIt's already been said but I don't put my pants on until they confirm within 30 minutes of our meeting location and time. If they need to reschedule I give them 2 chances MAX before I move on.   \n\n\nNo need to have stress or drama. If they don't keep their word and show up on time a majority of the time, you just aren't that important to them.   \n\n\nI keep my money and time, they keep their drama and bullshit excuses.",
                            "author": "TexasSD",
                            "id": "gz0m7dh",
                            "parent_id": "t1_gyydqxj",
                            "score": 2,
                            "created_utc": 1621651887.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "This is INSANE...\" can my bf come \"?... unreal",
                    "author": "Tough-Raisin1514",
                    "id": "gyyn9cm",
                    "parent_id": "t1_gyy5hpd",
                    "score": 3,
                    "created_utc": 1621616167.0,
                    "replies": [
                        {
                            "body": "He needs to eat too 🤣🤣",
                            "author": "wildhorses6565",
                            "id": "gyyw3e9",
                            "parent_id": "t1_gyyn9cm",
                            "score": 5,
                            "created_utc": 1621620097.0,
                            "replies": [
                                {
                                    "body": "Does he also watch??😆😅",
                                    "author": "Tough-Raisin1514",
                                    "id": "gz0337s",
                                    "parent_id": "t1_gyyw3e9",
                                    "score": 2,
                                    "created_utc": 1621641063.0,
                                    "replies": [
                                        {
                                            "body": "That's extra",
                                            "author": "wildhorses6565",
                                            "id": "gz8fh9o",
                                            "parent_id": "t1_gz0337s",
                                            "score": 2,
                                            "created_utc": 1621825434.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "More likely he's trying to fill a Russian order for fresh body parts.",
                                    "author": "pinotandsugar",
                                    "id": "gz7lz7z",
                                    "parent_id": "t1_gyyw3e9",
                                    "score": 1,
                                    "created_utc": 1621809080.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "I have had some weird stuff happen on M&G but never bringing a partner along.  \n\nMy key for the modern world is an honest profile, careful screening, pretty quick move to casual M&G.....   It's much easier to say .....  You are really special but I don't think we would be happy in an arrangement after a cup of coffee, cocktails and appetizers or even a very casual dinner.\n\nI've really enjoyed meeting you but I don't think I'm the right SD for you.  The reasons for not proceeding are usually not some deep character defect but rather different interests.",
                    "author": "pinotandsugar",
                    "id": "gz7lg5w",
                    "parent_id": "t1_gyy5hpd",
                    "score": 1,
                    "created_utc": 1621808813.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "That sucks, but unfortunly there is nothing really you can do except to enjoy a nice glass of wine and steak solo.",
            "author": "SDinChi",
            "id": "gyy4ye3",
            "parent_id": "t3_nhtsjr",
            "score": 8,
            "created_utc": 1621607994.0,
            "replies": []
        },
        {
            "body": "So low class. It's sad that some people have so little couth-on both sides of the gender divide. \n\nSorry that happened to you.",
            "author": "GSSD",
            "id": "gyy7hqy",
            "parent_id": "t3_nhtsjr",
            "score": 9,
            "created_utc": 1621609129.0,
            "replies": []
        },
        {
            "body": "\\+1 to the flaked-on-last-night club. Though in my case, at least with a text message in advance and not a full-on ghosting. She seems intriguing and we've had some fun teasing each other over text, so I'm going to reschedule for next week.\n\nIn the meantime I did the only thing you can do: Enjoyed the trendy new restaurant solo, flirted with the staff, and teased my POT with pictures of the delicious dishes she missed out on! I've had worse evenings. 😊",
            "author": "bizownersd",
            "id": "gyy8axa",
            "parent_id": "t3_nhtsjr",
            "score": 8,
            "created_utc": 1621609495.0,
            "replies": []
        },
        {
            "body": "Id been seeing a sb for like 2 months. Was supposed to go out of town. The day of she tells me she's got too much going on blah blah blah. Oh, and my favorite excuse...I'm sorry but its not you. Lol bullshit. So, I went on a vacation by myself....",
            "author": "xWolverine21x",
            "id": "gyyk7v8",
            "parent_id": "t3_nhtsjr",
            "score": 3,
            "created_utc": 1621614817.0,
            "replies": []
        },
        {
            "body": "Boo sorry that happened to you, hopefully next one treats you better",
            "author": "MariaMay0",
            "id": "gyy3m7j",
            "parent_id": "t3_nhtsjr",
            "score": 2,
            "created_utc": 1621607381.0,
            "replies": []
        },
        {
            "body": "Yeah. That sucks. Wax on wax off I guess. Could be much worst than ghosting. Still sucks, though.",
            "author": "XCLawandRealEstate",
            "id": "gyyb7p4",
            "parent_id": "t3_nhtsjr",
            "score": 2,
            "created_utc": 1621610782.0,
            "replies": []
        },
        {
            "body": "That’s unfortunate for you, and bad behaviour on her part. \n\nDon’t take it personally. Standing people up isn’t a socially acceptable standard of behaviour, so I think when it happens there’s a tendency to look back on your own behaviour in an attempt to evaluate why things “went wrong.” You mentioned that the both of you had a nice meet and greet, but that likely has nothing to do with it. This may be a clumsy analogy, but here goes. If you had a nice meet and greet then she showed up and punched you in the face, you might think about what you did to deserve that. But, of course you didn’t do anything to deserve the punch, it’s a socially unacceptable form of behaviour. \n\nI hope that your story helps to reinforce that treating others poorly is not acceptable. A simple text saying that one cannot show up after all is a better choice. People who can’t manage that are cowards.",
            "author": "InnerRadio7",
            "id": "gyzlkwu",
            "parent_id": "t3_nhtsjr",
            "score": 2,
            "created_utc": 1621632111.0,
            "replies": []
        },
        {
            "body": "Because depending on the age you are dating, she might not be a “real” adult yet?",
            "author": "BBSFSA",
            "id": "gyy9cia",
            "parent_id": "t3_nhtsjr",
            "score": 6,
            "created_utc": 1621609956.0,
            "replies": []
        },
        {
            "body": "There is no consequence and nearly unlimited options nowadays. I mean this happens to everyone... it is like second nature esp with young women now.",
            "author": null,
            "id": "gyyzvnb",
            "parent_id": "t3_nhtsjr",
            "score": 2,
            "created_utc": 1621621813.0,
            "replies": []
        },
        {
            "body": "It's not that she wasn't interested. She double booked the evening because people on SA are flakey as fuck, and the other guy didn't flake and was better than you.\n\nSucks that she didn't message, but she certainly wasn't going to tell you the truth, so any excuse would have been lame anyway. If you waited more than 10-15m without a message, that's on you.",
            "author": "tyranthraxxus",
            "id": "gyzjv8i",
            "parent_id": "t3_nhtsjr",
            "score": 0,
            "created_utc": 1621631304.0,
            "replies": []
        },
        {
            "body": "Plz tell me you didn't give her anything",
            "author": "ThrOW_AwYfor_ReDDIt",
            "id": "gyybzqh",
            "parent_id": "t3_nhtsjr",
            "score": 1,
            "created_utc": 1621611132.0,
            "replies": [
                {
                    "body": "No I'm not that dumb lol.",
                    "author": "UnspokenRequest",
                    "id": "gyyciu1",
                    "parent_id": "t1_gyybzqh",
                    "score": 3,
                    "created_utc": 1621611369.0,
                    "replies": [
                        {
                            "body": "Great,some people are tho. Lol",
                            "author": "ThrOW_AwYfor_ReDDIt",
                            "id": "gyycl3b",
                            "parent_id": "t1_gyyciu1",
                            "score": 2,
                            "created_utc": 1621611396.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Its always risk when dealing with others...",
            "author": null,
            "id": "gyyivbp",
            "parent_id": "t3_nhtsjr",
            "score": 1,
            "created_utc": 1621614208.0,
            "replies": []
        },
        {
            "body": "Some gals prob use moneybto party n are out of it..",
            "author": null,
            "id": "gyyj27c",
            "parent_id": "t3_nhtsjr",
            "score": 1,
            "created_utc": 1621614294.0,
            "replies": []
        },
        {
            "body": "I understand ghosting, People want to avoid an awkward conversation. That does not bother me and I think people get offended too easily by it. Nobody owes you an awkward conversation where they tell you they aren't into you. This is not classic ghosting anyway. Ghosting in a pump and dump situation is shitty. \n\nBut standing you up on a date is unacceptable.  Even a last minute flake is better that standing you up at the place. That is a person of poor character. Count yourself fortunate for finding out early. Sorry this happened to you. Good luck going forward.",
            "author": "fatsocalsd",
            "id": "gyyj5kp",
            "parent_id": "t3_nhtsjr",
            "score": 1,
            "created_utc": 1621614336.0,
            "replies": []
        },
        {
            "body": "Block her and move on immediately. Furthermore, what's your hourly rate? How much opportunity cost did she cause you?",
            "author": "MGTOWManofMystery",
            "id": "gyyky7q",
            "parent_id": "t3_nhtsjr",
            "score": 1,
            "created_utc": 1621615142.0,
            "replies": []
        },
        {
            "body": "The bowl can be brutal.  Lots of broken souls in there who have come from really fucked up households. Standing someone up?... that's a big nothing.",
            "author": "Tough-Raisin1514",
            "id": "gyymjdn",
            "parent_id": "t3_nhtsjr",
            "score": 1,
            "created_utc": 1621615849.0,
            "replies": []
        },
        {
            "body": "This happened to me two days ago",
            "author": "Jeannettte94",
            "id": "gyziktw",
            "parent_id": "t3_nhtsjr",
            "score": 1,
            "created_utc": 1621630666.0,
            "replies": []
        },
        {
            "body": "I feel like most people just don't want to deal with the confrontation of letting someone know they aren't interested, especially for women the fear of being hurt if they say they aren't interested. \n\nPeople seem to more and more also wanna have a backlog of people they can circle back to when options dry up.",
            "author": "DarkDelightsShop",
            "id": "gyzk0bv",
            "parent_id": "t3_nhtsjr",
            "score": 1,
            "created_utc": 1621631373.0,
            "replies": []
        },
        {
            "body": "Wow.. \n\nI understand (but don’t accept) when people ghost early on or without making plans, but when you actually say “I’m on my way” and know they are waiting.. that really sucks. I’m sorry, love.",
            "author": "Cdnsugarr",
            "id": "gyzweby",
            "parent_id": "t3_nhtsjr",
            "score": 1,
            "created_utc": 1621637480.0,
            "replies": []
        },
        {
            "body": "I pay for dinner for myself with the gift I was going to give her and tell myself that I came out ahead. \n\nNot that it’s true, but I feel better about it.",
            "author": "LaGriffeDuLion",
            "id": "gz0mfuo",
            "parent_id": "t3_nhtsjr",
            "score": 1,
            "created_utc": 1621652027.0,
            "replies": []
        },
        {
            "body": "I meet outside and go to bar/dinner together.",
            "author": "smooth_criminal_syd",
            "id": "gz0qto6",
            "parent_id": "t3_nhtsjr",
            "score": 1,
            "created_utc": 1621654672.0,
            "replies": []
        },
        {
            "body": "I’ve been ghosted by 3 different POT SDs so far this week! So clearly goes both ways 😭",
            "author": "Sheeeeeeesshhh",
            "id": "gz168zu",
            "parent_id": "t3_nhtsjr",
            "score": 1,
            "created_utc": 1621666121.0,
            "replies": [
                {
                    "body": "I know.  Being rude definitely not exclusive to SB. Sorry about your experience",
                    "author": "UnspokenRequest",
                    "id": "gzfqb8j",
                    "parent_id": "t1_gz168zu",
                    "score": 2,
                    "created_utc": 1621976299.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Definitely a post-pandemic problem of the bowl.  Not sure why it's so bad now. Pre pandemic I was ghosted often enough in the message and text stage but never got stood up once for a m&g.  Now it's happened twice in a week?  One of them at a place the SB chose!\n\nExcuses so lame too.  \"My alarm didn't go off\" or \"My mom called me and needs my help with something.\"  \"I don't feel good.\" Please!\n\nI always tried to mentally prepare to be stood up and so went in with the expectation that she wouldn't show.  I'm determined to enjoy my meal or drink alone if need be, and always choose a place I'd want to hang anyway. But I have to say it's a strangely high percentage occurrence now.",
            "author": "Aaronm989",
            "id": "gz16j8h",
            "parent_id": "t3_nhtsjr",
            "score": 1,
            "created_utc": 1621666373.0,
            "replies": []
        },
        {
            "body": "Awhhh nooo. I’m sorry :/\n\n I like the other commenters advice of starting at the bar and then getting a table when your date arrives",
            "author": null,
            "id": "gz1q35y",
            "parent_id": "t3_nhtsjr",
            "score": 1,
            "created_utc": 1621684892.0,
            "replies": []
        },
        {
            "body": "I'm new to the sugar relationship. Unfortunately, I didn't do my research on SRs and went for it. My first SR was \"monthly\" and before I read up on starting with PPM before monthly to protect both parties and allowances up front.... he ghosted me only paying me half of what we agreed to after our first month ended. His excuse was because the bank wasn't open and the ATM would only allow him to pull so much and that he'll pay the rest next time we meet. Gullible me is like, ok, yeah, that's fine! He hasn't replied to any of my text for about four days now. Yeah, it sucks being ghosted. Now I know how every guy ghosted feels like. Lol. \n\nI'm thinking to myself... This SD, whom I'd like to think would be professional, as a successful businessman, would be so much less of a coward to tell me how it really is and doesn't hold up to the agreement... and just ghosts me.\n\nBut it is what it is... and lesson learned...",
            "author": "Bling16",
            "id": "gzfpzmr",
            "parent_id": "t3_nhtsjr",
            "score": 1,
            "created_utc": 1621976151.0,
            "replies": []
        },
        {
            "body": "^ this. M&G at the bar and convert to apps, then dinner if it’s going great. Stood up at actual date is super harsh",
            "author": "daddoms",
            "id": "gyyozoc",
            "parent_id": "t1_gyygzlx",
            "score": 18,
            "created_utc": 1621616931.0,
            "replies": []
        },
        {
            "body": "This will be my plan going forward",
            "author": "UnspokenRequest",
            "id": "gyyh5zs",
            "parent_id": "t1_gyygzlx",
            "score": 9,
            "created_utc": 1621613442.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gyz2xov",
            "parent_id": "t1_gyygzlx",
            "score": 5,
            "created_utc": 1621623216.0,
            "replies": [
                {
                    "body": "I've only had one stand me up, and in all my years of doing this, thats pretty good.  But I find it awkward just sitting alone at a table in the middle of a dining room anyways, and my comfort zone is the bar area, haha.",
                    "author": "sinvortex",
                    "id": "gyz9f6z",
                    "parent_id": "t1_gyz2xov",
                    "score": 3,
                    "created_utc": 1621626249.0,
                    "replies": []
                },
                {
                    "body": "I'm always nervous meeting a POT for the first time but that's why I take precautions like telling a friend that I'm going on a date and that I'll let her know I'm okay.",
                    "author": "TwoInSympathy",
                    "id": "gz01g4o",
                    "parent_id": "t1_gyz2xov",
                    "score": 2,
                    "created_utc": 1621640164.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I’m just curious... why wait three hours? For me it’s 20 minutes before I leave when someone doesn’t communicate... am I too hasty?",
            "author": null,
            "id": "gyyj6b1",
            "parent_id": "t1_gyyg57w",
            "score": 13,
            "created_utc": 1621614345.0,
            "replies": [
                {
                    "body": "No that’s a good question. It was a cute little coffee shop next to some water. I stayed for myself but also in waiting. I decided wellp, if I’m gonna get stood up I might as well enjoy the view 😅",
                    "author": "wishinteen15",
                    "id": "gyyjh1x",
                    "parent_id": "t1_gyyj6b1",
                    "score": 12,
                    "created_utc": 1621614480.0,
                    "replies": [
                        {
                            "body": "If you chose to stay for yourself, I completely understand and support that. However please never wait more than 30mins for someone you haven't heard from. You deserve SO much better. Good luck in the future 💜",
                            "author": "Heartless_Weeknd",
                            "id": "gyzn7sb",
                            "parent_id": "t1_gyyjh1x",
                            "score": 16,
                            "created_utc": 1621632887.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Just a TON of broken girls in the bowl. Standing someone up from what they come from...no big deal.",
            "author": "Tough-Raisin1514",
            "id": "gz03c2v",
            "parent_id": "t1_gyz768o",
            "score": 2,
            "created_utc": 1621641198.0,
            "replies": []
        },
        {
            "body": "Tried to extort you???? Do tell...",
            "author": "Tough-Raisin1514",
            "id": "gyyniow",
            "parent_id": "t1_gyy49zp",
            "score": 5,
            "created_utc": 1621616281.0,
            "replies": []
        },
        {
            "body": ">Yet, my dumbass for a few times sent the weekly allowance before our dates like clockwork.\n\nNever ever, ever, ever, do this. You qualify as lord SIMPdom and are encouraging terrible shitty behavior by young women. This shittifies the pool for everyone.",
            "author": null,
            "id": "gyyzq7j",
            "parent_id": "t1_gyy49zp",
            "score": -6,
            "created_utc": 1621621745.0,
            "replies": [
                {
                    "body": "This would have been almost three years ago at the start, and yeah, i know. i learned my lesson the hard way. But thanks for your amazingly wonderful insight!",
                    "author": "BigBearSD",
                    "id": "gyz0qsx",
                    "parent_id": "t1_gyyzq7j",
                    "score": 3,
                    "created_utc": 1621622211.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Poor guy she got engaged to such a liar.",
            "author": "wb19081908",
            "id": "gyzxwgq",
            "parent_id": "t1_gyy49zp",
            "score": 1,
            "created_utc": 1621638272.0,
            "replies": [
                {
                    "body": "Yeah that's my thought exactly too...",
                    "author": "BigBearSD",
                    "id": "gz1kted",
                    "parent_id": "t1_gyzxwgq",
                    "score": 1,
                    "created_utc": 1621680322.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Maybe it’s a turn off (or maybe it’s not lol) but I would much rather send a text saying “I’m coming but my hair looks like shit” opposed to making anyone wait 1.5 hours on me, let alone 5 minutes... the BF part I literally LOL’d at... what is wrong with people 🤦🏻‍♀️",
            "author": "AllieCat6300",
            "id": "gyydqxj",
            "parent_id": "t1_gyy5hpd",
            "score": 9,
            "created_utc": 1621611906.0,
            "replies": [
                {
                    "body": "I think the was trying to repel him with that answer, or at least I hope she was because if not, that's wild.   \n\n\nIt's already been said but I don't put my pants on until they confirm within 30 minutes of our meeting location and time. If they need to reschedule I give them 2 chances MAX before I move on.   \n\n\nNo need to have stress or drama. If they don't keep their word and show up on time a majority of the time, you just aren't that important to them.   \n\n\nI keep my money and time, they keep their drama and bullshit excuses.",
                    "author": "TexasSD",
                    "id": "gz0m7dh",
                    "parent_id": "t1_gyydqxj",
                    "score": 2,
                    "created_utc": 1621651887.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "This is INSANE...\" can my bf come \"?... unreal",
            "author": "Tough-Raisin1514",
            "id": "gyyn9cm",
            "parent_id": "t1_gyy5hpd",
            "score": 3,
            "created_utc": 1621616167.0,
            "replies": [
                {
                    "body": "He needs to eat too 🤣🤣",
                    "author": "wildhorses6565",
                    "id": "gyyw3e9",
                    "parent_id": "t1_gyyn9cm",
                    "score": 5,
                    "created_utc": 1621620097.0,
                    "replies": [
                        {
                            "body": "Does he also watch??😆😅",
                            "author": "Tough-Raisin1514",
                            "id": "gz0337s",
                            "parent_id": "t1_gyyw3e9",
                            "score": 2,
                            "created_utc": 1621641063.0,
                            "replies": [
                                {
                                    "body": "That's extra",
                                    "author": "wildhorses6565",
                                    "id": "gz8fh9o",
                                    "parent_id": "t1_gz0337s",
                                    "score": 2,
                                    "created_utc": 1621825434.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "More likely he's trying to fill a Russian order for fresh body parts.",
                            "author": "pinotandsugar",
                            "id": "gz7lz7z",
                            "parent_id": "t1_gyyw3e9",
                            "score": 1,
                            "created_utc": 1621809080.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I have had some weird stuff happen on M&G but never bringing a partner along.  \n\nMy key for the modern world is an honest profile, careful screening, pretty quick move to casual M&G.....   It's much easier to say .....  You are really special but I don't think we would be happy in an arrangement after a cup of coffee, cocktails and appetizers or even a very casual dinner.\n\nI've really enjoyed meeting you but I don't think I'm the right SD for you.  The reasons for not proceeding are usually not some deep character defect but rather different interests.",
            "author": "pinotandsugar",
            "id": "gz7lg5w",
            "parent_id": "t1_gyy5hpd",
            "score": 1,
            "created_utc": 1621808813.0,
            "replies": []
        },
        {
            "body": "No I'm not that dumb lol.",
            "author": "UnspokenRequest",
            "id": "gyyciu1",
            "parent_id": "t1_gyybzqh",
            "score": 3,
            "created_utc": 1621611369.0,
            "replies": [
                {
                    "body": "Great,some people are tho. Lol",
                    "author": "ThrOW_AwYfor_ReDDIt",
                    "id": "gyycl3b",
                    "parent_id": "t1_gyyciu1",
                    "score": 2,
                    "created_utc": 1621611396.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I know.  Being rude definitely not exclusive to SB. Sorry about your experience",
            "author": "UnspokenRequest",
            "id": "gzfqb8j",
            "parent_id": "t1_gz168zu",
            "score": 2,
            "created_utc": 1621976299.0,
            "replies": []
        },
        {
            "body": "I've only had one stand me up, and in all my years of doing this, thats pretty good.  But I find it awkward just sitting alone at a table in the middle of a dining room anyways, and my comfort zone is the bar area, haha.",
            "author": "sinvortex",
            "id": "gyz9f6z",
            "parent_id": "t1_gyz2xov",
            "score": 3,
            "created_utc": 1621626249.0,
            "replies": []
        },
        {
            "body": "I'm always nervous meeting a POT for the first time but that's why I take precautions like telling a friend that I'm going on a date and that I'll let her know I'm okay.",
            "author": "TwoInSympathy",
            "id": "gz01g4o",
            "parent_id": "t1_gyz2xov",
            "score": 2,
            "created_utc": 1621640164.0,
            "replies": []
        },
        {
            "body": "No that’s a good question. It was a cute little coffee shop next to some water. I stayed for myself but also in waiting. I decided wellp, if I’m gonna get stood up I might as well enjoy the view 😅",
            "author": "wishinteen15",
            "id": "gyyjh1x",
            "parent_id": "t1_gyyj6b1",
            "score": 12,
            "created_utc": 1621614480.0,
            "replies": [
                {
                    "body": "If you chose to stay for yourself, I completely understand and support that. However please never wait more than 30mins for someone you haven't heard from. You deserve SO much better. Good luck in the future 💜",
                    "author": "Heartless_Weeknd",
                    "id": "gyzn7sb",
                    "parent_id": "t1_gyyjh1x",
                    "score": 16,
                    "created_utc": 1621632887.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "This would have been almost three years ago at the start, and yeah, i know. i learned my lesson the hard way. But thanks for your amazingly wonderful insight!",
            "author": "BigBearSD",
            "id": "gyz0qsx",
            "parent_id": "t1_gyyzq7j",
            "score": 3,
            "created_utc": 1621622211.0,
            "replies": []
        },
        {
            "body": "Yeah that's my thought exactly too...",
            "author": "BigBearSD",
            "id": "gz1kted",
            "parent_id": "t1_gyzxwgq",
            "score": 1,
            "created_utc": 1621680322.0,
            "replies": []
        },
        {
            "body": "I think the was trying to repel him with that answer, or at least I hope she was because if not, that's wild.   \n\n\nIt's already been said but I don't put my pants on until they confirm within 30 minutes of our meeting location and time. If they need to reschedule I give them 2 chances MAX before I move on.   \n\n\nNo need to have stress or drama. If they don't keep their word and show up on time a majority of the time, you just aren't that important to them.   \n\n\nI keep my money and time, they keep their drama and bullshit excuses.",
            "author": "TexasSD",
            "id": "gz0m7dh",
            "parent_id": "t1_gyydqxj",
            "score": 2,
            "created_utc": 1621651887.0,
            "replies": []
        },
        {
            "body": "He needs to eat too 🤣🤣",
            "author": "wildhorses6565",
            "id": "gyyw3e9",
            "parent_id": "t1_gyyn9cm",
            "score": 5,
            "created_utc": 1621620097.0,
            "replies": [
                {
                    "body": "Does he also watch??😆😅",
                    "author": "Tough-Raisin1514",
                    "id": "gz0337s",
                    "parent_id": "t1_gyyw3e9",
                    "score": 2,
                    "created_utc": 1621641063.0,
                    "replies": [
                        {
                            "body": "That's extra",
                            "author": "wildhorses6565",
                            "id": "gz8fh9o",
                            "parent_id": "t1_gz0337s",
                            "score": 2,
                            "created_utc": 1621825434.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "More likely he's trying to fill a Russian order for fresh body parts.",
                    "author": "pinotandsugar",
                    "id": "gz7lz7z",
                    "parent_id": "t1_gyyw3e9",
                    "score": 1,
                    "created_utc": 1621809080.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Great,some people are tho. Lol",
            "author": "ThrOW_AwYfor_ReDDIt",
            "id": "gyycl3b",
            "parent_id": "t1_gyyciu1",
            "score": 2,
            "created_utc": 1621611396.0,
            "replies": []
        },
        {
            "body": "If you chose to stay for yourself, I completely understand and support that. However please never wait more than 30mins for someone you haven't heard from. You deserve SO much better. Good luck in the future 💜",
            "author": "Heartless_Weeknd",
            "id": "gyzn7sb",
            "parent_id": "t1_gyyjh1x",
            "score": 16,
            "created_utc": 1621632887.0,
            "replies": []
        },
        {
            "body": "Does he also watch??😆😅",
            "author": "Tough-Raisin1514",
            "id": "gz0337s",
            "parent_id": "t1_gyyw3e9",
            "score": 2,
            "created_utc": 1621641063.0,
            "replies": [
                {
                    "body": "That's extra",
                    "author": "wildhorses6565",
                    "id": "gz8fh9o",
                    "parent_id": "t1_gz0337s",
                    "score": 2,
                    "created_utc": 1621825434.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "More likely he's trying to fill a Russian order for fresh body parts.",
            "author": "pinotandsugar",
            "id": "gz7lz7z",
            "parent_id": "t1_gyyw3e9",
            "score": 1,
            "created_utc": 1621809080.0,
            "replies": []
        },
        {
            "body": "That's extra",
            "author": "wildhorses6565",
            "id": "gz8fh9o",
            "parent_id": "t1_gz0337s",
            "score": 2,
            "created_utc": 1621825434.0,
            "replies": []
        }
    ]
}