{
    "title": "I compiled a big list of hair tips and advice for you",
    "post_id": "3a8nje",
    "post_url": "https://www.reddit.com/r/malehairadvice/comments/3a8nje/i_compiled_a_big_list_of_hair_tips_and_advice_for/",
    "author": "notnickjonass",
    "body": "Hey everyone. Girl here. I’ve commented on and off on this sub for the past couple of years. I decided to make this massive post for all you guys out there because a lot of the time I feel like I’m answering the same posts with the same responses. So here’s a giant guide to men’s hair.\n\n*******************************************************\n\n**General Hair Tips and Care**\n\n**Get your hair out of your face.** Give it some volume. Push it up and back/to the side, ruffle it up, whatever. I swear I say this to everyone. Don’t let your hair grow straight down your face, don’t let it just be matted flat on your head. This is a quick, simple way to give your hair some personality.\n\n**Shampoo less.** Shampoo is not really for cleaning your hair. Shampoo is for cleaning your scalp. Buy some sulfate free shampoo. Start shampooing every other day, rather than daily. Depending on your hair, scalp, and personal preferences, you can start going for longer periods of time without shampooing. I started shampooing every other day, then once a week, then once a month, and now I rarely ever shampoo (see /r/nopoo (also, for reference, I have thick wavy hair a couple inches past my armpits)). When you do use shampoo, don’t lather your hair like people always seem to on TV commercials. Like I said, shampoo isn’t really made for cleaning you hair. Take just a tiny dab of shampoo and sort of massage it into your scalp. \n\n**Shower in cold water.** Everyone loves their boiling hot shower, I know. That’s fine. But, at least, at the end of your shower, when you’re ready to rinse out your conditioner, blast it out with some cool water. I’ve worked up my tolerance to the point where I *prefer* cold showers. Cold water is beneficial to your hair and skin. Showering in hot water all the time can damage your hair, when my hair dries after a hot shower, it tends to be drier, puffy instead of curly, and just drab. After a cold shower, my hair dries softer, sleeker and curlier.\n\n**Avoid heat.** I’ve already told you to rinse your hair in cold water. You should also avoid heat while you’re styling your hair. Blow driers and straighteners can cause a lot of damage to your hair. Use them sparingly.\n\n**Dry your hair with a t-shirt or soft towel.**  The towels you use to dry off your body are likely too rough for your hair. I recently went to target and bought a ton or *super* soft towels. It’s not a huge thing, but I’ve noticed my hair’s softer and less frizzy. I’ve used T-shirts but they tend to soak pretty quickly and it’s not comfortable to have soggy clothes on your head. I have a lot of hair though.\n\n**Replace your Barber with a Stylist.** There’s a difference. I’ve had the same stylist for over a decade now. His name is Paul. He’s magic. I’ve screwed up my hair dozens of times over the years, box dyes, home haircuts, you name it. Paul’s always been able to fix it. Paul’s haircuts don’t always look exactly the way I wanted them to look coming in, but they always turn out way better than I was expecting them to look. On a few occasions, I’ve gone to Fantastic Sam’s or one of those chain barber’s shops.  I’ll describe what I want, show pictures, ect. but I’ve never been happy with my hair after getting it cut there. Paul knows how to communicate. He asks what I want, if he doesn’t understand he’ll ask more specific questions until he can picture what I’m asking for as clearly as I can. Then he makes my hair look better than I imagined it would. And *so damn soft.* Find yourself a Paul.\n\n**If you have a hairstyle in mind** (which you probably should if you’ve scheduled a hair appointment), **bring a picture to your stylist.** You can describe a style in as much detail as you want, but there’s a ton of room for misinterpretation. It’s not weird to bring a picture. It’s helpful. It’s the best way to get your thoughts across to the person cutting your hair. When you show them the picture, point out to them what you like about the style, anything you’d change about it, etc. Say “I’m going for something like this. I like how this guy’s hair is long on the top and shaved on the sides. But I think I want my hair on the top to be a tad shorter than his is.”\n\n**Ask your stylist how he/she did it.** I’ve gotten my hair cut & styled and had it look absolutely awesome, but when I try to replicate the style at home, it just wasn’t the same. Ask your stylist, “Hey, what did you do to make my hair so soft/curly/smooth/whatever” or “How do I make my hair stay up like this? Any special products that would help?”\n\n*******************************************************\n\n**Men’s hair products** (Beyond shampoo and conditioner)\n\nI know nearly nothing about men’s hair products. So here’s a couple of articles.\n\n[A GQ article describing a bunch of different types of hair products and their uses.](http://www.gq.com/how-to/groom/200312/choose-hair-product)\n\n[A Business Insider article claiming there’s only 3 types of hair products you need.](http://www.businessinsider.com/mens-hair-product-2014-11)\n\n[An article about choosing products based on your hair type](http://www.blacklapel.com/thecompass/how-to-choose-the-right-hair-product/)\n\n*******************************************************\n\n**Face Shapes**\n\nA lot of people ask “what’s my face shape? what haircut would look good with my face shape?” on here.  On the sidebar of this sub, you’ll find a link titled “Best Hairstyles for you Face Shape”. It will help you identify your face shape and illustrate the hairstyle that fits that face best. Now, I can’t tell you what my face shape is. I have no idea. I just went and stared in the mirror for a minute. According to the chart I suppose I have a diamond shaped face, maybe a round face? Oval?. I guess it might be easier for **other** people to identify your face shape. Once you figure out what shape face you have, here’s a picture or album for each face shape showing hair styles that work best for it:\n\n[Round.](http://i.imgur.com/0tVP9ie.jpg) The chart suggests a “square” haircut to offset roundness. I had trouble finding a picture for this one, but I think this picture I found would work.\n\n[Diamond.](http://imgur.com/a/JBq8A) The chart suggests “high volume” hair styles. I think a lot of styles could work for a diamond faced guy.\n\n[Oblong.](http://imgur.com/a/rW4Gf) Here’s some hair cuts for oblong faces. All longer on the top, but *even* with the sides.\n\n[Square.](http://imgur.com/a/VLHim) Here’s Short “tight” hair with volume on top, like the chart suggests\n\n[Triangular.](http://i.imgur.com/1IcsTKc.jpg) The chart suggests mid-length hair with an off center part or side swept bangs. This picture’s a pretty good example of all of that.\n\n[Oval.](http://i.imgur.com/e44UBW2.jpg) Apparently guys with oval shaped faces can pull off a whole lot of hair styles, so I don’t have any specific styles. Here’s a random oval faced dude with some fancy hair.\n\n*******************************************************\n\n**Making a Post that will Yield the most Helpful Advice**\n\nI’ve seen a surprising amount of posts where people say something like “I’m getting a haircut tomorrow, what would look good on me?” Figure out what hairstyle you’re aiming for *before* scheduling a hair appointment. On a few of the posts I’ve seen, I think the person would look best if they let their hair *grow out* a bit. Too late, they’ve already committed.\n\nPost pictures of yourself. We can’t tell you what would look good on you if you don’t post any pictures!\n\nPost *good* pictures of yourself. Don’t take picture of yourself on your laptop webcam while you reclined on your couch. This doesn’t show your face shape, it just gives you double chins. Take two pictures of your face with the camera at face level (not lower). One of the pictures should show your natural “straight face” and the other your natural smile. You don’t *really* need two pictures, but a variety of photos of you helps give a better idea of what your face *really* looks like. A lot of these lazy web-cam straight face pictures look like mug shots and aren’t very representative of what you actually look like 90% of the time. Side/profile/other angel views are also helpful, but I find I use the full face pictures most often as a reference when giving hair advise, so focus on those.\n\nTell us about your hair. What’s your routine? What products do you use? What hairstyles have you had in the past? What does your hair feel like? /r/malehairadvise is mostly focused on hair cuts and styles, but hair health and quality is important too! I also tend to suggest products to people a lot, but it’d be easier to suggest the perfect products if I knew more about their hair.\n\n*******************************************************\n\n**Hair Tutorials**\n\nI’ve already told you to keep your hair out of your face, push it up and back, and all of that. Tutorials can show you how to do that gracefully and how to style your hair all nice in the morning. Search around, you’ll find some tutorials for your hair type and desired style. Here’s some random ones I found:\n\n[Straight haired dude using various products to achieve various styles](https://www.youtube.com/watch?v=7ZGesadH6Nk)\n\n[Wavy/curly haired dude styling his hair](https://www.youtube.com/watch?v=Ys0WYTm-DPQ)\n\n[Curly haired dude showing his hair routine](https://www.youtube.com/watch?v=sCYunGTk-FI)\n\n[Straightish haired dude showing how he curls his hair without heat](https://www.youtube.com/watch?v=nKMy6Ha2JXs)\n\n[Curly to straight slicked back hair tutorial](https://www.youtube.com/watch?v=j5K3rmv3I04)\n\n[Styling a pompadour for people with wavy/curly hair](https://www.youtube.com/watch?v=z59ycP4rq0I)\n\n[Here’s this one dude’s youtube account. He has a ton of hair tutorials.](https://www.youtube.com/user/joeisblu/videos)\n\n*******************************************************\n\n**Haircuts to Avoid**\n\n[The Flippy “Bieber\" Cut.](http://37.media.tumblr.com/ccc6bcdbf972e03c844296a3591c3030/tumblr_mlxj2zBYoE1ru7gk2o1_1280.jpg) I don’t care if you’re 13 and this is still cool. Just because it’s the most popular hair style, doesn’t mean it’s the best. It’s not. \n\n[Flat on the face.](https://upload.wikimedia.org/wikipedia/commons/9/91/Minister_Nathan_Guy_-_photo.jpg) Push it up/back/to the side/do something with it. Always\n\n[Flat bangs.](https://medtopicwriter.files.wordpress.com/2011/03/iainracerbaby.jpg) I couldn’t actually find a picture of this on anyone over 10, but I’ve seen this on teenagers and grown men too much. It’s sort of like the flat on the face one I just talked about, except longer and cut straight across.\n\n*******************************************************\n\n**Misc. tips and Answers to some Commonly Asked Questions**\n\n* How do I describe this style to my barber?\n\nThe same way you just described it to us - *with a picture, dammit!*\n\n* Can I grow my hair out/pull off a man bun?\n\nMaybe! You can always cut it all off if you decide it doesn’t fit you! While you grow it out, be sure to style it and keep it from growing straight down your face/head until it gets long enough to part without product or put up in a bun/pony tail.\n\n* If you keep your hair medium/short, it best to keep your hair shorter on the sides and longer on the top. If you keep your hair longer, try layers.\n\n* [Coconut oil is awesome](http://www.naturallivingideas.com/coconut-oil-for-hair/) for your hair. You can also use it on your skin, nails, use it as make up remover, use it to make tooth paste, and even use it as lube.\n\n*******************************************************\n\n[To close, here’s my collection of pretty guy hair.](http://imgur.com/a/5jISi)\n\nIf you have any pretty guy hair pictures, questions, or think of something I should add or change to this post, let me know!\n\n*******************************************************\n\nEdit: Thank you everyone for your comments/questions/suggestions! I have some things to add.\n\nFirst of all, as a couple of you pointed out, **stylists are not always good, and barbers are not always bad.** My “Get a stylist, not a barber” comment implied that, but the title is not the important part.\n\nThe definition of a barber is “someone who cuts hair, especially men’s.” The definition of a stylist is “A person noted for elegant work or performance, in particular.” What I meant by “get a stylist, not a barber” was, don’t just get someone who cuts hair, get someone who cuts hair *damn well.* You can’t just find someone who calls themselves a hair stylist and expect a good hair cut. Try out a few different barbers & stylist until you find someone who you *love.*\n\n**Another note about finding a barber/stylist:** if you’re going for a drastic change in your look, don’t go to a completely new barber.  A couple years ago I was going for a chin length bob, [something like this.](http://www.cosmtools.com/img/201110/l-131969908351.jpg) I went to Fantastic Sam’s, and some random lady cut my hair. She didn’t factor in my curly hair, she just cut my wet hair to my chin. When it dried (for some reason she didn’t even ask if I wanted my hair blow dried, she just sent me out with soaking hair), my hair was way shorter than I’d intended. It’s important to go to the same barber because they learn what works for your hair, what you like, and can give you a better cut and better advice because they *know you.*\n\n**Things to put in your hair beyond shampoo and conditioner**\n\nI made a lengthy comment about this in reply to /u/TheBurningSoda’s question. [So here’s a link to that.](https://www.reddit.com/r/malehairadvice/comments/3a8nje/i_compiled_a_big_list_of_hair_tips_and_advice_for/csb2uku) Or, yknow, you could just scroll down. But I highly suggest looking into hair mask, oils, ect. You can literally google “food to put in your hair” and you’ll find tons of information. Hair masks are great for your hair but not something most guys would think of. ",
    "url": "https://www.reddit.com/r/malehairadvice/comments/3a8nje/i_compiled_a_big_list_of_hair_tips_and_advice_for/",
    "score": 318,
    "upvote_ratio": 0.97,
    "created_utc": 1434594738.0,
    "num_comments": 25,
    "links": [
        [
            "/r/nopoo",
            "http://www.gq.com/how-to/groom/200312/choose-hair-product",
            "http://www.businessinsider.com/mens-hair-product-2014-11",
            "http://www.blacklapel.com/thecompass/how-to-choose-the-right-hair-product/",
            "http://i.imgur.com/0tVP9ie.jpg",
            "http://imgur.com/a/JBq8A",
            "http://imgur.com/a/rW4Gf",
            "http://imgur.com/a/VLHim",
            "http://i.imgur.com/1IcsTKc.jpg",
            "http://i.imgur.com/e44UBW2.jpg",
            "/r/malehairadvise",
            "https://www.youtube.com/watch?v=7ZGesadH6Nk",
            "https://www.youtube.com/watch?v=Ys0WYTm-DPQ",
            "https://www.youtube.com/watch?v=sCYunGTk-FI",
            "https://www.youtube.com/watch?v=nKMy6Ha2JXs",
            "https://www.youtube.com/watch?v=j5K3rmv3I04",
            "https://www.youtube.com/watch?v=z59ycP4rq0I",
            "https://www.youtube.com/user/joeisblu/videos",
            "http://37.media.tumblr.com/ccc6bcdbf972e03c844296a3591c3030/tumblr_mlxj2zBYoE1ru7gk2o1_1280.jpg",
            "https://upload.wikimedia.org/wikipedia/commons/9/91/Minister_Nathan_Guy_-_photo.jpg",
            "https://medtopicwriter.files.wordpress.com/2011/03/iainracerbaby.jpg",
            "http://www.naturallivingideas.com/coconut-oil-for-hair/",
            "http://imgur.com/a/5jISi",
            "http://www.cosmtools.com/img/201110/l-131969908351.jpg",
            "/u/TheBurningSoda",
            "https://www.reddit.com/r/malehairadvice/comments/3a8nje/i_compiled_a_big_list_of_hair_tips_and_advice_for/csb2uku"
        ]
    ],
    "comments": [
        {
            "body": "I think you may have just saved this sub.",
            "author": "AssEatingSlasher",
            "id": "csalhkd",
            "parent_id": "t3_3a8nje",
            "score": 25,
            "created_utc": 1434628430.0,
            "replies": [
                {
                    "body": "I think too few will see it. Had we had any mods we could have stickied it :S",
                    "author": "TheBurningSoda",
                    "id": "csaltgg",
                    "parent_id": "t1_csalhkd",
                    "score": 6,
                    "created_utc": 1434629443.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "This is great! Perfect starter's guide. Would you mind if I used this as the first guide in the wiki when I finish /r/MensHair? Will happily credit you or let you add it yourself if you'd prefer. \n\nOh and sulfate free shampoo is excellent, great tip. Most people just say \"go nopoo\" but after six months of that I switched to a sulfate free shampoo and used it once a week. Hair is lookin' great now.",
            "author": null,
            "id": "csami5m",
            "parent_id": "t3_3a8nje",
            "score": 9,
            "created_utc": 1434631304.0,
            "replies": [
                {
                    "body": "You can absolutely use it on /r/MensHair! \n\nAnd sulfate shampoo is awesome, yes. It's a great happy medium between going no poo and using harsh shampoos every day. I rarely wash my hair but I always keep it on hand because sometimes I just feel the need to clean it - using conditioner every day without washing creates some gross build up after a while. There's also the cleansing conditioner option, which I have yet to try.",
                    "author": "notnickjonass",
                    "id": "csb3hjv",
                    "parent_id": "t1_csami5m",
                    "score": 2,
                    "created_utc": 1434658340.0,
                    "replies": [
                        {
                            "body": "I assume you have no guide for black men.",
                            "author": "Dishonoreduser",
                            "id": "cuz4u3j",
                            "parent_id": "t1_csb3hjv",
                            "score": 1,
                            "created_utc": 1442078383.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "This is your best bet OP post over there!",
                    "author": null,
                    "id": "csamtff",
                    "parent_id": "t1_csami5m",
                    "score": 1,
                    "created_utc": 1434632083.0,
                    "replies": [
                        {
                            "body": "Well the sub is still restricted posting while I set stuff up :) I'll definitely invite her to crosspost it when it opens though, this is a very good guide for people trying to get in to styling their hair.",
                            "author": null,
                            "id": "csamuqs",
                            "parent_id": "t1_csamtff",
                            "score": 1,
                            "created_utc": 1434632173.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Any word from MFA on getting some linkage?",
                    "author": null,
                    "id": "csan198",
                    "parent_id": "t1_csami5m",
                    "score": 1,
                    "created_utc": 1434632597.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "About the Barber/stylist part. I went to a Barber instead of a stylist some weeks ago, and I like it a lot more. I think it depends on the person more than on the label. ",
            "author": "ramalamamama",
            "id": "csamwfv",
            "parent_id": "t3_3a8nje",
            "score": 8,
            "created_utc": 1434632286.0,
            "replies": [
                {
                    "body": "Absolutely. I guess the important thing is finding the right person *for you.* You can't just google \"stylist\" and expect a fantastic hair cut. There's a lot of crappy stylists and a lot of great barbers. I tried out several different stylists and barbers before I found one that I loved. I'll make a note about that in my post.",
                    "author": "notnickjonass",
                    "id": "csavq61",
                    "parent_id": "t1_csamwfv",
                    "score": 4,
                    "created_utc": 1434647141.0,
                    "replies": [
                        {
                            "body": "It also highly depends on the cut you want. If you want a classic taper or fade with a pompadour top, then the right choice is (mostly) a barber. If you want something modern, freaky or even a color, then a stylist is the right. ",
                            "author": "ramalamamama",
                            "id": "csb246z",
                            "parent_id": "t1_csavq61",
                            "score": 1,
                            "created_utc": 1434656313.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Another thing I would add is acid rinses. If you have hard water and don't use (harsh) shampoo every day, you want to get rid of minerals. That's why you dilute a table spoon of lemon juice in a cup of water, then put it in  your hair and rinse out after a minute before stepping out of the shower. It's extremely important because it can decide between very good shampoo free results and dry, brittle hair that still looks greasy. ",
            "author": "ramalamamama",
            "id": "csaq0xp",
            "parent_id": "t3_3a8nje",
            "score": 5,
            "created_utc": 1434638441.0,
            "replies": [
                {
                    "body": "Lowering the pH of your hair causes the follicles to close up, retain moisture, and lay flatter with less frizz. This will happen with or without hard water. Use citric acid instead of lemon juice: It's odorless and won't bleach your hair or permanently scar your skin. \n\nIf you have hard water, go get a showerhead filter.",
                    "author": "Revvy",
                    "id": "csb1mwj",
                    "parent_id": "t1_csaq0xp",
                    "score": 3,
                    "created_utc": 1434655612.0,
                    "replies": [
                        {
                            "body": "I have hard water, and I can't get a good shower filter.  I use lemon juice and it works just fine against the hard water that causes mineral build up. Of course I also notice the other effects you talked about, but that's not the main reason I do it. Lemon juice is odorless too if you rinse it out, and by odorless I mean completely odorless. Also it doesn't bleach your hair if you use a tablespoon per cup, you need higher concentrations and longer times to bleach hair. ",
                            "author": "ramalamamama",
                            "id": "csb214x",
                            "parent_id": "t1_csb1mwj",
                            "score": 1,
                            "created_utc": 1434656190.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "csbkf7y",
            "parent_id": "t3_3a8nje",
            "score": 3,
            "created_utc": 1434689788.0,
            "replies": [
                {
                    "body": "Definitely, there's a lot of factors that make someone a good barber/stylist vs a bad one. I just feel like a lot of people go to get their hair cut without caring who's doing the job because they assume all barbers are more or less the same. Everyone should put effort into finding someone that works for them.",
                    "author": "notnickjonass",
                    "id": "csc1nby",
                    "parent_id": "t1_csbkf7y",
                    "score": 2,
                    "created_utc": 1434734378.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Some tips to protect your hair from losing!\n1) Washing hair properly\n\n2) Rinse your hair with vinegar before shampooing, twice a year. \n3) Moisturize your hair. Use five oils: almond, castor, olive, coconut and lavender oils. Mix together equal proportions of each.\n4) Don't brush your hair too much. Brushing your hair stimulates the follicles which promotes growth, but brushing too much too often, will cause damage to your hair strands that results in frizz and split ends.\n5) Use onion oil, this helps fight hair loss and gives you silky black hair.\nhttp://www.clinicspots.com/hairtransplant/",
            "author": "HealthExpert88",
            "id": "cxk6zzx",
            "parent_id": "t3_3a8nje",
            "score": 2,
            "created_utc": 1449044307.0,
            "replies": []
        },
        {
            "body": "You seem fairly experienced, so my question is if you have tried egg yolk with our without olive oil in your hair? If so, was it good?",
            "author": "TheBurningSoda",
            "id": "csalvb7",
            "parent_id": "t3_3a8nje",
            "score": 1,
            "created_utc": 1434629590.0,
            "replies": [
                {
                    "body": "I've used egg yolk in my hair a few times, I've also used olive oil a few times too, but I haven't actually tried them *together.* \n\nI'm not sure if it's me being weird (probably) or if other people have had this problem too, but I find it difficult to apply egg to my hair.  If I just kind of dump it on my hair, it slides right down and off my head before I have time to spread it in. I’ve tried getting it on my hands and rubbing it in with my hands, but I can never get enough of it on my hands. Anyways, here’s some tips about any sort of hair masks/packs/whatever you want to call it:\n\n* Mix liquidy ingredients like egg and olive oil with thicker ingredients like avocado & banana. You might need an electric or hand crank mixer. This will help solve the runniness issue. \n\n* Use a spray bottle to apply oils. I put coconut oil in my spray bottle. It will let you apply oil more evenly than if you were to just dump it on your head. You could also soak a paper towel and squeeze it over your head, or soak your hands and to apply it directly, but my preference is spray bottles, they’re the least messy method I’ve found. I'm sure you could also put eggs in a spray bottle and make it work if you really wanted to, but that sounds like a terrible idea.\n\nCommon things to put in your hair & benefits\n\n**Coconut oil.** I love coconut oil. It’s useful for *everything.* I typically put it in my hair over night to let it soak in, then I wash it out in the morning. It has all sorts of benefits, but its mostly used for moisturizing. I suggest liquid coconut oil, [this is what I use.](http://www.gnc.com/Natures-Way-Liquid-Coconut-Permium-Oil/product.jsp?productId=59131406&KPID=20765526&mr:trackingCode=7002AE6E-26BF-E411-8294-BC305BF923E4&mr:referralID=NA&mr:filter=125038301354&mr:ad=79864651394&kpid=20765526&mr:device=c&mr:match=&CAWELAID=59131406&mr:adType=plaonline&mr:keyword=&pla=pla_20765526) I put it in a spray bottle to make it easy to apply, and I find it easier to get out of your hair than thick coconut oil.\n\n**Olive Oil.** Like coconut oil, olive oil is good for loads of hair types, it can help with dandruff, strength & breakage prevention, and will make hair softer, smoother, and shinier. \n\n**Banana.** Bananas are sort of like a natural conditioner. Use over ripe bananas and make sure to blend them until they’re smooth with no clumps or strings before applying to your hair. It can be hard to get out of your hair if you’re not careful.\n\n**Avocado.** Avacado works for smoothing frizzy, dry hair, making it soft and shiny, moisturizing, and getting rid of dandruff. It’s also awesome for your skin.\n\n**Honey.** I’ve never used honey but it’s supposed to soften, smooth, moisturize, and add shine to your hair. This is one of the messier things on this list.\n\n**Eggs.** Eggs are very popular for hair.  They’re mostly used to make hair shiny, soft, smooth, and to repair damage. I’ve read if you rinse out egg with hot water, you can accidentally cook the egg into your hair, which sounds hilarious, but be cautious of that I suppose.\n\n**Brown Sugar.** This sounds super messy, but I’ve read you can use brown sugar in a hair mask to straighten your hair.\n\n**Baking Soda.** I’ve heard of using baking soda as a replacement for shampoo. It’s good for removing build up in your hair without damaging it. I’ve been meaning to try this one out but I always forget to bring baking soda in the shower with me.\n\n**Apple Cider Vinegar.** This stuff apparently balances the pH of your scalp and can be used to treat dandruff & oiliness. Like baking soda, this could be a good replacement for shampoo\n\n**Corn Starch.** Corn starch is used for oily hair. Say you don’t have time wash your hair one morning - corn startch! Put it in dry hair.\n\n**Mayonaise.** Mayonaise gives you hair moisture, and, like apple cider vinegar, it balances the pH of your scalp.\n\n**Milk.** Milk can be used as a conditioner and can treat dry hair. Like a ton of these products, it makes your hair shiny soft and moisturized\n\n**Yogurt.** Yogurt is a moisturizer that helps with dry, frizzy hair and dandruff. Make sure you use *plain* yogurt. Nothing with fruit in it or weird flavors. You can get a big ice-cream-tub-sized container of greek yogurt at the grocery store.\n\n**Molasses/Maple Syrup.** You can use either of these for softer, smoother hair. Make sure you use *real* maple syrup. I also think this is best paired with one or more of these other ingredients. I’ve read some reviews of people who were disappointed in their results when they just used straight up molasses/syrup.\n\nI basically suggest researching some hair mask recipes. You can find recipes for any hair. Try some depending on your hair type, and try some of these ingredients on their own, so you can identify which ones work best. Then you can mix and match your favorites. The ones I like the best are coconut oil, banana, and avocado, for reference, my hair is thick, wavy and a bit dry and frizzy.\n\ntl;dr put a bunch of food in your hair",
                    "author": "notnickjonass",
                    "id": "csb2uku",
                    "parent_id": "t1_csalvb7",
                    "score": 7,
                    "created_utc": 1434657396.0,
                    "replies": [
                        {
                            "body": "LOL thanks that was way more than i expected. I have to admit that i have tried eggyolk+olive oil myself, i only wanted your input =)\n\nI ran into the same problems as you, egg and olive oil is way to runny to apply easily, so i just brought the bowl into my shower. Grabbed whatever my hand could and just patted it into my hair before trying to get it into my scalp. After way to many minutes i grew bored and just tilted my head foreward into the bowl, to make my hair absord the mixture and then I tried to get it into my scalp. Sat like 20 minutes and questioned my life choices.\n\nWas it worth it? Hell i dont know. Maybe. My hair felt nicer, and my scalp wasnt as ichy as it can be. Will see in a few days whether it was in fact the mixture or my scalp relaxing by other factors.",
                            "author": "TheBurningSoda",
                            "id": "csb6k7i",
                            "parent_id": "t1_csb2uku",
                            "score": 2,
                            "created_utc": 1434662999.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "It was delicious!\n\n^^^^^I'm ^^^^^sorry",
                    "author": "ChipSkylarkDoesntFap",
                    "id": "csaxi55",
                    "parent_id": "t1_csalvb7",
                    "score": 2,
                    "created_utc": 1434649642.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Any suggestions if your a cross breed like me ? (Square and long) great post!",
            "author": null,
            "id": "csan0tv",
            "parent_id": "t3_3a8nje",
            "score": 1,
            "created_utc": 1434632570.0,
            "replies": []
        },
        {
            "body": "Fantastic post :)",
            "author": "RoboDuckii",
            "id": "ctn9s9u",
            "parent_id": "t3_3a8nje",
            "score": 1,
            "created_utc": 1438377702.0,
            "replies": []
        },
        {
            "body": "Amazing list of advices!",
            "author": "pmby",
            "id": "i9xbnlg",
            "parent_id": "t3_3a8nje",
            "score": 1,
            "created_utc": 1653480327.0,
            "replies": []
        },
        {
            "body": "I think too few will see it. Had we had any mods we could have stickied it :S",
            "author": "TheBurningSoda",
            "id": "csaltgg",
            "parent_id": "t1_csalhkd",
            "score": 6,
            "created_utc": 1434629443.0,
            "replies": []
        },
        {
            "body": "You can absolutely use it on /r/MensHair! \n\nAnd sulfate shampoo is awesome, yes. It's a great happy medium between going no poo and using harsh shampoos every day. I rarely wash my hair but I always keep it on hand because sometimes I just feel the need to clean it - using conditioner every day without washing creates some gross build up after a while. There's also the cleansing conditioner option, which I have yet to try.",
            "author": "notnickjonass",
            "id": "csb3hjv",
            "parent_id": "t1_csami5m",
            "score": 2,
            "created_utc": 1434658340.0,
            "replies": [
                {
                    "body": "I assume you have no guide for black men.",
                    "author": "Dishonoreduser",
                    "id": "cuz4u3j",
                    "parent_id": "t1_csb3hjv",
                    "score": 1,
                    "created_utc": 1442078383.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "This is your best bet OP post over there!",
            "author": null,
            "id": "csamtff",
            "parent_id": "t1_csami5m",
            "score": 1,
            "created_utc": 1434632083.0,
            "replies": [
                {
                    "body": "Well the sub is still restricted posting while I set stuff up :) I'll definitely invite her to crosspost it when it opens though, this is a very good guide for people trying to get in to styling their hair.",
                    "author": null,
                    "id": "csamuqs",
                    "parent_id": "t1_csamtff",
                    "score": 1,
                    "created_utc": 1434632173.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Any word from MFA on getting some linkage?",
            "author": null,
            "id": "csan198",
            "parent_id": "t1_csami5m",
            "score": 1,
            "created_utc": 1434632597.0,
            "replies": []
        },
        {
            "body": "Absolutely. I guess the important thing is finding the right person *for you.* You can't just google \"stylist\" and expect a fantastic hair cut. There's a lot of crappy stylists and a lot of great barbers. I tried out several different stylists and barbers before I found one that I loved. I'll make a note about that in my post.",
            "author": "notnickjonass",
            "id": "csavq61",
            "parent_id": "t1_csamwfv",
            "score": 4,
            "created_utc": 1434647141.0,
            "replies": [
                {
                    "body": "It also highly depends on the cut you want. If you want a classic taper or fade with a pompadour top, then the right choice is (mostly) a barber. If you want something modern, freaky or even a color, then a stylist is the right. ",
                    "author": "ramalamamama",
                    "id": "csb246z",
                    "parent_id": "t1_csavq61",
                    "score": 1,
                    "created_utc": 1434656313.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Lowering the pH of your hair causes the follicles to close up, retain moisture, and lay flatter with less frizz. This will happen with or without hard water. Use citric acid instead of lemon juice: It's odorless and won't bleach your hair or permanently scar your skin. \n\nIf you have hard water, go get a showerhead filter.",
            "author": "Revvy",
            "id": "csb1mwj",
            "parent_id": "t1_csaq0xp",
            "score": 3,
            "created_utc": 1434655612.0,
            "replies": [
                {
                    "body": "I have hard water, and I can't get a good shower filter.  I use lemon juice and it works just fine against the hard water that causes mineral build up. Of course I also notice the other effects you talked about, but that's not the main reason I do it. Lemon juice is odorless too if you rinse it out, and by odorless I mean completely odorless. Also it doesn't bleach your hair if you use a tablespoon per cup, you need higher concentrations and longer times to bleach hair. ",
                    "author": "ramalamamama",
                    "id": "csb214x",
                    "parent_id": "t1_csb1mwj",
                    "score": 1,
                    "created_utc": 1434656190.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Definitely, there's a lot of factors that make someone a good barber/stylist vs a bad one. I just feel like a lot of people go to get their hair cut without caring who's doing the job because they assume all barbers are more or less the same. Everyone should put effort into finding someone that works for them.",
            "author": "notnickjonass",
            "id": "csc1nby",
            "parent_id": "t1_csbkf7y",
            "score": 2,
            "created_utc": 1434734378.0,
            "replies": []
        },
        {
            "body": "I've used egg yolk in my hair a few times, I've also used olive oil a few times too, but I haven't actually tried them *together.* \n\nI'm not sure if it's me being weird (probably) or if other people have had this problem too, but I find it difficult to apply egg to my hair.  If I just kind of dump it on my hair, it slides right down and off my head before I have time to spread it in. I’ve tried getting it on my hands and rubbing it in with my hands, but I can never get enough of it on my hands. Anyways, here’s some tips about any sort of hair masks/packs/whatever you want to call it:\n\n* Mix liquidy ingredients like egg and olive oil with thicker ingredients like avocado & banana. You might need an electric or hand crank mixer. This will help solve the runniness issue. \n\n* Use a spray bottle to apply oils. I put coconut oil in my spray bottle. It will let you apply oil more evenly than if you were to just dump it on your head. You could also soak a paper towel and squeeze it over your head, or soak your hands and to apply it directly, but my preference is spray bottles, they’re the least messy method I’ve found. I'm sure you could also put eggs in a spray bottle and make it work if you really wanted to, but that sounds like a terrible idea.\n\nCommon things to put in your hair & benefits\n\n**Coconut oil.** I love coconut oil. It’s useful for *everything.* I typically put it in my hair over night to let it soak in, then I wash it out in the morning. It has all sorts of benefits, but its mostly used for moisturizing. I suggest liquid coconut oil, [this is what I use.](http://www.gnc.com/Natures-Way-Liquid-Coconut-Permium-Oil/product.jsp?productId=59131406&KPID=20765526&mr:trackingCode=7002AE6E-26BF-E411-8294-BC305BF923E4&mr:referralID=NA&mr:filter=125038301354&mr:ad=79864651394&kpid=20765526&mr:device=c&mr:match=&CAWELAID=59131406&mr:adType=plaonline&mr:keyword=&pla=pla_20765526) I put it in a spray bottle to make it easy to apply, and I find it easier to get out of your hair than thick coconut oil.\n\n**Olive Oil.** Like coconut oil, olive oil is good for loads of hair types, it can help with dandruff, strength & breakage prevention, and will make hair softer, smoother, and shinier. \n\n**Banana.** Bananas are sort of like a natural conditioner. Use over ripe bananas and make sure to blend them until they’re smooth with no clumps or strings before applying to your hair. It can be hard to get out of your hair if you’re not careful.\n\n**Avocado.** Avacado works for smoothing frizzy, dry hair, making it soft and shiny, moisturizing, and getting rid of dandruff. It’s also awesome for your skin.\n\n**Honey.** I’ve never used honey but it’s supposed to soften, smooth, moisturize, and add shine to your hair. This is one of the messier things on this list.\n\n**Eggs.** Eggs are very popular for hair.  They’re mostly used to make hair shiny, soft, smooth, and to repair damage. I’ve read if you rinse out egg with hot water, you can accidentally cook the egg into your hair, which sounds hilarious, but be cautious of that I suppose.\n\n**Brown Sugar.** This sounds super messy, but I’ve read you can use brown sugar in a hair mask to straighten your hair.\n\n**Baking Soda.** I’ve heard of using baking soda as a replacement for shampoo. It’s good for removing build up in your hair without damaging it. I’ve been meaning to try this one out but I always forget to bring baking soda in the shower with me.\n\n**Apple Cider Vinegar.** This stuff apparently balances the pH of your scalp and can be used to treat dandruff & oiliness. Like baking soda, this could be a good replacement for shampoo\n\n**Corn Starch.** Corn starch is used for oily hair. Say you don’t have time wash your hair one morning - corn startch! Put it in dry hair.\n\n**Mayonaise.** Mayonaise gives you hair moisture, and, like apple cider vinegar, it balances the pH of your scalp.\n\n**Milk.** Milk can be used as a conditioner and can treat dry hair. Like a ton of these products, it makes your hair shiny soft and moisturized\n\n**Yogurt.** Yogurt is a moisturizer that helps with dry, frizzy hair and dandruff. Make sure you use *plain* yogurt. Nothing with fruit in it or weird flavors. You can get a big ice-cream-tub-sized container of greek yogurt at the grocery store.\n\n**Molasses/Maple Syrup.** You can use either of these for softer, smoother hair. Make sure you use *real* maple syrup. I also think this is best paired with one or more of these other ingredients. I’ve read some reviews of people who were disappointed in their results when they just used straight up molasses/syrup.\n\nI basically suggest researching some hair mask recipes. You can find recipes for any hair. Try some depending on your hair type, and try some of these ingredients on their own, so you can identify which ones work best. Then you can mix and match your favorites. The ones I like the best are coconut oil, banana, and avocado, for reference, my hair is thick, wavy and a bit dry and frizzy.\n\ntl;dr put a bunch of food in your hair",
            "author": "notnickjonass",
            "id": "csb2uku",
            "parent_id": "t1_csalvb7",
            "score": 7,
            "created_utc": 1434657396.0,
            "replies": [
                {
                    "body": "LOL thanks that was way more than i expected. I have to admit that i have tried eggyolk+olive oil myself, i only wanted your input =)\n\nI ran into the same problems as you, egg and olive oil is way to runny to apply easily, so i just brought the bowl into my shower. Grabbed whatever my hand could and just patted it into my hair before trying to get it into my scalp. After way to many minutes i grew bored and just tilted my head foreward into the bowl, to make my hair absord the mixture and then I tried to get it into my scalp. Sat like 20 minutes and questioned my life choices.\n\nWas it worth it? Hell i dont know. Maybe. My hair felt nicer, and my scalp wasnt as ichy as it can be. Will see in a few days whether it was in fact the mixture or my scalp relaxing by other factors.",
                    "author": "TheBurningSoda",
                    "id": "csb6k7i",
                    "parent_id": "t1_csb2uku",
                    "score": 2,
                    "created_utc": 1434662999.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "It was delicious!\n\n^^^^^I'm ^^^^^sorry",
            "author": "ChipSkylarkDoesntFap",
            "id": "csaxi55",
            "parent_id": "t1_csalvb7",
            "score": 2,
            "created_utc": 1434649642.0,
            "replies": []
        },
        {
            "body": "I assume you have no guide for black men.",
            "author": "Dishonoreduser",
            "id": "cuz4u3j",
            "parent_id": "t1_csb3hjv",
            "score": 1,
            "created_utc": 1442078383.0,
            "replies": []
        },
        {
            "body": "Well the sub is still restricted posting while I set stuff up :) I'll definitely invite her to crosspost it when it opens though, this is a very good guide for people trying to get in to styling their hair.",
            "author": null,
            "id": "csamuqs",
            "parent_id": "t1_csamtff",
            "score": 1,
            "created_utc": 1434632173.0,
            "replies": []
        },
        {
            "body": "It also highly depends on the cut you want. If you want a classic taper or fade with a pompadour top, then the right choice is (mostly) a barber. If you want something modern, freaky or even a color, then a stylist is the right. ",
            "author": "ramalamamama",
            "id": "csb246z",
            "parent_id": "t1_csavq61",
            "score": 1,
            "created_utc": 1434656313.0,
            "replies": []
        },
        {
            "body": "I have hard water, and I can't get a good shower filter.  I use lemon juice and it works just fine against the hard water that causes mineral build up. Of course I also notice the other effects you talked about, but that's not the main reason I do it. Lemon juice is odorless too if you rinse it out, and by odorless I mean completely odorless. Also it doesn't bleach your hair if you use a tablespoon per cup, you need higher concentrations and longer times to bleach hair. ",
            "author": "ramalamamama",
            "id": "csb214x",
            "parent_id": "t1_csb1mwj",
            "score": 1,
            "created_utc": 1434656190.0,
            "replies": []
        },
        {
            "body": "LOL thanks that was way more than i expected. I have to admit that i have tried eggyolk+olive oil myself, i only wanted your input =)\n\nI ran into the same problems as you, egg and olive oil is way to runny to apply easily, so i just brought the bowl into my shower. Grabbed whatever my hand could and just patted it into my hair before trying to get it into my scalp. After way to many minutes i grew bored and just tilted my head foreward into the bowl, to make my hair absord the mixture and then I tried to get it into my scalp. Sat like 20 minutes and questioned my life choices.\n\nWas it worth it? Hell i dont know. Maybe. My hair felt nicer, and my scalp wasnt as ichy as it can be. Will see in a few days whether it was in fact the mixture or my scalp relaxing by other factors.",
            "author": "TheBurningSoda",
            "id": "csb6k7i",
            "parent_id": "t1_csb2uku",
            "score": 2,
            "created_utc": 1434662999.0,
            "replies": []
        }
    ]
}