{
    "title": "Rant: Never lowering my standards again.",
    "post_id": "lb5i3j",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/lb5i3j/rant_never_lowering_my_standards_again/",
    "author": "RobbiSosa",
    "body": "I am SO SICK of Splenda daddies. \n\nI’ve been talking to this guy all morning and it really seemed liked we were coming to an understanding about what we both want. Then we finally get to talking about meeting up and it’s excuse after excuse. \n\nWe originally discussed a weekly allowance and agreed on a amount that was good for both of us (it was a hundred less than I originally wanted but he was cute), we also agreed on meeting twice a week for said amount. Once we started talking about meeting he says “ yea I just have to run to the bank and take out x amount for you”. X being half of the weekly allowance we discussed. ( as if he was just paying for the one meeting, as if we discussed a ppm). Then before I could respond he says “hey the hotel room is a little more expensive than expected plus I wanted to get us some drinks. So I’ll just give you (X - 50) today and give you X next time.” \n\nI went off. I couldn’t even help it. I was already letting this man off the hook of my real ppm by giving him the weekly allowance at the same price as my ppm. And then on top of that we wants to cut that price in half so he never has to pay the rest. It’s bullshit. I’m so fucking tired of people going back on their word. It’s a genuine pet peeve of mine. So sick of being undervalued in the bowl. Maybe it’s just time to move on. Hopefully I’ll find someone by the end of this month. But if not, I might officially call it quits. \n\nThank you for coming to Ted talk.",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/lb5i3j/rant_never_lowering_my_standards_again/",
    "score": 186,
    "upvote_ratio": 0.95,
    "created_utc": 1612297591.0,
    "num_comments": 92,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "Unfortunately this is a lesson well learned. Figure out what you want and need from an arrangement and hold firm to it. \n\nAlso, this guy just sounds cheap - if someone is ever trying to cut a deal with you it’s a bad sign they won’t be able to financially sustain the arrangement and the audacity to nickel and dime things out of your allowance is utter ridiculousness!",
            "author": "GlitterAndSugar",
            "id": "glscyrb",
            "parent_id": "t3_lb5i3j",
            "score": 67,
            "created_utc": 1612303021.0,
            "replies": [
                {
                    "body": "absolutely... i only add not take away.  like if she has to come to me..yeah thats time and gas.  i will always add something extra.  \n\nThis guy wasnt a SD .. hell what he think a shared slushy and 2 for 1 hotdog at speedway was dinner.",
                    "author": "Buckeyechamp21",
                    "id": "glsnyrb",
                    "parent_id": "t1_glscyrb",
                    "score": 27,
                    "created_utc": 1612307799.0,
                    "replies": [
                        {
                            "body": "Dead",
                            "author": "kinkonlyfans",
                            "id": "gltiraf",
                            "parent_id": "t1_glsnyrb",
                            "score": 5,
                            "created_utc": 1612322697.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "100% this. If he has to haggle he ain’t worth your time.",
                    "author": "HotStool",
                    "id": "glszcq1",
                    "parent_id": "t1_glscyrb",
                    "score": 13,
                    "created_utc": 1612313212.0,
                    "replies": []
                },
                {
                    "body": "Agree. Every SD that ever tried to haggle with me turned out to have $$$ issues. Major red flag, just run.",
                    "author": "jessjay1252",
                    "id": "gltmf8m",
                    "parent_id": "t1_glscyrb",
                    "score": 11,
                    "created_utc": 1612324549.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "The MINUTE the POT mentions the whole \"well I can do (...) but after the hotel cost, that leaves (...) for you\" - I'm out. This kinda cheapness is a red flag and that kind of bargaining is, well, gross to me.  Mentioning how \"expensive\" the hotel is scream splenda daddy.",
            "author": "letsjusthavefunnow",
            "id": "gltixjl",
            "parent_id": "t3_lb5i3j",
            "score": 36,
            "created_utc": 1612322783.0,
            "replies": []
        },
        {
            "body": "I'm learning alot of these guys can't actually afford this ):",
            "author": null,
            "id": "gltq6f1",
            "parent_id": "t3_lb5i3j",
            "score": 22,
            "created_utc": 1612326562.0,
            "replies": [
                {
                    "body": "To have a successful sugar relationship you need to have an SD who\n\n- Respects you and wants you to have a successful experience \n\n- Is trustworthy \n\n- Has the assets to comfortably meet his commitments\n\n- Has comfort with a sugar relationship \n\n- Sugar relationship is compatible with the balance of his life\n\nPerhaps there can be some compromises but integrity and respect  are foundational.  There would be a lot fewer sad stories here if SB's used a similar checklist.",
                    "author": "pinotandsugar",
                    "id": "glwslh7",
                    "parent_id": "t1_gltq6f1",
                    "score": 3,
                    "created_utc": 1612387265.0,
                    "replies": [
                        {
                            "body": "What are some red flags and green flags for profiles of a SD? Still trying to get a feel here",
                            "author": "Cult_of_Dionysus_",
                            "id": "gly1r59",
                            "parent_id": "t1_glwslh7",
                            "score": 1,
                            "created_utc": 1612408567.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "I wish we could develop a better system to weed out POT SDs who can afford this without requiring POT to share their personal information (financial, ect.).\n\nStuff like these cheap SDs or tire kickers make the rest of the POT SDs look bad. I'd be curious to figure out what percentage of \"SDs\" on SA are actually true and can be a SD financially.",
                    "author": null,
                    "id": "gm0sgwe",
                    "parent_id": "t1_gltq6f1",
                    "score": 1,
                    "created_utc": 1612465319.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "That’s so frustrating! Go you for giving out to him",
            "author": "Intelligent-West-943",
            "id": "glskl20",
            "parent_id": "t3_lb5i3j",
            "score": 11,
            "created_utc": 1612306282.0,
            "replies": []
        },
        {
            "body": "\"it was less than I originally wanted but he was cute\"\n\nYou have to decide if you are on Tinder or a SB. Cute should have nothing to do with it-except he passed the cute test.  Guys like him get away with so much because they attract girls who are blinded by the looks and because they are \"nice guys\". \n\nBe a business woman and nail down an arrangement. A real SD will appreciate you for it and you will get a higher quality man.",
            "author": "GSSD",
            "id": "glsbd7a",
            "parent_id": "t3_lb5i3j",
            "score": 57,
            "created_utc": 1612302382.0,
            "replies": [
                {
                    "body": "More and more SB are getting sold on looks and then are SHOCKED when he turns out to be Splenda.\n\n\nI think there is a new trend of good looking males on SA trying to get laid for free. They realized that now Tinder is a dumpster, and that the hot ones moved to sugar dating. Every day we are hearing about some “28 year old SD” that’s burning an SB. \n\nI think OP is lowballing herself. She needs to start with a higher PPM.",
                    "author": "UnearthlyDinosaur",
                    "id": "glsdp65",
                    "parent_id": "t1_glsbd7a",
                    "score": 34,
                    "created_utc": 1612303330.0,
                    "replies": []
                },
                {
                    "body": "Why shouldn't looks have anything to do with it? I'm certain most SDs pick based on looks and are willing to pay more for a more attractive SB so why do you think women should act and differently in the same scenario?",
                    "author": "clashingtaco",
                    "id": "gltgavo",
                    "parent_id": "t1_glsbd7a",
                    "score": 14,
                    "created_utc": 1612321487.0,
                    "replies": [
                        {
                            "body": "It’s not really the same. An SD generally gives more for a more attractive woman because it would be difficult or even impossible to secure her with less.\n\nWhereas an SB could theoretically snag a “cute” guy any time she wants but she is in the bowl because she is valuing her relationships in a different way. \n\nIt’s like giving more to receive more versus accepting less to still kind of receive less.",
                            "author": "WandererOfInterwebs",
                            "id": "glu68vv",
                            "parent_id": "t1_gltgavo",
                            "score": 8,
                            "created_utc": 1612337343.0,
                            "replies": [
                                {
                                    "body": "That really depends on where your priorities lie. I consider the entire experience - the man's personality, expectations of me, and his looks - to determine what I feel my time is worth in that scenario. Just as men will do the same when picking a SB. Sure I could snag a cute guy anytime just as I could snag a mediocre SD. But everything has a price and I would rather have a lower PPM and a more enjoyable experience.",
                                    "author": "clashingtaco",
                                    "id": "glu6jyk",
                                    "parent_id": "t1_glu68vv",
                                    "score": 9,
                                    "created_utc": 1612337588.0,
                                    "replies": []
                                },
                                {
                                    "body": "> Whereas an SB could theoretically snag a “cute” guy any time she wants but she is in the bowl because she is valuing her relationships in a different way.\n\nYour assumption is that an SB's only goal is maximizing money. \n\nIf the goal is to have casual dating with someone she can enjoy + some additional help, pure money is not the only deciding factor.",
                                    "author": "SDstartingOut",
                                    "id": "glv24ii",
                                    "parent_id": "t1_glu68vv",
                                    "score": 5,
                                    "created_utc": 1612361689.0,
                                    "replies": [
                                        {
                                            "body": "I never said “only goal” and didn’t even mention money Lmao.",
                                            "author": "WandererOfInterwebs",
                                            "id": "glv6agm",
                                            "parent_id": "t1_glv24ii",
                                            "score": 2,
                                            "created_utc": 1612363597.0,
                                            "replies": [
                                                {
                                                    "body": "Another \"good looking SD\" trying to lesson the ego blow of paying for sex by convincing himself he pays a lower PPM than average.",
                                                    "author": "sDsBsR",
                                                    "id": "gly7a8m",
                                                    "parent_id": "t1_glv6agm",
                                                    "score": 1,
                                                    "created_utc": 1612411456.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "> Why shouldn't looks have anything to do with it?\n\nNaturally the whole package should count,including appearance and attraction. But many(most?) SBs are primarily looking for a good provider and are shocked when they encounter a scammer or splenda. I'm just advising to pick a SD who can be that provider first, then factor in looks,personality,etc.  Young men are more likely to be more attractive to a peer female than older guys, but also less likely to stay with one girl or to be a provider.",
                            "author": "GSSD",
                            "id": "gluypp9",
                            "parent_id": "t1_gltgavo",
                            "score": 3,
                            "created_utc": 1612359970.0,
                            "replies": []
                        },
                        {
                            "body": "> Why shouldn't looks have anything to do with it? \n\nBecause he's 60+ years old :).\n\nTypically I've found on this sub, the older SDs tend to push this line.  The younger ones tend to view it the other way.",
                            "author": "SDstartingOut",
                            "id": "glv1y8d",
                            "parent_id": "t1_gltgavo",
                            "score": 1,
                            "created_utc": 1612361605.0,
                            "replies": [
                                {
                                    "body": "He actually was on the younger side. His profile said he was 33. I typically try not to go so young because it’s almost always a let down. I should’ve known better.",
                                    "author": "RobbiSosa",
                                    "id": "glvtolr",
                                    "parent_id": "t1_glv1y8d",
                                    "score": 3,
                                    "created_utc": 1612373252.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "This is so true, I'm mid 30s and play soccer so I'm fit.  If i had to guess I pay much lower than an overweight guy in his 60s.",
                            "author": "AdAlternative6041",
                            "id": "glvnxqf",
                            "parent_id": "t1_gltgavo",
                            "score": 1,
                            "created_utc": 1612370947.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Bit harsh.  Shes tailoring the allowance to his desirability.  Which doesn't necessarily reflect on his level of flakiness",
                    "author": "wb19081908",
                    "id": "gltd1a7",
                    "parent_id": "t1_glsbd7a",
                    "score": 10,
                    "created_utc": 1612319883.0,
                    "replies": []
                },
                {
                    "body": "Hmmm... but if I think she is cute, I will gladly pay a little bit more (above what I usually offer) if she asks for it. Not sure what the difference is - if he is cute, she can accept less financial support?",
                    "author": "BlBl_SD",
                    "id": "gltbaay",
                    "parent_id": "t1_glsbd7a",
                    "score": 9,
                    "created_utc": 1612319008.0,
                    "replies": [
                        {
                            "body": "Of course anyone *can* accept less. That doesn’t mean it’s a great idea. These are comparable issues, but not quite the same. While this doesn’t cover all SDs/SBs in the bowl, on a general basis SDs are looking for someone younger, fun and attractive; SBs are commonly looking for someone reliable, financially stable and kind. SDs giving a little more to a SB they find ridiculously hot (and hopefully interesting, compassionate and honest) is a little less risky than SBs accepting less than they *know* they need or want because a SD is “cute.” I’ve never entered into a SR with a SD I found *un*attractive, but I’ve also never chosen a more conventionally attractive SD based on looks alone while compromising my needs.",
                            "author": "FoxyFreckles1989",
                            "id": "glteycx",
                            "parent_id": "t1_gltbaay",
                            "score": 8,
                            "created_utc": 1612320830.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "gltsjkf",
                                    "parent_id": "t1_glteycx",
                                    "score": 9,
                                    "created_utc": 1612327883.0,
                                    "replies": [
                                        {
                                            "body": "I never said that SDs don’t want someone who is reliable, stable and kind. I said it’s much more common for SDs to specifically look for someone young, attractive and fun and also went on to say that *hopefully* they consider other qualities, as well. \n\nI have never been concerned with only money. I’ve only been in SRs with SDs I truly enjoyed as people and found attractive in some way. You are looking at this backwards. Rather than thinking of it as though a SB might choose someone she finds less attractive for a little more money, consider that a SB shouldn’t accept *less* money *just* because she finds the SD making the offer more attractive than other POTs. \n\nI have an amount that I know I need out of a sugar relationship. I won’t make a huge compromise on that amount *just because* I think somebody is hot; the likelihood of my compromising at all on what I know I need, for any reason, is slim. That doesn’t mean that I would enter into a sugar relationship with someone I found *un*attractive for more than said amount, either.",
                                            "author": "FoxyFreckles1989",
                                            "id": "gltt8no",
                                            "parent_id": "t1_gltsjkf",
                                            "score": 3,
                                            "created_utc": 1612328287.0,
                                            "replies": [
                                                {
                                                    "body": "Maybe the difference is that you need a certain amount. I don't need anything from my SD, it's just a nice perk of the arrangement. My priority isn't money, it's my enjoyment, and I certainly do enjoy spending time with a more attractive man.",
                                                    "author": "clashingtaco",
                                                    "id": "glvq4qw",
                                                    "parent_id": "t1_gltt8no",
                                                    "score": 2,
                                                    "created_utc": 1612371833.0,
                                                    "replies": [
                                                        {
                                                            "body": "When I say “need,” I am referring to terms and conditions I’ve set for myself in order to enter a SR. I don’t need it to survive; I need it to feel comfortable. My priorities are comfort and enjoyment. I absolutely prefer a man I’m attracted to, and wouldn’t enter a SR otherwise.",
                                                            "author": "FoxyFreckles1989",
                                                            "id": "glwsidd",
                                                            "parent_id": "t1_glvq4qw",
                                                            "score": 1,
                                                            "created_utc": 1612387230.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "Ok, makes sense, thanks for that perspective!",
                                    "author": "BlBl_SD",
                                    "id": "gltfj43",
                                    "parent_id": "t1_glteycx",
                                    "score": 2,
                                    "created_utc": 1612321109.0,
                                    "replies": [
                                        {
                                            "body": "No worries! Glad to help.",
                                            "author": "FoxyFreckles1989",
                                            "id": "gltggny",
                                            "parent_id": "t1_gltfj43",
                                            "score": 2,
                                            "created_utc": 1612321567.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "Exactly lol",
                            "author": "wb19081908",
                            "id": "gltcxbs",
                            "parent_id": "t1_gltbaay",
                            "score": 0,
                            "created_utc": 1612319828.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "it's worked out swimmingly for me.  you have more cash you're willing to give up, i have some of my youth.\n\nthis scenario cuts both ways.  SBs tend to flake and want more cash for giving less.  both are the same thing.",
                    "author": null,
                    "id": "glsnlse",
                    "parent_id": "t1_glsbd7a",
                    "score": 1,
                    "created_utc": 1612307633.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Girl, you could have avoided *all* of this by accepting he wasn’t right for you from the beginning. Not everyone is cut out for the bowl; not every POT is a good match. If he can’t afford/won’t give what you’re determined to get, then move on as soon as that is established. \n\nSome tips:\n\n• *Always* go for PPM until you’ve at least spent a little bit of time together. There are certain scenarios in which going immediately to an allowance might be appropriate, but it’s *certainly* a risk for both parties involved, regardless. The SD risks losing some money if he chooses to give an allowance up front. The SB, however, risks being intimate on a date for nothing if she agrees to an allowance right out of the gate and doesn’t receive it before any intimacy takes place. \n\n• Basing a *vanilla* relationship on looks alone and compromising your own needs/morals/values/whatever else rarely ends well. It’s an even worse idea as a SB in the bowl. (It’s not a great idea from the SD end, either, but they’re definitely more commonly searching for a specific physical attraction.) Don’t ever make this trade off, again. It doesn’t matter how cute he is if y’all aren’t fundamentally compatible. \n\n• The *moment* certain red flags pop up (offering half of a supposed allowance in return for one date, saying he’s subtracting from an “allowance” for the price of a room/drinks), end things. Some things can be looked past while getting to know a POT, others cannot and should not be looked past. \n\n• Patience is *truly* a virtue, especially in the sugar world. Don’t give yourself a one month deadline if this is actually something you want to do! It can take months on end to find that perfect SR, and it’ll surely be worth it, if you put in the work to screen, go on M&Gs, have open and honest conversations etc. and let go of some of these hang ups. \n\n• Don’t ever sugar out of desperation. I’m not saying that’s what you’re doing; compromising on things like money, circumstances surrounding dates etc. are things that desperate SBs do, and this will always lead to disappointment, and often leads to being taken advantage of. \n\nYou learned some valuable lessons! Don’t give up if you genuinely want to be in a sugar relationship. \n\nGood luck!",
            "author": "FoxyFreckles1989",
            "id": "glte4ll",
            "parent_id": "t3_lb5i3j",
            "score": 23,
            "created_utc": 1612320420.0,
            "replies": [
                {
                    "body": "> Always go for PPM until you’ve at least spent a little bit of time together. There are certain scenarios in which going immediately to an allowance might be appropriate, but it’s certainly a risk for both parties involved, regardless. \n\nI do not understand this.  I very often start with a monthly allowance, split into bi-monthly at the start.  The first half happens on the first date (before intimacy), the second half happens on our first date on/after the 15th.\n\nI realize some view this is additional risk to me (as an SD).  I actually view it a way to reduce risk.  If a girl is willing to both sleep with me + literally fuck me over, losing the part of an allowance is a cheap cost to expose her true colors.  If we have a complete mismatch after intimacy - I can also walk away a bit more guilt free as she's getting a half month allowance.  (not just a single PPM).\n\nFrom her perspective, I'm not really sure the increased risk.  \n\nNow - someone pulling a bait & switch is a risk.  But that's a risk no matter what.  They can just easily pull PPM after intimacy, as they can pull allowance after intimacy.",
                    "author": "SDstartingOut",
                    "id": "glv1ttw",
                    "parent_id": "t1_glte4ll",
                    "score": 4,
                    "created_utc": 1612361546.0,
                    "replies": [
                        {
                            "body": "Biweekly allowance is best way to start, assuming one day a week, so the second date is envelope free.",
                            "author": "darteduncle",
                            "id": "glw2lxw",
                            "parent_id": "t1_glv1ttw",
                            "score": 1,
                            "created_utc": 1612376733.0,
                            "replies": [
                                {
                                    "body": "Eh.\n\nPersonally I will not do bi-weekly;  it is far too complicated for me.  I have a monthly budget, not a bi-weekly budget.",
                                    "author": "SDstartingOut",
                                    "id": "glw8mm3",
                                    "parent_id": "t1_glw2lxw",
                                    "score": 1,
                                    "created_utc": 1612379105.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "the not sugaring out of desperation is so real. every time i’ve been taken advantage of it’s when i needed the money the most.",
                    "author": "onlybadkatt",
                    "id": "glulpsd",
                    "parent_id": "t1_glte4ll",
                    "score": 1,
                    "created_utc": 1612351161.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Proud of you for sticking to your guns and recognizing his trash behavior. \nThe bowl is a difficult place to navigate but if you allow yourself to be more strict/picky it may narrow your options a bit but the ones you do have will be higher quality. \nDon’t break your promises to yourself about what you need from a SD and your bottom line 🖤",
            "author": "ashes2asscheeks",
            "id": "glte14v",
            "parent_id": "t3_lb5i3j",
            "score": 3,
            "created_utc": 1612320372.0,
            "replies": []
        },
        {
            "body": "Louder for the people in the back. Or the ones that message me saying they wanna do sugar daddy shit and only offer $50 a week. Um nah fam. How about the ones that offer it but don't want to pay because \"I could be a scam\" seriously? Uh no. I've just stopped responding to people who message me wanting to offer SD services because they are all fakes. No one has proved me wrong yet.",
            "author": null,
            "id": "gltzonm",
            "parent_id": "t3_lb5i3j",
            "score": 3,
            "created_utc": 1612332370.0,
            "replies": [
                {
                    "body": "Yeah I just don't think the men with the kind of money it actually takes to \"keep a woman\" are shopping on reddit, at least statistically, lol.",
                    "author": null,
                    "id": "gwdjp2d",
                    "parent_id": "t1_gltzonm",
                    "score": 1,
                    "created_utc": 1619748420.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "gross. hand holding is so frustrating in general. don’t leave us! 😔❤️",
            "author": "atasteof-honey",
            "id": "glsbqgu",
            "parent_id": "t3_lb5i3j",
            "score": 6,
            "created_utc": 1612302525.0,
            "replies": []
        },
        {
            "body": "There are some interesting points that jump out. It seems you started to talk to a guy “all morning”. So he was a stranger! No platonic M&G etc. Then you were ready to meet him in a hotel room for a ppm less than xyz.\n\n Is that really how sugaring works? Do you really expect to find a genuine SD if you are ready to meet strangers for the first time in hotel rooms?",
            "author": null,
            "id": "gltctaj",
            "parent_id": "t3_lb5i3j",
            "score": 7,
            "created_utc": 1612319773.0,
            "replies": [
                {
                    "body": "Who said anything about meeting in a hotel room? The plan was to have dinner and see where the night takes us. We had been playing tag on SA for about a week and finally traded numbers, but we both knew how we wanted things to go. What’s so wrong with that?",
                    "author": "RobbiSosa",
                    "id": "gltk5oy",
                    "parent_id": "t1_gltctaj",
                    "score": 2,
                    "created_utc": 1612323391.0,
                    "replies": [
                        {
                            "body": "A platonic M&G would have avoided all of this. You could have seen if he takes you to an upscale resto or a cheap place/coffee and you’d have answered your own questions and not even needed to shave because... say it with me .... PLATONIC M&G",
                            "author": "morphine-me",
                            "id": "glu0odm",
                            "parent_id": "t1_gltk5oy",
                            "score": 5,
                            "created_utc": 1612333072.0,
                            "replies": []
                        },
                        {
                            "body": ">meeting in a hotel room? The plan was to have dinner and see where the night takes us.\n\nThe night needs to take you straight home after the public m&g, by yourself... every damn time. The protocol is there for a reason.",
                            "author": "bluelunarmonkey",
                            "id": "gltxho2",
                            "parent_id": "t1_gltk5oy",
                            "score": 6,
                            "created_utc": 1612330885.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "It’s easier to find a good daddy in a large city 🤷🏻‍♂️",
            "author": "LongETH",
            "id": "gltu5of",
            "parent_id": "t3_lb5i3j",
            "score": 3,
            "created_utc": 1612328821.0,
            "replies": []
        },
        {
            "body": "_\"What's to come will be infinitely sweeter than the bitterness of longing.\"_\n\nStick to your guns and be patient. Some of us good ones are, in fact, out there. Don't let one asshat jade you.",
            "author": "SDRippington",
            "id": "glthl5i",
            "parent_id": "t3_lb5i3j",
            "score": 4,
            "created_utc": 1612322121.0,
            "replies": []
        },
        {
            "body": "lol",
            "author": "bookworm010101",
            "id": "glsxdrb",
            "parent_id": "t3_lb5i3j",
            "score": 2,
            "created_utc": 1612312261.0,
            "replies": []
        },
        {
            "body": "I think you mean salt.",
            "author": "cheeriosandmilk12",
            "id": "gltcnsx",
            "parent_id": "t3_lb5i3j",
            "score": 2,
            "created_utc": 1612319697.0,
            "replies": []
        },
        {
            "body": "Absolutely move on. Expenses should never come out of allowance.   He's living a fantasy that he can not afford.",
            "author": "spoilyou255",
            "id": "gluxo9z",
            "parent_id": "t3_lb5i3j",
            "score": 2,
            "created_utc": 1612359409.0,
            "replies": []
        },
        {
            "body": "Ugh.....spent dayss talking to this guy that I think is absolutely adorable...and pretty much all day yesterday.  He's 'new' at this and doesn't know anything including what to offer.  So we talk all day about meeting up.  Every detail except I'm still skirting the allowance issue (I'm getting better about it but still a newbie).  So finally I'm thinking...I'm really attracted to this guy.  I know he isn't loaded so I'm going to offer him my minimum.  I will enjoy getting together with him so that counts for something.  He comes back very sweetly that maybe he can see me once a month.  I'm like well maybe we can work something out on a monthly basis and we can see each other 2 times a month.  Guess what he says?  'Once is all the funds will allow.  I honestly didn't think I would find anyone I would be interested in and wish I made more...' 😑",
            "author": "No-Marzipan-4441",
            "id": "gluz1zg",
            "parent_id": "t3_lb5i3j",
            "score": 2,
            "created_utc": 1612360151.0,
            "replies": [
                {
                    "body": "Yea I always try to talk about allowances /ppm as soon as possible because the more you talk to them, the less you’ll want to charge them. Especially when their cute and nice.",
                    "author": "RobbiSosa",
                    "id": "glvrrzn",
                    "parent_id": "t1_gluz1zg",
                    "score": 3,
                    "created_utc": 1612372491.0,
                    "replies": [
                        {
                            "body": "Soo true. I’m learning!",
                            "author": "No-Marzipan-4441",
                            "id": "glvyyr4",
                            "parent_id": "t1_glvrrzn",
                            "score": 1,
                            "created_utc": 1612375324.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "It goes both ways.\n\nit’s going great then all of a sudden you try to sneak in a can i get my allowance without intimacy\n\n“hey i was just thinking can we just have some food and drinks this week and call it a night?”\n\nand so the search begins again.",
            "author": "EntrepreneurDue8476",
            "id": "glt3igt",
            "parent_id": "t3_lb5i3j",
            "score": 3,
            "created_utc": 1612315231.0,
            "replies": [
                {
                    "body": "Do you mean this generally speaking, or just at the beginning of a sugar relationship?",
                    "author": "FoxyFreckles1989",
                    "id": "gltf57r",
                    "parent_id": "t1_glt3igt",
                    "score": 2,
                    "created_utc": 1612320924.0,
                    "replies": [
                        {
                            "body": "it’s happened both times to me.",
                            "author": "EntrepreneurDue8476",
                            "id": "glucy88",
                            "parent_id": "t1_gltf57r",
                            "score": 1,
                            "created_utc": 1612343214.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "i can go months without finding anyone decent.  Patience is important.",
            "author": "wb19081908",
            "id": "glt6ud3",
            "parent_id": "t3_lb5i3j",
            "score": 1,
            "created_utc": 1612316832.0,
            "replies": []
        },
        {
            "body": "Look any SD who agrees to an allowance and pays it up front before you have in any way done your part is dumb.\n\nI am not saying I haven't been dumb but at least I understood the risk. Him not trusting you quite yet doesn't make him a splenda daddy.   IMO these shoud always start as PPM and progress to allowance when trust is gained.  As much as he may not pay you for the future events that haven't happened yet, you may not show for the future events that haven't happened yet.   In your scenario he accepts 100% of the risk and you get no risk.  In his scenario he pre-pays and therefore accepts some risk but is hedging his bets because ... you are likely to go off and lose it and walk away.  Which you did.\n\nHe is probably thinking \"good catch on my part before she scammed me\".\n\nI don't agree with lowering the amount because the hotel or drinks costs more nonsense but when the trust is earned on both sides then go to allowance.\n\nedit:  I should say that I just re-read it and saw it was a weekly allowance which does make some difference but the point of my post still stands.  Trust first.  He didn't trust you.",
            "author": "craa141",
            "id": "glsxyx0",
            "parent_id": "t3_lb5i3j",
            "score": -4,
            "created_utc": 1612312544.0,
            "replies": [
                {
                    "body": "That's not true. You don't give honey without money. You don't get to \"pay half now and give you the rest later\". You pay the agreed rate upfront upon mtng and the date continues. He tried to screw her out of getting the money. HE was the scammer here. Not her.\n\nHe wasn't willing to pay her full PPM. He wanted to only do half and pay the rest later. That's not how this works.",
                    "author": "clair-cummings",
                    "id": "glt2xd0",
                    "parent_id": "t1_glsxyx0",
                    "score": 18,
                    "created_utc": 1612314946.0,
                    "replies": [
                        {
                            "body": "I am not calling her a scammer.  \n\nI am saying that in this \"someone has to go first\" in terms of trusting the other and I get that the SD should.  I don't have any issue with that.  I never said she should \"give honey first\" or implied that so please stop being dramatic. \n\nI am simply giving her a different perspective.  It doesn't mean he is either a scammer or a splenda daddy necessarily.  Meaning it may, but not guaranteed.  Most guys who have been in the bowl for any period of time have been scammed or have had to be really careful so his clumsy attempt to avoid being scammed (in his mind) may be all that it is. \n\nFor the kids in the back.. I am not accusing her of being a scammer, merely saying that her POT may have simply not trusted her and someone needs to take a leap of faith in the bowl and hope for the best.  That should be the SD.",
                            "author": "craa141",
                            "id": "glt9518",
                            "parent_id": "t1_glt2xd0",
                            "score": -1,
                            "created_utc": 1612317954.0,
                            "replies": [
                                {
                                    "body": "I might feel more inclined to agree with this perspective if the dude hadn’t legitimately told OP he was going to subtract from her allowance for the price of the room and drinks. That *screams* Splenda.",
                                    "author": "FoxyFreckles1989",
                                    "id": "gltfbwe",
                                    "parent_id": "t1_glt9518",
                                    "score": 8,
                                    "created_utc": 1612321014.0,
                                    "replies": [
                                        {
                                            "body": "Exactly. She had every reason to not trust him considering all the little red flags added up to one bigger one.",
                                            "author": "clair-cummings",
                                            "id": "glu3sx8",
                                            "parent_id": "t1_gltfbwe",
                                            "score": 2,
                                            "created_utc": 1612335405.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "Ok, get your point with half weekly allowance for first date due to trust etc. But reducing her allowance for more expensive hotel room, drinks, etc.? So every time hotel is more than x, he will take that off her allowance so he is ‘whole’? Nobody calls it scamming, but it is ... cheap. If he really was going to pay for it all with cash and was short on cash, maybe stop by the ATM or go back to the bank and get more $.",
                                    "author": "BlBl_SD",
                                    "id": "gltc1hl",
                                    "parent_id": "t1_glt9518",
                                    "score": 3,
                                    "created_utc": 1612319386.0,
                                    "replies": [
                                        {
                                            "body": "Please. Stop caping for this Splenda daddy. He's cheap and he's not someone to deal with given how he's approached the situation. The fact that you keep trying to cape for him makes you look just as bad.",
                                            "author": "clair-cummings",
                                            "id": "glu3wzl",
                                            "parent_id": "t1_gltc1hl",
                                            "score": 3,
                                            "created_utc": 1612335494.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "Yep agree I said that in my first post. That part was just out of line and made no sense.",
                                            "author": "craa141",
                                            "id": "glvr2js",
                                            "parent_id": "t1_gltc1hl",
                                            "score": 1,
                                            "created_utc": 1612372209.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I see you may have posted a number which is most likely an amount in relations to an arrangement. If this is the case, you are violating Rule#4 - \"No dollar amounts that are in reference to allowance/PPM are allowed.\"\n\n\nIf you are curious about Allowances reported by SLF contributors please see the [Allowance Master Thread 2020-2021](https://www.reddit.com/r/sugarlifestyleforum/comments/ja37xt/allowance_master_thread_20202021/)\n\nYour post will not be approved until you remove the amount.  Please read the sub [Rules](https://www.reddit.com/r/sugarlifestyleforum/comments/748zta/updated_and_clarified_rules_for_slf/) prior to posting anything else. \n\nIf you simply posted a number not referencing a monetary amount, please message the MODs to approve your post.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/sugarlifestyleforum) if you have any questions or concerns.*",
            "author": "AutoModerator",
            "id": "glryz7j",
            "parent_id": "t3_lb5i3j",
            "score": 0,
            "created_utc": 1612297591.0,
            "replies": []
        },
        {
            "body": "It goes ways baby... and from what ive learned from others is live and learn be more selective; cut bait and dont loose too much sleep over it.\n\nLike he never heard of cashapp.  who needs to run to the bank.  lol\n\nbut you guys tried to reach full arrangement prior to m & g and were just going to jump in ?  or did you have M & G you should be able to feel these things out in person.\n\nWhen i have woman get real aggressive on offers before even mtg i just shut them down..",
            "author": "Buckeyechamp21",
            "id": "glsnhiv",
            "parent_id": "t3_lb5i3j",
            "score": -5,
            "created_utc": 1612307577.0,
            "replies": [
                {
                    "body": "I would never accept payment from a new SD through cash app. Maybe after a month of knowing each other, but the first few times are cash only!",
                    "author": "icarus_bent",
                    "id": "glt1v1v",
                    "parent_id": "t1_glsnhiv",
                    "score": 6,
                    "created_utc": 1612314428.0,
                    "replies": []
                },
                {
                    "body": "No cash app/venmo/PayPal/zelle etc with someone you don't know and trust. Payments can be reveresed. Cash only first few mts",
                    "author": "clair-cummings",
                    "id": "glt3aae",
                    "parent_id": "t1_glsnhiv",
                    "score": 4,
                    "created_utc": 1612315121.0,
                    "replies": [
                        {
                            "body": "If that worried you shouldn't be meeting on full date.",
                            "author": "Buckeyechamp21",
                            "id": "glt3j9g",
                            "parent_id": "t1_glt3aae",
                            "score": -5,
                            "created_utc": 1612315241.0,
                            "replies": [
                                {
                                    "body": "Uh, that's not how it works. Any LT/successful SB would never do this or take chances.",
                                    "author": "clair-cummings",
                                    "id": "glt4do6",
                                    "parent_id": "t1_glt3j9g",
                                    "score": 9,
                                    "created_utc": 1612315646.0,
                                    "replies": [
                                        {
                                            "body": "Clair.. I totally understand what you mean but moving 100% of the risk to the SD isn't the answer.  This is why so many women \"can't find a good SD\"  I suggest some of them did but then read on here to:\n\n* Not trust pictures\n* Not trust websites\n* not trust phone numbers\n* not trust cash (could be fake)\n* not trust cash apps \n* not trust email transfers (yes I have heard that before when they are not reversible in Canada). \n* not trust picture ID (yup)\n* not trust ....\n* not trust ...\n\nAll we can all do is our due diligence and protect ourselves from obvious scams but still, I am out cash for a car downpayment, countless M&G with no show, Macbook air and Iphone, probably half a dozen SOB stories from people on Reddit who needed a hand and received the payment via paypal. \n\nI am being overly dramatic as when I was doing that I was fully prepared to lose the money and in many cases never bothered to get the contact info as it was a gift so c'est la vie.",
                                            "author": "craa141",
                                            "id": "glta9sb",
                                            "parent_id": "t1_glt4do6",
                                            "score": -6,
                                            "created_utc": 1612318506.0,
                                            "replies": [
                                                {
                                                    "body": "None of this changes the fact that using any form of electronic payment for sugar before you know and trust somebody just isn’t fucking smart.",
                                                    "author": "FoxyFreckles1989",
                                                    "id": "gltfmnd",
                                                    "parent_id": "t1_glta9sb",
                                                    "score": 8,
                                                    "created_utc": 1612321157.0,
                                                    "replies": [
                                                        {
                                                            "body": "This. This is the answer.",
                                                            "author": "clair-cummings",
                                                            "id": "glu2xj9",
                                                            "parent_id": "t1_gltfmnd",
                                                            "score": 2,
                                                            "created_utc": 1612334733.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "body": "[deleted]",
                                                    "author": null,
                                                    "id": "gltta7r",
                                                    "parent_id": "t1_glta9sb",
                                                    "score": -2,
                                                    "created_utc": 1612328312.0,
                                                    "replies": [
                                                        {
                                                            "body": "No. That is being dumb and naive. The saying \"cash is king\" exists for this reason. I know of MANY SWs and SB's who have had payments reversed after the fact. I personally would be very leary to do this with someone I didn't know. Why is cash a problem?? You're not being as smart as you should be thinking like that. Unfortunately there really is no way to trust someone you have not seen over time. I would not take the risk.",
                                                            "author": "clair-cummings",
                                                            "id": "glu36ip",
                                                            "parent_id": "t1_gltta7r",
                                                            "score": 1,
                                                            "created_utc": 1612334923.0,
                                                            "replies": [
                                                                {
                                                                    "body": "[deleted]",
                                                                    "author": null,
                                                                    "id": "glwh8fg",
                                                                    "parent_id": "t1_glu36ip",
                                                                    "score": 1,
                                                                    "created_utc": 1612382634.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "Lol. That's the dumbest thing to say. \"Yall must run into the shady crowd\" 🤦‍♀️. Like no....I do things to prevent anything from going poorly or finding out something went wrong after the fact. I do not just blindly trust. Just bc you've had 2 SD's and never had it go wrong doesn't mean it doesn't or can't happen otherwise. I would NOT advise others along that line of thinking either.",
                                                                            "author": "clair-cummings",
                                                                            "id": "glzppp6",
                                                                            "parent_id": "t1_glwh8fg",
                                                                            "score": 1,
                                                                            "created_utc": 1612449893.0,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "body": "Sharing the CashApp isn’t the issue. This has nothing to do with identity. Payments can be reversed on apps like CashApp, PayPal and Venmo. You should never utilize an electronic payment until you’re sure you can trust someone. You can reverse sex, or cash in hand.",
                                                            "author": "FoxyFreckles1989",
                                                            "id": "glu3i9z",
                                                            "parent_id": "t1_gltta7r",
                                                            "score": 1,
                                                            "created_utc": 1612335172.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "It goes both ways... I've encountered two SBs the past few months who agreed to a weekly rate and arrangement details and then wanted to offer less while also expecting more allowance after a few visits, never keeping their word, etc.\n\nI don't disagree with the SD for splitting a weekly allowance down to visits, I think that makes sense and keeps both accountable.",
            "author": "anonydaddy0",
            "id": "glslxm6",
            "parent_id": "t3_lb5i3j",
            "score": -10,
            "created_utc": 1612306871.0,
            "replies": [
                {
                    "body": "> I don't disagree with the SD for splitting a weekly allowance down to visits, I\n\nThat's not really a weekly allowance then.  It's understandable to split a monthly allowance up at the start;  but even then, you aren't doing it on a per visit basis.  Per visit just makes it PPM.\n\n> and I see hosting and any room costs as a shared obligation\n\nUh, no.  Saying the allowance is changing because the cost of the hotel is fucking insane.  Let's not try to state otherwise.",
                    "author": "SDstartingOut",
                    "id": "glsq4cr",
                    "parent_id": "t1_glslxm6",
                    "score": 15,
                    "created_utc": 1612308793.0,
                    "replies": []
                },
                {
                    "body": "Hosting is a shared obligation? Why? A true SD is not hurting for the cost of hosting. If my SD told me that we will share the cost of hosting, I'd laugh myself to tears😂. So now i should be paying my SD for his time via the cost of the room. So, now im a sugar momma.😂😂",
                    "author": "motivatedviking",
                    "id": "glsp33s",
                    "parent_id": "t1_glslxm6",
                    "score": 15,
                    "created_utc": 1612308314.0,
                    "replies": [
                        {
                            "body": "Yah some people here are delusional. Lots of Splendas and Johns 🤦‍♀️",
                            "author": "clair-cummings",
                            "id": "glt3lxv",
                            "parent_id": "t1_glsp33s",
                            "score": 9,
                            "created_utc": 1612315278.0,
                            "replies": []
                        },
                        {
                            "body": "Agreed!",
                            "author": "motivatedviking",
                            "id": "glt3tlf",
                            "parent_id": "t1_glsp33s",
                            "score": 4,
                            "created_utc": 1612315379.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "well thats ppm not allowance.  and any SD is expected to pay for all dinner; drinks; hotel and factor that into his offer.",
                    "author": "Buckeyechamp21",
                    "id": "glso5kp",
                    "parent_id": "t1_glslxm6",
                    "score": 12,
                    "created_utc": 1612307887.0,
                    "replies": []
                },
                {
                    "body": "No. Hotel arrangements aren't \"shared\". That's something the SD is to arrange.",
                    "author": "clair-cummings",
                    "id": "glt3gs6",
                    "parent_id": "t1_glslxm6",
                    "score": 10,
                    "created_utc": 1612315208.0,
                    "replies": []
                },
                {
                    "body": "Sorry I explained poorly... what I mean is that yes obviously SD should cover the room if that's the plan, SB should never have to pay for anything... but the SB should also be somewhat flexible on allowance if an arrangement isn't able to work out financially as planned especially long term (Like I had a SB who wanted to keep seeing me after I was no longer able to host and she came up with the idea of less allowance to cover rooms)",
                    "author": "anonydaddy0",
                    "id": "glt81wb",
                    "parent_id": "t1_glslxm6",
                    "score": -4,
                    "created_utc": 1612317426.0,
                    "replies": [
                        {
                            "body": "No sugar baby should ever be responsible for the cost of anything that goes into the sugar relationship. That completely negates the entire purpose of said relationship. This includes subtracting from an allowance to cover the cost of rooms, drinks, gifts etc. \n\nIf a relationship cannot “work out financially as planned,” something is wrong. No man has any business calling himself a sugar daddy if he cannot manage to figure out a way to host without costing the sugar baby money. Yes, lowering an allowance to cover the cost of a room means the SB helped pay for said room. You directly contradicted yourself in claiming that sugaring should never cost the SB anything and then going on to say the rest. \n\nIn response to your initial comment, splitting a “weekly allowance” into equal, per-visit amounts is literally just PPM. My SD sends me my monthly allowance in two equal amounts every other Friday, regardless of when we’re seeing each other. *That* is an example of an acceptable way to split up an allowance.",
                            "author": "FoxyFreckles1989",
                            "id": "gltg1lh",
                            "parent_id": "t1_glt81wb",
                            "score": 8,
                            "created_utc": 1612321360.0,
                            "replies": []
                        },
                        {
                            "body": "Oh mylanta! Although she came up with the idea of less allowance I hope you didn't go with it. If you are a legit SD there is no reason why you would be ok with lowering your SBs allowance.",
                            "author": "LuluvioletSB",
                            "id": "glt90mo",
                            "parent_id": "t1_glt81wb",
                            "score": 6,
                            "created_utc": 1612317894.0,
                            "replies": [
                                {
                                    "body": "I know it's not easy for some to believe but not every SB is looking for a \"whale\" daddy or only in an arrangement for a large allowance. Many are perfectly happy with whatever they receive and care more about the connection, how they feel about someone. I reward these types with other perks like gifts or trips without them expecting it because they're truly special and well deserving of such and I feel inclined and happy to do so.",
                                    "author": "anonydaddy0",
                                    "id": "gltaops",
                                    "parent_id": "t1_glt90mo",
                                    "score": -6,
                                    "created_utc": 1612318712.0,
                                    "replies": [
                                        {
                                            "body": "Expecting the *agreed upon* allowance/terms from start to finish doesn’t mean a SB is just after a “whale” or only cares about money. 😂",
                                            "author": "FoxyFreckles1989",
                                            "id": "glthalo",
                                            "parent_id": "t1_gltaops",
                                            "score": 6,
                                            "created_utc": 1612321973.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Hop on Tinder where prospective guy matches will outnumber girls by 10 to one.",
            "author": "HappyBear1952",
            "id": "glu5ovx",
            "parent_id": "t3_lb5i3j",
            "score": 1,
            "created_utc": 1612336900.0,
            "replies": []
        },
        {
            "body": "Just block not worth your time",
            "author": "Zealousideal_Map8100",
            "id": "glwkfe9",
            "parent_id": "t3_lb5i3j",
            "score": 1,
            "created_utc": 1612383951.0,
            "replies": []
        },
        {
            "body": "absolutely... i only add not take away.  like if she has to come to me..yeah thats time and gas.  i will always add something extra.  \n\nThis guy wasnt a SD .. hell what he think a shared slushy and 2 for 1 hotdog at speedway was dinner.",
            "author": "Buckeyechamp21",
            "id": "glsnyrb",
            "parent_id": "t1_glscyrb",
            "score": 27,
            "created_utc": 1612307799.0,
            "replies": [
                {
                    "body": "Dead",
                    "author": "kinkonlyfans",
                    "id": "gltiraf",
                    "parent_id": "t1_glsnyrb",
                    "score": 5,
                    "created_utc": 1612322697.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "100% this. If he has to haggle he ain’t worth your time.",
            "author": "HotStool",
            "id": "glszcq1",
            "parent_id": "t1_glscyrb",
            "score": 13,
            "created_utc": 1612313212.0,
            "replies": []
        },
        {
            "body": "Agree. Every SD that ever tried to haggle with me turned out to have $$$ issues. Major red flag, just run.",
            "author": "jessjay1252",
            "id": "gltmf8m",
            "parent_id": "t1_glscyrb",
            "score": 11,
            "created_utc": 1612324549.0,
            "replies": []
        },
        {
            "body": "To have a successful sugar relationship you need to have an SD who\n\n- Respects you and wants you to have a successful experience \n\n- Is trustworthy \n\n- Has the assets to comfortably meet his commitments\n\n- Has comfort with a sugar relationship \n\n- Sugar relationship is compatible with the balance of his life\n\nPerhaps there can be some compromises but integrity and respect  are foundational.  There would be a lot fewer sad stories here if SB's used a similar checklist.",
            "author": "pinotandsugar",
            "id": "glwslh7",
            "parent_id": "t1_gltq6f1",
            "score": 3,
            "created_utc": 1612387265.0,
            "replies": [
                {
                    "body": "What are some red flags and green flags for profiles of a SD? Still trying to get a feel here",
                    "author": "Cult_of_Dionysus_",
                    "id": "gly1r59",
                    "parent_id": "t1_glwslh7",
                    "score": 1,
                    "created_utc": 1612408567.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I wish we could develop a better system to weed out POT SDs who can afford this without requiring POT to share their personal information (financial, ect.).\n\nStuff like these cheap SDs or tire kickers make the rest of the POT SDs look bad. I'd be curious to figure out what percentage of \"SDs\" on SA are actually true and can be a SD financially.",
            "author": null,
            "id": "gm0sgwe",
            "parent_id": "t1_gltq6f1",
            "score": 1,
            "created_utc": 1612465319.0,
            "replies": []
        },
        {
            "body": "More and more SB are getting sold on looks and then are SHOCKED when he turns out to be Splenda.\n\n\nI think there is a new trend of good looking males on SA trying to get laid for free. They realized that now Tinder is a dumpster, and that the hot ones moved to sugar dating. Every day we are hearing about some “28 year old SD” that’s burning an SB. \n\nI think OP is lowballing herself. She needs to start with a higher PPM.",
            "author": "UnearthlyDinosaur",
            "id": "glsdp65",
            "parent_id": "t1_glsbd7a",
            "score": 34,
            "created_utc": 1612303330.0,
            "replies": []
        },
        {
            "body": "Why shouldn't looks have anything to do with it? I'm certain most SDs pick based on looks and are willing to pay more for a more attractive SB so why do you think women should act and differently in the same scenario?",
            "author": "clashingtaco",
            "id": "gltgavo",
            "parent_id": "t1_glsbd7a",
            "score": 14,
            "created_utc": 1612321487.0,
            "replies": [
                {
                    "body": "It’s not really the same. An SD generally gives more for a more attractive woman because it would be difficult or even impossible to secure her with less.\n\nWhereas an SB could theoretically snag a “cute” guy any time she wants but she is in the bowl because she is valuing her relationships in a different way. \n\nIt’s like giving more to receive more versus accepting less to still kind of receive less.",
                    "author": "WandererOfInterwebs",
                    "id": "glu68vv",
                    "parent_id": "t1_gltgavo",
                    "score": 8,
                    "created_utc": 1612337343.0,
                    "replies": [
                        {
                            "body": "That really depends on where your priorities lie. I consider the entire experience - the man's personality, expectations of me, and his looks - to determine what I feel my time is worth in that scenario. Just as men will do the same when picking a SB. Sure I could snag a cute guy anytime just as I could snag a mediocre SD. But everything has a price and I would rather have a lower PPM and a more enjoyable experience.",
                            "author": "clashingtaco",
                            "id": "glu6jyk",
                            "parent_id": "t1_glu68vv",
                            "score": 9,
                            "created_utc": 1612337588.0,
                            "replies": []
                        },
                        {
                            "body": "> Whereas an SB could theoretically snag a “cute” guy any time she wants but she is in the bowl because she is valuing her relationships in a different way.\n\nYour assumption is that an SB's only goal is maximizing money. \n\nIf the goal is to have casual dating with someone she can enjoy + some additional help, pure money is not the only deciding factor.",
                            "author": "SDstartingOut",
                            "id": "glv24ii",
                            "parent_id": "t1_glu68vv",
                            "score": 5,
                            "created_utc": 1612361689.0,
                            "replies": [
                                {
                                    "body": "I never said “only goal” and didn’t even mention money Lmao.",
                                    "author": "WandererOfInterwebs",
                                    "id": "glv6agm",
                                    "parent_id": "t1_glv24ii",
                                    "score": 2,
                                    "created_utc": 1612363597.0,
                                    "replies": [
                                        {
                                            "body": "Another \"good looking SD\" trying to lesson the ego blow of paying for sex by convincing himself he pays a lower PPM than average.",
                                            "author": "sDsBsR",
                                            "id": "gly7a8m",
                                            "parent_id": "t1_glv6agm",
                                            "score": 1,
                                            "created_utc": 1612411456.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "> Why shouldn't looks have anything to do with it?\n\nNaturally the whole package should count,including appearance and attraction. But many(most?) SBs are primarily looking for a good provider and are shocked when they encounter a scammer or splenda. I'm just advising to pick a SD who can be that provider first, then factor in looks,personality,etc.  Young men are more likely to be more attractive to a peer female than older guys, but also less likely to stay with one girl or to be a provider.",
                    "author": "GSSD",
                    "id": "gluypp9",
                    "parent_id": "t1_gltgavo",
                    "score": 3,
                    "created_utc": 1612359970.0,
                    "replies": []
                },
                {
                    "body": "> Why shouldn't looks have anything to do with it? \n\nBecause he's 60+ years old :).\n\nTypically I've found on this sub, the older SDs tend to push this line.  The younger ones tend to view it the other way.",
                    "author": "SDstartingOut",
                    "id": "glv1y8d",
                    "parent_id": "t1_gltgavo",
                    "score": 1,
                    "created_utc": 1612361605.0,
                    "replies": [
                        {
                            "body": "He actually was on the younger side. His profile said he was 33. I typically try not to go so young because it’s almost always a let down. I should’ve known better.",
                            "author": "RobbiSosa",
                            "id": "glvtolr",
                            "parent_id": "t1_glv1y8d",
                            "score": 3,
                            "created_utc": 1612373252.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "This is so true, I'm mid 30s and play soccer so I'm fit.  If i had to guess I pay much lower than an overweight guy in his 60s.",
                    "author": "AdAlternative6041",
                    "id": "glvnxqf",
                    "parent_id": "t1_gltgavo",
                    "score": 1,
                    "created_utc": 1612370947.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Bit harsh.  Shes tailoring the allowance to his desirability.  Which doesn't necessarily reflect on his level of flakiness",
            "author": "wb19081908",
            "id": "gltd1a7",
            "parent_id": "t1_glsbd7a",
            "score": 10,
            "created_utc": 1612319883.0,
            "replies": []
        },
        {
            "body": "Hmmm... but if I think she is cute, I will gladly pay a little bit more (above what I usually offer) if she asks for it. Not sure what the difference is - if he is cute, she can accept less financial support?",
            "author": "BlBl_SD",
            "id": "gltbaay",
            "parent_id": "t1_glsbd7a",
            "score": 9,
            "created_utc": 1612319008.0,
            "replies": [
                {
                    "body": "Of course anyone *can* accept less. That doesn’t mean it’s a great idea. These are comparable issues, but not quite the same. While this doesn’t cover all SDs/SBs in the bowl, on a general basis SDs are looking for someone younger, fun and attractive; SBs are commonly looking for someone reliable, financially stable and kind. SDs giving a little more to a SB they find ridiculously hot (and hopefully interesting, compassionate and honest) is a little less risky than SBs accepting less than they *know* they need or want because a SD is “cute.” I’ve never entered into a SR with a SD I found *un*attractive, but I’ve also never chosen a more conventionally attractive SD based on looks alone while compromising my needs.",
                    "author": "FoxyFreckles1989",
                    "id": "glteycx",
                    "parent_id": "t1_gltbaay",
                    "score": 8,
                    "created_utc": 1612320830.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "gltsjkf",
                            "parent_id": "t1_glteycx",
                            "score": 9,
                            "created_utc": 1612327883.0,
                            "replies": [
                                {
                                    "body": "I never said that SDs don’t want someone who is reliable, stable and kind. I said it’s much more common for SDs to specifically look for someone young, attractive and fun and also went on to say that *hopefully* they consider other qualities, as well. \n\nI have never been concerned with only money. I’ve only been in SRs with SDs I truly enjoyed as people and found attractive in some way. You are looking at this backwards. Rather than thinking of it as though a SB might choose someone she finds less attractive for a little more money, consider that a SB shouldn’t accept *less* money *just* because she finds the SD making the offer more attractive than other POTs. \n\nI have an amount that I know I need out of a sugar relationship. I won’t make a huge compromise on that amount *just because* I think somebody is hot; the likelihood of my compromising at all on what I know I need, for any reason, is slim. That doesn’t mean that I would enter into a sugar relationship with someone I found *un*attractive for more than said amount, either.",
                                    "author": "FoxyFreckles1989",
                                    "id": "gltt8no",
                                    "parent_id": "t1_gltsjkf",
                                    "score": 3,
                                    "created_utc": 1612328287.0,
                                    "replies": [
                                        {
                                            "body": "Maybe the difference is that you need a certain amount. I don't need anything from my SD, it's just a nice perk of the arrangement. My priority isn't money, it's my enjoyment, and I certainly do enjoy spending time with a more attractive man.",
                                            "author": "clashingtaco",
                                            "id": "glvq4qw",
                                            "parent_id": "t1_gltt8no",
                                            "score": 2,
                                            "created_utc": 1612371833.0,
                                            "replies": [
                                                {
                                                    "body": "When I say “need,” I am referring to terms and conditions I’ve set for myself in order to enter a SR. I don’t need it to survive; I need it to feel comfortable. My priorities are comfort and enjoyment. I absolutely prefer a man I’m attracted to, and wouldn’t enter a SR otherwise.",
                                                    "author": "FoxyFreckles1989",
                                                    "id": "glwsidd",
                                                    "parent_id": "t1_glvq4qw",
                                                    "score": 1,
                                                    "created_utc": 1612387230.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "Ok, makes sense, thanks for that perspective!",
                            "author": "BlBl_SD",
                            "id": "gltfj43",
                            "parent_id": "t1_glteycx",
                            "score": 2,
                            "created_utc": 1612321109.0,
                            "replies": [
                                {
                                    "body": "No worries! Glad to help.",
                                    "author": "FoxyFreckles1989",
                                    "id": "gltggny",
                                    "parent_id": "t1_gltfj43",
                                    "score": 2,
                                    "created_utc": 1612321567.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Exactly lol",
                    "author": "wb19081908",
                    "id": "gltcxbs",
                    "parent_id": "t1_gltbaay",
                    "score": 0,
                    "created_utc": 1612319828.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "it's worked out swimmingly for me.  you have more cash you're willing to give up, i have some of my youth.\n\nthis scenario cuts both ways.  SBs tend to flake and want more cash for giving less.  both are the same thing.",
            "author": null,
            "id": "glsnlse",
            "parent_id": "t1_glsbd7a",
            "score": 1,
            "created_utc": 1612307633.0,
            "replies": []
        },
        {
            "body": "> Always go for PPM until you’ve at least spent a little bit of time together. There are certain scenarios in which going immediately to an allowance might be appropriate, but it’s certainly a risk for both parties involved, regardless. \n\nI do not understand this.  I very often start with a monthly allowance, split into bi-monthly at the start.  The first half happens on the first date (before intimacy), the second half happens on our first date on/after the 15th.\n\nI realize some view this is additional risk to me (as an SD).  I actually view it a way to reduce risk.  If a girl is willing to both sleep with me + literally fuck me over, losing the part of an allowance is a cheap cost to expose her true colors.  If we have a complete mismatch after intimacy - I can also walk away a bit more guilt free as she's getting a half month allowance.  (not just a single PPM).\n\nFrom her perspective, I'm not really sure the increased risk.  \n\nNow - someone pulling a bait & switch is a risk.  But that's a risk no matter what.  They can just easily pull PPM after intimacy, as they can pull allowance after intimacy.",
            "author": "SDstartingOut",
            "id": "glv1ttw",
            "parent_id": "t1_glte4ll",
            "score": 4,
            "created_utc": 1612361546.0,
            "replies": [
                {
                    "body": "Biweekly allowance is best way to start, assuming one day a week, so the second date is envelope free.",
                    "author": "darteduncle",
                    "id": "glw2lxw",
                    "parent_id": "t1_glv1ttw",
                    "score": 1,
                    "created_utc": 1612376733.0,
                    "replies": [
                        {
                            "body": "Eh.\n\nPersonally I will not do bi-weekly;  it is far too complicated for me.  I have a monthly budget, not a bi-weekly budget.",
                            "author": "SDstartingOut",
                            "id": "glw8mm3",
                            "parent_id": "t1_glw2lxw",
                            "score": 1,
                            "created_utc": 1612379105.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "the not sugaring out of desperation is so real. every time i’ve been taken advantage of it’s when i needed the money the most.",
            "author": "onlybadkatt",
            "id": "glulpsd",
            "parent_id": "t1_glte4ll",
            "score": 1,
            "created_utc": 1612351161.0,
            "replies": []
        },
        {
            "body": "Yeah I just don't think the men with the kind of money it actually takes to \"keep a woman\" are shopping on reddit, at least statistically, lol.",
            "author": null,
            "id": "gwdjp2d",
            "parent_id": "t1_gltzonm",
            "score": 1,
            "created_utc": 1619748420.0,
            "replies": []
        },
        {
            "body": "Who said anything about meeting in a hotel room? The plan was to have dinner and see where the night takes us. We had been playing tag on SA for about a week and finally traded numbers, but we both knew how we wanted things to go. What’s so wrong with that?",
            "author": "RobbiSosa",
            "id": "gltk5oy",
            "parent_id": "t1_gltctaj",
            "score": 2,
            "created_utc": 1612323391.0,
            "replies": [
                {
                    "body": "A platonic M&G would have avoided all of this. You could have seen if he takes you to an upscale resto or a cheap place/coffee and you’d have answered your own questions and not even needed to shave because... say it with me .... PLATONIC M&G",
                    "author": "morphine-me",
                    "id": "glu0odm",
                    "parent_id": "t1_gltk5oy",
                    "score": 5,
                    "created_utc": 1612333072.0,
                    "replies": []
                },
                {
                    "body": ">meeting in a hotel room? The plan was to have dinner and see where the night takes us.\n\nThe night needs to take you straight home after the public m&g, by yourself... every damn time. The protocol is there for a reason.",
                    "author": "bluelunarmonkey",
                    "id": "gltxho2",
                    "parent_id": "t1_gltk5oy",
                    "score": 6,
                    "created_utc": 1612330885.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Yea I always try to talk about allowances /ppm as soon as possible because the more you talk to them, the less you’ll want to charge them. Especially when their cute and nice.",
            "author": "RobbiSosa",
            "id": "glvrrzn",
            "parent_id": "t1_gluz1zg",
            "score": 3,
            "created_utc": 1612372491.0,
            "replies": [
                {
                    "body": "Soo true. I’m learning!",
                    "author": "No-Marzipan-4441",
                    "id": "glvyyr4",
                    "parent_id": "t1_glvrrzn",
                    "score": 1,
                    "created_utc": 1612375324.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Do you mean this generally speaking, or just at the beginning of a sugar relationship?",
            "author": "FoxyFreckles1989",
            "id": "gltf57r",
            "parent_id": "t1_glt3igt",
            "score": 2,
            "created_utc": 1612320924.0,
            "replies": [
                {
                    "body": "it’s happened both times to me.",
                    "author": "EntrepreneurDue8476",
                    "id": "glucy88",
                    "parent_id": "t1_gltf57r",
                    "score": 1,
                    "created_utc": 1612343214.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "That's not true. You don't give honey without money. You don't get to \"pay half now and give you the rest later\". You pay the agreed rate upfront upon mtng and the date continues. He tried to screw her out of getting the money. HE was the scammer here. Not her.\n\nHe wasn't willing to pay her full PPM. He wanted to only do half and pay the rest later. That's not how this works.",
            "author": "clair-cummings",
            "id": "glt2xd0",
            "parent_id": "t1_glsxyx0",
            "score": 18,
            "created_utc": 1612314946.0,
            "replies": [
                {
                    "body": "I am not calling her a scammer.  \n\nI am saying that in this \"someone has to go first\" in terms of trusting the other and I get that the SD should.  I don't have any issue with that.  I never said she should \"give honey first\" or implied that so please stop being dramatic. \n\nI am simply giving her a different perspective.  It doesn't mean he is either a scammer or a splenda daddy necessarily.  Meaning it may, but not guaranteed.  Most guys who have been in the bowl for any period of time have been scammed or have had to be really careful so his clumsy attempt to avoid being scammed (in his mind) may be all that it is. \n\nFor the kids in the back.. I am not accusing her of being a scammer, merely saying that her POT may have simply not trusted her and someone needs to take a leap of faith in the bowl and hope for the best.  That should be the SD.",
                    "author": "craa141",
                    "id": "glt9518",
                    "parent_id": "t1_glt2xd0",
                    "score": -1,
                    "created_utc": 1612317954.0,
                    "replies": [
                        {
                            "body": "I might feel more inclined to agree with this perspective if the dude hadn’t legitimately told OP he was going to subtract from her allowance for the price of the room and drinks. That *screams* Splenda.",
                            "author": "FoxyFreckles1989",
                            "id": "gltfbwe",
                            "parent_id": "t1_glt9518",
                            "score": 8,
                            "created_utc": 1612321014.0,
                            "replies": [
                                {
                                    "body": "Exactly. She had every reason to not trust him considering all the little red flags added up to one bigger one.",
                                    "author": "clair-cummings",
                                    "id": "glu3sx8",
                                    "parent_id": "t1_gltfbwe",
                                    "score": 2,
                                    "created_utc": 1612335405.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "Ok, get your point with half weekly allowance for first date due to trust etc. But reducing her allowance for more expensive hotel room, drinks, etc.? So every time hotel is more than x, he will take that off her allowance so he is ‘whole’? Nobody calls it scamming, but it is ... cheap. If he really was going to pay for it all with cash and was short on cash, maybe stop by the ATM or go back to the bank and get more $.",
                            "author": "BlBl_SD",
                            "id": "gltc1hl",
                            "parent_id": "t1_glt9518",
                            "score": 3,
                            "created_utc": 1612319386.0,
                            "replies": [
                                {
                                    "body": "Please. Stop caping for this Splenda daddy. He's cheap and he's not someone to deal with given how he's approached the situation. The fact that you keep trying to cape for him makes you look just as bad.",
                                    "author": "clair-cummings",
                                    "id": "glu3wzl",
                                    "parent_id": "t1_gltc1hl",
                                    "score": 3,
                                    "created_utc": 1612335494.0,
                                    "replies": []
                                },
                                {
                                    "body": "Yep agree I said that in my first post. That part was just out of line and made no sense.",
                                    "author": "craa141",
                                    "id": "glvr2js",
                                    "parent_id": "t1_gltc1hl",
                                    "score": 1,
                                    "created_utc": 1612372209.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I would never accept payment from a new SD through cash app. Maybe after a month of knowing each other, but the first few times are cash only!",
            "author": "icarus_bent",
            "id": "glt1v1v",
            "parent_id": "t1_glsnhiv",
            "score": 6,
            "created_utc": 1612314428.0,
            "replies": []
        },
        {
            "body": "No cash app/venmo/PayPal/zelle etc with someone you don't know and trust. Payments can be reveresed. Cash only first few mts",
            "author": "clair-cummings",
            "id": "glt3aae",
            "parent_id": "t1_glsnhiv",
            "score": 4,
            "created_utc": 1612315121.0,
            "replies": [
                {
                    "body": "If that worried you shouldn't be meeting on full date.",
                    "author": "Buckeyechamp21",
                    "id": "glt3j9g",
                    "parent_id": "t1_glt3aae",
                    "score": -5,
                    "created_utc": 1612315241.0,
                    "replies": [
                        {
                            "body": "Uh, that's not how it works. Any LT/successful SB would never do this or take chances.",
                            "author": "clair-cummings",
                            "id": "glt4do6",
                            "parent_id": "t1_glt3j9g",
                            "score": 9,
                            "created_utc": 1612315646.0,
                            "replies": [
                                {
                                    "body": "Clair.. I totally understand what you mean but moving 100% of the risk to the SD isn't the answer.  This is why so many women \"can't find a good SD\"  I suggest some of them did but then read on here to:\n\n* Not trust pictures\n* Not trust websites\n* not trust phone numbers\n* not trust cash (could be fake)\n* not trust cash apps \n* not trust email transfers (yes I have heard that before when they are not reversible in Canada). \n* not trust picture ID (yup)\n* not trust ....\n* not trust ...\n\nAll we can all do is our due diligence and protect ourselves from obvious scams but still, I am out cash for a car downpayment, countless M&G with no show, Macbook air and Iphone, probably half a dozen SOB stories from people on Reddit who needed a hand and received the payment via paypal. \n\nI am being overly dramatic as when I was doing that I was fully prepared to lose the money and in many cases never bothered to get the contact info as it was a gift so c'est la vie.",
                                    "author": "craa141",
                                    "id": "glta9sb",
                                    "parent_id": "t1_glt4do6",
                                    "score": -6,
                                    "created_utc": 1612318506.0,
                                    "replies": [
                                        {
                                            "body": "None of this changes the fact that using any form of electronic payment for sugar before you know and trust somebody just isn’t fucking smart.",
                                            "author": "FoxyFreckles1989",
                                            "id": "gltfmnd",
                                            "parent_id": "t1_glta9sb",
                                            "score": 8,
                                            "created_utc": 1612321157.0,
                                            "replies": [
                                                {
                                                    "body": "This. This is the answer.",
                                                    "author": "clair-cummings",
                                                    "id": "glu2xj9",
                                                    "parent_id": "t1_gltfmnd",
                                                    "score": 2,
                                                    "created_utc": 1612334733.0,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "body": "[deleted]",
                                            "author": null,
                                            "id": "gltta7r",
                                            "parent_id": "t1_glta9sb",
                                            "score": -2,
                                            "created_utc": 1612328312.0,
                                            "replies": [
                                                {
                                                    "body": "No. That is being dumb and naive. The saying \"cash is king\" exists for this reason. I know of MANY SWs and SB's who have had payments reversed after the fact. I personally would be very leary to do this with someone I didn't know. Why is cash a problem?? You're not being as smart as you should be thinking like that. Unfortunately there really is no way to trust someone you have not seen over time. I would not take the risk.",
                                                    "author": "clair-cummings",
                                                    "id": "glu36ip",
                                                    "parent_id": "t1_gltta7r",
                                                    "score": 1,
                                                    "created_utc": 1612334923.0,
                                                    "replies": [
                                                        {
                                                            "body": "[deleted]",
                                                            "author": null,
                                                            "id": "glwh8fg",
                                                            "parent_id": "t1_glu36ip",
                                                            "score": 1,
                                                            "created_utc": 1612382634.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Lol. That's the dumbest thing to say. \"Yall must run into the shady crowd\" 🤦‍♀️. Like no....I do things to prevent anything from going poorly or finding out something went wrong after the fact. I do not just blindly trust. Just bc you've had 2 SD's and never had it go wrong doesn't mean it doesn't or can't happen otherwise. I would NOT advise others along that line of thinking either.",
                                                                    "author": "clair-cummings",
                                                                    "id": "glzppp6",
                                                                    "parent_id": "t1_glwh8fg",
                                                                    "score": 1,
                                                                    "created_utc": 1612449893.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "body": "Sharing the CashApp isn’t the issue. This has nothing to do with identity. Payments can be reversed on apps like CashApp, PayPal and Venmo. You should never utilize an electronic payment until you’re sure you can trust someone. You can reverse sex, or cash in hand.",
                                                    "author": "FoxyFreckles1989",
                                                    "id": "glu3i9z",
                                                    "parent_id": "t1_gltta7r",
                                                    "score": 1,
                                                    "created_utc": 1612335172.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "> I don't disagree with the SD for splitting a weekly allowance down to visits, I\n\nThat's not really a weekly allowance then.  It's understandable to split a monthly allowance up at the start;  but even then, you aren't doing it on a per visit basis.  Per visit just makes it PPM.\n\n> and I see hosting and any room costs as a shared obligation\n\nUh, no.  Saying the allowance is changing because the cost of the hotel is fucking insane.  Let's not try to state otherwise.",
            "author": "SDstartingOut",
            "id": "glsq4cr",
            "parent_id": "t1_glslxm6",
            "score": 15,
            "created_utc": 1612308793.0,
            "replies": []
        },
        {
            "body": "Hosting is a shared obligation? Why? A true SD is not hurting for the cost of hosting. If my SD told me that we will share the cost of hosting, I'd laugh myself to tears😂. So now i should be paying my SD for his time via the cost of the room. So, now im a sugar momma.😂😂",
            "author": "motivatedviking",
            "id": "glsp33s",
            "parent_id": "t1_glslxm6",
            "score": 15,
            "created_utc": 1612308314.0,
            "replies": [
                {
                    "body": "Yah some people here are delusional. Lots of Splendas and Johns 🤦‍♀️",
                    "author": "clair-cummings",
                    "id": "glt3lxv",
                    "parent_id": "t1_glsp33s",
                    "score": 9,
                    "created_utc": 1612315278.0,
                    "replies": []
                },
                {
                    "body": "Agreed!",
                    "author": "motivatedviking",
                    "id": "glt3tlf",
                    "parent_id": "t1_glsp33s",
                    "score": 4,
                    "created_utc": 1612315379.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "well thats ppm not allowance.  and any SD is expected to pay for all dinner; drinks; hotel and factor that into his offer.",
            "author": "Buckeyechamp21",
            "id": "glso5kp",
            "parent_id": "t1_glslxm6",
            "score": 12,
            "created_utc": 1612307887.0,
            "replies": []
        },
        {
            "body": "No. Hotel arrangements aren't \"shared\". That's something the SD is to arrange.",
            "author": "clair-cummings",
            "id": "glt3gs6",
            "parent_id": "t1_glslxm6",
            "score": 10,
            "created_utc": 1612315208.0,
            "replies": []
        },
        {
            "body": "Sorry I explained poorly... what I mean is that yes obviously SD should cover the room if that's the plan, SB should never have to pay for anything... but the SB should also be somewhat flexible on allowance if an arrangement isn't able to work out financially as planned especially long term (Like I had a SB who wanted to keep seeing me after I was no longer able to host and she came up with the idea of less allowance to cover rooms)",
            "author": "anonydaddy0",
            "id": "glt81wb",
            "parent_id": "t1_glslxm6",
            "score": -4,
            "created_utc": 1612317426.0,
            "replies": [
                {
                    "body": "No sugar baby should ever be responsible for the cost of anything that goes into the sugar relationship. That completely negates the entire purpose of said relationship. This includes subtracting from an allowance to cover the cost of rooms, drinks, gifts etc. \n\nIf a relationship cannot “work out financially as planned,” something is wrong. No man has any business calling himself a sugar daddy if he cannot manage to figure out a way to host without costing the sugar baby money. Yes, lowering an allowance to cover the cost of a room means the SB helped pay for said room. You directly contradicted yourself in claiming that sugaring should never cost the SB anything and then going on to say the rest. \n\nIn response to your initial comment, splitting a “weekly allowance” into equal, per-visit amounts is literally just PPM. My SD sends me my monthly allowance in two equal amounts every other Friday, regardless of when we’re seeing each other. *That* is an example of an acceptable way to split up an allowance.",
                    "author": "FoxyFreckles1989",
                    "id": "gltg1lh",
                    "parent_id": "t1_glt81wb",
                    "score": 8,
                    "created_utc": 1612321360.0,
                    "replies": []
                },
                {
                    "body": "Oh mylanta! Although she came up with the idea of less allowance I hope you didn't go with it. If you are a legit SD there is no reason why you would be ok with lowering your SBs allowance.",
                    "author": "LuluvioletSB",
                    "id": "glt90mo",
                    "parent_id": "t1_glt81wb",
                    "score": 6,
                    "created_utc": 1612317894.0,
                    "replies": [
                        {
                            "body": "I know it's not easy for some to believe but not every SB is looking for a \"whale\" daddy or only in an arrangement for a large allowance. Many are perfectly happy with whatever they receive and care more about the connection, how they feel about someone. I reward these types with other perks like gifts or trips without them expecting it because they're truly special and well deserving of such and I feel inclined and happy to do so.",
                            "author": "anonydaddy0",
                            "id": "gltaops",
                            "parent_id": "t1_glt90mo",
                            "score": -6,
                            "created_utc": 1612318712.0,
                            "replies": [
                                {
                                    "body": "Expecting the *agreed upon* allowance/terms from start to finish doesn’t mean a SB is just after a “whale” or only cares about money. 😂",
                                    "author": "FoxyFreckles1989",
                                    "id": "glthalo",
                                    "parent_id": "t1_gltaops",
                                    "score": 6,
                                    "created_utc": 1612321973.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Dead",
            "author": "kinkonlyfans",
            "id": "gltiraf",
            "parent_id": "t1_glsnyrb",
            "score": 5,
            "created_utc": 1612322697.0,
            "replies": []
        },
        {
            "body": "What are some red flags and green flags for profiles of a SD? Still trying to get a feel here",
            "author": "Cult_of_Dionysus_",
            "id": "gly1r59",
            "parent_id": "t1_glwslh7",
            "score": 1,
            "created_utc": 1612408567.0,
            "replies": []
        },
        {
            "body": "It’s not really the same. An SD generally gives more for a more attractive woman because it would be difficult or even impossible to secure her with less.\n\nWhereas an SB could theoretically snag a “cute” guy any time she wants but she is in the bowl because she is valuing her relationships in a different way. \n\nIt’s like giving more to receive more versus accepting less to still kind of receive less.",
            "author": "WandererOfInterwebs",
            "id": "glu68vv",
            "parent_id": "t1_gltgavo",
            "score": 8,
            "created_utc": 1612337343.0,
            "replies": [
                {
                    "body": "That really depends on where your priorities lie. I consider the entire experience - the man's personality, expectations of me, and his looks - to determine what I feel my time is worth in that scenario. Just as men will do the same when picking a SB. Sure I could snag a cute guy anytime just as I could snag a mediocre SD. But everything has a price and I would rather have a lower PPM and a more enjoyable experience.",
                    "author": "clashingtaco",
                    "id": "glu6jyk",
                    "parent_id": "t1_glu68vv",
                    "score": 9,
                    "created_utc": 1612337588.0,
                    "replies": []
                },
                {
                    "body": "> Whereas an SB could theoretically snag a “cute” guy any time she wants but she is in the bowl because she is valuing her relationships in a different way.\n\nYour assumption is that an SB's only goal is maximizing money. \n\nIf the goal is to have casual dating with someone she can enjoy + some additional help, pure money is not the only deciding factor.",
                    "author": "SDstartingOut",
                    "id": "glv24ii",
                    "parent_id": "t1_glu68vv",
                    "score": 5,
                    "created_utc": 1612361689.0,
                    "replies": [
                        {
                            "body": "I never said “only goal” and didn’t even mention money Lmao.",
                            "author": "WandererOfInterwebs",
                            "id": "glv6agm",
                            "parent_id": "t1_glv24ii",
                            "score": 2,
                            "created_utc": 1612363597.0,
                            "replies": [
                                {
                                    "body": "Another \"good looking SD\" trying to lesson the ego blow of paying for sex by convincing himself he pays a lower PPM than average.",
                                    "author": "sDsBsR",
                                    "id": "gly7a8m",
                                    "parent_id": "t1_glv6agm",
                                    "score": 1,
                                    "created_utc": 1612411456.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "> Why shouldn't looks have anything to do with it?\n\nNaturally the whole package should count,including appearance and attraction. But many(most?) SBs are primarily looking for a good provider and are shocked when they encounter a scammer or splenda. I'm just advising to pick a SD who can be that provider first, then factor in looks,personality,etc.  Young men are more likely to be more attractive to a peer female than older guys, but also less likely to stay with one girl or to be a provider.",
            "author": "GSSD",
            "id": "gluypp9",
            "parent_id": "t1_gltgavo",
            "score": 3,
            "created_utc": 1612359970.0,
            "replies": []
        },
        {
            "body": "> Why shouldn't looks have anything to do with it? \n\nBecause he's 60+ years old :).\n\nTypically I've found on this sub, the older SDs tend to push this line.  The younger ones tend to view it the other way.",
            "author": "SDstartingOut",
            "id": "glv1y8d",
            "parent_id": "t1_gltgavo",
            "score": 1,
            "created_utc": 1612361605.0,
            "replies": [
                {
                    "body": "He actually was on the younger side. His profile said he was 33. I typically try not to go so young because it’s almost always a let down. I should’ve known better.",
                    "author": "RobbiSosa",
                    "id": "glvtolr",
                    "parent_id": "t1_glv1y8d",
                    "score": 3,
                    "created_utc": 1612373252.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "This is so true, I'm mid 30s and play soccer so I'm fit.  If i had to guess I pay much lower than an overweight guy in his 60s.",
            "author": "AdAlternative6041",
            "id": "glvnxqf",
            "parent_id": "t1_gltgavo",
            "score": 1,
            "created_utc": 1612370947.0,
            "replies": []
        },
        {
            "body": "Of course anyone *can* accept less. That doesn’t mean it’s a great idea. These are comparable issues, but not quite the same. While this doesn’t cover all SDs/SBs in the bowl, on a general basis SDs are looking for someone younger, fun and attractive; SBs are commonly looking for someone reliable, financially stable and kind. SDs giving a little more to a SB they find ridiculously hot (and hopefully interesting, compassionate and honest) is a little less risky than SBs accepting less than they *know* they need or want because a SD is “cute.” I’ve never entered into a SR with a SD I found *un*attractive, but I’ve also never chosen a more conventionally attractive SD based on looks alone while compromising my needs.",
            "author": "FoxyFreckles1989",
            "id": "glteycx",
            "parent_id": "t1_gltbaay",
            "score": 8,
            "created_utc": 1612320830.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "gltsjkf",
                    "parent_id": "t1_glteycx",
                    "score": 9,
                    "created_utc": 1612327883.0,
                    "replies": [
                        {
                            "body": "I never said that SDs don’t want someone who is reliable, stable and kind. I said it’s much more common for SDs to specifically look for someone young, attractive and fun and also went on to say that *hopefully* they consider other qualities, as well. \n\nI have never been concerned with only money. I’ve only been in SRs with SDs I truly enjoyed as people and found attractive in some way. You are looking at this backwards. Rather than thinking of it as though a SB might choose someone she finds less attractive for a little more money, consider that a SB shouldn’t accept *less* money *just* because she finds the SD making the offer more attractive than other POTs. \n\nI have an amount that I know I need out of a sugar relationship. I won’t make a huge compromise on that amount *just because* I think somebody is hot; the likelihood of my compromising at all on what I know I need, for any reason, is slim. That doesn’t mean that I would enter into a sugar relationship with someone I found *un*attractive for more than said amount, either.",
                            "author": "FoxyFreckles1989",
                            "id": "gltt8no",
                            "parent_id": "t1_gltsjkf",
                            "score": 3,
                            "created_utc": 1612328287.0,
                            "replies": [
                                {
                                    "body": "Maybe the difference is that you need a certain amount. I don't need anything from my SD, it's just a nice perk of the arrangement. My priority isn't money, it's my enjoyment, and I certainly do enjoy spending time with a more attractive man.",
                                    "author": "clashingtaco",
                                    "id": "glvq4qw",
                                    "parent_id": "t1_gltt8no",
                                    "score": 2,
                                    "created_utc": 1612371833.0,
                                    "replies": [
                                        {
                                            "body": "When I say “need,” I am referring to terms and conditions I’ve set for myself in order to enter a SR. I don’t need it to survive; I need it to feel comfortable. My priorities are comfort and enjoyment. I absolutely prefer a man I’m attracted to, and wouldn’t enter a SR otherwise.",
                                            "author": "FoxyFreckles1989",
                                            "id": "glwsidd",
                                            "parent_id": "t1_glvq4qw",
                                            "score": 1,
                                            "created_utc": 1612387230.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Ok, makes sense, thanks for that perspective!",
                    "author": "BlBl_SD",
                    "id": "gltfj43",
                    "parent_id": "t1_glteycx",
                    "score": 2,
                    "created_utc": 1612321109.0,
                    "replies": [
                        {
                            "body": "No worries! Glad to help.",
                            "author": "FoxyFreckles1989",
                            "id": "gltggny",
                            "parent_id": "t1_gltfj43",
                            "score": 2,
                            "created_utc": 1612321567.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Exactly lol",
            "author": "wb19081908",
            "id": "gltcxbs",
            "parent_id": "t1_gltbaay",
            "score": 0,
            "created_utc": 1612319828.0,
            "replies": []
        },
        {
            "body": "Biweekly allowance is best way to start, assuming one day a week, so the second date is envelope free.",
            "author": "darteduncle",
            "id": "glw2lxw",
            "parent_id": "t1_glv1ttw",
            "score": 1,
            "created_utc": 1612376733.0,
            "replies": [
                {
                    "body": "Eh.\n\nPersonally I will not do bi-weekly;  it is far too complicated for me.  I have a monthly budget, not a bi-weekly budget.",
                    "author": "SDstartingOut",
                    "id": "glw8mm3",
                    "parent_id": "t1_glw2lxw",
                    "score": 1,
                    "created_utc": 1612379105.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "A platonic M&G would have avoided all of this. You could have seen if he takes you to an upscale resto or a cheap place/coffee and you’d have answered your own questions and not even needed to shave because... say it with me .... PLATONIC M&G",
            "author": "morphine-me",
            "id": "glu0odm",
            "parent_id": "t1_gltk5oy",
            "score": 5,
            "created_utc": 1612333072.0,
            "replies": []
        },
        {
            "body": ">meeting in a hotel room? The plan was to have dinner and see where the night takes us.\n\nThe night needs to take you straight home after the public m&g, by yourself... every damn time. The protocol is there for a reason.",
            "author": "bluelunarmonkey",
            "id": "gltxho2",
            "parent_id": "t1_gltk5oy",
            "score": 6,
            "created_utc": 1612330885.0,
            "replies": []
        },
        {
            "body": "Soo true. I’m learning!",
            "author": "No-Marzipan-4441",
            "id": "glvyyr4",
            "parent_id": "t1_glvrrzn",
            "score": 1,
            "created_utc": 1612375324.0,
            "replies": []
        },
        {
            "body": "it’s happened both times to me.",
            "author": "EntrepreneurDue8476",
            "id": "glucy88",
            "parent_id": "t1_gltf57r",
            "score": 1,
            "created_utc": 1612343214.0,
            "replies": []
        },
        {
            "body": "I am not calling her a scammer.  \n\nI am saying that in this \"someone has to go first\" in terms of trusting the other and I get that the SD should.  I don't have any issue with that.  I never said she should \"give honey first\" or implied that so please stop being dramatic. \n\nI am simply giving her a different perspective.  It doesn't mean he is either a scammer or a splenda daddy necessarily.  Meaning it may, but not guaranteed.  Most guys who have been in the bowl for any period of time have been scammed or have had to be really careful so his clumsy attempt to avoid being scammed (in his mind) may be all that it is. \n\nFor the kids in the back.. I am not accusing her of being a scammer, merely saying that her POT may have simply not trusted her and someone needs to take a leap of faith in the bowl and hope for the best.  That should be the SD.",
            "author": "craa141",
            "id": "glt9518",
            "parent_id": "t1_glt2xd0",
            "score": -1,
            "created_utc": 1612317954.0,
            "replies": [
                {
                    "body": "I might feel more inclined to agree with this perspective if the dude hadn’t legitimately told OP he was going to subtract from her allowance for the price of the room and drinks. That *screams* Splenda.",
                    "author": "FoxyFreckles1989",
                    "id": "gltfbwe",
                    "parent_id": "t1_glt9518",
                    "score": 8,
                    "created_utc": 1612321014.0,
                    "replies": [
                        {
                            "body": "Exactly. She had every reason to not trust him considering all the little red flags added up to one bigger one.",
                            "author": "clair-cummings",
                            "id": "glu3sx8",
                            "parent_id": "t1_gltfbwe",
                            "score": 2,
                            "created_utc": 1612335405.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Ok, get your point with half weekly allowance for first date due to trust etc. But reducing her allowance for more expensive hotel room, drinks, etc.? So every time hotel is more than x, he will take that off her allowance so he is ‘whole’? Nobody calls it scamming, but it is ... cheap. If he really was going to pay for it all with cash and was short on cash, maybe stop by the ATM or go back to the bank and get more $.",
                    "author": "BlBl_SD",
                    "id": "gltc1hl",
                    "parent_id": "t1_glt9518",
                    "score": 3,
                    "created_utc": 1612319386.0,
                    "replies": [
                        {
                            "body": "Please. Stop caping for this Splenda daddy. He's cheap and he's not someone to deal with given how he's approached the situation. The fact that you keep trying to cape for him makes you look just as bad.",
                            "author": "clair-cummings",
                            "id": "glu3wzl",
                            "parent_id": "t1_gltc1hl",
                            "score": 3,
                            "created_utc": 1612335494.0,
                            "replies": []
                        },
                        {
                            "body": "Yep agree I said that in my first post. That part was just out of line and made no sense.",
                            "author": "craa141",
                            "id": "glvr2js",
                            "parent_id": "t1_gltc1hl",
                            "score": 1,
                            "created_utc": 1612372209.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "If that worried you shouldn't be meeting on full date.",
            "author": "Buckeyechamp21",
            "id": "glt3j9g",
            "parent_id": "t1_glt3aae",
            "score": -5,
            "created_utc": 1612315241.0,
            "replies": [
                {
                    "body": "Uh, that's not how it works. Any LT/successful SB would never do this or take chances.",
                    "author": "clair-cummings",
                    "id": "glt4do6",
                    "parent_id": "t1_glt3j9g",
                    "score": 9,
                    "created_utc": 1612315646.0,
                    "replies": [
                        {
                            "body": "Clair.. I totally understand what you mean but moving 100% of the risk to the SD isn't the answer.  This is why so many women \"can't find a good SD\"  I suggest some of them did but then read on here to:\n\n* Not trust pictures\n* Not trust websites\n* not trust phone numbers\n* not trust cash (could be fake)\n* not trust cash apps \n* not trust email transfers (yes I have heard that before when they are not reversible in Canada). \n* not trust picture ID (yup)\n* not trust ....\n* not trust ...\n\nAll we can all do is our due diligence and protect ourselves from obvious scams but still, I am out cash for a car downpayment, countless M&G with no show, Macbook air and Iphone, probably half a dozen SOB stories from people on Reddit who needed a hand and received the payment via paypal. \n\nI am being overly dramatic as when I was doing that I was fully prepared to lose the money and in many cases never bothered to get the contact info as it was a gift so c'est la vie.",
                            "author": "craa141",
                            "id": "glta9sb",
                            "parent_id": "t1_glt4do6",
                            "score": -6,
                            "created_utc": 1612318506.0,
                            "replies": [
                                {
                                    "body": "None of this changes the fact that using any form of electronic payment for sugar before you know and trust somebody just isn’t fucking smart.",
                                    "author": "FoxyFreckles1989",
                                    "id": "gltfmnd",
                                    "parent_id": "t1_glta9sb",
                                    "score": 8,
                                    "created_utc": 1612321157.0,
                                    "replies": [
                                        {
                                            "body": "This. This is the answer.",
                                            "author": "clair-cummings",
                                            "id": "glu2xj9",
                                            "parent_id": "t1_gltfmnd",
                                            "score": 2,
                                            "created_utc": 1612334733.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "gltta7r",
                                    "parent_id": "t1_glta9sb",
                                    "score": -2,
                                    "created_utc": 1612328312.0,
                                    "replies": [
                                        {
                                            "body": "No. That is being dumb and naive. The saying \"cash is king\" exists for this reason. I know of MANY SWs and SB's who have had payments reversed after the fact. I personally would be very leary to do this with someone I didn't know. Why is cash a problem?? You're not being as smart as you should be thinking like that. Unfortunately there really is no way to trust someone you have not seen over time. I would not take the risk.",
                                            "author": "clair-cummings",
                                            "id": "glu36ip",
                                            "parent_id": "t1_gltta7r",
                                            "score": 1,
                                            "created_utc": 1612334923.0,
                                            "replies": [
                                                {
                                                    "body": "[deleted]",
                                                    "author": null,
                                                    "id": "glwh8fg",
                                                    "parent_id": "t1_glu36ip",
                                                    "score": 1,
                                                    "created_utc": 1612382634.0,
                                                    "replies": [
                                                        {
                                                            "body": "Lol. That's the dumbest thing to say. \"Yall must run into the shady crowd\" 🤦‍♀️. Like no....I do things to prevent anything from going poorly or finding out something went wrong after the fact. I do not just blindly trust. Just bc you've had 2 SD's and never had it go wrong doesn't mean it doesn't or can't happen otherwise. I would NOT advise others along that line of thinking either.",
                                                            "author": "clair-cummings",
                                                            "id": "glzppp6",
                                                            "parent_id": "t1_glwh8fg",
                                                            "score": 1,
                                                            "created_utc": 1612449893.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "body": "Sharing the CashApp isn’t the issue. This has nothing to do with identity. Payments can be reversed on apps like CashApp, PayPal and Venmo. You should never utilize an electronic payment until you’re sure you can trust someone. You can reverse sex, or cash in hand.",
                                            "author": "FoxyFreckles1989",
                                            "id": "glu3i9z",
                                            "parent_id": "t1_gltta7r",
                                            "score": 1,
                                            "created_utc": 1612335172.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Yah some people here are delusional. Lots of Splendas and Johns 🤦‍♀️",
            "author": "clair-cummings",
            "id": "glt3lxv",
            "parent_id": "t1_glsp33s",
            "score": 9,
            "created_utc": 1612315278.0,
            "replies": []
        },
        {
            "body": "Agreed!",
            "author": "motivatedviking",
            "id": "glt3tlf",
            "parent_id": "t1_glsp33s",
            "score": 4,
            "created_utc": 1612315379.0,
            "replies": []
        },
        {
            "body": "No sugar baby should ever be responsible for the cost of anything that goes into the sugar relationship. That completely negates the entire purpose of said relationship. This includes subtracting from an allowance to cover the cost of rooms, drinks, gifts etc. \n\nIf a relationship cannot “work out financially as planned,” something is wrong. No man has any business calling himself a sugar daddy if he cannot manage to figure out a way to host without costing the sugar baby money. Yes, lowering an allowance to cover the cost of a room means the SB helped pay for said room. You directly contradicted yourself in claiming that sugaring should never cost the SB anything and then going on to say the rest. \n\nIn response to your initial comment, splitting a “weekly allowance” into equal, per-visit amounts is literally just PPM. My SD sends me my monthly allowance in two equal amounts every other Friday, regardless of when we’re seeing each other. *That* is an example of an acceptable way to split up an allowance.",
            "author": "FoxyFreckles1989",
            "id": "gltg1lh",
            "parent_id": "t1_glt81wb",
            "score": 8,
            "created_utc": 1612321360.0,
            "replies": []
        },
        {
            "body": "Oh mylanta! Although she came up with the idea of less allowance I hope you didn't go with it. If you are a legit SD there is no reason why you would be ok with lowering your SBs allowance.",
            "author": "LuluvioletSB",
            "id": "glt90mo",
            "parent_id": "t1_glt81wb",
            "score": 6,
            "created_utc": 1612317894.0,
            "replies": [
                {
                    "body": "I know it's not easy for some to believe but not every SB is looking for a \"whale\" daddy or only in an arrangement for a large allowance. Many are perfectly happy with whatever they receive and care more about the connection, how they feel about someone. I reward these types with other perks like gifts or trips without them expecting it because they're truly special and well deserving of such and I feel inclined and happy to do so.",
                    "author": "anonydaddy0",
                    "id": "gltaops",
                    "parent_id": "t1_glt90mo",
                    "score": -6,
                    "created_utc": 1612318712.0,
                    "replies": [
                        {
                            "body": "Expecting the *agreed upon* allowance/terms from start to finish doesn’t mean a SB is just after a “whale” or only cares about money. 😂",
                            "author": "FoxyFreckles1989",
                            "id": "glthalo",
                            "parent_id": "t1_gltaops",
                            "score": 6,
                            "created_utc": 1612321973.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "That really depends on where your priorities lie. I consider the entire experience - the man's personality, expectations of me, and his looks - to determine what I feel my time is worth in that scenario. Just as men will do the same when picking a SB. Sure I could snag a cute guy anytime just as I could snag a mediocre SD. But everything has a price and I would rather have a lower PPM and a more enjoyable experience.",
            "author": "clashingtaco",
            "id": "glu6jyk",
            "parent_id": "t1_glu68vv",
            "score": 9,
            "created_utc": 1612337588.0,
            "replies": []
        },
        {
            "body": "> Whereas an SB could theoretically snag a “cute” guy any time she wants but she is in the bowl because she is valuing her relationships in a different way.\n\nYour assumption is that an SB's only goal is maximizing money. \n\nIf the goal is to have casual dating with someone she can enjoy + some additional help, pure money is not the only deciding factor.",
            "author": "SDstartingOut",
            "id": "glv24ii",
            "parent_id": "t1_glu68vv",
            "score": 5,
            "created_utc": 1612361689.0,
            "replies": [
                {
                    "body": "I never said “only goal” and didn’t even mention money Lmao.",
                    "author": "WandererOfInterwebs",
                    "id": "glv6agm",
                    "parent_id": "t1_glv24ii",
                    "score": 2,
                    "created_utc": 1612363597.0,
                    "replies": [
                        {
                            "body": "Another \"good looking SD\" trying to lesson the ego blow of paying for sex by convincing himself he pays a lower PPM than average.",
                            "author": "sDsBsR",
                            "id": "gly7a8m",
                            "parent_id": "t1_glv6agm",
                            "score": 1,
                            "created_utc": 1612411456.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "He actually was on the younger side. His profile said he was 33. I typically try not to go so young because it’s almost always a let down. I should’ve known better.",
            "author": "RobbiSosa",
            "id": "glvtolr",
            "parent_id": "t1_glv1y8d",
            "score": 3,
            "created_utc": 1612373252.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gltsjkf",
            "parent_id": "t1_glteycx",
            "score": 9,
            "created_utc": 1612327883.0,
            "replies": [
                {
                    "body": "I never said that SDs don’t want someone who is reliable, stable and kind. I said it’s much more common for SDs to specifically look for someone young, attractive and fun and also went on to say that *hopefully* they consider other qualities, as well. \n\nI have never been concerned with only money. I’ve only been in SRs with SDs I truly enjoyed as people and found attractive in some way. You are looking at this backwards. Rather than thinking of it as though a SB might choose someone she finds less attractive for a little more money, consider that a SB shouldn’t accept *less* money *just* because she finds the SD making the offer more attractive than other POTs. \n\nI have an amount that I know I need out of a sugar relationship. I won’t make a huge compromise on that amount *just because* I think somebody is hot; the likelihood of my compromising at all on what I know I need, for any reason, is slim. That doesn’t mean that I would enter into a sugar relationship with someone I found *un*attractive for more than said amount, either.",
                    "author": "FoxyFreckles1989",
                    "id": "gltt8no",
                    "parent_id": "t1_gltsjkf",
                    "score": 3,
                    "created_utc": 1612328287.0,
                    "replies": [
                        {
                            "body": "Maybe the difference is that you need a certain amount. I don't need anything from my SD, it's just a nice perk of the arrangement. My priority isn't money, it's my enjoyment, and I certainly do enjoy spending time with a more attractive man.",
                            "author": "clashingtaco",
                            "id": "glvq4qw",
                            "parent_id": "t1_gltt8no",
                            "score": 2,
                            "created_utc": 1612371833.0,
                            "replies": [
                                {
                                    "body": "When I say “need,” I am referring to terms and conditions I’ve set for myself in order to enter a SR. I don’t need it to survive; I need it to feel comfortable. My priorities are comfort and enjoyment. I absolutely prefer a man I’m attracted to, and wouldn’t enter a SR otherwise.",
                                    "author": "FoxyFreckles1989",
                                    "id": "glwsidd",
                                    "parent_id": "t1_glvq4qw",
                                    "score": 1,
                                    "created_utc": 1612387230.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Ok, makes sense, thanks for that perspective!",
            "author": "BlBl_SD",
            "id": "gltfj43",
            "parent_id": "t1_glteycx",
            "score": 2,
            "created_utc": 1612321109.0,
            "replies": [
                {
                    "body": "No worries! Glad to help.",
                    "author": "FoxyFreckles1989",
                    "id": "gltggny",
                    "parent_id": "t1_gltfj43",
                    "score": 2,
                    "created_utc": 1612321567.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Eh.\n\nPersonally I will not do bi-weekly;  it is far too complicated for me.  I have a monthly budget, not a bi-weekly budget.",
            "author": "SDstartingOut",
            "id": "glw8mm3",
            "parent_id": "t1_glw2lxw",
            "score": 1,
            "created_utc": 1612379105.0,
            "replies": []
        },
        {
            "body": "I might feel more inclined to agree with this perspective if the dude hadn’t legitimately told OP he was going to subtract from her allowance for the price of the room and drinks. That *screams* Splenda.",
            "author": "FoxyFreckles1989",
            "id": "gltfbwe",
            "parent_id": "t1_glt9518",
            "score": 8,
            "created_utc": 1612321014.0,
            "replies": [
                {
                    "body": "Exactly. She had every reason to not trust him considering all the little red flags added up to one bigger one.",
                    "author": "clair-cummings",
                    "id": "glu3sx8",
                    "parent_id": "t1_gltfbwe",
                    "score": 2,
                    "created_utc": 1612335405.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Ok, get your point with half weekly allowance for first date due to trust etc. But reducing her allowance for more expensive hotel room, drinks, etc.? So every time hotel is more than x, he will take that off her allowance so he is ‘whole’? Nobody calls it scamming, but it is ... cheap. If he really was going to pay for it all with cash and was short on cash, maybe stop by the ATM or go back to the bank and get more $.",
            "author": "BlBl_SD",
            "id": "gltc1hl",
            "parent_id": "t1_glt9518",
            "score": 3,
            "created_utc": 1612319386.0,
            "replies": [
                {
                    "body": "Please. Stop caping for this Splenda daddy. He's cheap and he's not someone to deal with given how he's approached the situation. The fact that you keep trying to cape for him makes you look just as bad.",
                    "author": "clair-cummings",
                    "id": "glu3wzl",
                    "parent_id": "t1_gltc1hl",
                    "score": 3,
                    "created_utc": 1612335494.0,
                    "replies": []
                },
                {
                    "body": "Yep agree I said that in my first post. That part was just out of line and made no sense.",
                    "author": "craa141",
                    "id": "glvr2js",
                    "parent_id": "t1_gltc1hl",
                    "score": 1,
                    "created_utc": 1612372209.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Uh, that's not how it works. Any LT/successful SB would never do this or take chances.",
            "author": "clair-cummings",
            "id": "glt4do6",
            "parent_id": "t1_glt3j9g",
            "score": 9,
            "created_utc": 1612315646.0,
            "replies": [
                {
                    "body": "Clair.. I totally understand what you mean but moving 100% of the risk to the SD isn't the answer.  This is why so many women \"can't find a good SD\"  I suggest some of them did but then read on here to:\n\n* Not trust pictures\n* Not trust websites\n* not trust phone numbers\n* not trust cash (could be fake)\n* not trust cash apps \n* not trust email transfers (yes I have heard that before when they are not reversible in Canada). \n* not trust picture ID (yup)\n* not trust ....\n* not trust ...\n\nAll we can all do is our due diligence and protect ourselves from obvious scams but still, I am out cash for a car downpayment, countless M&G with no show, Macbook air and Iphone, probably half a dozen SOB stories from people on Reddit who needed a hand and received the payment via paypal. \n\nI am being overly dramatic as when I was doing that I was fully prepared to lose the money and in many cases never bothered to get the contact info as it was a gift so c'est la vie.",
                    "author": "craa141",
                    "id": "glta9sb",
                    "parent_id": "t1_glt4do6",
                    "score": -6,
                    "created_utc": 1612318506.0,
                    "replies": [
                        {
                            "body": "None of this changes the fact that using any form of electronic payment for sugar before you know and trust somebody just isn’t fucking smart.",
                            "author": "FoxyFreckles1989",
                            "id": "gltfmnd",
                            "parent_id": "t1_glta9sb",
                            "score": 8,
                            "created_utc": 1612321157.0,
                            "replies": [
                                {
                                    "body": "This. This is the answer.",
                                    "author": "clair-cummings",
                                    "id": "glu2xj9",
                                    "parent_id": "t1_gltfmnd",
                                    "score": 2,
                                    "created_utc": 1612334733.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "gltta7r",
                            "parent_id": "t1_glta9sb",
                            "score": -2,
                            "created_utc": 1612328312.0,
                            "replies": [
                                {
                                    "body": "No. That is being dumb and naive. The saying \"cash is king\" exists for this reason. I know of MANY SWs and SB's who have had payments reversed after the fact. I personally would be very leary to do this with someone I didn't know. Why is cash a problem?? You're not being as smart as you should be thinking like that. Unfortunately there really is no way to trust someone you have not seen over time. I would not take the risk.",
                                    "author": "clair-cummings",
                                    "id": "glu36ip",
                                    "parent_id": "t1_gltta7r",
                                    "score": 1,
                                    "created_utc": 1612334923.0,
                                    "replies": [
                                        {
                                            "body": "[deleted]",
                                            "author": null,
                                            "id": "glwh8fg",
                                            "parent_id": "t1_glu36ip",
                                            "score": 1,
                                            "created_utc": 1612382634.0,
                                            "replies": [
                                                {
                                                    "body": "Lol. That's the dumbest thing to say. \"Yall must run into the shady crowd\" 🤦‍♀️. Like no....I do things to prevent anything from going poorly or finding out something went wrong after the fact. I do not just blindly trust. Just bc you've had 2 SD's and never had it go wrong doesn't mean it doesn't or can't happen otherwise. I would NOT advise others along that line of thinking either.",
                                                    "author": "clair-cummings",
                                                    "id": "glzppp6",
                                                    "parent_id": "t1_glwh8fg",
                                                    "score": 1,
                                                    "created_utc": 1612449893.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "Sharing the CashApp isn’t the issue. This has nothing to do with identity. Payments can be reversed on apps like CashApp, PayPal and Venmo. You should never utilize an electronic payment until you’re sure you can trust someone. You can reverse sex, or cash in hand.",
                                    "author": "FoxyFreckles1989",
                                    "id": "glu3i9z",
                                    "parent_id": "t1_gltta7r",
                                    "score": 1,
                                    "created_utc": 1612335172.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I know it's not easy for some to believe but not every SB is looking for a \"whale\" daddy or only in an arrangement for a large allowance. Many are perfectly happy with whatever they receive and care more about the connection, how they feel about someone. I reward these types with other perks like gifts or trips without them expecting it because they're truly special and well deserving of such and I feel inclined and happy to do so.",
            "author": "anonydaddy0",
            "id": "gltaops",
            "parent_id": "t1_glt90mo",
            "score": -6,
            "created_utc": 1612318712.0,
            "replies": [
                {
                    "body": "Expecting the *agreed upon* allowance/terms from start to finish doesn’t mean a SB is just after a “whale” or only cares about money. 😂",
                    "author": "FoxyFreckles1989",
                    "id": "glthalo",
                    "parent_id": "t1_gltaops",
                    "score": 6,
                    "created_utc": 1612321973.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I never said “only goal” and didn’t even mention money Lmao.",
            "author": "WandererOfInterwebs",
            "id": "glv6agm",
            "parent_id": "t1_glv24ii",
            "score": 2,
            "created_utc": 1612363597.0,
            "replies": [
                {
                    "body": "Another \"good looking SD\" trying to lesson the ego blow of paying for sex by convincing himself he pays a lower PPM than average.",
                    "author": "sDsBsR",
                    "id": "gly7a8m",
                    "parent_id": "t1_glv6agm",
                    "score": 1,
                    "created_utc": 1612411456.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I never said that SDs don’t want someone who is reliable, stable and kind. I said it’s much more common for SDs to specifically look for someone young, attractive and fun and also went on to say that *hopefully* they consider other qualities, as well. \n\nI have never been concerned with only money. I’ve only been in SRs with SDs I truly enjoyed as people and found attractive in some way. You are looking at this backwards. Rather than thinking of it as though a SB might choose someone she finds less attractive for a little more money, consider that a SB shouldn’t accept *less* money *just* because she finds the SD making the offer more attractive than other POTs. \n\nI have an amount that I know I need out of a sugar relationship. I won’t make a huge compromise on that amount *just because* I think somebody is hot; the likelihood of my compromising at all on what I know I need, for any reason, is slim. That doesn’t mean that I would enter into a sugar relationship with someone I found *un*attractive for more than said amount, either.",
            "author": "FoxyFreckles1989",
            "id": "gltt8no",
            "parent_id": "t1_gltsjkf",
            "score": 3,
            "created_utc": 1612328287.0,
            "replies": [
                {
                    "body": "Maybe the difference is that you need a certain amount. I don't need anything from my SD, it's just a nice perk of the arrangement. My priority isn't money, it's my enjoyment, and I certainly do enjoy spending time with a more attractive man.",
                    "author": "clashingtaco",
                    "id": "glvq4qw",
                    "parent_id": "t1_gltt8no",
                    "score": 2,
                    "created_utc": 1612371833.0,
                    "replies": [
                        {
                            "body": "When I say “need,” I am referring to terms and conditions I’ve set for myself in order to enter a SR. I don’t need it to survive; I need it to feel comfortable. My priorities are comfort and enjoyment. I absolutely prefer a man I’m attracted to, and wouldn’t enter a SR otherwise.",
                            "author": "FoxyFreckles1989",
                            "id": "glwsidd",
                            "parent_id": "t1_glvq4qw",
                            "score": 1,
                            "created_utc": 1612387230.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "No worries! Glad to help.",
            "author": "FoxyFreckles1989",
            "id": "gltggny",
            "parent_id": "t1_gltfj43",
            "score": 2,
            "created_utc": 1612321567.0,
            "replies": []
        },
        {
            "body": "Exactly. She had every reason to not trust him considering all the little red flags added up to one bigger one.",
            "author": "clair-cummings",
            "id": "glu3sx8",
            "parent_id": "t1_gltfbwe",
            "score": 2,
            "created_utc": 1612335405.0,
            "replies": []
        },
        {
            "body": "Please. Stop caping for this Splenda daddy. He's cheap and he's not someone to deal with given how he's approached the situation. The fact that you keep trying to cape for him makes you look just as bad.",
            "author": "clair-cummings",
            "id": "glu3wzl",
            "parent_id": "t1_gltc1hl",
            "score": 3,
            "created_utc": 1612335494.0,
            "replies": []
        },
        {
            "body": "Yep agree I said that in my first post. That part was just out of line and made no sense.",
            "author": "craa141",
            "id": "glvr2js",
            "parent_id": "t1_gltc1hl",
            "score": 1,
            "created_utc": 1612372209.0,
            "replies": []
        },
        {
            "body": "Clair.. I totally understand what you mean but moving 100% of the risk to the SD isn't the answer.  This is why so many women \"can't find a good SD\"  I suggest some of them did but then read on here to:\n\n* Not trust pictures\n* Not trust websites\n* not trust phone numbers\n* not trust cash (could be fake)\n* not trust cash apps \n* not trust email transfers (yes I have heard that before when they are not reversible in Canada). \n* not trust picture ID (yup)\n* not trust ....\n* not trust ...\n\nAll we can all do is our due diligence and protect ourselves from obvious scams but still, I am out cash for a car downpayment, countless M&G with no show, Macbook air and Iphone, probably half a dozen SOB stories from people on Reddit who needed a hand and received the payment via paypal. \n\nI am being overly dramatic as when I was doing that I was fully prepared to lose the money and in many cases never bothered to get the contact info as it was a gift so c'est la vie.",
            "author": "craa141",
            "id": "glta9sb",
            "parent_id": "t1_glt4do6",
            "score": -6,
            "created_utc": 1612318506.0,
            "replies": [
                {
                    "body": "None of this changes the fact that using any form of electronic payment for sugar before you know and trust somebody just isn’t fucking smart.",
                    "author": "FoxyFreckles1989",
                    "id": "gltfmnd",
                    "parent_id": "t1_glta9sb",
                    "score": 8,
                    "created_utc": 1612321157.0,
                    "replies": [
                        {
                            "body": "This. This is the answer.",
                            "author": "clair-cummings",
                            "id": "glu2xj9",
                            "parent_id": "t1_gltfmnd",
                            "score": 2,
                            "created_utc": 1612334733.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "gltta7r",
                    "parent_id": "t1_glta9sb",
                    "score": -2,
                    "created_utc": 1612328312.0,
                    "replies": [
                        {
                            "body": "No. That is being dumb and naive. The saying \"cash is king\" exists for this reason. I know of MANY SWs and SB's who have had payments reversed after the fact. I personally would be very leary to do this with someone I didn't know. Why is cash a problem?? You're not being as smart as you should be thinking like that. Unfortunately there really is no way to trust someone you have not seen over time. I would not take the risk.",
                            "author": "clair-cummings",
                            "id": "glu36ip",
                            "parent_id": "t1_gltta7r",
                            "score": 1,
                            "created_utc": 1612334923.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "glwh8fg",
                                    "parent_id": "t1_glu36ip",
                                    "score": 1,
                                    "created_utc": 1612382634.0,
                                    "replies": [
                                        {
                                            "body": "Lol. That's the dumbest thing to say. \"Yall must run into the shady crowd\" 🤦‍♀️. Like no....I do things to prevent anything from going poorly or finding out something went wrong after the fact. I do not just blindly trust. Just bc you've had 2 SD's and never had it go wrong doesn't mean it doesn't or can't happen otherwise. I would NOT advise others along that line of thinking either.",
                                            "author": "clair-cummings",
                                            "id": "glzppp6",
                                            "parent_id": "t1_glwh8fg",
                                            "score": 1,
                                            "created_utc": 1612449893.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "Sharing the CashApp isn’t the issue. This has nothing to do with identity. Payments can be reversed on apps like CashApp, PayPal and Venmo. You should never utilize an electronic payment until you’re sure you can trust someone. You can reverse sex, or cash in hand.",
                            "author": "FoxyFreckles1989",
                            "id": "glu3i9z",
                            "parent_id": "t1_gltta7r",
                            "score": 1,
                            "created_utc": 1612335172.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Expecting the *agreed upon* allowance/terms from start to finish doesn’t mean a SB is just after a “whale” or only cares about money. 😂",
            "author": "FoxyFreckles1989",
            "id": "glthalo",
            "parent_id": "t1_gltaops",
            "score": 6,
            "created_utc": 1612321973.0,
            "replies": []
        },
        {
            "body": "Another \"good looking SD\" trying to lesson the ego blow of paying for sex by convincing himself he pays a lower PPM than average.",
            "author": "sDsBsR",
            "id": "gly7a8m",
            "parent_id": "t1_glv6agm",
            "score": 1,
            "created_utc": 1612411456.0,
            "replies": []
        },
        {
            "body": "Maybe the difference is that you need a certain amount. I don't need anything from my SD, it's just a nice perk of the arrangement. My priority isn't money, it's my enjoyment, and I certainly do enjoy spending time with a more attractive man.",
            "author": "clashingtaco",
            "id": "glvq4qw",
            "parent_id": "t1_gltt8no",
            "score": 2,
            "created_utc": 1612371833.0,
            "replies": [
                {
                    "body": "When I say “need,” I am referring to terms and conditions I’ve set for myself in order to enter a SR. I don’t need it to survive; I need it to feel comfortable. My priorities are comfort and enjoyment. I absolutely prefer a man I’m attracted to, and wouldn’t enter a SR otherwise.",
                    "author": "FoxyFreckles1989",
                    "id": "glwsidd",
                    "parent_id": "t1_glvq4qw",
                    "score": 1,
                    "created_utc": 1612387230.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "None of this changes the fact that using any form of electronic payment for sugar before you know and trust somebody just isn’t fucking smart.",
            "author": "FoxyFreckles1989",
            "id": "gltfmnd",
            "parent_id": "t1_glta9sb",
            "score": 8,
            "created_utc": 1612321157.0,
            "replies": [
                {
                    "body": "This. This is the answer.",
                    "author": "clair-cummings",
                    "id": "glu2xj9",
                    "parent_id": "t1_gltfmnd",
                    "score": 2,
                    "created_utc": 1612334733.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gltta7r",
            "parent_id": "t1_glta9sb",
            "score": -2,
            "created_utc": 1612328312.0,
            "replies": [
                {
                    "body": "No. That is being dumb and naive. The saying \"cash is king\" exists for this reason. I know of MANY SWs and SB's who have had payments reversed after the fact. I personally would be very leary to do this with someone I didn't know. Why is cash a problem?? You're not being as smart as you should be thinking like that. Unfortunately there really is no way to trust someone you have not seen over time. I would not take the risk.",
                    "author": "clair-cummings",
                    "id": "glu36ip",
                    "parent_id": "t1_gltta7r",
                    "score": 1,
                    "created_utc": 1612334923.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "glwh8fg",
                            "parent_id": "t1_glu36ip",
                            "score": 1,
                            "created_utc": 1612382634.0,
                            "replies": [
                                {
                                    "body": "Lol. That's the dumbest thing to say. \"Yall must run into the shady crowd\" 🤦‍♀️. Like no....I do things to prevent anything from going poorly or finding out something went wrong after the fact. I do not just blindly trust. Just bc you've had 2 SD's and never had it go wrong doesn't mean it doesn't or can't happen otherwise. I would NOT advise others along that line of thinking either.",
                                    "author": "clair-cummings",
                                    "id": "glzppp6",
                                    "parent_id": "t1_glwh8fg",
                                    "score": 1,
                                    "created_utc": 1612449893.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Sharing the CashApp isn’t the issue. This has nothing to do with identity. Payments can be reversed on apps like CashApp, PayPal and Venmo. You should never utilize an electronic payment until you’re sure you can trust someone. You can reverse sex, or cash in hand.",
                    "author": "FoxyFreckles1989",
                    "id": "glu3i9z",
                    "parent_id": "t1_gltta7r",
                    "score": 1,
                    "created_utc": 1612335172.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "When I say “need,” I am referring to terms and conditions I’ve set for myself in order to enter a SR. I don’t need it to survive; I need it to feel comfortable. My priorities are comfort and enjoyment. I absolutely prefer a man I’m attracted to, and wouldn’t enter a SR otherwise.",
            "author": "FoxyFreckles1989",
            "id": "glwsidd",
            "parent_id": "t1_glvq4qw",
            "score": 1,
            "created_utc": 1612387230.0,
            "replies": []
        },
        {
            "body": "This. This is the answer.",
            "author": "clair-cummings",
            "id": "glu2xj9",
            "parent_id": "t1_gltfmnd",
            "score": 2,
            "created_utc": 1612334733.0,
            "replies": []
        },
        {
            "body": "No. That is being dumb and naive. The saying \"cash is king\" exists for this reason. I know of MANY SWs and SB's who have had payments reversed after the fact. I personally would be very leary to do this with someone I didn't know. Why is cash a problem?? You're not being as smart as you should be thinking like that. Unfortunately there really is no way to trust someone you have not seen over time. I would not take the risk.",
            "author": "clair-cummings",
            "id": "glu36ip",
            "parent_id": "t1_gltta7r",
            "score": 1,
            "created_utc": 1612334923.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "glwh8fg",
                    "parent_id": "t1_glu36ip",
                    "score": 1,
                    "created_utc": 1612382634.0,
                    "replies": [
                        {
                            "body": "Lol. That's the dumbest thing to say. \"Yall must run into the shady crowd\" 🤦‍♀️. Like no....I do things to prevent anything from going poorly or finding out something went wrong after the fact. I do not just blindly trust. Just bc you've had 2 SD's and never had it go wrong doesn't mean it doesn't or can't happen otherwise. I would NOT advise others along that line of thinking either.",
                            "author": "clair-cummings",
                            "id": "glzppp6",
                            "parent_id": "t1_glwh8fg",
                            "score": 1,
                            "created_utc": 1612449893.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Sharing the CashApp isn’t the issue. This has nothing to do with identity. Payments can be reversed on apps like CashApp, PayPal and Venmo. You should never utilize an electronic payment until you’re sure you can trust someone. You can reverse sex, or cash in hand.",
            "author": "FoxyFreckles1989",
            "id": "glu3i9z",
            "parent_id": "t1_gltta7r",
            "score": 1,
            "created_utc": 1612335172.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "glwh8fg",
            "parent_id": "t1_glu36ip",
            "score": 1,
            "created_utc": 1612382634.0,
            "replies": [
                {
                    "body": "Lol. That's the dumbest thing to say. \"Yall must run into the shady crowd\" 🤦‍♀️. Like no....I do things to prevent anything from going poorly or finding out something went wrong after the fact. I do not just blindly trust. Just bc you've had 2 SD's and never had it go wrong doesn't mean it doesn't or can't happen otherwise. I would NOT advise others along that line of thinking either.",
                    "author": "clair-cummings",
                    "id": "glzppp6",
                    "parent_id": "t1_glwh8fg",
                    "score": 1,
                    "created_utc": 1612449893.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Lol. That's the dumbest thing to say. \"Yall must run into the shady crowd\" 🤦‍♀️. Like no....I do things to prevent anything from going poorly or finding out something went wrong after the fact. I do not just blindly trust. Just bc you've had 2 SD's and never had it go wrong doesn't mean it doesn't or can't happen otherwise. I would NOT advise others along that line of thinking either.",
            "author": "clair-cummings",
            "id": "glzppp6",
            "parent_id": "t1_glwh8fg",
            "score": 1,
            "created_utc": 1612449893.0,
            "replies": []
        }
    ]
}