{
    "title": "i (f18) was raped after i met a potential sugar daddy (m38).",
    "post_id": "lhm1z6",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/lhm1z6/i_f18_was_raped_after_i_met_a_potential_sugar/",
    "author": "ac0smist",
    "body": "i guess i’ll try to give some background. i’m currently in university and i was looking for something that would make money fast, so i became a sugar baby. i’ve been sugaring for the past three months, and i met a new guy a few days ago. it was our first time meeting, and based off the few chats we had beforehand he seemed normal, decent. he’s a doctor and has a wife who he’s only staying with for the sake of his toddler. i thought that as man who has a child and a respectable profession he would be safe to be with. i now realize the logic behind that is completely flawed after what happened to me. \n\ni met him and we agreed that we could become intimate afterward at a hotel he’d booked. obviously, i told him beforehand over our chats that if i felt uncomfortable i would tell him and he would have to stop, and he wouldn’t have to compensate me in any way. things started to get heated and once he started to fuck me he was very rough. it was very painful, and i’ve never experienced that sort of pain during sex. i tried to bear it for a few minutes but i couldn’t. i asked him if he could slow down, and he told me that since i’m a “whore i should be able to take it.” he only got more rough, and i begged him to stop. it was too painful. he didn’t. once he finished, i was crying and asked him why he didn’t stop and he told me “why should i stop if this is your job?” i felt so sick. i think he eventually became panicked and realized i was being serious when i told him to stop so instead of giving me what he was supposed to, he gave me five times more. he told me that we have an “understanding”that i can’t tell anyone. i ran out of there and i’ve locked myself in my apartment since. i haven’t eaten in days, and i have no motivation to attend classes. \n\nmy parents obviously have no idea i’m sugaring. they are conservative muslims and would probably never speak to me again if they found out, especially since i really don’t have any reason to be sugaring. my dad pays almost all of my expenses, so i just can’t tell them what happened bc they just won’t understand. i only got into sugaring since i thought it would be thrilling and fun. it turned out to be the exact opposite. i’m not sure what to do. any advice is appreciated.",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/lhm1z6/i_f18_was_raped_after_i_met_a_potential_sugar/",
    "score": 359,
    "upvote_ratio": 0.93,
    "created_utc": 1613054532.0,
    "num_comments": 117,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "Please get help. I bet your school has a counseling service. Don't  try to suffer through this trauma alone. Please do this.",
            "author": "AFSMSgt",
            "id": "gmyi8qj",
            "parent_id": "t3_lhm1z6",
            "score": 326,
            "created_utc": 1613063616.0,
            "replies": [
                {
                    "body": "Agree with the above  with priorities\n \n    Get counseling \n\n    Consider whether to report it ( nothing matters that happened before you said STOP  like NO   it is a complete sentence and his proceeding is rape) .  There was a case in Orange County where a prominent doctor and his female assistant made a practice of picking up young women, drugging and filming them.  Tragically this is all to common today. \n\nReflect on the red flags for future reference and to share with your girlfriends ( not the story but the need to be wary )",
                    "author": "pinotandsugar",
                    "id": "gmyqojx",
                    "parent_id": "t1_gmyi8qj",
                    "score": 51,
                    "created_utc": 1613067091.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "You do not have to tell your parents. They never have to know. You’re an adult and you can get help on your own, and you should. I understand that it could be dangerous for them to find out, due to your culture; I want you to understand they *cannot be told* if you seek help. However, if you’re on their insurance policy, they’d very likely find out if you attend therapy. They are not entitled to the “why” or what goes on in therapy. That being said, your university very likely offers counseling, and this would be included in your tuition. If you need help figuring all of this out, please DM me. I help people find resources for DV, assault, addiction and MH issues every day. I will help you as much as I possibly can. \n\nWhat this man did was not okay. It *was* rape. It was *not* part of any understanding y’all had. I can help with this too, if you’d like. \n\nYou aren’t alone. Please hang in there. You didn’t do a single thing wrong.",
            "author": "FoxyFreckles1989",
            "id": "gmz5b7z",
            "parent_id": "t3_lhm1z6",
            "score": 45,
            "created_utc": 1613073214.0,
            "replies": []
        },
        {
            "body": "this is absolutely vile. i wish there was an easier way to take a guy like this down while affording you protection from your family.  he will do this to others.",
            "author": null,
            "id": "gmykqlg",
            "parent_id": "t3_lhm1z6",
            "score": 22,
            "created_utc": 1613064647.0,
            "replies": [
                {
                    "body": "was thinking same thing.  hate to suggest violence with violence but this Dr needs to have a hard lesson in life.  Guys like this give all men a bad reputation.",
                    "author": "Buckeyechamp21",
                    "id": "gmyyiz1",
                    "parent_id": "t1_gmykqlg",
                    "score": 17,
                    "created_utc": 1613070361.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "First and foremost I am SO sorry that you experienced that. Personally, if this happened to me, I would report to the police. In some places you can do this anonymously and even though you were in a sugaring situation, HE BROKE THE LAW. Not you. I was a title 9 trainer in college and I can help you through this. Below are some resources, but my inbox is open to you. \nAlso. Fuck this guy. And you are so strong. \n\nhttps://www.rainn.org/about-national-sexual-assault-telephone-hotline\n\nhttps://www.rainn.org/national-resources-sexual-assault-survivors-and-their-loved-ones\n\nhttps://www.nsvrc.org\n\nhttps://victimconnect.org/learn/types-of-crime/sexual-assault/",
            "author": "kennacakes",
            "id": "gmyig02",
            "parent_id": "t3_lhm1z6",
            "score": 78,
            "created_utc": 1613063700.0,
            "replies": [
                {
                    "body": "Really great links here.",
                    "author": "WorldwideLoving",
                    "id": "gn1aaag",
                    "parent_id": "t1_gmyig02",
                    "score": 3,
                    "created_utc": 1613113793.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "If you're in the states contact planned parenthood, or rainn and speak to a rape counselor.  If you're able I would take a victim advocate with you and file a police report, you don't necessarily need to press charges but you may change your mind about that later and a statement now is important.  Back up any texts you sent to friends/supports after the attack as these are also evidence.  You could also report this man to his college (his professional regulating body); he is a predator and has no business working as a physician.  Seek out counseling resources at your uni as soon as you're ready, it can be super helpful having someone safe and non-judegmental to talk to.\n\nI'm very sorry this happened to you, it was not your fault, there was no \"understanding\" this man is a rapist and is trying to gaslight you.  The money has no bearing on your consent.  Professional sex workers can revoke consent at any moment.  This man purposely sought out a young student and tried to use whorephobia to shame you into silence.",
            "author": "sugarsenior2",
            "id": "gmyrctn",
            "parent_id": "t3_lhm1z6",
            "score": 41,
            "created_utc": 1613067374.0,
            "replies": []
        },
        {
            "body": "This is awful and I'm so sorry this happened to you.\n\nEDIT: I would also have no remorse about \"outing\" this guy or having his family find out if you do decide to report this. He committed a crime. He will do it again to someone else. Society has an interest in stopping him.",
            "author": null,
            "id": "gmz1d9n",
            "parent_id": "t3_lhm1z6",
            "score": 17,
            "created_utc": 1613071560.0,
            "replies": [
                {
                    "body": "[https://www.rainn.org/about-national-sexual-assault-telephone-hotline](https://www.rainn.org/about-national-sexual-assault-telephone-hotline)",
                    "author": null,
                    "id": "gmz1v8p",
                    "parent_id": "t1_gmz1d9n",
                    "score": 6,
                    "created_utc": 1613071770.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "First and foremost, this is not your fault. In no way is this \"part of the job\" nor are you ever, ever required to compromise on your boundaries. You are worthy of respect, love and support. I recommend you get tested for STIs (now and again in six weeks), reach out for help from RAINN or search for survivor support in your area - I would also recommend the podcast Trauma Queen by Jimanekia Eborn, a trauma specialist. For better or worse darling you are not alone and you do not have to suffer alone. Please be gentle with and kind to yourself, you deserve empathy and healing. Lots of love to you.",
            "author": "juicyfruuuit",
            "id": "gmz8nol",
            "parent_id": "t3_lhm1z6",
            "score": 16,
            "created_utc": 1613074646.0,
            "replies": []
        },
        {
            "body": "You also DO NOT need to tell anyone you were sugaring. You can say you were on a date and its not a lie or technicality or anything. This is textbook date rape and he must be stopped before he does it to someone else or a patient",
            "author": "t0keahontas",
            "id": "gmzimqo",
            "parent_id": "t3_lhm1z6",
            "score": 30,
            "created_utc": 1613078909.0,
            "replies": []
        },
        {
            "body": "This is so terrible, I'm so extremely sorry this happened to you. \n\nAs someone who had a very similar thing happen to them at a very similar age, you have a couple of options.\n\nFirstly, I would suggest looking into women's trauma/sexual assault resource centers around you. They can give you really helpful information about your options moving forward, whether that be to pursue something with the authorities or just focus on your mental health. For example, here's the a link to the service I used: https://www.monarchscc.org/\n\nThen of course, you can directly contact the authorities, but unfortunately, if you decide to go this route, you have to act quickly so they can get vital evidence for the investigation via a rape kit (they're terrible to get done, but can be really helpful in a court of law)\n\nAlso, no matter what you decide to do, definitely look into counseling via your college/school. They should have programs specifically designed to help women with mental health after sexual trauma or assault. The one at my college was called CARE if that helps at all.\n\nWhatever you do, don't bury this inside. It happened and it's absolutely terrible, but at the end of the day, counseling and talking your way through it will help a lot. You have a support group here on reddit if you ever need it. Feel free to DM me if you have any questions/need any more support! You are brave and strong and will overcome this!",
            "author": "cafroline",
            "id": "gmyko5f",
            "parent_id": "t3_lhm1z6",
            "score": 28,
            "created_utc": 1613064620.0,
            "replies": [
                {
                    "body": "Great advice. I am so sorry this happened to you as well, but it shows the OP that she can get through this. I hope she takes you up on your offer to DM",
                    "author": "Teejaynj",
                    "id": "gmz6x94",
                    "parent_id": "t1_gmyko5f",
                    "score": 8,
                    "created_utc": 1613073898.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I am heartbroken to hear this love, please know you are not alone. I’m glad you reached out to us on reddit.  Finding a therapist you feel comfortable with is the best way to process this trauma in a healthy way. Also this was in NO way your fault.",
            "author": "transgirldelilah",
            "id": "gmyqy7u",
            "parent_id": "t3_lhm1z6",
            "score": 8,
            "created_utc": 1613067205.0,
            "replies": []
        },
        {
            "body": "I'm sad and angry you had to experience this. Please please know that it is not your fault, that it is his wrong behavior, and that you are valid and worthy just how you are. It is not a reflection of you or your character, you didn't do anything to deserve this.\n\nPlease find some support in whatever way you can, whether that is with a counselor or friends or police or a doctor. Clearly you're finding support on Reddit, I just hope it can be more than this one post. I don't know where you are, but in many places there are helplines or crisis lines you can call to talk to someone. You can message my DMs.\n\nFuck this dude and his entitled bullshit. Please report him to whatever website you met him on. To the police too if you feel comfortable doing so, but that can be a whole mess and triggering. Police reporting can be nice to have a buddy with you. idk if they do rape kits where you are, but that situation can be retraumatizing for many.\n\nPlease take care of yourself as best you can. I've been assaulted a few times, and my biggest mistakes were not acknowledging how much it affected me. I don't mean take care of yourself in the generic \"buy a bathbomb and drink wine\" type of way, I mean listen to your body, if she says it's time for a nap you do that, if she wants to get strong you take her to boxing. Whatever it is that you need to feel strong and whole again, do that.",
            "author": "trynnaplayitcool",
            "id": "gmz5165",
            "parent_id": "t3_lhm1z6",
            "score": 8,
            "created_utc": 1613073097.0,
            "replies": [
                {
                    "body": "Yeah, you make a great point about caring for yourself. Be gentle with yourself and don't feel any pressure to get back to a normal schedule, healing comes first. And recognize how this experience has affected your sexuality, really be honest with yourself as you move forward with any other person.",
                    "author": "Mysterious_Fox_8616",
                    "id": "gn7peva",
                    "parent_id": "t1_gmz5165",
                    "score": 2,
                    "created_utc": 1613224518.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gmz9c55",
            "parent_id": "t3_lhm1z6",
            "score": 7,
            "created_utc": 1613074935.0,
            "replies": [
                {
                    "body": "It's not a very uplifting point to make, but in many cases there is no point in reporting because the authorities do not take it seriously. This is not okay, but it is a reality in a lot of cases that a woman has to be so strong to make that report in the first place and it ends up being the one hurt the most when the system fails her. As women we have to be realistic and find the right decision for ourselves knowing that reporting a sex crime is a difficult path and justice is not guaranteed. I say this as someone who did report my rapist but found no justice. Sadly there is not an easy answer and in some cases the victim needs to make a decision if she will feel empowered by reporting the crime or just immeasurably more pained by the legal process.",
                    "author": "Mysterious_Fox_8616",
                    "id": "gn7rfh4",
                    "parent_id": "t1_gmz9c55",
                    "score": 1,
                    "created_utc": 1613225191.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I’m so sorry this happened to you, you’re not alone and it’s really important right now that you speak to a qualified professional person about this - maybe you have an older, level-headed friend.\n\nTaking a break from sugaring/relationships to heal would help and when you feel ready, do more research on staying safe with sugaring and red flags and also check into the background of men you meet. Anyone (men or women) can lie or give off a good first impression and are different behind closed doors. Most sexual assault victims are hurt by people they know.\n\nDon’t jump into intimacy with someone until you truly have a good read on them and feel comfortable, and next time don’t shower so you can get a rape kit done.",
            "author": "itsyrgirl",
            "id": "gmyijam",
            "parent_id": "t3_lhm1z6",
            "score": 13,
            "created_utc": 1613063738.0,
            "replies": []
        },
        {
            "body": "Do you have his personal details? Tell his wife and his job. Also please contact your school counsellor.",
            "author": "lovaduck",
            "id": "gmzh94o",
            "parent_id": "t3_lhm1z6",
            "score": 21,
            "created_utc": 1613078328.0,
            "replies": [
                {
                    "body": "Literally",
                    "author": "_trainspotting",
                    "id": "gmzrmak",
                    "parent_id": "t1_gmzh94o",
                    "score": 6,
                    "created_utc": 1613082971.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "This breaks my heart to read. I cannot imagine the fear you experienced. This will be tough to process as all trauma is but do not ever blame yourself. You did nothing wrong. This sick individual is 1000% at fault. I would encourage you to reach out for help in a way that is safe and economical for you. I would recommend therapy but if insurance / cost in a concern then if comfortable try opening up to a trusted person and using peer support.\n\nThe one thing I regret in my case was not seeking help...even from my friends. I shut off for many years and thought something was wrong with me and it led to later issues that I still struggle with today. It’s an up and down process. Some days will be better than others but I know you will be able to heal from this. Take time for yourself and maybe step away from sugaring and intimacy until you feel comfortable. \n\nI would report him but I also understand safety and confidentiality is a huge thing so I respect your decision no matter what. Just do what is best for you.\n\n\nDon’t hesitate to reach out. Be safe.",
            "author": "drowningalaska30",
            "id": "gmzlpe5",
            "parent_id": "t3_lhm1z6",
            "score": 6,
            "created_utc": 1613080258.0,
            "replies": []
        },
        {
            "body": "I am very sorry that this happened to you. There are many telling you to report this to the police. If you are in a country such as the US where prostitution is illegal I would not recommend this. You will be treated horribly and suffer more trauma. This is why it is important for young women who get into sugaring to understand that it IS sex work. Civilians make no distinction. For all the people, especially men, in the replies telling her to go to the police I hope you advocate for and financially support organizations that are fighting for the decriminalization of sex work. If we had decriminalization she could have gone to the police without fear if that was her choice. But unless she lives in New Zealand or a few other places that is not the case. I see so many people on platforms like TikTok selling a dream to young girls about sugaring when in reality it’s very dangerous physically, mentally, and emotionally. Few would encourage an 18 year old to go work as an escort or as at a brothel. Anyone who thinks the risks are not the same sugaring is delusional. And I know plenty of SD love these sugaring sites so they can find an 18 year old they can victimize. What that man was saying to her as he raped her is important for people to pay attention to. This is what the reality is of how so many of these SDs view these women and how the police and many others will as well. It’s disgusting but it’s a reality that helps no one to deny. \nI’m really sorry this happened to you. Please tell someone, a therapist or a hotline. Someone else suggested going to Planned Parenthood if you’re in the states and I agree. They were very kind and helpful to me after a client stealthed and ejaculated in me (removed condom without my consent). Under decriminalization that’s considered rape btw. \nAnd I would suggest you stop sugaring. You are too young and too inexperienced to be able to properly protect yourself from predators. And you’ll never be able to fully, but at your age it’s much harder.  Plus the worst men are seeking you out because of how young you are assuming they can take advantage of you. \nAgain, I am so sorry. This is not your fault. Get therapeutic help. Sending ❤️",
            "author": "missmandyloves",
            "id": "gn1kg86",
            "parent_id": "t3_lhm1z6",
            "score": 6,
            "created_utc": 1613122975.0,
            "replies": [
                {
                    "body": "Although disagree with some you are saying; there is a lot of truth here.  But many of SDs don't think of any woman or SB like that.\n\nAnd my first instinct was to find out where this motherfucker lives; get on a plane and go stomp his ass and I'm quite certain at least another dozen on this thread would join me.\n\nThis guy is not representative of all men or of all SDs.\n\nBut you are on the money of young girls thinking its fun and exciting.  And I know we all have our own reasons and dont judge anyone as we are all on the same site(s).  But it seems more mature woman on for better reasons or necessities.\n\nBut thanks for your honest opinions",
                    "author": "Buckeyechamp21",
                    "id": "gn2mf9t",
                    "parent_id": "t1_gn1kg86",
                    "score": 1,
                    "created_utc": 1613147225.0,
                    "replies": [
                        {
                            "body": "I’m not saying this is all or even the majority of men you’d come across on SD sites. You’re right to want to hurt him because it’s what he deserves. He’s a rapist. Period. But I do think that gentlemen such as yourself have no way of seeing really just how much of these sites are made up of men like this.  I have escorted and sugared and my years of experience is that there are men who see escorts, men who only seek out SB, and men who do both. The overlap is significant. My google contact list tells me so. And there are just as many predators on SD sites as escorting ones. So I encourage any younger SB to follow some experienced and smart FSSW on Twitter etc so they can learn better how to keep themselves safe. Because the tactics these predators use are similar, and these young women need skills to spot red flags, to screen, etc. They won’t become “jaded” or “transactional” by knowing how to stay safe. Actually the exact opposite. Safety will allow them to remain happy and fun. And sadly even after learning safety techniques it’s not a guarantee of safety, and that is something they need to know before going into sugaring.\nYes you can meet wonderful men and make real connections but the path to that end goal can be extremely dangerous. And the criminalization of sex work emboldens predators. I had a friend who was raped at gun point and the rapist mocked her inability to go to the police as he raped her.\nI am very sad for this young woman. I wish she had help and guidance. I wish she was free to peruse justice without fear. I hope she is able to get therapy and support for her trauma. And I wish her safety and peace for her future.",
                            "author": "missmandyloves",
                            "id": "gn2oebx",
                            "parent_id": "t1_gn2mf9t",
                            "score": 3,
                            "created_utc": 1613148110.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I think you can see from the response that there’s a ton of us here for you and confirming you’ve don’t nothing to be ashamed of or anything wrong. \n\nI also know it’ll take a lot of strength, but you’ve already shown you’re stronger than this PoS. You gotta go to the cops so he doesn’t do this to others, and other slimeballs see that they don’t get away with this outside of their fantasies. \n\nI’d give you the biggest hug, but I suspect the last thing you want is a man touching you. ;(",
            "author": "quietgrey1",
            "id": "gmzpgir",
            "parent_id": "t3_lhm1z6",
            "score": 4,
            "created_utc": 1613081963.0,
            "replies": []
        },
        {
            "body": "I feel for you so much. This is absolutely rape but also people need to stop suggesting to you to bring in the police, it won’t help and could even make things worse. I guarantee he has your conversations saved and also that if you delete the ones YOU have, the police would find them in an investigation. The fact that “sugaring” is seen the same as prostitution in the eyes of the law is greatly overlooked by many and even more so of those within the community which is an incredibly depressing fact. Accept what you’ve got and move along, block that guy and blast him on any and all Sugar Baby forums you can find. It’s honestly not the most practical approach but it’s the best option to protect others who could be a victim of the same thing. Lastly, going to the police could actually make it worse for you and possibly get YOU arrested. Please don’t risk that but also please be safe and remember, they’re the consumer and you’re the product. You make the rules, you make the boundaries. Not the sugar daddy/mommy. Equal for equal in all aspects especially personal respect and sex. You’re the boss, remember that queen/ king / emperor 🙏❤️",
            "author": "jaymesNwen",
            "id": "gn0y48k",
            "parent_id": "t3_lhm1z6",
            "score": 6,
            "created_utc": 1613105200.0,
            "replies": []
        },
        {
            "body": "I don’t know where you’re from.\n\nBut there are hospitals that can “gather” evidence and keep it for you until you decide to open a case or not.\nWhatever you’re comfortable with .\n\nThey also offer counseling services, you should really go. I’m really sorry this happened to you🌻",
            "author": "Momotheblack",
            "id": "gmyxvj2",
            "parent_id": "t3_lhm1z6",
            "score": 5,
            "created_utc": 1613070084.0,
            "replies": []
        },
        {
            "body": "I’m a counselor, check with your university for resources. They can help you and maintain confidentiality. Take it easy and rest, girl. You been through a lot, so just be gentle with yourself. I’m sorry that happened. You in no way deserved any of that. Thank you for being so brave and sharing.",
            "author": "TerribleAttention137",
            "id": "gmzg4wo",
            "parent_id": "t3_lhm1z6",
            "score": 4,
            "created_utc": 1613077841.0,
            "replies": []
        },
        {
            "body": "I am so very sorry. I volunteered as a crisis counselor for many years and I experienced a violent assault as a teenager as well. Please reach out to me if you need to talk and I’ll be here for you any any time 💕💕💕 please reach out to someone hunny, it will help I promise.",
            "author": null,
            "id": "gn09c8x",
            "parent_id": "t3_lhm1z6",
            "score": 5,
            "created_utc": 1613091787.0,
            "replies": []
        },
        {
            "body": "I’m so sorry this happened to you. I don’t want to say you need to do anything. with everyone telling you what you NEED to do I imagine that could possibly be overwhelming especially given the situation you had to deal with. I don’t have the right words to undo that horrible experience but just know that a stranger in the world on the internet is here for you if you need to talk and you are not to blame at all. You were violated and this is not ok and you have every right to feel exactly the way you feel about it.sending my good thoughts your way.",
            "author": "moonjuicediet",
            "id": "gmzh9tx",
            "parent_id": "t3_lhm1z6",
            "score": 3,
            "created_utc": 1613078336.0,
            "replies": []
        },
        {
            "body": "That piece of shit is a psychopath! You do not have an understanding with him, no matter the amount of money he gave you afterwards! Please get counseling and report him!",
            "author": "NewbieDaddy",
            "id": "gmzwm45",
            "parent_id": "t3_lhm1z6",
            "score": 3,
            "created_utc": 1613085329.0,
            "replies": []
        },
        {
            "body": "i am so so very sorry this happened to you. do NOT think that you caused this or “deserved” this in any way. Whether you were on a normal date, a sugar date, or had an agreement for prostitution, HE crossed lines and disrespected your bodily autonomy. We are the same age and I can’t even imagine how I would feel in this situation. I hope you find healing, PM me if you need",
            "author": "carjs",
            "id": "gn034rx",
            "parent_id": "t3_lhm1z6",
            "score": 3,
            "created_utc": 1613088569.0,
            "replies": []
        },
        {
            "body": "Even if this is \"your job\" as he claims, you still are a human being, you can refuse work, you can walk off a job. A boss is not allowed to assault his workers. You should go to the police.",
            "author": "wackcasemade",
            "id": "gn09629",
            "parent_id": "t3_lhm1z6",
            "score": 3,
            "created_utc": 1613091698.0,
            "replies": [
                {
                    "body": "Unless she lives in one of the rare places in the world like New Zealand with decriminalized sex work she actually cannot. I wish people would stop advising her to go to the police. Unless she is in such a place she will be so worse off if she does.\nIt is also quite telling that on a sugaring forum so many people are ignorant to this reality. \nBut I guess that’s the main attraction to sugaring for many. It’s the delusion that it’s not sex work. Well it is. The police will at best do nothing, will most likely say things to her that will traumatize and haunt her as bad as the rape, and at worst could assault her or arrest her.\nAnd if you think I am exaggerating I hope you’ll do some research. Police are allowed in many states to legally have sex with women as part of prostitution stings. Police often use the threat of arrest to coerce sex (aka rape) women. \nShe needs to find a therapist not the police. And those of you suggesting she contact the cops need to wake up. Dangerous and delusional advice to a vulnerable young victim.",
                    "author": "missmandyloves",
                    "id": "gn1lhqw",
                    "parent_id": "t1_gn09629",
                    "score": 6,
                    "created_utc": 1613123977.0,
                    "replies": [
                        {
                            "body": "Yes. This. All of this. Cops can’t be trusted.",
                            "author": "ashes2asscheeks",
                            "id": "gn33gyd",
                            "parent_id": "t1_gn1lhqw",
                            "score": 3,
                            "created_utc": 1613154592.0,
                            "replies": [
                                {
                                    "body": "Some cops support prostitution. Old customers.  Not all cops, but you can't have the illusion that because of their profession, they are trustworthy; just the way you can't know if a successful doctor is going to rape you.",
                                    "author": "Mysterious_Fox_8616",
                                    "id": "gn7u3f9",
                                    "parent_id": "t1_gn33gyd",
                                    "score": 1,
                                    "created_utc": 1613226026.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I’m sorry this happened to you. 100% not your fault, guys out there are just awful. This was a trama for you and it’s okay to hurt and feel the way you do. Understand that you are in control of what happens next you are in control of eating sleeping and going to class. No one can take it away from you. Don’t let this horrible guy be the one to not just hurt you but also hurt your future.",
            "author": null,
            "id": "gn0hkcl",
            "parent_id": "t3_lhm1z6",
            "score": 3,
            "created_utc": 1613096106.0,
            "replies": []
        },
        {
            "body": "You should go over to r/rapecounseling  I'm  sorry. You can mention your sugaring they dont judge, theyve heard it all",
            "author": null,
            "id": "gn0zw9l",
            "parent_id": "t3_lhm1z6",
            "score": 3,
            "created_utc": 1613106298.0,
            "replies": []
        },
        {
            "body": "Call the police and report this. Go to the hospital and get a rape kit. Do not shower or launder your clothes. It doesn’t matter that you were paid. You told him to stop and he didn’t. That’s rape. You can’t let him get away with this. I know it will be hard- but you deserve justice.",
            "author": "Chanel1202",
            "id": "gmzojuh",
            "parent_id": "t3_lhm1z6",
            "score": 7,
            "created_utc": 1613081544.0,
            "replies": []
        },
        {
            "body": "I’m so fucking sorry this happened. \nPM me and I can help you get him on some blacklists so other babies and sex workers don’t see him.",
            "author": "ashes2asscheeks",
            "id": "gn0da0s",
            "parent_id": "t3_lhm1z6",
            "score": 4,
            "created_utc": 1613093857.0,
            "replies": []
        },
        {
            "body": "It’s rape. Report it. If you’re in the US, HIPPA laws protect your identity, even from your parents. This SOB needs to be locked up.",
            "author": "Mining4Gold2",
            "id": "gmymj1y",
            "parent_id": "t3_lhm1z6",
            "score": 5,
            "created_utc": 1613065380.0,
            "replies": []
        },
        {
            "body": "This is awful. You were absolutely sexually assaulted and you absolutely need to take care of yourself.\n\nEveryone else advocating counseling is correct. You must find it at your school, contact RAINN, do what is needed. You will have ongoing trauma from this and it's best to try to deal with some of it sooner rather than later.\n\nI am devastated for you and wish there was some way we collectively here could give you a hug, wrap you in a blanket, make you feel safe and cared for.\n\nSo, so sorry!",
            "author": "marker3000",
            "id": "gmyut0m",
            "parent_id": "t3_lhm1z6",
            "score": 2,
            "created_utc": 1613068816.0,
            "replies": []
        },
        {
            "body": "So  sorry that happened to you.  And what he did was not your fault.  \n\nNormally would say report the guy just so he doesn't do it to someone else; but if causes more family issues that's your call.",
            "author": "Buckeyechamp21",
            "id": "gmyxrlj",
            "parent_id": "t3_lhm1z6",
            "score": 2,
            "created_utc": 1613070038.0,
            "replies": []
        },
        {
            "body": "I'm sorry, seek therapy as soon as you can, and reconcile with the fact that this is not your fault, you took necessary steps and he was in the wrong",
            "author": "LillyXcX",
            "id": "gmz47n7",
            "parent_id": "t3_lhm1z6",
            "score": 2,
            "created_utc": 1613072754.0,
            "replies": []
        },
        {
            "body": "I'm so sorry to hear that has happened to you, I've dealt with it too, it's not a easy thing to handle. I'd suggest maybe a therapist, maybe tell your parents you're just stressed because of school and covid and want to talk to someone about it. I'd definitely put in a report about it to the police, what he did wasn't okay and he shouldn't get away with it. But I completely understand if you don't want to retell and relive it all because I didn't report mine either. Pm me if you want, maybe I can give you more advice. I'm here for you hun",
            "author": "LittleWolf730",
            "id": "gmz6783",
            "parent_id": "t3_lhm1z6",
            "score": 2,
            "created_utc": 1613073587.0,
            "replies": []
        },
        {
            "body": "I'm so sorry this happened to you.  Take the advice from many of these posts  and get some professional support.",
            "author": "dajobix",
            "id": "gmzgese",
            "parent_id": "t3_lhm1z6",
            "score": 2,
            "created_utc": 1613077961.0,
            "replies": []
        },
        {
            "body": "Therapy and report him to the police. It doesn't matter what your \"job\" was, even marital rape can happen. Don't blme yourself and if you need to reach out and vent to someone, don't hesitate to contact me. I am so so sorry this happened to you.",
            "author": "t0keahontas",
            "id": "gmzig7k",
            "parent_id": "t3_lhm1z6",
            "score": 2,
            "created_utc": 1613078833.0,
            "replies": []
        },
        {
            "body": ":(\n\nI’m sorry this happened to you",
            "author": "HotStool",
            "id": "gmzth8v",
            "parent_id": "t3_lhm1z6",
            "score": 2,
            "created_utc": 1613083841.0,
            "replies": []
        },
        {
            "body": "I've never been raped by a sugar daddy, but I have by an ex boyfriend. It's never okay to take away someone's right to choose and their safety. I would never condone such behavior. Yes, as sugar babies sex is typically part of the deal, but this is wrong. I hope he faces some form of justice. Definitely keep that money though, you might need it.",
            "author": "Yukalitlee",
            "id": "gn0bvcn",
            "parent_id": "t3_lhm1z6",
            "score": 4,
            "created_utc": 1613093119.0,
            "replies": []
        },
        {
            "body": "I think you need a shrink, or counseling. Meron tumatanggap ng clients and they provide 100% confidentiality. You'll get the support system you need, and your parents will never find out. I dont recommend going to your imam cause they talk for shit haha.\n\nAlso, if it helps, beep me. Idk bat ako nasa sub na to but maybe I can give you a good set of ears as I am a good listener.",
            "author": "Testament997",
            "id": "gmyg4vf",
            "parent_id": "t3_lhm1z6",
            "score": 3,
            "created_utc": 1613062741.0,
            "replies": []
        },
        {
            "body": "He definitely crossed a line, many women are submissive in these situations and if this jerk was so far over the top, obviously he has a rough fantasy but you discuss these things ....you DO NOT DO IT FIRST and then discuss it.\n\nWow to call you a whole what kind mind fick is this guy about.\n\nAs everyone has said talk to someone,let it out process it, you are not defined by what someone else does to you.\n\nGlobal comment girls even if you are into a guy don't do anything on the first date, just to prove out the guy has class and is not a dirt bag.\n\nNo amount of money will compensate for the pain suffered internally for feeling disrespected and used and abused..\n\nSo sorry you had to endure this, you did nothing wrong.\n\nBut let yourself heal before you try again and be mindful thst you always have the right to say stop it hurts really stop for now, no guy worth a damn would ever want it to be painful for someone else....no one",
            "author": "Momopllc",
            "id": "gmzjdvr",
            "parent_id": "t3_lhm1z6",
            "score": 2,
            "created_utc": 1613079233.0,
            "replies": []
        },
        {
            "body": "Blackmail himmmm",
            "author": "_trainspotting",
            "id": "gmzrl3g",
            "parent_id": "t3_lhm1z6",
            "score": 2,
            "created_utc": 1613082955.0,
            "replies": []
        },
        {
            "body": "Consent is consent, love. I am so sorry this happened to you. The same happened to me with an ex boyfriend, my first at that, and at your age too. Your feelings are valid, your tauma is valid. Anyone trying to play devils advocate for that SD is just as trash as he is. No exceptions. Please allow some time to heal from this emotional and physical trauma, it will get better soon but it takes a lot of time and inner work. I'm here for you too if you need it! I'd recommend reporting him, do not be afraid to do so. Do not let him get away with this. I know it can be easy to fear a man of power but you deserve justice. Remember that nothing is your fault and you did not ask for this. You are brave and strong for sharing your story and I hope you heal from this <3",
            "author": "mindfultouch",
            "id": "gn0fiwz",
            "parent_id": "t3_lhm1z6",
            "score": 2,
            "created_utc": 1613095040.0,
            "replies": []
        },
        {
            "body": "Jfc. You need to go to the police and report this guy. He needs to loose his profession and livelihood over this. I'm so sorry.",
            "author": "dade_murphy1",
            "id": "gmzg8q8",
            "parent_id": "t3_lhm1z6",
            "score": 3,
            "created_utc": 1613077887.0,
            "replies": []
        },
        {
            "body": "Report it to the police.",
            "author": "MGTOWManofMystery",
            "id": "gmzh45e",
            "parent_id": "t3_lhm1z6",
            "score": 1,
            "created_utc": 1613078269.0,
            "replies": []
        },
        {
            "body": "Rape is rape. Sounds like you need to hammer down on this jerk with law enforcement. At the same time get professional coping help.",
            "author": "The_Mavereq",
            "id": "gn0fj9o",
            "parent_id": "t3_lhm1z6",
            "score": 1,
            "created_utc": 1613095045.0,
            "replies": []
        },
        {
            "body": "🥲 sugar dating is NOT prostitution . People need to understand that !",
            "author": "LongETH",
            "id": "gn0m1b4",
            "parent_id": "t3_lhm1z6",
            "score": 1,
            "created_utc": 1613098484.0,
            "replies": []
        },
        {
            "body": "Let's be clear. Rape is not a feature of sugaring. Rape is just rape. Unfortunately, date rape is more common than people realize.\n\nI'm do sorry this happened to you. He isn't a man. He is a rapist. Report him or he will do it again.",
            "author": "stonedoubt",
            "id": "gn0vfhu",
            "parent_id": "t3_lhm1z6",
            "score": 1,
            "created_utc": 1613103604.0,
            "replies": []
        },
        {
            "body": "Everyone is patting your back here, but I’m going to be a little honest because sometimes little girls who want to be grown need to hear it. \n\nYou got into sugaring because you wanted the “thrill”? You’re 18 & have your own apartment, which I presume is paid for in part by your parents? \n\nNow you got raped. By a man who told you the biggest lie (no one stays with their wife FOR their kids). That was red flag number one. \n\nHave you ever watched any tv? This is what happens. And agreeing to have sex on the first link? I guess you didn’t tell anyone (friends) about your plans... because I woudl hope they would’ve discouraged you.\n\nI’m very sorry this happened to you, but sugaring is not glitter and gold. People get seriously hurt and/or killed. Think of... prostitution... because that’s essentially what it is. \n\nPlease seek help & focus on school. There are women selling their bodies on the streets to feed their kids... you don’t need to do this. \n\nOh and before yall try to come for me... I was raped and no tf I was not sugaring. Smh.",
            "author": "BulkyMoney2",
            "id": "gmzfrob",
            "parent_id": "t3_lhm1z6",
            "score": -4,
            "created_utc": 1613077682.0,
            "replies": [
                {
                    "body": "For whatever reasons she decided to get into sugaring, it doesn’t justify and shouldn’t have been a causation to being assaulted. There is no need to be condescending nor diminutive to her, her decisions or intelligence.",
                    "author": "searchfete",
                    "id": "gmzxvqu",
                    "parent_id": "t1_gmzfrob",
                    "score": 8,
                    "created_utc": 1613085947.0,
                    "replies": [
                        {
                            "body": "100% agreed. This comment is completely unhelpful and uncalled for.",
                            "author": "radioheaded17",
                            "id": "gn05h1k",
                            "parent_id": "t1_gmzxvqu",
                            "score": 4,
                            "created_utc": 1613089779.0,
                            "replies": []
                        },
                        {
                            "body": "I’m not justifying the awful events that happened, but OP definitely needs people to be more frank with her. This is the real world.",
                            "author": "BulkyMoney2",
                            "id": "gn0977c",
                            "parent_id": "t1_gmzxvqu",
                            "score": 0,
                            "created_utc": 1613091714.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gmzt9zb",
            "parent_id": "t3_lhm1z6",
            "score": -4,
            "created_utc": 1613083747.0,
            "replies": [
                {
                    "body": "Uh no. Every rape victim deals with it differently.",
                    "author": "_Terrible_Advice_",
                    "id": "gmzz771",
                    "parent_id": "t1_gmzt9zb",
                    "score": 10,
                    "created_utc": 1613086597.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gmzzoc0",
            "parent_id": "t3_lhm1z6",
            "score": -6,
            "created_utc": 1613086835.0,
            "replies": [
                {
                    "body": "If a prostitute says \"stop\" or \"no\" it means the same damn thing as when a sugar baby does. When ANY person says \"no\" \"stop\" it means stop. Unless you've discussed a safe word instead of those words you should abide by them. I dont understand why you think prostitutes just say no as automatic role play or fake passion but thats seriously wrong and outright dangerous to say. \n\nEdited to add:\nIf anyone is going to be rough to a sexual partner, paid or not paid, there always needs to be a discussion of consent and boundaries beforehand. You don't just go into it rough and aggressive and accidently think your partner is in the throes of passion, fake or otherwise.",
                    "author": "SacrosanctHarlot24",
                    "id": "gn1azgb",
                    "parent_id": "t1_gmzzoc0",
                    "score": 8,
                    "created_utc": 1613114385.0,
                    "replies": []
                },
                {
                    "body": "Yo fuck alllllllll the way off. You’re so wrong in so many ways. You, too, need help. And an education.",
                    "author": "radioheaded17",
                    "id": "gn0574h",
                    "parent_id": "t1_gmzzoc0",
                    "score": 7,
                    "created_utc": 1613089637.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "gn0n0s1",
                            "parent_id": "t1_gn0574h",
                            "score": -2,
                            "created_utc": 1613099006.0,
                            "replies": [
                                {
                                    "body": "Again...doesn’t matter if he was too dumb to realize she was being serious. IT’S STILL RAPE. Stop chiming in on conversations you clearly know nothing about and fuck you for being such a piece of shit. I can only hope to god that you haven’t raped anyone, because judging by your response here it sounds like you probably have (considering you don’t know how consent works). I sincerely hope you walk off a bridge - we need less rapists in this world.",
                                    "author": "radioheaded17",
                                    "id": "gn2kc4x",
                                    "parent_id": "t1_gn0n0s1",
                                    "score": 1,
                                    "created_utc": 1613146286.0,
                                    "replies": [
                                        {
                                            "body": "[deleted]",
                                            "author": null,
                                            "id": "gn3oz6i",
                                            "parent_id": "t1_gn2kc4x",
                                            "score": 0,
                                            "created_utc": 1613164335.0,
                                            "replies": [
                                                {
                                                    "body": "Okay troll.",
                                                    "author": "radioheaded17",
                                                    "id": "gn3qecx",
                                                    "parent_id": "t1_gn3oz6i",
                                                    "score": 1,
                                                    "created_utc": 1613165001.0,
                                                    "replies": [
                                                        {
                                                            "body": "[deleted]",
                                                            "author": null,
                                                            "id": "gn4cdyd",
                                                            "parent_id": "t1_gn3qecx",
                                                            "score": 0,
                                                            "created_utc": 1613176076.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Hahaha yea man. You’re a real intellectual. Whatever you gotta tell yourself I guess 🤷🏼‍♀️",
                                                                    "author": "radioheaded17",
                                                                    "id": "gn4gt0x",
                                                                    "parent_id": "t1_gn4cdyd",
                                                                    "score": 1,
                                                                    "created_utc": 1613178519.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "[deleted]",
                                                                            "author": null,
                                                                            "id": "gn5m8aj",
                                                                            "parent_id": "t1_gn4gt0x",
                                                                            "score": 1,
                                                                            "created_utc": 1613202077.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "Yes you are clearly an intellectual 🤣🤣🤣",
                                                                                    "author": "radioheaded17",
                                                                                    "id": "gn82umv",
                                                                                    "parent_id": "t1_gn5m8aj",
                                                                                    "score": 2,
                                                                                    "created_utc": 1613228770.0,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "100% get help and decide if you want to report.\n\n&#x200B;\n\nIf you continue to sugar, I highly recommend talking through sexual expectations and what you're not comfortable with. Also establish a safe word! Even if they tell you they want vanilla stuff make sure there's a safe word.",
            "author": "fidgetfuckboi",
            "id": "gmzy302",
            "parent_id": "t3_lhm1z6",
            "score": 0,
            "created_utc": 1613086047.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gmywe5p",
            "parent_id": "t3_lhm1z6",
            "score": -7,
            "created_utc": 1613069473.0,
            "replies": [
                {
                    "body": "Fuck you\n\nEDIT: this person posted this yesterday: \"black people can only be victims in today’s media.\"  So, racist as well as cruel.",
                    "author": null,
                    "id": "gmz1xa5",
                    "parent_id": "t1_gmywe5p",
                    "score": 8,
                    "created_utc": 1613071794.0,
                    "replies": []
                },
                {
                    "body": "Jesus this is a dark take on this poor girl's experience.\n\nI shouldn't have to say that regardless of her \"life choices\" she is still entitled to have someone stop when she says so.\n\nYou are a SB?  Female?  Human?\n\nedit: just read your past posts.. I understand now. You have some challenges.",
                    "author": "craa141",
                    "id": "gmz1glx",
                    "parent_id": "t1_gmywe5p",
                    "score": 6,
                    "created_utc": 1613071599.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gmzwlg3",
            "parent_id": "t3_lhm1z6",
            "score": -12,
            "created_utc": 1613085320.0,
            "replies": [
                {
                    "body": "That means nothing. Those are fake internet points for visibility. Are you new?",
                    "author": "_Terrible_Advice_",
                    "id": "gmzzg2u",
                    "parent_id": "t1_gmzwlg3",
                    "score": 7,
                    "created_utc": 1613086721.0,
                    "replies": []
                },
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "gn0u2ez",
                    "parent_id": "t1_gmzwlg3",
                    "score": 4,
                    "created_utc": 1613102821.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "gnl4nh4",
                            "parent_id": "t1_gn0u2ez",
                            "score": 1,
                            "created_utc": 1613431282.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "gnl8jy8",
                                    "parent_id": "t1_gnl4nh4",
                                    "score": 1,
                                    "created_utc": 1613433322.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gmzmoax",
            "parent_id": "t3_lhm1z6",
            "score": -10,
            "created_utc": 1613080685.0,
            "replies": [
                {
                    "body": "No consent is consent. It doesn't matter if he watches rape porn; that doesn't give him an excuse to rape someone.",
                    "author": "_Terrible_Advice_",
                    "id": "gmzzbgk",
                    "parent_id": "t1_gmzmoax",
                    "score": 8,
                    "created_utc": 1613086656.0,
                    "replies": []
                },
                {
                    "body": "Yo some of you mfers really need an education. \n\nIdgaf how stupid the man is, if she says stop he needs to stop. That’s a non-negotiable...unless of course the scene was discussed prior and consented to by all parties. Which clearly never happened. \n\nStupid or not (in this case, let’s be honest, it wasn’t stupidity), it’s rape alllllllll fucking day. Get your victim-blaming bullshit outta here.",
                    "author": "radioheaded17",
                    "id": "gn06513",
                    "parent_id": "t1_gmzmoax",
                    "score": 5,
                    "created_utc": 1613090127.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[removed]",
            "author": null,
            "id": "gmyqhym",
            "parent_id": "t3_lhm1z6",
            "score": -26,
            "created_utc": 1613067014.0,
            "replies": [
                {
                    "body": "That.... is not how consent works. Consent can be revoked at any time. What she went through was definitely rape.",
                    "author": "officialtwice",
                    "id": "gmyreek",
                    "parent_id": "t1_gmyqhym",
                    "score": 26,
                    "created_utc": 1613067392.0,
                    "replies": []
                },
                {
                    "body": "Hi OP, please don’t listen to this fuckhead POS ^^^^ You were raped and you (I say this with absolute certainty) have the right to retract consent whenever you damn well please. A man is not “allowed to finish” just because he’s already inside you. That’s some full on rapist mentality right there.",
                    "author": "radioheaded17",
                    "id": "gmyrj2p",
                    "parent_id": "t1_gmyqhym",
                    "score": 23,
                    "created_utc": 1613067445.0,
                    "replies": []
                },
                {
                    "body": "You also need to get yourself counseling. Sounds like you may have raped a few women yourself.",
                    "author": "radioheaded17",
                    "id": "gmyrmbd",
                    "parent_id": "t1_gmyqhym",
                    "score": 18,
                    "created_utc": 1613067483.0,
                    "replies": [
                        {
                            "body": "[removed]",
                            "author": null,
                            "id": "gmyrwzf",
                            "parent_id": "t1_gmyrmbd",
                            "score": -17,
                            "created_utc": 1613067604.0,
                            "replies": [
                                {
                                    "body": "Just because you don’t understand how consent works doesn’t mean your dumbass opinion is correct. It means you’re probably a rapist 🤷🏼‍♀️",
                                    "author": "radioheaded17",
                                    "id": "gmys9pz",
                                    "parent_id": "t1_gmyrwzf",
                                    "score": 15,
                                    "created_utc": 1613067751.0,
                                    "replies": [
                                        {
                                            "body": "[removed]",
                                            "author": null,
                                            "id": "gmytbki",
                                            "parent_id": "t1_gmys9pz",
                                            "score": -8,
                                            "created_utc": 1613068187.0,
                                            "replies": [
                                                {
                                                    "body": "Dude if you want to defend a loophole in rape law, go for it. You’re just letting us all know that you’re a rapist. Like...you’re shouting it from the rooftops. \n\nWeird flex but ok.",
                                                    "author": "radioheaded17",
                                                    "id": "gmywg50",
                                                    "parent_id": "t1_gmytbki",
                                                    "score": 8,
                                                    "created_utc": 1613069496.0,
                                                    "replies": []
                                                },
                                                {
                                                    "body": "Citation needed",
                                                    "author": "Grimouire",
                                                    "id": "gmz2xf9",
                                                    "parent_id": "t1_gmytbki",
                                                    "score": 2,
                                                    "created_utc": 1613072219.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "So if the man can't finish, the sex never ends?  I can see that when they were handing out the ability to create a well thought-out position you clearly had some better shit to do.  Sex ends when either party decides to end it, and that's not some difficult position to see.  It's the concensus of everyone with a developed sense of logic, dignity, and respect for their fellow human.\n\n\nJust entertain an example: You're having consensual sex, and have agreed to be tied up.  Before you've finished, you begin feeling intense unexplained pain in your genitals, it increases with every thrust. You ask your partner to stop.  By your own fucked argument, your partner would be well within their rights to just continue regardless of your pain, ad infinitum until you finish, and you'd have no choice but to sit through it, since you haven't finished and the sex hasn't ended.  \n\nIf anyone involved decides the sex needs to stop, and the sex doesn't stop, that's called rape.  Your argument is invalid.\n\n\nEdit:  Did I just make a rape apologist delete his account?  This may be my proudest moment on Reddit.",
                                    "author": "Mousec0pTrismegistus",
                                    "id": "gmywf0k",
                                    "parent_id": "t1_gmyrwzf",
                                    "score": 5,
                                    "created_utc": 1613069483.0,
                                    "replies": []
                                },
                                {
                                    "body": "Your comment history is DISGUSTING",
                                    "author": "BGDDDY1",
                                    "id": "gmywx50",
                                    "parent_id": "t1_gmyrwzf",
                                    "score": 5,
                                    "created_utc": 1613069688.0,
                                    "replies": []
                                },
                                {
                                    "body": "No. It. Doesn’t. You need to educate yourself on consent. Someone get this rapist off this forum, please.",
                                    "author": "orangeyaglad",
                                    "id": "gmyznzp",
                                    "parent_id": "t1_gmyrwzf",
                                    "score": 5,
                                    "created_utc": 1613070844.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "People like you are part of the problem because you make excuses for rapists. Educate yourself.",
                    "author": "BellaMob",
                    "id": "gmyrtag",
                    "parent_id": "t1_gmyqhym",
                    "score": 12,
                    "created_utc": 1613067562.0,
                    "replies": [
                        {
                            "body": "[removed]",
                            "author": null,
                            "id": "gmytd1v",
                            "parent_id": "t1_gmyrtag",
                            "score": -3,
                            "created_utc": 1613068204.0,
                            "replies": [
                                {
                                    "body": "It’s actually not the law. You should educate yourself. NC did their job to fix the consent loophole last year. They were the last state to do so. Rape is rape and consent can be revoked at any time. \n\n[ New state laws close loopholes in sexual assault cases](https://www.wwaytv3.com/2020/01/02/new-state-laws-close-loopholes-in-sexual-assault-cases/)",
                                    "author": "orangeyaglad",
                                    "id": "gmyzak1",
                                    "parent_id": "t1_gmytd1v",
                                    "score": 8,
                                    "created_utc": 1613070687.0,
                                    "replies": []
                                },
                                {
                                    "body": "North Carolina is literally the only state with that law... I wonder why. Anyone that can’t think of the effects of their actions beyond the law needs counseling. Also I hope you didn’t just admit to rape in this fucking subreddit.",
                                    "author": "officialtwice",
                                    "id": "gmyvab4",
                                    "parent_id": "t1_gmytd1v",
                                    "score": 5,
                                    "created_utc": 1613069017.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Sexual consent is an agreement to participate in a sexual activity. Both people must agree to sex - every single time- for it to be consensual. They are allowed to withdraw their consent at any point if they feel uncomfortable. The rapist refuse to acknowledge “no” and proceed to degrade and continue to rape her. That is very much rape. I suggest you educate yourself more on what is consent, instead of filling your own narrative. Highly suggest you to delete your comment before OP sees this",
                    "author": "nuancesushi",
                    "id": "gmyvxjj",
                    "parent_id": "t1_gmyqhym",
                    "score": 8,
                    "created_utc": 1613069282.0,
                    "replies": [
                        {
                            "body": "Also OP may not be from NC, also last I heard they’re redefining NC’s rape laws.",
                            "author": "nuancesushi",
                            "id": "gmyxt9w",
                            "parent_id": "t1_gmyvxjj",
                            "score": 4,
                            "created_utc": 1613070058.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "That is completely wrong. Consent can be revoked at any time.",
                    "author": "Grimouire",
                    "id": "gmz2rvj",
                    "parent_id": "t1_gmyqhym",
                    "score": 7,
                    "created_utc": 1613072153.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I’m so sorry for what this man did. It’s not your job to be assaulted, he’s way off base. \nI encourage talking to someone, local sexual violence organizations can offer confidential support. No pressure to call the police or do anything you don’t want to do. Just someone to listen and help you explore options and next steps. You deserve nothing but the best in your healing and journey forward.",
            "author": "flamingogrrrl",
            "id": "gmyn0ff",
            "parent_id": "t3_lhm1z6",
            "score": 1,
            "created_utc": 1613065576.0,
            "replies": []
        },
        {
            "body": "I’m soo sorry that happened! Please reach out to your school! They should offer counseling services that you can talk to",
            "author": null,
            "id": "gmzgsn5",
            "parent_id": "t3_lhm1z6",
            "score": 1,
            "created_utc": 1613078129.0,
            "replies": []
        },
        {
            "body": "Hey. Im really, really sorry this has happened to you.\n\nThis has happened to me as well. If you have conservative parents it’s more than likely cops will make it complicated. \n\nAs people have said, please please please get counseling services through your school. If you want to talk to someone please DM me. I know what you’re going through.",
            "author": "cinnamonpenguinss",
            "id": "gn08zfq",
            "parent_id": "t3_lhm1z6",
            "score": 1,
            "created_utc": 1613091601.0,
            "replies": []
        },
        {
            "body": "I’m so sorry for u. That wasn’t consensual. Hope u find some form of help. And call the police for assault .",
            "author": "mrdobie",
            "id": "gn0wq1p",
            "parent_id": "t3_lhm1z6",
            "score": 1,
            "created_utc": 1613104354.0,
            "replies": []
        },
        {
            "body": "What state do you live in message me if you want too",
            "author": "PageExcellent6393",
            "id": "gn1a2o6",
            "parent_id": "t3_lhm1z6",
            "score": 1,
            "created_utc": 1613113613.0,
            "replies": []
        },
        {
            "body": "You should talk to a lawyer immediately.",
            "author": "SnooPets2822",
            "id": "gn1evz4",
            "parent_id": "t3_lhm1z6",
            "score": 1,
            "created_utc": 1613117837.0,
            "replies": []
        },
        {
            "body": "I'm so sorry to hear about your experience.  \n\nBe careful about some of the advice you are getting here. Based upon your choice of words and the fact you are Muslim, I'm assuming you are not in the US.  Depending on the country you are in, rape counseling resources and societal reaction vary greatly.  \n\nEven in very developed countries (like Germany, France or the Netherlands) honor killings of Muslim women by a father or brother for shaming their family are still known to happen.",
            "author": "willfromvb",
            "id": "gn1i5wm",
            "parent_id": "t3_lhm1z6",
            "score": 1,
            "created_utc": 1613120820.0,
            "replies": []
        },
        {
            "body": "You have the right to dignity and giving or revoking consent. This man is a predator, knows how to create his game, and I dare say it won't be his first or last play.",
            "author": "auntiemonkey",
            "id": "gn1jv3b",
            "parent_id": "t3_lhm1z6",
            "score": 1,
            "created_utc": 1613122414.0,
            "replies": []
        },
        {
            "body": "First im sorry, 2nd report him ASAP. He doesnt get to live his life normally and treat people how he wants after he raped you and probably others as well. Report him.",
            "author": "BcbornLeo",
            "id": "gn1ldav",
            "parent_id": "t3_lhm1z6",
            "score": 1,
            "created_utc": 1613123858.0,
            "replies": []
        },
        {
            "body": "Sorry to hear what happen to you, but at this young age you always be naïve and gullible. Sometime a wolf wear sheep skin.",
            "author": "MoneyCuzz",
            "id": "gn1suma",
            "parent_id": "t3_lhm1z6",
            "score": 1,
            "created_utc": 1613130802.0,
            "replies": []
        },
        {
            "body": "There is always an idiot out there who makes it hard for rest of SDs.",
            "author": null,
            "id": "gn2hf5e",
            "parent_id": "t3_lhm1z6",
            "score": 1,
            "created_utc": 1613144954.0,
            "replies": []
        },
        {
            "body": "Sosososo sorry. I will add : a doctor groped me WHILE I WAS IN THE E. R. when I was 16. Men are pigs, no matter the occupation. Be extremely careful from now on. Again, I hope you find help.",
            "author": "euridicee",
            "id": "gn9ukbd",
            "parent_id": "t3_lhm1z6",
            "score": 1,
            "created_utc": 1613245232.0,
            "replies": []
        },
        {
            "body": "I am so sorry this has happened to you. Thank you for posting what had happened to you here for others to see, to warn others. This wasn't your fault. Please check out the resources regarding counseling others have posted.",
            "author": "BlBl_SD",
            "id": "gngmig5",
            "parent_id": "t3_lhm1z6",
            "score": 1,
            "created_utc": 1613333888.0,
            "replies": []
        },
        {
            "body": "If this pathetic excuse fir a ‘man’ was from SA website, I hope that Brandon Wade burns in an extra tortuous part of hell for his ‘sugaring’ websites. I hope you reported him to police. He is a rapist.",
            "author": "JuniorScallion5",
            "id": "gpnin0w",
            "parent_id": "t3_lhm1z6",
            "score": 1,
            "created_utc": 1614866410.0,
            "replies": []
        },
        {
            "body": "Oh, no. I am here if you would ever like to talk. But I have to implore you to please go to the police. You need to report this. You can't let it stop here. You can try to get surveillance from the hotel to give to them. But please. Don't let this go. Look for advocates, look for someone to help and go for counseling. I wish this hadn't been your first experience. You deserve more than how this 'man' treated you.",
            "author": "txbredbookworm",
            "id": "gq7236f",
            "parent_id": "t3_lhm1z6",
            "score": 1,
            "created_utc": 1615197429.0,
            "replies": []
        },
        {
            "body": "reading this almost made me cry i have no idea how u feeling rn but i am very very sorry this happend to you and u didnt deserve it he should be ashamed for what he did he need to pay for everything  not pay with money something bigger than that so he will never forget he need to be punished dont get counsling they aint helping u u gotta help yourself im a sugar baby to but im very sorry",
            "author": "SexyMarie1232",
            "id": "gtxceyz",
            "parent_id": "t3_lhm1z6",
            "score": 1,
            "created_utc": 1617973365.0,
            "replies": []
        },
        {
            "body": "Omg go to his wife he could have done this to more women!check for STDs and don't tell anyone he paid you say he was just a guy you met on the internet!go protect the others please!",
            "author": "Alphachadbeard",
            "id": "hu4k3u0",
            "parent_id": "t3_lhm1z6",
            "score": 1,
            "created_utc": 1643095344.0,
            "replies": []
        },
        {
            "body": "Agree with the above  with priorities\n \n    Get counseling \n\n    Consider whether to report it ( nothing matters that happened before you said STOP  like NO   it is a complete sentence and his proceeding is rape) .  There was a case in Orange County where a prominent doctor and his female assistant made a practice of picking up young women, drugging and filming them.  Tragically this is all to common today. \n\nReflect on the red flags for future reference and to share with your girlfriends ( not the story but the need to be wary )",
            "author": "pinotandsugar",
            "id": "gmyqojx",
            "parent_id": "t1_gmyi8qj",
            "score": 51,
            "created_utc": 1613067091.0,
            "replies": []
        },
        {
            "body": "was thinking same thing.  hate to suggest violence with violence but this Dr needs to have a hard lesson in life.  Guys like this give all men a bad reputation.",
            "author": "Buckeyechamp21",
            "id": "gmyyiz1",
            "parent_id": "t1_gmykqlg",
            "score": 17,
            "created_utc": 1613070361.0,
            "replies": []
        },
        {
            "body": "Really great links here.",
            "author": "WorldwideLoving",
            "id": "gn1aaag",
            "parent_id": "t1_gmyig02",
            "score": 3,
            "created_utc": 1613113793.0,
            "replies": []
        },
        {
            "body": "[https://www.rainn.org/about-national-sexual-assault-telephone-hotline](https://www.rainn.org/about-national-sexual-assault-telephone-hotline)",
            "author": null,
            "id": "gmz1v8p",
            "parent_id": "t1_gmz1d9n",
            "score": 6,
            "created_utc": 1613071770.0,
            "replies": []
        },
        {
            "body": "Great advice. I am so sorry this happened to you as well, but it shows the OP that she can get through this. I hope she takes you up on your offer to DM",
            "author": "Teejaynj",
            "id": "gmz6x94",
            "parent_id": "t1_gmyko5f",
            "score": 8,
            "created_utc": 1613073898.0,
            "replies": []
        },
        {
            "body": "Yeah, you make a great point about caring for yourself. Be gentle with yourself and don't feel any pressure to get back to a normal schedule, healing comes first. And recognize how this experience has affected your sexuality, really be honest with yourself as you move forward with any other person.",
            "author": "Mysterious_Fox_8616",
            "id": "gn7peva",
            "parent_id": "t1_gmz5165",
            "score": 2,
            "created_utc": 1613224518.0,
            "replies": []
        },
        {
            "body": "It's not a very uplifting point to make, but in many cases there is no point in reporting because the authorities do not take it seriously. This is not okay, but it is a reality in a lot of cases that a woman has to be so strong to make that report in the first place and it ends up being the one hurt the most when the system fails her. As women we have to be realistic and find the right decision for ourselves knowing that reporting a sex crime is a difficult path and justice is not guaranteed. I say this as someone who did report my rapist but found no justice. Sadly there is not an easy answer and in some cases the victim needs to make a decision if she will feel empowered by reporting the crime or just immeasurably more pained by the legal process.",
            "author": "Mysterious_Fox_8616",
            "id": "gn7rfh4",
            "parent_id": "t1_gmz9c55",
            "score": 1,
            "created_utc": 1613225191.0,
            "replies": []
        },
        {
            "body": "Literally",
            "author": "_trainspotting",
            "id": "gmzrmak",
            "parent_id": "t1_gmzh94o",
            "score": 6,
            "created_utc": 1613082971.0,
            "replies": []
        },
        {
            "body": "Although disagree with some you are saying; there is a lot of truth here.  But many of SDs don't think of any woman or SB like that.\n\nAnd my first instinct was to find out where this motherfucker lives; get on a plane and go stomp his ass and I'm quite certain at least another dozen on this thread would join me.\n\nThis guy is not representative of all men or of all SDs.\n\nBut you are on the money of young girls thinking its fun and exciting.  And I know we all have our own reasons and dont judge anyone as we are all on the same site(s).  But it seems more mature woman on for better reasons or necessities.\n\nBut thanks for your honest opinions",
            "author": "Buckeyechamp21",
            "id": "gn2mf9t",
            "parent_id": "t1_gn1kg86",
            "score": 1,
            "created_utc": 1613147225.0,
            "replies": [
                {
                    "body": "I’m not saying this is all or even the majority of men you’d come across on SD sites. You’re right to want to hurt him because it’s what he deserves. He’s a rapist. Period. But I do think that gentlemen such as yourself have no way of seeing really just how much of these sites are made up of men like this.  I have escorted and sugared and my years of experience is that there are men who see escorts, men who only seek out SB, and men who do both. The overlap is significant. My google contact list tells me so. And there are just as many predators on SD sites as escorting ones. So I encourage any younger SB to follow some experienced and smart FSSW on Twitter etc so they can learn better how to keep themselves safe. Because the tactics these predators use are similar, and these young women need skills to spot red flags, to screen, etc. They won’t become “jaded” or “transactional” by knowing how to stay safe. Actually the exact opposite. Safety will allow them to remain happy and fun. And sadly even after learning safety techniques it’s not a guarantee of safety, and that is something they need to know before going into sugaring.\nYes you can meet wonderful men and make real connections but the path to that end goal can be extremely dangerous. And the criminalization of sex work emboldens predators. I had a friend who was raped at gun point and the rapist mocked her inability to go to the police as he raped her.\nI am very sad for this young woman. I wish she had help and guidance. I wish she was free to peruse justice without fear. I hope she is able to get therapy and support for her trauma. And I wish her safety and peace for her future.",
                    "author": "missmandyloves",
                    "id": "gn2oebx",
                    "parent_id": "t1_gn2mf9t",
                    "score": 3,
                    "created_utc": 1613148110.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Unless she lives in one of the rare places in the world like New Zealand with decriminalized sex work she actually cannot. I wish people would stop advising her to go to the police. Unless she is in such a place she will be so worse off if she does.\nIt is also quite telling that on a sugaring forum so many people are ignorant to this reality. \nBut I guess that’s the main attraction to sugaring for many. It’s the delusion that it’s not sex work. Well it is. The police will at best do nothing, will most likely say things to her that will traumatize and haunt her as bad as the rape, and at worst could assault her or arrest her.\nAnd if you think I am exaggerating I hope you’ll do some research. Police are allowed in many states to legally have sex with women as part of prostitution stings. Police often use the threat of arrest to coerce sex (aka rape) women. \nShe needs to find a therapist not the police. And those of you suggesting she contact the cops need to wake up. Dangerous and delusional advice to a vulnerable young victim.",
            "author": "missmandyloves",
            "id": "gn1lhqw",
            "parent_id": "t1_gn09629",
            "score": 6,
            "created_utc": 1613123977.0,
            "replies": [
                {
                    "body": "Yes. This. All of this. Cops can’t be trusted.",
                    "author": "ashes2asscheeks",
                    "id": "gn33gyd",
                    "parent_id": "t1_gn1lhqw",
                    "score": 3,
                    "created_utc": 1613154592.0,
                    "replies": [
                        {
                            "body": "Some cops support prostitution. Old customers.  Not all cops, but you can't have the illusion that because of their profession, they are trustworthy; just the way you can't know if a successful doctor is going to rape you.",
                            "author": "Mysterious_Fox_8616",
                            "id": "gn7u3f9",
                            "parent_id": "t1_gn33gyd",
                            "score": 1,
                            "created_utc": 1613226026.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "For whatever reasons she decided to get into sugaring, it doesn’t justify and shouldn’t have been a causation to being assaulted. There is no need to be condescending nor diminutive to her, her decisions or intelligence.",
            "author": "searchfete",
            "id": "gmzxvqu",
            "parent_id": "t1_gmzfrob",
            "score": 8,
            "created_utc": 1613085947.0,
            "replies": [
                {
                    "body": "100% agreed. This comment is completely unhelpful and uncalled for.",
                    "author": "radioheaded17",
                    "id": "gn05h1k",
                    "parent_id": "t1_gmzxvqu",
                    "score": 4,
                    "created_utc": 1613089779.0,
                    "replies": []
                },
                {
                    "body": "I’m not justifying the awful events that happened, but OP definitely needs people to be more frank with her. This is the real world.",
                    "author": "BulkyMoney2",
                    "id": "gn0977c",
                    "parent_id": "t1_gmzxvqu",
                    "score": 0,
                    "created_utc": 1613091714.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Uh no. Every rape victim deals with it differently.",
            "author": "_Terrible_Advice_",
            "id": "gmzz771",
            "parent_id": "t1_gmzt9zb",
            "score": 10,
            "created_utc": 1613086597.0,
            "replies": []
        },
        {
            "body": "If a prostitute says \"stop\" or \"no\" it means the same damn thing as when a sugar baby does. When ANY person says \"no\" \"stop\" it means stop. Unless you've discussed a safe word instead of those words you should abide by them. I dont understand why you think prostitutes just say no as automatic role play or fake passion but thats seriously wrong and outright dangerous to say. \n\nEdited to add:\nIf anyone is going to be rough to a sexual partner, paid or not paid, there always needs to be a discussion of consent and boundaries beforehand. You don't just go into it rough and aggressive and accidently think your partner is in the throes of passion, fake or otherwise.",
            "author": "SacrosanctHarlot24",
            "id": "gn1azgb",
            "parent_id": "t1_gmzzoc0",
            "score": 8,
            "created_utc": 1613114385.0,
            "replies": []
        },
        {
            "body": "Yo fuck alllllllll the way off. You’re so wrong in so many ways. You, too, need help. And an education.",
            "author": "radioheaded17",
            "id": "gn0574h",
            "parent_id": "t1_gmzzoc0",
            "score": 7,
            "created_utc": 1613089637.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "gn0n0s1",
                    "parent_id": "t1_gn0574h",
                    "score": -2,
                    "created_utc": 1613099006.0,
                    "replies": [
                        {
                            "body": "Again...doesn’t matter if he was too dumb to realize she was being serious. IT’S STILL RAPE. Stop chiming in on conversations you clearly know nothing about and fuck you for being such a piece of shit. I can only hope to god that you haven’t raped anyone, because judging by your response here it sounds like you probably have (considering you don’t know how consent works). I sincerely hope you walk off a bridge - we need less rapists in this world.",
                            "author": "radioheaded17",
                            "id": "gn2kc4x",
                            "parent_id": "t1_gn0n0s1",
                            "score": 1,
                            "created_utc": 1613146286.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "gn3oz6i",
                                    "parent_id": "t1_gn2kc4x",
                                    "score": 0,
                                    "created_utc": 1613164335.0,
                                    "replies": [
                                        {
                                            "body": "Okay troll.",
                                            "author": "radioheaded17",
                                            "id": "gn3qecx",
                                            "parent_id": "t1_gn3oz6i",
                                            "score": 1,
                                            "created_utc": 1613165001.0,
                                            "replies": [
                                                {
                                                    "body": "[deleted]",
                                                    "author": null,
                                                    "id": "gn4cdyd",
                                                    "parent_id": "t1_gn3qecx",
                                                    "score": 0,
                                                    "created_utc": 1613176076.0,
                                                    "replies": [
                                                        {
                                                            "body": "Hahaha yea man. You’re a real intellectual. Whatever you gotta tell yourself I guess 🤷🏼‍♀️",
                                                            "author": "radioheaded17",
                                                            "id": "gn4gt0x",
                                                            "parent_id": "t1_gn4cdyd",
                                                            "score": 1,
                                                            "created_utc": 1613178519.0,
                                                            "replies": [
                                                                {
                                                                    "body": "[deleted]",
                                                                    "author": null,
                                                                    "id": "gn5m8aj",
                                                                    "parent_id": "t1_gn4gt0x",
                                                                    "score": 1,
                                                                    "created_utc": 1613202077.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "Yes you are clearly an intellectual 🤣🤣🤣",
                                                                            "author": "radioheaded17",
                                                                            "id": "gn82umv",
                                                                            "parent_id": "t1_gn5m8aj",
                                                                            "score": 2,
                                                                            "created_utc": 1613228770.0,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Fuck you\n\nEDIT: this person posted this yesterday: \"black people can only be victims in today’s media.\"  So, racist as well as cruel.",
            "author": null,
            "id": "gmz1xa5",
            "parent_id": "t1_gmywe5p",
            "score": 8,
            "created_utc": 1613071794.0,
            "replies": []
        },
        {
            "body": "Jesus this is a dark take on this poor girl's experience.\n\nI shouldn't have to say that regardless of her \"life choices\" she is still entitled to have someone stop when she says so.\n\nYou are a SB?  Female?  Human?\n\nedit: just read your past posts.. I understand now. You have some challenges.",
            "author": "craa141",
            "id": "gmz1glx",
            "parent_id": "t1_gmywe5p",
            "score": 6,
            "created_utc": 1613071599.0,
            "replies": []
        },
        {
            "body": "That means nothing. Those are fake internet points for visibility. Are you new?",
            "author": "_Terrible_Advice_",
            "id": "gmzzg2u",
            "parent_id": "t1_gmzwlg3",
            "score": 7,
            "created_utc": 1613086721.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gn0u2ez",
            "parent_id": "t1_gmzwlg3",
            "score": 4,
            "created_utc": 1613102821.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "gnl4nh4",
                    "parent_id": "t1_gn0u2ez",
                    "score": 1,
                    "created_utc": 1613431282.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "gnl8jy8",
                            "parent_id": "t1_gnl4nh4",
                            "score": 1,
                            "created_utc": 1613433322.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "No consent is consent. It doesn't matter if he watches rape porn; that doesn't give him an excuse to rape someone.",
            "author": "_Terrible_Advice_",
            "id": "gmzzbgk",
            "parent_id": "t1_gmzmoax",
            "score": 8,
            "created_utc": 1613086656.0,
            "replies": []
        },
        {
            "body": "Yo some of you mfers really need an education. \n\nIdgaf how stupid the man is, if she says stop he needs to stop. That’s a non-negotiable...unless of course the scene was discussed prior and consented to by all parties. Which clearly never happened. \n\nStupid or not (in this case, let’s be honest, it wasn’t stupidity), it’s rape alllllllll fucking day. Get your victim-blaming bullshit outta here.",
            "author": "radioheaded17",
            "id": "gn06513",
            "parent_id": "t1_gmzmoax",
            "score": 5,
            "created_utc": 1613090127.0,
            "replies": []
        },
        {
            "body": "That.... is not how consent works. Consent can be revoked at any time. What she went through was definitely rape.",
            "author": "officialtwice",
            "id": "gmyreek",
            "parent_id": "t1_gmyqhym",
            "score": 26,
            "created_utc": 1613067392.0,
            "replies": []
        },
        {
            "body": "Hi OP, please don’t listen to this fuckhead POS ^^^^ You were raped and you (I say this with absolute certainty) have the right to retract consent whenever you damn well please. A man is not “allowed to finish” just because he’s already inside you. That’s some full on rapist mentality right there.",
            "author": "radioheaded17",
            "id": "gmyrj2p",
            "parent_id": "t1_gmyqhym",
            "score": 23,
            "created_utc": 1613067445.0,
            "replies": []
        },
        {
            "body": "You also need to get yourself counseling. Sounds like you may have raped a few women yourself.",
            "author": "radioheaded17",
            "id": "gmyrmbd",
            "parent_id": "t1_gmyqhym",
            "score": 18,
            "created_utc": 1613067483.0,
            "replies": [
                {
                    "body": "[removed]",
                    "author": null,
                    "id": "gmyrwzf",
                    "parent_id": "t1_gmyrmbd",
                    "score": -17,
                    "created_utc": 1613067604.0,
                    "replies": [
                        {
                            "body": "Just because you don’t understand how consent works doesn’t mean your dumbass opinion is correct. It means you’re probably a rapist 🤷🏼‍♀️",
                            "author": "radioheaded17",
                            "id": "gmys9pz",
                            "parent_id": "t1_gmyrwzf",
                            "score": 15,
                            "created_utc": 1613067751.0,
                            "replies": [
                                {
                                    "body": "[removed]",
                                    "author": null,
                                    "id": "gmytbki",
                                    "parent_id": "t1_gmys9pz",
                                    "score": -8,
                                    "created_utc": 1613068187.0,
                                    "replies": [
                                        {
                                            "body": "Dude if you want to defend a loophole in rape law, go for it. You’re just letting us all know that you’re a rapist. Like...you’re shouting it from the rooftops. \n\nWeird flex but ok.",
                                            "author": "radioheaded17",
                                            "id": "gmywg50",
                                            "parent_id": "t1_gmytbki",
                                            "score": 8,
                                            "created_utc": 1613069496.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "Citation needed",
                                            "author": "Grimouire",
                                            "id": "gmz2xf9",
                                            "parent_id": "t1_gmytbki",
                                            "score": 2,
                                            "created_utc": 1613072219.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "So if the man can't finish, the sex never ends?  I can see that when they were handing out the ability to create a well thought-out position you clearly had some better shit to do.  Sex ends when either party decides to end it, and that's not some difficult position to see.  It's the concensus of everyone with a developed sense of logic, dignity, and respect for their fellow human.\n\n\nJust entertain an example: You're having consensual sex, and have agreed to be tied up.  Before you've finished, you begin feeling intense unexplained pain in your genitals, it increases with every thrust. You ask your partner to stop.  By your own fucked argument, your partner would be well within their rights to just continue regardless of your pain, ad infinitum until you finish, and you'd have no choice but to sit through it, since you haven't finished and the sex hasn't ended.  \n\nIf anyone involved decides the sex needs to stop, and the sex doesn't stop, that's called rape.  Your argument is invalid.\n\n\nEdit:  Did I just make a rape apologist delete his account?  This may be my proudest moment on Reddit.",
                            "author": "Mousec0pTrismegistus",
                            "id": "gmywf0k",
                            "parent_id": "t1_gmyrwzf",
                            "score": 5,
                            "created_utc": 1613069483.0,
                            "replies": []
                        },
                        {
                            "body": "Your comment history is DISGUSTING",
                            "author": "BGDDDY1",
                            "id": "gmywx50",
                            "parent_id": "t1_gmyrwzf",
                            "score": 5,
                            "created_utc": 1613069688.0,
                            "replies": []
                        },
                        {
                            "body": "No. It. Doesn’t. You need to educate yourself on consent. Someone get this rapist off this forum, please.",
                            "author": "orangeyaglad",
                            "id": "gmyznzp",
                            "parent_id": "t1_gmyrwzf",
                            "score": 5,
                            "created_utc": 1613070844.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "People like you are part of the problem because you make excuses for rapists. Educate yourself.",
            "author": "BellaMob",
            "id": "gmyrtag",
            "parent_id": "t1_gmyqhym",
            "score": 12,
            "created_utc": 1613067562.0,
            "replies": [
                {
                    "body": "[removed]",
                    "author": null,
                    "id": "gmytd1v",
                    "parent_id": "t1_gmyrtag",
                    "score": -3,
                    "created_utc": 1613068204.0,
                    "replies": [
                        {
                            "body": "It’s actually not the law. You should educate yourself. NC did their job to fix the consent loophole last year. They were the last state to do so. Rape is rape and consent can be revoked at any time. \n\n[ New state laws close loopholes in sexual assault cases](https://www.wwaytv3.com/2020/01/02/new-state-laws-close-loopholes-in-sexual-assault-cases/)",
                            "author": "orangeyaglad",
                            "id": "gmyzak1",
                            "parent_id": "t1_gmytd1v",
                            "score": 8,
                            "created_utc": 1613070687.0,
                            "replies": []
                        },
                        {
                            "body": "North Carolina is literally the only state with that law... I wonder why. Anyone that can’t think of the effects of their actions beyond the law needs counseling. Also I hope you didn’t just admit to rape in this fucking subreddit.",
                            "author": "officialtwice",
                            "id": "gmyvab4",
                            "parent_id": "t1_gmytd1v",
                            "score": 5,
                            "created_utc": 1613069017.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Sexual consent is an agreement to participate in a sexual activity. Both people must agree to sex - every single time- for it to be consensual. They are allowed to withdraw their consent at any point if they feel uncomfortable. The rapist refuse to acknowledge “no” and proceed to degrade and continue to rape her. That is very much rape. I suggest you educate yourself more on what is consent, instead of filling your own narrative. Highly suggest you to delete your comment before OP sees this",
            "author": "nuancesushi",
            "id": "gmyvxjj",
            "parent_id": "t1_gmyqhym",
            "score": 8,
            "created_utc": 1613069282.0,
            "replies": [
                {
                    "body": "Also OP may not be from NC, also last I heard they’re redefining NC’s rape laws.",
                    "author": "nuancesushi",
                    "id": "gmyxt9w",
                    "parent_id": "t1_gmyvxjj",
                    "score": 4,
                    "created_utc": 1613070058.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "That is completely wrong. Consent can be revoked at any time.",
            "author": "Grimouire",
            "id": "gmz2rvj",
            "parent_id": "t1_gmyqhym",
            "score": 7,
            "created_utc": 1613072153.0,
            "replies": []
        },
        {
            "body": "I’m not saying this is all or even the majority of men you’d come across on SD sites. You’re right to want to hurt him because it’s what he deserves. He’s a rapist. Period. But I do think that gentlemen such as yourself have no way of seeing really just how much of these sites are made up of men like this.  I have escorted and sugared and my years of experience is that there are men who see escorts, men who only seek out SB, and men who do both. The overlap is significant. My google contact list tells me so. And there are just as many predators on SD sites as escorting ones. So I encourage any younger SB to follow some experienced and smart FSSW on Twitter etc so they can learn better how to keep themselves safe. Because the tactics these predators use are similar, and these young women need skills to spot red flags, to screen, etc. They won’t become “jaded” or “transactional” by knowing how to stay safe. Actually the exact opposite. Safety will allow them to remain happy and fun. And sadly even after learning safety techniques it’s not a guarantee of safety, and that is something they need to know before going into sugaring.\nYes you can meet wonderful men and make real connections but the path to that end goal can be extremely dangerous. And the criminalization of sex work emboldens predators. I had a friend who was raped at gun point and the rapist mocked her inability to go to the police as he raped her.\nI am very sad for this young woman. I wish she had help and guidance. I wish she was free to peruse justice without fear. I hope she is able to get therapy and support for her trauma. And I wish her safety and peace for her future.",
            "author": "missmandyloves",
            "id": "gn2oebx",
            "parent_id": "t1_gn2mf9t",
            "score": 3,
            "created_utc": 1613148110.0,
            "replies": []
        },
        {
            "body": "Yes. This. All of this. Cops can’t be trusted.",
            "author": "ashes2asscheeks",
            "id": "gn33gyd",
            "parent_id": "t1_gn1lhqw",
            "score": 3,
            "created_utc": 1613154592.0,
            "replies": [
                {
                    "body": "Some cops support prostitution. Old customers.  Not all cops, but you can't have the illusion that because of their profession, they are trustworthy; just the way you can't know if a successful doctor is going to rape you.",
                    "author": "Mysterious_Fox_8616",
                    "id": "gn7u3f9",
                    "parent_id": "t1_gn33gyd",
                    "score": 1,
                    "created_utc": 1613226026.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "100% agreed. This comment is completely unhelpful and uncalled for.",
            "author": "radioheaded17",
            "id": "gn05h1k",
            "parent_id": "t1_gmzxvqu",
            "score": 4,
            "created_utc": 1613089779.0,
            "replies": []
        },
        {
            "body": "I’m not justifying the awful events that happened, but OP definitely needs people to be more frank with her. This is the real world.",
            "author": "BulkyMoney2",
            "id": "gn0977c",
            "parent_id": "t1_gmzxvqu",
            "score": 0,
            "created_utc": 1613091714.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gn0n0s1",
            "parent_id": "t1_gn0574h",
            "score": -2,
            "created_utc": 1613099006.0,
            "replies": [
                {
                    "body": "Again...doesn’t matter if he was too dumb to realize she was being serious. IT’S STILL RAPE. Stop chiming in on conversations you clearly know nothing about and fuck you for being such a piece of shit. I can only hope to god that you haven’t raped anyone, because judging by your response here it sounds like you probably have (considering you don’t know how consent works). I sincerely hope you walk off a bridge - we need less rapists in this world.",
                    "author": "radioheaded17",
                    "id": "gn2kc4x",
                    "parent_id": "t1_gn0n0s1",
                    "score": 1,
                    "created_utc": 1613146286.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "gn3oz6i",
                            "parent_id": "t1_gn2kc4x",
                            "score": 0,
                            "created_utc": 1613164335.0,
                            "replies": [
                                {
                                    "body": "Okay troll.",
                                    "author": "radioheaded17",
                                    "id": "gn3qecx",
                                    "parent_id": "t1_gn3oz6i",
                                    "score": 1,
                                    "created_utc": 1613165001.0,
                                    "replies": [
                                        {
                                            "body": "[deleted]",
                                            "author": null,
                                            "id": "gn4cdyd",
                                            "parent_id": "t1_gn3qecx",
                                            "score": 0,
                                            "created_utc": 1613176076.0,
                                            "replies": [
                                                {
                                                    "body": "Hahaha yea man. You’re a real intellectual. Whatever you gotta tell yourself I guess 🤷🏼‍♀️",
                                                    "author": "radioheaded17",
                                                    "id": "gn4gt0x",
                                                    "parent_id": "t1_gn4cdyd",
                                                    "score": 1,
                                                    "created_utc": 1613178519.0,
                                                    "replies": [
                                                        {
                                                            "body": "[deleted]",
                                                            "author": null,
                                                            "id": "gn5m8aj",
                                                            "parent_id": "t1_gn4gt0x",
                                                            "score": 1,
                                                            "created_utc": 1613202077.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Yes you are clearly an intellectual 🤣🤣🤣",
                                                                    "author": "radioheaded17",
                                                                    "id": "gn82umv",
                                                                    "parent_id": "t1_gn5m8aj",
                                                                    "score": 2,
                                                                    "created_utc": 1613228770.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gnl4nh4",
            "parent_id": "t1_gn0u2ez",
            "score": 1,
            "created_utc": 1613431282.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "gnl8jy8",
                    "parent_id": "t1_gnl4nh4",
                    "score": 1,
                    "created_utc": 1613433322.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[removed]",
            "author": null,
            "id": "gmyrwzf",
            "parent_id": "t1_gmyrmbd",
            "score": -17,
            "created_utc": 1613067604.0,
            "replies": [
                {
                    "body": "Just because you don’t understand how consent works doesn’t mean your dumbass opinion is correct. It means you’re probably a rapist 🤷🏼‍♀️",
                    "author": "radioheaded17",
                    "id": "gmys9pz",
                    "parent_id": "t1_gmyrwzf",
                    "score": 15,
                    "created_utc": 1613067751.0,
                    "replies": [
                        {
                            "body": "[removed]",
                            "author": null,
                            "id": "gmytbki",
                            "parent_id": "t1_gmys9pz",
                            "score": -8,
                            "created_utc": 1613068187.0,
                            "replies": [
                                {
                                    "body": "Dude if you want to defend a loophole in rape law, go for it. You’re just letting us all know that you’re a rapist. Like...you’re shouting it from the rooftops. \n\nWeird flex but ok.",
                                    "author": "radioheaded17",
                                    "id": "gmywg50",
                                    "parent_id": "t1_gmytbki",
                                    "score": 8,
                                    "created_utc": 1613069496.0,
                                    "replies": []
                                },
                                {
                                    "body": "Citation needed",
                                    "author": "Grimouire",
                                    "id": "gmz2xf9",
                                    "parent_id": "t1_gmytbki",
                                    "score": 2,
                                    "created_utc": 1613072219.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "So if the man can't finish, the sex never ends?  I can see that when they were handing out the ability to create a well thought-out position you clearly had some better shit to do.  Sex ends when either party decides to end it, and that's not some difficult position to see.  It's the concensus of everyone with a developed sense of logic, dignity, and respect for their fellow human.\n\n\nJust entertain an example: You're having consensual sex, and have agreed to be tied up.  Before you've finished, you begin feeling intense unexplained pain in your genitals, it increases with every thrust. You ask your partner to stop.  By your own fucked argument, your partner would be well within their rights to just continue regardless of your pain, ad infinitum until you finish, and you'd have no choice but to sit through it, since you haven't finished and the sex hasn't ended.  \n\nIf anyone involved decides the sex needs to stop, and the sex doesn't stop, that's called rape.  Your argument is invalid.\n\n\nEdit:  Did I just make a rape apologist delete his account?  This may be my proudest moment on Reddit.",
                    "author": "Mousec0pTrismegistus",
                    "id": "gmywf0k",
                    "parent_id": "t1_gmyrwzf",
                    "score": 5,
                    "created_utc": 1613069483.0,
                    "replies": []
                },
                {
                    "body": "Your comment history is DISGUSTING",
                    "author": "BGDDDY1",
                    "id": "gmywx50",
                    "parent_id": "t1_gmyrwzf",
                    "score": 5,
                    "created_utc": 1613069688.0,
                    "replies": []
                },
                {
                    "body": "No. It. Doesn’t. You need to educate yourself on consent. Someone get this rapist off this forum, please.",
                    "author": "orangeyaglad",
                    "id": "gmyznzp",
                    "parent_id": "t1_gmyrwzf",
                    "score": 5,
                    "created_utc": 1613070844.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[removed]",
            "author": null,
            "id": "gmytd1v",
            "parent_id": "t1_gmyrtag",
            "score": -3,
            "created_utc": 1613068204.0,
            "replies": [
                {
                    "body": "It’s actually not the law. You should educate yourself. NC did their job to fix the consent loophole last year. They were the last state to do so. Rape is rape and consent can be revoked at any time. \n\n[ New state laws close loopholes in sexual assault cases](https://www.wwaytv3.com/2020/01/02/new-state-laws-close-loopholes-in-sexual-assault-cases/)",
                    "author": "orangeyaglad",
                    "id": "gmyzak1",
                    "parent_id": "t1_gmytd1v",
                    "score": 8,
                    "created_utc": 1613070687.0,
                    "replies": []
                },
                {
                    "body": "North Carolina is literally the only state with that law... I wonder why. Anyone that can’t think of the effects of their actions beyond the law needs counseling. Also I hope you didn’t just admit to rape in this fucking subreddit.",
                    "author": "officialtwice",
                    "id": "gmyvab4",
                    "parent_id": "t1_gmytd1v",
                    "score": 5,
                    "created_utc": 1613069017.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Also OP may not be from NC, also last I heard they’re redefining NC’s rape laws.",
            "author": "nuancesushi",
            "id": "gmyxt9w",
            "parent_id": "t1_gmyvxjj",
            "score": 4,
            "created_utc": 1613070058.0,
            "replies": []
        },
        {
            "body": "Some cops support prostitution. Old customers.  Not all cops, but you can't have the illusion that because of their profession, they are trustworthy; just the way you can't know if a successful doctor is going to rape you.",
            "author": "Mysterious_Fox_8616",
            "id": "gn7u3f9",
            "parent_id": "t1_gn33gyd",
            "score": 1,
            "created_utc": 1613226026.0,
            "replies": []
        },
        {
            "body": "Again...doesn’t matter if he was too dumb to realize she was being serious. IT’S STILL RAPE. Stop chiming in on conversations you clearly know nothing about and fuck you for being such a piece of shit. I can only hope to god that you haven’t raped anyone, because judging by your response here it sounds like you probably have (considering you don’t know how consent works). I sincerely hope you walk off a bridge - we need less rapists in this world.",
            "author": "radioheaded17",
            "id": "gn2kc4x",
            "parent_id": "t1_gn0n0s1",
            "score": 1,
            "created_utc": 1613146286.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "gn3oz6i",
                    "parent_id": "t1_gn2kc4x",
                    "score": 0,
                    "created_utc": 1613164335.0,
                    "replies": [
                        {
                            "body": "Okay troll.",
                            "author": "radioheaded17",
                            "id": "gn3qecx",
                            "parent_id": "t1_gn3oz6i",
                            "score": 1,
                            "created_utc": 1613165001.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "gn4cdyd",
                                    "parent_id": "t1_gn3qecx",
                                    "score": 0,
                                    "created_utc": 1613176076.0,
                                    "replies": [
                                        {
                                            "body": "Hahaha yea man. You’re a real intellectual. Whatever you gotta tell yourself I guess 🤷🏼‍♀️",
                                            "author": "radioheaded17",
                                            "id": "gn4gt0x",
                                            "parent_id": "t1_gn4cdyd",
                                            "score": 1,
                                            "created_utc": 1613178519.0,
                                            "replies": [
                                                {
                                                    "body": "[deleted]",
                                                    "author": null,
                                                    "id": "gn5m8aj",
                                                    "parent_id": "t1_gn4gt0x",
                                                    "score": 1,
                                                    "created_utc": 1613202077.0,
                                                    "replies": [
                                                        {
                                                            "body": "Yes you are clearly an intellectual 🤣🤣🤣",
                                                            "author": "radioheaded17",
                                                            "id": "gn82umv",
                                                            "parent_id": "t1_gn5m8aj",
                                                            "score": 2,
                                                            "created_utc": 1613228770.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gnl8jy8",
            "parent_id": "t1_gnl4nh4",
            "score": 1,
            "created_utc": 1613433322.0,
            "replies": []
        },
        {
            "body": "Just because you don’t understand how consent works doesn’t mean your dumbass opinion is correct. It means you’re probably a rapist 🤷🏼‍♀️",
            "author": "radioheaded17",
            "id": "gmys9pz",
            "parent_id": "t1_gmyrwzf",
            "score": 15,
            "created_utc": 1613067751.0,
            "replies": [
                {
                    "body": "[removed]",
                    "author": null,
                    "id": "gmytbki",
                    "parent_id": "t1_gmys9pz",
                    "score": -8,
                    "created_utc": 1613068187.0,
                    "replies": [
                        {
                            "body": "Dude if you want to defend a loophole in rape law, go for it. You’re just letting us all know that you’re a rapist. Like...you’re shouting it from the rooftops. \n\nWeird flex but ok.",
                            "author": "radioheaded17",
                            "id": "gmywg50",
                            "parent_id": "t1_gmytbki",
                            "score": 8,
                            "created_utc": 1613069496.0,
                            "replies": []
                        },
                        {
                            "body": "Citation needed",
                            "author": "Grimouire",
                            "id": "gmz2xf9",
                            "parent_id": "t1_gmytbki",
                            "score": 2,
                            "created_utc": 1613072219.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "So if the man can't finish, the sex never ends?  I can see that when they were handing out the ability to create a well thought-out position you clearly had some better shit to do.  Sex ends when either party decides to end it, and that's not some difficult position to see.  It's the concensus of everyone with a developed sense of logic, dignity, and respect for their fellow human.\n\n\nJust entertain an example: You're having consensual sex, and have agreed to be tied up.  Before you've finished, you begin feeling intense unexplained pain in your genitals, it increases with every thrust. You ask your partner to stop.  By your own fucked argument, your partner would be well within their rights to just continue regardless of your pain, ad infinitum until you finish, and you'd have no choice but to sit through it, since you haven't finished and the sex hasn't ended.  \n\nIf anyone involved decides the sex needs to stop, and the sex doesn't stop, that's called rape.  Your argument is invalid.\n\n\nEdit:  Did I just make a rape apologist delete his account?  This may be my proudest moment on Reddit.",
            "author": "Mousec0pTrismegistus",
            "id": "gmywf0k",
            "parent_id": "t1_gmyrwzf",
            "score": 5,
            "created_utc": 1613069483.0,
            "replies": []
        },
        {
            "body": "Your comment history is DISGUSTING",
            "author": "BGDDDY1",
            "id": "gmywx50",
            "parent_id": "t1_gmyrwzf",
            "score": 5,
            "created_utc": 1613069688.0,
            "replies": []
        },
        {
            "body": "No. It. Doesn’t. You need to educate yourself on consent. Someone get this rapist off this forum, please.",
            "author": "orangeyaglad",
            "id": "gmyznzp",
            "parent_id": "t1_gmyrwzf",
            "score": 5,
            "created_utc": 1613070844.0,
            "replies": []
        },
        {
            "body": "It’s actually not the law. You should educate yourself. NC did their job to fix the consent loophole last year. They were the last state to do so. Rape is rape and consent can be revoked at any time. \n\n[ New state laws close loopholes in sexual assault cases](https://www.wwaytv3.com/2020/01/02/new-state-laws-close-loopholes-in-sexual-assault-cases/)",
            "author": "orangeyaglad",
            "id": "gmyzak1",
            "parent_id": "t1_gmytd1v",
            "score": 8,
            "created_utc": 1613070687.0,
            "replies": []
        },
        {
            "body": "North Carolina is literally the only state with that law... I wonder why. Anyone that can’t think of the effects of their actions beyond the law needs counseling. Also I hope you didn’t just admit to rape in this fucking subreddit.",
            "author": "officialtwice",
            "id": "gmyvab4",
            "parent_id": "t1_gmytd1v",
            "score": 5,
            "created_utc": 1613069017.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gn3oz6i",
            "parent_id": "t1_gn2kc4x",
            "score": 0,
            "created_utc": 1613164335.0,
            "replies": [
                {
                    "body": "Okay troll.",
                    "author": "radioheaded17",
                    "id": "gn3qecx",
                    "parent_id": "t1_gn3oz6i",
                    "score": 1,
                    "created_utc": 1613165001.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "gn4cdyd",
                            "parent_id": "t1_gn3qecx",
                            "score": 0,
                            "created_utc": 1613176076.0,
                            "replies": [
                                {
                                    "body": "Hahaha yea man. You’re a real intellectual. Whatever you gotta tell yourself I guess 🤷🏼‍♀️",
                                    "author": "radioheaded17",
                                    "id": "gn4gt0x",
                                    "parent_id": "t1_gn4cdyd",
                                    "score": 1,
                                    "created_utc": 1613178519.0,
                                    "replies": [
                                        {
                                            "body": "[deleted]",
                                            "author": null,
                                            "id": "gn5m8aj",
                                            "parent_id": "t1_gn4gt0x",
                                            "score": 1,
                                            "created_utc": 1613202077.0,
                                            "replies": [
                                                {
                                                    "body": "Yes you are clearly an intellectual 🤣🤣🤣",
                                                    "author": "radioheaded17",
                                                    "id": "gn82umv",
                                                    "parent_id": "t1_gn5m8aj",
                                                    "score": 2,
                                                    "created_utc": 1613228770.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "[removed]",
            "author": null,
            "id": "gmytbki",
            "parent_id": "t1_gmys9pz",
            "score": -8,
            "created_utc": 1613068187.0,
            "replies": [
                {
                    "body": "Dude if you want to defend a loophole in rape law, go for it. You’re just letting us all know that you’re a rapist. Like...you’re shouting it from the rooftops. \n\nWeird flex but ok.",
                    "author": "radioheaded17",
                    "id": "gmywg50",
                    "parent_id": "t1_gmytbki",
                    "score": 8,
                    "created_utc": 1613069496.0,
                    "replies": []
                },
                {
                    "body": "Citation needed",
                    "author": "Grimouire",
                    "id": "gmz2xf9",
                    "parent_id": "t1_gmytbki",
                    "score": 2,
                    "created_utc": 1613072219.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Okay troll.",
            "author": "radioheaded17",
            "id": "gn3qecx",
            "parent_id": "t1_gn3oz6i",
            "score": 1,
            "created_utc": 1613165001.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "gn4cdyd",
                    "parent_id": "t1_gn3qecx",
                    "score": 0,
                    "created_utc": 1613176076.0,
                    "replies": [
                        {
                            "body": "Hahaha yea man. You’re a real intellectual. Whatever you gotta tell yourself I guess 🤷🏼‍♀️",
                            "author": "radioheaded17",
                            "id": "gn4gt0x",
                            "parent_id": "t1_gn4cdyd",
                            "score": 1,
                            "created_utc": 1613178519.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "gn5m8aj",
                                    "parent_id": "t1_gn4gt0x",
                                    "score": 1,
                                    "created_utc": 1613202077.0,
                                    "replies": [
                                        {
                                            "body": "Yes you are clearly an intellectual 🤣🤣🤣",
                                            "author": "radioheaded17",
                                            "id": "gn82umv",
                                            "parent_id": "t1_gn5m8aj",
                                            "score": 2,
                                            "created_utc": 1613228770.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Dude if you want to defend a loophole in rape law, go for it. You’re just letting us all know that you’re a rapist. Like...you’re shouting it from the rooftops. \n\nWeird flex but ok.",
            "author": "radioheaded17",
            "id": "gmywg50",
            "parent_id": "t1_gmytbki",
            "score": 8,
            "created_utc": 1613069496.0,
            "replies": []
        },
        {
            "body": "Citation needed",
            "author": "Grimouire",
            "id": "gmz2xf9",
            "parent_id": "t1_gmytbki",
            "score": 2,
            "created_utc": 1613072219.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gn4cdyd",
            "parent_id": "t1_gn3qecx",
            "score": 0,
            "created_utc": 1613176076.0,
            "replies": [
                {
                    "body": "Hahaha yea man. You’re a real intellectual. Whatever you gotta tell yourself I guess 🤷🏼‍♀️",
                    "author": "radioheaded17",
                    "id": "gn4gt0x",
                    "parent_id": "t1_gn4cdyd",
                    "score": 1,
                    "created_utc": 1613178519.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "gn5m8aj",
                            "parent_id": "t1_gn4gt0x",
                            "score": 1,
                            "created_utc": 1613202077.0,
                            "replies": [
                                {
                                    "body": "Yes you are clearly an intellectual 🤣🤣🤣",
                                    "author": "radioheaded17",
                                    "id": "gn82umv",
                                    "parent_id": "t1_gn5m8aj",
                                    "score": 2,
                                    "created_utc": 1613228770.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Hahaha yea man. You’re a real intellectual. Whatever you gotta tell yourself I guess 🤷🏼‍♀️",
            "author": "radioheaded17",
            "id": "gn4gt0x",
            "parent_id": "t1_gn4cdyd",
            "score": 1,
            "created_utc": 1613178519.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "gn5m8aj",
                    "parent_id": "t1_gn4gt0x",
                    "score": 1,
                    "created_utc": 1613202077.0,
                    "replies": [
                        {
                            "body": "Yes you are clearly an intellectual 🤣🤣🤣",
                            "author": "radioheaded17",
                            "id": "gn82umv",
                            "parent_id": "t1_gn5m8aj",
                            "score": 2,
                            "created_utc": 1613228770.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gn5m8aj",
            "parent_id": "t1_gn4gt0x",
            "score": 1,
            "created_utc": 1613202077.0,
            "replies": [
                {
                    "body": "Yes you are clearly an intellectual 🤣🤣🤣",
                    "author": "radioheaded17",
                    "id": "gn82umv",
                    "parent_id": "t1_gn5m8aj",
                    "score": 2,
                    "created_utc": 1613228770.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Yes you are clearly an intellectual 🤣🤣🤣",
            "author": "radioheaded17",
            "id": "gn82umv",
            "parent_id": "t1_gn5m8aj",
            "score": 2,
            "created_utc": 1613228770.0,
            "replies": []
        }
    ]
}