{
    "title": "Sugar Daddies on Reddit can be a bit delusional",
    "post_id": "qh1lle",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/qh1lle/sugar_daddies_on_reddit_can_be_a_bit_delusional/",
    "author": "kikienen",
    "body": "First of all I’ll love to point out the double standards that ‘sugar daddies’ on Reddit seem to have when it comes to sugar relationships. The comments [this post](https://www.reddit.com/r/sugarlifestyleforum/comments/qgqzbv/ppm_and_time_spent/?utm_source=share&utm_medium=ios_app&utm_name=iossmf) talking about the sugar baby being escorty because she times her dates but in my opinion it’s you SDs that treat the sugar babies like escorts the way you dole out allowances or should I say PPMs  based on the degree of intimacy. \n\nYou keep saying that Sugar dasing isn’t vanilla so why do you insist on doing everything like it’s a vanilla relationship at least the only thing that favours you. Most of your sugar babies have not future with you, the relationship might never progress so why do you insist on draining her energy for a relationship that’s honestly really transactional( I honestly don’t care if you love each other or not, it’s still transactional). Also I’ll like to add that the biggest lie I’ve heard so far is that you don’t have to be wealthy to be a sugar daddy, well that’s a load of crap because you have no problem telling these poor girls that their value as an SB is based on their physical appearance so why are you salty when women prefer men with larger pockets. I’m glad women are waking up and realizing what being in a sugar relationship entails and aren’t taking the bare minimum from men who want to live out their provider fantasies whilst working on a limited budget. \n\nYou claim to be secure in your masculinity as a sugar daddy but you convulse at the thought of another man sending gifts on [SA](It means “sucker… attention all rinsers and scammers, contact this man immediately!”) \nYou claim to be ready to provide in a sugar relationship but can’t even gift a young woman two hundred dollars for getting ready to see you at a m&g. If we’re just being honest, a lot of you are just too broke to afford actual escorts and a sugar relationship is your next best bet.  So girls take note of this and don’t give up any sugar to any man who sees you as a walking sex doll. Stay safe and stop entertaining stingy men 😘\n\nP.s because I know what the comments are going to look like already \n1. This is not my personal first hand experience- I wouldn’t tolerate such \n2. I’m in a sugar relationship already and always looking out for something better so no I’m not burnt out \n3. I’m not bitter, men lack the ability to make me so.\n4. I’m in no way saying rinsing is okay but some of you men have found a way to twist the meaning of the word, like do you even know what it means at this point? \n5. Also ladies don’t be scared to be called an escort or a rinser by these men, they throw those words so carelessly that it hardly has meaning anymore. As long as you’re a woman who expects more from a Sugar daddy you’re suddenly an escort or a rinser.",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/qh1lle/sugar_daddies_on_reddit_can_be_a_bit_delusional/",
    "score": 199,
    "upvote_ratio": 0.79,
    "created_utc": 1635354965.0,
    "num_comments": 127,
    "links": [
        [
            "https://www.reddit.com/r/sugarlifestyleforum/comments/qgqzbv/ppm_and_time_spent/?utm_source=share&utm_medium=ios_app&utm_name=iossmf"
        ]
    ],
    "comments": [
        {
            "body": "I want to preface this by saying everyone deserves respect up front, regardless of if they are an escort or a SB. The umbrella of sex work is vast, and imo includes sugaring. \n\nSDs can absolutely behave like johns. That does happen. That does not negate the fact that the referenced post is showcasing an SB who is much more escort like. Having a hard stop of 2 hour dates is truly pay per hour.  Call a spade a spade. \n\nNow there’s nothing wrong with this if she finds someone it meshes with. It’s their prerogative. The problem is when the two people don’t align.\n\nBoth parties have people who behave in this fashion, and it’s as simple as nexting them if it’s not what you’re looking for. This forum is comprised of a lot men that are looking for that relationship feel, so it’s created an echo chamber. I think it’s really silly to generalize unless you’re going to pull up individual comments that are “John like” of those people who complained about “escort like”  behaviour in the thread (or others) to point out hypocrisy. Otherwise you’re kind of shouting into the void. \n\nI see a lot of men here who pay allowance if they don’t see their SB or if they don’t get intimacy, so I guess I’m just not drawing a parallel with this forum to what you’re saying. M&G in my opinion shouldn’t be paid, so we won’t agree there anyway, but for the rest I think you’re being a little hyperbolic on the representation of the forum. \n\nAlso, larger pockets does not equate to more generosity. I don’t think anyone here would be annoyed you want someone who has more money, they would just tell you that it may not translate how you want it to.",
            "author": "Cdnsugarr",
            "id": "hiag1z2",
            "parent_id": "t3_qh1lle",
            "score": 37,
            "created_utc": 1635364926.0,
            "replies": []
        },
        {
            "body": "My two cents - they're not delusional (not on these issues anyway) they're spoiled and don't even realize it. \n\nLOTS of SBs are desperate. Lots and lots of them. They flood the bowl and drag PPMs down and allow SDs to do the least and get the most. The SBs in communities like this, just by nature of taking the time to engage and learn, are outliers. The majority of SBs never come across a forum like this or any sort of community. Or they only see the platonic/online-only girls, realize that's not reality, and then either quit accept horrible treatment because they don't know that better is possible. \n\nThere's also a lot more SBs than SDs. So even if some portion of SBs are standing strong and demanding more, there are still plenty who will take their place. \n\nSDs are almost entirely in control of the bowl at large because of these dynamics. So of course they use it to their favor. And it's not even malicious - they're just doing what's \"normal\".",
            "author": "MASugarBaby",
            "id": "hi9y2nu",
            "parent_id": "t3_qh1lle",
            "score": 69,
            "created_utc": 1635357979.0,
            "replies": [
                {
                    "body": "All facts.",
                    "author": "southernslick",
                    "id": "hiac7fi",
                    "parent_id": "t1_hi9y2nu",
                    "score": 8,
                    "created_utc": 1635363452.0,
                    "replies": []
                },
                {
                    "body": "As an aside and not forgetting,  women are almost entirely in control (of dating) outside of the bowl and of course use it to their favour..",
                    "author": "DBeleven",
                    "id": "hia70nk",
                    "parent_id": "t1_hi9y2nu",
                    "score": 34,
                    "created_utc": 1635361442.0,
                    "replies": [
                        {
                            "body": "This inverse in sugaring dating is what leads to most of these whinging posts. It's not that anyone is necessarily being taken advantage of, they are just used to being in control of the dynamics of the market and feel uncomfortable now that they don't get to call the shots.",
                            "author": "storm170",
                            "id": "hia9bkr",
                            "parent_id": "t1_hia70nk",
                            "score": 41,
                            "created_utc": 1635362344.0,
                            "replies": [
                                {
                                    "body": "Such a good post",
                                    "author": "wb19081908",
                                    "id": "hiajkml",
                                    "parent_id": "t1_hia9bkr",
                                    "score": 15,
                                    "created_utc": 1635366261.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "👌",
                    "author": "lipstickdiet",
                    "id": "hiabw42",
                    "parent_id": "t1_hi9y2nu",
                    "score": 3,
                    "created_utc": 1635363331.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Y’all stop shitting on escorts. Just treat everyone with kindness and respect each other’s boundaries like adults.",
            "author": "realitytomydreams",
            "id": "hi9wgg1",
            "parent_id": "t3_qh1lle",
            "score": 78,
            "created_utc": 1635357352.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "hia8f3t",
                    "parent_id": "t1_hi9wgg1",
                    "score": 13,
                    "created_utc": 1635361992.0,
                    "replies": [
                        {
                            "body": "Absolutely. Escorts can stop shitting on SDs who actually treat their SBs like a human being and respect her boundaries.",
                            "author": "realitytomydreams",
                            "id": "hia8onz",
                            "parent_id": "t1_hia8f3t",
                            "score": 18,
                            "created_utc": 1635362096.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "hiafhr9",
                                    "parent_id": "t1_hia8onz",
                                    "score": 9,
                                    "created_utc": 1635364713.0,
                                    "replies": [
                                        {
                                            "body": "Entertain me on this, if one treats their sugar partners with respect and understands that there are always those who don’t, would one still be triggered by this post calling out the bad ones? Wouldn’t one instead call for their bad peers to do better?",
                                            "author": "realitytomydreams",
                                            "id": "hiai9gg",
                                            "parent_id": "t1_hiafhr9",
                                            "score": 11,
                                            "created_utc": 1635365766.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "So that's the majority of SDs on this forum, so we can just shoo them right out the door and not have to listen to them ever again?  I fully support this.",
                                    "author": "storm170",
                                    "id": "hiabkcz",
                                    "parent_id": "t1_hia8onz",
                                    "score": 4,
                                    "created_utc": 1635363204.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "hi9ye6h",
                    "parent_id": "t1_hi9wgg1",
                    "score": 10,
                    "created_utc": 1635358103.0,
                    "replies": [
                        {
                            "body": "Hey buddy, it was a general statement and no I did not go back to that post to see what it was about. But I’ve seen many in SLF at the very least insinuate to some degree that escorts are trash. My comment was to remind everyone to just treat each other with basic respect for another human being, escort or not. I wish you a good day.",
                            "author": "realitytomydreams",
                            "id": "hi9yy0n",
                            "parent_id": "t1_hi9ye6h",
                            "score": 11,
                            "created_utc": 1635358316.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "hia0kxt",
                                    "parent_id": "t1_hi9yy0n",
                                    "score": -4,
                                    "created_utc": 1635358944.0,
                                    "replies": [
                                        {
                                            "body": "Oof buddy. Woke up on the wrong side of bed didn’t you? Also, you just assumed “y’all” referred to SDs when it’s literally a gender neutral term. \n\nBuddy, someone told me generalizations make you look uneducated and obtuse. So 🤷🏻‍♀️",
                                            "author": "realitytomydreams",
                                            "id": "hia1ewv",
                                            "parent_id": "t1_hia0kxt",
                                            "score": 12,
                                            "created_utc": 1635359265.0,
                                            "replies": [
                                                {
                                                    "body": "I agree Splendid was a bit sensitive, but you posted your comment in a thread that is deliberately attacking SDs on the forum.  While you may have meant for it to be a general comment to everyone, it's placement in this thread gives it a targeted feel.",
                                                    "author": "storm170",
                                                    "id": "hia4tqk",
                                                    "parent_id": "t1_hia1ewv",
                                                    "score": 3,
                                                    "created_utc": 1635360588.0,
                                                    "replies": [
                                                        {
                                                            "body": "This post is NOT attacking real SDs. Let's get it straight",
                                                            "author": null,
                                                            "id": "hiatq2n",
                                                            "parent_id": "t1_hia4tqk",
                                                            "score": 4,
                                                            "created_utc": 1635370200.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Then she should have phrased her title and her post better.  If I described the SBs of SLF as bitter, shrill, man-haters based on what I've seen from the OP I'd be doing a disservice to 90+% of the women who post here.\n\nLet's get that straight.",
                                                                    "author": "storm170",
                                                                    "id": "hiau3el",
                                                                    "parent_id": "t1_hiatq2n",
                                                                    "score": 5,
                                                                    "created_utc": 1635370350.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "Are you implying OP is bitter and a man hater? No I'm sure she is not. But you missed the point again, that she is making. She is calling out specific men who are not real SDs but think they are. And I 100% agree with everything in her post.",
                                                                            "author": null,
                                                                            "id": "hiay2qy",
                                                                            "parent_id": "t1_hiau3el",
                                                                            "score": 1,
                                                                            "created_utc": 1635371967.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "Do you need to take some classes in reading comprehension?  She generalized all the SDs on Reddit in her post, not talking about a few bad actors that might actually line up with her rambling description.  She did this purposefully to create a controversial post, not to call out specific men.  Can you really not see that?  And yes, I've flat out called her a lemon grove already today so those terms definitely fit the OP.\n\nAnd I'm sure you do agree with everything in her post.  That is not surprising, just disappointing.",
                                                                                    "author": "storm170",
                                                                                    "id": "hiaymkw",
                                                                                    "parent_id": "t1_hiay2qy",
                                                                                    "score": 2,
                                                                                    "created_utc": 1635372195.0,
                                                                                    "replies": [
                                                                                        {
                                                                                            "body": "Why do you seem so angry lol Yeah because alot of the guys on here are fake SDs.  sure some are actual real SDs but alot of them aren't. Do you feel personally attacked by her post?",
                                                                                            "author": null,
                                                                                            "id": "hiazkxr",
                                                                                            "parent_id": "t1_hiaymkw",
                                                                                            "score": 4,
                                                                                            "created_utc": 1635372594.0,
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "body": "You really need to chill",
                                            "author": "lipstickdiet",
                                            "id": "hia7ilw",
                                            "parent_id": "t1_hia0kxt",
                                            "score": -4,
                                            "created_utc": 1635361638.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "They keep shitting on escorts because they can’t afford them",
                    "author": "kikienen",
                    "id": "hi9xa5l",
                    "parent_id": "t1_hi9wgg1",
                    "score": 3,
                    "created_utc": 1635357670.0,
                    "replies": [
                        {
                            "body": "I can afford escorts and don’t shit on them. But I don’t want my sugar to be anywhere close to escort like just like I don’t want my escorts to be sugar like. They may both be of the sex worker world but they are different",
                            "author": "thereadinessisall",
                            "id": "hi9y2zp",
                            "parent_id": "t1_hi9xa5l",
                            "score": 14,
                            "created_utc": 1635357982.0,
                            "replies": []
                        },
                        {
                            "body": "That is a common perception, and an insult that gets thrown around when new SBs run into some of the \"locker room talk\" that happen here on SLF.  A while back I decided to take a look at the escort forums and at least for my local area escorts are WAY cheaper than even a Splenda level allowance.",
                            "author": "Paul_Drake",
                            "id": "hi9zoxb",
                            "parent_id": "t1_hi9xa5l",
                            "score": 20,
                            "created_utc": 1635358605.0,
                            "replies": [
                                {
                                    "body": "I've avoided chiming in previously, but bikini-model/yoga-instructor -hot escorts where I live are generally at \"Splenda\" prices.  Much cheaper than a SB.",
                                    "author": "LaGriffeDuLion",
                                    "id": "hia4f2h",
                                    "parent_id": "t1_hi9zoxb",
                                    "score": 23,
                                    "created_utc": 1635360428.0,
                                    "replies": []
                                },
                                {
                                    "body": "Exactly. Where I live escorts are cheaper too.",
                                    "author": null,
                                    "id": "hia0dlb",
                                    "parent_id": "t1_hi9zoxb",
                                    "score": 11,
                                    "created_utc": 1635358867.0,
                                    "replies": []
                                },
                                {
                                    "body": "I agree, it's an inane comment meant to disparage the SDs that participate on this forum without any factual basis.  Maybe if we were hiring the escort for 4-5 hours it would be significantly more expensive than a weekly allowance, but that's not what you do with an escort so the comparison is moot.",
                                    "author": "storm170",
                                    "id": "hia0a8q",
                                    "parent_id": "t1_hi9zoxb",
                                    "score": 7,
                                    "created_utc": 1635358832.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "hia7zxu",
                            "parent_id": "t1_hi9xa5l",
                            "score": 12,
                            "created_utc": 1635361826.0,
                            "replies": [
                                {
                                    "body": "Considering the way you treat your sugar babies I won’t be surprised",
                                    "author": "kikienen",
                                    "id": "hia8jx9",
                                    "parent_id": "t1_hia7zxu",
                                    "score": -14,
                                    "created_utc": 1635362045.0,
                                    "replies": [
                                        {
                                            "body": "You are correct. He’s the guy who sexually assaulted a drunk woman in a dirty service elevator in a so called meet and greet. And then wrote a post to brag about it. Then deleted the post after all the women called him out on the assault.",
                                            "author": "SerendipityX8",
                                            "id": "hiaht7m",
                                            "parent_id": "t1_hia8jx9",
                                            "score": 10,
                                            "created_utc": 1635365595.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "Ding ding ding",
                            "author": "lipstickdiet",
                            "id": "hia798w",
                            "parent_id": "t1_hi9xa5l",
                            "score": -2,
                            "created_utc": 1635361535.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I think part of the problem is that... anyone on reddit can sign up for this sub (Or Seeking) and designate themselves as a SD.  I'd imagine if there was any vetting possible, we wouldn't see these types of posts. \n\nBut, welcome to the internet.",
            "author": "YakiMe",
            "id": "hiawhvo",
            "parent_id": "t3_qh1lle",
            "score": 19,
            "created_utc": 1635371318.0,
            "replies": []
        },
        {
            "body": "There's a wide range of expectations on both sides, but I tend to agree that the Reddit SDs often create a lot of negative energy. I'm not quite sure why tbh. Maybe they're super entitled because of their money or women with low self esteem (or perhaps just naive) have allowed them to become this way... Rich in the bank, but poor in matters of the heart.\n\nSpeaking from my perspective, SDs have a responsibility to be a provider and that means both emotional and monetary. This is what our experience and financial privilege affords us. Even if you're having a bad day, your struggles are microscopic compared to the struggles of a young SB trying to improve her life and reach her life goals.\n\nIt's quite sad to see SDs use their experience to take advantage rather than truly uplift their SBs as partners. This toxic behavior is what causes so many people to become jaded and disillusioned...\n\nFinal words: There's jaded, broke, lonely, and burned out people on both sides. Empathy and compassion will go a long way in finding a successful SR in 2021.",
            "author": "415proton",
            "id": "hia2qow",
            "parent_id": "t3_qh1lle",
            "score": 56,
            "created_utc": 1635359776.0,
            "replies": [
                {
                    "body": "This should be one of the top comments.",
                    "author": "SerendipityX8",
                    "id": "hia9fai",
                    "parent_id": "t1_hia2qow",
                    "score": 14,
                    "created_utc": 1635362384.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I have enjoyed the company of many wonderful women who make their living as escorts.  It's a tough job and they deserve all the respect society affords other care-givers!  If I met one on SA and we clicked...I would be a regular customer for sure, or her SD.  Doesn't matter to me.",
            "author": "sdphilly",
            "id": "hia26dp",
            "parent_id": "t3_qh1lle",
            "score": 16,
            "created_utc": 1635359558.0,
            "replies": []
        },
        {
            "body": "Looks like this is the 200th iteration of \"Why are SDs so two faced/delusional/hypocritical.\"\n\n&#x200B;\n\nNot just SDs, but SBs and all humans tend to be self-serving, hypocritical, and delusional. I get that it is frustrating and difficult to find someone online that cares for *your* well-being and takes *your* best interests to heart before their own. \n\n&#x200B;\n\nIt's the same experience for SDs. We have a hard time finding generous women who will be affectionate, loving, and kind before asking for the moolah.\n\n&#x200B;\n\nEscorting imho is far less expensive than sugar-dating, both financially and emotionally. YMMV and it depends if you are looking for 'standard' escorts (who are largely high-volume providers) around three benjamins per hour or if you are going after the top 0.001% escorts who can be ten+ benjamins per hour.\n\nA sugar-baby, on the other hand, takes care, attention, thoughtfulness, as well as ongoing financial support. They are two completely different ways of pay-for-play and I believe those who prefer sugar-babies are those who *want* all the extra stuff -- that you cannot get from emotionally unavailable escorts.\n\n&#x200B;\n\nI think you'd understand a little more if you could see both sides of the equation. Many SDs are torn between their love of youthful women and their thriftiness (a trait that inherently increases your chances of ever becoming wealthy enough to be a SD). Now there are of course exceptions, and once you reach a certain amount of money most people relax their purse strings. But take a look at Warren Buffett. Stingy as fuck! This guy is a multi-billionaire and last I checked he still eats at McDs for breakfast, has no chauffeur, and considers the house he bought 50+ years ago to be his most reckless and wasteful purchase ever.\n\n&#x200B;\n\nWealth does not equate to generosity. You can find a middle-class SD willing to go broke to sustain a SR for several years, and you can find a whale who doesn't want to spend a dime over what's necessary to string you along.",
            "author": "stupid_smart_ape",
            "id": "hia5cnj",
            "parent_id": "t3_qh1lle",
            "score": 19,
            "created_utc": 1635360788.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "hi9woa0",
            "parent_id": "t3_qh1lle",
            "score": 23,
            "created_utc": 1635357436.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "hia8y3g",
                    "parent_id": "t1_hi9woa0",
                    "score": 6,
                    "created_utc": 1635362198.0,
                    "replies": [
                        {
                            "body": "Yes, i said that already in my comment. Im not disagreeing with you. 🤷🏻‍♀️",
                            "author": "LaIndiaDeAzucar",
                            "id": "hia93s2",
                            "parent_id": "t1_hia8y3g",
                            "score": 6,
                            "created_utc": 1635362260.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "PPM amounts are more about the desirability of the SD than the SB. Less attractive men pay more.\n\nMost Reddit posters are complete studs, so we pay far, far less than old fat guys.",
                    "author": "Substantial-Rice-330",
                    "id": "hia4rz3",
                    "parent_id": "t1_hi9woa0",
                    "score": -7,
                    "created_utc": 1635360569.0,
                    "replies": [
                        {
                            "body": "Not in my case. I ask for the same amount regardless of age and looks. They are looking to be SDs, they should be able to meet the standards 🤷🏻‍♀️",
                            "author": "LaIndiaDeAzucar",
                            "id": "hiaw2i1",
                            "parent_id": "t1_hia4rz3",
                            "score": 14,
                            "created_utc": 1635371142.0,
                            "replies": []
                        },
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "hiabkde",
                            "parent_id": "t1_hia4rz3",
                            "score": 13,
                            "created_utc": 1635363204.0,
                            "replies": [
                                {
                                    "body": "Average Reddit user is also up 7 figures on meme stocks and crypto since 2019. Always makes me feel bad when these guys talk about how rich they are.",
                                    "author": "Substantial-Rice-330",
                                    "id": "hiadotw",
                                    "parent_id": "t1_hiabkde",
                                    "score": 2,
                                    "created_utc": 1635364021.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "Not true in my experience",
                            "author": "lipstickdiet",
                            "id": "hia7s89",
                            "parent_id": "t1_hia4rz3",
                            "score": 7,
                            "created_utc": 1635361743.0,
                            "replies": [
                                {
                                    "body": "The part about Reddit users being studs? That was a joke.\n\nBut in general, younger, better looking guys can get away with more. And men tolerate more bullshit from better looking females.\n\nJust human nature.",
                                    "author": "Substantial-Rice-330",
                                    "id": "hiad9za",
                                    "parent_id": "t1_hia7s89",
                                    "score": -2,
                                    "created_utc": 1635363863.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "You mean more generous men GIVE more.",
                            "author": null,
                            "id": "hiaw1as",
                            "parent_id": "t1_hia4rz3",
                            "score": 4,
                            "created_utc": 1635371128.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I actually think you're right I mean people, humans have a tendency to cherry pick what suits them and they don't like any truth that contradicts that.\n\nLet's be honest, for SDs it's about looks, sexual compatibility and THEN personality but let's face it looks mainly and sexual compability in the respect of is she willing to do what you want.\n\nEqually, no SB would be dating a SD if it wasn't for the allowance/ money/ gifts otherwise why the hell would she not just date him?\n\nLet's not kid ourselves.  I don't know why any dude would get angry at the thought of men buying women they don't know gifts, that seems strange. Maybe you wouldn't do it, but lots of us wouldn't do lots of things. Just don't do it yourself and live and let live.  However, it's important to remember that gifting without meeting is rare, most guys want sex, in person.\n\nAs for paid M&G, same again, except this does involve the sugar babies time and she is the one without the wealth. I think some form of compensation, travel expense, dinner paid for at least is fair. And again, if some sugar babies want to be paid for M&G, that's their right, especially if we're gonna say, it's sugar daddy's right to meet a girl, then say \"oh I didn't like her in person.\" That's his right, we wouldn't argue it, so as long as SBs make it clear that DO expect to be paid for the M&G no SD should be getting angry at this. Just don't do it if you personally don't want to. Seems there is a double standard here but what's good for one and all.",
            "author": "generalmunks",
            "id": "hi9xkn1",
            "parent_id": "t3_qh1lle",
            "score": 11,
            "created_utc": 1635357785.0,
            "replies": []
        },
        {
            "body": "There is a whole lot to unpack in this rambling mess.  There is a website called WYP that if appropriate for girls that want to be compensated for vanilla dates or meet and greets.  That’s a more appropriate place for some young ladies and some ladies are on both sites.  SA has customs that have changed over time as rinsing because more common.  The behavior of the girls facilitated that change,  not the SD’s.  For every action there is a reaction and many of the customs you don’t like are due to behavior by the SB’s.  If you have a full month allowance on first or second meeting they would disappear or become incredibly busy until the first of the month.  It’s human behavior and it’s why most employers pay weekly or biweekly… it would be less expensive and move convenient for all companies to pay once a month,  but human nature makes that impossible. \n\nHuman nature has caused early arrangement to be a bit more Transactional than we would all like.  That changes over time as both people bulld trust.  \n\nI don’t care what other men do but I think it’s foolish to send money to anyone you have not met face to face… just as I would tell a SB not to put a bunch or energy or send nudes to a person you have not received anything from or met in person.  There are a boat load of scammers on both sides.  Why would a girl meet anybody if she could get dozens of men sending her “a few hundred dollars” to get ready for a meet and greet.  Now for a second date after you have met,  that’s a guys judgement call.  \n\nEscorts are much less expensive than sugar baby’s in my area (SF).  Obviously it’s a much different experience but it is 50-60% less than a weekly allowance.  Also zero time commitment or communication.  \n\nFinancially,  if a guy can afford an extra fifteen to two grand then he can be a legit sugar daddy in the right situation.  That can cover rent and a budget car payment or a chunk of tuition in most areas.  Does a guy need to be really wealthy to spend that kind of excess cash?  I don’t think so.  \n\nI have been at this thirteen years,  dozens of SB’s,  hundreds of m&g’s,  7 figures plus in allowance… been through damn near every situation I can imagine including a SB dying,  a POT killing someone else,  and everything in between… I love it when an early 20’s girl that’s been doing this for 47 days is trying to tell me what a “real SD” is.   You have no clue how deep and amazing these relationships can be if you let them.  I hope someday you do.",
            "author": "LotBuilder",
            "id": "hiammrn",
            "parent_id": "t3_qh1lle",
            "score": 14,
            "created_utc": 1635367415.0,
            "replies": [
                {
                    "body": "Did you read my post or did you just focus on the parts where you might have yo pay money to have a sugar baby",
                    "author": "kikienen",
                    "id": "hiaqlrd",
                    "parent_id": "t1_hiammrn",
                    "score": -8,
                    "created_utc": 1635368960.0,
                    "replies": [
                        {
                            "body": "Solid response for when you can't counter a single point he made in his comment.  Dodge, duck, dip, dive, and dodge!",
                            "author": "storm170",
                            "id": "hiauqf2",
                            "parent_id": "t1_hiaqlrd",
                            "score": 17,
                            "created_utc": 1635370604.0,
                            "replies": [
                                {
                                    "body": "I can but I’ve got better things to do, it’s happy hour ☺️",
                                    "author": "kikienen",
                                    "id": "hiaw6gf",
                                    "parent_id": "t1_hiauqf2",
                                    "score": -4,
                                    "created_utc": 1635371185.0,
                                    "replies": [
                                        {
                                            "body": "Sure sure, we definitely believe you.",
                                            "author": "storm170",
                                            "id": "hiaw8pa",
                                            "parent_id": "t1_hiaw6gf",
                                            "score": 8,
                                            "created_utc": 1635371211.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "I read your post and clearly I have no issue being generous even when it is not immediately tied to intimacy… but at the same time you can’t be easy lick on the front end.",
                            "author": "LotBuilder",
                            "id": "hiau5y3",
                            "parent_id": "t1_hiaqlrd",
                            "score": 6,
                            "created_utc": 1635370378.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "> I’m in a sugar relationship already and always looking out for something better\n\nSounds like a shitty way to live life - but if it is what works for you - best of luck.",
            "author": "SDstartingOut",
            "id": "hiard1d",
            "parent_id": "t3_qh1lle",
            "score": 9,
            "created_utc": 1635369263.0,
            "replies": []
        },
        {
            "body": "You sound burnt out OP.  By your own admission, sugar dating is energy draining and miserable. I recommend that you stop doing it.",
            "author": "TastySpermDispenser",
            "id": "hi9rose",
            "parent_id": "t3_qh1lle",
            "score": 21,
            "created_utc": 1635355510.0,
            "replies": [
                {
                    "body": "I never said that but thanks for letting me know you read at an 8th grade level",
                    "author": "kikienen",
                    "id": "hi9th32",
                    "parent_id": "t1_hi9rose",
                    "score": 0,
                    "created_utc": 1635356214.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "hi9vy08",
                            "parent_id": "t1_hi9th32",
                            "score": -1,
                            "created_utc": 1635357157.0,
                            "replies": [
                                {
                                    "body": "He’s trying to mansplain my emotions to me Lmaooo",
                                    "author": "kikienen",
                                    "id": "hi9x4oo",
                                    "parent_id": "t1_hi9vy08",
                                    "score": 6,
                                    "created_utc": 1635357612.0,
                                    "replies": [
                                        {
                                            "body": "Tell me you came here to argue without telling me that you came here to argue.",
                                            "author": "Usedtobesb",
                                            "id": "hi9yjre",
                                            "parent_id": "t1_hi9x4oo",
                                            "score": 8,
                                            "created_utc": 1635358163.0,
                                            "replies": [
                                                {
                                                    "body": "I’m in no way denying that, last time I checked that’s what Reddit is used for mostly",
                                                    "author": "kikienen",
                                                    "id": "hi9zos9",
                                                    "parent_id": "t1_hi9yjre",
                                                    "score": 5,
                                                    "created_utc": 1635358603.0,
                                                    "replies": [
                                                        {
                                                            "body": "I mean I guess I can’t disagree with that. But Tasty might be on point by suggesting that you take a step back. Obviously someone hurt you and you’re here to vent. But it’s crazy to get big mad at the people who offered helpful advice and who btw, weren’t the ones who hurt you.",
                                                            "author": "Usedtobesb",
                                                            "id": "hia060v",
                                                            "parent_id": "t1_hi9zos9",
                                                            "score": 11,
                                                            "created_utc": 1635358788.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Hold up, you mean she shouldn't be screaming into the abyss that is Reddit about something that none of us did or even generally subscribe to?\n\nThat sounds entirely too....mentally healthy.",
                                                                    "author": "storm170",
                                                                    "id": "hia269v",
                                                                    "parent_id": "t1_hia060v",
                                                                    "score": 8,
                                                                    "created_utc": 1635359557.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "Perhaps she cannot afford a therapist 🤷🏻‍♀️",
                                                                            "author": "Usedtobesb",
                                                                            "id": "hia495j",
                                                                            "parent_id": "t1_hia269v",
                                                                            "score": 8,
                                                                            "created_utc": 1635360362.0,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "body": "> weren't the ones who hurt you\n\nShe can't hurt the actual people who did this to her though. \n\nAnd how else is she supposed to process her emotions? Not like you can expect her to be an adult or something.",
                                                                    "author": "KPackCorey",
                                                                    "id": "hia1sba",
                                                                    "parent_id": "t1_hia060v",
                                                                    "score": 1,
                                                                    "created_utc": 1635359406.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "Well don’t give her any ideas 😬🤣",
                                                                            "author": "Usedtobesb",
                                                                            "id": "hia4fud",
                                                                            "parent_id": "t1_hia1sba",
                                                                            "score": 6,
                                                                            "created_utc": 1635360436.0,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "hia5p14",
            "parent_id": "t3_qh1lle",
            "score": 18,
            "created_utc": 1635360922.0,
            "replies": [
                {
                    "body": "Thank you.  I came to write what you basically just did.\n\nThankyou for saving me a job",
                    "author": "HecatesCats",
                    "id": "hiaxezm",
                    "parent_id": "t1_hia5p14",
                    "score": 7,
                    "created_utc": 1635371693.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I am sure all the SDs will be lining up for you. You sound like a real treat to the mind and senses.",
            "author": "JDiGi7730",
            "id": "hiadcmw",
            "parent_id": "t3_qh1lle",
            "score": 8,
            "created_utc": 1635363890.0,
            "replies": [
                {
                    "body": "But the gag is, I am a treat. I’m not interested in men who aren’t willing to open they’re pockets so it’s a win-win",
                    "author": "kikienen",
                    "id": "hiadvdj",
                    "parent_id": "t1_hiadcmw",
                    "score": -6,
                    "created_utc": 1635364091.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Life ain’t fair and sugar dating is governed by the same economics as capitalism. Some of your comment is classic Rinser scam tactics. You can cry all you want about the affects an increase in the supply of sugar babies, relative to sugar daddies, has on sugar dating but you won’t get the SB Union you want for collective bargaining. I think most sugar daddies will be happy to see people like you leave the lifestyle. Just one less profile I have to block on SA when I am done with my current SR.",
            "author": null,
            "id": "hi9tw4z",
            "parent_id": "t3_qh1lle",
            "score": 11,
            "created_utc": 1635356377.0,
            "replies": [
                {
                    "body": "Of course ‘sugar daddies’ like you would love to see less of the likes of me, nothing new sweetie 💀",
                    "author": "kikienen",
                    "id": "hi9uv5n",
                    "parent_id": "t1_hi9tw4z",
                    "score": -3,
                    "created_utc": 1635356749.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "From this and the OP's reference to the previous post, what I see here is a clear lack of communication between parties on expectations. \n\nI agree with u/TastySpermDispenser when he says burn out. It's exhausting sometimes on both side, especially in what I call the \"Hunt\" or the \"Seeking\" phase. Take a break, let the bowl simmer a bit, then dive back in. \n\nAnd as for M&G, I never shell out up from for them, sometimes after, but for the same reason I don't pay for Hair Cuts until their done.",
            "author": "LifeIsShortImNot",
            "id": "hi9tdwv",
            "parent_id": "t3_qh1lle",
            "score": 7,
            "created_utc": 1635356180.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "hia39lb",
            "parent_id": "t3_qh1lle",
            "score": 6,
            "created_utc": 1635359979.0,
            "replies": [
                {
                    "body": "She does invest her own time. She gets ready, arranges her schedule to be there, travels, and spends an hour convincing the POT that they have a connection.",
                    "author": "anxietyvibes",
                    "id": "hia6k9s",
                    "parent_id": "t1_hia39lb",
                    "score": -2,
                    "created_utc": 1635361262.0,
                    "replies": [
                        {
                            "body": "All of which the SD does as well, while also giving up that time where he could be potentially making significant amounts of money compared to what the SB could have made during those same hours.  They both are investing the same effort, which is the very definition of mutually beneficial, so requiring a gift on top of that just shows that the SB is starting the relationship off slanted towards her own interests.",
                            "author": "storm170",
                            "id": "hia9xhn",
                            "parent_id": "t1_hia6k9s",
                            "score": 8,
                            "created_utc": 1635362578.0,
                            "replies": [
                                {
                                    "body": "SB could be making money during that time too. SD wants her company, SB wants money. SB is providing on her end, I think it’s a good sign when SD is providing on his end from the first M&G too. I don’t require a gift on the first M&G because it would turn off men who have this idea that they’ll be rinsed or whatever, but a lot of men provide a gift regardless and it definitely shows me they’re serious and they appreciate my time.",
                                    "author": "anxietyvibes",
                                    "id": "hiac2q7",
                                    "parent_id": "t1_hia9xhn",
                                    "score": 3,
                                    "created_utc": 1635363401.0,
                                    "replies": [
                                        {
                                            "body": "[deleted]",
                                            "author": null,
                                            "id": "hiajtjo",
                                            "parent_id": "t1_hiac2q7",
                                            "score": 3,
                                            "created_utc": 1635366355.0,
                                            "replies": [
                                                {
                                                    "body": "Yeah of course he wants more than company, he wants sex too, but he also wants company or he’d go on a date with an escort instead, right? That’s the logic I see SDs on here using. Regardless of a future arrangement, the SD gets a date with a beautiful young woman. This is something I doubt he’d be doing otherwise, because most men aren’t going to pay for an arrangement when they could get it for free. What does the SB get?",
                                                    "author": "anxietyvibes",
                                                    "id": "hiakryy",
                                                    "parent_id": "t1_hiajtjo",
                                                    "score": 3,
                                                    "created_utc": 1635366714.0,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "body": "I always provide a gift, as do the majority of the SDs on this forum.  We simply don't meet with SBs that charge a fee for a M&G (requiring it makes it not a gift).  You are welcome to discriminate against POTs that don't provide something at the M&G if you want, that's not what the OP is whining about or implying by the comment she has since edited from her post.\n\nAnd of course SBs could be making money during that time too, SDs just have a far greater opportunity to make more based on them being a SD in the first place.",
                                            "author": "storm170",
                                            "id": "hiacx47",
                                            "parent_id": "t1_hiac2q7",
                                            "score": 2,
                                            "created_utc": 1635363726.0,
                                            "replies": [
                                                {
                                                    "body": "All I was saying was that SBs do invests their time in the meet. 🤷‍♀️",
                                                    "author": "anxietyvibes",
                                                    "id": "hiad557",
                                                    "parent_id": "t1_hiacx47",
                                                    "score": 5,
                                                    "created_utc": 1635363811.0,
                                                    "replies": [
                                                        {
                                                            "body": "Your original comment says that SBs do not invest their own time in a M&G.  Did you mean to end your first sentence with a ?",
                                                            "author": "storm170",
                                                            "id": "hiadgxc",
                                                            "parent_id": "t1_hiad557",
                                                            "score": 4,
                                                            "created_utc": 1635363937.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Oops lol. I just realized that. That makes a big difference my bad.",
                                                                    "author": "anxietyvibes",
                                                                    "id": "hiadvdb",
                                                                    "parent_id": "t1_hiadgxc",
                                                                    "score": 1,
                                                                    "created_utc": 1635364091.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "body": "[deleted]",
                                                            "author": null,
                                                            "id": "hiafqyd",
                                                            "parent_id": "t1_hiad557",
                                                            "score": 1,
                                                            "created_utc": 1635364810.0,
                                                            "replies": [
                                                                {
                                                                    "body": "What does the SD really have to lose though? If what he wants is the company of a beautiful young woman, is that not what he’s getting?",
                                                                    "author": "anxietyvibes",
                                                                    "id": "hiajrvk",
                                                                    "parent_id": "t1_hiafqyd",
                                                                    "score": 4,
                                                                    "created_utc": 1635366337.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "Do you really think that anyone is paying a pot SB simply for the benefit of meeting up for a few drinks?\n\nThat is delusional.\n\nAs a divorced man I have plenty of hot young women who I know as platonic friends that I spend time in the company of.  I'm not interested in more friends.",
                                                                            "author": "HecatesCats",
                                                                            "id": "hiay33j",
                                                                            "parent_id": "t1_hiajrvk",
                                                                            "score": 6,
                                                                            "created_utc": 1635371971.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "Do you really think nobody is?.. I think that because I’ve experienced it.. If that’s not the case for you then you’re the exception. I’m not saying every single SD has to pay for the company of a younger woman, some do it for other reasons, but 90% do. Most SDs wouldn’t be in the company of a young beautiful woman who is interested in him otherwise. So yes, they’ll compensate a SB just for her time and attention. I’m not saying they’re paying 1k for dinner and drinks. Or that they’re paying a full allowance for a M&G. Or that they’re having arrangements with no intimacy. But there are SDs who are compensating SBs for M&Gs. Don’t let this forum fool you. 🤷‍♀️",
                                                                                    "author": "anxietyvibes",
                                                                                    "id": "hiaymqs",
                                                                                    "parent_id": "t1_hiay33j",
                                                                                    "score": 5,
                                                                                    "created_utc": 1635372197.0,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "body": "[deleted]",
                                            "author": null,
                                            "id": "hiafhdb",
                                            "parent_id": "t1_hiac2q7",
                                            "score": -1,
                                            "created_utc": 1635364709.0,
                                            "replies": [
                                                {
                                                    "body": "My comment was in reference to u/storm170 saying the SD could be making money during that time.",
                                                    "author": "anxietyvibes",
                                                    "id": "hiajj6x",
                                                    "parent_id": "t1_hiafhdb",
                                                    "score": 1,
                                                    "created_utc": 1635366246.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "hiaj9mp",
                            "parent_id": "t1_hia6k9s",
                            "score": 0,
                            "created_utc": 1635366145.0,
                            "replies": [
                                {
                                    "body": "It's such a simple concept, but some people love to toss the concept of a mutually beneficial relationship out the window when it comes to them having to put in equal effort.  And then cry about someone trying to take advantage of them for that expectation.",
                                    "author": "storm170",
                                    "id": "hiavtu6",
                                    "parent_id": "t1_hiaj9mp",
                                    "score": 1,
                                    "created_utc": 1635371045.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Maybe I'm different than most, but I'm seriously confused about sugar being cheaper than hiring escorts... \n\nI don't like the idea of escorts, because I don't particularly enjoy sex without some type of connection (it's just easier to use toys at that point), however I've looked at ads before out of sheer curiosity and just because it was something a friend and I used to do for entertainment after a few drinks.\n\nI'm pretty sure that paying an escort occasionally to get your rocks off would involve quite a bit less on the financial side than actually having a decent sugar relationship.   I usually prefer PPM, based on the fact that I travel a lot and the regularity of get-togethers is quite varying, however I also consider myself pretty generous and like to take care of someone that I'm in a relationship with.   I don't imagine many people are communicating with, or sending escorts gifts between seeing them.  \n\nFor me, that's just all part of having a really good relationship.  I want my SB to know how I feel about them, and feel like she's being taken care of.  \n\nDon't get me wrong, I have nothing against any kind of sex worker -- I have friends that are sex-workers, it's just not something that interests me.",
            "author": "spoilyou255",
            "id": "hi9zqgk",
            "parent_id": "t3_qh1lle",
            "score": 4,
            "created_utc": 1635358622.0,
            "replies": [
                {
                    "body": "You're talking about a more nebulous sort of value - gifts and communication and feeling taken care of. Which is value, but it's not what OP means. \n\nIf you calculated the amount of time you spend with a SB and compare that to the hourly rate of escorts, generally speaking SBs are making far less. Your PPM may be really high and your dates are short, and the escorts in the area are very inexpensive. But as a general matter on a per-house basis SBs tend to make far less.",
                    "author": "MASugarBaby",
                    "id": "hia0fxl",
                    "parent_id": "t1_hi9zqgk",
                    "score": 14,
                    "created_utc": 1635358891.0,
                    "replies": [
                        {
                            "body": "I guess you have a point.  If I look at it from an hourly point of view, then maybe an escort would be more expensive... but I highly doubt many escorts would be interested in a long night out... or a few hours of deep/intelligent conversation!",
                            "author": "spoilyou255",
                            "id": "hia1hkk",
                            "parent_id": "t1_hia0fxl",
                            "score": -4,
                            "created_utc": 1635359293.0,
                            "replies": [
                                {
                                    "body": "If they're getting their hourly rate, of course they would be interested. They would probably love hanging out and chatting vs only having sex.",
                                    "author": "MASugarBaby",
                                    "id": "hia1lxi",
                                    "parent_id": "t1_hia1hkk",
                                    "score": 10,
                                    "created_utc": 1635359340.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Escorts are much cheaper than SB's. And honestly, attractive girls don't complain like this.",
                    "author": "Substantial-Rice-330",
                    "id": "hia1141",
                    "parent_id": "t1_hi9zqgk",
                    "score": 0,
                    "created_utc": 1635359117.0,
                    "replies": [
                        {
                            "body": "Well I’m an attractive girl and I’m complaining so where do we go from there? Also escorts make wayyy more, don’t be naive",
                            "author": "kikienen",
                            "id": "hia2kyb",
                            "parent_id": "t1_hia1141",
                            "score": 9,
                            "created_utc": 1635359715.0,
                            "replies": [
                                {
                                    "body": "I didn't say (some) escorts didn't make more. I said escorts were cheaper than sugar babies from the client perspective. You got all sorts of extraneous costs with sugar babies such as dinners and whatnot. You have to see them more often.\n\nIt's not really cheaper.\n\nI don't understand why you're complaining though, it's not going to make anyone pay you more money.",
                                    "author": "Substantial-Rice-330",
                                    "id": "hia33hp",
                                    "parent_id": "t1_hia2kyb",
                                    "score": 7,
                                    "created_utc": 1635359914.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Escorts do nothing for me. They watch the clock and make you wear a condom. No thanks.",
                    "author": "UnearthlyDinosaur",
                    "id": "hia2ub5",
                    "parent_id": "t1_hi9zqgk",
                    "score": -6,
                    "created_utc": 1635359815.0,
                    "replies": [
                        {
                            "body": "Sugar babies do both these things.",
                            "author": "Substantial-Rice-330",
                            "id": "hia3ycx",
                            "parent_id": "t1_hia2ub5",
                            "score": -4,
                            "created_utc": 1635360246.0,
                            "replies": [
                                {
                                    "body": "I’ve never had an SB watch the clock. And a majority don’t want me to use a condom.",
                                    "author": "UnearthlyDinosaur",
                                    "id": "hiav2z9",
                                    "parent_id": "t1_hia3ycx",
                                    "score": -2,
                                    "created_utc": 1635370745.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "\"you claim to be secure in your masculinity but convulse at another man buying gifts on SA\"\n\nIn other words \"man up and do what I want\".  \n\nGive me a break.  You don't get to define manhood.\n\nSounds like you get walked all over and then piss and moan about it to strangers on Reddit.  Plenty of SBs are happy and getting what they want.",
            "author": null,
            "id": "hi9re3v",
            "parent_id": "t3_qh1lle",
            "score": 8,
            "created_utc": 1635355393.0,
            "replies": [
                {
                    "body": "‘Plenty of SBs are happy and getting what they want.’\nThis is a weird and groomy take",
                    "author": "kikienen",
                    "id": "hi9vp7t",
                    "parent_id": "t1_hi9re3v",
                    "score": 1,
                    "created_utc": 1635357064.0,
                    "replies": [
                        {
                            "body": "Nah it's matter of fact.  \n\nYou're deluded and projecting your own shit onto people.",
                            "author": null,
                            "id": "hi9yrg9",
                            "parent_id": "t1_hi9vp7t",
                            "score": 4,
                            "created_utc": 1635358245.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I hate stingy men as much as the next girl but this post is so off base. This is Reddit, deal with it 👏🏼👏🏼",
            "author": "Usedtobesb",
            "id": "hi9vko7",
            "parent_id": "t3_qh1lle",
            "score": 6,
            "created_utc": 1635357017.0,
            "replies": [
                {
                    "body": "Offbase how? Do you not encounter countless men in middle management or making a meager salary that wants something to be “real” and “non transactional” but still doesn’t have any emotional availability or anything to offer outside of hard dick and small gifts? Lol",
                    "author": "fruters",
                    "id": "hi9vxez",
                    "parent_id": "t1_hi9vko7",
                    "score": 6,
                    "created_utc": 1635357151.0,
                    "replies": [
                        {
                            "body": "Literally never. But I know how to read a room. IYKYK. Clearly you do not.",
                            "author": "Usedtobesb",
                            "id": "hi9wtzr",
                            "parent_id": "t1_hi9vxez",
                            "score": 2,
                            "created_utc": 1635357497.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "OP everything in this is post is so spot on and true. These are my thoughts exactly. The truth hurts the most so the comments are coming from crushed egos. Unfortunately a lot of amazing women don’t realise their worth and the bar is so freaking low for the so called SDs, it’s almost like we must be grateful he’s not a scammer and accept the lower than minimum allowance.",
            "author": "whatifitdoescometrue",
            "id": "hi9vr3w",
            "parent_id": "t3_qh1lle",
            "score": 7,
            "created_utc": 1635357084.0,
            "replies": []
        },
        {
            "body": "It's mostly just a bunch of hobbyists engaging in ego saving group think.  Their \"advice\" is non-sensical and could be summed up in do the most for the least or you're an escort.\n\nIf your \"SD\" is only doing market rate pay for play, you have a stingy client full stop.",
            "author": "NewOperation6666",
            "id": "hi9v3s2",
            "parent_id": "t3_qh1lle",
            "score": 7,
            "created_utc": 1635356842.0,
            "replies": [
                {
                    "body": "Exactly they keep doling out minimal effort but expect a 5-star performance from sugar babies because they’ve been led to think that we’re somewhat desperate",
                    "author": "kikienen",
                    "id": "hi9vh63",
                    "parent_id": "t1_hi9v3s2",
                    "score": 18,
                    "created_utc": 1635356980.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "hi9yc5q",
            "parent_id": "t3_qh1lle",
            "score": 3,
            "created_utc": 1635358080.0,
            "replies": []
        },
        {
            "body": "How do y'all find the same argument every other day entertaining or productive? Can't you just like tape a laser pointer to a roomba and occupy yourself with that all day",
            "author": "KPackCorey",
            "id": "hi9z4gd",
            "parent_id": "t3_qh1lle",
            "score": 5,
            "created_utc": 1635358386.0,
            "replies": [
                {
                    "body": "Yet here you are, commenting. I’m sure you have more productive things to do than to  complain about an unproductive post",
                    "author": "kikienen",
                    "id": "hi9zfl3",
                    "parent_id": "t1_hi9z4gd",
                    "score": 6,
                    "created_utc": 1635358505.0,
                    "replies": [
                        {
                            "body": "My roomba is charging :/",
                            "author": "KPackCorey",
                            "id": "hia0di7",
                            "parent_id": "t1_hi9zfl3",
                            "score": 5,
                            "created_utc": 1635358866.0,
                            "replies": [
                                {
                                    "body": "And I got bored watching my paint dry so 🤷🏽‍♀️",
                                    "author": "kikienen",
                                    "id": "hia2b4q",
                                    "parent_id": "t1_hia0di7",
                                    "score": 6,
                                    "created_utc": 1635359610.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "hiatbrm",
            "parent_id": "t3_qh1lle",
            "score": 2,
            "created_utc": 1635370042.0,
            "replies": [
                {
                    "body": "Do you call men with More than one SB Johns? And didn’t you read my post, calling me an escort doesn’t phase me, and it never will",
                    "author": "kikienen",
                    "id": "hiatn4n",
                    "parent_id": "t1_hiatbrm",
                    "score": -1,
                    "created_utc": 1635370167.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "hiau5qs",
                            "parent_id": "t1_hiatn4n",
                            "score": 2,
                            "created_utc": 1635370375.0,
                            "replies": [
                                {
                                    "body": "Based on her interactions today, I am comfortable saying she cannot.",
                                    "author": "storm170",
                                    "id": "hiawn4j",
                                    "parent_id": "t1_hiau5qs",
                                    "score": 3,
                                    "created_utc": 1635371377.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "It's unfortunate that you have struggled being a SB and can't find SDs you find attractive and enjoy spending time with.  How do I know this?  Successful SBs don't make posts like this one, or your previous post, where they whine and complain.\n\nNot bitter?  You are an entire lemon grove.",
            "author": "storm170",
            "id": "hi9w1qq",
            "parent_id": "t3_qh1lle",
            "score": 3,
            "created_utc": 1635357197.0,
            "replies": [
                {
                    "body": "‘Successful sugar babies’ are ones who don’t settle for nonsense. And I find my sugar daddy very attractive, thank you for being worried about me though ❤️",
                    "author": "kikienen",
                    "id": "hi9xr05",
                    "parent_id": "t1_hi9w1qq",
                    "score": 6,
                    "created_utc": 1635357853.0,
                    "replies": [
                        {
                            "body": "Sure sure, we definitely believe you.",
                            "author": "storm170",
                            "id": "hi9xto9",
                            "parent_id": "t1_hi9xr05",
                            "score": 2,
                            "created_utc": 1635357882.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Also I successful sugar daddies don’t have the time to be squabbling on the internet, they’re too busy making millions 😌",
                    "author": "kikienen",
                    "id": "hi9xwj5",
                    "parent_id": "t1_hi9w1qq",
                    "score": 5,
                    "created_utc": 1635357912.0,
                    "replies": [
                        {
                            "body": "You just love to say things that are incorrect don't you?  Successful SDs have plenty of time to do whatever they want, including providing free education to you on the internet, because we have already made millions.  You'll catch on sooner or later.",
                            "author": "storm170",
                            "id": "hi9y55h",
                            "parent_id": "t1_hi9xwj5",
                            "score": 3,
                            "created_utc": 1635358005.0,
                            "replies": []
                        },
                        {
                            "body": "Successful people have a lot of free time usually ( i have a few friends above 40 million net worth each ) \n\nThey spend more time on social media than you can imagine ,, return texts in 5 minutes 90% of the time,, \n\nWhy would anybody think successful people don't have a lot of free time ??   We make time ,, we make our own schedules mostly ,,",
                            "author": "shamloo77",
                            "id": "hiafmua",
                            "parent_id": "t1_hi9xwj5",
                            "score": 3,
                            "created_utc": 1635364766.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "This was pure comedy.  Well done op for such an amusing post.",
            "author": "wb19081908",
            "id": "hiaiyjz",
            "parent_id": "t3_qh1lle",
            "score": 1,
            "created_utc": 1635366029.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "hi9t0ze",
            "parent_id": "t3_qh1lle",
            "score": 2,
            "created_utc": 1635356039.0,
            "replies": [
                {
                    "body": "Budge up😁",
                    "author": "DBeleven",
                    "id": "hi9txyz",
                    "parent_id": "t1_hi9t0ze",
                    "score": 0,
                    "created_utc": 1635356397.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "100% true to everything. The men on here truly are delusional; they find any way possible to convince themselves escorts get paid less. I’ve done both (even though sugaring is basically escorting with GFE usually) and I know how I made more in less time. And they don’t want to believe it’s transnational. Like the young woman you’re paying would be there if it wasn’t for money. Smh.",
            "author": "anxietyvibes",
            "id": "hia7p77",
            "parent_id": "t3_qh1lle",
            "score": 2,
            "created_utc": 1635361710.0,
            "replies": []
        },
        {
            "body": "👏🏼👏🏼👏🏼👏🏼👏🏼\n\nJust here to read the salty comments spewing everywhere 🍿🧂🍿🧂🍿🧂🍿🧂",
            "author": "SerendipityX8",
            "id": "hiaah8n",
            "parent_id": "t3_qh1lle",
            "score": 1,
            "created_utc": 1635362790.0,
            "replies": []
        },
        {
            "body": "I’m finding SDs on SA to be more delusional and leaning cheap john not SD.\n\nThe general tone I’m getting here is if it doesn’t serve you move on- to both SDs and SBs, maybe not as politely but this is Reddit. I haven’t seen any SB encouraged to “give up sugar to a man that sees them as a walking sex doll”\n\nLike you said you don’t tolerate it but the people who post are either trolling or tolerating it and making themselves miserable, they might need the Reddit reality check",
            "author": "cozycomfycool",
            "id": "hia0lca",
            "parent_id": "t3_qh1lle",
            "score": 1,
            "created_utc": 1635358949.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "hiaholu",
            "parent_id": "t3_qh1lle",
            "score": -1,
            "created_utc": 1635365545.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "hiaitsq",
                    "parent_id": "t1_hiaholu",
                    "score": 7,
                    "created_utc": 1635365979.0,
                    "replies": [
                        {
                            "body": "You are thinking what i am thinking now ??🤔",
                            "author": "shamloo77",
                            "id": "hiajopm",
                            "parent_id": "t1_hiaitsq",
                            "score": 6,
                            "created_utc": 1635366304.0,
                            "replies": []
                        },
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "hiak9ox",
                            "parent_id": "t1_hiaitsq",
                            "score": -3,
                            "created_utc": 1635366522.0,
                            "replies": [
                                {
                                    "body": "It's about time you realized that what you were doing isn't sugaring.  UseRound, what the hell are you talking about \"trying freestyling with your wife?\"  When did she become a freak?  I'm confused because if your wife is into couples, why didn't you talk to her about sugaring earlier? I think you are in self-destruct mode.",
                                    "author": "Darknlovely38",
                                    "id": "hiazm0u",
                                    "parent_id": "t1_hiak9ox",
                                    "score": 7,
                                    "created_utc": 1635372607.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "The truth is, you’ve never been rinsed by an SB so you don’t know what it’s like.\n\nThe level of manipulation they use is not ok. We tie PPm to intimacy because the alternative is waiting until they are ready which could take months. Every SB in the bowl would love to get paid without giving up sugar.\n\nIt’s not about being wealthy - it’s about being generous. If an SD is not generous then yes he shouldn’t be in the bowl. But I’ve seen many wealthy guys be super stingy and SBs would get super frustrated around them.",
            "author": "UnearthlyDinosaur",
            "id": "hia2qyk",
            "parent_id": "t3_qh1lle",
            "score": 0,
            "created_utc": 1635359779.0,
            "replies": [
                {
                    "body": ">Every SB in the bowl would love to get paid without giving up sugar.\n\nWow, if you really believe this I'm not sure what kind of SBs you date?",
                    "author": "A-touchofreality",
                    "id": "hia7sj2",
                    "parent_id": "t1_hia2qyk",
                    "score": 8,
                    "created_utc": 1635361746.0,
                    "replies": [
                        {
                            "body": "> Wow, if you really believe this I'm not sure what kind of SBs you date?\n\nEh.  I mean, I'm not sure why he still bothers sugaring, as unhappy as it seems to make him.\n\nBut - I think his point is valid, if you unpack some of the toxicity around it.  What if I restated it, this way?\n\n> Most people in the world would love to get money for free, for doing nothing.  If they could get paid to go out for a 1-2 hour meal, they most likely would.",
                            "author": "SDstartingOut",
                            "id": "hiaru9h",
                            "parent_id": "t1_hia7sj2",
                            "score": 4,
                            "created_utc": 1635369456.0,
                            "replies": [
                                {
                                    "body": "Do you give up at every challenge? \n\nI’ve learned lessons from the past and now my experiences are better.  I’m not alone in that many Sds here acknowledge the bad actors in the bowl. But I’ll be the first to say there are honest SBs out there who are great to be with. I have had some very good experiences.",
                                    "author": "UnearthlyDinosaur",
                                    "id": "hiavknl",
                                    "parent_id": "t1_hiaru9h",
                                    "score": 0,
                                    "created_utc": 1635370942.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "This post made my day! I wish you blessings and abundance and happiness 💜 you deserve it!",
            "author": "QuirkyComplex",
            "id": "hia5jr5",
            "parent_id": "t3_qh1lle",
            "score": -2,
            "created_utc": 1635360866.0,
            "replies": [
                {
                    "body": "Thank you love",
                    "author": "kikienen",
                    "id": "hia5r0i",
                    "parent_id": "t1_hia5jr5",
                    "score": 2,
                    "created_utc": 1635360943.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "SAY IT LOUDER FOR THE PPL IN THE BACK",
            "author": null,
            "id": "hiath1j",
            "parent_id": "t3_qh1lle",
            "score": 1,
            "created_utc": 1635370100.0,
            "replies": [
                {
                    "body": "Do you think shouting false narratives and generalizations makes them more true or accurate?  That says a lot about you and the others supporting the OP.",
                    "author": "storm170",
                    "id": "hiauzyx",
                    "parent_id": "t1_hiath1j",
                    "score": 1,
                    "created_utc": 1635370711.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I would like to subscribe to your advice column",
            "author": "Harpua1",
            "id": "hi9ugjp",
            "parent_id": "t3_qh1lle",
            "score": -1,
            "created_utc": 1635356595.0,
            "replies": [
                {
                    "body": "Coming soon to a local newspaper near you 😉",
                    "author": "kikienen",
                    "id": "hi9uqkd",
                    "parent_id": "t1_hi9ugjp",
                    "score": 4,
                    "created_utc": 1635356701.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "So you sign up for a massage class and the teacher was like \"I don't do this, I don't teach that, this is hourly,...etc\" overall not that pleasant. By the book and professional but that's about it. Do you take the class or do you want to try looking for a better teacher?\n\nSB is the same. Some are like you. Some are more flexible. Some are naive. Some are just easy going. So a SD would shift through them and pick the person they like best.\n\nIf you want something then it would be foolish to pay to not get what you want.\n\nA lot of people don't want to compare with escorts but I do. The escorts are like the gold standards for me. If a SB doesn't give me as much as an escort can then I would pick the escort. The massage teacher example is exactly like it.",
            "author": "Majesticpork",
            "id": "hiae57o",
            "parent_id": "t3_qh1lle",
            "score": 0,
            "created_utc": 1635364197.0,
            "replies": []
        },
        {
            "body": "All facts.",
            "author": "southernslick",
            "id": "hiac7fi",
            "parent_id": "t1_hi9y2nu",
            "score": 8,
            "created_utc": 1635363452.0,
            "replies": []
        },
        {
            "body": "As an aside and not forgetting,  women are almost entirely in control (of dating) outside of the bowl and of course use it to their favour..",
            "author": "DBeleven",
            "id": "hia70nk",
            "parent_id": "t1_hi9y2nu",
            "score": 34,
            "created_utc": 1635361442.0,
            "replies": [
                {
                    "body": "This inverse in sugaring dating is what leads to most of these whinging posts. It's not that anyone is necessarily being taken advantage of, they are just used to being in control of the dynamics of the market and feel uncomfortable now that they don't get to call the shots.",
                    "author": "storm170",
                    "id": "hia9bkr",
                    "parent_id": "t1_hia70nk",
                    "score": 41,
                    "created_utc": 1635362344.0,
                    "replies": [
                        {
                            "body": "Such a good post",
                            "author": "wb19081908",
                            "id": "hiajkml",
                            "parent_id": "t1_hia9bkr",
                            "score": 15,
                            "created_utc": 1635366261.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "👌",
            "author": "lipstickdiet",
            "id": "hiabw42",
            "parent_id": "t1_hi9y2nu",
            "score": 3,
            "created_utc": 1635363331.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "hia8f3t",
            "parent_id": "t1_hi9wgg1",
            "score": 13,
            "created_utc": 1635361992.0,
            "replies": [
                {
                    "body": "Absolutely. Escorts can stop shitting on SDs who actually treat their SBs like a human being and respect her boundaries.",
                    "author": "realitytomydreams",
                    "id": "hia8onz",
                    "parent_id": "t1_hia8f3t",
                    "score": 18,
                    "created_utc": 1635362096.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "hiafhr9",
                            "parent_id": "t1_hia8onz",
                            "score": 9,
                            "created_utc": 1635364713.0,
                            "replies": [
                                {
                                    "body": "Entertain me on this, if one treats their sugar partners with respect and understands that there are always those who don’t, would one still be triggered by this post calling out the bad ones? Wouldn’t one instead call for their bad peers to do better?",
                                    "author": "realitytomydreams",
                                    "id": "hiai9gg",
                                    "parent_id": "t1_hiafhr9",
                                    "score": 11,
                                    "created_utc": 1635365766.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "So that's the majority of SDs on this forum, so we can just shoo them right out the door and not have to listen to them ever again?  I fully support this.",
                            "author": "storm170",
                            "id": "hiabkcz",
                            "parent_id": "t1_hia8onz",
                            "score": 4,
                            "created_utc": 1635363204.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "hi9ye6h",
            "parent_id": "t1_hi9wgg1",
            "score": 10,
            "created_utc": 1635358103.0,
            "replies": [
                {
                    "body": "Hey buddy, it was a general statement and no I did not go back to that post to see what it was about. But I’ve seen many in SLF at the very least insinuate to some degree that escorts are trash. My comment was to remind everyone to just treat each other with basic respect for another human being, escort or not. I wish you a good day.",
                    "author": "realitytomydreams",
                    "id": "hi9yy0n",
                    "parent_id": "t1_hi9ye6h",
                    "score": 11,
                    "created_utc": 1635358316.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "hia0kxt",
                            "parent_id": "t1_hi9yy0n",
                            "score": -4,
                            "created_utc": 1635358944.0,
                            "replies": [
                                {
                                    "body": "Oof buddy. Woke up on the wrong side of bed didn’t you? Also, you just assumed “y’all” referred to SDs when it’s literally a gender neutral term. \n\nBuddy, someone told me generalizations make you look uneducated and obtuse. So 🤷🏻‍♀️",
                                    "author": "realitytomydreams",
                                    "id": "hia1ewv",
                                    "parent_id": "t1_hia0kxt",
                                    "score": 12,
                                    "created_utc": 1635359265.0,
                                    "replies": [
                                        {
                                            "body": "I agree Splendid was a bit sensitive, but you posted your comment in a thread that is deliberately attacking SDs on the forum.  While you may have meant for it to be a general comment to everyone, it's placement in this thread gives it a targeted feel.",
                                            "author": "storm170",
                                            "id": "hia4tqk",
                                            "parent_id": "t1_hia1ewv",
                                            "score": 3,
                                            "created_utc": 1635360588.0,
                                            "replies": [
                                                {
                                                    "body": "This post is NOT attacking real SDs. Let's get it straight",
                                                    "author": null,
                                                    "id": "hiatq2n",
                                                    "parent_id": "t1_hia4tqk",
                                                    "score": 4,
                                                    "created_utc": 1635370200.0,
                                                    "replies": [
                                                        {
                                                            "body": "Then she should have phrased her title and her post better.  If I described the SBs of SLF as bitter, shrill, man-haters based on what I've seen from the OP I'd be doing a disservice to 90+% of the women who post here.\n\nLet's get that straight.",
                                                            "author": "storm170",
                                                            "id": "hiau3el",
                                                            "parent_id": "t1_hiatq2n",
                                                            "score": 5,
                                                            "created_utc": 1635370350.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Are you implying OP is bitter and a man hater? No I'm sure she is not. But you missed the point again, that she is making. She is calling out specific men who are not real SDs but think they are. And I 100% agree with everything in her post.",
                                                                    "author": null,
                                                                    "id": "hiay2qy",
                                                                    "parent_id": "t1_hiau3el",
                                                                    "score": 1,
                                                                    "created_utc": 1635371967.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "Do you need to take some classes in reading comprehension?  She generalized all the SDs on Reddit in her post, not talking about a few bad actors that might actually line up with her rambling description.  She did this purposefully to create a controversial post, not to call out specific men.  Can you really not see that?  And yes, I've flat out called her a lemon grove already today so those terms definitely fit the OP.\n\nAnd I'm sure you do agree with everything in her post.  That is not surprising, just disappointing.",
                                                                            "author": "storm170",
                                                                            "id": "hiaymkw",
                                                                            "parent_id": "t1_hiay2qy",
                                                                            "score": 2,
                                                                            "created_utc": 1635372195.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "Why do you seem so angry lol Yeah because alot of the guys on here are fake SDs.  sure some are actual real SDs but alot of them aren't. Do you feel personally attacked by her post?",
                                                                                    "author": null,
                                                                                    "id": "hiazkxr",
                                                                                    "parent_id": "t1_hiaymkw",
                                                                                    "score": 4,
                                                                                    "created_utc": 1635372594.0,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "You really need to chill",
                                    "author": "lipstickdiet",
                                    "id": "hia7ilw",
                                    "parent_id": "t1_hia0kxt",
                                    "score": -4,
                                    "created_utc": 1635361638.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "They keep shitting on escorts because they can’t afford them",
            "author": "kikienen",
            "id": "hi9xa5l",
            "parent_id": "t1_hi9wgg1",
            "score": 3,
            "created_utc": 1635357670.0,
            "replies": [
                {
                    "body": "I can afford escorts and don’t shit on them. But I don’t want my sugar to be anywhere close to escort like just like I don’t want my escorts to be sugar like. They may both be of the sex worker world but they are different",
                    "author": "thereadinessisall",
                    "id": "hi9y2zp",
                    "parent_id": "t1_hi9xa5l",
                    "score": 14,
                    "created_utc": 1635357982.0,
                    "replies": []
                },
                {
                    "body": "That is a common perception, and an insult that gets thrown around when new SBs run into some of the \"locker room talk\" that happen here on SLF.  A while back I decided to take a look at the escort forums and at least for my local area escorts are WAY cheaper than even a Splenda level allowance.",
                    "author": "Paul_Drake",
                    "id": "hi9zoxb",
                    "parent_id": "t1_hi9xa5l",
                    "score": 20,
                    "created_utc": 1635358605.0,
                    "replies": [
                        {
                            "body": "I've avoided chiming in previously, but bikini-model/yoga-instructor -hot escorts where I live are generally at \"Splenda\" prices.  Much cheaper than a SB.",
                            "author": "LaGriffeDuLion",
                            "id": "hia4f2h",
                            "parent_id": "t1_hi9zoxb",
                            "score": 23,
                            "created_utc": 1635360428.0,
                            "replies": []
                        },
                        {
                            "body": "Exactly. Where I live escorts are cheaper too.",
                            "author": null,
                            "id": "hia0dlb",
                            "parent_id": "t1_hi9zoxb",
                            "score": 11,
                            "created_utc": 1635358867.0,
                            "replies": []
                        },
                        {
                            "body": "I agree, it's an inane comment meant to disparage the SDs that participate on this forum without any factual basis.  Maybe if we were hiring the escort for 4-5 hours it would be significantly more expensive than a weekly allowance, but that's not what you do with an escort so the comparison is moot.",
                            "author": "storm170",
                            "id": "hia0a8q",
                            "parent_id": "t1_hi9zoxb",
                            "score": 7,
                            "created_utc": 1635358832.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "hia7zxu",
                    "parent_id": "t1_hi9xa5l",
                    "score": 12,
                    "created_utc": 1635361826.0,
                    "replies": [
                        {
                            "body": "Considering the way you treat your sugar babies I won’t be surprised",
                            "author": "kikienen",
                            "id": "hia8jx9",
                            "parent_id": "t1_hia7zxu",
                            "score": -14,
                            "created_utc": 1635362045.0,
                            "replies": [
                                {
                                    "body": "You are correct. He’s the guy who sexually assaulted a drunk woman in a dirty service elevator in a so called meet and greet. And then wrote a post to brag about it. Then deleted the post after all the women called him out on the assault.",
                                    "author": "SerendipityX8",
                                    "id": "hiaht7m",
                                    "parent_id": "t1_hia8jx9",
                                    "score": 10,
                                    "created_utc": 1635365595.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Ding ding ding",
                    "author": "lipstickdiet",
                    "id": "hia798w",
                    "parent_id": "t1_hi9xa5l",
                    "score": -2,
                    "created_utc": 1635361535.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "This should be one of the top comments.",
            "author": "SerendipityX8",
            "id": "hia9fai",
            "parent_id": "t1_hia2qow",
            "score": 14,
            "created_utc": 1635362384.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "hia8y3g",
            "parent_id": "t1_hi9woa0",
            "score": 6,
            "created_utc": 1635362198.0,
            "replies": [
                {
                    "body": "Yes, i said that already in my comment. Im not disagreeing with you. 🤷🏻‍♀️",
                    "author": "LaIndiaDeAzucar",
                    "id": "hia93s2",
                    "parent_id": "t1_hia8y3g",
                    "score": 6,
                    "created_utc": 1635362260.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "PPM amounts are more about the desirability of the SD than the SB. Less attractive men pay more.\n\nMost Reddit posters are complete studs, so we pay far, far less than old fat guys.",
            "author": "Substantial-Rice-330",
            "id": "hia4rz3",
            "parent_id": "t1_hi9woa0",
            "score": -7,
            "created_utc": 1635360569.0,
            "replies": [
                {
                    "body": "Not in my case. I ask for the same amount regardless of age and looks. They are looking to be SDs, they should be able to meet the standards 🤷🏻‍♀️",
                    "author": "LaIndiaDeAzucar",
                    "id": "hiaw2i1",
                    "parent_id": "t1_hia4rz3",
                    "score": 14,
                    "created_utc": 1635371142.0,
                    "replies": []
                },
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "hiabkde",
                    "parent_id": "t1_hia4rz3",
                    "score": 13,
                    "created_utc": 1635363204.0,
                    "replies": [
                        {
                            "body": "Average Reddit user is also up 7 figures on meme stocks and crypto since 2019. Always makes me feel bad when these guys talk about how rich they are.",
                            "author": "Substantial-Rice-330",
                            "id": "hiadotw",
                            "parent_id": "t1_hiabkde",
                            "score": 2,
                            "created_utc": 1635364021.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Not true in my experience",
                    "author": "lipstickdiet",
                    "id": "hia7s89",
                    "parent_id": "t1_hia4rz3",
                    "score": 7,
                    "created_utc": 1635361743.0,
                    "replies": [
                        {
                            "body": "The part about Reddit users being studs? That was a joke.\n\nBut in general, younger, better looking guys can get away with more. And men tolerate more bullshit from better looking females.\n\nJust human nature.",
                            "author": "Substantial-Rice-330",
                            "id": "hiad9za",
                            "parent_id": "t1_hia7s89",
                            "score": -2,
                            "created_utc": 1635363863.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "You mean more generous men GIVE more.",
                    "author": null,
                    "id": "hiaw1as",
                    "parent_id": "t1_hia4rz3",
                    "score": 4,
                    "created_utc": 1635371128.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Did you read my post or did you just focus on the parts where you might have yo pay money to have a sugar baby",
            "author": "kikienen",
            "id": "hiaqlrd",
            "parent_id": "t1_hiammrn",
            "score": -8,
            "created_utc": 1635368960.0,
            "replies": [
                {
                    "body": "Solid response for when you can't counter a single point he made in his comment.  Dodge, duck, dip, dive, and dodge!",
                    "author": "storm170",
                    "id": "hiauqf2",
                    "parent_id": "t1_hiaqlrd",
                    "score": 17,
                    "created_utc": 1635370604.0,
                    "replies": [
                        {
                            "body": "I can but I’ve got better things to do, it’s happy hour ☺️",
                            "author": "kikienen",
                            "id": "hiaw6gf",
                            "parent_id": "t1_hiauqf2",
                            "score": -4,
                            "created_utc": 1635371185.0,
                            "replies": [
                                {
                                    "body": "Sure sure, we definitely believe you.",
                                    "author": "storm170",
                                    "id": "hiaw8pa",
                                    "parent_id": "t1_hiaw6gf",
                                    "score": 8,
                                    "created_utc": 1635371211.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "I read your post and clearly I have no issue being generous even when it is not immediately tied to intimacy… but at the same time you can’t be easy lick on the front end.",
                    "author": "LotBuilder",
                    "id": "hiau5y3",
                    "parent_id": "t1_hiaqlrd",
                    "score": 6,
                    "created_utc": 1635370378.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I never said that but thanks for letting me know you read at an 8th grade level",
            "author": "kikienen",
            "id": "hi9th32",
            "parent_id": "t1_hi9rose",
            "score": 0,
            "created_utc": 1635356214.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "hi9vy08",
                    "parent_id": "t1_hi9th32",
                    "score": -1,
                    "created_utc": 1635357157.0,
                    "replies": [
                        {
                            "body": "He’s trying to mansplain my emotions to me Lmaooo",
                            "author": "kikienen",
                            "id": "hi9x4oo",
                            "parent_id": "t1_hi9vy08",
                            "score": 6,
                            "created_utc": 1635357612.0,
                            "replies": [
                                {
                                    "body": "Tell me you came here to argue without telling me that you came here to argue.",
                                    "author": "Usedtobesb",
                                    "id": "hi9yjre",
                                    "parent_id": "t1_hi9x4oo",
                                    "score": 8,
                                    "created_utc": 1635358163.0,
                                    "replies": [
                                        {
                                            "body": "I’m in no way denying that, last time I checked that’s what Reddit is used for mostly",
                                            "author": "kikienen",
                                            "id": "hi9zos9",
                                            "parent_id": "t1_hi9yjre",
                                            "score": 5,
                                            "created_utc": 1635358603.0,
                                            "replies": [
                                                {
                                                    "body": "I mean I guess I can’t disagree with that. But Tasty might be on point by suggesting that you take a step back. Obviously someone hurt you and you’re here to vent. But it’s crazy to get big mad at the people who offered helpful advice and who btw, weren’t the ones who hurt you.",
                                                    "author": "Usedtobesb",
                                                    "id": "hia060v",
                                                    "parent_id": "t1_hi9zos9",
                                                    "score": 11,
                                                    "created_utc": 1635358788.0,
                                                    "replies": [
                                                        {
                                                            "body": "Hold up, you mean she shouldn't be screaming into the abyss that is Reddit about something that none of us did or even generally subscribe to?\n\nThat sounds entirely too....mentally healthy.",
                                                            "author": "storm170",
                                                            "id": "hia269v",
                                                            "parent_id": "t1_hia060v",
                                                            "score": 8,
                                                            "created_utc": 1635359557.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Perhaps she cannot afford a therapist 🤷🏻‍♀️",
                                                                    "author": "Usedtobesb",
                                                                    "id": "hia495j",
                                                                    "parent_id": "t1_hia269v",
                                                                    "score": 8,
                                                                    "created_utc": 1635360362.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "body": "> weren't the ones who hurt you\n\nShe can't hurt the actual people who did this to her though. \n\nAnd how else is she supposed to process her emotions? Not like you can expect her to be an adult or something.",
                                                            "author": "KPackCorey",
                                                            "id": "hia1sba",
                                                            "parent_id": "t1_hia060v",
                                                            "score": 1,
                                                            "created_utc": 1635359406.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Well don’t give her any ideas 😬🤣",
                                                                    "author": "Usedtobesb",
                                                                    "id": "hia4fud",
                                                                    "parent_id": "t1_hia1sba",
                                                                    "score": 6,
                                                                    "created_utc": 1635360436.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Thank you.  I came to write what you basically just did.\n\nThankyou for saving me a job",
            "author": "HecatesCats",
            "id": "hiaxezm",
            "parent_id": "t1_hia5p14",
            "score": 7,
            "created_utc": 1635371693.0,
            "replies": []
        },
        {
            "body": "But the gag is, I am a treat. I’m not interested in men who aren’t willing to open they’re pockets so it’s a win-win",
            "author": "kikienen",
            "id": "hiadvdj",
            "parent_id": "t1_hiadcmw",
            "score": -6,
            "created_utc": 1635364091.0,
            "replies": []
        },
        {
            "body": "Of course ‘sugar daddies’ like you would love to see less of the likes of me, nothing new sweetie 💀",
            "author": "kikienen",
            "id": "hi9uv5n",
            "parent_id": "t1_hi9tw4z",
            "score": -3,
            "created_utc": 1635356749.0,
            "replies": []
        },
        {
            "body": "She does invest her own time. She gets ready, arranges her schedule to be there, travels, and spends an hour convincing the POT that they have a connection.",
            "author": "anxietyvibes",
            "id": "hia6k9s",
            "parent_id": "t1_hia39lb",
            "score": -2,
            "created_utc": 1635361262.0,
            "replies": [
                {
                    "body": "All of which the SD does as well, while also giving up that time where he could be potentially making significant amounts of money compared to what the SB could have made during those same hours.  They both are investing the same effort, which is the very definition of mutually beneficial, so requiring a gift on top of that just shows that the SB is starting the relationship off slanted towards her own interests.",
                    "author": "storm170",
                    "id": "hia9xhn",
                    "parent_id": "t1_hia6k9s",
                    "score": 8,
                    "created_utc": 1635362578.0,
                    "replies": [
                        {
                            "body": "SB could be making money during that time too. SD wants her company, SB wants money. SB is providing on her end, I think it’s a good sign when SD is providing on his end from the first M&G too. I don’t require a gift on the first M&G because it would turn off men who have this idea that they’ll be rinsed or whatever, but a lot of men provide a gift regardless and it definitely shows me they’re serious and they appreciate my time.",
                            "author": "anxietyvibes",
                            "id": "hiac2q7",
                            "parent_id": "t1_hia9xhn",
                            "score": 3,
                            "created_utc": 1635363401.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "hiajtjo",
                                    "parent_id": "t1_hiac2q7",
                                    "score": 3,
                                    "created_utc": 1635366355.0,
                                    "replies": [
                                        {
                                            "body": "Yeah of course he wants more than company, he wants sex too, but he also wants company or he’d go on a date with an escort instead, right? That’s the logic I see SDs on here using. Regardless of a future arrangement, the SD gets a date with a beautiful young woman. This is something I doubt he’d be doing otherwise, because most men aren’t going to pay for an arrangement when they could get it for free. What does the SB get?",
                                            "author": "anxietyvibes",
                                            "id": "hiakryy",
                                            "parent_id": "t1_hiajtjo",
                                            "score": 3,
                                            "created_utc": 1635366714.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "I always provide a gift, as do the majority of the SDs on this forum.  We simply don't meet with SBs that charge a fee for a M&G (requiring it makes it not a gift).  You are welcome to discriminate against POTs that don't provide something at the M&G if you want, that's not what the OP is whining about or implying by the comment she has since edited from her post.\n\nAnd of course SBs could be making money during that time too, SDs just have a far greater opportunity to make more based on them being a SD in the first place.",
                                    "author": "storm170",
                                    "id": "hiacx47",
                                    "parent_id": "t1_hiac2q7",
                                    "score": 2,
                                    "created_utc": 1635363726.0,
                                    "replies": [
                                        {
                                            "body": "All I was saying was that SBs do invests their time in the meet. 🤷‍♀️",
                                            "author": "anxietyvibes",
                                            "id": "hiad557",
                                            "parent_id": "t1_hiacx47",
                                            "score": 5,
                                            "created_utc": 1635363811.0,
                                            "replies": [
                                                {
                                                    "body": "Your original comment says that SBs do not invest their own time in a M&G.  Did you mean to end your first sentence with a ?",
                                                    "author": "storm170",
                                                    "id": "hiadgxc",
                                                    "parent_id": "t1_hiad557",
                                                    "score": 4,
                                                    "created_utc": 1635363937.0,
                                                    "replies": [
                                                        {
                                                            "body": "Oops lol. I just realized that. That makes a big difference my bad.",
                                                            "author": "anxietyvibes",
                                                            "id": "hiadvdb",
                                                            "parent_id": "t1_hiadgxc",
                                                            "score": 1,
                                                            "created_utc": 1635364091.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "body": "[deleted]",
                                                    "author": null,
                                                    "id": "hiafqyd",
                                                    "parent_id": "t1_hiad557",
                                                    "score": 1,
                                                    "created_utc": 1635364810.0,
                                                    "replies": [
                                                        {
                                                            "body": "What does the SD really have to lose though? If what he wants is the company of a beautiful young woman, is that not what he’s getting?",
                                                            "author": "anxietyvibes",
                                                            "id": "hiajrvk",
                                                            "parent_id": "t1_hiafqyd",
                                                            "score": 4,
                                                            "created_utc": 1635366337.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Do you really think that anyone is paying a pot SB simply for the benefit of meeting up for a few drinks?\n\nThat is delusional.\n\nAs a divorced man I have plenty of hot young women who I know as platonic friends that I spend time in the company of.  I'm not interested in more friends.",
                                                                    "author": "HecatesCats",
                                                                    "id": "hiay33j",
                                                                    "parent_id": "t1_hiajrvk",
                                                                    "score": 6,
                                                                    "created_utc": 1635371971.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "Do you really think nobody is?.. I think that because I’ve experienced it.. If that’s not the case for you then you’re the exception. I’m not saying every single SD has to pay for the company of a younger woman, some do it for other reasons, but 90% do. Most SDs wouldn’t be in the company of a young beautiful woman who is interested in him otherwise. So yes, they’ll compensate a SB just for her time and attention. I’m not saying they’re paying 1k for dinner and drinks. Or that they’re paying a full allowance for a M&G. Or that they’re having arrangements with no intimacy. But there are SDs who are compensating SBs for M&Gs. Don’t let this forum fool you. 🤷‍♀️",
                                                                            "author": "anxietyvibes",
                                                                            "id": "hiaymqs",
                                                                            "parent_id": "t1_hiay33j",
                                                                            "score": 5,
                                                                            "created_utc": 1635372197.0,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "hiafhdb",
                                    "parent_id": "t1_hiac2q7",
                                    "score": -1,
                                    "created_utc": 1635364709.0,
                                    "replies": [
                                        {
                                            "body": "My comment was in reference to u/storm170 saying the SD could be making money during that time.",
                                            "author": "anxietyvibes",
                                            "id": "hiajj6x",
                                            "parent_id": "t1_hiafhdb",
                                            "score": 1,
                                            "created_utc": 1635366246.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "hiaj9mp",
                    "parent_id": "t1_hia6k9s",
                    "score": 0,
                    "created_utc": 1635366145.0,
                    "replies": [
                        {
                            "body": "It's such a simple concept, but some people love to toss the concept of a mutually beneficial relationship out the window when it comes to them having to put in equal effort.  And then cry about someone trying to take advantage of them for that expectation.",
                            "author": "storm170",
                            "id": "hiavtu6",
                            "parent_id": "t1_hiaj9mp",
                            "score": 1,
                            "created_utc": 1635371045.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "You're talking about a more nebulous sort of value - gifts and communication and feeling taken care of. Which is value, but it's not what OP means. \n\nIf you calculated the amount of time you spend with a SB and compare that to the hourly rate of escorts, generally speaking SBs are making far less. Your PPM may be really high and your dates are short, and the escorts in the area are very inexpensive. But as a general matter on a per-house basis SBs tend to make far less.",
            "author": "MASugarBaby",
            "id": "hia0fxl",
            "parent_id": "t1_hi9zqgk",
            "score": 14,
            "created_utc": 1635358891.0,
            "replies": [
                {
                    "body": "I guess you have a point.  If I look at it from an hourly point of view, then maybe an escort would be more expensive... but I highly doubt many escorts would be interested in a long night out... or a few hours of deep/intelligent conversation!",
                    "author": "spoilyou255",
                    "id": "hia1hkk",
                    "parent_id": "t1_hia0fxl",
                    "score": -4,
                    "created_utc": 1635359293.0,
                    "replies": [
                        {
                            "body": "If they're getting their hourly rate, of course they would be interested. They would probably love hanging out and chatting vs only having sex.",
                            "author": "MASugarBaby",
                            "id": "hia1lxi",
                            "parent_id": "t1_hia1hkk",
                            "score": 10,
                            "created_utc": 1635359340.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Escorts are much cheaper than SB's. And honestly, attractive girls don't complain like this.",
            "author": "Substantial-Rice-330",
            "id": "hia1141",
            "parent_id": "t1_hi9zqgk",
            "score": 0,
            "created_utc": 1635359117.0,
            "replies": [
                {
                    "body": "Well I’m an attractive girl and I’m complaining so where do we go from there? Also escorts make wayyy more, don’t be naive",
                    "author": "kikienen",
                    "id": "hia2kyb",
                    "parent_id": "t1_hia1141",
                    "score": 9,
                    "created_utc": 1635359715.0,
                    "replies": [
                        {
                            "body": "I didn't say (some) escorts didn't make more. I said escorts were cheaper than sugar babies from the client perspective. You got all sorts of extraneous costs with sugar babies such as dinners and whatnot. You have to see them more often.\n\nIt's not really cheaper.\n\nI don't understand why you're complaining though, it's not going to make anyone pay you more money.",
                            "author": "Substantial-Rice-330",
                            "id": "hia33hp",
                            "parent_id": "t1_hia2kyb",
                            "score": 7,
                            "created_utc": 1635359914.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Escorts do nothing for me. They watch the clock and make you wear a condom. No thanks.",
            "author": "UnearthlyDinosaur",
            "id": "hia2ub5",
            "parent_id": "t1_hi9zqgk",
            "score": -6,
            "created_utc": 1635359815.0,
            "replies": [
                {
                    "body": "Sugar babies do both these things.",
                    "author": "Substantial-Rice-330",
                    "id": "hia3ycx",
                    "parent_id": "t1_hia2ub5",
                    "score": -4,
                    "created_utc": 1635360246.0,
                    "replies": [
                        {
                            "body": "I’ve never had an SB watch the clock. And a majority don’t want me to use a condom.",
                            "author": "UnearthlyDinosaur",
                            "id": "hiav2z9",
                            "parent_id": "t1_hia3ycx",
                            "score": -2,
                            "created_utc": 1635370745.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "‘Plenty of SBs are happy and getting what they want.’\nThis is a weird and groomy take",
            "author": "kikienen",
            "id": "hi9vp7t",
            "parent_id": "t1_hi9re3v",
            "score": 1,
            "created_utc": 1635357064.0,
            "replies": [
                {
                    "body": "Nah it's matter of fact.  \n\nYou're deluded and projecting your own shit onto people.",
                    "author": null,
                    "id": "hi9yrg9",
                    "parent_id": "t1_hi9vp7t",
                    "score": 4,
                    "created_utc": 1635358245.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Offbase how? Do you not encounter countless men in middle management or making a meager salary that wants something to be “real” and “non transactional” but still doesn’t have any emotional availability or anything to offer outside of hard dick and small gifts? Lol",
            "author": "fruters",
            "id": "hi9vxez",
            "parent_id": "t1_hi9vko7",
            "score": 6,
            "created_utc": 1635357151.0,
            "replies": [
                {
                    "body": "Literally never. But I know how to read a room. IYKYK. Clearly you do not.",
                    "author": "Usedtobesb",
                    "id": "hi9wtzr",
                    "parent_id": "t1_hi9vxez",
                    "score": 2,
                    "created_utc": 1635357497.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Exactly they keep doling out minimal effort but expect a 5-star performance from sugar babies because they’ve been led to think that we’re somewhat desperate",
            "author": "kikienen",
            "id": "hi9vh63",
            "parent_id": "t1_hi9v3s2",
            "score": 18,
            "created_utc": 1635356980.0,
            "replies": []
        },
        {
            "body": "Yet here you are, commenting. I’m sure you have more productive things to do than to  complain about an unproductive post",
            "author": "kikienen",
            "id": "hi9zfl3",
            "parent_id": "t1_hi9z4gd",
            "score": 6,
            "created_utc": 1635358505.0,
            "replies": [
                {
                    "body": "My roomba is charging :/",
                    "author": "KPackCorey",
                    "id": "hia0di7",
                    "parent_id": "t1_hi9zfl3",
                    "score": 5,
                    "created_utc": 1635358866.0,
                    "replies": [
                        {
                            "body": "And I got bored watching my paint dry so 🤷🏽‍♀️",
                            "author": "kikienen",
                            "id": "hia2b4q",
                            "parent_id": "t1_hia0di7",
                            "score": 6,
                            "created_utc": 1635359610.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Do you call men with More than one SB Johns? And didn’t you read my post, calling me an escort doesn’t phase me, and it never will",
            "author": "kikienen",
            "id": "hiatn4n",
            "parent_id": "t1_hiatbrm",
            "score": -1,
            "created_utc": 1635370167.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "hiau5qs",
                    "parent_id": "t1_hiatn4n",
                    "score": 2,
                    "created_utc": 1635370375.0,
                    "replies": [
                        {
                            "body": "Based on her interactions today, I am comfortable saying she cannot.",
                            "author": "storm170",
                            "id": "hiawn4j",
                            "parent_id": "t1_hiau5qs",
                            "score": 3,
                            "created_utc": 1635371377.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "‘Successful sugar babies’ are ones who don’t settle for nonsense. And I find my sugar daddy very attractive, thank you for being worried about me though ❤️",
            "author": "kikienen",
            "id": "hi9xr05",
            "parent_id": "t1_hi9w1qq",
            "score": 6,
            "created_utc": 1635357853.0,
            "replies": [
                {
                    "body": "Sure sure, we definitely believe you.",
                    "author": "storm170",
                    "id": "hi9xto9",
                    "parent_id": "t1_hi9xr05",
                    "score": 2,
                    "created_utc": 1635357882.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Also I successful sugar daddies don’t have the time to be squabbling on the internet, they’re too busy making millions 😌",
            "author": "kikienen",
            "id": "hi9xwj5",
            "parent_id": "t1_hi9w1qq",
            "score": 5,
            "created_utc": 1635357912.0,
            "replies": [
                {
                    "body": "You just love to say things that are incorrect don't you?  Successful SDs have plenty of time to do whatever they want, including providing free education to you on the internet, because we have already made millions.  You'll catch on sooner or later.",
                    "author": "storm170",
                    "id": "hi9y55h",
                    "parent_id": "t1_hi9xwj5",
                    "score": 3,
                    "created_utc": 1635358005.0,
                    "replies": []
                },
                {
                    "body": "Successful people have a lot of free time usually ( i have a few friends above 40 million net worth each ) \n\nThey spend more time on social media than you can imagine ,, return texts in 5 minutes 90% of the time,, \n\nWhy would anybody think successful people don't have a lot of free time ??   We make time ,, we make our own schedules mostly ,,",
                    "author": "shamloo77",
                    "id": "hiafmua",
                    "parent_id": "t1_hi9xwj5",
                    "score": 3,
                    "created_utc": 1635364766.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Budge up😁",
            "author": "DBeleven",
            "id": "hi9txyz",
            "parent_id": "t1_hi9t0ze",
            "score": 0,
            "created_utc": 1635356397.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "hiaitsq",
            "parent_id": "t1_hiaholu",
            "score": 7,
            "created_utc": 1635365979.0,
            "replies": [
                {
                    "body": "You are thinking what i am thinking now ??🤔",
                    "author": "shamloo77",
                    "id": "hiajopm",
                    "parent_id": "t1_hiaitsq",
                    "score": 6,
                    "created_utc": 1635366304.0,
                    "replies": []
                },
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "hiak9ox",
                    "parent_id": "t1_hiaitsq",
                    "score": -3,
                    "created_utc": 1635366522.0,
                    "replies": [
                        {
                            "body": "It's about time you realized that what you were doing isn't sugaring.  UseRound, what the hell are you talking about \"trying freestyling with your wife?\"  When did she become a freak?  I'm confused because if your wife is into couples, why didn't you talk to her about sugaring earlier? I think you are in self-destruct mode.",
                            "author": "Darknlovely38",
                            "id": "hiazm0u",
                            "parent_id": "t1_hiak9ox",
                            "score": 7,
                            "created_utc": 1635372607.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": ">Every SB in the bowl would love to get paid without giving up sugar.\n\nWow, if you really believe this I'm not sure what kind of SBs you date?",
            "author": "A-touchofreality",
            "id": "hia7sj2",
            "parent_id": "t1_hia2qyk",
            "score": 8,
            "created_utc": 1635361746.0,
            "replies": [
                {
                    "body": "> Wow, if you really believe this I'm not sure what kind of SBs you date?\n\nEh.  I mean, I'm not sure why he still bothers sugaring, as unhappy as it seems to make him.\n\nBut - I think his point is valid, if you unpack some of the toxicity around it.  What if I restated it, this way?\n\n> Most people in the world would love to get money for free, for doing nothing.  If they could get paid to go out for a 1-2 hour meal, they most likely would.",
                    "author": "SDstartingOut",
                    "id": "hiaru9h",
                    "parent_id": "t1_hia7sj2",
                    "score": 4,
                    "created_utc": 1635369456.0,
                    "replies": [
                        {
                            "body": "Do you give up at every challenge? \n\nI’ve learned lessons from the past and now my experiences are better.  I’m not alone in that many Sds here acknowledge the bad actors in the bowl. But I’ll be the first to say there are honest SBs out there who are great to be with. I have had some very good experiences.",
                            "author": "UnearthlyDinosaur",
                            "id": "hiavknl",
                            "parent_id": "t1_hiaru9h",
                            "score": 0,
                            "created_utc": 1635370942.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Thank you love",
            "author": "kikienen",
            "id": "hia5r0i",
            "parent_id": "t1_hia5jr5",
            "score": 2,
            "created_utc": 1635360943.0,
            "replies": []
        },
        {
            "body": "Do you think shouting false narratives and generalizations makes them more true or accurate?  That says a lot about you and the others supporting the OP.",
            "author": "storm170",
            "id": "hiauzyx",
            "parent_id": "t1_hiath1j",
            "score": 1,
            "created_utc": 1635370711.0,
            "replies": []
        },
        {
            "body": "Coming soon to a local newspaper near you 😉",
            "author": "kikienen",
            "id": "hi9uqkd",
            "parent_id": "t1_hi9ugjp",
            "score": 4,
            "created_utc": 1635356701.0,
            "replies": []
        },
        {
            "body": "This inverse in sugaring dating is what leads to most of these whinging posts. It's not that anyone is necessarily being taken advantage of, they are just used to being in control of the dynamics of the market and feel uncomfortable now that they don't get to call the shots.",
            "author": "storm170",
            "id": "hia9bkr",
            "parent_id": "t1_hia70nk",
            "score": 41,
            "created_utc": 1635362344.0,
            "replies": [
                {
                    "body": "Such a good post",
                    "author": "wb19081908",
                    "id": "hiajkml",
                    "parent_id": "t1_hia9bkr",
                    "score": 15,
                    "created_utc": 1635366261.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Absolutely. Escorts can stop shitting on SDs who actually treat their SBs like a human being and respect her boundaries.",
            "author": "realitytomydreams",
            "id": "hia8onz",
            "parent_id": "t1_hia8f3t",
            "score": 18,
            "created_utc": 1635362096.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "hiafhr9",
                    "parent_id": "t1_hia8onz",
                    "score": 9,
                    "created_utc": 1635364713.0,
                    "replies": [
                        {
                            "body": "Entertain me on this, if one treats their sugar partners with respect and understands that there are always those who don’t, would one still be triggered by this post calling out the bad ones? Wouldn’t one instead call for their bad peers to do better?",
                            "author": "realitytomydreams",
                            "id": "hiai9gg",
                            "parent_id": "t1_hiafhr9",
                            "score": 11,
                            "created_utc": 1635365766.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "So that's the majority of SDs on this forum, so we can just shoo them right out the door and not have to listen to them ever again?  I fully support this.",
                    "author": "storm170",
                    "id": "hiabkcz",
                    "parent_id": "t1_hia8onz",
                    "score": 4,
                    "created_utc": 1635363204.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Hey buddy, it was a general statement and no I did not go back to that post to see what it was about. But I’ve seen many in SLF at the very least insinuate to some degree that escorts are trash. My comment was to remind everyone to just treat each other with basic respect for another human being, escort or not. I wish you a good day.",
            "author": "realitytomydreams",
            "id": "hi9yy0n",
            "parent_id": "t1_hi9ye6h",
            "score": 11,
            "created_utc": 1635358316.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "hia0kxt",
                    "parent_id": "t1_hi9yy0n",
                    "score": -4,
                    "created_utc": 1635358944.0,
                    "replies": [
                        {
                            "body": "Oof buddy. Woke up on the wrong side of bed didn’t you? Also, you just assumed “y’all” referred to SDs when it’s literally a gender neutral term. \n\nBuddy, someone told me generalizations make you look uneducated and obtuse. So 🤷🏻‍♀️",
                            "author": "realitytomydreams",
                            "id": "hia1ewv",
                            "parent_id": "t1_hia0kxt",
                            "score": 12,
                            "created_utc": 1635359265.0,
                            "replies": [
                                {
                                    "body": "I agree Splendid was a bit sensitive, but you posted your comment in a thread that is deliberately attacking SDs on the forum.  While you may have meant for it to be a general comment to everyone, it's placement in this thread gives it a targeted feel.",
                                    "author": "storm170",
                                    "id": "hia4tqk",
                                    "parent_id": "t1_hia1ewv",
                                    "score": 3,
                                    "created_utc": 1635360588.0,
                                    "replies": [
                                        {
                                            "body": "This post is NOT attacking real SDs. Let's get it straight",
                                            "author": null,
                                            "id": "hiatq2n",
                                            "parent_id": "t1_hia4tqk",
                                            "score": 4,
                                            "created_utc": 1635370200.0,
                                            "replies": [
                                                {
                                                    "body": "Then she should have phrased her title and her post better.  If I described the SBs of SLF as bitter, shrill, man-haters based on what I've seen from the OP I'd be doing a disservice to 90+% of the women who post here.\n\nLet's get that straight.",
                                                    "author": "storm170",
                                                    "id": "hiau3el",
                                                    "parent_id": "t1_hiatq2n",
                                                    "score": 5,
                                                    "created_utc": 1635370350.0,
                                                    "replies": [
                                                        {
                                                            "body": "Are you implying OP is bitter and a man hater? No I'm sure she is not. But you missed the point again, that she is making. She is calling out specific men who are not real SDs but think they are. And I 100% agree with everything in her post.",
                                                            "author": null,
                                                            "id": "hiay2qy",
                                                            "parent_id": "t1_hiau3el",
                                                            "score": 1,
                                                            "created_utc": 1635371967.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Do you need to take some classes in reading comprehension?  She generalized all the SDs on Reddit in her post, not talking about a few bad actors that might actually line up with her rambling description.  She did this purposefully to create a controversial post, not to call out specific men.  Can you really not see that?  And yes, I've flat out called her a lemon grove already today so those terms definitely fit the OP.\n\nAnd I'm sure you do agree with everything in her post.  That is not surprising, just disappointing.",
                                                                    "author": "storm170",
                                                                    "id": "hiaymkw",
                                                                    "parent_id": "t1_hiay2qy",
                                                                    "score": 2,
                                                                    "created_utc": 1635372195.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "Why do you seem so angry lol Yeah because alot of the guys on here are fake SDs.  sure some are actual real SDs but alot of them aren't. Do you feel personally attacked by her post?",
                                                                            "author": null,
                                                                            "id": "hiazkxr",
                                                                            "parent_id": "t1_hiaymkw",
                                                                            "score": 4,
                                                                            "created_utc": 1635372594.0,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "You really need to chill",
                            "author": "lipstickdiet",
                            "id": "hia7ilw",
                            "parent_id": "t1_hia0kxt",
                            "score": -4,
                            "created_utc": 1635361638.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I can afford escorts and don’t shit on them. But I don’t want my sugar to be anywhere close to escort like just like I don’t want my escorts to be sugar like. They may both be of the sex worker world but they are different",
            "author": "thereadinessisall",
            "id": "hi9y2zp",
            "parent_id": "t1_hi9xa5l",
            "score": 14,
            "created_utc": 1635357982.0,
            "replies": []
        },
        {
            "body": "That is a common perception, and an insult that gets thrown around when new SBs run into some of the \"locker room talk\" that happen here on SLF.  A while back I decided to take a look at the escort forums and at least for my local area escorts are WAY cheaper than even a Splenda level allowance.",
            "author": "Paul_Drake",
            "id": "hi9zoxb",
            "parent_id": "t1_hi9xa5l",
            "score": 20,
            "created_utc": 1635358605.0,
            "replies": [
                {
                    "body": "I've avoided chiming in previously, but bikini-model/yoga-instructor -hot escorts where I live are generally at \"Splenda\" prices.  Much cheaper than a SB.",
                    "author": "LaGriffeDuLion",
                    "id": "hia4f2h",
                    "parent_id": "t1_hi9zoxb",
                    "score": 23,
                    "created_utc": 1635360428.0,
                    "replies": []
                },
                {
                    "body": "Exactly. Where I live escorts are cheaper too.",
                    "author": null,
                    "id": "hia0dlb",
                    "parent_id": "t1_hi9zoxb",
                    "score": 11,
                    "created_utc": 1635358867.0,
                    "replies": []
                },
                {
                    "body": "I agree, it's an inane comment meant to disparage the SDs that participate on this forum without any factual basis.  Maybe if we were hiring the escort for 4-5 hours it would be significantly more expensive than a weekly allowance, but that's not what you do with an escort so the comparison is moot.",
                    "author": "storm170",
                    "id": "hia0a8q",
                    "parent_id": "t1_hi9zoxb",
                    "score": 7,
                    "created_utc": 1635358832.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "hia7zxu",
            "parent_id": "t1_hi9xa5l",
            "score": 12,
            "created_utc": 1635361826.0,
            "replies": [
                {
                    "body": "Considering the way you treat your sugar babies I won’t be surprised",
                    "author": "kikienen",
                    "id": "hia8jx9",
                    "parent_id": "t1_hia7zxu",
                    "score": -14,
                    "created_utc": 1635362045.0,
                    "replies": [
                        {
                            "body": "You are correct. He’s the guy who sexually assaulted a drunk woman in a dirty service elevator in a so called meet and greet. And then wrote a post to brag about it. Then deleted the post after all the women called him out on the assault.",
                            "author": "SerendipityX8",
                            "id": "hiaht7m",
                            "parent_id": "t1_hia8jx9",
                            "score": 10,
                            "created_utc": 1635365595.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Ding ding ding",
            "author": "lipstickdiet",
            "id": "hia798w",
            "parent_id": "t1_hi9xa5l",
            "score": -2,
            "created_utc": 1635361535.0,
            "replies": []
        },
        {
            "body": "Yes, i said that already in my comment. Im not disagreeing with you. 🤷🏻‍♀️",
            "author": "LaIndiaDeAzucar",
            "id": "hia93s2",
            "parent_id": "t1_hia8y3g",
            "score": 6,
            "created_utc": 1635362260.0,
            "replies": []
        },
        {
            "body": "Not in my case. I ask for the same amount regardless of age and looks. They are looking to be SDs, they should be able to meet the standards 🤷🏻‍♀️",
            "author": "LaIndiaDeAzucar",
            "id": "hiaw2i1",
            "parent_id": "t1_hia4rz3",
            "score": 14,
            "created_utc": 1635371142.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "hiabkde",
            "parent_id": "t1_hia4rz3",
            "score": 13,
            "created_utc": 1635363204.0,
            "replies": [
                {
                    "body": "Average Reddit user is also up 7 figures on meme stocks and crypto since 2019. Always makes me feel bad when these guys talk about how rich they are.",
                    "author": "Substantial-Rice-330",
                    "id": "hiadotw",
                    "parent_id": "t1_hiabkde",
                    "score": 2,
                    "created_utc": 1635364021.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Not true in my experience",
            "author": "lipstickdiet",
            "id": "hia7s89",
            "parent_id": "t1_hia4rz3",
            "score": 7,
            "created_utc": 1635361743.0,
            "replies": [
                {
                    "body": "The part about Reddit users being studs? That was a joke.\n\nBut in general, younger, better looking guys can get away with more. And men tolerate more bullshit from better looking females.\n\nJust human nature.",
                    "author": "Substantial-Rice-330",
                    "id": "hiad9za",
                    "parent_id": "t1_hia7s89",
                    "score": -2,
                    "created_utc": 1635363863.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "You mean more generous men GIVE more.",
            "author": null,
            "id": "hiaw1as",
            "parent_id": "t1_hia4rz3",
            "score": 4,
            "created_utc": 1635371128.0,
            "replies": []
        },
        {
            "body": "Solid response for when you can't counter a single point he made in his comment.  Dodge, duck, dip, dive, and dodge!",
            "author": "storm170",
            "id": "hiauqf2",
            "parent_id": "t1_hiaqlrd",
            "score": 17,
            "created_utc": 1635370604.0,
            "replies": [
                {
                    "body": "I can but I’ve got better things to do, it’s happy hour ☺️",
                    "author": "kikienen",
                    "id": "hiaw6gf",
                    "parent_id": "t1_hiauqf2",
                    "score": -4,
                    "created_utc": 1635371185.0,
                    "replies": [
                        {
                            "body": "Sure sure, we definitely believe you.",
                            "author": "storm170",
                            "id": "hiaw8pa",
                            "parent_id": "t1_hiaw6gf",
                            "score": 8,
                            "created_utc": 1635371211.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I read your post and clearly I have no issue being generous even when it is not immediately tied to intimacy… but at the same time you can’t be easy lick on the front end.",
            "author": "LotBuilder",
            "id": "hiau5y3",
            "parent_id": "t1_hiaqlrd",
            "score": 6,
            "created_utc": 1635370378.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "hi9vy08",
            "parent_id": "t1_hi9th32",
            "score": -1,
            "created_utc": 1635357157.0,
            "replies": [
                {
                    "body": "He’s trying to mansplain my emotions to me Lmaooo",
                    "author": "kikienen",
                    "id": "hi9x4oo",
                    "parent_id": "t1_hi9vy08",
                    "score": 6,
                    "created_utc": 1635357612.0,
                    "replies": [
                        {
                            "body": "Tell me you came here to argue without telling me that you came here to argue.",
                            "author": "Usedtobesb",
                            "id": "hi9yjre",
                            "parent_id": "t1_hi9x4oo",
                            "score": 8,
                            "created_utc": 1635358163.0,
                            "replies": [
                                {
                                    "body": "I’m in no way denying that, last time I checked that’s what Reddit is used for mostly",
                                    "author": "kikienen",
                                    "id": "hi9zos9",
                                    "parent_id": "t1_hi9yjre",
                                    "score": 5,
                                    "created_utc": 1635358603.0,
                                    "replies": [
                                        {
                                            "body": "I mean I guess I can’t disagree with that. But Tasty might be on point by suggesting that you take a step back. Obviously someone hurt you and you’re here to vent. But it’s crazy to get big mad at the people who offered helpful advice and who btw, weren’t the ones who hurt you.",
                                            "author": "Usedtobesb",
                                            "id": "hia060v",
                                            "parent_id": "t1_hi9zos9",
                                            "score": 11,
                                            "created_utc": 1635358788.0,
                                            "replies": [
                                                {
                                                    "body": "Hold up, you mean she shouldn't be screaming into the abyss that is Reddit about something that none of us did or even generally subscribe to?\n\nThat sounds entirely too....mentally healthy.",
                                                    "author": "storm170",
                                                    "id": "hia269v",
                                                    "parent_id": "t1_hia060v",
                                                    "score": 8,
                                                    "created_utc": 1635359557.0,
                                                    "replies": [
                                                        {
                                                            "body": "Perhaps she cannot afford a therapist 🤷🏻‍♀️",
                                                            "author": "Usedtobesb",
                                                            "id": "hia495j",
                                                            "parent_id": "t1_hia269v",
                                                            "score": 8,
                                                            "created_utc": 1635360362.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "body": "> weren't the ones who hurt you\n\nShe can't hurt the actual people who did this to her though. \n\nAnd how else is she supposed to process her emotions? Not like you can expect her to be an adult or something.",
                                                    "author": "KPackCorey",
                                                    "id": "hia1sba",
                                                    "parent_id": "t1_hia060v",
                                                    "score": 1,
                                                    "created_utc": 1635359406.0,
                                                    "replies": [
                                                        {
                                                            "body": "Well don’t give her any ideas 😬🤣",
                                                            "author": "Usedtobesb",
                                                            "id": "hia4fud",
                                                            "parent_id": "t1_hia1sba",
                                                            "score": 6,
                                                            "created_utc": 1635360436.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "All of which the SD does as well, while also giving up that time where he could be potentially making significant amounts of money compared to what the SB could have made during those same hours.  They both are investing the same effort, which is the very definition of mutually beneficial, so requiring a gift on top of that just shows that the SB is starting the relationship off slanted towards her own interests.",
            "author": "storm170",
            "id": "hia9xhn",
            "parent_id": "t1_hia6k9s",
            "score": 8,
            "created_utc": 1635362578.0,
            "replies": [
                {
                    "body": "SB could be making money during that time too. SD wants her company, SB wants money. SB is providing on her end, I think it’s a good sign when SD is providing on his end from the first M&G too. I don’t require a gift on the first M&G because it would turn off men who have this idea that they’ll be rinsed or whatever, but a lot of men provide a gift regardless and it definitely shows me they’re serious and they appreciate my time.",
                    "author": "anxietyvibes",
                    "id": "hiac2q7",
                    "parent_id": "t1_hia9xhn",
                    "score": 3,
                    "created_utc": 1635363401.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "hiajtjo",
                            "parent_id": "t1_hiac2q7",
                            "score": 3,
                            "created_utc": 1635366355.0,
                            "replies": [
                                {
                                    "body": "Yeah of course he wants more than company, he wants sex too, but he also wants company or he’d go on a date with an escort instead, right? That’s the logic I see SDs on here using. Regardless of a future arrangement, the SD gets a date with a beautiful young woman. This is something I doubt he’d be doing otherwise, because most men aren’t going to pay for an arrangement when they could get it for free. What does the SB get?",
                                    "author": "anxietyvibes",
                                    "id": "hiakryy",
                                    "parent_id": "t1_hiajtjo",
                                    "score": 3,
                                    "created_utc": 1635366714.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "I always provide a gift, as do the majority of the SDs on this forum.  We simply don't meet with SBs that charge a fee for a M&G (requiring it makes it not a gift).  You are welcome to discriminate against POTs that don't provide something at the M&G if you want, that's not what the OP is whining about or implying by the comment she has since edited from her post.\n\nAnd of course SBs could be making money during that time too, SDs just have a far greater opportunity to make more based on them being a SD in the first place.",
                            "author": "storm170",
                            "id": "hiacx47",
                            "parent_id": "t1_hiac2q7",
                            "score": 2,
                            "created_utc": 1635363726.0,
                            "replies": [
                                {
                                    "body": "All I was saying was that SBs do invests their time in the meet. 🤷‍♀️",
                                    "author": "anxietyvibes",
                                    "id": "hiad557",
                                    "parent_id": "t1_hiacx47",
                                    "score": 5,
                                    "created_utc": 1635363811.0,
                                    "replies": [
                                        {
                                            "body": "Your original comment says that SBs do not invest their own time in a M&G.  Did you mean to end your first sentence with a ?",
                                            "author": "storm170",
                                            "id": "hiadgxc",
                                            "parent_id": "t1_hiad557",
                                            "score": 4,
                                            "created_utc": 1635363937.0,
                                            "replies": [
                                                {
                                                    "body": "Oops lol. I just realized that. That makes a big difference my bad.",
                                                    "author": "anxietyvibes",
                                                    "id": "hiadvdb",
                                                    "parent_id": "t1_hiadgxc",
                                                    "score": 1,
                                                    "created_utc": 1635364091.0,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "body": "[deleted]",
                                            "author": null,
                                            "id": "hiafqyd",
                                            "parent_id": "t1_hiad557",
                                            "score": 1,
                                            "created_utc": 1635364810.0,
                                            "replies": [
                                                {
                                                    "body": "What does the SD really have to lose though? If what he wants is the company of a beautiful young woman, is that not what he’s getting?",
                                                    "author": "anxietyvibes",
                                                    "id": "hiajrvk",
                                                    "parent_id": "t1_hiafqyd",
                                                    "score": 4,
                                                    "created_utc": 1635366337.0,
                                                    "replies": [
                                                        {
                                                            "body": "Do you really think that anyone is paying a pot SB simply for the benefit of meeting up for a few drinks?\n\nThat is delusional.\n\nAs a divorced man I have plenty of hot young women who I know as platonic friends that I spend time in the company of.  I'm not interested in more friends.",
                                                            "author": "HecatesCats",
                                                            "id": "hiay33j",
                                                            "parent_id": "t1_hiajrvk",
                                                            "score": 6,
                                                            "created_utc": 1635371971.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Do you really think nobody is?.. I think that because I’ve experienced it.. If that’s not the case for you then you’re the exception. I’m not saying every single SD has to pay for the company of a younger woman, some do it for other reasons, but 90% do. Most SDs wouldn’t be in the company of a young beautiful woman who is interested in him otherwise. So yes, they’ll compensate a SB just for her time and attention. I’m not saying they’re paying 1k for dinner and drinks. Or that they’re paying a full allowance for a M&G. Or that they’re having arrangements with no intimacy. But there are SDs who are compensating SBs for M&Gs. Don’t let this forum fool you. 🤷‍♀️",
                                                                    "author": "anxietyvibes",
                                                                    "id": "hiaymqs",
                                                                    "parent_id": "t1_hiay33j",
                                                                    "score": 5,
                                                                    "created_utc": 1635372197.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "hiafhdb",
                            "parent_id": "t1_hiac2q7",
                            "score": -1,
                            "created_utc": 1635364709.0,
                            "replies": [
                                {
                                    "body": "My comment was in reference to u/storm170 saying the SD could be making money during that time.",
                                    "author": "anxietyvibes",
                                    "id": "hiajj6x",
                                    "parent_id": "t1_hiafhdb",
                                    "score": 1,
                                    "created_utc": 1635366246.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "hiaj9mp",
            "parent_id": "t1_hia6k9s",
            "score": 0,
            "created_utc": 1635366145.0,
            "replies": [
                {
                    "body": "It's such a simple concept, but some people love to toss the concept of a mutually beneficial relationship out the window when it comes to them having to put in equal effort.  And then cry about someone trying to take advantage of them for that expectation.",
                    "author": "storm170",
                    "id": "hiavtu6",
                    "parent_id": "t1_hiaj9mp",
                    "score": 1,
                    "created_utc": 1635371045.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I guess you have a point.  If I look at it from an hourly point of view, then maybe an escort would be more expensive... but I highly doubt many escorts would be interested in a long night out... or a few hours of deep/intelligent conversation!",
            "author": "spoilyou255",
            "id": "hia1hkk",
            "parent_id": "t1_hia0fxl",
            "score": -4,
            "created_utc": 1635359293.0,
            "replies": [
                {
                    "body": "If they're getting their hourly rate, of course they would be interested. They would probably love hanging out and chatting vs only having sex.",
                    "author": "MASugarBaby",
                    "id": "hia1lxi",
                    "parent_id": "t1_hia1hkk",
                    "score": 10,
                    "created_utc": 1635359340.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Well I’m an attractive girl and I’m complaining so where do we go from there? Also escorts make wayyy more, don’t be naive",
            "author": "kikienen",
            "id": "hia2kyb",
            "parent_id": "t1_hia1141",
            "score": 9,
            "created_utc": 1635359715.0,
            "replies": [
                {
                    "body": "I didn't say (some) escorts didn't make more. I said escorts were cheaper than sugar babies from the client perspective. You got all sorts of extraneous costs with sugar babies such as dinners and whatnot. You have to see them more often.\n\nIt's not really cheaper.\n\nI don't understand why you're complaining though, it's not going to make anyone pay you more money.",
                    "author": "Substantial-Rice-330",
                    "id": "hia33hp",
                    "parent_id": "t1_hia2kyb",
                    "score": 7,
                    "created_utc": 1635359914.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Sugar babies do both these things.",
            "author": "Substantial-Rice-330",
            "id": "hia3ycx",
            "parent_id": "t1_hia2ub5",
            "score": -4,
            "created_utc": 1635360246.0,
            "replies": [
                {
                    "body": "I’ve never had an SB watch the clock. And a majority don’t want me to use a condom.",
                    "author": "UnearthlyDinosaur",
                    "id": "hiav2z9",
                    "parent_id": "t1_hia3ycx",
                    "score": -2,
                    "created_utc": 1635370745.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Nah it's matter of fact.  \n\nYou're deluded and projecting your own shit onto people.",
            "author": null,
            "id": "hi9yrg9",
            "parent_id": "t1_hi9vp7t",
            "score": 4,
            "created_utc": 1635358245.0,
            "replies": []
        },
        {
            "body": "Literally never. But I know how to read a room. IYKYK. Clearly you do not.",
            "author": "Usedtobesb",
            "id": "hi9wtzr",
            "parent_id": "t1_hi9vxez",
            "score": 2,
            "created_utc": 1635357497.0,
            "replies": []
        },
        {
            "body": "My roomba is charging :/",
            "author": "KPackCorey",
            "id": "hia0di7",
            "parent_id": "t1_hi9zfl3",
            "score": 5,
            "created_utc": 1635358866.0,
            "replies": [
                {
                    "body": "And I got bored watching my paint dry so 🤷🏽‍♀️",
                    "author": "kikienen",
                    "id": "hia2b4q",
                    "parent_id": "t1_hia0di7",
                    "score": 6,
                    "created_utc": 1635359610.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "hiau5qs",
            "parent_id": "t1_hiatn4n",
            "score": 2,
            "created_utc": 1635370375.0,
            "replies": [
                {
                    "body": "Based on her interactions today, I am comfortable saying she cannot.",
                    "author": "storm170",
                    "id": "hiawn4j",
                    "parent_id": "t1_hiau5qs",
                    "score": 3,
                    "created_utc": 1635371377.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Sure sure, we definitely believe you.",
            "author": "storm170",
            "id": "hi9xto9",
            "parent_id": "t1_hi9xr05",
            "score": 2,
            "created_utc": 1635357882.0,
            "replies": []
        },
        {
            "body": "You just love to say things that are incorrect don't you?  Successful SDs have plenty of time to do whatever they want, including providing free education to you on the internet, because we have already made millions.  You'll catch on sooner or later.",
            "author": "storm170",
            "id": "hi9y55h",
            "parent_id": "t1_hi9xwj5",
            "score": 3,
            "created_utc": 1635358005.0,
            "replies": []
        },
        {
            "body": "Successful people have a lot of free time usually ( i have a few friends above 40 million net worth each ) \n\nThey spend more time on social media than you can imagine ,, return texts in 5 minutes 90% of the time,, \n\nWhy would anybody think successful people don't have a lot of free time ??   We make time ,, we make our own schedules mostly ,,",
            "author": "shamloo77",
            "id": "hiafmua",
            "parent_id": "t1_hi9xwj5",
            "score": 3,
            "created_utc": 1635364766.0,
            "replies": []
        },
        {
            "body": "You are thinking what i am thinking now ??🤔",
            "author": "shamloo77",
            "id": "hiajopm",
            "parent_id": "t1_hiaitsq",
            "score": 6,
            "created_utc": 1635366304.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "hiak9ox",
            "parent_id": "t1_hiaitsq",
            "score": -3,
            "created_utc": 1635366522.0,
            "replies": [
                {
                    "body": "It's about time you realized that what you were doing isn't sugaring.  UseRound, what the hell are you talking about \"trying freestyling with your wife?\"  When did she become a freak?  I'm confused because if your wife is into couples, why didn't you talk to her about sugaring earlier? I think you are in self-destruct mode.",
                    "author": "Darknlovely38",
                    "id": "hiazm0u",
                    "parent_id": "t1_hiak9ox",
                    "score": 7,
                    "created_utc": 1635372607.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "> Wow, if you really believe this I'm not sure what kind of SBs you date?\n\nEh.  I mean, I'm not sure why he still bothers sugaring, as unhappy as it seems to make him.\n\nBut - I think his point is valid, if you unpack some of the toxicity around it.  What if I restated it, this way?\n\n> Most people in the world would love to get money for free, for doing nothing.  If they could get paid to go out for a 1-2 hour meal, they most likely would.",
            "author": "SDstartingOut",
            "id": "hiaru9h",
            "parent_id": "t1_hia7sj2",
            "score": 4,
            "created_utc": 1635369456.0,
            "replies": [
                {
                    "body": "Do you give up at every challenge? \n\nI’ve learned lessons from the past and now my experiences are better.  I’m not alone in that many Sds here acknowledge the bad actors in the bowl. But I’ll be the first to say there are honest SBs out there who are great to be with. I have had some very good experiences.",
                    "author": "UnearthlyDinosaur",
                    "id": "hiavknl",
                    "parent_id": "t1_hiaru9h",
                    "score": 0,
                    "created_utc": 1635370942.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Such a good post",
            "author": "wb19081908",
            "id": "hiajkml",
            "parent_id": "t1_hia9bkr",
            "score": 15,
            "created_utc": 1635366261.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "hiafhr9",
            "parent_id": "t1_hia8onz",
            "score": 9,
            "created_utc": 1635364713.0,
            "replies": [
                {
                    "body": "Entertain me on this, if one treats their sugar partners with respect and understands that there are always those who don’t, would one still be triggered by this post calling out the bad ones? Wouldn’t one instead call for their bad peers to do better?",
                    "author": "realitytomydreams",
                    "id": "hiai9gg",
                    "parent_id": "t1_hiafhr9",
                    "score": 11,
                    "created_utc": 1635365766.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "So that's the majority of SDs on this forum, so we can just shoo them right out the door and not have to listen to them ever again?  I fully support this.",
            "author": "storm170",
            "id": "hiabkcz",
            "parent_id": "t1_hia8onz",
            "score": 4,
            "created_utc": 1635363204.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "hia0kxt",
            "parent_id": "t1_hi9yy0n",
            "score": -4,
            "created_utc": 1635358944.0,
            "replies": [
                {
                    "body": "Oof buddy. Woke up on the wrong side of bed didn’t you? Also, you just assumed “y’all” referred to SDs when it’s literally a gender neutral term. \n\nBuddy, someone told me generalizations make you look uneducated and obtuse. So 🤷🏻‍♀️",
                    "author": "realitytomydreams",
                    "id": "hia1ewv",
                    "parent_id": "t1_hia0kxt",
                    "score": 12,
                    "created_utc": 1635359265.0,
                    "replies": [
                        {
                            "body": "I agree Splendid was a bit sensitive, but you posted your comment in a thread that is deliberately attacking SDs on the forum.  While you may have meant for it to be a general comment to everyone, it's placement in this thread gives it a targeted feel.",
                            "author": "storm170",
                            "id": "hia4tqk",
                            "parent_id": "t1_hia1ewv",
                            "score": 3,
                            "created_utc": 1635360588.0,
                            "replies": [
                                {
                                    "body": "This post is NOT attacking real SDs. Let's get it straight",
                                    "author": null,
                                    "id": "hiatq2n",
                                    "parent_id": "t1_hia4tqk",
                                    "score": 4,
                                    "created_utc": 1635370200.0,
                                    "replies": [
                                        {
                                            "body": "Then she should have phrased her title and her post better.  If I described the SBs of SLF as bitter, shrill, man-haters based on what I've seen from the OP I'd be doing a disservice to 90+% of the women who post here.\n\nLet's get that straight.",
                                            "author": "storm170",
                                            "id": "hiau3el",
                                            "parent_id": "t1_hiatq2n",
                                            "score": 5,
                                            "created_utc": 1635370350.0,
                                            "replies": [
                                                {
                                                    "body": "Are you implying OP is bitter and a man hater? No I'm sure she is not. But you missed the point again, that she is making. She is calling out specific men who are not real SDs but think they are. And I 100% agree with everything in her post.",
                                                    "author": null,
                                                    "id": "hiay2qy",
                                                    "parent_id": "t1_hiau3el",
                                                    "score": 1,
                                                    "created_utc": 1635371967.0,
                                                    "replies": [
                                                        {
                                                            "body": "Do you need to take some classes in reading comprehension?  She generalized all the SDs on Reddit in her post, not talking about a few bad actors that might actually line up with her rambling description.  She did this purposefully to create a controversial post, not to call out specific men.  Can you really not see that?  And yes, I've flat out called her a lemon grove already today so those terms definitely fit the OP.\n\nAnd I'm sure you do agree with everything in her post.  That is not surprising, just disappointing.",
                                                            "author": "storm170",
                                                            "id": "hiaymkw",
                                                            "parent_id": "t1_hiay2qy",
                                                            "score": 2,
                                                            "created_utc": 1635372195.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Why do you seem so angry lol Yeah because alot of the guys on here are fake SDs.  sure some are actual real SDs but alot of them aren't. Do you feel personally attacked by her post?",
                                                                    "author": null,
                                                                    "id": "hiazkxr",
                                                                    "parent_id": "t1_hiaymkw",
                                                                    "score": 4,
                                                                    "created_utc": 1635372594.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "You really need to chill",
                    "author": "lipstickdiet",
                    "id": "hia7ilw",
                    "parent_id": "t1_hia0kxt",
                    "score": -4,
                    "created_utc": 1635361638.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I've avoided chiming in previously, but bikini-model/yoga-instructor -hot escorts where I live are generally at \"Splenda\" prices.  Much cheaper than a SB.",
            "author": "LaGriffeDuLion",
            "id": "hia4f2h",
            "parent_id": "t1_hi9zoxb",
            "score": 23,
            "created_utc": 1635360428.0,
            "replies": []
        },
        {
            "body": "Exactly. Where I live escorts are cheaper too.",
            "author": null,
            "id": "hia0dlb",
            "parent_id": "t1_hi9zoxb",
            "score": 11,
            "created_utc": 1635358867.0,
            "replies": []
        },
        {
            "body": "I agree, it's an inane comment meant to disparage the SDs that participate on this forum without any factual basis.  Maybe if we were hiring the escort for 4-5 hours it would be significantly more expensive than a weekly allowance, but that's not what you do with an escort so the comparison is moot.",
            "author": "storm170",
            "id": "hia0a8q",
            "parent_id": "t1_hi9zoxb",
            "score": 7,
            "created_utc": 1635358832.0,
            "replies": []
        },
        {
            "body": "Considering the way you treat your sugar babies I won’t be surprised",
            "author": "kikienen",
            "id": "hia8jx9",
            "parent_id": "t1_hia7zxu",
            "score": -14,
            "created_utc": 1635362045.0,
            "replies": [
                {
                    "body": "You are correct. He’s the guy who sexually assaulted a drunk woman in a dirty service elevator in a so called meet and greet. And then wrote a post to brag about it. Then deleted the post after all the women called him out on the assault.",
                    "author": "SerendipityX8",
                    "id": "hiaht7m",
                    "parent_id": "t1_hia8jx9",
                    "score": 10,
                    "created_utc": 1635365595.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Average Reddit user is also up 7 figures on meme stocks and crypto since 2019. Always makes me feel bad when these guys talk about how rich they are.",
            "author": "Substantial-Rice-330",
            "id": "hiadotw",
            "parent_id": "t1_hiabkde",
            "score": 2,
            "created_utc": 1635364021.0,
            "replies": []
        },
        {
            "body": "The part about Reddit users being studs? That was a joke.\n\nBut in general, younger, better looking guys can get away with more. And men tolerate more bullshit from better looking females.\n\nJust human nature.",
            "author": "Substantial-Rice-330",
            "id": "hiad9za",
            "parent_id": "t1_hia7s89",
            "score": -2,
            "created_utc": 1635363863.0,
            "replies": []
        },
        {
            "body": "I can but I’ve got better things to do, it’s happy hour ☺️",
            "author": "kikienen",
            "id": "hiaw6gf",
            "parent_id": "t1_hiauqf2",
            "score": -4,
            "created_utc": 1635371185.0,
            "replies": [
                {
                    "body": "Sure sure, we definitely believe you.",
                    "author": "storm170",
                    "id": "hiaw8pa",
                    "parent_id": "t1_hiaw6gf",
                    "score": 8,
                    "created_utc": 1635371211.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "He’s trying to mansplain my emotions to me Lmaooo",
            "author": "kikienen",
            "id": "hi9x4oo",
            "parent_id": "t1_hi9vy08",
            "score": 6,
            "created_utc": 1635357612.0,
            "replies": [
                {
                    "body": "Tell me you came here to argue without telling me that you came here to argue.",
                    "author": "Usedtobesb",
                    "id": "hi9yjre",
                    "parent_id": "t1_hi9x4oo",
                    "score": 8,
                    "created_utc": 1635358163.0,
                    "replies": [
                        {
                            "body": "I’m in no way denying that, last time I checked that’s what Reddit is used for mostly",
                            "author": "kikienen",
                            "id": "hi9zos9",
                            "parent_id": "t1_hi9yjre",
                            "score": 5,
                            "created_utc": 1635358603.0,
                            "replies": [
                                {
                                    "body": "I mean I guess I can’t disagree with that. But Tasty might be on point by suggesting that you take a step back. Obviously someone hurt you and you’re here to vent. But it’s crazy to get big mad at the people who offered helpful advice and who btw, weren’t the ones who hurt you.",
                                    "author": "Usedtobesb",
                                    "id": "hia060v",
                                    "parent_id": "t1_hi9zos9",
                                    "score": 11,
                                    "created_utc": 1635358788.0,
                                    "replies": [
                                        {
                                            "body": "Hold up, you mean she shouldn't be screaming into the abyss that is Reddit about something that none of us did or even generally subscribe to?\n\nThat sounds entirely too....mentally healthy.",
                                            "author": "storm170",
                                            "id": "hia269v",
                                            "parent_id": "t1_hia060v",
                                            "score": 8,
                                            "created_utc": 1635359557.0,
                                            "replies": [
                                                {
                                                    "body": "Perhaps she cannot afford a therapist 🤷🏻‍♀️",
                                                    "author": "Usedtobesb",
                                                    "id": "hia495j",
                                                    "parent_id": "t1_hia269v",
                                                    "score": 8,
                                                    "created_utc": 1635360362.0,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "body": "> weren't the ones who hurt you\n\nShe can't hurt the actual people who did this to her though. \n\nAnd how else is she supposed to process her emotions? Not like you can expect her to be an adult or something.",
                                            "author": "KPackCorey",
                                            "id": "hia1sba",
                                            "parent_id": "t1_hia060v",
                                            "score": 1,
                                            "created_utc": 1635359406.0,
                                            "replies": [
                                                {
                                                    "body": "Well don’t give her any ideas 😬🤣",
                                                    "author": "Usedtobesb",
                                                    "id": "hia4fud",
                                                    "parent_id": "t1_hia1sba",
                                                    "score": 6,
                                                    "created_utc": 1635360436.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "SB could be making money during that time too. SD wants her company, SB wants money. SB is providing on her end, I think it’s a good sign when SD is providing on his end from the first M&G too. I don’t require a gift on the first M&G because it would turn off men who have this idea that they’ll be rinsed or whatever, but a lot of men provide a gift regardless and it definitely shows me they’re serious and they appreciate my time.",
            "author": "anxietyvibes",
            "id": "hiac2q7",
            "parent_id": "t1_hia9xhn",
            "score": 3,
            "created_utc": 1635363401.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "hiajtjo",
                    "parent_id": "t1_hiac2q7",
                    "score": 3,
                    "created_utc": 1635366355.0,
                    "replies": [
                        {
                            "body": "Yeah of course he wants more than company, he wants sex too, but he also wants company or he’d go on a date with an escort instead, right? That’s the logic I see SDs on here using. Regardless of a future arrangement, the SD gets a date with a beautiful young woman. This is something I doubt he’d be doing otherwise, because most men aren’t going to pay for an arrangement when they could get it for free. What does the SB get?",
                            "author": "anxietyvibes",
                            "id": "hiakryy",
                            "parent_id": "t1_hiajtjo",
                            "score": 3,
                            "created_utc": 1635366714.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "I always provide a gift, as do the majority of the SDs on this forum.  We simply don't meet with SBs that charge a fee for a M&G (requiring it makes it not a gift).  You are welcome to discriminate against POTs that don't provide something at the M&G if you want, that's not what the OP is whining about or implying by the comment she has since edited from her post.\n\nAnd of course SBs could be making money during that time too, SDs just have a far greater opportunity to make more based on them being a SD in the first place.",
                    "author": "storm170",
                    "id": "hiacx47",
                    "parent_id": "t1_hiac2q7",
                    "score": 2,
                    "created_utc": 1635363726.0,
                    "replies": [
                        {
                            "body": "All I was saying was that SBs do invests their time in the meet. 🤷‍♀️",
                            "author": "anxietyvibes",
                            "id": "hiad557",
                            "parent_id": "t1_hiacx47",
                            "score": 5,
                            "created_utc": 1635363811.0,
                            "replies": [
                                {
                                    "body": "Your original comment says that SBs do not invest their own time in a M&G.  Did you mean to end your first sentence with a ?",
                                    "author": "storm170",
                                    "id": "hiadgxc",
                                    "parent_id": "t1_hiad557",
                                    "score": 4,
                                    "created_utc": 1635363937.0,
                                    "replies": [
                                        {
                                            "body": "Oops lol. I just realized that. That makes a big difference my bad.",
                                            "author": "anxietyvibes",
                                            "id": "hiadvdb",
                                            "parent_id": "t1_hiadgxc",
                                            "score": 1,
                                            "created_utc": 1635364091.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "hiafqyd",
                                    "parent_id": "t1_hiad557",
                                    "score": 1,
                                    "created_utc": 1635364810.0,
                                    "replies": [
                                        {
                                            "body": "What does the SD really have to lose though? If what he wants is the company of a beautiful young woman, is that not what he’s getting?",
                                            "author": "anxietyvibes",
                                            "id": "hiajrvk",
                                            "parent_id": "t1_hiafqyd",
                                            "score": 4,
                                            "created_utc": 1635366337.0,
                                            "replies": [
                                                {
                                                    "body": "Do you really think that anyone is paying a pot SB simply for the benefit of meeting up for a few drinks?\n\nThat is delusional.\n\nAs a divorced man I have plenty of hot young women who I know as platonic friends that I spend time in the company of.  I'm not interested in more friends.",
                                                    "author": "HecatesCats",
                                                    "id": "hiay33j",
                                                    "parent_id": "t1_hiajrvk",
                                                    "score": 6,
                                                    "created_utc": 1635371971.0,
                                                    "replies": [
                                                        {
                                                            "body": "Do you really think nobody is?.. I think that because I’ve experienced it.. If that’s not the case for you then you’re the exception. I’m not saying every single SD has to pay for the company of a younger woman, some do it for other reasons, but 90% do. Most SDs wouldn’t be in the company of a young beautiful woman who is interested in him otherwise. So yes, they’ll compensate a SB just for her time and attention. I’m not saying they’re paying 1k for dinner and drinks. Or that they’re paying a full allowance for a M&G. Or that they’re having arrangements with no intimacy. But there are SDs who are compensating SBs for M&Gs. Don’t let this forum fool you. 🤷‍♀️",
                                                            "author": "anxietyvibes",
                                                            "id": "hiaymqs",
                                                            "parent_id": "t1_hiay33j",
                                                            "score": 5,
                                                            "created_utc": 1635372197.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "hiafhdb",
                    "parent_id": "t1_hiac2q7",
                    "score": -1,
                    "created_utc": 1635364709.0,
                    "replies": [
                        {
                            "body": "My comment was in reference to u/storm170 saying the SD could be making money during that time.",
                            "author": "anxietyvibes",
                            "id": "hiajj6x",
                            "parent_id": "t1_hiafhdb",
                            "score": 1,
                            "created_utc": 1635366246.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "It's such a simple concept, but some people love to toss the concept of a mutually beneficial relationship out the window when it comes to them having to put in equal effort.  And then cry about someone trying to take advantage of them for that expectation.",
            "author": "storm170",
            "id": "hiavtu6",
            "parent_id": "t1_hiaj9mp",
            "score": 1,
            "created_utc": 1635371045.0,
            "replies": []
        },
        {
            "body": "If they're getting their hourly rate, of course they would be interested. They would probably love hanging out and chatting vs only having sex.",
            "author": "MASugarBaby",
            "id": "hia1lxi",
            "parent_id": "t1_hia1hkk",
            "score": 10,
            "created_utc": 1635359340.0,
            "replies": []
        },
        {
            "body": "I didn't say (some) escorts didn't make more. I said escorts were cheaper than sugar babies from the client perspective. You got all sorts of extraneous costs with sugar babies such as dinners and whatnot. You have to see them more often.\n\nIt's not really cheaper.\n\nI don't understand why you're complaining though, it's not going to make anyone pay you more money.",
            "author": "Substantial-Rice-330",
            "id": "hia33hp",
            "parent_id": "t1_hia2kyb",
            "score": 7,
            "created_utc": 1635359914.0,
            "replies": []
        },
        {
            "body": "I’ve never had an SB watch the clock. And a majority don’t want me to use a condom.",
            "author": "UnearthlyDinosaur",
            "id": "hiav2z9",
            "parent_id": "t1_hia3ycx",
            "score": -2,
            "created_utc": 1635370745.0,
            "replies": []
        },
        {
            "body": "And I got bored watching my paint dry so 🤷🏽‍♀️",
            "author": "kikienen",
            "id": "hia2b4q",
            "parent_id": "t1_hia0di7",
            "score": 6,
            "created_utc": 1635359610.0,
            "replies": []
        },
        {
            "body": "Based on her interactions today, I am comfortable saying she cannot.",
            "author": "storm170",
            "id": "hiawn4j",
            "parent_id": "t1_hiau5qs",
            "score": 3,
            "created_utc": 1635371377.0,
            "replies": []
        },
        {
            "body": "It's about time you realized that what you were doing isn't sugaring.  UseRound, what the hell are you talking about \"trying freestyling with your wife?\"  When did she become a freak?  I'm confused because if your wife is into couples, why didn't you talk to her about sugaring earlier? I think you are in self-destruct mode.",
            "author": "Darknlovely38",
            "id": "hiazm0u",
            "parent_id": "t1_hiak9ox",
            "score": 7,
            "created_utc": 1635372607.0,
            "replies": []
        },
        {
            "body": "Do you give up at every challenge? \n\nI’ve learned lessons from the past and now my experiences are better.  I’m not alone in that many Sds here acknowledge the bad actors in the bowl. But I’ll be the first to say there are honest SBs out there who are great to be with. I have had some very good experiences.",
            "author": "UnearthlyDinosaur",
            "id": "hiavknl",
            "parent_id": "t1_hiaru9h",
            "score": 0,
            "created_utc": 1635370942.0,
            "replies": []
        },
        {
            "body": "Entertain me on this, if one treats their sugar partners with respect and understands that there are always those who don’t, would one still be triggered by this post calling out the bad ones? Wouldn’t one instead call for their bad peers to do better?",
            "author": "realitytomydreams",
            "id": "hiai9gg",
            "parent_id": "t1_hiafhr9",
            "score": 11,
            "created_utc": 1635365766.0,
            "replies": []
        },
        {
            "body": "Oof buddy. Woke up on the wrong side of bed didn’t you? Also, you just assumed “y’all” referred to SDs when it’s literally a gender neutral term. \n\nBuddy, someone told me generalizations make you look uneducated and obtuse. So 🤷🏻‍♀️",
            "author": "realitytomydreams",
            "id": "hia1ewv",
            "parent_id": "t1_hia0kxt",
            "score": 12,
            "created_utc": 1635359265.0,
            "replies": [
                {
                    "body": "I agree Splendid was a bit sensitive, but you posted your comment in a thread that is deliberately attacking SDs on the forum.  While you may have meant for it to be a general comment to everyone, it's placement in this thread gives it a targeted feel.",
                    "author": "storm170",
                    "id": "hia4tqk",
                    "parent_id": "t1_hia1ewv",
                    "score": 3,
                    "created_utc": 1635360588.0,
                    "replies": [
                        {
                            "body": "This post is NOT attacking real SDs. Let's get it straight",
                            "author": null,
                            "id": "hiatq2n",
                            "parent_id": "t1_hia4tqk",
                            "score": 4,
                            "created_utc": 1635370200.0,
                            "replies": [
                                {
                                    "body": "Then she should have phrased her title and her post better.  If I described the SBs of SLF as bitter, shrill, man-haters based on what I've seen from the OP I'd be doing a disservice to 90+% of the women who post here.\n\nLet's get that straight.",
                                    "author": "storm170",
                                    "id": "hiau3el",
                                    "parent_id": "t1_hiatq2n",
                                    "score": 5,
                                    "created_utc": 1635370350.0,
                                    "replies": [
                                        {
                                            "body": "Are you implying OP is bitter and a man hater? No I'm sure she is not. But you missed the point again, that she is making. She is calling out specific men who are not real SDs but think they are. And I 100% agree with everything in her post.",
                                            "author": null,
                                            "id": "hiay2qy",
                                            "parent_id": "t1_hiau3el",
                                            "score": 1,
                                            "created_utc": 1635371967.0,
                                            "replies": [
                                                {
                                                    "body": "Do you need to take some classes in reading comprehension?  She generalized all the SDs on Reddit in her post, not talking about a few bad actors that might actually line up with her rambling description.  She did this purposefully to create a controversial post, not to call out specific men.  Can you really not see that?  And yes, I've flat out called her a lemon grove already today so those terms definitely fit the OP.\n\nAnd I'm sure you do agree with everything in her post.  That is not surprising, just disappointing.",
                                                    "author": "storm170",
                                                    "id": "hiaymkw",
                                                    "parent_id": "t1_hiay2qy",
                                                    "score": 2,
                                                    "created_utc": 1635372195.0,
                                                    "replies": [
                                                        {
                                                            "body": "Why do you seem so angry lol Yeah because alot of the guys on here are fake SDs.  sure some are actual real SDs but alot of them aren't. Do you feel personally attacked by her post?",
                                                            "author": null,
                                                            "id": "hiazkxr",
                                                            "parent_id": "t1_hiaymkw",
                                                            "score": 4,
                                                            "created_utc": 1635372594.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "You really need to chill",
            "author": "lipstickdiet",
            "id": "hia7ilw",
            "parent_id": "t1_hia0kxt",
            "score": -4,
            "created_utc": 1635361638.0,
            "replies": []
        },
        {
            "body": "You are correct. He’s the guy who sexually assaulted a drunk woman in a dirty service elevator in a so called meet and greet. And then wrote a post to brag about it. Then deleted the post after all the women called him out on the assault.",
            "author": "SerendipityX8",
            "id": "hiaht7m",
            "parent_id": "t1_hia8jx9",
            "score": 10,
            "created_utc": 1635365595.0,
            "replies": []
        },
        {
            "body": "Sure sure, we definitely believe you.",
            "author": "storm170",
            "id": "hiaw8pa",
            "parent_id": "t1_hiaw6gf",
            "score": 8,
            "created_utc": 1635371211.0,
            "replies": []
        },
        {
            "body": "Tell me you came here to argue without telling me that you came here to argue.",
            "author": "Usedtobesb",
            "id": "hi9yjre",
            "parent_id": "t1_hi9x4oo",
            "score": 8,
            "created_utc": 1635358163.0,
            "replies": [
                {
                    "body": "I’m in no way denying that, last time I checked that’s what Reddit is used for mostly",
                    "author": "kikienen",
                    "id": "hi9zos9",
                    "parent_id": "t1_hi9yjre",
                    "score": 5,
                    "created_utc": 1635358603.0,
                    "replies": [
                        {
                            "body": "I mean I guess I can’t disagree with that. But Tasty might be on point by suggesting that you take a step back. Obviously someone hurt you and you’re here to vent. But it’s crazy to get big mad at the people who offered helpful advice and who btw, weren’t the ones who hurt you.",
                            "author": "Usedtobesb",
                            "id": "hia060v",
                            "parent_id": "t1_hi9zos9",
                            "score": 11,
                            "created_utc": 1635358788.0,
                            "replies": [
                                {
                                    "body": "Hold up, you mean she shouldn't be screaming into the abyss that is Reddit about something that none of us did or even generally subscribe to?\n\nThat sounds entirely too....mentally healthy.",
                                    "author": "storm170",
                                    "id": "hia269v",
                                    "parent_id": "t1_hia060v",
                                    "score": 8,
                                    "created_utc": 1635359557.0,
                                    "replies": [
                                        {
                                            "body": "Perhaps she cannot afford a therapist 🤷🏻‍♀️",
                                            "author": "Usedtobesb",
                                            "id": "hia495j",
                                            "parent_id": "t1_hia269v",
                                            "score": 8,
                                            "created_utc": 1635360362.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "> weren't the ones who hurt you\n\nShe can't hurt the actual people who did this to her though. \n\nAnd how else is she supposed to process her emotions? Not like you can expect her to be an adult or something.",
                                    "author": "KPackCorey",
                                    "id": "hia1sba",
                                    "parent_id": "t1_hia060v",
                                    "score": 1,
                                    "created_utc": 1635359406.0,
                                    "replies": [
                                        {
                                            "body": "Well don’t give her any ideas 😬🤣",
                                            "author": "Usedtobesb",
                                            "id": "hia4fud",
                                            "parent_id": "t1_hia1sba",
                                            "score": 6,
                                            "created_utc": 1635360436.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "hiajtjo",
            "parent_id": "t1_hiac2q7",
            "score": 3,
            "created_utc": 1635366355.0,
            "replies": [
                {
                    "body": "Yeah of course he wants more than company, he wants sex too, but he also wants company or he’d go on a date with an escort instead, right? That’s the logic I see SDs on here using. Regardless of a future arrangement, the SD gets a date with a beautiful young woman. This is something I doubt he’d be doing otherwise, because most men aren’t going to pay for an arrangement when they could get it for free. What does the SB get?",
                    "author": "anxietyvibes",
                    "id": "hiakryy",
                    "parent_id": "t1_hiajtjo",
                    "score": 3,
                    "created_utc": 1635366714.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I always provide a gift, as do the majority of the SDs on this forum.  We simply don't meet with SBs that charge a fee for a M&G (requiring it makes it not a gift).  You are welcome to discriminate against POTs that don't provide something at the M&G if you want, that's not what the OP is whining about or implying by the comment she has since edited from her post.\n\nAnd of course SBs could be making money during that time too, SDs just have a far greater opportunity to make more based on them being a SD in the first place.",
            "author": "storm170",
            "id": "hiacx47",
            "parent_id": "t1_hiac2q7",
            "score": 2,
            "created_utc": 1635363726.0,
            "replies": [
                {
                    "body": "All I was saying was that SBs do invests their time in the meet. 🤷‍♀️",
                    "author": "anxietyvibes",
                    "id": "hiad557",
                    "parent_id": "t1_hiacx47",
                    "score": 5,
                    "created_utc": 1635363811.0,
                    "replies": [
                        {
                            "body": "Your original comment says that SBs do not invest their own time in a M&G.  Did you mean to end your first sentence with a ?",
                            "author": "storm170",
                            "id": "hiadgxc",
                            "parent_id": "t1_hiad557",
                            "score": 4,
                            "created_utc": 1635363937.0,
                            "replies": [
                                {
                                    "body": "Oops lol. I just realized that. That makes a big difference my bad.",
                                    "author": "anxietyvibes",
                                    "id": "hiadvdb",
                                    "parent_id": "t1_hiadgxc",
                                    "score": 1,
                                    "created_utc": 1635364091.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "hiafqyd",
                            "parent_id": "t1_hiad557",
                            "score": 1,
                            "created_utc": 1635364810.0,
                            "replies": [
                                {
                                    "body": "What does the SD really have to lose though? If what he wants is the company of a beautiful young woman, is that not what he’s getting?",
                                    "author": "anxietyvibes",
                                    "id": "hiajrvk",
                                    "parent_id": "t1_hiafqyd",
                                    "score": 4,
                                    "created_utc": 1635366337.0,
                                    "replies": [
                                        {
                                            "body": "Do you really think that anyone is paying a pot SB simply for the benefit of meeting up for a few drinks?\n\nThat is delusional.\n\nAs a divorced man I have plenty of hot young women who I know as platonic friends that I spend time in the company of.  I'm not interested in more friends.",
                                            "author": "HecatesCats",
                                            "id": "hiay33j",
                                            "parent_id": "t1_hiajrvk",
                                            "score": 6,
                                            "created_utc": 1635371971.0,
                                            "replies": [
                                                {
                                                    "body": "Do you really think nobody is?.. I think that because I’ve experienced it.. If that’s not the case for you then you’re the exception. I’m not saying every single SD has to pay for the company of a younger woman, some do it for other reasons, but 90% do. Most SDs wouldn’t be in the company of a young beautiful woman who is interested in him otherwise. So yes, they’ll compensate a SB just for her time and attention. I’m not saying they’re paying 1k for dinner and drinks. Or that they’re paying a full allowance for a M&G. Or that they’re having arrangements with no intimacy. But there are SDs who are compensating SBs for M&Gs. Don’t let this forum fool you. 🤷‍♀️",
                                                    "author": "anxietyvibes",
                                                    "id": "hiaymqs",
                                                    "parent_id": "t1_hiay33j",
                                                    "score": 5,
                                                    "created_utc": 1635372197.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "hiafhdb",
            "parent_id": "t1_hiac2q7",
            "score": -1,
            "created_utc": 1635364709.0,
            "replies": [
                {
                    "body": "My comment was in reference to u/storm170 saying the SD could be making money during that time.",
                    "author": "anxietyvibes",
                    "id": "hiajj6x",
                    "parent_id": "t1_hiafhdb",
                    "score": 1,
                    "created_utc": 1635366246.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I agree Splendid was a bit sensitive, but you posted your comment in a thread that is deliberately attacking SDs on the forum.  While you may have meant for it to be a general comment to everyone, it's placement in this thread gives it a targeted feel.",
            "author": "storm170",
            "id": "hia4tqk",
            "parent_id": "t1_hia1ewv",
            "score": 3,
            "created_utc": 1635360588.0,
            "replies": [
                {
                    "body": "This post is NOT attacking real SDs. Let's get it straight",
                    "author": null,
                    "id": "hiatq2n",
                    "parent_id": "t1_hia4tqk",
                    "score": 4,
                    "created_utc": 1635370200.0,
                    "replies": [
                        {
                            "body": "Then she should have phrased her title and her post better.  If I described the SBs of SLF as bitter, shrill, man-haters based on what I've seen from the OP I'd be doing a disservice to 90+% of the women who post here.\n\nLet's get that straight.",
                            "author": "storm170",
                            "id": "hiau3el",
                            "parent_id": "t1_hiatq2n",
                            "score": 5,
                            "created_utc": 1635370350.0,
                            "replies": [
                                {
                                    "body": "Are you implying OP is bitter and a man hater? No I'm sure she is not. But you missed the point again, that she is making. She is calling out specific men who are not real SDs but think they are. And I 100% agree with everything in her post.",
                                    "author": null,
                                    "id": "hiay2qy",
                                    "parent_id": "t1_hiau3el",
                                    "score": 1,
                                    "created_utc": 1635371967.0,
                                    "replies": [
                                        {
                                            "body": "Do you need to take some classes in reading comprehension?  She generalized all the SDs on Reddit in her post, not talking about a few bad actors that might actually line up with her rambling description.  She did this purposefully to create a controversial post, not to call out specific men.  Can you really not see that?  And yes, I've flat out called her a lemon grove already today so those terms definitely fit the OP.\n\nAnd I'm sure you do agree with everything in her post.  That is not surprising, just disappointing.",
                                            "author": "storm170",
                                            "id": "hiaymkw",
                                            "parent_id": "t1_hiay2qy",
                                            "score": 2,
                                            "created_utc": 1635372195.0,
                                            "replies": [
                                                {
                                                    "body": "Why do you seem so angry lol Yeah because alot of the guys on here are fake SDs.  sure some are actual real SDs but alot of them aren't. Do you feel personally attacked by her post?",
                                                    "author": null,
                                                    "id": "hiazkxr",
                                                    "parent_id": "t1_hiaymkw",
                                                    "score": 4,
                                                    "created_utc": 1635372594.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I’m in no way denying that, last time I checked that’s what Reddit is used for mostly",
            "author": "kikienen",
            "id": "hi9zos9",
            "parent_id": "t1_hi9yjre",
            "score": 5,
            "created_utc": 1635358603.0,
            "replies": [
                {
                    "body": "I mean I guess I can’t disagree with that. But Tasty might be on point by suggesting that you take a step back. Obviously someone hurt you and you’re here to vent. But it’s crazy to get big mad at the people who offered helpful advice and who btw, weren’t the ones who hurt you.",
                    "author": "Usedtobesb",
                    "id": "hia060v",
                    "parent_id": "t1_hi9zos9",
                    "score": 11,
                    "created_utc": 1635358788.0,
                    "replies": [
                        {
                            "body": "Hold up, you mean she shouldn't be screaming into the abyss that is Reddit about something that none of us did or even generally subscribe to?\n\nThat sounds entirely too....mentally healthy.",
                            "author": "storm170",
                            "id": "hia269v",
                            "parent_id": "t1_hia060v",
                            "score": 8,
                            "created_utc": 1635359557.0,
                            "replies": [
                                {
                                    "body": "Perhaps she cannot afford a therapist 🤷🏻‍♀️",
                                    "author": "Usedtobesb",
                                    "id": "hia495j",
                                    "parent_id": "t1_hia269v",
                                    "score": 8,
                                    "created_utc": 1635360362.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "> weren't the ones who hurt you\n\nShe can't hurt the actual people who did this to her though. \n\nAnd how else is she supposed to process her emotions? Not like you can expect her to be an adult or something.",
                            "author": "KPackCorey",
                            "id": "hia1sba",
                            "parent_id": "t1_hia060v",
                            "score": 1,
                            "created_utc": 1635359406.0,
                            "replies": [
                                {
                                    "body": "Well don’t give her any ideas 😬🤣",
                                    "author": "Usedtobesb",
                                    "id": "hia4fud",
                                    "parent_id": "t1_hia1sba",
                                    "score": 6,
                                    "created_utc": 1635360436.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Yeah of course he wants more than company, he wants sex too, but he also wants company or he’d go on a date with an escort instead, right? That’s the logic I see SDs on here using. Regardless of a future arrangement, the SD gets a date with a beautiful young woman. This is something I doubt he’d be doing otherwise, because most men aren’t going to pay for an arrangement when they could get it for free. What does the SB get?",
            "author": "anxietyvibes",
            "id": "hiakryy",
            "parent_id": "t1_hiajtjo",
            "score": 3,
            "created_utc": 1635366714.0,
            "replies": []
        },
        {
            "body": "All I was saying was that SBs do invests their time in the meet. 🤷‍♀️",
            "author": "anxietyvibes",
            "id": "hiad557",
            "parent_id": "t1_hiacx47",
            "score": 5,
            "created_utc": 1635363811.0,
            "replies": [
                {
                    "body": "Your original comment says that SBs do not invest their own time in a M&G.  Did you mean to end your first sentence with a ?",
                    "author": "storm170",
                    "id": "hiadgxc",
                    "parent_id": "t1_hiad557",
                    "score": 4,
                    "created_utc": 1635363937.0,
                    "replies": [
                        {
                            "body": "Oops lol. I just realized that. That makes a big difference my bad.",
                            "author": "anxietyvibes",
                            "id": "hiadvdb",
                            "parent_id": "t1_hiadgxc",
                            "score": 1,
                            "created_utc": 1635364091.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "hiafqyd",
                    "parent_id": "t1_hiad557",
                    "score": 1,
                    "created_utc": 1635364810.0,
                    "replies": [
                        {
                            "body": "What does the SD really have to lose though? If what he wants is the company of a beautiful young woman, is that not what he’s getting?",
                            "author": "anxietyvibes",
                            "id": "hiajrvk",
                            "parent_id": "t1_hiafqyd",
                            "score": 4,
                            "created_utc": 1635366337.0,
                            "replies": [
                                {
                                    "body": "Do you really think that anyone is paying a pot SB simply for the benefit of meeting up for a few drinks?\n\nThat is delusional.\n\nAs a divorced man I have plenty of hot young women who I know as platonic friends that I spend time in the company of.  I'm not interested in more friends.",
                                    "author": "HecatesCats",
                                    "id": "hiay33j",
                                    "parent_id": "t1_hiajrvk",
                                    "score": 6,
                                    "created_utc": 1635371971.0,
                                    "replies": [
                                        {
                                            "body": "Do you really think nobody is?.. I think that because I’ve experienced it.. If that’s not the case for you then you’re the exception. I’m not saying every single SD has to pay for the company of a younger woman, some do it for other reasons, but 90% do. Most SDs wouldn’t be in the company of a young beautiful woman who is interested in him otherwise. So yes, they’ll compensate a SB just for her time and attention. I’m not saying they’re paying 1k for dinner and drinks. Or that they’re paying a full allowance for a M&G. Or that they’re having arrangements with no intimacy. But there are SDs who are compensating SBs for M&Gs. Don’t let this forum fool you. 🤷‍♀️",
                                            "author": "anxietyvibes",
                                            "id": "hiaymqs",
                                            "parent_id": "t1_hiay33j",
                                            "score": 5,
                                            "created_utc": 1635372197.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "My comment was in reference to u/storm170 saying the SD could be making money during that time.",
            "author": "anxietyvibes",
            "id": "hiajj6x",
            "parent_id": "t1_hiafhdb",
            "score": 1,
            "created_utc": 1635366246.0,
            "replies": []
        },
        {
            "body": "This post is NOT attacking real SDs. Let's get it straight",
            "author": null,
            "id": "hiatq2n",
            "parent_id": "t1_hia4tqk",
            "score": 4,
            "created_utc": 1635370200.0,
            "replies": [
                {
                    "body": "Then she should have phrased her title and her post better.  If I described the SBs of SLF as bitter, shrill, man-haters based on what I've seen from the OP I'd be doing a disservice to 90+% of the women who post here.\n\nLet's get that straight.",
                    "author": "storm170",
                    "id": "hiau3el",
                    "parent_id": "t1_hiatq2n",
                    "score": 5,
                    "created_utc": 1635370350.0,
                    "replies": [
                        {
                            "body": "Are you implying OP is bitter and a man hater? No I'm sure she is not. But you missed the point again, that she is making. She is calling out specific men who are not real SDs but think they are. And I 100% agree with everything in her post.",
                            "author": null,
                            "id": "hiay2qy",
                            "parent_id": "t1_hiau3el",
                            "score": 1,
                            "created_utc": 1635371967.0,
                            "replies": [
                                {
                                    "body": "Do you need to take some classes in reading comprehension?  She generalized all the SDs on Reddit in her post, not talking about a few bad actors that might actually line up with her rambling description.  She did this purposefully to create a controversial post, not to call out specific men.  Can you really not see that?  And yes, I've flat out called her a lemon grove already today so those terms definitely fit the OP.\n\nAnd I'm sure you do agree with everything in her post.  That is not surprising, just disappointing.",
                                    "author": "storm170",
                                    "id": "hiaymkw",
                                    "parent_id": "t1_hiay2qy",
                                    "score": 2,
                                    "created_utc": 1635372195.0,
                                    "replies": [
                                        {
                                            "body": "Why do you seem so angry lol Yeah because alot of the guys on here are fake SDs.  sure some are actual real SDs but alot of them aren't. Do you feel personally attacked by her post?",
                                            "author": null,
                                            "id": "hiazkxr",
                                            "parent_id": "t1_hiaymkw",
                                            "score": 4,
                                            "created_utc": 1635372594.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I mean I guess I can’t disagree with that. But Tasty might be on point by suggesting that you take a step back. Obviously someone hurt you and you’re here to vent. But it’s crazy to get big mad at the people who offered helpful advice and who btw, weren’t the ones who hurt you.",
            "author": "Usedtobesb",
            "id": "hia060v",
            "parent_id": "t1_hi9zos9",
            "score": 11,
            "created_utc": 1635358788.0,
            "replies": [
                {
                    "body": "Hold up, you mean she shouldn't be screaming into the abyss that is Reddit about something that none of us did or even generally subscribe to?\n\nThat sounds entirely too....mentally healthy.",
                    "author": "storm170",
                    "id": "hia269v",
                    "parent_id": "t1_hia060v",
                    "score": 8,
                    "created_utc": 1635359557.0,
                    "replies": [
                        {
                            "body": "Perhaps she cannot afford a therapist 🤷🏻‍♀️",
                            "author": "Usedtobesb",
                            "id": "hia495j",
                            "parent_id": "t1_hia269v",
                            "score": 8,
                            "created_utc": 1635360362.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "> weren't the ones who hurt you\n\nShe can't hurt the actual people who did this to her though. \n\nAnd how else is she supposed to process her emotions? Not like you can expect her to be an adult or something.",
                    "author": "KPackCorey",
                    "id": "hia1sba",
                    "parent_id": "t1_hia060v",
                    "score": 1,
                    "created_utc": 1635359406.0,
                    "replies": [
                        {
                            "body": "Well don’t give her any ideas 😬🤣",
                            "author": "Usedtobesb",
                            "id": "hia4fud",
                            "parent_id": "t1_hia1sba",
                            "score": 6,
                            "created_utc": 1635360436.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Your original comment says that SBs do not invest their own time in a M&G.  Did you mean to end your first sentence with a ?",
            "author": "storm170",
            "id": "hiadgxc",
            "parent_id": "t1_hiad557",
            "score": 4,
            "created_utc": 1635363937.0,
            "replies": [
                {
                    "body": "Oops lol. I just realized that. That makes a big difference my bad.",
                    "author": "anxietyvibes",
                    "id": "hiadvdb",
                    "parent_id": "t1_hiadgxc",
                    "score": 1,
                    "created_utc": 1635364091.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "hiafqyd",
            "parent_id": "t1_hiad557",
            "score": 1,
            "created_utc": 1635364810.0,
            "replies": [
                {
                    "body": "What does the SD really have to lose though? If what he wants is the company of a beautiful young woman, is that not what he’s getting?",
                    "author": "anxietyvibes",
                    "id": "hiajrvk",
                    "parent_id": "t1_hiafqyd",
                    "score": 4,
                    "created_utc": 1635366337.0,
                    "replies": [
                        {
                            "body": "Do you really think that anyone is paying a pot SB simply for the benefit of meeting up for a few drinks?\n\nThat is delusional.\n\nAs a divorced man I have plenty of hot young women who I know as platonic friends that I spend time in the company of.  I'm not interested in more friends.",
                            "author": "HecatesCats",
                            "id": "hiay33j",
                            "parent_id": "t1_hiajrvk",
                            "score": 6,
                            "created_utc": 1635371971.0,
                            "replies": [
                                {
                                    "body": "Do you really think nobody is?.. I think that because I’ve experienced it.. If that’s not the case for you then you’re the exception. I’m not saying every single SD has to pay for the company of a younger woman, some do it for other reasons, but 90% do. Most SDs wouldn’t be in the company of a young beautiful woman who is interested in him otherwise. So yes, they’ll compensate a SB just for her time and attention. I’m not saying they’re paying 1k for dinner and drinks. Or that they’re paying a full allowance for a M&G. Or that they’re having arrangements with no intimacy. But there are SDs who are compensating SBs for M&Gs. Don’t let this forum fool you. 🤷‍♀️",
                                    "author": "anxietyvibes",
                                    "id": "hiaymqs",
                                    "parent_id": "t1_hiay33j",
                                    "score": 5,
                                    "created_utc": 1635372197.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Then she should have phrased her title and her post better.  If I described the SBs of SLF as bitter, shrill, man-haters based on what I've seen from the OP I'd be doing a disservice to 90+% of the women who post here.\n\nLet's get that straight.",
            "author": "storm170",
            "id": "hiau3el",
            "parent_id": "t1_hiatq2n",
            "score": 5,
            "created_utc": 1635370350.0,
            "replies": [
                {
                    "body": "Are you implying OP is bitter and a man hater? No I'm sure she is not. But you missed the point again, that she is making. She is calling out specific men who are not real SDs but think they are. And I 100% agree with everything in her post.",
                    "author": null,
                    "id": "hiay2qy",
                    "parent_id": "t1_hiau3el",
                    "score": 1,
                    "created_utc": 1635371967.0,
                    "replies": [
                        {
                            "body": "Do you need to take some classes in reading comprehension?  She generalized all the SDs on Reddit in her post, not talking about a few bad actors that might actually line up with her rambling description.  She did this purposefully to create a controversial post, not to call out specific men.  Can you really not see that?  And yes, I've flat out called her a lemon grove already today so those terms definitely fit the OP.\n\nAnd I'm sure you do agree with everything in her post.  That is not surprising, just disappointing.",
                            "author": "storm170",
                            "id": "hiaymkw",
                            "parent_id": "t1_hiay2qy",
                            "score": 2,
                            "created_utc": 1635372195.0,
                            "replies": [
                                {
                                    "body": "Why do you seem so angry lol Yeah because alot of the guys on here are fake SDs.  sure some are actual real SDs but alot of them aren't. Do you feel personally attacked by her post?",
                                    "author": null,
                                    "id": "hiazkxr",
                                    "parent_id": "t1_hiaymkw",
                                    "score": 4,
                                    "created_utc": 1635372594.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Hold up, you mean she shouldn't be screaming into the abyss that is Reddit about something that none of us did or even generally subscribe to?\n\nThat sounds entirely too....mentally healthy.",
            "author": "storm170",
            "id": "hia269v",
            "parent_id": "t1_hia060v",
            "score": 8,
            "created_utc": 1635359557.0,
            "replies": [
                {
                    "body": "Perhaps she cannot afford a therapist 🤷🏻‍♀️",
                    "author": "Usedtobesb",
                    "id": "hia495j",
                    "parent_id": "t1_hia269v",
                    "score": 8,
                    "created_utc": 1635360362.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "> weren't the ones who hurt you\n\nShe can't hurt the actual people who did this to her though. \n\nAnd how else is she supposed to process her emotions? Not like you can expect her to be an adult or something.",
            "author": "KPackCorey",
            "id": "hia1sba",
            "parent_id": "t1_hia060v",
            "score": 1,
            "created_utc": 1635359406.0,
            "replies": [
                {
                    "body": "Well don’t give her any ideas 😬🤣",
                    "author": "Usedtobesb",
                    "id": "hia4fud",
                    "parent_id": "t1_hia1sba",
                    "score": 6,
                    "created_utc": 1635360436.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Oops lol. I just realized that. That makes a big difference my bad.",
            "author": "anxietyvibes",
            "id": "hiadvdb",
            "parent_id": "t1_hiadgxc",
            "score": 1,
            "created_utc": 1635364091.0,
            "replies": []
        },
        {
            "body": "What does the SD really have to lose though? If what he wants is the company of a beautiful young woman, is that not what he’s getting?",
            "author": "anxietyvibes",
            "id": "hiajrvk",
            "parent_id": "t1_hiafqyd",
            "score": 4,
            "created_utc": 1635366337.0,
            "replies": [
                {
                    "body": "Do you really think that anyone is paying a pot SB simply for the benefit of meeting up for a few drinks?\n\nThat is delusional.\n\nAs a divorced man I have plenty of hot young women who I know as platonic friends that I spend time in the company of.  I'm not interested in more friends.",
                    "author": "HecatesCats",
                    "id": "hiay33j",
                    "parent_id": "t1_hiajrvk",
                    "score": 6,
                    "created_utc": 1635371971.0,
                    "replies": [
                        {
                            "body": "Do you really think nobody is?.. I think that because I’ve experienced it.. If that’s not the case for you then you’re the exception. I’m not saying every single SD has to pay for the company of a younger woman, some do it for other reasons, but 90% do. Most SDs wouldn’t be in the company of a young beautiful woman who is interested in him otherwise. So yes, they’ll compensate a SB just for her time and attention. I’m not saying they’re paying 1k for dinner and drinks. Or that they’re paying a full allowance for a M&G. Or that they’re having arrangements with no intimacy. But there are SDs who are compensating SBs for M&Gs. Don’t let this forum fool you. 🤷‍♀️",
                            "author": "anxietyvibes",
                            "id": "hiaymqs",
                            "parent_id": "t1_hiay33j",
                            "score": 5,
                            "created_utc": 1635372197.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Are you implying OP is bitter and a man hater? No I'm sure she is not. But you missed the point again, that she is making. She is calling out specific men who are not real SDs but think they are. And I 100% agree with everything in her post.",
            "author": null,
            "id": "hiay2qy",
            "parent_id": "t1_hiau3el",
            "score": 1,
            "created_utc": 1635371967.0,
            "replies": [
                {
                    "body": "Do you need to take some classes in reading comprehension?  She generalized all the SDs on Reddit in her post, not talking about a few bad actors that might actually line up with her rambling description.  She did this purposefully to create a controversial post, not to call out specific men.  Can you really not see that?  And yes, I've flat out called her a lemon grove already today so those terms definitely fit the OP.\n\nAnd I'm sure you do agree with everything in her post.  That is not surprising, just disappointing.",
                    "author": "storm170",
                    "id": "hiaymkw",
                    "parent_id": "t1_hiay2qy",
                    "score": 2,
                    "created_utc": 1635372195.0,
                    "replies": [
                        {
                            "body": "Why do you seem so angry lol Yeah because alot of the guys on here are fake SDs.  sure some are actual real SDs but alot of them aren't. Do you feel personally attacked by her post?",
                            "author": null,
                            "id": "hiazkxr",
                            "parent_id": "t1_hiaymkw",
                            "score": 4,
                            "created_utc": 1635372594.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Perhaps she cannot afford a therapist 🤷🏻‍♀️",
            "author": "Usedtobesb",
            "id": "hia495j",
            "parent_id": "t1_hia269v",
            "score": 8,
            "created_utc": 1635360362.0,
            "replies": []
        },
        {
            "body": "Well don’t give her any ideas 😬🤣",
            "author": "Usedtobesb",
            "id": "hia4fud",
            "parent_id": "t1_hia1sba",
            "score": 6,
            "created_utc": 1635360436.0,
            "replies": []
        },
        {
            "body": "Do you really think that anyone is paying a pot SB simply for the benefit of meeting up for a few drinks?\n\nThat is delusional.\n\nAs a divorced man I have plenty of hot young women who I know as platonic friends that I spend time in the company of.  I'm not interested in more friends.",
            "author": "HecatesCats",
            "id": "hiay33j",
            "parent_id": "t1_hiajrvk",
            "score": 6,
            "created_utc": 1635371971.0,
            "replies": [
                {
                    "body": "Do you really think nobody is?.. I think that because I’ve experienced it.. If that’s not the case for you then you’re the exception. I’m not saying every single SD has to pay for the company of a younger woman, some do it for other reasons, but 90% do. Most SDs wouldn’t be in the company of a young beautiful woman who is interested in him otherwise. So yes, they’ll compensate a SB just for her time and attention. I’m not saying they’re paying 1k for dinner and drinks. Or that they’re paying a full allowance for a M&G. Or that they’re having arrangements with no intimacy. But there are SDs who are compensating SBs for M&Gs. Don’t let this forum fool you. 🤷‍♀️",
                    "author": "anxietyvibes",
                    "id": "hiaymqs",
                    "parent_id": "t1_hiay33j",
                    "score": 5,
                    "created_utc": 1635372197.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Do you need to take some classes in reading comprehension?  She generalized all the SDs on Reddit in her post, not talking about a few bad actors that might actually line up with her rambling description.  She did this purposefully to create a controversial post, not to call out specific men.  Can you really not see that?  And yes, I've flat out called her a lemon grove already today so those terms definitely fit the OP.\n\nAnd I'm sure you do agree with everything in her post.  That is not surprising, just disappointing.",
            "author": "storm170",
            "id": "hiaymkw",
            "parent_id": "t1_hiay2qy",
            "score": 2,
            "created_utc": 1635372195.0,
            "replies": [
                {
                    "body": "Why do you seem so angry lol Yeah because alot of the guys on here are fake SDs.  sure some are actual real SDs but alot of them aren't. Do you feel personally attacked by her post?",
                    "author": null,
                    "id": "hiazkxr",
                    "parent_id": "t1_hiaymkw",
                    "score": 4,
                    "created_utc": 1635372594.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Do you really think nobody is?.. I think that because I’ve experienced it.. If that’s not the case for you then you’re the exception. I’m not saying every single SD has to pay for the company of a younger woman, some do it for other reasons, but 90% do. Most SDs wouldn’t be in the company of a young beautiful woman who is interested in him otherwise. So yes, they’ll compensate a SB just for her time and attention. I’m not saying they’re paying 1k for dinner and drinks. Or that they’re paying a full allowance for a M&G. Or that they’re having arrangements with no intimacy. But there are SDs who are compensating SBs for M&Gs. Don’t let this forum fool you. 🤷‍♀️",
            "author": "anxietyvibes",
            "id": "hiaymqs",
            "parent_id": "t1_hiay33j",
            "score": 5,
            "created_utc": 1635372197.0,
            "replies": []
        },
        {
            "body": "Why do you seem so angry lol Yeah because alot of the guys on here are fake SDs.  sure some are actual real SDs but alot of them aren't. Do you feel personally attacked by her post?",
            "author": null,
            "id": "hiazkxr",
            "parent_id": "t1_hiaymkw",
            "score": 4,
            "created_utc": 1635372594.0,
            "replies": []
        }
    ]
}