{
    "title": "collect allowance up front",
    "post_id": "lhs9qk",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/lhs9qk/collect_allowance_up_front/",
    "author": "GSSD",
    "body": "\"But,but, it feels so transactional\" or \"I want a more natural feeling relationship\", or \" I am not comfortable talking about money\", or \" I don't want him to be turned off\". And the list goes on. We read posts every-single-day about SBs who are scammed and disrespected by con artists who talk them into beginning the \"arrangement\" with the expectation of allowance to be paid in the future. Don't be a statistic.  It is true that many SDs pay later and are honorable, but not at first. The SB needs the peace of mind that her new SD is taking care of her allowance. \n\nDo not take your clothes off before allowance is paid-PERIOD! I know it is uncomfortable having the money talk. But if you want to avoid the gut wrenching feeling of being conned, get over it.",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/lhs9qk/collect_allowance_up_front/",
    "score": 117,
    "upvote_ratio": 0.95,
    "created_utc": 1613071202.0,
    "num_comments": 89,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "As an SB, I really dislike the \"slip it into her purse\" method (and not just because I carry a very tiny bag 😁). For one thing, I really don't want you in my bag (I won't go through your wallet either). I'd rather we just be upfront about it - not explicit like, \"here is your $” while I count it. But at least before intimacy, leaving it in the same place every time and I just slip it in my bag myself in a casual way.\n\nHere's how I've done it:\n\nConvo before 1st intimate date about how to be paid.\n\nSD: Of course\n\n(At my arrival, envelope with cash and my name was on counter)\n\nMe: Is this for me?\n\nSD: (with a smile) Yes\n\nMe: Thank you.\n\n\n\nIf things *didn't* go this way, I would have no problem with a gentle reminder, \"I didn't seem to see my envelope\" or similar. \n\n(None of this occurred with an SD from SLF)",
            "author": "BlueJayJay82",
            "id": "gn0324e",
            "parent_id": "t3_lhs9qk",
            "score": 23,
            "created_utc": 1613088531.0,
            "replies": [
                {
                    "body": ">As an SB, I really dislike the \"slip it into her purse\" method\n\nAs an SD, I don't like it either.  Partially because I'm on the same page as you: I give your purse the same respect I expect you to give my wallet -- that is, hands off, period.  I also think all this spycraft reinforces that allowance is something to hide because it's a little... shameful?  something else?\n\nPersonal-style wise, I tend to like to de-awkwardize things by just bringing them up to the surface and handling them with warmth and humor.  I hand it to her in a little card, big smile, heartfelt thank her for being such amazing company, etc.  With respect, I find your \"have a little envelope for me, put it on the counter\" approach to be way too escort-evocative for me to love, THAT would make me feel awkward.  I'd just rather we look each other in the eye and make it a moment where I tell her how much I appreciate her, and it becomes a positive experience instead of an awkward one.  Handwritten note of appreciation inside.\n\nThis really only matters the first few dates anyway, after which the allowance is just part of the scenery.",
                    "author": "Azurecole",
                    "id": "gn06rsi",
                    "parent_id": "t1_gn0324e",
                    "score": 15,
                    "created_utc": 1613090457.0,
                    "replies": [
                        {
                            "body": "I agree that the covert purse action only adds to the idea that allowance is \"shameful\". Another reason I'm not a fan.\n\nThe \"envelope of cash\" statement only happens once, and at the start. It's to establish 1) that I prefer allowance in cash and 2) to just get out of the way that I'm asking for it before intimacy vs after. That's the only time the convo happens. I could avoid having that convo but there's no way to know we're on the same page without it. If I *knew* an SD would treat things the way you do, the first and every time then sure, I wouldn't have to say anything. But in the early days, how else will we know how to set the tone moving forward?",
                            "author": "BlueJayJay82",
                            "id": "gn0kdqu",
                            "parent_id": "t1_gn06rsi",
                            "score": 8,
                            "created_utc": 1613097598.0,
                            "replies": [
                                {
                                    "body": "I hear you, I just don't think there's a lot of good options unfortunately",
                                    "author": "Azurecole",
                                    "id": "gn0mvhh",
                                    "parent_id": "t1_gn0kdqu",
                                    "score": 1,
                                    "created_utc": 1613098929.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "In all my years of sugar dating, I had exactly one SD who did the “conversation with eye contact while holding my hands” when handing me the envelop, telling me how he appreciates me and he wanted me to have this envelope.\n\nI have to say, I AM DEFINITELY NOT A FAN. It was sooooooo incredibly awkward and I cringed so bad every time he did that. \n\nAnd he was someone who’d give me a gigantic stack that was for 2+ months at a time. I would much rather he just put it on top of my purse or jacket.",
                            "author": "ExExpectations",
                            "id": "gn1jup4",
                            "parent_id": "t1_gn06rsi",
                            "score": 7,
                            "created_utc": 1613122402.0,
                            "replies": [
                                {
                                    "body": "OMG Sandy is that you????!!   I thought you liked it!",
                                    "author": "Azurecole",
                                    "id": "gn2jho7",
                                    "parent_id": "t1_gn1jup4",
                                    "score": 2,
                                    "created_utc": 1613145898.0,
                                    "replies": [
                                        {
                                            "body": "Men. Always thinking they’ve done or said something awesome for the lady. \n\nWomen. Are always great at faking. We even fake orgasms to appease the men ego.",
                                            "author": "ExExpectations",
                                            "id": "gn2k45j",
                                            "parent_id": "t1_gn2jho7",
                                            "score": 4,
                                            "created_utc": 1613146183.0,
                                            "replies": [
                                                {
                                                    "body": "Thank goodness for small favors\n\nMore seriously, there's a universe of territory in between \"hey hun, leave the money on the dresser\" and \"hold hands, place her hand on my heart, get all dewey-eyed, and try to touch her soul\".   I think I have the basic skills to just be a person, keep it just a normal thing rather than engaging in spycraft or dresser protocol.  Or I could be over-estimating my own charisma; wouldn't be the first time.  But IMO if you have the basic interpersonal skills, just keeping this as no big deal is the way to go.",
                                                    "author": "Azurecole",
                                                    "id": "gn34hyw",
                                                    "parent_id": "t1_gn2k45j",
                                                    "score": 1,
                                                    "created_utc": 1613155040.0,
                                                    "replies": [
                                                        {
                                                            "body": "A simple handing it over saying “babe, this is for you” is much less cringy than saying how you appreciate her and how much you care about her and want her to have this \n\nWhich is how you came across 🤪💩just giving one woman’s viewpoint after being on the receiving end of such display",
                                                            "author": "ExExpectations",
                                                            "id": "gn35acu",
                                                            "parent_id": "t1_gn34hyw",
                                                            "score": 3,
                                                            "created_utc": 1613155383.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Fair! I might have leaned too hard in the description. I do think that the ability to make what could be awkward moments, just a completely normal and accepted part of the interaction, is a simple skill and one worth learning. It's something I actually think I'm really good at, but I've overestimated my prowess at things before LOL",
                                                                    "author": "Azurecole",
                                                                    "id": "gn39654",
                                                                    "parent_id": "t1_gn35acu",
                                                                    "score": 1,
                                                                    "created_utc": 1613157097.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "Haha. Maybe you’re actually suave, maybe she’s a good actress. We will never know.",
                                                                            "author": "ExExpectations",
                                                                            "id": "gn3j0j4",
                                                                            "parent_id": "t1_gn39654",
                                                                            "score": 2,
                                                                            "created_utc": 1613161584.0,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "body": "And SANDY??? I’m older, but not Sandy-old!",
                                            "author": "ExExpectations",
                                            "id": "gn4t1n4",
                                            "parent_id": "t1_gn2jho7",
                                            "score": 1,
                                            "created_utc": 1613185328.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "> This really only matters the first few dates anyway, after which the allowance is just part of the scenery.\n\nThis is the key. Get a strong start and it's usually smooth sailing afterwards.",
                            "author": "GSSD",
                            "id": "gn2su93",
                            "parent_id": "t1_gn06rsi",
                            "score": 1,
                            "created_utc": 1613150054.0,
                            "replies": [
                                {
                                    "body": "Yes I find many of the things we obsess about on slf are basically first & second date only things.\n\nDon't get me wrong, I think there's good reason to obsess on those things -- there's no history or trust built yet, no one wants to be a victim of a scam, and for SBs the consequences of a mistake can be far more serious than just a scam.  \n\nBut I also roll my eyes a little about things being too awkward.  We're adults. The awkwardness, if any, literally tends to last less than 30 seconds, and by the 3rd date, it's gone completely.  I'll deal with feeling a little awkward if it makes my SB feel better; even the things in this thread that I've called out as making me feel awkward, frankly if that's what my SB asks for, I'll deal.  It's really not a huge deal for me to feel awkward for 15 seconds, especially given how amazing she's made me feel the past few hours at dinner, and the next couple of hours in private!",
                                    "author": "Azurecole",
                                    "id": "gn2uhsd",
                                    "parent_id": "t1_gn2su93",
                                    "score": 2,
                                    "created_utc": 1613150761.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "I used to love when my Dr came over...after he'd leave I'd fine a nice stack in a drawer I used most.",
                    "author": "strawberrymilfshakex",
                    "id": "gnt81a7",
                    "parent_id": "t1_gn0324e",
                    "score": 2,
                    "created_utc": 1613597451.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I know some SDs want to wait until the end of the date to pay because they are worried about getting scammed.  Myself though I agree with you, I think the SB has more to lose in this situation.\n\nThe way I roll is that most dates consist of dinner or some other activity and then back to my place.  When we get back to my place I will already have the allowance ready and hand it to her right then.  Never had a woman take the envelope and run but if I did I would just shrug my shoulders and go online to find a new SB.",
            "author": "Thomasriddle01",
            "id": "gmz72hh",
            "parent_id": "t3_lhs9qk",
            "score": 38,
            "created_utc": 1613073961.0,
            "replies": [
                {
                    "body": "I had one take the money and run once )*.",
                    "author": "wb19081908",
                    "id": "gmzl7sl",
                    "parent_id": "t1_gmz72hh",
                    "score": 2,
                    "created_utc": 1613080038.0,
                    "replies": [
                        {
                            "body": "'I had one take the money and run once )*.\"\n\nIf you have invited someone into your house and they take the money and run you have WON + think about all the bad things the might have happened if she  had stayed.",
                            "author": "pinotandsugar",
                            "id": "gn0qsls",
                            "parent_id": "t1_gmzl7sl",
                            "score": 12,
                            "created_utc": 1613101008.0,
                            "replies": [
                                {
                                    "body": "Stupid me she told me shw had been scammed she wanted the money outside my house.  Then she did a Usain bolt )*",
                                    "author": "wb19081908",
                                    "id": "gn0s5tm",
                                    "parent_id": "t1_gn0qsls",
                                    "score": 6,
                                    "created_utc": 1613101760.0,
                                    "replies": [
                                        {
                                            "body": "I’m so sorry this happened to you but why did I laugh imagining her 🏃‍♀️🏃‍♀️\n😂",
                                            "author": "Addsomespice_",
                                            "id": "gn15eu8",
                                            "parent_id": "t1_gn0s5tm",
                                            "score": 10,
                                            "created_utc": 1613109953.0,
                                            "replies": [
                                                {
                                                    "body": "Yeh its a funny story for sure.  And she wss like 20 and had the balls to pull that off",
                                                    "author": "wb19081908",
                                                    "id": "gn17f7l",
                                                    "parent_id": "t1_gn15eu8",
                                                    "score": 5,
                                                    "created_utc": 1613111460.0,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "body": "Lol",
                                            "author": "Ambitious_Middle723",
                                            "id": "gn2d9l7",
                                            "parent_id": "t1_gn0s5tm",
                                            "score": 2,
                                            "created_utc": 1613143017.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "I had one have her pimp knock on the door and then she took off running with the money.\nbut it's easy to see the signs now for me so I just avoid it instead of using it as an excuse for future SBs. \n\nI still rlmuch rather leave the allowance for new SBs out ahead of time so they know they aren't getting scammed.",
                            "author": "fallingsd",
                            "id": "grd3gzi",
                            "parent_id": "t1_gmzl7sl",
                            "score": 2,
                            "created_utc": 1616077917.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Good SDs don't even let this be a question.\n\nThis should be taken care of without the SB having to ask.",
            "author": "GDarn",
            "id": "gmz2668",
            "parent_id": "t3_lhs9qk",
            "score": 39,
            "created_utc": 1613071897.0,
            "replies": [
                {
                    "body": "Yes 💖 I love it when a new SD says “I’ve left something for you on the nightstand” then excuses himself to the restroom so I have the privacy to count it.",
                    "author": "icarus_bent",
                    "id": "gmz57lk",
                    "parent_id": "t1_gmz2668",
                    "score": 41,
                    "created_utc": 1613073172.0,
                    "replies": [
                        {
                            "body": "Little details like that make a huge difference.\n\nOne should always show respect and care for their partner.",
                            "author": "GDarn",
                            "id": "gmz5jlw",
                            "parent_id": "t1_gmz57lk",
                            "score": 16,
                            "created_utc": 1613073313.0,
                            "replies": []
                        },
                        {
                            "body": "if i obseved a SB exhibit the level of distrust and count out a ppm$$ in front of me it'd be the last time",
                            "author": "redtitbandit",
                            "id": "gmzdan7",
                            "parent_id": "t1_gmz57lk",
                            "score": -19,
                            "created_utc": 1613076621.0,
                            "replies": [
                                {
                                    "body": "Disagree.  I tell them to count it to check the money is correct.",
                                    "author": "wb19081908",
                                    "id": "gmzkzsj",
                                    "parent_id": "t1_gmzdan7",
                                    "score": 19,
                                    "created_utc": 1613079940.0,
                                    "replies": []
                                },
                                {
                                    "body": "Thankfully I have not had to count the bundle while in his presence or before leaving. But soooooo many women have been conned by men that you shouldn’t take this so personally especially the first couple of times you’re with someone. They may have had bad experiences that you aren’t aware of, and it’s nothing personal when they just want to make sure it doesn’t get repeated again.",
                                    "author": "ExExpectations",
                                    "id": "gmzly2y",
                                    "parent_id": "t1_gmzdan7",
                                    "score": 13,
                                    "created_utc": 1613080364.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Agreed.  Same thing with the allowance discussion to begin with.  The SD should bring it up, not make the SB do it.",
                    "author": "Thomasriddle01",
                    "id": "gmz7a81",
                    "parent_id": "t1_gmz2668",
                    "score": 15,
                    "created_utc": 1613074055.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Agreed with this and u/GDarn's comment.\n\nMy humble addition here for SB's - if an SD does not make the allowance easy for you - it should be a yellow flag (at least 15 yards and loss of down) and probably a red flag. If he worries about it being transaction - **he** should take the steps to keep it from being that way, not put it on you.",
            "author": "sfwinefan",
            "id": "gmz3rzv",
            "parent_id": "t3_lhs9qk",
            "score": 26,
            "created_utc": 1613072573.0,
            "replies": [
                {
                    "body": "15 yards is 13.72 meters",
                    "author": "converter-bot",
                    "id": "gmz3t9n",
                    "parent_id": "t1_gmz3rzv",
                    "score": 3,
                    "created_utc": 1613072588.0,
                    "replies": [
                        {
                            "body": "Bad, bad bot!\n\nFootball does not use meters. \\[Grunt, belch, chest thump\\]",
                            "author": "sfwinefan",
                            "id": "gmz4n8j",
                            "parent_id": "t1_gmz3t9n",
                            "score": 10,
                            "created_utc": 1613072935.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "gmz5biw",
                                    "parent_id": "t1_gmz4n8j",
                                    "score": 8,
                                    "created_utc": 1613073218.0,
                                    "replies": [
                                        {
                                            "body": "You're thinking baseball ... which is also not metric (90 feet and the magical 60 feet 6 inches which is naturally meaningless for the heathen who demand metric measurements). Football has too much padding for those to really be meaningful in the same way.",
                                            "author": "sfwinefan",
                                            "id": "gmz6n9v",
                                            "parent_id": "t1_gmz5biw",
                                            "score": 5,
                                            "created_utc": 1613073778.0,
                                            "replies": [
                                                {
                                                    "body": "6 inches is 15.24 cm",
                                                    "author": "converter-bot",
                                                    "id": "gmz6o9l",
                                                    "parent_id": "t1_gmz6n9v",
                                                    "score": -1,
                                                    "created_utc": 1613073791.0,
                                                    "replies": [
                                                        {
                                                            "body": "Bad bot",
                                                            "author": "sfwinefan",
                                                            "id": "gmz6r7m",
                                                            "parent_id": "t1_gmz6o9l",
                                                            "score": 3,
                                                            "created_utc": 1613073827.0,
                                                            "replies": [
                                                                {
                                                                    "body": "At this point I think the bot is just trolling.",
                                                                    "author": "Thomasriddle01",
                                                                    "id": "gn05pta",
                                                                    "parent_id": "t1_gmz6r7m",
                                                                    "score": 6,
                                                                    "created_utc": 1613089905.0,
                                                                    "replies": []
                                                                },
                                                                {
                                                                    "body": "Thank you, sfwinefan, for voting on converter-bot.\n\nThis bot wants to find the best and worst bots on Reddit. [You can view results here](https://botrank.pastimes.eu/).\n\n***\n\n^(Even if I don't reply to your comment, I'm still listening for votes. Check the webpage to see if your vote registered!)",
                                                                    "author": "B0tRank",
                                                                    "id": "gmz6sc8",
                                                                    "parent_id": "t1_gmz6r7m",
                                                                    "score": 0,
                                                                    "created_utc": 1613073840.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I think this is best, as well. Payment is the most important thing for a sugar baby, and so many sugar daddies lie, cheat, and steal our time. It's just plain wrong. So I hope that sugar daddies will respectfully show that they are trustworthy.",
            "author": "Yukalitlee",
            "id": "gn0c7pu",
            "parent_id": "t3_lhs9qk",
            "score": 6,
            "created_utc": 1613093297.0,
            "replies": []
        },
        {
            "body": "Avoid men that give excuses - they play with your time and TIME IS MONEY",
            "author": "Foreignbecky214",
            "id": "gn0bsy5",
            "parent_id": "t3_lhs9qk",
            "score": 5,
            "created_utc": 1613093083.0,
            "replies": []
        },
        {
            "body": "I agree with most of what you've said and your intent, but many SRs don't start with an explicit ***\"you are coming to my hotel room, I am paying you $$$ and we will have sex\"***.   That will scare A LOT of women away!\n\nWhen I start an arrangement, I will tell them that I don't want sex to feel forced.  They are welcome to come back to my place when they are comfortable, but they are not obligated to have sex.  We may just hang out, watch movies, make food and/or drinks.  I've had several platonic dates like this before we moved to intimate dates.   In these cases, I typically provide a $ gift like I do for most M&Gs at the end of the date.  I don't know, and she may not know, if we will have sex that night at the start of the date. \n\nSometimes, we have a discussion during the date and agree to have sex.  As we proceed back to the bedroom I will place the agreed upon allowance on a table or counter in clear view.  Other times, the chemistry and attraction is so strong, it happens spontaneously while chatting over drinks or watching a movie.  I've found it difficult to stop in the throws of passion to place the allowance in plain site.  These have genuinely been the best experiences that turned into the best arrangements.  \n\nTo be fair, we've probably already been on a platonic date or two where I have already given them a generous $ gift at the end of each date without discussion.  I've already built enough trust that they know I won't short them.  \n\nThe only times I've had to put an allowance in an envelope and placed it out for them at the start of an intimate date, is when we did not have previous platonic M&G's or additional platonic dates where I gifted them after each date.   I've only skipped M&G's early on in my sugar careeer with women that were clearly more professional and transactional where we had explicit sex for money only dates.  I now, avoid more professional women, never skip the platonic M&G, may have several platonic dates prior to intimacy and typically provide a $ gift after every platonic date.  By the time we are intimate, I've built credibility.",
            "author": "willfromvb",
            "id": "gn1g5si",
            "parent_id": "t3_lhs9qk",
            "score": 5,
            "created_utc": 1613119014.0,
            "replies": []
        },
        {
            "body": "It IS Very much transactional!! As it should be😇😇",
            "author": "euridicee",
            "id": "gn9ux3r",
            "parent_id": "t3_lhs9qk",
            "score": 4,
            "created_utc": 1613245311.0,
            "replies": []
        },
        {
            "body": "I'll volunteer as tribute to face the inevitable downvote storm, but I think there is some really important additional information SBs need to know.  The first thing is that I agree with u/GSSD that you as an SB are entitled to, and should, ask for your allowance before your clothes come off on the first date.  As an SD, on the first date, I give my new SB her allowance when we get to the room before she even asks; occasionally, I've taken the risk and just given it to her at the restaurant (many SDs who do this get ripped off so not something I recommend; I do it anyway, when our connection is spectacular).\n\nTHAT SAID.  It is important you realize this: giving the allowance before intimacy is an slf norm, but it is not the norm in the bowl.  The norm in the bowl is to give allowance afterwards.  I do not tell you this to discourage you from asking for it before -- in fact, I think you SHOULD ask for it before. **But don't be surprised if your SD is a bit shocked or momentarily taken aback at the request.**  An SD can go 10 years and many, many SBs, and never have heard an SB ask for allowance beforehand even once.  I have never been asked, ever.  Many many SDs here have said the same thing.\n\nNot every SD has read slf.  It is difficult to find a good SD (and at least as difficult to find a good SB), it's important you don't see red flags where there are none.  It is not a red flag if your SD, who has probably never read SLF, has never been asked for allowance in advance, and pauses for a moment.  It's also not any kind of flag if he isn't the first one to bring up the allowance discussion (although he should not be evasive once you bring it up).   A subset of good SDs will do all these things for you -- bring up allowance themselves, give you the allowance before intimacy without you even asking.  A subset of good SDs won't -- but the point is, they can still be good SDs.   Don't imagine red flags where there aren't any.",
            "author": "Azurecole",
            "id": "gmzdp2z",
            "parent_id": "t3_lhs9qk",
            "score": 17,
            "created_utc": 1613076794.0,
            "replies": [
                {
                    "body": "I’ve actually never received an allowance after intimacy in the bowl. It never even crossed my mind that there were SD giving it after until I came on SLF. And I personally would still never risk it if a SD told me he wanted to handle the financials later. The risk to me is WAY greater than the risk to him.",
                    "author": "AdriannaKing",
                    "id": "gmznv27",
                    "parent_id": "t1_gmzdp2z",
                    "score": 14,
                    "created_utc": 1613081228.0,
                    "replies": [
                        {
                            "body": "Does anyone have the sd use Venmo or cashapp for transactions or is it usually always cash?",
                            "author": "apb2016",
                            "id": "gn09e11",
                            "parent_id": "t1_gmznv27",
                            "score": 2,
                            "created_utc": 1613091814.0,
                            "replies": [
                                {
                                    "body": "I’m in Canada. For me it has mostly been cash. Though I had one that lived out of town so he would e-transfer it to me from his bank account directly to me. (We were on a monthly allowance but sent to me as 4 weekly deposits). It was nice because sometimes he couldn’t make it to town for that weekend but he would always still send my weekly amount.",
                                    "author": "AdriannaKing",
                                    "id": "gn0h5ir",
                                    "parent_id": "t1_gn09e11",
                                    "score": 4,
                                    "created_utc": 1613095890.0,
                                    "replies": [
                                        {
                                            "body": "Now that is the way I envisioned it. Handing over cash before intimacy seems much more like paying for a hooker.  Unless the relationship is only about sex then I suppose that’s alright. I would prefer to set the monthly allowance, pay it weekly or monthly via Venmo or whatever. Cash never changes hands. But you need to have a level of trust.",
                                            "author": "apb2016",
                                            "id": "gn0hzdo",
                                            "parent_id": "t1_gn0h5ir",
                                            "score": 1,
                                            "created_utc": 1613096326.0,
                                            "replies": [
                                                {
                                                    "body": "> But you need to have a level of trust.\n\nThat is the challenge.  In any relationship, but especially in a sugar relationship, trust is very important.   When the money is given, how the money is given and the timing of sex and payment are delicate dances.",
                                                    "author": "willfromvb",
                                                    "id": "gn1hh20",
                                                    "parent_id": "t1_gn0hzdo",
                                                    "score": 3,
                                                    "created_utc": 1613120184.0,
                                                    "replies": []
                                                },
                                                {
                                                    "body": "It’s exactly the same as paying for a hooker.",
                                                    "author": "BigSugar44",
                                                    "id": "gn1i6bc",
                                                    "parent_id": "t1_gn0hzdo",
                                                    "score": 0,
                                                    "created_utc": 1613120831.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "Yes. Venmo or PayPal or cashapp or zelle - I’ve gotten it in all these forms. But only after we’ve known each other for a while.",
                                    "author": "ExExpectations",
                                    "id": "gn1k4ah",
                                    "parent_id": "t1_gn09e11",
                                    "score": 3,
                                    "created_utc": 1613122657.0,
                                    "replies": []
                                },
                                {
                                    "body": "Almost always.\n\nAnd to me, if someone pulls the \"Usain Bolt\" over a PPM? I'd far FAR rather be out the PPM and have them stay WELL away from me, than deal with their drama over time. \n\nBest to get that BS outta the way so I can enjoy a real SR.",
                                    "author": "SDRippington",
                                    "id": "gn2kox5",
                                    "parent_id": "t1_gn09e11",
                                    "score": 3,
                                    "created_utc": 1613146446.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": ">The risk to me is WAY greater than the risk to him.\n\nAgree, it's not even close.\n\nLike I said, I've never once\\\\been asked for it beforehand (although I've been just giving it voluntarily beforehand for a few years now, since some slf SBs convinced me it was the right thing to do).  But whenever we have a thread on \"has an SB ever asked you for PPM before sex?\" it ends up a barrage of SDs saying \"nope, no one has ever asked\".  It's a pretty universal experience on the SD side... although at this point, I think the vast majority of SDs on slf give it beforehand without having to be asked.",
                            "author": "Azurecole",
                            "id": "gmzoes4",
                            "parent_id": "t1_gmznv27",
                            "score": 2,
                            "created_utc": 1613081480.0,
                            "replies": []
                        },
                        {
                            "body": "Have you been given a $ gift at a M&G or on platonic dates?  Did they give the gift at the start of the date or the end?  \n\nI believe if you've had multiple platonic dates where a $ gift has been provided at the end of each platonic date, the SD has built some credibility.",
                            "author": "willfromvb",
                            "id": "gn1haiu",
                            "parent_id": "t1_gmznv27",
                            "score": 1,
                            "created_utc": 1613120022.0,
                            "replies": [
                                {
                                    "body": "I’m going to say “yes” to every scenario listed. I have been given a monetary gift at a meet and greet. It was... around the beginning, after I had settled in and ordered a cocktail. He said it was an extra thank you for coming so elegantly put together. (I’m in my early 30’s so my style is a bit more sexy/elegant/sophisticated/refined instead of cute college student).\n\nYes I’ve been gifted on platonic dates. And like I said before, I HONESTLY don’t get the SFL insistance on differentiating between platonic and intimate dates. If you’re doing ppm it’s pay per MEET not pay per sex act. \n\nAnd yes, if you’re getting to know one another and have multiple platonic dates a gift at the end will go a huge way to building up trust. If you don’t want an escort don’t treat her like one by insisting on not gifting unless there’s intimacy on the date. Otherwise you’re basically telling her “you don’t get a thing until you fuck me.” And that just feels gross. This subreddit seems to have a general cognitive dissonance about that. It also prevents putting your SB in the horribly awkward position of trying to figure out if you’re legit or not.\n\n*Note: I am extremely feminine. So I tend to attract men that like that. I’m gifted at the start of dates and one of the reasons why is possibly because men LOVE seeing my reaction to being gifted and treated well. THEY can’t wait to gift me. It was even turned into a game at one point with one of my SDs. “It’s hiding somewhere in this room, I’ll give you a clue.” And then you drink wine and have a mini scavenger hunt. But the key to this is that I make a HUGE production about finding it. It was a fun game so I TELL them it was fun. I TELL them how clever they are. I laugh, I bounce, I clap my hands, and I kiss them as a thank you. But the key is that it’s NOT an act. I LOVE being pampered, spoiled, and taken care of. And I expect to be treated well in Vanilla relationships as well. So I don’t NEED the money to be this super subtle thing because I don’t consider it as taboo. And if it doesn’t need to be subtle it allows me to show a man full appreciation for what he’s doing for me. And that overt appreciation taps into something they love and need.",
                                    "author": "AdriannaKing",
                                    "id": "gn2gel5",
                                    "parent_id": "t1_gn1haiu",
                                    "score": 7,
                                    "created_utc": 1613144489.0,
                                    "replies": [
                                        {
                                            "body": "I agree with everything you've said except that their is a professional career path called \"Rinser\".   Almost every experienced SD has run into them.  They are very good at promising or insinuating future intimacy while extracting as much money as possible in the process with no intention of every being intimate.  \n\nDon't blame the SDs, blame the rinsers that have ruined it for SBs.",
                                            "author": "willfromvb",
                                            "id": "gn2ha3v",
                                            "parent_id": "t1_gn2gel5",
                                            "score": 3,
                                            "created_utc": 1613144890.0,
                                            "replies": [
                                                {
                                                    "body": "Everyone needs to practice discernment. While there may be rinsers. There are also men that will promise to pay you, have sex with you, and then ghost. Which is, drumroll please, sexual assault. Yes, the woman agreed, but she agreed to sex under a specific set of guidelines. When a pot SD pumps and dumps under the guise of “I’ll pay you after” it’s sexual assault. That’s not an opinion it’s fact based on wording of the law. It’s like agreeing to have sex with a condom and then slipping it off without her knowledge. That’s sexual assault, not just “being a jerk”.\n\nSo again I say, the risk to the woman is WAY higher than the risk to the man. The safety of our body and consequently future mental and emotional health is more important than the safety to your wallet.\n\nUse discernment. Have frank open conversations. And if you’re feeling uncomfortable SAY something to the SB before you get to a point where you’re feeling rinsed. You’re an adult. In an adult relationship. Use your big boy words.",
                                                    "author": "AdriannaKing",
                                                    "id": "gn2ievi",
                                                    "parent_id": "t1_gn2ha3v",
                                                    "score": 6,
                                                    "created_utc": 1613145406.0,
                                                    "replies": [
                                                        {
                                                            "body": "Pump & Dump means he paid just lied about his intentions for a long term arrangement. Paying prior to intimacy is different that paying for a full PPM for platonic dates.  Most would agree that providing the allowance prior to intimacy is appropriate.  \n\nJust because sexual assault is more serious than theft doesn't mean the risk of theft should be ignored.  \n\nI actually provide $ gifts for M&Gs and $ gifts for platonic dates and often have several platonic dates before an intimate date.  I do gauge their genuine interest and try to assess if I an being rinsed.   It's not easy. The best rinsers are extremely convinced.  That's why Con Artists are called Con Artists, they gain your confidence.",
                                                            "author": "willfromvb",
                                                            "id": "gn2knti",
                                                            "parent_id": "t1_gn2ievi",
                                                            "score": 2,
                                                            "created_utc": 1613146432.0,
                                                            "replies": [
                                                                {
                                                                    "body": "No need to drill the semantics of my pump and dump terminology use, you obviously understand the scenario I was presenting. And I did NOT say the risk of theft should be ignored. I said to use discernment. What I’m saying is the risk to each party is not equally weighted. I really don’t understand why you’re arguing with me when the rest of your post seems fully aligned with what I’m saying.",
                                                                    "author": "AdriannaKing",
                                                                    "id": "gn2ls11",
                                                                    "parent_id": "t1_gn2knti",
                                                                    "score": 3,
                                                                    "created_utc": 1613146936.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Very good point Azure. As you well know, the dilemma SBs face is how do they differentiate between a real SD and a fake?   Most of the scammed say \"He was so sweet\", or \"we had a connection\",so they can't.\nIn an ideal world they should have a comprehensive discussion about all the issues and agree on them. But we also know IRL that it is often a Hail Mary and hope for the best.",
                    "author": "GSSD",
                    "id": "gmzktf8",
                    "parent_id": "t1_gmzdp2z",
                    "score": 7,
                    "created_utc": 1613079860.0,
                    "replies": [
                        {
                            "body": "Yep!  Like I said, I completely agree.  But there's always folks who express or imply that  if an SD doesn't do this automatically, that's a red flag.  Which is beyond ludicrous. There's no red flag -- and in fact she should expect most SDs will be surprised by the request.   But she should play through, stay sweet but absolutely ask for it, for all the reasons you laid out",
                            "author": "Azurecole",
                            "id": "gmzn0j2",
                            "parent_id": "t1_gmzktf8",
                            "score": 2,
                            "created_utc": 1613080837.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "“Egads, I’m taken aback and shocked that an SB is asking for her allowance at the same time that I’m asking her for sex!” * SD waves hankie and faints**\n\nLol, thankfully I’ve never had to ask, because every single SD I’ve gone out with gave it quite nonchalantly beforehand. It’s just common sense!",
                    "author": "bunheadxx",
                    "id": "gmzy6sp",
                    "parent_id": "t1_gmzdp2z",
                    "score": 7,
                    "created_utc": 1613086099.0,
                    "replies": []
                },
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "gmzyeln",
                    "parent_id": "t1_gmzdp2z",
                    "score": 4,
                    "created_utc": 1613086206.0,
                    "replies": [
                        {
                            "body": "I think one of the best indicators is how the M&G went.   Was he generous, on his own accord, with a $ gift at the end of M&G?  Did he offer additional platonic dates prior to intimacy?  Did he provide a $ gift after those platonic dates? If you skip a M&G or he doesn't gift at all at the M&G, you need to have a clearer understand of financial expectations and timing of payment.",
                            "author": "willfromvb",
                            "id": "gn1hsr3",
                            "parent_id": "t1_gmzyeln",
                            "score": 7,
                            "created_utc": 1613120483.0,
                            "replies": []
                        },
                        {
                            "body": "> What would you personally suggest for a SB to do \n\nThis is the point of my OP. You can't tell ahead of time. Most scammers are good at their craft. I think the best thing is to have a discussion before the intimate date. Say something like \" (Pot daddy), I'm really excited(blah blah) but I would appreciate it if you would indulge me when we have our sexy date (tomorrow). Would you mind putting my allowance on the bureau before we get intimate? I don't want to be a nervous Nellie but I'm so afraid we'll get so wrapped up in all the fun that we will forget all about it. Thanks for being understanding!\"  So what are you going to do if he says \"Oh, I won't forget\" and he does not put it out for you?  That's when you say \" Do you have something for me --?\"",
                            "author": "GSSD",
                            "id": "gn2vtl0",
                            "parent_id": "t1_gmzyeln",
                            "score": 6,
                            "created_utc": 1613151329.0,
                            "replies": []
                        },
                        {
                            "body": "\"I have some wonderful deviant ideas about having fun and they would be even better if we got that pesky financial stuff out of the way first.",
                            "author": "pinotandsugar",
                            "id": "gn0rqqr",
                            "parent_id": "t1_gmzyeln",
                            "score": 3,
                            "created_utc": 1613101529.0,
                            "replies": []
                        },
                        {
                            "body": "When I talk about a \"good SD\", I think a reasonable definition in this context is: \"gives you your PPM before intimacy without you having to ask, *or* gives you your PPM before intimacy when  you ask\".\n\nI think if the SD doesn't give it to you beforehand on his own, you should ask.  Expect he might be surprised when you do.  Don't panic, it's not a red flag, but hold your ground.  He should give you your PPM.\n\nThat's it.  I'm not suggesting \"don't ask for your PPM beforehand\".  I am suggesting, against the advice of others on this thread, that it's very likely he's never been asked this before and doesn't have the slightest idea that we here on slf have decided it's a norm. But do stick to your guns; if he's your perfect SD, he'll understand and give you your PPM (presumably!)",
                            "author": "Azurecole",
                            "id": "gn00rj2",
                            "parent_id": "t1_gmzyeln",
                            "score": 5,
                            "created_utc": 1613087374.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "gn08lwq",
                                    "parent_id": "t1_gn00rj2",
                                    "score": 3,
                                    "created_utc": 1613091406.0,
                                    "replies": [
                                        {
                                            "body": "I’ve had to ask before (which I hate with a passion) and this is how I handle it.\nI didn’t ask RIGHT before intimacy. I invited him in and poured him a glass of wine. We sat on the couch to chat. And at a lull I simply said,\n“I’m so happy that we’ve decided to do this. I want us to just relax and be able to really enjoy our time together, so as we go forward when you come see me, it would mean so much to me if we could get my gift out of the way right at the start. Not having to think about it as we’re getting to know one another will do so much to help me relax.”\nHe said yes. And I say, “Thank you for being so understanding, you’re such a sweet gentleman.”",
                                            "author": "AdriannaKing",
                                            "id": "gn0iaty",
                                            "parent_id": "t1_gn08lwq",
                                            "score": 10,
                                            "created_utc": 1613096495.0,
                                            "replies": [
                                                {
                                                    "body": "[deleted]",
                                                    "author": null,
                                                    "id": "gn0oc16",
                                                    "parent_id": "t1_gn0iaty",
                                                    "score": 2,
                                                    "created_utc": 1613099704.0,
                                                    "replies": [
                                                        {
                                                            "body": "I say that at the first meeting after the meet and greet. I honestly don’t understand the style I see on here of getting money on intimate dates but no money on non-intimate ones. The moment my SD and I agree to go forward my time = money.",
                                                            "author": "AdriannaKing",
                                                            "id": "gn0sae1",
                                                            "parent_id": "t1_gn0oc16",
                                                            "score": 6,
                                                            "created_utc": 1613101830.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "body": "Ironically, I still remember the conversation I was having with some slf SBs when they convinced me I should just give the PPM beforehand.  When I mentioned as one of my justifications for not consistently doing so, \"listen, no SB ever asks for it beforehand anyway; that must mean they don't care much either way\".  These SBs told me, \"nope, that's not it.  she isn't asking beforehand because it's so incredibly awkward, every way she frames it in her head sounds terrible, and she's terrified of how you'll react -- so terrified, she'd rather risk you scamming her rather than asking.  But EVERY SB wishes you'd give it beforehand\".   Made sense to me.  \n\nNo SB has ever asked me, so I can't say from experience what would be great.  I know \"do you have something for me\" is the exact phrase we hear from escorts, and from the stripper once we get to the champagne room, so wouldn't be my favorite coming from my SB, I suppose.  Still, I'm a grown man and would get over my 3 seconds of discomfort regardless.\n\nIn my imagination, I'd react really positively to her coming close, looking almost embarrassed she has to ask, and \"Would you mind if we handled the allowance now so I know it's out of the way and just have fun?\"   I really don't know if someone else is going to tell me how cringy that is, but it'd sound fine to me.",
                                            "author": "Azurecole",
                                            "id": "gn0awcm",
                                            "parent_id": "t1_gn08lwq",
                                            "score": 3,
                                            "created_utc": 1613092615.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Suggested\n\n\"Sweet S Dad, I have spent several hours hearing about your international business deals, holidays in far off lands, flights to your vacation home thousands of miles...... All this experience , each started with your presentation of a paid boarding pass.....",
                    "author": "pinotandsugar",
                    "id": "gn0rcf6",
                    "parent_id": "t1_gmzdp2z",
                    "score": 4,
                    "created_utc": 1613101310.0,
                    "replies": []
                },
                {
                    "body": "I think there is a difference between a first intimate date and a 2+ month relationship when it comes to allowance before or after intimacy \n\nSo yes in an new relationship I have no problem handing over allowance in the middle of a date just so no one feels uncomfortable, but if you “ask” at the beginning of a date? We have a problem \n\nTechnically, for me, when it comes to allowance you shouldn’t have to ask. I try to do a weekly or biweekly PayPal transfer the day of our meeting so we are in the same page. You don’t need to ask, and I don’t need to feel like an idiot. \n\nIf I’m waiting until the actual face to face date to transfer or hand over allowance then again i say we have trust issues and bigger problems.",
                    "author": "KnocDown",
                    "id": "gn205ob",
                    "parent_id": "t1_gmzdp2z",
                    "score": 3,
                    "created_utc": 1613136134.0,
                    "replies": [
                        {
                            "body": "> So yes in an new relationship I have no problem handing over allowance in the middle of a date just so no one feels uncomfortable, but if you “ask” at the beginning of a date? We have a problem \n\nAsking at the beginning of the date, like down at the restaurant, seems to always lead to those \"I gave her the envelope, she excused herself to go to the bathroom, and then skipped out\" stories.  It might not happen often, but if it's the very first date and she's asking at the restaurant, that's as red a red flag as can be, IMO",
                            "author": "Azurecole",
                            "id": "gn2jr6o",
                            "parent_id": "t1_gn205ob",
                            "score": 3,
                            "created_utc": 1613146018.0,
                            "replies": [
                                {
                                    "body": "Bingo \n\nOr the emergency phone call 20 minutes into dinner where she has to leave because her Pomeranian got sick",
                                    "author": "KnocDown",
                                    "id": "gn2oukn",
                                    "parent_id": "t1_gn2jr6o",
                                    "score": 2,
                                    "created_utc": 1613148309.0,
                                    "replies": [
                                        {
                                            "body": "OH NO NOT LITTLE CHEW-BARKA!  Get home right now and check on Chew-barka!",
                                            "author": "Azurecole",
                                            "id": "gn2psoa",
                                            "parent_id": "t1_gn2oukn",
                                            "score": 3,
                                            "created_utc": 1613148725.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Interesting you say this. I had an SB where I had given her a gift at the M&G, and the first two intimate dates afterwards was absolutely spectacular. I always just gave her the PPM before hand - first time was in a card, the second time she sat down, was talking about her day, I got her a glass of water, kissed her, and dropped it in her purse. Again, it was hours of totally unbelievable fun after that. \n\nThen came visit three. Something at the beginning felt, I dunno, \"off\". At that point I think I was more concerned with trying to figure out what was bugging her than anything else, and was like \"maybe a full body massage will help ya think better?\" and went to lead her upstairs and she grunted.\n\nI was like, \"huh?\" and she made a gesture of pointing to her purse and did a cutesy little cat meow or whatever. Took me a second to realize it, then was like, \"Oh, I'm sorry\" and the money was right there next to her, so I picked it up and put it in her purse - and then we went upstairs. \n\nAt the time I didn't think about it, but I'll be damned if it wasn't starting to bother the bejeesus out of me. But again, didn't really pay much attention to it.\n\nAfter that - I texted her and she was very, very aloof and then ultimately ghosted me for two weeks. \n\nShe came back, rather busted up that she had met another SD and he totally and completely \"scammed\" her. Promised her the moon and delivered nothing but dick. Literally. We weren't exclusive, so I chose to meet her for dinner and it was like I was talking to a completely different person. \n\nOn that third date when she did that, it really bugged the crap outta me. Ultimately I didn't see her again, cuz, well she had made some decisions with SD#2 that totally defied logic and common sense, but even some of those I would have worked through - but the not budging from the seat before cash on intimate date #3 - (with many hours in between texting, talking, pics of all kinds of stuff, acting like friends, etc.) that one stung. \n\nI understand it I guess - but dammit it stung. It brought home the total facade of the lifestyle.",
                    "author": "SDRippington",
                    "id": "gmzv3yq",
                    "parent_id": "t1_gmzdp2z",
                    "score": 3,
                    "created_utc": 1613084608.0,
                    "replies": [
                        {
                            "body": "Yeah, I've never had a SB make a big deal about when I hand her the money but after a little experience I have made it a habit to give it to her as soon as we get back to my place.  \n\nI think it's good to put her at ease that I am not going to try to cheat her.  But I can see where you are coming from, I would think that by date #3 she would know you weren't going to scam her.",
                            "author": "Thomasriddle01",
                            "id": "gn06lng",
                            "parent_id": "t1_gmzv3yq",
                            "score": 4,
                            "created_utc": 1613090369.0,
                            "replies": [
                                {
                                    "body": "Especially when date three was at my house FFS. Yeesh. \n\nIt is what it is, I guess :-)",
                                    "author": "SDRippington",
                                    "id": "gn07as3",
                                    "parent_id": "t1_gn06lng",
                                    "score": 2,
                                    "created_utc": 1613090728.0,
                                    "replies": [
                                        {
                                            "body": "At date 3 you’re still virtually a stranger. I had a SD short me on purpose after a few dates.",
                                            "author": "AdriannaKing",
                                            "id": "gn0jm8l",
                                            "parent_id": "t1_gn07as3",
                                            "score": 7,
                                            "created_utc": 1613097195.0,
                                            "replies": [
                                                {
                                                    "body": "This was at my place. We know all about each other - backgrounds, likes, dislikes, hours and hours spent NOT in an intimate embrace.\n\nIf some asshat dissed you that far into something you thought was real? Put out a contract on him. That's messed up.",
                                                    "author": "SDRippington",
                                                    "id": "gn0psqs",
                                                    "parent_id": "t1_gn0jm8l",
                                                    "score": 1,
                                                    "created_utc": 1613100476.0,
                                                    "replies": [
                                                        {
                                                            "body": "Oh it was ages ago and I definitely did not let it slide. He tried to come back months later, full of apologies, but I refused to see him again.\nBut you were talking about date 3. \n\nAnd while you and your SB may know each other well. Think about it beyond your specific relationship. 3 dates is NOT a lot of time to get to know a person, not really. So I don’t think it’s fair to expect ANY person to just trust you completely after three dates.",
                                                            "author": "AdriannaKing",
                                                            "id": "gn0sl1m",
                                                            "parent_id": "t1_gn0psqs",
                                                            "score": 3,
                                                            "created_utc": 1613101995.0,
                                                            "replies": [
                                                                {
                                                                    "body": "> 3 dates is NOT a lot of time to get to know a person, not really\n\nOh I totally forgot! And a day before that, I sent her the money to cover all of her advanced class and lab books - which was quite a bit.\n\nAnd for weeks before that it was many days of texts, pics, sharing all manner of things? And we were at my place for the third time FFS. \n\nPretty sure it was obvious I was not going to stiff her. And seriously, if by date 3, at my place, and sharing all of the things we shared and did, if you think I am going to short you a PPM? _Really??_\n\nWell, one thing is for sure - it wasn't a mutual \"Fuck Yes\" in the \"It's Fuck Yes or It's No\" theory of compatible relationships :-)\n\nSo no love lost in any case. She tried hitting me up a few months back. I was cordial but firm - \"Not interested.\"\n\nAnd me saying that to a drop-dead gorgeous redhead (even if she wound up being batshit cray-cray?) says something. At the moment it was ALL about the money? I was pretty sure it wasn't going to last.",
                                                                    "author": "SDRippington",
                                                                    "id": "gn0xzkv",
                                                                    "parent_id": "t1_gn0sl1m",
                                                                    "score": 3,
                                                                    "created_utc": 1613105120.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Not really allowance but my ppm-- other SD i see occassionally has the courtesy to put it in an envelope and slide it to my bag or pocket.",
            "author": "winterbaby22",
            "id": "gn18era",
            "parent_id": "t3_lhs9qk",
            "score": 3,
            "created_utc": 1613112235.0,
            "replies": []
        },
        {
            "body": "Yes queen agreed 100%",
            "author": null,
            "id": "gn19grk",
            "parent_id": "t3_lhs9qk",
            "score": 3,
            "created_utc": 1613113104.0,
            "replies": []
        },
        {
            "body": "Money in a \"Happy Card\" for the first intimate date - after that I use CashApp, Venmo or PayPal.\n\nIt's funny. I very rarely get any awkwardness or \"trust but verify\" shenanigans surrounding money. \n\nI guess since for the most part, anyone who is my companion and I theirs, we have a totally down-to-earth vibe that doesn't play in to any of this cloak-and-dagger bullshit.",
            "author": "SDRippington",
            "id": "gn2k7lf",
            "parent_id": "t3_lhs9qk",
            "score": 2,
            "created_utc": 1613146227.0,
            "replies": []
        },
        {
            "body": "yeah this goes both ways.  give me a break\n\ngirls get paid upfront and then suddenly become a hot mess\n\nmy solution? 2 platonic meet ups with no money and no adult time.  build trust and then you can get your allowance once it's worked out",
            "author": "GeneAsBob",
            "id": "gn0v6lq",
            "parent_id": "t3_lhs9qk",
            "score": 3,
            "created_utc": 1613103462.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gn04b1d",
            "parent_id": "t3_lhs9qk",
            "score": 1,
            "created_utc": 1613089175.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "gn0qf5x",
                    "parent_id": "t1_gn04b1d",
                    "score": 4,
                    "created_utc": 1613100806.0,
                    "replies": []
                }
            ]
        },
        {
            "body": " I’ve never had any issues paying at the end of the date.  Then again, I’ve never selected a SB after the first date. \nWe are still slipping cash in 2021?  I suppose some girls think it’s safer?",
            "author": "hero79375",
            "id": "gn0xz42",
            "parent_id": "t3_lhs9qk",
            "score": 1,
            "created_utc": 1613105112.0,
            "replies": []
        },
        {
            "body": "i 100% agree it's safest for a SB to protect herself that way.  I've almost never been asked to give it ahead of time and the several times i did...it was a scammer experience.  So for me, it's a dealbreaker if they ask in the beginning.  I know i'm being hypocritical, but i'm going to protect myself before i protect a stranger.  \n\noverall, my allowance experience has been...girl asks at the end or completely forgets until after they leave.  100% of the time the money is already tucked into their purse or jacket. 90% thank me for not making it awkward and not something they need to think about.",
            "author": null,
            "id": "gmzycby",
            "parent_id": "t3_lhs9qk",
            "score": 0,
            "created_utc": 1613086175.0,
            "replies": [
                {
                    "body": "I appreciate your thoughts. It just feels like a damned if you do damned if you don't situation \\*unless\\* the SD is a great guy like it seems like you are but which also seem rare.",
                    "author": "Petitjacket",
                    "id": "gn04dbv",
                    "parent_id": "t1_gmzycby",
                    "score": 3,
                    "created_utc": 1613089208.0,
                    "replies": [
                        {
                            "body": "I don't know about a great sd. There are far better and more generous men on slf.\n\nI am honest in my intentions though.",
                            "author": null,
                            "id": "gn04nti",
                            "parent_id": "t1_gn04dbv",
                            "score": -1,
                            "created_utc": 1613089358.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Does leaving out the allowance in an envelope in a conspicuous place count as \"allowance upfront\"?\n\nBecause, you know, I understand the honest trepidation on part of both parties.\n\nWhat has happened, and sticks clearly in my mind was the SB of yester-year who explicitly asked for the allowance upfront at my place, then ultimately withheld PIV sex, explaining to me as we lie half naked in bed that that would cost extra...\n\nIt's unfair of me to judge all future SBs based on that one experience. I haven't had a similar experience since then, and really it hasn't been much of any issue.\n\nSome women swoop up the envelope (the name given to me is written on it) right away, and some take it on their way out the door.\n\nWhat happens if sometime in the future the SB takes the envelope on arriving, then later begs off and has to leave without consummating the arrangement? Will she hand back the envelope or just leave with it? I don't know...",
            "author": "gingerdaddy56",
            "id": "gmzzrf8",
            "parent_id": "t3_lhs9qk",
            "score": 0,
            "created_utc": 1613086877.0,
            "replies": []
        },
        {
            "body": ">As an SB, I really dislike the \"slip it into her purse\" method\n\nAs an SD, I don't like it either.  Partially because I'm on the same page as you: I give your purse the same respect I expect you to give my wallet -- that is, hands off, period.  I also think all this spycraft reinforces that allowance is something to hide because it's a little... shameful?  something else?\n\nPersonal-style wise, I tend to like to de-awkwardize things by just bringing them up to the surface and handling them with warmth and humor.  I hand it to her in a little card, big smile, heartfelt thank her for being such amazing company, etc.  With respect, I find your \"have a little envelope for me, put it on the counter\" approach to be way too escort-evocative for me to love, THAT would make me feel awkward.  I'd just rather we look each other in the eye and make it a moment where I tell her how much I appreciate her, and it becomes a positive experience instead of an awkward one.  Handwritten note of appreciation inside.\n\nThis really only matters the first few dates anyway, after which the allowance is just part of the scenery.",
            "author": "Azurecole",
            "id": "gn06rsi",
            "parent_id": "t1_gn0324e",
            "score": 15,
            "created_utc": 1613090457.0,
            "replies": [
                {
                    "body": "I agree that the covert purse action only adds to the idea that allowance is \"shameful\". Another reason I'm not a fan.\n\nThe \"envelope of cash\" statement only happens once, and at the start. It's to establish 1) that I prefer allowance in cash and 2) to just get out of the way that I'm asking for it before intimacy vs after. That's the only time the convo happens. I could avoid having that convo but there's no way to know we're on the same page without it. If I *knew* an SD would treat things the way you do, the first and every time then sure, I wouldn't have to say anything. But in the early days, how else will we know how to set the tone moving forward?",
                    "author": "BlueJayJay82",
                    "id": "gn0kdqu",
                    "parent_id": "t1_gn06rsi",
                    "score": 8,
                    "created_utc": 1613097598.0,
                    "replies": [
                        {
                            "body": "I hear you, I just don't think there's a lot of good options unfortunately",
                            "author": "Azurecole",
                            "id": "gn0mvhh",
                            "parent_id": "t1_gn0kdqu",
                            "score": 1,
                            "created_utc": 1613098929.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "In all my years of sugar dating, I had exactly one SD who did the “conversation with eye contact while holding my hands” when handing me the envelop, telling me how he appreciates me and he wanted me to have this envelope.\n\nI have to say, I AM DEFINITELY NOT A FAN. It was sooooooo incredibly awkward and I cringed so bad every time he did that. \n\nAnd he was someone who’d give me a gigantic stack that was for 2+ months at a time. I would much rather he just put it on top of my purse or jacket.",
                    "author": "ExExpectations",
                    "id": "gn1jup4",
                    "parent_id": "t1_gn06rsi",
                    "score": 7,
                    "created_utc": 1613122402.0,
                    "replies": [
                        {
                            "body": "OMG Sandy is that you????!!   I thought you liked it!",
                            "author": "Azurecole",
                            "id": "gn2jho7",
                            "parent_id": "t1_gn1jup4",
                            "score": 2,
                            "created_utc": 1613145898.0,
                            "replies": [
                                {
                                    "body": "Men. Always thinking they’ve done or said something awesome for the lady. \n\nWomen. Are always great at faking. We even fake orgasms to appease the men ego.",
                                    "author": "ExExpectations",
                                    "id": "gn2k45j",
                                    "parent_id": "t1_gn2jho7",
                                    "score": 4,
                                    "created_utc": 1613146183.0,
                                    "replies": [
                                        {
                                            "body": "Thank goodness for small favors\n\nMore seriously, there's a universe of territory in between \"hey hun, leave the money on the dresser\" and \"hold hands, place her hand on my heart, get all dewey-eyed, and try to touch her soul\".   I think I have the basic skills to just be a person, keep it just a normal thing rather than engaging in spycraft or dresser protocol.  Or I could be over-estimating my own charisma; wouldn't be the first time.  But IMO if you have the basic interpersonal skills, just keeping this as no big deal is the way to go.",
                                            "author": "Azurecole",
                                            "id": "gn34hyw",
                                            "parent_id": "t1_gn2k45j",
                                            "score": 1,
                                            "created_utc": 1613155040.0,
                                            "replies": [
                                                {
                                                    "body": "A simple handing it over saying “babe, this is for you” is much less cringy than saying how you appreciate her and how much you care about her and want her to have this \n\nWhich is how you came across 🤪💩just giving one woman’s viewpoint after being on the receiving end of such display",
                                                    "author": "ExExpectations",
                                                    "id": "gn35acu",
                                                    "parent_id": "t1_gn34hyw",
                                                    "score": 3,
                                                    "created_utc": 1613155383.0,
                                                    "replies": [
                                                        {
                                                            "body": "Fair! I might have leaned too hard in the description. I do think that the ability to make what could be awkward moments, just a completely normal and accepted part of the interaction, is a simple skill and one worth learning. It's something I actually think I'm really good at, but I've overestimated my prowess at things before LOL",
                                                            "author": "Azurecole",
                                                            "id": "gn39654",
                                                            "parent_id": "t1_gn35acu",
                                                            "score": 1,
                                                            "created_utc": 1613157097.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Haha. Maybe you’re actually suave, maybe she’s a good actress. We will never know.",
                                                                    "author": "ExExpectations",
                                                                    "id": "gn3j0j4",
                                                                    "parent_id": "t1_gn39654",
                                                                    "score": 2,
                                                                    "created_utc": 1613161584.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "And SANDY??? I’m older, but not Sandy-old!",
                                    "author": "ExExpectations",
                                    "id": "gn4t1n4",
                                    "parent_id": "t1_gn2jho7",
                                    "score": 1,
                                    "created_utc": 1613185328.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "> This really only matters the first few dates anyway, after which the allowance is just part of the scenery.\n\nThis is the key. Get a strong start and it's usually smooth sailing afterwards.",
                    "author": "GSSD",
                    "id": "gn2su93",
                    "parent_id": "t1_gn06rsi",
                    "score": 1,
                    "created_utc": 1613150054.0,
                    "replies": [
                        {
                            "body": "Yes I find many of the things we obsess about on slf are basically first & second date only things.\n\nDon't get me wrong, I think there's good reason to obsess on those things -- there's no history or trust built yet, no one wants to be a victim of a scam, and for SBs the consequences of a mistake can be far more serious than just a scam.  \n\nBut I also roll my eyes a little about things being too awkward.  We're adults. The awkwardness, if any, literally tends to last less than 30 seconds, and by the 3rd date, it's gone completely.  I'll deal with feeling a little awkward if it makes my SB feel better; even the things in this thread that I've called out as making me feel awkward, frankly if that's what my SB asks for, I'll deal.  It's really not a huge deal for me to feel awkward for 15 seconds, especially given how amazing she's made me feel the past few hours at dinner, and the next couple of hours in private!",
                            "author": "Azurecole",
                            "id": "gn2uhsd",
                            "parent_id": "t1_gn2su93",
                            "score": 2,
                            "created_utc": 1613150761.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I used to love when my Dr came over...after he'd leave I'd fine a nice stack in a drawer I used most.",
            "author": "strawberrymilfshakex",
            "id": "gnt81a7",
            "parent_id": "t1_gn0324e",
            "score": 2,
            "created_utc": 1613597451.0,
            "replies": []
        },
        {
            "body": "I had one take the money and run once )*.",
            "author": "wb19081908",
            "id": "gmzl7sl",
            "parent_id": "t1_gmz72hh",
            "score": 2,
            "created_utc": 1613080038.0,
            "replies": [
                {
                    "body": "'I had one take the money and run once )*.\"\n\nIf you have invited someone into your house and they take the money and run you have WON + think about all the bad things the might have happened if she  had stayed.",
                    "author": "pinotandsugar",
                    "id": "gn0qsls",
                    "parent_id": "t1_gmzl7sl",
                    "score": 12,
                    "created_utc": 1613101008.0,
                    "replies": [
                        {
                            "body": "Stupid me she told me shw had been scammed she wanted the money outside my house.  Then she did a Usain bolt )*",
                            "author": "wb19081908",
                            "id": "gn0s5tm",
                            "parent_id": "t1_gn0qsls",
                            "score": 6,
                            "created_utc": 1613101760.0,
                            "replies": [
                                {
                                    "body": "I’m so sorry this happened to you but why did I laugh imagining her 🏃‍♀️🏃‍♀️\n😂",
                                    "author": "Addsomespice_",
                                    "id": "gn15eu8",
                                    "parent_id": "t1_gn0s5tm",
                                    "score": 10,
                                    "created_utc": 1613109953.0,
                                    "replies": [
                                        {
                                            "body": "Yeh its a funny story for sure.  And she wss like 20 and had the balls to pull that off",
                                            "author": "wb19081908",
                                            "id": "gn17f7l",
                                            "parent_id": "t1_gn15eu8",
                                            "score": 5,
                                            "created_utc": 1613111460.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "Lol",
                                    "author": "Ambitious_Middle723",
                                    "id": "gn2d9l7",
                                    "parent_id": "t1_gn0s5tm",
                                    "score": 2,
                                    "created_utc": 1613143017.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "I had one have her pimp knock on the door and then she took off running with the money.\nbut it's easy to see the signs now for me so I just avoid it instead of using it as an excuse for future SBs. \n\nI still rlmuch rather leave the allowance for new SBs out ahead of time so they know they aren't getting scammed.",
                    "author": "fallingsd",
                    "id": "grd3gzi",
                    "parent_id": "t1_gmzl7sl",
                    "score": 2,
                    "created_utc": 1616077917.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Yes 💖 I love it when a new SD says “I’ve left something for you on the nightstand” then excuses himself to the restroom so I have the privacy to count it.",
            "author": "icarus_bent",
            "id": "gmz57lk",
            "parent_id": "t1_gmz2668",
            "score": 41,
            "created_utc": 1613073172.0,
            "replies": [
                {
                    "body": "Little details like that make a huge difference.\n\nOne should always show respect and care for their partner.",
                    "author": "GDarn",
                    "id": "gmz5jlw",
                    "parent_id": "t1_gmz57lk",
                    "score": 16,
                    "created_utc": 1613073313.0,
                    "replies": []
                },
                {
                    "body": "if i obseved a SB exhibit the level of distrust and count out a ppm$$ in front of me it'd be the last time",
                    "author": "redtitbandit",
                    "id": "gmzdan7",
                    "parent_id": "t1_gmz57lk",
                    "score": -19,
                    "created_utc": 1613076621.0,
                    "replies": [
                        {
                            "body": "Disagree.  I tell them to count it to check the money is correct.",
                            "author": "wb19081908",
                            "id": "gmzkzsj",
                            "parent_id": "t1_gmzdan7",
                            "score": 19,
                            "created_utc": 1613079940.0,
                            "replies": []
                        },
                        {
                            "body": "Thankfully I have not had to count the bundle while in his presence or before leaving. But soooooo many women have been conned by men that you shouldn’t take this so personally especially the first couple of times you’re with someone. They may have had bad experiences that you aren’t aware of, and it’s nothing personal when they just want to make sure it doesn’t get repeated again.",
                            "author": "ExExpectations",
                            "id": "gmzly2y",
                            "parent_id": "t1_gmzdan7",
                            "score": 13,
                            "created_utc": 1613080364.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Agreed.  Same thing with the allowance discussion to begin with.  The SD should bring it up, not make the SB do it.",
            "author": "Thomasriddle01",
            "id": "gmz7a81",
            "parent_id": "t1_gmz2668",
            "score": 15,
            "created_utc": 1613074055.0,
            "replies": []
        },
        {
            "body": "15 yards is 13.72 meters",
            "author": "converter-bot",
            "id": "gmz3t9n",
            "parent_id": "t1_gmz3rzv",
            "score": 3,
            "created_utc": 1613072588.0,
            "replies": [
                {
                    "body": "Bad, bad bot!\n\nFootball does not use meters. \\[Grunt, belch, chest thump\\]",
                    "author": "sfwinefan",
                    "id": "gmz4n8j",
                    "parent_id": "t1_gmz3t9n",
                    "score": 10,
                    "created_utc": 1613072935.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "gmz5biw",
                            "parent_id": "t1_gmz4n8j",
                            "score": 8,
                            "created_utc": 1613073218.0,
                            "replies": [
                                {
                                    "body": "You're thinking baseball ... which is also not metric (90 feet and the magical 60 feet 6 inches which is naturally meaningless for the heathen who demand metric measurements). Football has too much padding for those to really be meaningful in the same way.",
                                    "author": "sfwinefan",
                                    "id": "gmz6n9v",
                                    "parent_id": "t1_gmz5biw",
                                    "score": 5,
                                    "created_utc": 1613073778.0,
                                    "replies": [
                                        {
                                            "body": "6 inches is 15.24 cm",
                                            "author": "converter-bot",
                                            "id": "gmz6o9l",
                                            "parent_id": "t1_gmz6n9v",
                                            "score": -1,
                                            "created_utc": 1613073791.0,
                                            "replies": [
                                                {
                                                    "body": "Bad bot",
                                                    "author": "sfwinefan",
                                                    "id": "gmz6r7m",
                                                    "parent_id": "t1_gmz6o9l",
                                                    "score": 3,
                                                    "created_utc": 1613073827.0,
                                                    "replies": [
                                                        {
                                                            "body": "At this point I think the bot is just trolling.",
                                                            "author": "Thomasriddle01",
                                                            "id": "gn05pta",
                                                            "parent_id": "t1_gmz6r7m",
                                                            "score": 6,
                                                            "created_utc": 1613089905.0,
                                                            "replies": []
                                                        },
                                                        {
                                                            "body": "Thank you, sfwinefan, for voting on converter-bot.\n\nThis bot wants to find the best and worst bots on Reddit. [You can view results here](https://botrank.pastimes.eu/).\n\n***\n\n^(Even if I don't reply to your comment, I'm still listening for votes. Check the webpage to see if your vote registered!)",
                                                            "author": "B0tRank",
                                                            "id": "gmz6sc8",
                                                            "parent_id": "t1_gmz6r7m",
                                                            "score": 0,
                                                            "created_utc": 1613073840.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I’ve actually never received an allowance after intimacy in the bowl. It never even crossed my mind that there were SD giving it after until I came on SLF. And I personally would still never risk it if a SD told me he wanted to handle the financials later. The risk to me is WAY greater than the risk to him.",
            "author": "AdriannaKing",
            "id": "gmznv27",
            "parent_id": "t1_gmzdp2z",
            "score": 14,
            "created_utc": 1613081228.0,
            "replies": [
                {
                    "body": "Does anyone have the sd use Venmo or cashapp for transactions or is it usually always cash?",
                    "author": "apb2016",
                    "id": "gn09e11",
                    "parent_id": "t1_gmznv27",
                    "score": 2,
                    "created_utc": 1613091814.0,
                    "replies": [
                        {
                            "body": "I’m in Canada. For me it has mostly been cash. Though I had one that lived out of town so he would e-transfer it to me from his bank account directly to me. (We were on a monthly allowance but sent to me as 4 weekly deposits). It was nice because sometimes he couldn’t make it to town for that weekend but he would always still send my weekly amount.",
                            "author": "AdriannaKing",
                            "id": "gn0h5ir",
                            "parent_id": "t1_gn09e11",
                            "score": 4,
                            "created_utc": 1613095890.0,
                            "replies": [
                                {
                                    "body": "Now that is the way I envisioned it. Handing over cash before intimacy seems much more like paying for a hooker.  Unless the relationship is only about sex then I suppose that’s alright. I would prefer to set the monthly allowance, pay it weekly or monthly via Venmo or whatever. Cash never changes hands. But you need to have a level of trust.",
                                    "author": "apb2016",
                                    "id": "gn0hzdo",
                                    "parent_id": "t1_gn0h5ir",
                                    "score": 1,
                                    "created_utc": 1613096326.0,
                                    "replies": [
                                        {
                                            "body": "> But you need to have a level of trust.\n\nThat is the challenge.  In any relationship, but especially in a sugar relationship, trust is very important.   When the money is given, how the money is given and the timing of sex and payment are delicate dances.",
                                            "author": "willfromvb",
                                            "id": "gn1hh20",
                                            "parent_id": "t1_gn0hzdo",
                                            "score": 3,
                                            "created_utc": 1613120184.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "It’s exactly the same as paying for a hooker.",
                                            "author": "BigSugar44",
                                            "id": "gn1i6bc",
                                            "parent_id": "t1_gn0hzdo",
                                            "score": 0,
                                            "created_utc": 1613120831.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "Yes. Venmo or PayPal or cashapp or zelle - I’ve gotten it in all these forms. But only after we’ve known each other for a while.",
                            "author": "ExExpectations",
                            "id": "gn1k4ah",
                            "parent_id": "t1_gn09e11",
                            "score": 3,
                            "created_utc": 1613122657.0,
                            "replies": []
                        },
                        {
                            "body": "Almost always.\n\nAnd to me, if someone pulls the \"Usain Bolt\" over a PPM? I'd far FAR rather be out the PPM and have them stay WELL away from me, than deal with their drama over time. \n\nBest to get that BS outta the way so I can enjoy a real SR.",
                            "author": "SDRippington",
                            "id": "gn2kox5",
                            "parent_id": "t1_gn09e11",
                            "score": 3,
                            "created_utc": 1613146446.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": ">The risk to me is WAY greater than the risk to him.\n\nAgree, it's not even close.\n\nLike I said, I've never once\\\\been asked for it beforehand (although I've been just giving it voluntarily beforehand for a few years now, since some slf SBs convinced me it was the right thing to do).  But whenever we have a thread on \"has an SB ever asked you for PPM before sex?\" it ends up a barrage of SDs saying \"nope, no one has ever asked\".  It's a pretty universal experience on the SD side... although at this point, I think the vast majority of SDs on slf give it beforehand without having to be asked.",
                    "author": "Azurecole",
                    "id": "gmzoes4",
                    "parent_id": "t1_gmznv27",
                    "score": 2,
                    "created_utc": 1613081480.0,
                    "replies": []
                },
                {
                    "body": "Have you been given a $ gift at a M&G or on platonic dates?  Did they give the gift at the start of the date or the end?  \n\nI believe if you've had multiple platonic dates where a $ gift has been provided at the end of each platonic date, the SD has built some credibility.",
                    "author": "willfromvb",
                    "id": "gn1haiu",
                    "parent_id": "t1_gmznv27",
                    "score": 1,
                    "created_utc": 1613120022.0,
                    "replies": [
                        {
                            "body": "I’m going to say “yes” to every scenario listed. I have been given a monetary gift at a meet and greet. It was... around the beginning, after I had settled in and ordered a cocktail. He said it was an extra thank you for coming so elegantly put together. (I’m in my early 30’s so my style is a bit more sexy/elegant/sophisticated/refined instead of cute college student).\n\nYes I’ve been gifted on platonic dates. And like I said before, I HONESTLY don’t get the SFL insistance on differentiating between platonic and intimate dates. If you’re doing ppm it’s pay per MEET not pay per sex act. \n\nAnd yes, if you’re getting to know one another and have multiple platonic dates a gift at the end will go a huge way to building up trust. If you don’t want an escort don’t treat her like one by insisting on not gifting unless there’s intimacy on the date. Otherwise you’re basically telling her “you don’t get a thing until you fuck me.” And that just feels gross. This subreddit seems to have a general cognitive dissonance about that. It also prevents putting your SB in the horribly awkward position of trying to figure out if you’re legit or not.\n\n*Note: I am extremely feminine. So I tend to attract men that like that. I’m gifted at the start of dates and one of the reasons why is possibly because men LOVE seeing my reaction to being gifted and treated well. THEY can’t wait to gift me. It was even turned into a game at one point with one of my SDs. “It’s hiding somewhere in this room, I’ll give you a clue.” And then you drink wine and have a mini scavenger hunt. But the key to this is that I make a HUGE production about finding it. It was a fun game so I TELL them it was fun. I TELL them how clever they are. I laugh, I bounce, I clap my hands, and I kiss them as a thank you. But the key is that it’s NOT an act. I LOVE being pampered, spoiled, and taken care of. And I expect to be treated well in Vanilla relationships as well. So I don’t NEED the money to be this super subtle thing because I don’t consider it as taboo. And if it doesn’t need to be subtle it allows me to show a man full appreciation for what he’s doing for me. And that overt appreciation taps into something they love and need.",
                            "author": "AdriannaKing",
                            "id": "gn2gel5",
                            "parent_id": "t1_gn1haiu",
                            "score": 7,
                            "created_utc": 1613144489.0,
                            "replies": [
                                {
                                    "body": "I agree with everything you've said except that their is a professional career path called \"Rinser\".   Almost every experienced SD has run into them.  They are very good at promising or insinuating future intimacy while extracting as much money as possible in the process with no intention of every being intimate.  \n\nDon't blame the SDs, blame the rinsers that have ruined it for SBs.",
                                    "author": "willfromvb",
                                    "id": "gn2ha3v",
                                    "parent_id": "t1_gn2gel5",
                                    "score": 3,
                                    "created_utc": 1613144890.0,
                                    "replies": [
                                        {
                                            "body": "Everyone needs to practice discernment. While there may be rinsers. There are also men that will promise to pay you, have sex with you, and then ghost. Which is, drumroll please, sexual assault. Yes, the woman agreed, but she agreed to sex under a specific set of guidelines. When a pot SD pumps and dumps under the guise of “I’ll pay you after” it’s sexual assault. That’s not an opinion it’s fact based on wording of the law. It’s like agreeing to have sex with a condom and then slipping it off without her knowledge. That’s sexual assault, not just “being a jerk”.\n\nSo again I say, the risk to the woman is WAY higher than the risk to the man. The safety of our body and consequently future mental and emotional health is more important than the safety to your wallet.\n\nUse discernment. Have frank open conversations. And if you’re feeling uncomfortable SAY something to the SB before you get to a point where you’re feeling rinsed. You’re an adult. In an adult relationship. Use your big boy words.",
                                            "author": "AdriannaKing",
                                            "id": "gn2ievi",
                                            "parent_id": "t1_gn2ha3v",
                                            "score": 6,
                                            "created_utc": 1613145406.0,
                                            "replies": [
                                                {
                                                    "body": "Pump & Dump means he paid just lied about his intentions for a long term arrangement. Paying prior to intimacy is different that paying for a full PPM for platonic dates.  Most would agree that providing the allowance prior to intimacy is appropriate.  \n\nJust because sexual assault is more serious than theft doesn't mean the risk of theft should be ignored.  \n\nI actually provide $ gifts for M&Gs and $ gifts for platonic dates and often have several platonic dates before an intimate date.  I do gauge their genuine interest and try to assess if I an being rinsed.   It's not easy. The best rinsers are extremely convinced.  That's why Con Artists are called Con Artists, they gain your confidence.",
                                                    "author": "willfromvb",
                                                    "id": "gn2knti",
                                                    "parent_id": "t1_gn2ievi",
                                                    "score": 2,
                                                    "created_utc": 1613146432.0,
                                                    "replies": [
                                                        {
                                                            "body": "No need to drill the semantics of my pump and dump terminology use, you obviously understand the scenario I was presenting. And I did NOT say the risk of theft should be ignored. I said to use discernment. What I’m saying is the risk to each party is not equally weighted. I really don’t understand why you’re arguing with me when the rest of your post seems fully aligned with what I’m saying.",
                                                            "author": "AdriannaKing",
                                                            "id": "gn2ls11",
                                                            "parent_id": "t1_gn2knti",
                                                            "score": 3,
                                                            "created_utc": 1613146936.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Very good point Azure. As you well know, the dilemma SBs face is how do they differentiate between a real SD and a fake?   Most of the scammed say \"He was so sweet\", or \"we had a connection\",so they can't.\nIn an ideal world they should have a comprehensive discussion about all the issues and agree on them. But we also know IRL that it is often a Hail Mary and hope for the best.",
            "author": "GSSD",
            "id": "gmzktf8",
            "parent_id": "t1_gmzdp2z",
            "score": 7,
            "created_utc": 1613079860.0,
            "replies": [
                {
                    "body": "Yep!  Like I said, I completely agree.  But there's always folks who express or imply that  if an SD doesn't do this automatically, that's a red flag.  Which is beyond ludicrous. There's no red flag -- and in fact she should expect most SDs will be surprised by the request.   But she should play through, stay sweet but absolutely ask for it, for all the reasons you laid out",
                    "author": "Azurecole",
                    "id": "gmzn0j2",
                    "parent_id": "t1_gmzktf8",
                    "score": 2,
                    "created_utc": 1613080837.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "“Egads, I’m taken aback and shocked that an SB is asking for her allowance at the same time that I’m asking her for sex!” * SD waves hankie and faints**\n\nLol, thankfully I’ve never had to ask, because every single SD I’ve gone out with gave it quite nonchalantly beforehand. It’s just common sense!",
            "author": "bunheadxx",
            "id": "gmzy6sp",
            "parent_id": "t1_gmzdp2z",
            "score": 7,
            "created_utc": 1613086099.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gmzyeln",
            "parent_id": "t1_gmzdp2z",
            "score": 4,
            "created_utc": 1613086206.0,
            "replies": [
                {
                    "body": "I think one of the best indicators is how the M&G went.   Was he generous, on his own accord, with a $ gift at the end of M&G?  Did he offer additional platonic dates prior to intimacy?  Did he provide a $ gift after those platonic dates? If you skip a M&G or he doesn't gift at all at the M&G, you need to have a clearer understand of financial expectations and timing of payment.",
                    "author": "willfromvb",
                    "id": "gn1hsr3",
                    "parent_id": "t1_gmzyeln",
                    "score": 7,
                    "created_utc": 1613120483.0,
                    "replies": []
                },
                {
                    "body": "> What would you personally suggest for a SB to do \n\nThis is the point of my OP. You can't tell ahead of time. Most scammers are good at their craft. I think the best thing is to have a discussion before the intimate date. Say something like \" (Pot daddy), I'm really excited(blah blah) but I would appreciate it if you would indulge me when we have our sexy date (tomorrow). Would you mind putting my allowance on the bureau before we get intimate? I don't want to be a nervous Nellie but I'm so afraid we'll get so wrapped up in all the fun that we will forget all about it. Thanks for being understanding!\"  So what are you going to do if he says \"Oh, I won't forget\" and he does not put it out for you?  That's when you say \" Do you have something for me --?\"",
                    "author": "GSSD",
                    "id": "gn2vtl0",
                    "parent_id": "t1_gmzyeln",
                    "score": 6,
                    "created_utc": 1613151329.0,
                    "replies": []
                },
                {
                    "body": "\"I have some wonderful deviant ideas about having fun and they would be even better if we got that pesky financial stuff out of the way first.",
                    "author": "pinotandsugar",
                    "id": "gn0rqqr",
                    "parent_id": "t1_gmzyeln",
                    "score": 3,
                    "created_utc": 1613101529.0,
                    "replies": []
                },
                {
                    "body": "When I talk about a \"good SD\", I think a reasonable definition in this context is: \"gives you your PPM before intimacy without you having to ask, *or* gives you your PPM before intimacy when  you ask\".\n\nI think if the SD doesn't give it to you beforehand on his own, you should ask.  Expect he might be surprised when you do.  Don't panic, it's not a red flag, but hold your ground.  He should give you your PPM.\n\nThat's it.  I'm not suggesting \"don't ask for your PPM beforehand\".  I am suggesting, against the advice of others on this thread, that it's very likely he's never been asked this before and doesn't have the slightest idea that we here on slf have decided it's a norm. But do stick to your guns; if he's your perfect SD, he'll understand and give you your PPM (presumably!)",
                    "author": "Azurecole",
                    "id": "gn00rj2",
                    "parent_id": "t1_gmzyeln",
                    "score": 5,
                    "created_utc": 1613087374.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "gn08lwq",
                            "parent_id": "t1_gn00rj2",
                            "score": 3,
                            "created_utc": 1613091406.0,
                            "replies": [
                                {
                                    "body": "I’ve had to ask before (which I hate with a passion) and this is how I handle it.\nI didn’t ask RIGHT before intimacy. I invited him in and poured him a glass of wine. We sat on the couch to chat. And at a lull I simply said,\n“I’m so happy that we’ve decided to do this. I want us to just relax and be able to really enjoy our time together, so as we go forward when you come see me, it would mean so much to me if we could get my gift out of the way right at the start. Not having to think about it as we’re getting to know one another will do so much to help me relax.”\nHe said yes. And I say, “Thank you for being so understanding, you’re such a sweet gentleman.”",
                                    "author": "AdriannaKing",
                                    "id": "gn0iaty",
                                    "parent_id": "t1_gn08lwq",
                                    "score": 10,
                                    "created_utc": 1613096495.0,
                                    "replies": [
                                        {
                                            "body": "[deleted]",
                                            "author": null,
                                            "id": "gn0oc16",
                                            "parent_id": "t1_gn0iaty",
                                            "score": 2,
                                            "created_utc": 1613099704.0,
                                            "replies": [
                                                {
                                                    "body": "I say that at the first meeting after the meet and greet. I honestly don’t understand the style I see on here of getting money on intimate dates but no money on non-intimate ones. The moment my SD and I agree to go forward my time = money.",
                                                    "author": "AdriannaKing",
                                                    "id": "gn0sae1",
                                                    "parent_id": "t1_gn0oc16",
                                                    "score": 6,
                                                    "created_utc": 1613101830.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "Ironically, I still remember the conversation I was having with some slf SBs when they convinced me I should just give the PPM beforehand.  When I mentioned as one of my justifications for not consistently doing so, \"listen, no SB ever asks for it beforehand anyway; that must mean they don't care much either way\".  These SBs told me, \"nope, that's not it.  she isn't asking beforehand because it's so incredibly awkward, every way she frames it in her head sounds terrible, and she's terrified of how you'll react -- so terrified, she'd rather risk you scamming her rather than asking.  But EVERY SB wishes you'd give it beforehand\".   Made sense to me.  \n\nNo SB has ever asked me, so I can't say from experience what would be great.  I know \"do you have something for me\" is the exact phrase we hear from escorts, and from the stripper once we get to the champagne room, so wouldn't be my favorite coming from my SB, I suppose.  Still, I'm a grown man and would get over my 3 seconds of discomfort regardless.\n\nIn my imagination, I'd react really positively to her coming close, looking almost embarrassed she has to ask, and \"Would you mind if we handled the allowance now so I know it's out of the way and just have fun?\"   I really don't know if someone else is going to tell me how cringy that is, but it'd sound fine to me.",
                                    "author": "Azurecole",
                                    "id": "gn0awcm",
                                    "parent_id": "t1_gn08lwq",
                                    "score": 3,
                                    "created_utc": 1613092615.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Suggested\n\n\"Sweet S Dad, I have spent several hours hearing about your international business deals, holidays in far off lands, flights to your vacation home thousands of miles...... All this experience , each started with your presentation of a paid boarding pass.....",
            "author": "pinotandsugar",
            "id": "gn0rcf6",
            "parent_id": "t1_gmzdp2z",
            "score": 4,
            "created_utc": 1613101310.0,
            "replies": []
        },
        {
            "body": "I think there is a difference between a first intimate date and a 2+ month relationship when it comes to allowance before or after intimacy \n\nSo yes in an new relationship I have no problem handing over allowance in the middle of a date just so no one feels uncomfortable, but if you “ask” at the beginning of a date? We have a problem \n\nTechnically, for me, when it comes to allowance you shouldn’t have to ask. I try to do a weekly or biweekly PayPal transfer the day of our meeting so we are in the same page. You don’t need to ask, and I don’t need to feel like an idiot. \n\nIf I’m waiting until the actual face to face date to transfer or hand over allowance then again i say we have trust issues and bigger problems.",
            "author": "KnocDown",
            "id": "gn205ob",
            "parent_id": "t1_gmzdp2z",
            "score": 3,
            "created_utc": 1613136134.0,
            "replies": [
                {
                    "body": "> So yes in an new relationship I have no problem handing over allowance in the middle of a date just so no one feels uncomfortable, but if you “ask” at the beginning of a date? We have a problem \n\nAsking at the beginning of the date, like down at the restaurant, seems to always lead to those \"I gave her the envelope, she excused herself to go to the bathroom, and then skipped out\" stories.  It might not happen often, but if it's the very first date and she's asking at the restaurant, that's as red a red flag as can be, IMO",
                    "author": "Azurecole",
                    "id": "gn2jr6o",
                    "parent_id": "t1_gn205ob",
                    "score": 3,
                    "created_utc": 1613146018.0,
                    "replies": [
                        {
                            "body": "Bingo \n\nOr the emergency phone call 20 minutes into dinner where she has to leave because her Pomeranian got sick",
                            "author": "KnocDown",
                            "id": "gn2oukn",
                            "parent_id": "t1_gn2jr6o",
                            "score": 2,
                            "created_utc": 1613148309.0,
                            "replies": [
                                {
                                    "body": "OH NO NOT LITTLE CHEW-BARKA!  Get home right now and check on Chew-barka!",
                                    "author": "Azurecole",
                                    "id": "gn2psoa",
                                    "parent_id": "t1_gn2oukn",
                                    "score": 3,
                                    "created_utc": 1613148725.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Interesting you say this. I had an SB where I had given her a gift at the M&G, and the first two intimate dates afterwards was absolutely spectacular. I always just gave her the PPM before hand - first time was in a card, the second time she sat down, was talking about her day, I got her a glass of water, kissed her, and dropped it in her purse. Again, it was hours of totally unbelievable fun after that. \n\nThen came visit three. Something at the beginning felt, I dunno, \"off\". At that point I think I was more concerned with trying to figure out what was bugging her than anything else, and was like \"maybe a full body massage will help ya think better?\" and went to lead her upstairs and she grunted.\n\nI was like, \"huh?\" and she made a gesture of pointing to her purse and did a cutesy little cat meow or whatever. Took me a second to realize it, then was like, \"Oh, I'm sorry\" and the money was right there next to her, so I picked it up and put it in her purse - and then we went upstairs. \n\nAt the time I didn't think about it, but I'll be damned if it wasn't starting to bother the bejeesus out of me. But again, didn't really pay much attention to it.\n\nAfter that - I texted her and she was very, very aloof and then ultimately ghosted me for two weeks. \n\nShe came back, rather busted up that she had met another SD and he totally and completely \"scammed\" her. Promised her the moon and delivered nothing but dick. Literally. We weren't exclusive, so I chose to meet her for dinner and it was like I was talking to a completely different person. \n\nOn that third date when she did that, it really bugged the crap outta me. Ultimately I didn't see her again, cuz, well she had made some decisions with SD#2 that totally defied logic and common sense, but even some of those I would have worked through - but the not budging from the seat before cash on intimate date #3 - (with many hours in between texting, talking, pics of all kinds of stuff, acting like friends, etc.) that one stung. \n\nI understand it I guess - but dammit it stung. It brought home the total facade of the lifestyle.",
            "author": "SDRippington",
            "id": "gmzv3yq",
            "parent_id": "t1_gmzdp2z",
            "score": 3,
            "created_utc": 1613084608.0,
            "replies": [
                {
                    "body": "Yeah, I've never had a SB make a big deal about when I hand her the money but after a little experience I have made it a habit to give it to her as soon as we get back to my place.  \n\nI think it's good to put her at ease that I am not going to try to cheat her.  But I can see where you are coming from, I would think that by date #3 she would know you weren't going to scam her.",
                    "author": "Thomasriddle01",
                    "id": "gn06lng",
                    "parent_id": "t1_gmzv3yq",
                    "score": 4,
                    "created_utc": 1613090369.0,
                    "replies": [
                        {
                            "body": "Especially when date three was at my house FFS. Yeesh. \n\nIt is what it is, I guess :-)",
                            "author": "SDRippington",
                            "id": "gn07as3",
                            "parent_id": "t1_gn06lng",
                            "score": 2,
                            "created_utc": 1613090728.0,
                            "replies": [
                                {
                                    "body": "At date 3 you’re still virtually a stranger. I had a SD short me on purpose after a few dates.",
                                    "author": "AdriannaKing",
                                    "id": "gn0jm8l",
                                    "parent_id": "t1_gn07as3",
                                    "score": 7,
                                    "created_utc": 1613097195.0,
                                    "replies": [
                                        {
                                            "body": "This was at my place. We know all about each other - backgrounds, likes, dislikes, hours and hours spent NOT in an intimate embrace.\n\nIf some asshat dissed you that far into something you thought was real? Put out a contract on him. That's messed up.",
                                            "author": "SDRippington",
                                            "id": "gn0psqs",
                                            "parent_id": "t1_gn0jm8l",
                                            "score": 1,
                                            "created_utc": 1613100476.0,
                                            "replies": [
                                                {
                                                    "body": "Oh it was ages ago and I definitely did not let it slide. He tried to come back months later, full of apologies, but I refused to see him again.\nBut you were talking about date 3. \n\nAnd while you and your SB may know each other well. Think about it beyond your specific relationship. 3 dates is NOT a lot of time to get to know a person, not really. So I don’t think it’s fair to expect ANY person to just trust you completely after three dates.",
                                                    "author": "AdriannaKing",
                                                    "id": "gn0sl1m",
                                                    "parent_id": "t1_gn0psqs",
                                                    "score": 3,
                                                    "created_utc": 1613101995.0,
                                                    "replies": [
                                                        {
                                                            "body": "> 3 dates is NOT a lot of time to get to know a person, not really\n\nOh I totally forgot! And a day before that, I sent her the money to cover all of her advanced class and lab books - which was quite a bit.\n\nAnd for weeks before that it was many days of texts, pics, sharing all manner of things? And we were at my place for the third time FFS. \n\nPretty sure it was obvious I was not going to stiff her. And seriously, if by date 3, at my place, and sharing all of the things we shared and did, if you think I am going to short you a PPM? _Really??_\n\nWell, one thing is for sure - it wasn't a mutual \"Fuck Yes\" in the \"It's Fuck Yes or It's No\" theory of compatible relationships :-)\n\nSo no love lost in any case. She tried hitting me up a few months back. I was cordial but firm - \"Not interested.\"\n\nAnd me saying that to a drop-dead gorgeous redhead (even if she wound up being batshit cray-cray?) says something. At the moment it was ALL about the money? I was pretty sure it wasn't going to last.",
                                                            "author": "SDRippington",
                                                            "id": "gn0xzkv",
                                                            "parent_id": "t1_gn0sl1m",
                                                            "score": 3,
                                                            "created_utc": 1613105120.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gn0qf5x",
            "parent_id": "t1_gn04b1d",
            "score": 4,
            "created_utc": 1613100806.0,
            "replies": []
        },
        {
            "body": "I appreciate your thoughts. It just feels like a damned if you do damned if you don't situation \\*unless\\* the SD is a great guy like it seems like you are but which also seem rare.",
            "author": "Petitjacket",
            "id": "gn04dbv",
            "parent_id": "t1_gmzycby",
            "score": 3,
            "created_utc": 1613089208.0,
            "replies": [
                {
                    "body": "I don't know about a great sd. There are far better and more generous men on slf.\n\nI am honest in my intentions though.",
                    "author": null,
                    "id": "gn04nti",
                    "parent_id": "t1_gn04dbv",
                    "score": -1,
                    "created_utc": 1613089358.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I agree that the covert purse action only adds to the idea that allowance is \"shameful\". Another reason I'm not a fan.\n\nThe \"envelope of cash\" statement only happens once, and at the start. It's to establish 1) that I prefer allowance in cash and 2) to just get out of the way that I'm asking for it before intimacy vs after. That's the only time the convo happens. I could avoid having that convo but there's no way to know we're on the same page without it. If I *knew* an SD would treat things the way you do, the first and every time then sure, I wouldn't have to say anything. But in the early days, how else will we know how to set the tone moving forward?",
            "author": "BlueJayJay82",
            "id": "gn0kdqu",
            "parent_id": "t1_gn06rsi",
            "score": 8,
            "created_utc": 1613097598.0,
            "replies": [
                {
                    "body": "I hear you, I just don't think there's a lot of good options unfortunately",
                    "author": "Azurecole",
                    "id": "gn0mvhh",
                    "parent_id": "t1_gn0kdqu",
                    "score": 1,
                    "created_utc": 1613098929.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "In all my years of sugar dating, I had exactly one SD who did the “conversation with eye contact while holding my hands” when handing me the envelop, telling me how he appreciates me and he wanted me to have this envelope.\n\nI have to say, I AM DEFINITELY NOT A FAN. It was sooooooo incredibly awkward and I cringed so bad every time he did that. \n\nAnd he was someone who’d give me a gigantic stack that was for 2+ months at a time. I would much rather he just put it on top of my purse or jacket.",
            "author": "ExExpectations",
            "id": "gn1jup4",
            "parent_id": "t1_gn06rsi",
            "score": 7,
            "created_utc": 1613122402.0,
            "replies": [
                {
                    "body": "OMG Sandy is that you????!!   I thought you liked it!",
                    "author": "Azurecole",
                    "id": "gn2jho7",
                    "parent_id": "t1_gn1jup4",
                    "score": 2,
                    "created_utc": 1613145898.0,
                    "replies": [
                        {
                            "body": "Men. Always thinking they’ve done or said something awesome for the lady. \n\nWomen. Are always great at faking. We even fake orgasms to appease the men ego.",
                            "author": "ExExpectations",
                            "id": "gn2k45j",
                            "parent_id": "t1_gn2jho7",
                            "score": 4,
                            "created_utc": 1613146183.0,
                            "replies": [
                                {
                                    "body": "Thank goodness for small favors\n\nMore seriously, there's a universe of territory in between \"hey hun, leave the money on the dresser\" and \"hold hands, place her hand on my heart, get all dewey-eyed, and try to touch her soul\".   I think I have the basic skills to just be a person, keep it just a normal thing rather than engaging in spycraft or dresser protocol.  Or I could be over-estimating my own charisma; wouldn't be the first time.  But IMO if you have the basic interpersonal skills, just keeping this as no big deal is the way to go.",
                                    "author": "Azurecole",
                                    "id": "gn34hyw",
                                    "parent_id": "t1_gn2k45j",
                                    "score": 1,
                                    "created_utc": 1613155040.0,
                                    "replies": [
                                        {
                                            "body": "A simple handing it over saying “babe, this is for you” is much less cringy than saying how you appreciate her and how much you care about her and want her to have this \n\nWhich is how you came across 🤪💩just giving one woman’s viewpoint after being on the receiving end of such display",
                                            "author": "ExExpectations",
                                            "id": "gn35acu",
                                            "parent_id": "t1_gn34hyw",
                                            "score": 3,
                                            "created_utc": 1613155383.0,
                                            "replies": [
                                                {
                                                    "body": "Fair! I might have leaned too hard in the description. I do think that the ability to make what could be awkward moments, just a completely normal and accepted part of the interaction, is a simple skill and one worth learning. It's something I actually think I'm really good at, but I've overestimated my prowess at things before LOL",
                                                    "author": "Azurecole",
                                                    "id": "gn39654",
                                                    "parent_id": "t1_gn35acu",
                                                    "score": 1,
                                                    "created_utc": 1613157097.0,
                                                    "replies": [
                                                        {
                                                            "body": "Haha. Maybe you’re actually suave, maybe she’s a good actress. We will never know.",
                                                            "author": "ExExpectations",
                                                            "id": "gn3j0j4",
                                                            "parent_id": "t1_gn39654",
                                                            "score": 2,
                                                            "created_utc": 1613161584.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "And SANDY??? I’m older, but not Sandy-old!",
                            "author": "ExExpectations",
                            "id": "gn4t1n4",
                            "parent_id": "t1_gn2jho7",
                            "score": 1,
                            "created_utc": 1613185328.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "> This really only matters the first few dates anyway, after which the allowance is just part of the scenery.\n\nThis is the key. Get a strong start and it's usually smooth sailing afterwards.",
            "author": "GSSD",
            "id": "gn2su93",
            "parent_id": "t1_gn06rsi",
            "score": 1,
            "created_utc": 1613150054.0,
            "replies": [
                {
                    "body": "Yes I find many of the things we obsess about on slf are basically first & second date only things.\n\nDon't get me wrong, I think there's good reason to obsess on those things -- there's no history or trust built yet, no one wants to be a victim of a scam, and for SBs the consequences of a mistake can be far more serious than just a scam.  \n\nBut I also roll my eyes a little about things being too awkward.  We're adults. The awkwardness, if any, literally tends to last less than 30 seconds, and by the 3rd date, it's gone completely.  I'll deal with feeling a little awkward if it makes my SB feel better; even the things in this thread that I've called out as making me feel awkward, frankly if that's what my SB asks for, I'll deal.  It's really not a huge deal for me to feel awkward for 15 seconds, especially given how amazing she's made me feel the past few hours at dinner, and the next couple of hours in private!",
                    "author": "Azurecole",
                    "id": "gn2uhsd",
                    "parent_id": "t1_gn2su93",
                    "score": 2,
                    "created_utc": 1613150761.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "'I had one take the money and run once )*.\"\n\nIf you have invited someone into your house and they take the money and run you have WON + think about all the bad things the might have happened if she  had stayed.",
            "author": "pinotandsugar",
            "id": "gn0qsls",
            "parent_id": "t1_gmzl7sl",
            "score": 12,
            "created_utc": 1613101008.0,
            "replies": [
                {
                    "body": "Stupid me she told me shw had been scammed she wanted the money outside my house.  Then she did a Usain bolt )*",
                    "author": "wb19081908",
                    "id": "gn0s5tm",
                    "parent_id": "t1_gn0qsls",
                    "score": 6,
                    "created_utc": 1613101760.0,
                    "replies": [
                        {
                            "body": "I’m so sorry this happened to you but why did I laugh imagining her 🏃‍♀️🏃‍♀️\n😂",
                            "author": "Addsomespice_",
                            "id": "gn15eu8",
                            "parent_id": "t1_gn0s5tm",
                            "score": 10,
                            "created_utc": 1613109953.0,
                            "replies": [
                                {
                                    "body": "Yeh its a funny story for sure.  And she wss like 20 and had the balls to pull that off",
                                    "author": "wb19081908",
                                    "id": "gn17f7l",
                                    "parent_id": "t1_gn15eu8",
                                    "score": 5,
                                    "created_utc": 1613111460.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "Lol",
                            "author": "Ambitious_Middle723",
                            "id": "gn2d9l7",
                            "parent_id": "t1_gn0s5tm",
                            "score": 2,
                            "created_utc": 1613143017.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I had one have her pimp knock on the door and then she took off running with the money.\nbut it's easy to see the signs now for me so I just avoid it instead of using it as an excuse for future SBs. \n\nI still rlmuch rather leave the allowance for new SBs out ahead of time so they know they aren't getting scammed.",
            "author": "fallingsd",
            "id": "grd3gzi",
            "parent_id": "t1_gmzl7sl",
            "score": 2,
            "created_utc": 1616077917.0,
            "replies": []
        },
        {
            "body": "Little details like that make a huge difference.\n\nOne should always show respect and care for their partner.",
            "author": "GDarn",
            "id": "gmz5jlw",
            "parent_id": "t1_gmz57lk",
            "score": 16,
            "created_utc": 1613073313.0,
            "replies": []
        },
        {
            "body": "if i obseved a SB exhibit the level of distrust and count out a ppm$$ in front of me it'd be the last time",
            "author": "redtitbandit",
            "id": "gmzdan7",
            "parent_id": "t1_gmz57lk",
            "score": -19,
            "created_utc": 1613076621.0,
            "replies": [
                {
                    "body": "Disagree.  I tell them to count it to check the money is correct.",
                    "author": "wb19081908",
                    "id": "gmzkzsj",
                    "parent_id": "t1_gmzdan7",
                    "score": 19,
                    "created_utc": 1613079940.0,
                    "replies": []
                },
                {
                    "body": "Thankfully I have not had to count the bundle while in his presence or before leaving. But soooooo many women have been conned by men that you shouldn’t take this so personally especially the first couple of times you’re with someone. They may have had bad experiences that you aren’t aware of, and it’s nothing personal when they just want to make sure it doesn’t get repeated again.",
                    "author": "ExExpectations",
                    "id": "gmzly2y",
                    "parent_id": "t1_gmzdan7",
                    "score": 13,
                    "created_utc": 1613080364.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Bad, bad bot!\n\nFootball does not use meters. \\[Grunt, belch, chest thump\\]",
            "author": "sfwinefan",
            "id": "gmz4n8j",
            "parent_id": "t1_gmz3t9n",
            "score": 10,
            "created_utc": 1613072935.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "gmz5biw",
                    "parent_id": "t1_gmz4n8j",
                    "score": 8,
                    "created_utc": 1613073218.0,
                    "replies": [
                        {
                            "body": "You're thinking baseball ... which is also not metric (90 feet and the magical 60 feet 6 inches which is naturally meaningless for the heathen who demand metric measurements). Football has too much padding for those to really be meaningful in the same way.",
                            "author": "sfwinefan",
                            "id": "gmz6n9v",
                            "parent_id": "t1_gmz5biw",
                            "score": 5,
                            "created_utc": 1613073778.0,
                            "replies": [
                                {
                                    "body": "6 inches is 15.24 cm",
                                    "author": "converter-bot",
                                    "id": "gmz6o9l",
                                    "parent_id": "t1_gmz6n9v",
                                    "score": -1,
                                    "created_utc": 1613073791.0,
                                    "replies": [
                                        {
                                            "body": "Bad bot",
                                            "author": "sfwinefan",
                                            "id": "gmz6r7m",
                                            "parent_id": "t1_gmz6o9l",
                                            "score": 3,
                                            "created_utc": 1613073827.0,
                                            "replies": [
                                                {
                                                    "body": "At this point I think the bot is just trolling.",
                                                    "author": "Thomasriddle01",
                                                    "id": "gn05pta",
                                                    "parent_id": "t1_gmz6r7m",
                                                    "score": 6,
                                                    "created_utc": 1613089905.0,
                                                    "replies": []
                                                },
                                                {
                                                    "body": "Thank you, sfwinefan, for voting on converter-bot.\n\nThis bot wants to find the best and worst bots on Reddit. [You can view results here](https://botrank.pastimes.eu/).\n\n***\n\n^(Even if I don't reply to your comment, I'm still listening for votes. Check the webpage to see if your vote registered!)",
                                                    "author": "B0tRank",
                                                    "id": "gmz6sc8",
                                                    "parent_id": "t1_gmz6r7m",
                                                    "score": 0,
                                                    "created_utc": 1613073840.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Does anyone have the sd use Venmo or cashapp for transactions or is it usually always cash?",
            "author": "apb2016",
            "id": "gn09e11",
            "parent_id": "t1_gmznv27",
            "score": 2,
            "created_utc": 1613091814.0,
            "replies": [
                {
                    "body": "I’m in Canada. For me it has mostly been cash. Though I had one that lived out of town so he would e-transfer it to me from his bank account directly to me. (We were on a monthly allowance but sent to me as 4 weekly deposits). It was nice because sometimes he couldn’t make it to town for that weekend but he would always still send my weekly amount.",
                    "author": "AdriannaKing",
                    "id": "gn0h5ir",
                    "parent_id": "t1_gn09e11",
                    "score": 4,
                    "created_utc": 1613095890.0,
                    "replies": [
                        {
                            "body": "Now that is the way I envisioned it. Handing over cash before intimacy seems much more like paying for a hooker.  Unless the relationship is only about sex then I suppose that’s alright. I would prefer to set the monthly allowance, pay it weekly or monthly via Venmo or whatever. Cash never changes hands. But you need to have a level of trust.",
                            "author": "apb2016",
                            "id": "gn0hzdo",
                            "parent_id": "t1_gn0h5ir",
                            "score": 1,
                            "created_utc": 1613096326.0,
                            "replies": [
                                {
                                    "body": "> But you need to have a level of trust.\n\nThat is the challenge.  In any relationship, but especially in a sugar relationship, trust is very important.   When the money is given, how the money is given and the timing of sex and payment are delicate dances.",
                                    "author": "willfromvb",
                                    "id": "gn1hh20",
                                    "parent_id": "t1_gn0hzdo",
                                    "score": 3,
                                    "created_utc": 1613120184.0,
                                    "replies": []
                                },
                                {
                                    "body": "It’s exactly the same as paying for a hooker.",
                                    "author": "BigSugar44",
                                    "id": "gn1i6bc",
                                    "parent_id": "t1_gn0hzdo",
                                    "score": 0,
                                    "created_utc": 1613120831.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Yes. Venmo or PayPal or cashapp or zelle - I’ve gotten it in all these forms. But only after we’ve known each other for a while.",
                    "author": "ExExpectations",
                    "id": "gn1k4ah",
                    "parent_id": "t1_gn09e11",
                    "score": 3,
                    "created_utc": 1613122657.0,
                    "replies": []
                },
                {
                    "body": "Almost always.\n\nAnd to me, if someone pulls the \"Usain Bolt\" over a PPM? I'd far FAR rather be out the PPM and have them stay WELL away from me, than deal with their drama over time. \n\nBest to get that BS outta the way so I can enjoy a real SR.",
                    "author": "SDRippington",
                    "id": "gn2kox5",
                    "parent_id": "t1_gn09e11",
                    "score": 3,
                    "created_utc": 1613146446.0,
                    "replies": []
                }
            ]
        },
        {
            "body": ">The risk to me is WAY greater than the risk to him.\n\nAgree, it's not even close.\n\nLike I said, I've never once\\\\been asked for it beforehand (although I've been just giving it voluntarily beforehand for a few years now, since some slf SBs convinced me it was the right thing to do).  But whenever we have a thread on \"has an SB ever asked you for PPM before sex?\" it ends up a barrage of SDs saying \"nope, no one has ever asked\".  It's a pretty universal experience on the SD side... although at this point, I think the vast majority of SDs on slf give it beforehand without having to be asked.",
            "author": "Azurecole",
            "id": "gmzoes4",
            "parent_id": "t1_gmznv27",
            "score": 2,
            "created_utc": 1613081480.0,
            "replies": []
        },
        {
            "body": "Have you been given a $ gift at a M&G or on platonic dates?  Did they give the gift at the start of the date or the end?  \n\nI believe if you've had multiple platonic dates where a $ gift has been provided at the end of each platonic date, the SD has built some credibility.",
            "author": "willfromvb",
            "id": "gn1haiu",
            "parent_id": "t1_gmznv27",
            "score": 1,
            "created_utc": 1613120022.0,
            "replies": [
                {
                    "body": "I’m going to say “yes” to every scenario listed. I have been given a monetary gift at a meet and greet. It was... around the beginning, after I had settled in and ordered a cocktail. He said it was an extra thank you for coming so elegantly put together. (I’m in my early 30’s so my style is a bit more sexy/elegant/sophisticated/refined instead of cute college student).\n\nYes I’ve been gifted on platonic dates. And like I said before, I HONESTLY don’t get the SFL insistance on differentiating between platonic and intimate dates. If you’re doing ppm it’s pay per MEET not pay per sex act. \n\nAnd yes, if you’re getting to know one another and have multiple platonic dates a gift at the end will go a huge way to building up trust. If you don’t want an escort don’t treat her like one by insisting on not gifting unless there’s intimacy on the date. Otherwise you’re basically telling her “you don’t get a thing until you fuck me.” And that just feels gross. This subreddit seems to have a general cognitive dissonance about that. It also prevents putting your SB in the horribly awkward position of trying to figure out if you’re legit or not.\n\n*Note: I am extremely feminine. So I tend to attract men that like that. I’m gifted at the start of dates and one of the reasons why is possibly because men LOVE seeing my reaction to being gifted and treated well. THEY can’t wait to gift me. It was even turned into a game at one point with one of my SDs. “It’s hiding somewhere in this room, I’ll give you a clue.” And then you drink wine and have a mini scavenger hunt. But the key to this is that I make a HUGE production about finding it. It was a fun game so I TELL them it was fun. I TELL them how clever they are. I laugh, I bounce, I clap my hands, and I kiss them as a thank you. But the key is that it’s NOT an act. I LOVE being pampered, spoiled, and taken care of. And I expect to be treated well in Vanilla relationships as well. So I don’t NEED the money to be this super subtle thing because I don’t consider it as taboo. And if it doesn’t need to be subtle it allows me to show a man full appreciation for what he’s doing for me. And that overt appreciation taps into something they love and need.",
                    "author": "AdriannaKing",
                    "id": "gn2gel5",
                    "parent_id": "t1_gn1haiu",
                    "score": 7,
                    "created_utc": 1613144489.0,
                    "replies": [
                        {
                            "body": "I agree with everything you've said except that their is a professional career path called \"Rinser\".   Almost every experienced SD has run into them.  They are very good at promising or insinuating future intimacy while extracting as much money as possible in the process with no intention of every being intimate.  \n\nDon't blame the SDs, blame the rinsers that have ruined it for SBs.",
                            "author": "willfromvb",
                            "id": "gn2ha3v",
                            "parent_id": "t1_gn2gel5",
                            "score": 3,
                            "created_utc": 1613144890.0,
                            "replies": [
                                {
                                    "body": "Everyone needs to practice discernment. While there may be rinsers. There are also men that will promise to pay you, have sex with you, and then ghost. Which is, drumroll please, sexual assault. Yes, the woman agreed, but she agreed to sex under a specific set of guidelines. When a pot SD pumps and dumps under the guise of “I’ll pay you after” it’s sexual assault. That’s not an opinion it’s fact based on wording of the law. It’s like agreeing to have sex with a condom and then slipping it off without her knowledge. That’s sexual assault, not just “being a jerk”.\n\nSo again I say, the risk to the woman is WAY higher than the risk to the man. The safety of our body and consequently future mental and emotional health is more important than the safety to your wallet.\n\nUse discernment. Have frank open conversations. And if you’re feeling uncomfortable SAY something to the SB before you get to a point where you’re feeling rinsed. You’re an adult. In an adult relationship. Use your big boy words.",
                                    "author": "AdriannaKing",
                                    "id": "gn2ievi",
                                    "parent_id": "t1_gn2ha3v",
                                    "score": 6,
                                    "created_utc": 1613145406.0,
                                    "replies": [
                                        {
                                            "body": "Pump & Dump means he paid just lied about his intentions for a long term arrangement. Paying prior to intimacy is different that paying for a full PPM for platonic dates.  Most would agree that providing the allowance prior to intimacy is appropriate.  \n\nJust because sexual assault is more serious than theft doesn't mean the risk of theft should be ignored.  \n\nI actually provide $ gifts for M&Gs and $ gifts for platonic dates and often have several platonic dates before an intimate date.  I do gauge their genuine interest and try to assess if I an being rinsed.   It's not easy. The best rinsers are extremely convinced.  That's why Con Artists are called Con Artists, they gain your confidence.",
                                            "author": "willfromvb",
                                            "id": "gn2knti",
                                            "parent_id": "t1_gn2ievi",
                                            "score": 2,
                                            "created_utc": 1613146432.0,
                                            "replies": [
                                                {
                                                    "body": "No need to drill the semantics of my pump and dump terminology use, you obviously understand the scenario I was presenting. And I did NOT say the risk of theft should be ignored. I said to use discernment. What I’m saying is the risk to each party is not equally weighted. I really don’t understand why you’re arguing with me when the rest of your post seems fully aligned with what I’m saying.",
                                                    "author": "AdriannaKing",
                                                    "id": "gn2ls11",
                                                    "parent_id": "t1_gn2knti",
                                                    "score": 3,
                                                    "created_utc": 1613146936.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Yep!  Like I said, I completely agree.  But there's always folks who express or imply that  if an SD doesn't do this automatically, that's a red flag.  Which is beyond ludicrous. There's no red flag -- and in fact she should expect most SDs will be surprised by the request.   But she should play through, stay sweet but absolutely ask for it, for all the reasons you laid out",
            "author": "Azurecole",
            "id": "gmzn0j2",
            "parent_id": "t1_gmzktf8",
            "score": 2,
            "created_utc": 1613080837.0,
            "replies": []
        },
        {
            "body": "I think one of the best indicators is how the M&G went.   Was he generous, on his own accord, with a $ gift at the end of M&G?  Did he offer additional platonic dates prior to intimacy?  Did he provide a $ gift after those platonic dates? If you skip a M&G or he doesn't gift at all at the M&G, you need to have a clearer understand of financial expectations and timing of payment.",
            "author": "willfromvb",
            "id": "gn1hsr3",
            "parent_id": "t1_gmzyeln",
            "score": 7,
            "created_utc": 1613120483.0,
            "replies": []
        },
        {
            "body": "> What would you personally suggest for a SB to do \n\nThis is the point of my OP. You can't tell ahead of time. Most scammers are good at their craft. I think the best thing is to have a discussion before the intimate date. Say something like \" (Pot daddy), I'm really excited(blah blah) but I would appreciate it if you would indulge me when we have our sexy date (tomorrow). Would you mind putting my allowance on the bureau before we get intimate? I don't want to be a nervous Nellie but I'm so afraid we'll get so wrapped up in all the fun that we will forget all about it. Thanks for being understanding!\"  So what are you going to do if he says \"Oh, I won't forget\" and he does not put it out for you?  That's when you say \" Do you have something for me --?\"",
            "author": "GSSD",
            "id": "gn2vtl0",
            "parent_id": "t1_gmzyeln",
            "score": 6,
            "created_utc": 1613151329.0,
            "replies": []
        },
        {
            "body": "\"I have some wonderful deviant ideas about having fun and they would be even better if we got that pesky financial stuff out of the way first.",
            "author": "pinotandsugar",
            "id": "gn0rqqr",
            "parent_id": "t1_gmzyeln",
            "score": 3,
            "created_utc": 1613101529.0,
            "replies": []
        },
        {
            "body": "When I talk about a \"good SD\", I think a reasonable definition in this context is: \"gives you your PPM before intimacy without you having to ask, *or* gives you your PPM before intimacy when  you ask\".\n\nI think if the SD doesn't give it to you beforehand on his own, you should ask.  Expect he might be surprised when you do.  Don't panic, it's not a red flag, but hold your ground.  He should give you your PPM.\n\nThat's it.  I'm not suggesting \"don't ask for your PPM beforehand\".  I am suggesting, against the advice of others on this thread, that it's very likely he's never been asked this before and doesn't have the slightest idea that we here on slf have decided it's a norm. But do stick to your guns; if he's your perfect SD, he'll understand and give you your PPM (presumably!)",
            "author": "Azurecole",
            "id": "gn00rj2",
            "parent_id": "t1_gmzyeln",
            "score": 5,
            "created_utc": 1613087374.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "gn08lwq",
                    "parent_id": "t1_gn00rj2",
                    "score": 3,
                    "created_utc": 1613091406.0,
                    "replies": [
                        {
                            "body": "I’ve had to ask before (which I hate with a passion) and this is how I handle it.\nI didn’t ask RIGHT before intimacy. I invited him in and poured him a glass of wine. We sat on the couch to chat. And at a lull I simply said,\n“I’m so happy that we’ve decided to do this. I want us to just relax and be able to really enjoy our time together, so as we go forward when you come see me, it would mean so much to me if we could get my gift out of the way right at the start. Not having to think about it as we’re getting to know one another will do so much to help me relax.”\nHe said yes. And I say, “Thank you for being so understanding, you’re such a sweet gentleman.”",
                            "author": "AdriannaKing",
                            "id": "gn0iaty",
                            "parent_id": "t1_gn08lwq",
                            "score": 10,
                            "created_utc": 1613096495.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "gn0oc16",
                                    "parent_id": "t1_gn0iaty",
                                    "score": 2,
                                    "created_utc": 1613099704.0,
                                    "replies": [
                                        {
                                            "body": "I say that at the first meeting after the meet and greet. I honestly don’t understand the style I see on here of getting money on intimate dates but no money on non-intimate ones. The moment my SD and I agree to go forward my time = money.",
                                            "author": "AdriannaKing",
                                            "id": "gn0sae1",
                                            "parent_id": "t1_gn0oc16",
                                            "score": 6,
                                            "created_utc": 1613101830.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "Ironically, I still remember the conversation I was having with some slf SBs when they convinced me I should just give the PPM beforehand.  When I mentioned as one of my justifications for not consistently doing so, \"listen, no SB ever asks for it beforehand anyway; that must mean they don't care much either way\".  These SBs told me, \"nope, that's not it.  she isn't asking beforehand because it's so incredibly awkward, every way she frames it in her head sounds terrible, and she's terrified of how you'll react -- so terrified, she'd rather risk you scamming her rather than asking.  But EVERY SB wishes you'd give it beforehand\".   Made sense to me.  \n\nNo SB has ever asked me, so I can't say from experience what would be great.  I know \"do you have something for me\" is the exact phrase we hear from escorts, and from the stripper once we get to the champagne room, so wouldn't be my favorite coming from my SB, I suppose.  Still, I'm a grown man and would get over my 3 seconds of discomfort regardless.\n\nIn my imagination, I'd react really positively to her coming close, looking almost embarrassed she has to ask, and \"Would you mind if we handled the allowance now so I know it's out of the way and just have fun?\"   I really don't know if someone else is going to tell me how cringy that is, but it'd sound fine to me.",
                            "author": "Azurecole",
                            "id": "gn0awcm",
                            "parent_id": "t1_gn08lwq",
                            "score": 3,
                            "created_utc": 1613092615.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "> So yes in an new relationship I have no problem handing over allowance in the middle of a date just so no one feels uncomfortable, but if you “ask” at the beginning of a date? We have a problem \n\nAsking at the beginning of the date, like down at the restaurant, seems to always lead to those \"I gave her the envelope, she excused herself to go to the bathroom, and then skipped out\" stories.  It might not happen often, but if it's the very first date and she's asking at the restaurant, that's as red a red flag as can be, IMO",
            "author": "Azurecole",
            "id": "gn2jr6o",
            "parent_id": "t1_gn205ob",
            "score": 3,
            "created_utc": 1613146018.0,
            "replies": [
                {
                    "body": "Bingo \n\nOr the emergency phone call 20 minutes into dinner where she has to leave because her Pomeranian got sick",
                    "author": "KnocDown",
                    "id": "gn2oukn",
                    "parent_id": "t1_gn2jr6o",
                    "score": 2,
                    "created_utc": 1613148309.0,
                    "replies": [
                        {
                            "body": "OH NO NOT LITTLE CHEW-BARKA!  Get home right now and check on Chew-barka!",
                            "author": "Azurecole",
                            "id": "gn2psoa",
                            "parent_id": "t1_gn2oukn",
                            "score": 3,
                            "created_utc": 1613148725.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Yeah, I've never had a SB make a big deal about when I hand her the money but after a little experience I have made it a habit to give it to her as soon as we get back to my place.  \n\nI think it's good to put her at ease that I am not going to try to cheat her.  But I can see where you are coming from, I would think that by date #3 she would know you weren't going to scam her.",
            "author": "Thomasriddle01",
            "id": "gn06lng",
            "parent_id": "t1_gmzv3yq",
            "score": 4,
            "created_utc": 1613090369.0,
            "replies": [
                {
                    "body": "Especially when date three was at my house FFS. Yeesh. \n\nIt is what it is, I guess :-)",
                    "author": "SDRippington",
                    "id": "gn07as3",
                    "parent_id": "t1_gn06lng",
                    "score": 2,
                    "created_utc": 1613090728.0,
                    "replies": [
                        {
                            "body": "At date 3 you’re still virtually a stranger. I had a SD short me on purpose after a few dates.",
                            "author": "AdriannaKing",
                            "id": "gn0jm8l",
                            "parent_id": "t1_gn07as3",
                            "score": 7,
                            "created_utc": 1613097195.0,
                            "replies": [
                                {
                                    "body": "This was at my place. We know all about each other - backgrounds, likes, dislikes, hours and hours spent NOT in an intimate embrace.\n\nIf some asshat dissed you that far into something you thought was real? Put out a contract on him. That's messed up.",
                                    "author": "SDRippington",
                                    "id": "gn0psqs",
                                    "parent_id": "t1_gn0jm8l",
                                    "score": 1,
                                    "created_utc": 1613100476.0,
                                    "replies": [
                                        {
                                            "body": "Oh it was ages ago and I definitely did not let it slide. He tried to come back months later, full of apologies, but I refused to see him again.\nBut you were talking about date 3. \n\nAnd while you and your SB may know each other well. Think about it beyond your specific relationship. 3 dates is NOT a lot of time to get to know a person, not really. So I don’t think it’s fair to expect ANY person to just trust you completely after three dates.",
                                            "author": "AdriannaKing",
                                            "id": "gn0sl1m",
                                            "parent_id": "t1_gn0psqs",
                                            "score": 3,
                                            "created_utc": 1613101995.0,
                                            "replies": [
                                                {
                                                    "body": "> 3 dates is NOT a lot of time to get to know a person, not really\n\nOh I totally forgot! And a day before that, I sent her the money to cover all of her advanced class and lab books - which was quite a bit.\n\nAnd for weeks before that it was many days of texts, pics, sharing all manner of things? And we were at my place for the third time FFS. \n\nPretty sure it was obvious I was not going to stiff her. And seriously, if by date 3, at my place, and sharing all of the things we shared and did, if you think I am going to short you a PPM? _Really??_\n\nWell, one thing is for sure - it wasn't a mutual \"Fuck Yes\" in the \"It's Fuck Yes or It's No\" theory of compatible relationships :-)\n\nSo no love lost in any case. She tried hitting me up a few months back. I was cordial but firm - \"Not interested.\"\n\nAnd me saying that to a drop-dead gorgeous redhead (even if she wound up being batshit cray-cray?) says something. At the moment it was ALL about the money? I was pretty sure it wasn't going to last.",
                                                    "author": "SDRippington",
                                                    "id": "gn0xzkv",
                                                    "parent_id": "t1_gn0sl1m",
                                                    "score": 3,
                                                    "created_utc": 1613105120.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I don't know about a great sd. There are far better and more generous men on slf.\n\nI am honest in my intentions though.",
            "author": null,
            "id": "gn04nti",
            "parent_id": "t1_gn04dbv",
            "score": -1,
            "created_utc": 1613089358.0,
            "replies": []
        },
        {
            "body": "I hear you, I just don't think there's a lot of good options unfortunately",
            "author": "Azurecole",
            "id": "gn0mvhh",
            "parent_id": "t1_gn0kdqu",
            "score": 1,
            "created_utc": 1613098929.0,
            "replies": []
        },
        {
            "body": "OMG Sandy is that you????!!   I thought you liked it!",
            "author": "Azurecole",
            "id": "gn2jho7",
            "parent_id": "t1_gn1jup4",
            "score": 2,
            "created_utc": 1613145898.0,
            "replies": [
                {
                    "body": "Men. Always thinking they’ve done or said something awesome for the lady. \n\nWomen. Are always great at faking. We even fake orgasms to appease the men ego.",
                    "author": "ExExpectations",
                    "id": "gn2k45j",
                    "parent_id": "t1_gn2jho7",
                    "score": 4,
                    "created_utc": 1613146183.0,
                    "replies": [
                        {
                            "body": "Thank goodness for small favors\n\nMore seriously, there's a universe of territory in between \"hey hun, leave the money on the dresser\" and \"hold hands, place her hand on my heart, get all dewey-eyed, and try to touch her soul\".   I think I have the basic skills to just be a person, keep it just a normal thing rather than engaging in spycraft or dresser protocol.  Or I could be over-estimating my own charisma; wouldn't be the first time.  But IMO if you have the basic interpersonal skills, just keeping this as no big deal is the way to go.",
                            "author": "Azurecole",
                            "id": "gn34hyw",
                            "parent_id": "t1_gn2k45j",
                            "score": 1,
                            "created_utc": 1613155040.0,
                            "replies": [
                                {
                                    "body": "A simple handing it over saying “babe, this is for you” is much less cringy than saying how you appreciate her and how much you care about her and want her to have this \n\nWhich is how you came across 🤪💩just giving one woman’s viewpoint after being on the receiving end of such display",
                                    "author": "ExExpectations",
                                    "id": "gn35acu",
                                    "parent_id": "t1_gn34hyw",
                                    "score": 3,
                                    "created_utc": 1613155383.0,
                                    "replies": [
                                        {
                                            "body": "Fair! I might have leaned too hard in the description. I do think that the ability to make what could be awkward moments, just a completely normal and accepted part of the interaction, is a simple skill and one worth learning. It's something I actually think I'm really good at, but I've overestimated my prowess at things before LOL",
                                            "author": "Azurecole",
                                            "id": "gn39654",
                                            "parent_id": "t1_gn35acu",
                                            "score": 1,
                                            "created_utc": 1613157097.0,
                                            "replies": [
                                                {
                                                    "body": "Haha. Maybe you’re actually suave, maybe she’s a good actress. We will never know.",
                                                    "author": "ExExpectations",
                                                    "id": "gn3j0j4",
                                                    "parent_id": "t1_gn39654",
                                                    "score": 2,
                                                    "created_utc": 1613161584.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "And SANDY??? I’m older, but not Sandy-old!",
                    "author": "ExExpectations",
                    "id": "gn4t1n4",
                    "parent_id": "t1_gn2jho7",
                    "score": 1,
                    "created_utc": 1613185328.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Yes I find many of the things we obsess about on slf are basically first & second date only things.\n\nDon't get me wrong, I think there's good reason to obsess on those things -- there's no history or trust built yet, no one wants to be a victim of a scam, and for SBs the consequences of a mistake can be far more serious than just a scam.  \n\nBut I also roll my eyes a little about things being too awkward.  We're adults. The awkwardness, if any, literally tends to last less than 30 seconds, and by the 3rd date, it's gone completely.  I'll deal with feeling a little awkward if it makes my SB feel better; even the things in this thread that I've called out as making me feel awkward, frankly if that's what my SB asks for, I'll deal.  It's really not a huge deal for me to feel awkward for 15 seconds, especially given how amazing she's made me feel the past few hours at dinner, and the next couple of hours in private!",
            "author": "Azurecole",
            "id": "gn2uhsd",
            "parent_id": "t1_gn2su93",
            "score": 2,
            "created_utc": 1613150761.0,
            "replies": []
        },
        {
            "body": "Stupid me she told me shw had been scammed she wanted the money outside my house.  Then she did a Usain bolt )*",
            "author": "wb19081908",
            "id": "gn0s5tm",
            "parent_id": "t1_gn0qsls",
            "score": 6,
            "created_utc": 1613101760.0,
            "replies": [
                {
                    "body": "I’m so sorry this happened to you but why did I laugh imagining her 🏃‍♀️🏃‍♀️\n😂",
                    "author": "Addsomespice_",
                    "id": "gn15eu8",
                    "parent_id": "t1_gn0s5tm",
                    "score": 10,
                    "created_utc": 1613109953.0,
                    "replies": [
                        {
                            "body": "Yeh its a funny story for sure.  And she wss like 20 and had the balls to pull that off",
                            "author": "wb19081908",
                            "id": "gn17f7l",
                            "parent_id": "t1_gn15eu8",
                            "score": 5,
                            "created_utc": 1613111460.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Lol",
                    "author": "Ambitious_Middle723",
                    "id": "gn2d9l7",
                    "parent_id": "t1_gn0s5tm",
                    "score": 2,
                    "created_utc": 1613143017.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Disagree.  I tell them to count it to check the money is correct.",
            "author": "wb19081908",
            "id": "gmzkzsj",
            "parent_id": "t1_gmzdan7",
            "score": 19,
            "created_utc": 1613079940.0,
            "replies": []
        },
        {
            "body": "Thankfully I have not had to count the bundle while in his presence or before leaving. But soooooo many women have been conned by men that you shouldn’t take this so personally especially the first couple of times you’re with someone. They may have had bad experiences that you aren’t aware of, and it’s nothing personal when they just want to make sure it doesn’t get repeated again.",
            "author": "ExExpectations",
            "id": "gmzly2y",
            "parent_id": "t1_gmzdan7",
            "score": 13,
            "created_utc": 1613080364.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gmz5biw",
            "parent_id": "t1_gmz4n8j",
            "score": 8,
            "created_utc": 1613073218.0,
            "replies": [
                {
                    "body": "You're thinking baseball ... which is also not metric (90 feet and the magical 60 feet 6 inches which is naturally meaningless for the heathen who demand metric measurements). Football has too much padding for those to really be meaningful in the same way.",
                    "author": "sfwinefan",
                    "id": "gmz6n9v",
                    "parent_id": "t1_gmz5biw",
                    "score": 5,
                    "created_utc": 1613073778.0,
                    "replies": [
                        {
                            "body": "6 inches is 15.24 cm",
                            "author": "converter-bot",
                            "id": "gmz6o9l",
                            "parent_id": "t1_gmz6n9v",
                            "score": -1,
                            "created_utc": 1613073791.0,
                            "replies": [
                                {
                                    "body": "Bad bot",
                                    "author": "sfwinefan",
                                    "id": "gmz6r7m",
                                    "parent_id": "t1_gmz6o9l",
                                    "score": 3,
                                    "created_utc": 1613073827.0,
                                    "replies": [
                                        {
                                            "body": "At this point I think the bot is just trolling.",
                                            "author": "Thomasriddle01",
                                            "id": "gn05pta",
                                            "parent_id": "t1_gmz6r7m",
                                            "score": 6,
                                            "created_utc": 1613089905.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "Thank you, sfwinefan, for voting on converter-bot.\n\nThis bot wants to find the best and worst bots on Reddit. [You can view results here](https://botrank.pastimes.eu/).\n\n***\n\n^(Even if I don't reply to your comment, I'm still listening for votes. Check the webpage to see if your vote registered!)",
                                            "author": "B0tRank",
                                            "id": "gmz6sc8",
                                            "parent_id": "t1_gmz6r7m",
                                            "score": 0,
                                            "created_utc": 1613073840.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I’m in Canada. For me it has mostly been cash. Though I had one that lived out of town so he would e-transfer it to me from his bank account directly to me. (We were on a monthly allowance but sent to me as 4 weekly deposits). It was nice because sometimes he couldn’t make it to town for that weekend but he would always still send my weekly amount.",
            "author": "AdriannaKing",
            "id": "gn0h5ir",
            "parent_id": "t1_gn09e11",
            "score": 4,
            "created_utc": 1613095890.0,
            "replies": [
                {
                    "body": "Now that is the way I envisioned it. Handing over cash before intimacy seems much more like paying for a hooker.  Unless the relationship is only about sex then I suppose that’s alright. I would prefer to set the monthly allowance, pay it weekly or monthly via Venmo or whatever. Cash never changes hands. But you need to have a level of trust.",
                    "author": "apb2016",
                    "id": "gn0hzdo",
                    "parent_id": "t1_gn0h5ir",
                    "score": 1,
                    "created_utc": 1613096326.0,
                    "replies": [
                        {
                            "body": "> But you need to have a level of trust.\n\nThat is the challenge.  In any relationship, but especially in a sugar relationship, trust is very important.   When the money is given, how the money is given and the timing of sex and payment are delicate dances.",
                            "author": "willfromvb",
                            "id": "gn1hh20",
                            "parent_id": "t1_gn0hzdo",
                            "score": 3,
                            "created_utc": 1613120184.0,
                            "replies": []
                        },
                        {
                            "body": "It’s exactly the same as paying for a hooker.",
                            "author": "BigSugar44",
                            "id": "gn1i6bc",
                            "parent_id": "t1_gn0hzdo",
                            "score": 0,
                            "created_utc": 1613120831.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Yes. Venmo or PayPal or cashapp or zelle - I’ve gotten it in all these forms. But only after we’ve known each other for a while.",
            "author": "ExExpectations",
            "id": "gn1k4ah",
            "parent_id": "t1_gn09e11",
            "score": 3,
            "created_utc": 1613122657.0,
            "replies": []
        },
        {
            "body": "Almost always.\n\nAnd to me, if someone pulls the \"Usain Bolt\" over a PPM? I'd far FAR rather be out the PPM and have them stay WELL away from me, than deal with their drama over time. \n\nBest to get that BS outta the way so I can enjoy a real SR.",
            "author": "SDRippington",
            "id": "gn2kox5",
            "parent_id": "t1_gn09e11",
            "score": 3,
            "created_utc": 1613146446.0,
            "replies": []
        },
        {
            "body": "I’m going to say “yes” to every scenario listed. I have been given a monetary gift at a meet and greet. It was... around the beginning, after I had settled in and ordered a cocktail. He said it was an extra thank you for coming so elegantly put together. (I’m in my early 30’s so my style is a bit more sexy/elegant/sophisticated/refined instead of cute college student).\n\nYes I’ve been gifted on platonic dates. And like I said before, I HONESTLY don’t get the SFL insistance on differentiating between platonic and intimate dates. If you’re doing ppm it’s pay per MEET not pay per sex act. \n\nAnd yes, if you’re getting to know one another and have multiple platonic dates a gift at the end will go a huge way to building up trust. If you don’t want an escort don’t treat her like one by insisting on not gifting unless there’s intimacy on the date. Otherwise you’re basically telling her “you don’t get a thing until you fuck me.” And that just feels gross. This subreddit seems to have a general cognitive dissonance about that. It also prevents putting your SB in the horribly awkward position of trying to figure out if you’re legit or not.\n\n*Note: I am extremely feminine. So I tend to attract men that like that. I’m gifted at the start of dates and one of the reasons why is possibly because men LOVE seeing my reaction to being gifted and treated well. THEY can’t wait to gift me. It was even turned into a game at one point with one of my SDs. “It’s hiding somewhere in this room, I’ll give you a clue.” And then you drink wine and have a mini scavenger hunt. But the key to this is that I make a HUGE production about finding it. It was a fun game so I TELL them it was fun. I TELL them how clever they are. I laugh, I bounce, I clap my hands, and I kiss them as a thank you. But the key is that it’s NOT an act. I LOVE being pampered, spoiled, and taken care of. And I expect to be treated well in Vanilla relationships as well. So I don’t NEED the money to be this super subtle thing because I don’t consider it as taboo. And if it doesn’t need to be subtle it allows me to show a man full appreciation for what he’s doing for me. And that overt appreciation taps into something they love and need.",
            "author": "AdriannaKing",
            "id": "gn2gel5",
            "parent_id": "t1_gn1haiu",
            "score": 7,
            "created_utc": 1613144489.0,
            "replies": [
                {
                    "body": "I agree with everything you've said except that their is a professional career path called \"Rinser\".   Almost every experienced SD has run into them.  They are very good at promising or insinuating future intimacy while extracting as much money as possible in the process with no intention of every being intimate.  \n\nDon't blame the SDs, blame the rinsers that have ruined it for SBs.",
                    "author": "willfromvb",
                    "id": "gn2ha3v",
                    "parent_id": "t1_gn2gel5",
                    "score": 3,
                    "created_utc": 1613144890.0,
                    "replies": [
                        {
                            "body": "Everyone needs to practice discernment. While there may be rinsers. There are also men that will promise to pay you, have sex with you, and then ghost. Which is, drumroll please, sexual assault. Yes, the woman agreed, but she agreed to sex under a specific set of guidelines. When a pot SD pumps and dumps under the guise of “I’ll pay you after” it’s sexual assault. That’s not an opinion it’s fact based on wording of the law. It’s like agreeing to have sex with a condom and then slipping it off without her knowledge. That’s sexual assault, not just “being a jerk”.\n\nSo again I say, the risk to the woman is WAY higher than the risk to the man. The safety of our body and consequently future mental and emotional health is more important than the safety to your wallet.\n\nUse discernment. Have frank open conversations. And if you’re feeling uncomfortable SAY something to the SB before you get to a point where you’re feeling rinsed. You’re an adult. In an adult relationship. Use your big boy words.",
                            "author": "AdriannaKing",
                            "id": "gn2ievi",
                            "parent_id": "t1_gn2ha3v",
                            "score": 6,
                            "created_utc": 1613145406.0,
                            "replies": [
                                {
                                    "body": "Pump & Dump means he paid just lied about his intentions for a long term arrangement. Paying prior to intimacy is different that paying for a full PPM for platonic dates.  Most would agree that providing the allowance prior to intimacy is appropriate.  \n\nJust because sexual assault is more serious than theft doesn't mean the risk of theft should be ignored.  \n\nI actually provide $ gifts for M&Gs and $ gifts for platonic dates and often have several platonic dates before an intimate date.  I do gauge their genuine interest and try to assess if I an being rinsed.   It's not easy. The best rinsers are extremely convinced.  That's why Con Artists are called Con Artists, they gain your confidence.",
                                    "author": "willfromvb",
                                    "id": "gn2knti",
                                    "parent_id": "t1_gn2ievi",
                                    "score": 2,
                                    "created_utc": 1613146432.0,
                                    "replies": [
                                        {
                                            "body": "No need to drill the semantics of my pump and dump terminology use, you obviously understand the scenario I was presenting. And I did NOT say the risk of theft should be ignored. I said to use discernment. What I’m saying is the risk to each party is not equally weighted. I really don’t understand why you’re arguing with me when the rest of your post seems fully aligned with what I’m saying.",
                                            "author": "AdriannaKing",
                                            "id": "gn2ls11",
                                            "parent_id": "t1_gn2knti",
                                            "score": 3,
                                            "created_utc": 1613146936.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gn08lwq",
            "parent_id": "t1_gn00rj2",
            "score": 3,
            "created_utc": 1613091406.0,
            "replies": [
                {
                    "body": "I’ve had to ask before (which I hate with a passion) and this is how I handle it.\nI didn’t ask RIGHT before intimacy. I invited him in and poured him a glass of wine. We sat on the couch to chat. And at a lull I simply said,\n“I’m so happy that we’ve decided to do this. I want us to just relax and be able to really enjoy our time together, so as we go forward when you come see me, it would mean so much to me if we could get my gift out of the way right at the start. Not having to think about it as we’re getting to know one another will do so much to help me relax.”\nHe said yes. And I say, “Thank you for being so understanding, you’re such a sweet gentleman.”",
                    "author": "AdriannaKing",
                    "id": "gn0iaty",
                    "parent_id": "t1_gn08lwq",
                    "score": 10,
                    "created_utc": 1613096495.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "gn0oc16",
                            "parent_id": "t1_gn0iaty",
                            "score": 2,
                            "created_utc": 1613099704.0,
                            "replies": [
                                {
                                    "body": "I say that at the first meeting after the meet and greet. I honestly don’t understand the style I see on here of getting money on intimate dates but no money on non-intimate ones. The moment my SD and I agree to go forward my time = money.",
                                    "author": "AdriannaKing",
                                    "id": "gn0sae1",
                                    "parent_id": "t1_gn0oc16",
                                    "score": 6,
                                    "created_utc": 1613101830.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Ironically, I still remember the conversation I was having with some slf SBs when they convinced me I should just give the PPM beforehand.  When I mentioned as one of my justifications for not consistently doing so, \"listen, no SB ever asks for it beforehand anyway; that must mean they don't care much either way\".  These SBs told me, \"nope, that's not it.  she isn't asking beforehand because it's so incredibly awkward, every way she frames it in her head sounds terrible, and she's terrified of how you'll react -- so terrified, she'd rather risk you scamming her rather than asking.  But EVERY SB wishes you'd give it beforehand\".   Made sense to me.  \n\nNo SB has ever asked me, so I can't say from experience what would be great.  I know \"do you have something for me\" is the exact phrase we hear from escorts, and from the stripper once we get to the champagne room, so wouldn't be my favorite coming from my SB, I suppose.  Still, I'm a grown man and would get over my 3 seconds of discomfort regardless.\n\nIn my imagination, I'd react really positively to her coming close, looking almost embarrassed she has to ask, and \"Would you mind if we handled the allowance now so I know it's out of the way and just have fun?\"   I really don't know if someone else is going to tell me how cringy that is, but it'd sound fine to me.",
                    "author": "Azurecole",
                    "id": "gn0awcm",
                    "parent_id": "t1_gn08lwq",
                    "score": 3,
                    "created_utc": 1613092615.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Bingo \n\nOr the emergency phone call 20 minutes into dinner where she has to leave because her Pomeranian got sick",
            "author": "KnocDown",
            "id": "gn2oukn",
            "parent_id": "t1_gn2jr6o",
            "score": 2,
            "created_utc": 1613148309.0,
            "replies": [
                {
                    "body": "OH NO NOT LITTLE CHEW-BARKA!  Get home right now and check on Chew-barka!",
                    "author": "Azurecole",
                    "id": "gn2psoa",
                    "parent_id": "t1_gn2oukn",
                    "score": 3,
                    "created_utc": 1613148725.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Especially when date three was at my house FFS. Yeesh. \n\nIt is what it is, I guess :-)",
            "author": "SDRippington",
            "id": "gn07as3",
            "parent_id": "t1_gn06lng",
            "score": 2,
            "created_utc": 1613090728.0,
            "replies": [
                {
                    "body": "At date 3 you’re still virtually a stranger. I had a SD short me on purpose after a few dates.",
                    "author": "AdriannaKing",
                    "id": "gn0jm8l",
                    "parent_id": "t1_gn07as3",
                    "score": 7,
                    "created_utc": 1613097195.0,
                    "replies": [
                        {
                            "body": "This was at my place. We know all about each other - backgrounds, likes, dislikes, hours and hours spent NOT in an intimate embrace.\n\nIf some asshat dissed you that far into something you thought was real? Put out a contract on him. That's messed up.",
                            "author": "SDRippington",
                            "id": "gn0psqs",
                            "parent_id": "t1_gn0jm8l",
                            "score": 1,
                            "created_utc": 1613100476.0,
                            "replies": [
                                {
                                    "body": "Oh it was ages ago and I definitely did not let it slide. He tried to come back months later, full of apologies, but I refused to see him again.\nBut you were talking about date 3. \n\nAnd while you and your SB may know each other well. Think about it beyond your specific relationship. 3 dates is NOT a lot of time to get to know a person, not really. So I don’t think it’s fair to expect ANY person to just trust you completely after three dates.",
                                    "author": "AdriannaKing",
                                    "id": "gn0sl1m",
                                    "parent_id": "t1_gn0psqs",
                                    "score": 3,
                                    "created_utc": 1613101995.0,
                                    "replies": [
                                        {
                                            "body": "> 3 dates is NOT a lot of time to get to know a person, not really\n\nOh I totally forgot! And a day before that, I sent her the money to cover all of her advanced class and lab books - which was quite a bit.\n\nAnd for weeks before that it was many days of texts, pics, sharing all manner of things? And we were at my place for the third time FFS. \n\nPretty sure it was obvious I was not going to stiff her. And seriously, if by date 3, at my place, and sharing all of the things we shared and did, if you think I am going to short you a PPM? _Really??_\n\nWell, one thing is for sure - it wasn't a mutual \"Fuck Yes\" in the \"It's Fuck Yes or It's No\" theory of compatible relationships :-)\n\nSo no love lost in any case. She tried hitting me up a few months back. I was cordial but firm - \"Not interested.\"\n\nAnd me saying that to a drop-dead gorgeous redhead (even if she wound up being batshit cray-cray?) says something. At the moment it was ALL about the money? I was pretty sure it wasn't going to last.",
                                            "author": "SDRippington",
                                            "id": "gn0xzkv",
                                            "parent_id": "t1_gn0sl1m",
                                            "score": 3,
                                            "created_utc": 1613105120.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Men. Always thinking they’ve done or said something awesome for the lady. \n\nWomen. Are always great at faking. We even fake orgasms to appease the men ego.",
            "author": "ExExpectations",
            "id": "gn2k45j",
            "parent_id": "t1_gn2jho7",
            "score": 4,
            "created_utc": 1613146183.0,
            "replies": [
                {
                    "body": "Thank goodness for small favors\n\nMore seriously, there's a universe of territory in between \"hey hun, leave the money on the dresser\" and \"hold hands, place her hand on my heart, get all dewey-eyed, and try to touch her soul\".   I think I have the basic skills to just be a person, keep it just a normal thing rather than engaging in spycraft or dresser protocol.  Or I could be over-estimating my own charisma; wouldn't be the first time.  But IMO if you have the basic interpersonal skills, just keeping this as no big deal is the way to go.",
                    "author": "Azurecole",
                    "id": "gn34hyw",
                    "parent_id": "t1_gn2k45j",
                    "score": 1,
                    "created_utc": 1613155040.0,
                    "replies": [
                        {
                            "body": "A simple handing it over saying “babe, this is for you” is much less cringy than saying how you appreciate her and how much you care about her and want her to have this \n\nWhich is how you came across 🤪💩just giving one woman’s viewpoint after being on the receiving end of such display",
                            "author": "ExExpectations",
                            "id": "gn35acu",
                            "parent_id": "t1_gn34hyw",
                            "score": 3,
                            "created_utc": 1613155383.0,
                            "replies": [
                                {
                                    "body": "Fair! I might have leaned too hard in the description. I do think that the ability to make what could be awkward moments, just a completely normal and accepted part of the interaction, is a simple skill and one worth learning. It's something I actually think I'm really good at, but I've overestimated my prowess at things before LOL",
                                    "author": "Azurecole",
                                    "id": "gn39654",
                                    "parent_id": "t1_gn35acu",
                                    "score": 1,
                                    "created_utc": 1613157097.0,
                                    "replies": [
                                        {
                                            "body": "Haha. Maybe you’re actually suave, maybe she’s a good actress. We will never know.",
                                            "author": "ExExpectations",
                                            "id": "gn3j0j4",
                                            "parent_id": "t1_gn39654",
                                            "score": 2,
                                            "created_utc": 1613161584.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "And SANDY??? I’m older, but not Sandy-old!",
            "author": "ExExpectations",
            "id": "gn4t1n4",
            "parent_id": "t1_gn2jho7",
            "score": 1,
            "created_utc": 1613185328.0,
            "replies": []
        },
        {
            "body": "I’m so sorry this happened to you but why did I laugh imagining her 🏃‍♀️🏃‍♀️\n😂",
            "author": "Addsomespice_",
            "id": "gn15eu8",
            "parent_id": "t1_gn0s5tm",
            "score": 10,
            "created_utc": 1613109953.0,
            "replies": [
                {
                    "body": "Yeh its a funny story for sure.  And she wss like 20 and had the balls to pull that off",
                    "author": "wb19081908",
                    "id": "gn17f7l",
                    "parent_id": "t1_gn15eu8",
                    "score": 5,
                    "created_utc": 1613111460.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Lol",
            "author": "Ambitious_Middle723",
            "id": "gn2d9l7",
            "parent_id": "t1_gn0s5tm",
            "score": 2,
            "created_utc": 1613143017.0,
            "replies": []
        },
        {
            "body": "You're thinking baseball ... which is also not metric (90 feet and the magical 60 feet 6 inches which is naturally meaningless for the heathen who demand metric measurements). Football has too much padding for those to really be meaningful in the same way.",
            "author": "sfwinefan",
            "id": "gmz6n9v",
            "parent_id": "t1_gmz5biw",
            "score": 5,
            "created_utc": 1613073778.0,
            "replies": [
                {
                    "body": "6 inches is 15.24 cm",
                    "author": "converter-bot",
                    "id": "gmz6o9l",
                    "parent_id": "t1_gmz6n9v",
                    "score": -1,
                    "created_utc": 1613073791.0,
                    "replies": [
                        {
                            "body": "Bad bot",
                            "author": "sfwinefan",
                            "id": "gmz6r7m",
                            "parent_id": "t1_gmz6o9l",
                            "score": 3,
                            "created_utc": 1613073827.0,
                            "replies": [
                                {
                                    "body": "At this point I think the bot is just trolling.",
                                    "author": "Thomasriddle01",
                                    "id": "gn05pta",
                                    "parent_id": "t1_gmz6r7m",
                                    "score": 6,
                                    "created_utc": 1613089905.0,
                                    "replies": []
                                },
                                {
                                    "body": "Thank you, sfwinefan, for voting on converter-bot.\n\nThis bot wants to find the best and worst bots on Reddit. [You can view results here](https://botrank.pastimes.eu/).\n\n***\n\n^(Even if I don't reply to your comment, I'm still listening for votes. Check the webpage to see if your vote registered!)",
                                    "author": "B0tRank",
                                    "id": "gmz6sc8",
                                    "parent_id": "t1_gmz6r7m",
                                    "score": 0,
                                    "created_utc": 1613073840.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Now that is the way I envisioned it. Handing over cash before intimacy seems much more like paying for a hooker.  Unless the relationship is only about sex then I suppose that’s alright. I would prefer to set the monthly allowance, pay it weekly or monthly via Venmo or whatever. Cash never changes hands. But you need to have a level of trust.",
            "author": "apb2016",
            "id": "gn0hzdo",
            "parent_id": "t1_gn0h5ir",
            "score": 1,
            "created_utc": 1613096326.0,
            "replies": [
                {
                    "body": "> But you need to have a level of trust.\n\nThat is the challenge.  In any relationship, but especially in a sugar relationship, trust is very important.   When the money is given, how the money is given and the timing of sex and payment are delicate dances.",
                    "author": "willfromvb",
                    "id": "gn1hh20",
                    "parent_id": "t1_gn0hzdo",
                    "score": 3,
                    "created_utc": 1613120184.0,
                    "replies": []
                },
                {
                    "body": "It’s exactly the same as paying for a hooker.",
                    "author": "BigSugar44",
                    "id": "gn1i6bc",
                    "parent_id": "t1_gn0hzdo",
                    "score": 0,
                    "created_utc": 1613120831.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I agree with everything you've said except that their is a professional career path called \"Rinser\".   Almost every experienced SD has run into them.  They are very good at promising or insinuating future intimacy while extracting as much money as possible in the process with no intention of every being intimate.  \n\nDon't blame the SDs, blame the rinsers that have ruined it for SBs.",
            "author": "willfromvb",
            "id": "gn2ha3v",
            "parent_id": "t1_gn2gel5",
            "score": 3,
            "created_utc": 1613144890.0,
            "replies": [
                {
                    "body": "Everyone needs to practice discernment. While there may be rinsers. There are also men that will promise to pay you, have sex with you, and then ghost. Which is, drumroll please, sexual assault. Yes, the woman agreed, but she agreed to sex under a specific set of guidelines. When a pot SD pumps and dumps under the guise of “I’ll pay you after” it’s sexual assault. That’s not an opinion it’s fact based on wording of the law. It’s like agreeing to have sex with a condom and then slipping it off without her knowledge. That’s sexual assault, not just “being a jerk”.\n\nSo again I say, the risk to the woman is WAY higher than the risk to the man. The safety of our body and consequently future mental and emotional health is more important than the safety to your wallet.\n\nUse discernment. Have frank open conversations. And if you’re feeling uncomfortable SAY something to the SB before you get to a point where you’re feeling rinsed. You’re an adult. In an adult relationship. Use your big boy words.",
                    "author": "AdriannaKing",
                    "id": "gn2ievi",
                    "parent_id": "t1_gn2ha3v",
                    "score": 6,
                    "created_utc": 1613145406.0,
                    "replies": [
                        {
                            "body": "Pump & Dump means he paid just lied about his intentions for a long term arrangement. Paying prior to intimacy is different that paying for a full PPM for platonic dates.  Most would agree that providing the allowance prior to intimacy is appropriate.  \n\nJust because sexual assault is more serious than theft doesn't mean the risk of theft should be ignored.  \n\nI actually provide $ gifts for M&Gs and $ gifts for platonic dates and often have several platonic dates before an intimate date.  I do gauge their genuine interest and try to assess if I an being rinsed.   It's not easy. The best rinsers are extremely convinced.  That's why Con Artists are called Con Artists, they gain your confidence.",
                            "author": "willfromvb",
                            "id": "gn2knti",
                            "parent_id": "t1_gn2ievi",
                            "score": 2,
                            "created_utc": 1613146432.0,
                            "replies": [
                                {
                                    "body": "No need to drill the semantics of my pump and dump terminology use, you obviously understand the scenario I was presenting. And I did NOT say the risk of theft should be ignored. I said to use discernment. What I’m saying is the risk to each party is not equally weighted. I really don’t understand why you’re arguing with me when the rest of your post seems fully aligned with what I’m saying.",
                                    "author": "AdriannaKing",
                                    "id": "gn2ls11",
                                    "parent_id": "t1_gn2knti",
                                    "score": 3,
                                    "created_utc": 1613146936.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I’ve had to ask before (which I hate with a passion) and this is how I handle it.\nI didn’t ask RIGHT before intimacy. I invited him in and poured him a glass of wine. We sat on the couch to chat. And at a lull I simply said,\n“I’m so happy that we’ve decided to do this. I want us to just relax and be able to really enjoy our time together, so as we go forward when you come see me, it would mean so much to me if we could get my gift out of the way right at the start. Not having to think about it as we’re getting to know one another will do so much to help me relax.”\nHe said yes. And I say, “Thank you for being so understanding, you’re such a sweet gentleman.”",
            "author": "AdriannaKing",
            "id": "gn0iaty",
            "parent_id": "t1_gn08lwq",
            "score": 10,
            "created_utc": 1613096495.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "gn0oc16",
                    "parent_id": "t1_gn0iaty",
                    "score": 2,
                    "created_utc": 1613099704.0,
                    "replies": [
                        {
                            "body": "I say that at the first meeting after the meet and greet. I honestly don’t understand the style I see on here of getting money on intimate dates but no money on non-intimate ones. The moment my SD and I agree to go forward my time = money.",
                            "author": "AdriannaKing",
                            "id": "gn0sae1",
                            "parent_id": "t1_gn0oc16",
                            "score": 6,
                            "created_utc": 1613101830.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Ironically, I still remember the conversation I was having with some slf SBs when they convinced me I should just give the PPM beforehand.  When I mentioned as one of my justifications for not consistently doing so, \"listen, no SB ever asks for it beforehand anyway; that must mean they don't care much either way\".  These SBs told me, \"nope, that's not it.  she isn't asking beforehand because it's so incredibly awkward, every way she frames it in her head sounds terrible, and she's terrified of how you'll react -- so terrified, she'd rather risk you scamming her rather than asking.  But EVERY SB wishes you'd give it beforehand\".   Made sense to me.  \n\nNo SB has ever asked me, so I can't say from experience what would be great.  I know \"do you have something for me\" is the exact phrase we hear from escorts, and from the stripper once we get to the champagne room, so wouldn't be my favorite coming from my SB, I suppose.  Still, I'm a grown man and would get over my 3 seconds of discomfort regardless.\n\nIn my imagination, I'd react really positively to her coming close, looking almost embarrassed she has to ask, and \"Would you mind if we handled the allowance now so I know it's out of the way and just have fun?\"   I really don't know if someone else is going to tell me how cringy that is, but it'd sound fine to me.",
            "author": "Azurecole",
            "id": "gn0awcm",
            "parent_id": "t1_gn08lwq",
            "score": 3,
            "created_utc": 1613092615.0,
            "replies": []
        },
        {
            "body": "OH NO NOT LITTLE CHEW-BARKA!  Get home right now and check on Chew-barka!",
            "author": "Azurecole",
            "id": "gn2psoa",
            "parent_id": "t1_gn2oukn",
            "score": 3,
            "created_utc": 1613148725.0,
            "replies": []
        },
        {
            "body": "At date 3 you’re still virtually a stranger. I had a SD short me on purpose after a few dates.",
            "author": "AdriannaKing",
            "id": "gn0jm8l",
            "parent_id": "t1_gn07as3",
            "score": 7,
            "created_utc": 1613097195.0,
            "replies": [
                {
                    "body": "This was at my place. We know all about each other - backgrounds, likes, dislikes, hours and hours spent NOT in an intimate embrace.\n\nIf some asshat dissed you that far into something you thought was real? Put out a contract on him. That's messed up.",
                    "author": "SDRippington",
                    "id": "gn0psqs",
                    "parent_id": "t1_gn0jm8l",
                    "score": 1,
                    "created_utc": 1613100476.0,
                    "replies": [
                        {
                            "body": "Oh it was ages ago and I definitely did not let it slide. He tried to come back months later, full of apologies, but I refused to see him again.\nBut you were talking about date 3. \n\nAnd while you and your SB may know each other well. Think about it beyond your specific relationship. 3 dates is NOT a lot of time to get to know a person, not really. So I don’t think it’s fair to expect ANY person to just trust you completely after three dates.",
                            "author": "AdriannaKing",
                            "id": "gn0sl1m",
                            "parent_id": "t1_gn0psqs",
                            "score": 3,
                            "created_utc": 1613101995.0,
                            "replies": [
                                {
                                    "body": "> 3 dates is NOT a lot of time to get to know a person, not really\n\nOh I totally forgot! And a day before that, I sent her the money to cover all of her advanced class and lab books - which was quite a bit.\n\nAnd for weeks before that it was many days of texts, pics, sharing all manner of things? And we were at my place for the third time FFS. \n\nPretty sure it was obvious I was not going to stiff her. And seriously, if by date 3, at my place, and sharing all of the things we shared and did, if you think I am going to short you a PPM? _Really??_\n\nWell, one thing is for sure - it wasn't a mutual \"Fuck Yes\" in the \"It's Fuck Yes or It's No\" theory of compatible relationships :-)\n\nSo no love lost in any case. She tried hitting me up a few months back. I was cordial but firm - \"Not interested.\"\n\nAnd me saying that to a drop-dead gorgeous redhead (even if she wound up being batshit cray-cray?) says something. At the moment it was ALL about the money? I was pretty sure it wasn't going to last.",
                                    "author": "SDRippington",
                                    "id": "gn0xzkv",
                                    "parent_id": "t1_gn0sl1m",
                                    "score": 3,
                                    "created_utc": 1613105120.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Thank goodness for small favors\n\nMore seriously, there's a universe of territory in between \"hey hun, leave the money on the dresser\" and \"hold hands, place her hand on my heart, get all dewey-eyed, and try to touch her soul\".   I think I have the basic skills to just be a person, keep it just a normal thing rather than engaging in spycraft or dresser protocol.  Or I could be over-estimating my own charisma; wouldn't be the first time.  But IMO if you have the basic interpersonal skills, just keeping this as no big deal is the way to go.",
            "author": "Azurecole",
            "id": "gn34hyw",
            "parent_id": "t1_gn2k45j",
            "score": 1,
            "created_utc": 1613155040.0,
            "replies": [
                {
                    "body": "A simple handing it over saying “babe, this is for you” is much less cringy than saying how you appreciate her and how much you care about her and want her to have this \n\nWhich is how you came across 🤪💩just giving one woman’s viewpoint after being on the receiving end of such display",
                    "author": "ExExpectations",
                    "id": "gn35acu",
                    "parent_id": "t1_gn34hyw",
                    "score": 3,
                    "created_utc": 1613155383.0,
                    "replies": [
                        {
                            "body": "Fair! I might have leaned too hard in the description. I do think that the ability to make what could be awkward moments, just a completely normal and accepted part of the interaction, is a simple skill and one worth learning. It's something I actually think I'm really good at, but I've overestimated my prowess at things before LOL",
                            "author": "Azurecole",
                            "id": "gn39654",
                            "parent_id": "t1_gn35acu",
                            "score": 1,
                            "created_utc": 1613157097.0,
                            "replies": [
                                {
                                    "body": "Haha. Maybe you’re actually suave, maybe she’s a good actress. We will never know.",
                                    "author": "ExExpectations",
                                    "id": "gn3j0j4",
                                    "parent_id": "t1_gn39654",
                                    "score": 2,
                                    "created_utc": 1613161584.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Yeh its a funny story for sure.  And she wss like 20 and had the balls to pull that off",
            "author": "wb19081908",
            "id": "gn17f7l",
            "parent_id": "t1_gn15eu8",
            "score": 5,
            "created_utc": 1613111460.0,
            "replies": []
        },
        {
            "body": "6 inches is 15.24 cm",
            "author": "converter-bot",
            "id": "gmz6o9l",
            "parent_id": "t1_gmz6n9v",
            "score": -1,
            "created_utc": 1613073791.0,
            "replies": [
                {
                    "body": "Bad bot",
                    "author": "sfwinefan",
                    "id": "gmz6r7m",
                    "parent_id": "t1_gmz6o9l",
                    "score": 3,
                    "created_utc": 1613073827.0,
                    "replies": [
                        {
                            "body": "At this point I think the bot is just trolling.",
                            "author": "Thomasriddle01",
                            "id": "gn05pta",
                            "parent_id": "t1_gmz6r7m",
                            "score": 6,
                            "created_utc": 1613089905.0,
                            "replies": []
                        },
                        {
                            "body": "Thank you, sfwinefan, for voting on converter-bot.\n\nThis bot wants to find the best and worst bots on Reddit. [You can view results here](https://botrank.pastimes.eu/).\n\n***\n\n^(Even if I don't reply to your comment, I'm still listening for votes. Check the webpage to see if your vote registered!)",
                            "author": "B0tRank",
                            "id": "gmz6sc8",
                            "parent_id": "t1_gmz6r7m",
                            "score": 0,
                            "created_utc": 1613073840.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "> But you need to have a level of trust.\n\nThat is the challenge.  In any relationship, but especially in a sugar relationship, trust is very important.   When the money is given, how the money is given and the timing of sex and payment are delicate dances.",
            "author": "willfromvb",
            "id": "gn1hh20",
            "parent_id": "t1_gn0hzdo",
            "score": 3,
            "created_utc": 1613120184.0,
            "replies": []
        },
        {
            "body": "It’s exactly the same as paying for a hooker.",
            "author": "BigSugar44",
            "id": "gn1i6bc",
            "parent_id": "t1_gn0hzdo",
            "score": 0,
            "created_utc": 1613120831.0,
            "replies": []
        },
        {
            "body": "Everyone needs to practice discernment. While there may be rinsers. There are also men that will promise to pay you, have sex with you, and then ghost. Which is, drumroll please, sexual assault. Yes, the woman agreed, but she agreed to sex under a specific set of guidelines. When a pot SD pumps and dumps under the guise of “I’ll pay you after” it’s sexual assault. That’s not an opinion it’s fact based on wording of the law. It’s like agreeing to have sex with a condom and then slipping it off without her knowledge. That’s sexual assault, not just “being a jerk”.\n\nSo again I say, the risk to the woman is WAY higher than the risk to the man. The safety of our body and consequently future mental and emotional health is more important than the safety to your wallet.\n\nUse discernment. Have frank open conversations. And if you’re feeling uncomfortable SAY something to the SB before you get to a point where you’re feeling rinsed. You’re an adult. In an adult relationship. Use your big boy words.",
            "author": "AdriannaKing",
            "id": "gn2ievi",
            "parent_id": "t1_gn2ha3v",
            "score": 6,
            "created_utc": 1613145406.0,
            "replies": [
                {
                    "body": "Pump & Dump means he paid just lied about his intentions for a long term arrangement. Paying prior to intimacy is different that paying for a full PPM for platonic dates.  Most would agree that providing the allowance prior to intimacy is appropriate.  \n\nJust because sexual assault is more serious than theft doesn't mean the risk of theft should be ignored.  \n\nI actually provide $ gifts for M&Gs and $ gifts for platonic dates and often have several platonic dates before an intimate date.  I do gauge their genuine interest and try to assess if I an being rinsed.   It's not easy. The best rinsers are extremely convinced.  That's why Con Artists are called Con Artists, they gain your confidence.",
                    "author": "willfromvb",
                    "id": "gn2knti",
                    "parent_id": "t1_gn2ievi",
                    "score": 2,
                    "created_utc": 1613146432.0,
                    "replies": [
                        {
                            "body": "No need to drill the semantics of my pump and dump terminology use, you obviously understand the scenario I was presenting. And I did NOT say the risk of theft should be ignored. I said to use discernment. What I’m saying is the risk to each party is not equally weighted. I really don’t understand why you’re arguing with me when the rest of your post seems fully aligned with what I’m saying.",
                            "author": "AdriannaKing",
                            "id": "gn2ls11",
                            "parent_id": "t1_gn2knti",
                            "score": 3,
                            "created_utc": 1613146936.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gn0oc16",
            "parent_id": "t1_gn0iaty",
            "score": 2,
            "created_utc": 1613099704.0,
            "replies": [
                {
                    "body": "I say that at the first meeting after the meet and greet. I honestly don’t understand the style I see on here of getting money on intimate dates but no money on non-intimate ones. The moment my SD and I agree to go forward my time = money.",
                    "author": "AdriannaKing",
                    "id": "gn0sae1",
                    "parent_id": "t1_gn0oc16",
                    "score": 6,
                    "created_utc": 1613101830.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "This was at my place. We know all about each other - backgrounds, likes, dislikes, hours and hours spent NOT in an intimate embrace.\n\nIf some asshat dissed you that far into something you thought was real? Put out a contract on him. That's messed up.",
            "author": "SDRippington",
            "id": "gn0psqs",
            "parent_id": "t1_gn0jm8l",
            "score": 1,
            "created_utc": 1613100476.0,
            "replies": [
                {
                    "body": "Oh it was ages ago and I definitely did not let it slide. He tried to come back months later, full of apologies, but I refused to see him again.\nBut you were talking about date 3. \n\nAnd while you and your SB may know each other well. Think about it beyond your specific relationship. 3 dates is NOT a lot of time to get to know a person, not really. So I don’t think it’s fair to expect ANY person to just trust you completely after three dates.",
                    "author": "AdriannaKing",
                    "id": "gn0sl1m",
                    "parent_id": "t1_gn0psqs",
                    "score": 3,
                    "created_utc": 1613101995.0,
                    "replies": [
                        {
                            "body": "> 3 dates is NOT a lot of time to get to know a person, not really\n\nOh I totally forgot! And a day before that, I sent her the money to cover all of her advanced class and lab books - which was quite a bit.\n\nAnd for weeks before that it was many days of texts, pics, sharing all manner of things? And we were at my place for the third time FFS. \n\nPretty sure it was obvious I was not going to stiff her. And seriously, if by date 3, at my place, and sharing all of the things we shared and did, if you think I am going to short you a PPM? _Really??_\n\nWell, one thing is for sure - it wasn't a mutual \"Fuck Yes\" in the \"It's Fuck Yes or It's No\" theory of compatible relationships :-)\n\nSo no love lost in any case. She tried hitting me up a few months back. I was cordial but firm - \"Not interested.\"\n\nAnd me saying that to a drop-dead gorgeous redhead (even if she wound up being batshit cray-cray?) says something. At the moment it was ALL about the money? I was pretty sure it wasn't going to last.",
                            "author": "SDRippington",
                            "id": "gn0xzkv",
                            "parent_id": "t1_gn0sl1m",
                            "score": 3,
                            "created_utc": 1613105120.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "A simple handing it over saying “babe, this is for you” is much less cringy than saying how you appreciate her and how much you care about her and want her to have this \n\nWhich is how you came across 🤪💩just giving one woman’s viewpoint after being on the receiving end of such display",
            "author": "ExExpectations",
            "id": "gn35acu",
            "parent_id": "t1_gn34hyw",
            "score": 3,
            "created_utc": 1613155383.0,
            "replies": [
                {
                    "body": "Fair! I might have leaned too hard in the description. I do think that the ability to make what could be awkward moments, just a completely normal and accepted part of the interaction, is a simple skill and one worth learning. It's something I actually think I'm really good at, but I've overestimated my prowess at things before LOL",
                    "author": "Azurecole",
                    "id": "gn39654",
                    "parent_id": "t1_gn35acu",
                    "score": 1,
                    "created_utc": 1613157097.0,
                    "replies": [
                        {
                            "body": "Haha. Maybe you’re actually suave, maybe she’s a good actress. We will never know.",
                            "author": "ExExpectations",
                            "id": "gn3j0j4",
                            "parent_id": "t1_gn39654",
                            "score": 2,
                            "created_utc": 1613161584.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Bad bot",
            "author": "sfwinefan",
            "id": "gmz6r7m",
            "parent_id": "t1_gmz6o9l",
            "score": 3,
            "created_utc": 1613073827.0,
            "replies": [
                {
                    "body": "At this point I think the bot is just trolling.",
                    "author": "Thomasriddle01",
                    "id": "gn05pta",
                    "parent_id": "t1_gmz6r7m",
                    "score": 6,
                    "created_utc": 1613089905.0,
                    "replies": []
                },
                {
                    "body": "Thank you, sfwinefan, for voting on converter-bot.\n\nThis bot wants to find the best and worst bots on Reddit. [You can view results here](https://botrank.pastimes.eu/).\n\n***\n\n^(Even if I don't reply to your comment, I'm still listening for votes. Check the webpage to see if your vote registered!)",
                    "author": "B0tRank",
                    "id": "gmz6sc8",
                    "parent_id": "t1_gmz6r7m",
                    "score": 0,
                    "created_utc": 1613073840.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Pump & Dump means he paid just lied about his intentions for a long term arrangement. Paying prior to intimacy is different that paying for a full PPM for platonic dates.  Most would agree that providing the allowance prior to intimacy is appropriate.  \n\nJust because sexual assault is more serious than theft doesn't mean the risk of theft should be ignored.  \n\nI actually provide $ gifts for M&Gs and $ gifts for platonic dates and often have several platonic dates before an intimate date.  I do gauge their genuine interest and try to assess if I an being rinsed.   It's not easy. The best rinsers are extremely convinced.  That's why Con Artists are called Con Artists, they gain your confidence.",
            "author": "willfromvb",
            "id": "gn2knti",
            "parent_id": "t1_gn2ievi",
            "score": 2,
            "created_utc": 1613146432.0,
            "replies": [
                {
                    "body": "No need to drill the semantics of my pump and dump terminology use, you obviously understand the scenario I was presenting. And I did NOT say the risk of theft should be ignored. I said to use discernment. What I’m saying is the risk to each party is not equally weighted. I really don’t understand why you’re arguing with me when the rest of your post seems fully aligned with what I’m saying.",
                    "author": "AdriannaKing",
                    "id": "gn2ls11",
                    "parent_id": "t1_gn2knti",
                    "score": 3,
                    "created_utc": 1613146936.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I say that at the first meeting after the meet and greet. I honestly don’t understand the style I see on here of getting money on intimate dates but no money on non-intimate ones. The moment my SD and I agree to go forward my time = money.",
            "author": "AdriannaKing",
            "id": "gn0sae1",
            "parent_id": "t1_gn0oc16",
            "score": 6,
            "created_utc": 1613101830.0,
            "replies": []
        },
        {
            "body": "Oh it was ages ago and I definitely did not let it slide. He tried to come back months later, full of apologies, but I refused to see him again.\nBut you were talking about date 3. \n\nAnd while you and your SB may know each other well. Think about it beyond your specific relationship. 3 dates is NOT a lot of time to get to know a person, not really. So I don’t think it’s fair to expect ANY person to just trust you completely after three dates.",
            "author": "AdriannaKing",
            "id": "gn0sl1m",
            "parent_id": "t1_gn0psqs",
            "score": 3,
            "created_utc": 1613101995.0,
            "replies": [
                {
                    "body": "> 3 dates is NOT a lot of time to get to know a person, not really\n\nOh I totally forgot! And a day before that, I sent her the money to cover all of her advanced class and lab books - which was quite a bit.\n\nAnd for weeks before that it was many days of texts, pics, sharing all manner of things? And we were at my place for the third time FFS. \n\nPretty sure it was obvious I was not going to stiff her. And seriously, if by date 3, at my place, and sharing all of the things we shared and did, if you think I am going to short you a PPM? _Really??_\n\nWell, one thing is for sure - it wasn't a mutual \"Fuck Yes\" in the \"It's Fuck Yes or It's No\" theory of compatible relationships :-)\n\nSo no love lost in any case. She tried hitting me up a few months back. I was cordial but firm - \"Not interested.\"\n\nAnd me saying that to a drop-dead gorgeous redhead (even if she wound up being batshit cray-cray?) says something. At the moment it was ALL about the money? I was pretty sure it wasn't going to last.",
                    "author": "SDRippington",
                    "id": "gn0xzkv",
                    "parent_id": "t1_gn0sl1m",
                    "score": 3,
                    "created_utc": 1613105120.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Fair! I might have leaned too hard in the description. I do think that the ability to make what could be awkward moments, just a completely normal and accepted part of the interaction, is a simple skill and one worth learning. It's something I actually think I'm really good at, but I've overestimated my prowess at things before LOL",
            "author": "Azurecole",
            "id": "gn39654",
            "parent_id": "t1_gn35acu",
            "score": 1,
            "created_utc": 1613157097.0,
            "replies": [
                {
                    "body": "Haha. Maybe you’re actually suave, maybe she’s a good actress. We will never know.",
                    "author": "ExExpectations",
                    "id": "gn3j0j4",
                    "parent_id": "t1_gn39654",
                    "score": 2,
                    "created_utc": 1613161584.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "At this point I think the bot is just trolling.",
            "author": "Thomasriddle01",
            "id": "gn05pta",
            "parent_id": "t1_gmz6r7m",
            "score": 6,
            "created_utc": 1613089905.0,
            "replies": []
        },
        {
            "body": "Thank you, sfwinefan, for voting on converter-bot.\n\nThis bot wants to find the best and worst bots on Reddit. [You can view results here](https://botrank.pastimes.eu/).\n\n***\n\n^(Even if I don't reply to your comment, I'm still listening for votes. Check the webpage to see if your vote registered!)",
            "author": "B0tRank",
            "id": "gmz6sc8",
            "parent_id": "t1_gmz6r7m",
            "score": 0,
            "created_utc": 1613073840.0,
            "replies": []
        },
        {
            "body": "No need to drill the semantics of my pump and dump terminology use, you obviously understand the scenario I was presenting. And I did NOT say the risk of theft should be ignored. I said to use discernment. What I’m saying is the risk to each party is not equally weighted. I really don’t understand why you’re arguing with me when the rest of your post seems fully aligned with what I’m saying.",
            "author": "AdriannaKing",
            "id": "gn2ls11",
            "parent_id": "t1_gn2knti",
            "score": 3,
            "created_utc": 1613146936.0,
            "replies": []
        },
        {
            "body": "> 3 dates is NOT a lot of time to get to know a person, not really\n\nOh I totally forgot! And a day before that, I sent her the money to cover all of her advanced class and lab books - which was quite a bit.\n\nAnd for weeks before that it was many days of texts, pics, sharing all manner of things? And we were at my place for the third time FFS. \n\nPretty sure it was obvious I was not going to stiff her. And seriously, if by date 3, at my place, and sharing all of the things we shared and did, if you think I am going to short you a PPM? _Really??_\n\nWell, one thing is for sure - it wasn't a mutual \"Fuck Yes\" in the \"It's Fuck Yes or It's No\" theory of compatible relationships :-)\n\nSo no love lost in any case. She tried hitting me up a few months back. I was cordial but firm - \"Not interested.\"\n\nAnd me saying that to a drop-dead gorgeous redhead (even if she wound up being batshit cray-cray?) says something. At the moment it was ALL about the money? I was pretty sure it wasn't going to last.",
            "author": "SDRippington",
            "id": "gn0xzkv",
            "parent_id": "t1_gn0sl1m",
            "score": 3,
            "created_utc": 1613105120.0,
            "replies": []
        },
        {
            "body": "Haha. Maybe you’re actually suave, maybe she’s a good actress. We will never know.",
            "author": "ExExpectations",
            "id": "gn3j0j4",
            "parent_id": "t1_gn39654",
            "score": 2,
            "created_utc": 1613161584.0,
            "replies": []
        }
    ]
}