{
    "title": "If you’re thinking about joining the bowl for the first time right now: no.",
    "post_id": "fnurrc",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/fnurrc/if_youre_thinking_about_joining_the_bowl_for_the/",
    "author": null,
    "body": "I’m kind of surprised at the amount of newbie sugar babies trying to dip in the bowl right now. In my opinion, from a sugar baby standpoint, you shouldn’t be entering a sugar relationship out of desperation. It gives SB’s a bad name. More often than not if a POT gets the impression that you are desperate for cash (what we call crisis babies) they’ll either try to take advantage of you, or won’t be interested. \nNo you should not schedule or follow through with a meet and greet. No “online arrangements” are not a good idea. This is simply not the time to be actively looking for a sugar daddy.",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/fnurrc/if_youre_thinking_about_joining_the_bowl_for_the/",
    "score": 118,
    "upvote_ratio": 0.75,
    "created_utc": 1585007419.0,
    "num_comments": 71,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "Soooo many scammers looking for Venmo handouts.",
            "author": null,
            "id": "flbof7q",
            "parent_id": "t3_fnurrc",
            "score": 45,
            "created_utc": 1585008966.0,
            "replies": [
                {
                    "body": "This\n\nI'm getting multiple messages a day for online, help me now with the promise of meeting later, all the other BS>",
                    "author": "mraspencer",
                    "id": "flbqjjw",
                    "parent_id": "t1_flbof7q",
                    "score": 19,
                    "created_utc": 1585010329.0,
                    "replies": []
                },
                {
                    "body": "I've always intended on meeting anyone that helps me, but daddies ghost a lot also... Just a perspective from the other side.",
                    "author": "blueeyesinkentucky",
                    "id": "flbzeh3",
                    "parent_id": "t1_flbof7q",
                    "score": 13,
                    "created_utc": 1585016185.0,
                    "replies": []
                },
                {
                    "body": "ya i just instantly block. i've been on SA for years so i can kind of detect it before it even comes up. usually just glancing at their profile i can tell if they're gonna say the usual bullshit \"online only, feet pictures, no meeting up\". if i'm in doubt, i usually just block anyway, unless i'm very into her. you get better at filtering out the stupid messages before they even get to you",
                    "author": "fortyonematters",
                    "id": "flh9zki",
                    "parent_id": "t1_flbof7q",
                    "score": 1,
                    "created_utc": 1585158811.0,
                    "replies": []
                },
                {
                    "body": "\"$50 before we meet to make sure youre real\".  And half of them appear to be out of work dancers, the other scammers half way across the world.",
                    "author": "VladTheFootballStar",
                    "id": "fld632k",
                    "parent_id": "t1_flbof7q",
                    "score": 1,
                    "created_utc": 1585057475.0,
                    "replies": []
                },
                {
                    "body": "Is it dangerous to receive money through venmo? I had one wanting to send me money through venmo and when I suggested another way he vanished. Was that scammer?",
                    "author": null,
                    "id": "flcr454",
                    "parent_id": "t1_flbof7q",
                    "score": 0,
                    "created_utc": 1585042849.0,
                    "replies": [
                        {
                            "body": "From what I hear Venmo charges can be reversed by the sender fairly easily.",
                            "author": "The_Year_2525",
                            "id": "flfjk2j",
                            "parent_id": "t1_flcr454",
                            "score": 2,
                            "created_utc": 1585108255.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "You’re doing some serious gate keeping. Some SBs come into this for “sex work” and there’s nothing wrong with that as long as they’re respectful and not needy. Sugaring to make ends meet is nothing new and fine. \n\nI agree that now is not the time fore newbies or ANYONE simply because of COVID.",
            "author": "perryplats",
            "id": "flbo1e2",
            "parent_id": "t3_fnurrc",
            "score": 126,
            "created_utc": 1585008722.0,
            "replies": [
                {
                    "body": "Right like how judgy lol god forbid she works hard doing whatever it takes to make ends meet. As mentioned as long as yr respectful and chill its fine.. Whether you seek an sd out of need or desire yr still doing the same thing.  \n\nBut fr COVID is real rn yall so stay safe n healthy ❤",
                    "author": "OfficialRedQueen",
                    "id": "flc8ndp",
                    "parent_id": "t1_flbo1e2",
                    "score": 26,
                    "created_utc": 1585022841.0,
                    "replies": []
                },
                {
                    "body": "> It gives SB’s a bad name.\n\nGood advice but bad reason. \n\nFor any potential SB the decision should be an individual one based on a host of factors.  As I think the poster intended, \"sudden economic necessity\"  far too often leads to disappointment, failure and damage to the novice SB.  \n\nIf you truly feel it is an optional adventure with potential economic benefits and you do not fall into the  a) looking for sugar mama, b) looking for platonic  c)likely to be damaged by the nature of the relationship ,  then proceed with caution.  \n\nThe bigger picture is that this is a time when people are drastically cutting back on their contact with others,  especially discretionary contacts . \n\nThe market profits of the last 3 years have largely disappeared and many are looking at significantly reduced income. In addition for most long time SD's, former SB's are calling home, seeking to rekindle old relationships.",
                    "author": "pinotandsugar",
                    "id": "flbozfw",
                    "parent_id": "t1_flbo1e2",
                    "score": 12,
                    "created_utc": 1585009326.0,
                    "replies": []
                },
                {
                    "body": "THIS. its not up to sb's to tell others if they're ready or not to join the sugar bowl. Worry about yourself and stay in your lane periodt",
                    "author": "lbseida",
                    "id": "flc196w",
                    "parent_id": "t1_flbo1e2",
                    "score": 8,
                    "created_utc": 1585017425.0,
                    "replies": []
                },
                {
                    "body": "> Some SBs come into this for “sex work” \n\nAnd there are boat loads of sex worker seekers here as well all using this sugar venue in a way it isn't intended. Desperate SBs will get the fast food crowd.",
                    "author": "GSSD",
                    "id": "flddczr",
                    "parent_id": "t1_flbo1e2",
                    "score": 2,
                    "created_utc": 1585062193.0,
                    "replies": []
                },
                {
                    "body": "If I’m gatekeeping by advising people not to enter the bowl out of desperation than so be it. I think it’s solid advice. Im a sex worker outside of sugaring too. But I would say the same about my job: don’t do this unless it’s something you *want* to do and would *enjoy* doing. Acting out of desperation is not empowering and can definitely be traumatic.",
                    "author": null,
                    "id": "flboq7n",
                    "parent_id": "t1_flbo1e2",
                    "score": 8,
                    "created_utc": 1585009161.0,
                    "replies": [
                        {
                            "body": "what makes you think that you should gate keep? \n\neach relationship - SR, vanilla, or otherwise - is between the people who are in it. \n\nPeriod. \n\nOutside input, especially unsolicited, is just grandstanding. Its not up to you, or anyone else,  to decide or dictate who, when, where, why and under what circumstances any adult, other than yourself, should enter into relationships of any sort.",
                            "author": "LizLemon_015",
                            "id": "flc8d4m",
                            "parent_id": "t1_flboq7n",
                            "score": 15,
                            "created_utc": 1585022613.0,
                            "replies": [
                                {
                                    "body": "Unsolicited advice? Girl read the subs description this forum is here so that we can learn from eachothers experiences. If you really have a problem with me saying you shouldn’t preform sexual acts on someone you don’t want to idk what to tell you cus I still stand by that",
                                    "author": null,
                                    "id": "flccwmb",
                                    "parent_id": "t1_flc8d4m",
                                    "score": -5,
                                    "created_utc": 1585026459.0,
                                    "replies": [
                                        {
                                            "body": "teaching and brow-beating are two different things hun.\n\nmy only problem is you (or anyone) telling another person what to do in such a condescending way, especially when no one asked you to begin with.\n\nthis thread says way more about you than the SB's you're trying to gate keep",
                                            "author": "LizLemon_015",
                                            "id": "flcg8su",
                                            "parent_id": "t1_flccwmb",
                                            "score": 12,
                                            "created_utc": 1585029712.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "Some do it out of desperation some do it because they enjoy it. Its not up to others to determine why they are there. Sex work exists on all levels for that very reason.",
                            "author": "lbseida",
                            "id": "flc1gem",
                            "parent_id": "t1_flboq7n",
                            "score": 11,
                            "created_utc": 1585017562.0,
                            "replies": [
                                {
                                    "body": "!!!!",
                                    "author": "perryplats",
                                    "id": "flc4emu",
                                    "parent_id": "t1_flc1gem",
                                    "score": 1,
                                    "created_utc": 1585019619.0,
                                    "replies": []
                                },
                                {
                                    "body": ">Some do it out of desperation some do it because they enjoy it. Its not up to others to determine why they are there. \n\nYes some do it out of desperation, but they shouldnt enter into a sugar relationship when desperate. Not only can they can scammed or manipulated, but they can also end up being very needy and demanding, and not the type of SB that most SD want. Even Seeking in their blogs has said not to enter into a SR when desperate to get a job instead. Because SR are relationships, not work. They were never intended to be someones job.",
                                    "author": "ruphun",
                                    "id": "flct16n",
                                    "parent_id": "t1_flc1gem",
                                    "score": -3,
                                    "created_utc": 1585045313.0,
                                    "replies": [
                                        {
                                            "body": "But we shouldn't be gate keeping and god knows how many sugar daddies do that for their benefit being demanding and desperate it goes both ways.",
                                            "author": "lbseida",
                                            "id": "flf3zaq",
                                            "parent_id": "t1_flct16n",
                                            "score": 1,
                                            "created_utc": 1585097538.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "Desperation does not denote reckless behavior. \n\nDesperation causes people to take chances they normally wouldn’t. Yes sometimes they can be reckless, but the two behaviors are not synonymous.\n\nI completely disagree about working only if it’s something you enjoy or want to do. That’s such chicken shit lol.\n\nWith that logic you are saying janitors enjoy or want to clean shit on toilets? I would say the vast majority or janitors don’t enjoy their jobs, but they have to as means to live. Not everyone can afford to have jobs they want to do or enjoy, and that’s okay! Sometimes jobs are stepping stones to bigger things. Sugar is not the exception. Some girls may not want to sugar but are using it as means to put themselves through college.",
                            "author": "perryplats",
                            "id": "flbshdu",
                            "parent_id": "t1_flboq7n",
                            "score": 27,
                            "created_utc": 1585011589.0,
                            "replies": [
                                {
                                    "body": "> With that logic you are saying janitors enjoy or want to clean shit on toilets? \nSex work is a complete different line of work though. You’re risking alot more than a regular job. No job is worth your mental well being that goes for both janitors and sex workers. I don’t think sacrificing your dignity is a healthy message to send. If you have mental hang ups about sugaring, if you feel guilty about it, then you shouldn’t be doing it for the sake of your own well being",
                                    "author": null,
                                    "id": "flc2daq",
                                    "parent_id": "t1_flbshdu",
                                    "score": 3,
                                    "created_utc": 1585018179.0,
                                    "replies": []
                                },
                                {
                                    "body": "Except sugaring is not a job. It's a relationship. And you should not be in a relationship if you do not like the other person or want to be with them or enjoy doing the things a relationship entails.",
                                    "author": "Meowohmeow20",
                                    "id": "flbxjy5",
                                    "parent_id": "t1_flbshdu",
                                    "score": 2,
                                    "created_utc": 1585014939.0,
                                    "replies": [
                                        {
                                            "body": "[removed]",
                                            "author": null,
                                            "id": "flc0rxt",
                                            "parent_id": "t1_flbxjy5",
                                            "score": 2,
                                            "created_utc": 1585017100.0,
                                            "replies": [
                                                {
                                                    "body": "Sex work is not sugaring tho. It's like chess and checkers, same field but completely different rules. You cant apply your escorting rules to this sugar lifestyle sub. Sugar relationships shouldn't feel like work, plain and simple.",
                                                    "author": "Meowohmeow20",
                                                    "id": "flc43pz",
                                                    "parent_id": "t1_flc0rxt",
                                                    "score": -6,
                                                    "created_utc": 1585019396.0,
                                                    "replies": [
                                                        {
                                                            "body": "[removed]",
                                                            "author": null,
                                                            "id": "flc4cc0",
                                                            "parent_id": "t1_flc43pz",
                                                            "score": 2,
                                                            "created_utc": 1585019572.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "fle5rhi",
                    "parent_id": "t1_flbo1e2",
                    "score": -1,
                    "created_utc": 1585078110.0,
                    "replies": [
                        {
                            "body": "SR can be sex work. It’s dependent on the nature of the SR",
                            "author": "perryplats",
                            "id": "flep45e",
                            "parent_id": "t1_fle5rhi",
                            "score": 1,
                            "created_utc": 1585088693.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "flgmskw",
                                    "parent_id": "t1_flep45e",
                                    "score": 1,
                                    "created_utc": 1585146142.0,
                                    "replies": [
                                        {
                                            "body": "I’m not going to waste my time and try to convince you SOME SRs are sex work. Obviously you have an issue with sex work and accepting you participate in it to some degree. Not a me issue",
                                            "author": "perryplats",
                                            "id": "flgnlvi",
                                            "parent_id": "t1_flgmskw",
                                            "score": 0,
                                            "created_utc": 1585146626.0,
                                            "replies": [
                                                {
                                                    "body": "[deleted]",
                                                    "author": null,
                                                    "id": "flgo8z0",
                                                    "parent_id": "t1_flgnlvi",
                                                    "score": 1,
                                                    "created_utc": 1585147005.0,
                                                    "replies": [
                                                        {
                                                            "body": "SRs can be sex work. if you're exchanging cash and there's sexual favors involved at some point, then it's sex work. nothing to be embarrassed or ashamed about. we all know why we're in this.",
                                                            "author": "fortyonematters",
                                                            "id": "flhaklb",
                                                            "parent_id": "t1_flgo8z0",
                                                            "score": 2,
                                                            "created_utc": 1585159112.0,
                                                            "replies": []
                                                        },
                                                        {
                                                            "body": "Okay honey dear",
                                                            "author": "perryplats",
                                                            "id": "flgooxh",
                                                            "parent_id": "t1_flgo8z0",
                                                            "score": 0,
                                                            "created_utc": 1585147261.0,
                                                            "replies": [
                                                                {
                                                                    "body": "[deleted]",
                                                                    "author": null,
                                                                    "id": "flgpzx7",
                                                                    "parent_id": "t1_flgooxh",
                                                                    "score": 1,
                                                                    "created_utc": 1585148028.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "I don’t agree 😘😘",
                                                                            "author": "perryplats",
                                                                            "id": "flgq4ge",
                                                                            "parent_id": "t1_flgpzx7",
                                                                            "score": 0,
                                                                            "created_utc": 1585148101.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "[deleted]",
                                                                                    "author": null,
                                                                                    "id": "flguk6b",
                                                                                    "parent_id": "t1_flgq4ge",
                                                                                    "score": 1,
                                                                                    "created_utc": 1585150590.0,
                                                                                    "replies": [
                                                                                        {
                                                                                            "body": "Well I don’t honey dear 😘😘😘",
                                                                                            "author": "perryplats",
                                                                                            "id": "flgumf5",
                                                                                            "parent_id": "t1_flguk6b",
                                                                                            "score": 0,
                                                                                            "created_utc": 1585150624.0,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "body": "[deleted]",
                                                                                                    "author": null,
                                                                                                    "id": "flguq58",
                                                                                                    "parent_id": "t1_flgumf5",
                                                                                                    "score": 1,
                                                                                                    "created_utc": 1585150681.0,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "body": "I never said I agreed, but whatever makes you feel better and entertained in this quarantine 😘😘😘",
                                                                                                            "author": "perryplats",
                                                                                                            "id": "flgvzsl",
                                                                                                            "parent_id": "t1_flguq58",
                                                                                                            "score": 0,
                                                                                                            "created_utc": 1585151379.0,
                                                                                                            "replies": []
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I get your point but I hope you know what you're saying is in fact pointless. \n\nPeople are gonna do what they wanna do. \n\nCrucial times always leads to a spike in lucrative endeavors, sugaring isn't suddenly off limits just cuz. \n\nJust because some people are gonna jump in the bowl now (SDs/SMs/SBs) doesn't mean they are desperate. Some people are level headed amidst a crisis.",
            "author": "bsbdfw",
            "id": "flbqr0c",
            "parent_id": "t3_fnurrc",
            "score": 28,
            "created_utc": 1585010467.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "flbsnil",
                    "parent_id": "t1_flbqr0c",
                    "score": 1,
                    "created_utc": 1585011700.0,
                    "replies": [
                        {
                            "body": "Look at what I said\n>doesn't mean they are desperate. Some people are level headed amidst a crisis.\n\nI am using the term level headed to describe the ones entering the bowl who aren't desperate. That does include the various modes of meeting people. One can self isolate & still meet someone...",
                            "author": "bsbdfw",
                            "id": "flbte8v",
                            "parent_id": "t1_flbsnil",
                            "score": 3,
                            "created_utc": 1585012180.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "seems to me you are discouraging other SB's from joining the bowl to increase your chances of finding an arrangement",
            "author": "Issugar",
            "id": "flcaxk8",
            "parent_id": "t3_fnurrc",
            "score": 16,
            "created_utc": 1585024724.0,
            "replies": [
                {
                    "body": "You hit the nail right on the head!",
                    "author": "CherryBomb_25",
                    "id": "fldj9j8",
                    "parent_id": "t1_flcaxk8",
                    "score": 3,
                    "created_utc": 1585065643.0,
                    "replies": []
                },
                {
                    "body": "I've never been in an arrangementbut I can understand how it goes. It's a business arrangement it's not for fun otherwise there wouldn't be an exchange of goods. These girls are just looking out for themselves and that's bad for everybody's business. Basically the regular assholes trying to get a easy buck",
                    "author": "correctfitment",
                    "id": "flcqiok",
                    "parent_id": "t1_flcaxk8",
                    "score": 1,
                    "created_utc": 1585042090.0,
                    "replies": [
                        {
                            "body": ">i've never been in an arrangementbut I can understand how it goes. \n\nActually from the sounds of it, you dont know how it goes. You probably should not make judgments on things you haven't actually participated in/\n\n>it's a business arrangement \n\nNo, its a relationship arrangement. Just like before you get married, and you have a conversation, about who will take care of the financial responsibilities, who will do the cleaning chores, or any other discussions about sex, birth control, children etc. \n\n>it's not for fun otherwise there wouldn't be an exchange of goods. \n\nAll relationships between a man and a women have an exchange of goods. \n\nAlso, regardless of whether there is an exchange of goods or not, how do you know it's not fun otherwise? Many woman are attracted to their SD, many women enjoy the company of their SD, and many even look for ways to spend additional time with their SD without looking for additional compensation.   \n\n\n>These girls are just looking out for themselves and that's bad for everybody's business. Basically the regular assholes trying to get a easy buck\n\nSome girls are only looking out for themselves. Most of the time, if a man has any real world experience with women, he can spot users, and those that are only there for themselves. Unlike a regular vanilla relationship where a man has to do all the work to win over a women, with sugar relationships, it's mutually b beneficial, if a women is not looking out for her SDs happiness, she will get cut loose, and will easily be replaced. Whereas in vanilla relationships men tend to hold onto toxic women for fear of them not being easily replaced. Sugar is the great equalizer in male / female relationships and makes a woman pull her weight in the relationship.",
                            "author": "ruphun",
                            "id": "flctihy",
                            "parent_id": "t1_flcqiok",
                            "score": 3,
                            "created_utc": 1585045914.0,
                            "replies": [
                                {
                                    "body": "> All relationships between a man and a women have an exchange of goods.\n\nnegative. you must be hanging out with a lot of gold diggers. a legitimate relationship should be independent of money and sex. something like that is obv hard to find but those relationships do exist and it should be something people should strive for. a sugar relationship is a structured relation where both parties can get what they want and can be very no strings attached\n\n>Whereas in vanilla relationships men tend to hold onto toxic women for fear of them not being easily replaced.\n\nthese types of men are beta chodes and need to improve themselves. they are causing their own suffering by holding onto toxic girls",
                                    "author": "fortyonematters",
                                    "id": "flhb3ia",
                                    "parent_id": "t1_flctihy",
                                    "score": 0,
                                    "created_utc": 1585159383.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "It should be fun, and if you aren't having fun, you ain't doing it right",
                            "author": "Issugar",
                            "id": "fldashm",
                            "parent_id": "t1_flcqiok",
                            "score": 2,
                            "created_utc": 1585060600.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I understand your overall point is to give advice, but I think it's a very odd delivery and kind of not your business.",
            "author": "blueeyesinkentucky",
            "id": "flbzaud",
            "parent_id": "t3_fnurrc",
            "score": 23,
            "created_utc": 1585016118.0,
            "replies": [
                {
                    "body": "Exactly and what's wrong with just talking and building a relationship for when quarantine is over? If anything there's more time to talk online and decide what you truly want out of a relationship so that in the future you can follow through with it if that's your decision.",
                    "author": "lbseida",
                    "id": "flc1tbm",
                    "parent_id": "t1_flbzaud",
                    "score": 16,
                    "created_utc": 1585017807.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "We all must survive.  Not everyone has the luxury of just dipping deeper into savings.  If girls need to start now despite the tricky timing we should help them as much as we can.",
            "author": "MidwestAmMan",
            "id": "flbtr31",
            "parent_id": "t3_fnurrc",
            "score": 31,
            "created_utc": 1585012408.0,
            "replies": [
                {
                    "body": "Just give everyone who asks some $?",
                    "author": "marker3000",
                    "id": "flcjxk6",
                    "parent_id": "t1_flbtr31",
                    "score": -3,
                    "created_utc": 1585033805.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Ahhh trying to scare away the competition",
            "author": "BigBearSD",
            "id": "flcw9cu",
            "parent_id": "t3_fnurrc",
            "score": 7,
            "created_utc": 1585049059.0,
            "replies": []
        },
        {
            "body": "This is pretty normal. The bowl always gets a bump when there's a economic crisis.",
            "author": "SDNH79",
            "id": "fld754a",
            "parent_id": "t3_fnurrc",
            "score": 3,
            "created_utc": 1585058203.0,
            "replies": []
        },
        {
            "body": "This is the perfect time to be seeking and meeting (virtually only) with pots (SBs and SDs)and setting things up now for when the pandemic subsides and you can start to execute on these arrangements. During this period there really should be minimal to no money or racy photo/video exchanges. A lot of folks have time on their hands right now from just being cooped up at home. So get out there virtually and start laying some foundation.",
            "author": "DesertCool500",
            "id": "fldksvd",
            "parent_id": "t3_fnurrc",
            "score": 3,
            "created_utc": 1585066521.0,
            "replies": []
        },
        {
            "body": "In general it's a terrible time to be potentially swapping bodily fluids with anyone who you don't know where else they've been, and most places where you could go on a date are closed, so definitely a bad time to enter the bowl.",
            "author": "roscoe7585",
            "id": "flbrnrh",
            "parent_id": "t3_fnurrc",
            "score": 8,
            "created_utc": 1585011057.0,
            "replies": []
        },
        {
            "body": "It’s a good time as a SB to get your hustle good for the summer.",
            "author": null,
            "id": "flbmzvs",
            "parent_id": "t3_fnurrc",
            "score": 13,
            "created_utc": 1585008058.0,
            "replies": [
                {
                    "body": "Disagree. Not a good time to be “practicing” because the potentials you’ll find right now aren’t representative of the real sugar bowl. I mean maybe if you’re trying to rinse dudes",
                    "author": null,
                    "id": "flbnklf",
                    "parent_id": "t1_flbmzvs",
                    "score": 4,
                    "created_utc": 1585008425.0,
                    "replies": [
                        {
                            "body": "Um, not practicing. I mean reading, watching videos and making goals. \n\nI don’t need anymore since I’ve got two SDs.",
                            "author": null,
                            "id": "flbo1ze",
                            "parent_id": "t1_flbnklf",
                            "score": 13,
                            "created_utc": 1585008732.0,
                            "replies": [
                                {
                                    "body": "Oh totally misunderstood what you were saying! No this is definitely a good time for that I agree. Shit girl wtf else we supposed to do🤣",
                                    "author": null,
                                    "id": "flbox79",
                                    "parent_id": "t1_flbo1ze",
                                    "score": 2,
                                    "created_utc": 1585009285.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Happy cake day!",
                    "author": "lbseida",
                    "id": "flc1j7p",
                    "parent_id": "t1_flbmzvs",
                    "score": 1,
                    "created_utc": 1585017614.0,
                    "replies": [
                        {
                            "body": "Thank you. ❤️",
                            "author": null,
                            "id": "flc2k5d",
                            "parent_id": "t1_flc1j7p",
                            "score": 2,
                            "created_utc": 1585018309.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I’d like to say Tiktok is part of the blame as well. Just recently started using the app, and I’ve bumped into several videos of sugar babies who claim they got all their presented luxurious things from being a sugar baby, who—wait for it!! Don’t have sex. Even seen many comments like, “Please post another video to help us out! All these sugar daddies don’t want online only😫😫”",
            "author": "beheadedSB",
            "id": "flccclz",
            "parent_id": "t3_fnurrc",
            "score": 5,
            "created_utc": 1585025956.0,
            "replies": [
                {
                    "body": "Ughhh the whole sugar baby social media craze is TOXIC! These girls are being set up for so much disappointment",
                    "author": null,
                    "id": "flcde5b",
                    "parent_id": "t1_flccclz",
                    "score": 8,
                    "created_utc": 1585026910.0,
                    "replies": [
                        {
                            "body": "Don't have sex. Don't do meets. Don't even have time to text. Only got time to check their Paypal accounts.",
                            "author": "god_sized_cock",
                            "id": "fldc9m6",
                            "parent_id": "t1_flcde5b",
                            "score": 2,
                            "created_utc": 1585061524.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "lol can you send me some example posts of that. i wanna see all those girls dreaming of online only lol",
                    "author": "fortyonematters",
                    "id": "flhbf85",
                    "parent_id": "t1_flccclz",
                    "score": 1,
                    "created_utc": 1585159552.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I know this isn’t a good time, but why’d I have to start getting back to it a week before all this went down!! I’m starting at zero. Chatted with a few POT and BAM!!! My job is off too, would’ve been a perfect time to meet. Oh well, back to the Sugar Study Guide!",
            "author": "JayWayAlways",
            "id": "flbwqxg",
            "parent_id": "t3_fnurrc",
            "score": 2,
            "created_utc": 1585014398.0,
            "replies": []
        },
        {
            "body": "Well I’m new and I’ve had plenty of success on this app. You can’t tell people what to do and what now to do. They’re gonna do what they want. 🤷🏾‍♀️",
            "author": null,
            "id": "flc4rap",
            "parent_id": "t3_fnurrc",
            "score": 2,
            "created_utc": 1585019882.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "flcpxsm",
            "parent_id": "t3_fnurrc",
            "score": 2,
            "created_utc": 1585041355.0,
            "replies": [
                {
                    "body": "I see you may have posted a number which is most likely an amount in relations to an arrangement. If this is the case, you are violating Rule#4 - \"No dollar amounts that are in reference to allowance/PPM are allowed.\"\n\n\nIf you are curious about Allowances reported by SLF contributors please see the [Allowance Master Thread 2019-2020](https://www.reddit.com/r/sugarlifestyleforum/comments/dezl91/allowance_master_thread_20192020/?utm_source=reddit&utm_medium=usertext&utm_name=sugarlifestyleforum&utm_content=t3_dnk455)\n\nYour post will not be approved until you remove the amount.  Please read the sub [Rules](https://www.reddit.com/r/sugarlifestyleforum/comments/748zta/updated_and_clarified_rules_for_slf/?utm_source=reddit&utm_medium=usertext&utm_name=sugarlifestyleforum&utm_content=t3_91lpnr) prior to posting anything else. \n\nIf you simply posted a number not referencing a monetary amount, please message the MODs to approve your post.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/sugarlifestyleforum) if you have any questions or concerns.*",
                    "author": "AutoModerator",
                    "id": "flcpxt4",
                    "parent_id": "t1_flcpxsm",
                    "score": 2,
                    "created_utc": 1585041356.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "SBs should be wary of SDs taking advantage. There’s a difference between needing to do something and wanting to do something. A lot of SBs are educated, smart, and can make their own money to sustain themselves but choose to sugar to either invest in their business or not have to work a traditional 9-5. I would not discourage anyone in a time of need to not do what they have to do but I just don’t see how it could be done safely. Predators are out preying on desperate women and there is very few places to meet in public. You can’t make money if you dead. This is why I believe in multiple streams of income including a job, multiple long term SDs etc. Most of these SD relationships only last 2-3 months then SBs are scrambling to find another SD. I have two arrangements right now. One for 2 and a half years and another for a year and a few months. A lot of SBs think it’s cute to go from one SD to another every two months but what they don’t understand is that it’s the long term arrangements that will really help you when you are going through a hard time financially. For new SBs it’s definitely a difficult time to try to start sugaring safely.",
            "author": "liliflower85",
            "id": "fld88jb",
            "parent_id": "t3_fnurrc",
            "score": 2,
            "created_utc": 1585058934.0,
            "replies": [
                {
                    "body": "Thank you so much for this! I think sb’s should definitely do their best to look out for one another. Staying safe physically and mentally is always priority #1",
                    "author": null,
                    "id": "fldcoim",
                    "parent_id": "t1_fld88jb",
                    "score": 1,
                    "created_utc": 1585061777.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "It's almost immoral to be starting a sugar relationship now. Anyone is at risk of COVID-19/ Corona virus at the moment. And swapping any fluids with people or touching them can spread it.\nI don't want to know or gamble I've contributed to someone's death by being irresponsible.\nThings need to stay on line until this all clams down. Find other ways to make money until it is safe again.\n#stayathome",
            "author": "BrunetteYlondon",
            "id": "flcvssc",
            "parent_id": "t3_fnurrc",
            "score": 2,
            "created_utc": 1585048562.0,
            "replies": []
        },
        {
            "body": "what’s ur opinion on sd’s joining for the first time then? same? im not new but not currently in an arrangement, & living in a major metro city there’s been a huge spike in new accounts.",
            "author": "akirajadetv",
            "id": "flcfqva",
            "parent_id": "t3_fnurrc",
            "score": 1,
            "created_utc": 1585029195.0,
            "replies": []
        },
        {
            "body": "Well no one has taken me up on my offer to self isolate with me.   Not sure I would do if they said yes.",
            "author": "brit-sd",
            "id": "fld0uql",
            "parent_id": "t3_fnurrc",
            "score": 1,
            "created_utc": 1585053466.0,
            "replies": []
        },
        {
            "body": "I’m looking to get back into sugaring now so not a total newbie. It’s not so much about the money for me. I know I should be practicing social distancing but it feels so bad (in a good way) to meet a new daddy right now.",
            "author": "throwawaygirlfun1",
            "id": "flbpozd",
            "parent_id": "t3_fnurrc",
            "score": 3,
            "created_utc": 1585009779.0,
            "replies": []
        },
        {
            "body": "This is great advice, and hopefully the newbies (or would-be newbies) read this, but realistically the ones who are in desperation are probably just signing up and not reading this first.",
            "author": "UseTheForceRey",
            "id": "flbv9k5",
            "parent_id": "t3_fnurrc",
            "score": 1,
            "created_utc": 1585013405.0,
            "replies": []
        },
        {
            "body": "Thank you for saying this! I’m not a newbie but not in a serious arrangement at the moment so I just went ahead disabled my SA account for the time being. Too much going on.",
            "author": "Dont_Cry_Shop_Girl",
            "id": "flby78c",
            "parent_id": "t3_fnurrc",
            "score": 0,
            "created_utc": 1585015376.0,
            "replies": []
        },
        {
            "body": "This\n\nI'm getting multiple messages a day for online, help me now with the promise of meeting later, all the other BS>",
            "author": "mraspencer",
            "id": "flbqjjw",
            "parent_id": "t1_flbof7q",
            "score": 19,
            "created_utc": 1585010329.0,
            "replies": []
        },
        {
            "body": "I've always intended on meeting anyone that helps me, but daddies ghost a lot also... Just a perspective from the other side.",
            "author": "blueeyesinkentucky",
            "id": "flbzeh3",
            "parent_id": "t1_flbof7q",
            "score": 13,
            "created_utc": 1585016185.0,
            "replies": []
        },
        {
            "body": "ya i just instantly block. i've been on SA for years so i can kind of detect it before it even comes up. usually just glancing at their profile i can tell if they're gonna say the usual bullshit \"online only, feet pictures, no meeting up\". if i'm in doubt, i usually just block anyway, unless i'm very into her. you get better at filtering out the stupid messages before they even get to you",
            "author": "fortyonematters",
            "id": "flh9zki",
            "parent_id": "t1_flbof7q",
            "score": 1,
            "created_utc": 1585158811.0,
            "replies": []
        },
        {
            "body": "\"$50 before we meet to make sure youre real\".  And half of them appear to be out of work dancers, the other scammers half way across the world.",
            "author": "VladTheFootballStar",
            "id": "fld632k",
            "parent_id": "t1_flbof7q",
            "score": 1,
            "created_utc": 1585057475.0,
            "replies": []
        },
        {
            "body": "Is it dangerous to receive money through venmo? I had one wanting to send me money through venmo and when I suggested another way he vanished. Was that scammer?",
            "author": null,
            "id": "flcr454",
            "parent_id": "t1_flbof7q",
            "score": 0,
            "created_utc": 1585042849.0,
            "replies": [
                {
                    "body": "From what I hear Venmo charges can be reversed by the sender fairly easily.",
                    "author": "The_Year_2525",
                    "id": "flfjk2j",
                    "parent_id": "t1_flcr454",
                    "score": 2,
                    "created_utc": 1585108255.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Right like how judgy lol god forbid she works hard doing whatever it takes to make ends meet. As mentioned as long as yr respectful and chill its fine.. Whether you seek an sd out of need or desire yr still doing the same thing.  \n\nBut fr COVID is real rn yall so stay safe n healthy ❤",
            "author": "OfficialRedQueen",
            "id": "flc8ndp",
            "parent_id": "t1_flbo1e2",
            "score": 26,
            "created_utc": 1585022841.0,
            "replies": []
        },
        {
            "body": "> It gives SB’s a bad name.\n\nGood advice but bad reason. \n\nFor any potential SB the decision should be an individual one based on a host of factors.  As I think the poster intended, \"sudden economic necessity\"  far too often leads to disappointment, failure and damage to the novice SB.  \n\nIf you truly feel it is an optional adventure with potential economic benefits and you do not fall into the  a) looking for sugar mama, b) looking for platonic  c)likely to be damaged by the nature of the relationship ,  then proceed with caution.  \n\nThe bigger picture is that this is a time when people are drastically cutting back on their contact with others,  especially discretionary contacts . \n\nThe market profits of the last 3 years have largely disappeared and many are looking at significantly reduced income. In addition for most long time SD's, former SB's are calling home, seeking to rekindle old relationships.",
            "author": "pinotandsugar",
            "id": "flbozfw",
            "parent_id": "t1_flbo1e2",
            "score": 12,
            "created_utc": 1585009326.0,
            "replies": []
        },
        {
            "body": "THIS. its not up to sb's to tell others if they're ready or not to join the sugar bowl. Worry about yourself and stay in your lane periodt",
            "author": "lbseida",
            "id": "flc196w",
            "parent_id": "t1_flbo1e2",
            "score": 8,
            "created_utc": 1585017425.0,
            "replies": []
        },
        {
            "body": "> Some SBs come into this for “sex work” \n\nAnd there are boat loads of sex worker seekers here as well all using this sugar venue in a way it isn't intended. Desperate SBs will get the fast food crowd.",
            "author": "GSSD",
            "id": "flddczr",
            "parent_id": "t1_flbo1e2",
            "score": 2,
            "created_utc": 1585062193.0,
            "replies": []
        },
        {
            "body": "If I’m gatekeeping by advising people not to enter the bowl out of desperation than so be it. I think it’s solid advice. Im a sex worker outside of sugaring too. But I would say the same about my job: don’t do this unless it’s something you *want* to do and would *enjoy* doing. Acting out of desperation is not empowering and can definitely be traumatic.",
            "author": null,
            "id": "flboq7n",
            "parent_id": "t1_flbo1e2",
            "score": 8,
            "created_utc": 1585009161.0,
            "replies": [
                {
                    "body": "what makes you think that you should gate keep? \n\neach relationship - SR, vanilla, or otherwise - is between the people who are in it. \n\nPeriod. \n\nOutside input, especially unsolicited, is just grandstanding. Its not up to you, or anyone else,  to decide or dictate who, when, where, why and under what circumstances any adult, other than yourself, should enter into relationships of any sort.",
                    "author": "LizLemon_015",
                    "id": "flc8d4m",
                    "parent_id": "t1_flboq7n",
                    "score": 15,
                    "created_utc": 1585022613.0,
                    "replies": [
                        {
                            "body": "Unsolicited advice? Girl read the subs description this forum is here so that we can learn from eachothers experiences. If you really have a problem with me saying you shouldn’t preform sexual acts on someone you don’t want to idk what to tell you cus I still stand by that",
                            "author": null,
                            "id": "flccwmb",
                            "parent_id": "t1_flc8d4m",
                            "score": -5,
                            "created_utc": 1585026459.0,
                            "replies": [
                                {
                                    "body": "teaching and brow-beating are two different things hun.\n\nmy only problem is you (or anyone) telling another person what to do in such a condescending way, especially when no one asked you to begin with.\n\nthis thread says way more about you than the SB's you're trying to gate keep",
                                    "author": "LizLemon_015",
                                    "id": "flcg8su",
                                    "parent_id": "t1_flccwmb",
                                    "score": 12,
                                    "created_utc": 1585029712.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Some do it out of desperation some do it because they enjoy it. Its not up to others to determine why they are there. Sex work exists on all levels for that very reason.",
                    "author": "lbseida",
                    "id": "flc1gem",
                    "parent_id": "t1_flboq7n",
                    "score": 11,
                    "created_utc": 1585017562.0,
                    "replies": [
                        {
                            "body": "!!!!",
                            "author": "perryplats",
                            "id": "flc4emu",
                            "parent_id": "t1_flc1gem",
                            "score": 1,
                            "created_utc": 1585019619.0,
                            "replies": []
                        },
                        {
                            "body": ">Some do it out of desperation some do it because they enjoy it. Its not up to others to determine why they are there. \n\nYes some do it out of desperation, but they shouldnt enter into a sugar relationship when desperate. Not only can they can scammed or manipulated, but they can also end up being very needy and demanding, and not the type of SB that most SD want. Even Seeking in their blogs has said not to enter into a SR when desperate to get a job instead. Because SR are relationships, not work. They were never intended to be someones job.",
                            "author": "ruphun",
                            "id": "flct16n",
                            "parent_id": "t1_flc1gem",
                            "score": -3,
                            "created_utc": 1585045313.0,
                            "replies": [
                                {
                                    "body": "But we shouldn't be gate keeping and god knows how many sugar daddies do that for their benefit being demanding and desperate it goes both ways.",
                                    "author": "lbseida",
                                    "id": "flf3zaq",
                                    "parent_id": "t1_flct16n",
                                    "score": 1,
                                    "created_utc": 1585097538.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Desperation does not denote reckless behavior. \n\nDesperation causes people to take chances they normally wouldn’t. Yes sometimes they can be reckless, but the two behaviors are not synonymous.\n\nI completely disagree about working only if it’s something you enjoy or want to do. That’s such chicken shit lol.\n\nWith that logic you are saying janitors enjoy or want to clean shit on toilets? I would say the vast majority or janitors don’t enjoy their jobs, but they have to as means to live. Not everyone can afford to have jobs they want to do or enjoy, and that’s okay! Sometimes jobs are stepping stones to bigger things. Sugar is not the exception. Some girls may not want to sugar but are using it as means to put themselves through college.",
                    "author": "perryplats",
                    "id": "flbshdu",
                    "parent_id": "t1_flboq7n",
                    "score": 27,
                    "created_utc": 1585011589.0,
                    "replies": [
                        {
                            "body": "> With that logic you are saying janitors enjoy or want to clean shit on toilets? \nSex work is a complete different line of work though. You’re risking alot more than a regular job. No job is worth your mental well being that goes for both janitors and sex workers. I don’t think sacrificing your dignity is a healthy message to send. If you have mental hang ups about sugaring, if you feel guilty about it, then you shouldn’t be doing it for the sake of your own well being",
                            "author": null,
                            "id": "flc2daq",
                            "parent_id": "t1_flbshdu",
                            "score": 3,
                            "created_utc": 1585018179.0,
                            "replies": []
                        },
                        {
                            "body": "Except sugaring is not a job. It's a relationship. And you should not be in a relationship if you do not like the other person or want to be with them or enjoy doing the things a relationship entails.",
                            "author": "Meowohmeow20",
                            "id": "flbxjy5",
                            "parent_id": "t1_flbshdu",
                            "score": 2,
                            "created_utc": 1585014939.0,
                            "replies": [
                                {
                                    "body": "[removed]",
                                    "author": null,
                                    "id": "flc0rxt",
                                    "parent_id": "t1_flbxjy5",
                                    "score": 2,
                                    "created_utc": 1585017100.0,
                                    "replies": [
                                        {
                                            "body": "Sex work is not sugaring tho. It's like chess and checkers, same field but completely different rules. You cant apply your escorting rules to this sugar lifestyle sub. Sugar relationships shouldn't feel like work, plain and simple.",
                                            "author": "Meowohmeow20",
                                            "id": "flc43pz",
                                            "parent_id": "t1_flc0rxt",
                                            "score": -6,
                                            "created_utc": 1585019396.0,
                                            "replies": [
                                                {
                                                    "body": "[removed]",
                                                    "author": null,
                                                    "id": "flc4cc0",
                                                    "parent_id": "t1_flc43pz",
                                                    "score": 2,
                                                    "created_utc": 1585019572.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "fle5rhi",
            "parent_id": "t1_flbo1e2",
            "score": -1,
            "created_utc": 1585078110.0,
            "replies": [
                {
                    "body": "SR can be sex work. It’s dependent on the nature of the SR",
                    "author": "perryplats",
                    "id": "flep45e",
                    "parent_id": "t1_fle5rhi",
                    "score": 1,
                    "created_utc": 1585088693.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "flgmskw",
                            "parent_id": "t1_flep45e",
                            "score": 1,
                            "created_utc": 1585146142.0,
                            "replies": [
                                {
                                    "body": "I’m not going to waste my time and try to convince you SOME SRs are sex work. Obviously you have an issue with sex work and accepting you participate in it to some degree. Not a me issue",
                                    "author": "perryplats",
                                    "id": "flgnlvi",
                                    "parent_id": "t1_flgmskw",
                                    "score": 0,
                                    "created_utc": 1585146626.0,
                                    "replies": [
                                        {
                                            "body": "[deleted]",
                                            "author": null,
                                            "id": "flgo8z0",
                                            "parent_id": "t1_flgnlvi",
                                            "score": 1,
                                            "created_utc": 1585147005.0,
                                            "replies": [
                                                {
                                                    "body": "SRs can be sex work. if you're exchanging cash and there's sexual favors involved at some point, then it's sex work. nothing to be embarrassed or ashamed about. we all know why we're in this.",
                                                    "author": "fortyonematters",
                                                    "id": "flhaklb",
                                                    "parent_id": "t1_flgo8z0",
                                                    "score": 2,
                                                    "created_utc": 1585159112.0,
                                                    "replies": []
                                                },
                                                {
                                                    "body": "Okay honey dear",
                                                    "author": "perryplats",
                                                    "id": "flgooxh",
                                                    "parent_id": "t1_flgo8z0",
                                                    "score": 0,
                                                    "created_utc": 1585147261.0,
                                                    "replies": [
                                                        {
                                                            "body": "[deleted]",
                                                            "author": null,
                                                            "id": "flgpzx7",
                                                            "parent_id": "t1_flgooxh",
                                                            "score": 1,
                                                            "created_utc": 1585148028.0,
                                                            "replies": [
                                                                {
                                                                    "body": "I don’t agree 😘😘",
                                                                    "author": "perryplats",
                                                                    "id": "flgq4ge",
                                                                    "parent_id": "t1_flgpzx7",
                                                                    "score": 0,
                                                                    "created_utc": 1585148101.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "[deleted]",
                                                                            "author": null,
                                                                            "id": "flguk6b",
                                                                            "parent_id": "t1_flgq4ge",
                                                                            "score": 1,
                                                                            "created_utc": 1585150590.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "Well I don’t honey dear 😘😘😘",
                                                                                    "author": "perryplats",
                                                                                    "id": "flgumf5",
                                                                                    "parent_id": "t1_flguk6b",
                                                                                    "score": 0,
                                                                                    "created_utc": 1585150624.0,
                                                                                    "replies": [
                                                                                        {
                                                                                            "body": "[deleted]",
                                                                                            "author": null,
                                                                                            "id": "flguq58",
                                                                                            "parent_id": "t1_flgumf5",
                                                                                            "score": 1,
                                                                                            "created_utc": 1585150681.0,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "body": "I never said I agreed, but whatever makes you feel better and entertained in this quarantine 😘😘😘",
                                                                                                    "author": "perryplats",
                                                                                                    "id": "flgvzsl",
                                                                                                    "parent_id": "t1_flguq58",
                                                                                                    "score": 0,
                                                                                                    "created_utc": 1585151379.0,
                                                                                                    "replies": []
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "flbsnil",
            "parent_id": "t1_flbqr0c",
            "score": 1,
            "created_utc": 1585011700.0,
            "replies": [
                {
                    "body": "Look at what I said\n>doesn't mean they are desperate. Some people are level headed amidst a crisis.\n\nI am using the term level headed to describe the ones entering the bowl who aren't desperate. That does include the various modes of meeting people. One can self isolate & still meet someone...",
                    "author": "bsbdfw",
                    "id": "flbte8v",
                    "parent_id": "t1_flbsnil",
                    "score": 3,
                    "created_utc": 1585012180.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "You hit the nail right on the head!",
            "author": "CherryBomb_25",
            "id": "fldj9j8",
            "parent_id": "t1_flcaxk8",
            "score": 3,
            "created_utc": 1585065643.0,
            "replies": []
        },
        {
            "body": "I've never been in an arrangementbut I can understand how it goes. It's a business arrangement it's not for fun otherwise there wouldn't be an exchange of goods. These girls are just looking out for themselves and that's bad for everybody's business. Basically the regular assholes trying to get a easy buck",
            "author": "correctfitment",
            "id": "flcqiok",
            "parent_id": "t1_flcaxk8",
            "score": 1,
            "created_utc": 1585042090.0,
            "replies": [
                {
                    "body": ">i've never been in an arrangementbut I can understand how it goes. \n\nActually from the sounds of it, you dont know how it goes. You probably should not make judgments on things you haven't actually participated in/\n\n>it's a business arrangement \n\nNo, its a relationship arrangement. Just like before you get married, and you have a conversation, about who will take care of the financial responsibilities, who will do the cleaning chores, or any other discussions about sex, birth control, children etc. \n\n>it's not for fun otherwise there wouldn't be an exchange of goods. \n\nAll relationships between a man and a women have an exchange of goods. \n\nAlso, regardless of whether there is an exchange of goods or not, how do you know it's not fun otherwise? Many woman are attracted to their SD, many women enjoy the company of their SD, and many even look for ways to spend additional time with their SD without looking for additional compensation.   \n\n\n>These girls are just looking out for themselves and that's bad for everybody's business. Basically the regular assholes trying to get a easy buck\n\nSome girls are only looking out for themselves. Most of the time, if a man has any real world experience with women, he can spot users, and those that are only there for themselves. Unlike a regular vanilla relationship where a man has to do all the work to win over a women, with sugar relationships, it's mutually b beneficial, if a women is not looking out for her SDs happiness, she will get cut loose, and will easily be replaced. Whereas in vanilla relationships men tend to hold onto toxic women for fear of them not being easily replaced. Sugar is the great equalizer in male / female relationships and makes a woman pull her weight in the relationship.",
                    "author": "ruphun",
                    "id": "flctihy",
                    "parent_id": "t1_flcqiok",
                    "score": 3,
                    "created_utc": 1585045914.0,
                    "replies": [
                        {
                            "body": "> All relationships between a man and a women have an exchange of goods.\n\nnegative. you must be hanging out with a lot of gold diggers. a legitimate relationship should be independent of money and sex. something like that is obv hard to find but those relationships do exist and it should be something people should strive for. a sugar relationship is a structured relation where both parties can get what they want and can be very no strings attached\n\n>Whereas in vanilla relationships men tend to hold onto toxic women for fear of them not being easily replaced.\n\nthese types of men are beta chodes and need to improve themselves. they are causing their own suffering by holding onto toxic girls",
                            "author": "fortyonematters",
                            "id": "flhb3ia",
                            "parent_id": "t1_flctihy",
                            "score": 0,
                            "created_utc": 1585159383.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "It should be fun, and if you aren't having fun, you ain't doing it right",
                    "author": "Issugar",
                    "id": "fldashm",
                    "parent_id": "t1_flcqiok",
                    "score": 2,
                    "created_utc": 1585060600.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Exactly and what's wrong with just talking and building a relationship for when quarantine is over? If anything there's more time to talk online and decide what you truly want out of a relationship so that in the future you can follow through with it if that's your decision.",
            "author": "lbseida",
            "id": "flc1tbm",
            "parent_id": "t1_flbzaud",
            "score": 16,
            "created_utc": 1585017807.0,
            "replies": []
        },
        {
            "body": "Just give everyone who asks some $?",
            "author": "marker3000",
            "id": "flcjxk6",
            "parent_id": "t1_flbtr31",
            "score": -3,
            "created_utc": 1585033805.0,
            "replies": []
        },
        {
            "body": "Disagree. Not a good time to be “practicing” because the potentials you’ll find right now aren’t representative of the real sugar bowl. I mean maybe if you’re trying to rinse dudes",
            "author": null,
            "id": "flbnklf",
            "parent_id": "t1_flbmzvs",
            "score": 4,
            "created_utc": 1585008425.0,
            "replies": [
                {
                    "body": "Um, not practicing. I mean reading, watching videos and making goals. \n\nI don’t need anymore since I’ve got two SDs.",
                    "author": null,
                    "id": "flbo1ze",
                    "parent_id": "t1_flbnklf",
                    "score": 13,
                    "created_utc": 1585008732.0,
                    "replies": [
                        {
                            "body": "Oh totally misunderstood what you were saying! No this is definitely a good time for that I agree. Shit girl wtf else we supposed to do🤣",
                            "author": null,
                            "id": "flbox79",
                            "parent_id": "t1_flbo1ze",
                            "score": 2,
                            "created_utc": 1585009285.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Happy cake day!",
            "author": "lbseida",
            "id": "flc1j7p",
            "parent_id": "t1_flbmzvs",
            "score": 1,
            "created_utc": 1585017614.0,
            "replies": [
                {
                    "body": "Thank you. ❤️",
                    "author": null,
                    "id": "flc2k5d",
                    "parent_id": "t1_flc1j7p",
                    "score": 2,
                    "created_utc": 1585018309.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Ughhh the whole sugar baby social media craze is TOXIC! These girls are being set up for so much disappointment",
            "author": null,
            "id": "flcde5b",
            "parent_id": "t1_flccclz",
            "score": 8,
            "created_utc": 1585026910.0,
            "replies": [
                {
                    "body": "Don't have sex. Don't do meets. Don't even have time to text. Only got time to check their Paypal accounts.",
                    "author": "god_sized_cock",
                    "id": "fldc9m6",
                    "parent_id": "t1_flcde5b",
                    "score": 2,
                    "created_utc": 1585061524.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "lol can you send me some example posts of that. i wanna see all those girls dreaming of online only lol",
            "author": "fortyonematters",
            "id": "flhbf85",
            "parent_id": "t1_flccclz",
            "score": 1,
            "created_utc": 1585159552.0,
            "replies": []
        },
        {
            "body": "I see you may have posted a number which is most likely an amount in relations to an arrangement. If this is the case, you are violating Rule#4 - \"No dollar amounts that are in reference to allowance/PPM are allowed.\"\n\n\nIf you are curious about Allowances reported by SLF contributors please see the [Allowance Master Thread 2019-2020](https://www.reddit.com/r/sugarlifestyleforum/comments/dezl91/allowance_master_thread_20192020/?utm_source=reddit&utm_medium=usertext&utm_name=sugarlifestyleforum&utm_content=t3_dnk455)\n\nYour post will not be approved until you remove the amount.  Please read the sub [Rules](https://www.reddit.com/r/sugarlifestyleforum/comments/748zta/updated_and_clarified_rules_for_slf/?utm_source=reddit&utm_medium=usertext&utm_name=sugarlifestyleforum&utm_content=t3_91lpnr) prior to posting anything else. \n\nIf you simply posted a number not referencing a monetary amount, please message the MODs to approve your post.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/sugarlifestyleforum) if you have any questions or concerns.*",
            "author": "AutoModerator",
            "id": "flcpxt4",
            "parent_id": "t1_flcpxsm",
            "score": 2,
            "created_utc": 1585041356.0,
            "replies": []
        },
        {
            "body": "Thank you so much for this! I think sb’s should definitely do their best to look out for one another. Staying safe physically and mentally is always priority #1",
            "author": null,
            "id": "fldcoim",
            "parent_id": "t1_fld88jb",
            "score": 1,
            "created_utc": 1585061777.0,
            "replies": []
        },
        {
            "body": "From what I hear Venmo charges can be reversed by the sender fairly easily.",
            "author": "The_Year_2525",
            "id": "flfjk2j",
            "parent_id": "t1_flcr454",
            "score": 2,
            "created_utc": 1585108255.0,
            "replies": []
        },
        {
            "body": "what makes you think that you should gate keep? \n\neach relationship - SR, vanilla, or otherwise - is between the people who are in it. \n\nPeriod. \n\nOutside input, especially unsolicited, is just grandstanding. Its not up to you, or anyone else,  to decide or dictate who, when, where, why and under what circumstances any adult, other than yourself, should enter into relationships of any sort.",
            "author": "LizLemon_015",
            "id": "flc8d4m",
            "parent_id": "t1_flboq7n",
            "score": 15,
            "created_utc": 1585022613.0,
            "replies": [
                {
                    "body": "Unsolicited advice? Girl read the subs description this forum is here so that we can learn from eachothers experiences. If you really have a problem with me saying you shouldn’t preform sexual acts on someone you don’t want to idk what to tell you cus I still stand by that",
                    "author": null,
                    "id": "flccwmb",
                    "parent_id": "t1_flc8d4m",
                    "score": -5,
                    "created_utc": 1585026459.0,
                    "replies": [
                        {
                            "body": "teaching and brow-beating are two different things hun.\n\nmy only problem is you (or anyone) telling another person what to do in such a condescending way, especially when no one asked you to begin with.\n\nthis thread says way more about you than the SB's you're trying to gate keep",
                            "author": "LizLemon_015",
                            "id": "flcg8su",
                            "parent_id": "t1_flccwmb",
                            "score": 12,
                            "created_utc": 1585029712.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Some do it out of desperation some do it because they enjoy it. Its not up to others to determine why they are there. Sex work exists on all levels for that very reason.",
            "author": "lbseida",
            "id": "flc1gem",
            "parent_id": "t1_flboq7n",
            "score": 11,
            "created_utc": 1585017562.0,
            "replies": [
                {
                    "body": "!!!!",
                    "author": "perryplats",
                    "id": "flc4emu",
                    "parent_id": "t1_flc1gem",
                    "score": 1,
                    "created_utc": 1585019619.0,
                    "replies": []
                },
                {
                    "body": ">Some do it out of desperation some do it because they enjoy it. Its not up to others to determine why they are there. \n\nYes some do it out of desperation, but they shouldnt enter into a sugar relationship when desperate. Not only can they can scammed or manipulated, but they can also end up being very needy and demanding, and not the type of SB that most SD want. Even Seeking in their blogs has said not to enter into a SR when desperate to get a job instead. Because SR are relationships, not work. They were never intended to be someones job.",
                    "author": "ruphun",
                    "id": "flct16n",
                    "parent_id": "t1_flc1gem",
                    "score": -3,
                    "created_utc": 1585045313.0,
                    "replies": [
                        {
                            "body": "But we shouldn't be gate keeping and god knows how many sugar daddies do that for their benefit being demanding and desperate it goes both ways.",
                            "author": "lbseida",
                            "id": "flf3zaq",
                            "parent_id": "t1_flct16n",
                            "score": 1,
                            "created_utc": 1585097538.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Desperation does not denote reckless behavior. \n\nDesperation causes people to take chances they normally wouldn’t. Yes sometimes they can be reckless, but the two behaviors are not synonymous.\n\nI completely disagree about working only if it’s something you enjoy or want to do. That’s such chicken shit lol.\n\nWith that logic you are saying janitors enjoy or want to clean shit on toilets? I would say the vast majority or janitors don’t enjoy their jobs, but they have to as means to live. Not everyone can afford to have jobs they want to do or enjoy, and that’s okay! Sometimes jobs are stepping stones to bigger things. Sugar is not the exception. Some girls may not want to sugar but are using it as means to put themselves through college.",
            "author": "perryplats",
            "id": "flbshdu",
            "parent_id": "t1_flboq7n",
            "score": 27,
            "created_utc": 1585011589.0,
            "replies": [
                {
                    "body": "> With that logic you are saying janitors enjoy or want to clean shit on toilets? \nSex work is a complete different line of work though. You’re risking alot more than a regular job. No job is worth your mental well being that goes for both janitors and sex workers. I don’t think sacrificing your dignity is a healthy message to send. If you have mental hang ups about sugaring, if you feel guilty about it, then you shouldn’t be doing it for the sake of your own well being",
                    "author": null,
                    "id": "flc2daq",
                    "parent_id": "t1_flbshdu",
                    "score": 3,
                    "created_utc": 1585018179.0,
                    "replies": []
                },
                {
                    "body": "Except sugaring is not a job. It's a relationship. And you should not be in a relationship if you do not like the other person or want to be with them or enjoy doing the things a relationship entails.",
                    "author": "Meowohmeow20",
                    "id": "flbxjy5",
                    "parent_id": "t1_flbshdu",
                    "score": 2,
                    "created_utc": 1585014939.0,
                    "replies": [
                        {
                            "body": "[removed]",
                            "author": null,
                            "id": "flc0rxt",
                            "parent_id": "t1_flbxjy5",
                            "score": 2,
                            "created_utc": 1585017100.0,
                            "replies": [
                                {
                                    "body": "Sex work is not sugaring tho. It's like chess and checkers, same field but completely different rules. You cant apply your escorting rules to this sugar lifestyle sub. Sugar relationships shouldn't feel like work, plain and simple.",
                                    "author": "Meowohmeow20",
                                    "id": "flc43pz",
                                    "parent_id": "t1_flc0rxt",
                                    "score": -6,
                                    "created_utc": 1585019396.0,
                                    "replies": [
                                        {
                                            "body": "[removed]",
                                            "author": null,
                                            "id": "flc4cc0",
                                            "parent_id": "t1_flc43pz",
                                            "score": 2,
                                            "created_utc": 1585019572.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "SR can be sex work. It’s dependent on the nature of the SR",
            "author": "perryplats",
            "id": "flep45e",
            "parent_id": "t1_fle5rhi",
            "score": 1,
            "created_utc": 1585088693.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "flgmskw",
                    "parent_id": "t1_flep45e",
                    "score": 1,
                    "created_utc": 1585146142.0,
                    "replies": [
                        {
                            "body": "I’m not going to waste my time and try to convince you SOME SRs are sex work. Obviously you have an issue with sex work and accepting you participate in it to some degree. Not a me issue",
                            "author": "perryplats",
                            "id": "flgnlvi",
                            "parent_id": "t1_flgmskw",
                            "score": 0,
                            "created_utc": 1585146626.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "flgo8z0",
                                    "parent_id": "t1_flgnlvi",
                                    "score": 1,
                                    "created_utc": 1585147005.0,
                                    "replies": [
                                        {
                                            "body": "SRs can be sex work. if you're exchanging cash and there's sexual favors involved at some point, then it's sex work. nothing to be embarrassed or ashamed about. we all know why we're in this.",
                                            "author": "fortyonematters",
                                            "id": "flhaklb",
                                            "parent_id": "t1_flgo8z0",
                                            "score": 2,
                                            "created_utc": 1585159112.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "Okay honey dear",
                                            "author": "perryplats",
                                            "id": "flgooxh",
                                            "parent_id": "t1_flgo8z0",
                                            "score": 0,
                                            "created_utc": 1585147261.0,
                                            "replies": [
                                                {
                                                    "body": "[deleted]",
                                                    "author": null,
                                                    "id": "flgpzx7",
                                                    "parent_id": "t1_flgooxh",
                                                    "score": 1,
                                                    "created_utc": 1585148028.0,
                                                    "replies": [
                                                        {
                                                            "body": "I don’t agree 😘😘",
                                                            "author": "perryplats",
                                                            "id": "flgq4ge",
                                                            "parent_id": "t1_flgpzx7",
                                                            "score": 0,
                                                            "created_utc": 1585148101.0,
                                                            "replies": [
                                                                {
                                                                    "body": "[deleted]",
                                                                    "author": null,
                                                                    "id": "flguk6b",
                                                                    "parent_id": "t1_flgq4ge",
                                                                    "score": 1,
                                                                    "created_utc": 1585150590.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "Well I don’t honey dear 😘😘😘",
                                                                            "author": "perryplats",
                                                                            "id": "flgumf5",
                                                                            "parent_id": "t1_flguk6b",
                                                                            "score": 0,
                                                                            "created_utc": 1585150624.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "[deleted]",
                                                                                    "author": null,
                                                                                    "id": "flguq58",
                                                                                    "parent_id": "t1_flgumf5",
                                                                                    "score": 1,
                                                                                    "created_utc": 1585150681.0,
                                                                                    "replies": [
                                                                                        {
                                                                                            "body": "I never said I agreed, but whatever makes you feel better and entertained in this quarantine 😘😘😘",
                                                                                            "author": "perryplats",
                                                                                            "id": "flgvzsl",
                                                                                            "parent_id": "t1_flguq58",
                                                                                            "score": 0,
                                                                                            "created_utc": 1585151379.0,
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Look at what I said\n>doesn't mean they are desperate. Some people are level headed amidst a crisis.\n\nI am using the term level headed to describe the ones entering the bowl who aren't desperate. That does include the various modes of meeting people. One can self isolate & still meet someone...",
            "author": "bsbdfw",
            "id": "flbte8v",
            "parent_id": "t1_flbsnil",
            "score": 3,
            "created_utc": 1585012180.0,
            "replies": []
        },
        {
            "body": ">i've never been in an arrangementbut I can understand how it goes. \n\nActually from the sounds of it, you dont know how it goes. You probably should not make judgments on things you haven't actually participated in/\n\n>it's a business arrangement \n\nNo, its a relationship arrangement. Just like before you get married, and you have a conversation, about who will take care of the financial responsibilities, who will do the cleaning chores, or any other discussions about sex, birth control, children etc. \n\n>it's not for fun otherwise there wouldn't be an exchange of goods. \n\nAll relationships between a man and a women have an exchange of goods. \n\nAlso, regardless of whether there is an exchange of goods or not, how do you know it's not fun otherwise? Many woman are attracted to their SD, many women enjoy the company of their SD, and many even look for ways to spend additional time with their SD without looking for additional compensation.   \n\n\n>These girls are just looking out for themselves and that's bad for everybody's business. Basically the regular assholes trying to get a easy buck\n\nSome girls are only looking out for themselves. Most of the time, if a man has any real world experience with women, he can spot users, and those that are only there for themselves. Unlike a regular vanilla relationship where a man has to do all the work to win over a women, with sugar relationships, it's mutually b beneficial, if a women is not looking out for her SDs happiness, she will get cut loose, and will easily be replaced. Whereas in vanilla relationships men tend to hold onto toxic women for fear of them not being easily replaced. Sugar is the great equalizer in male / female relationships and makes a woman pull her weight in the relationship.",
            "author": "ruphun",
            "id": "flctihy",
            "parent_id": "t1_flcqiok",
            "score": 3,
            "created_utc": 1585045914.0,
            "replies": [
                {
                    "body": "> All relationships between a man and a women have an exchange of goods.\n\nnegative. you must be hanging out with a lot of gold diggers. a legitimate relationship should be independent of money and sex. something like that is obv hard to find but those relationships do exist and it should be something people should strive for. a sugar relationship is a structured relation where both parties can get what they want and can be very no strings attached\n\n>Whereas in vanilla relationships men tend to hold onto toxic women for fear of them not being easily replaced.\n\nthese types of men are beta chodes and need to improve themselves. they are causing their own suffering by holding onto toxic girls",
                    "author": "fortyonematters",
                    "id": "flhb3ia",
                    "parent_id": "t1_flctihy",
                    "score": 0,
                    "created_utc": 1585159383.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "It should be fun, and if you aren't having fun, you ain't doing it right",
            "author": "Issugar",
            "id": "fldashm",
            "parent_id": "t1_flcqiok",
            "score": 2,
            "created_utc": 1585060600.0,
            "replies": []
        },
        {
            "body": "Um, not practicing. I mean reading, watching videos and making goals. \n\nI don’t need anymore since I’ve got two SDs.",
            "author": null,
            "id": "flbo1ze",
            "parent_id": "t1_flbnklf",
            "score": 13,
            "created_utc": 1585008732.0,
            "replies": [
                {
                    "body": "Oh totally misunderstood what you were saying! No this is definitely a good time for that I agree. Shit girl wtf else we supposed to do🤣",
                    "author": null,
                    "id": "flbox79",
                    "parent_id": "t1_flbo1ze",
                    "score": 2,
                    "created_utc": 1585009285.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Thank you. ❤️",
            "author": null,
            "id": "flc2k5d",
            "parent_id": "t1_flc1j7p",
            "score": 2,
            "created_utc": 1585018309.0,
            "replies": []
        },
        {
            "body": "Don't have sex. Don't do meets. Don't even have time to text. Only got time to check their Paypal accounts.",
            "author": "god_sized_cock",
            "id": "fldc9m6",
            "parent_id": "t1_flcde5b",
            "score": 2,
            "created_utc": 1585061524.0,
            "replies": []
        },
        {
            "body": "Unsolicited advice? Girl read the subs description this forum is here so that we can learn from eachothers experiences. If you really have a problem with me saying you shouldn’t preform sexual acts on someone you don’t want to idk what to tell you cus I still stand by that",
            "author": null,
            "id": "flccwmb",
            "parent_id": "t1_flc8d4m",
            "score": -5,
            "created_utc": 1585026459.0,
            "replies": [
                {
                    "body": "teaching and brow-beating are two different things hun.\n\nmy only problem is you (or anyone) telling another person what to do in such a condescending way, especially when no one asked you to begin with.\n\nthis thread says way more about you than the SB's you're trying to gate keep",
                    "author": "LizLemon_015",
                    "id": "flcg8su",
                    "parent_id": "t1_flccwmb",
                    "score": 12,
                    "created_utc": 1585029712.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "!!!!",
            "author": "perryplats",
            "id": "flc4emu",
            "parent_id": "t1_flc1gem",
            "score": 1,
            "created_utc": 1585019619.0,
            "replies": []
        },
        {
            "body": ">Some do it out of desperation some do it because they enjoy it. Its not up to others to determine why they are there. \n\nYes some do it out of desperation, but they shouldnt enter into a sugar relationship when desperate. Not only can they can scammed or manipulated, but they can also end up being very needy and demanding, and not the type of SB that most SD want. Even Seeking in their blogs has said not to enter into a SR when desperate to get a job instead. Because SR are relationships, not work. They were never intended to be someones job.",
            "author": "ruphun",
            "id": "flct16n",
            "parent_id": "t1_flc1gem",
            "score": -3,
            "created_utc": 1585045313.0,
            "replies": [
                {
                    "body": "But we shouldn't be gate keeping and god knows how many sugar daddies do that for their benefit being demanding and desperate it goes both ways.",
                    "author": "lbseida",
                    "id": "flf3zaq",
                    "parent_id": "t1_flct16n",
                    "score": 1,
                    "created_utc": 1585097538.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "> With that logic you are saying janitors enjoy or want to clean shit on toilets? \nSex work is a complete different line of work though. You’re risking alot more than a regular job. No job is worth your mental well being that goes for both janitors and sex workers. I don’t think sacrificing your dignity is a healthy message to send. If you have mental hang ups about sugaring, if you feel guilty about it, then you shouldn’t be doing it for the sake of your own well being",
            "author": null,
            "id": "flc2daq",
            "parent_id": "t1_flbshdu",
            "score": 3,
            "created_utc": 1585018179.0,
            "replies": []
        },
        {
            "body": "Except sugaring is not a job. It's a relationship. And you should not be in a relationship if you do not like the other person or want to be with them or enjoy doing the things a relationship entails.",
            "author": "Meowohmeow20",
            "id": "flbxjy5",
            "parent_id": "t1_flbshdu",
            "score": 2,
            "created_utc": 1585014939.0,
            "replies": [
                {
                    "body": "[removed]",
                    "author": null,
                    "id": "flc0rxt",
                    "parent_id": "t1_flbxjy5",
                    "score": 2,
                    "created_utc": 1585017100.0,
                    "replies": [
                        {
                            "body": "Sex work is not sugaring tho. It's like chess and checkers, same field but completely different rules. You cant apply your escorting rules to this sugar lifestyle sub. Sugar relationships shouldn't feel like work, plain and simple.",
                            "author": "Meowohmeow20",
                            "id": "flc43pz",
                            "parent_id": "t1_flc0rxt",
                            "score": -6,
                            "created_utc": 1585019396.0,
                            "replies": [
                                {
                                    "body": "[removed]",
                                    "author": null,
                                    "id": "flc4cc0",
                                    "parent_id": "t1_flc43pz",
                                    "score": 2,
                                    "created_utc": 1585019572.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "flgmskw",
            "parent_id": "t1_flep45e",
            "score": 1,
            "created_utc": 1585146142.0,
            "replies": [
                {
                    "body": "I’m not going to waste my time and try to convince you SOME SRs are sex work. Obviously you have an issue with sex work and accepting you participate in it to some degree. Not a me issue",
                    "author": "perryplats",
                    "id": "flgnlvi",
                    "parent_id": "t1_flgmskw",
                    "score": 0,
                    "created_utc": 1585146626.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "flgo8z0",
                            "parent_id": "t1_flgnlvi",
                            "score": 1,
                            "created_utc": 1585147005.0,
                            "replies": [
                                {
                                    "body": "SRs can be sex work. if you're exchanging cash and there's sexual favors involved at some point, then it's sex work. nothing to be embarrassed or ashamed about. we all know why we're in this.",
                                    "author": "fortyonematters",
                                    "id": "flhaklb",
                                    "parent_id": "t1_flgo8z0",
                                    "score": 2,
                                    "created_utc": 1585159112.0,
                                    "replies": []
                                },
                                {
                                    "body": "Okay honey dear",
                                    "author": "perryplats",
                                    "id": "flgooxh",
                                    "parent_id": "t1_flgo8z0",
                                    "score": 0,
                                    "created_utc": 1585147261.0,
                                    "replies": [
                                        {
                                            "body": "[deleted]",
                                            "author": null,
                                            "id": "flgpzx7",
                                            "parent_id": "t1_flgooxh",
                                            "score": 1,
                                            "created_utc": 1585148028.0,
                                            "replies": [
                                                {
                                                    "body": "I don’t agree 😘😘",
                                                    "author": "perryplats",
                                                    "id": "flgq4ge",
                                                    "parent_id": "t1_flgpzx7",
                                                    "score": 0,
                                                    "created_utc": 1585148101.0,
                                                    "replies": [
                                                        {
                                                            "body": "[deleted]",
                                                            "author": null,
                                                            "id": "flguk6b",
                                                            "parent_id": "t1_flgq4ge",
                                                            "score": 1,
                                                            "created_utc": 1585150590.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Well I don’t honey dear 😘😘😘",
                                                                    "author": "perryplats",
                                                                    "id": "flgumf5",
                                                                    "parent_id": "t1_flguk6b",
                                                                    "score": 0,
                                                                    "created_utc": 1585150624.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "[deleted]",
                                                                            "author": null,
                                                                            "id": "flguq58",
                                                                            "parent_id": "t1_flgumf5",
                                                                            "score": 1,
                                                                            "created_utc": 1585150681.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "I never said I agreed, but whatever makes you feel better and entertained in this quarantine 😘😘😘",
                                                                                    "author": "perryplats",
                                                                                    "id": "flgvzsl",
                                                                                    "parent_id": "t1_flguq58",
                                                                                    "score": 0,
                                                                                    "created_utc": 1585151379.0,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "> All relationships between a man and a women have an exchange of goods.\n\nnegative. you must be hanging out with a lot of gold diggers. a legitimate relationship should be independent of money and sex. something like that is obv hard to find but those relationships do exist and it should be something people should strive for. a sugar relationship is a structured relation where both parties can get what they want and can be very no strings attached\n\n>Whereas in vanilla relationships men tend to hold onto toxic women for fear of them not being easily replaced.\n\nthese types of men are beta chodes and need to improve themselves. they are causing their own suffering by holding onto toxic girls",
            "author": "fortyonematters",
            "id": "flhb3ia",
            "parent_id": "t1_flctihy",
            "score": 0,
            "created_utc": 1585159383.0,
            "replies": []
        },
        {
            "body": "Oh totally misunderstood what you were saying! No this is definitely a good time for that I agree. Shit girl wtf else we supposed to do🤣",
            "author": null,
            "id": "flbox79",
            "parent_id": "t1_flbo1ze",
            "score": 2,
            "created_utc": 1585009285.0,
            "replies": []
        },
        {
            "body": "teaching and brow-beating are two different things hun.\n\nmy only problem is you (or anyone) telling another person what to do in such a condescending way, especially when no one asked you to begin with.\n\nthis thread says way more about you than the SB's you're trying to gate keep",
            "author": "LizLemon_015",
            "id": "flcg8su",
            "parent_id": "t1_flccwmb",
            "score": 12,
            "created_utc": 1585029712.0,
            "replies": []
        },
        {
            "body": "But we shouldn't be gate keeping and god knows how many sugar daddies do that for their benefit being demanding and desperate it goes both ways.",
            "author": "lbseida",
            "id": "flf3zaq",
            "parent_id": "t1_flct16n",
            "score": 1,
            "created_utc": 1585097538.0,
            "replies": []
        },
        {
            "body": "[removed]",
            "author": null,
            "id": "flc0rxt",
            "parent_id": "t1_flbxjy5",
            "score": 2,
            "created_utc": 1585017100.0,
            "replies": [
                {
                    "body": "Sex work is not sugaring tho. It's like chess and checkers, same field but completely different rules. You cant apply your escorting rules to this sugar lifestyle sub. Sugar relationships shouldn't feel like work, plain and simple.",
                    "author": "Meowohmeow20",
                    "id": "flc43pz",
                    "parent_id": "t1_flc0rxt",
                    "score": -6,
                    "created_utc": 1585019396.0,
                    "replies": [
                        {
                            "body": "[removed]",
                            "author": null,
                            "id": "flc4cc0",
                            "parent_id": "t1_flc43pz",
                            "score": 2,
                            "created_utc": 1585019572.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I’m not going to waste my time and try to convince you SOME SRs are sex work. Obviously you have an issue with sex work and accepting you participate in it to some degree. Not a me issue",
            "author": "perryplats",
            "id": "flgnlvi",
            "parent_id": "t1_flgmskw",
            "score": 0,
            "created_utc": 1585146626.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "flgo8z0",
                    "parent_id": "t1_flgnlvi",
                    "score": 1,
                    "created_utc": 1585147005.0,
                    "replies": [
                        {
                            "body": "SRs can be sex work. if you're exchanging cash and there's sexual favors involved at some point, then it's sex work. nothing to be embarrassed or ashamed about. we all know why we're in this.",
                            "author": "fortyonematters",
                            "id": "flhaklb",
                            "parent_id": "t1_flgo8z0",
                            "score": 2,
                            "created_utc": 1585159112.0,
                            "replies": []
                        },
                        {
                            "body": "Okay honey dear",
                            "author": "perryplats",
                            "id": "flgooxh",
                            "parent_id": "t1_flgo8z0",
                            "score": 0,
                            "created_utc": 1585147261.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "flgpzx7",
                                    "parent_id": "t1_flgooxh",
                                    "score": 1,
                                    "created_utc": 1585148028.0,
                                    "replies": [
                                        {
                                            "body": "I don’t agree 😘😘",
                                            "author": "perryplats",
                                            "id": "flgq4ge",
                                            "parent_id": "t1_flgpzx7",
                                            "score": 0,
                                            "created_utc": 1585148101.0,
                                            "replies": [
                                                {
                                                    "body": "[deleted]",
                                                    "author": null,
                                                    "id": "flguk6b",
                                                    "parent_id": "t1_flgq4ge",
                                                    "score": 1,
                                                    "created_utc": 1585150590.0,
                                                    "replies": [
                                                        {
                                                            "body": "Well I don’t honey dear 😘😘😘",
                                                            "author": "perryplats",
                                                            "id": "flgumf5",
                                                            "parent_id": "t1_flguk6b",
                                                            "score": 0,
                                                            "created_utc": 1585150624.0,
                                                            "replies": [
                                                                {
                                                                    "body": "[deleted]",
                                                                    "author": null,
                                                                    "id": "flguq58",
                                                                    "parent_id": "t1_flgumf5",
                                                                    "score": 1,
                                                                    "created_utc": 1585150681.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "I never said I agreed, but whatever makes you feel better and entertained in this quarantine 😘😘😘",
                                                                            "author": "perryplats",
                                                                            "id": "flgvzsl",
                                                                            "parent_id": "t1_flguq58",
                                                                            "score": 0,
                                                                            "created_utc": 1585151379.0,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Sex work is not sugaring tho. It's like chess and checkers, same field but completely different rules. You cant apply your escorting rules to this sugar lifestyle sub. Sugar relationships shouldn't feel like work, plain and simple.",
            "author": "Meowohmeow20",
            "id": "flc43pz",
            "parent_id": "t1_flc0rxt",
            "score": -6,
            "created_utc": 1585019396.0,
            "replies": [
                {
                    "body": "[removed]",
                    "author": null,
                    "id": "flc4cc0",
                    "parent_id": "t1_flc43pz",
                    "score": 2,
                    "created_utc": 1585019572.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "flgo8z0",
            "parent_id": "t1_flgnlvi",
            "score": 1,
            "created_utc": 1585147005.0,
            "replies": [
                {
                    "body": "SRs can be sex work. if you're exchanging cash and there's sexual favors involved at some point, then it's sex work. nothing to be embarrassed or ashamed about. we all know why we're in this.",
                    "author": "fortyonematters",
                    "id": "flhaklb",
                    "parent_id": "t1_flgo8z0",
                    "score": 2,
                    "created_utc": 1585159112.0,
                    "replies": []
                },
                {
                    "body": "Okay honey dear",
                    "author": "perryplats",
                    "id": "flgooxh",
                    "parent_id": "t1_flgo8z0",
                    "score": 0,
                    "created_utc": 1585147261.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "flgpzx7",
                            "parent_id": "t1_flgooxh",
                            "score": 1,
                            "created_utc": 1585148028.0,
                            "replies": [
                                {
                                    "body": "I don’t agree 😘😘",
                                    "author": "perryplats",
                                    "id": "flgq4ge",
                                    "parent_id": "t1_flgpzx7",
                                    "score": 0,
                                    "created_utc": 1585148101.0,
                                    "replies": [
                                        {
                                            "body": "[deleted]",
                                            "author": null,
                                            "id": "flguk6b",
                                            "parent_id": "t1_flgq4ge",
                                            "score": 1,
                                            "created_utc": 1585150590.0,
                                            "replies": [
                                                {
                                                    "body": "Well I don’t honey dear 😘😘😘",
                                                    "author": "perryplats",
                                                    "id": "flgumf5",
                                                    "parent_id": "t1_flguk6b",
                                                    "score": 0,
                                                    "created_utc": 1585150624.0,
                                                    "replies": [
                                                        {
                                                            "body": "[deleted]",
                                                            "author": null,
                                                            "id": "flguq58",
                                                            "parent_id": "t1_flgumf5",
                                                            "score": 1,
                                                            "created_utc": 1585150681.0,
                                                            "replies": [
                                                                {
                                                                    "body": "I never said I agreed, but whatever makes you feel better and entertained in this quarantine 😘😘😘",
                                                                    "author": "perryplats",
                                                                    "id": "flgvzsl",
                                                                    "parent_id": "t1_flguq58",
                                                                    "score": 0,
                                                                    "created_utc": 1585151379.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "[removed]",
            "author": null,
            "id": "flc4cc0",
            "parent_id": "t1_flc43pz",
            "score": 2,
            "created_utc": 1585019572.0,
            "replies": []
        },
        {
            "body": "SRs can be sex work. if you're exchanging cash and there's sexual favors involved at some point, then it's sex work. nothing to be embarrassed or ashamed about. we all know why we're in this.",
            "author": "fortyonematters",
            "id": "flhaklb",
            "parent_id": "t1_flgo8z0",
            "score": 2,
            "created_utc": 1585159112.0,
            "replies": []
        },
        {
            "body": "Okay honey dear",
            "author": "perryplats",
            "id": "flgooxh",
            "parent_id": "t1_flgo8z0",
            "score": 0,
            "created_utc": 1585147261.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "flgpzx7",
                    "parent_id": "t1_flgooxh",
                    "score": 1,
                    "created_utc": 1585148028.0,
                    "replies": [
                        {
                            "body": "I don’t agree 😘😘",
                            "author": "perryplats",
                            "id": "flgq4ge",
                            "parent_id": "t1_flgpzx7",
                            "score": 0,
                            "created_utc": 1585148101.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "flguk6b",
                                    "parent_id": "t1_flgq4ge",
                                    "score": 1,
                                    "created_utc": 1585150590.0,
                                    "replies": [
                                        {
                                            "body": "Well I don’t honey dear 😘😘😘",
                                            "author": "perryplats",
                                            "id": "flgumf5",
                                            "parent_id": "t1_flguk6b",
                                            "score": 0,
                                            "created_utc": 1585150624.0,
                                            "replies": [
                                                {
                                                    "body": "[deleted]",
                                                    "author": null,
                                                    "id": "flguq58",
                                                    "parent_id": "t1_flgumf5",
                                                    "score": 1,
                                                    "created_utc": 1585150681.0,
                                                    "replies": [
                                                        {
                                                            "body": "I never said I agreed, but whatever makes you feel better and entertained in this quarantine 😘😘😘",
                                                            "author": "perryplats",
                                                            "id": "flgvzsl",
                                                            "parent_id": "t1_flguq58",
                                                            "score": 0,
                                                            "created_utc": 1585151379.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "flgpzx7",
            "parent_id": "t1_flgooxh",
            "score": 1,
            "created_utc": 1585148028.0,
            "replies": [
                {
                    "body": "I don’t agree 😘😘",
                    "author": "perryplats",
                    "id": "flgq4ge",
                    "parent_id": "t1_flgpzx7",
                    "score": 0,
                    "created_utc": 1585148101.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "flguk6b",
                            "parent_id": "t1_flgq4ge",
                            "score": 1,
                            "created_utc": 1585150590.0,
                            "replies": [
                                {
                                    "body": "Well I don’t honey dear 😘😘😘",
                                    "author": "perryplats",
                                    "id": "flgumf5",
                                    "parent_id": "t1_flguk6b",
                                    "score": 0,
                                    "created_utc": 1585150624.0,
                                    "replies": [
                                        {
                                            "body": "[deleted]",
                                            "author": null,
                                            "id": "flguq58",
                                            "parent_id": "t1_flgumf5",
                                            "score": 1,
                                            "created_utc": 1585150681.0,
                                            "replies": [
                                                {
                                                    "body": "I never said I agreed, but whatever makes you feel better and entertained in this quarantine 😘😘😘",
                                                    "author": "perryplats",
                                                    "id": "flgvzsl",
                                                    "parent_id": "t1_flguq58",
                                                    "score": 0,
                                                    "created_utc": 1585151379.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I don’t agree 😘😘",
            "author": "perryplats",
            "id": "flgq4ge",
            "parent_id": "t1_flgpzx7",
            "score": 0,
            "created_utc": 1585148101.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "flguk6b",
                    "parent_id": "t1_flgq4ge",
                    "score": 1,
                    "created_utc": 1585150590.0,
                    "replies": [
                        {
                            "body": "Well I don’t honey dear 😘😘😘",
                            "author": "perryplats",
                            "id": "flgumf5",
                            "parent_id": "t1_flguk6b",
                            "score": 0,
                            "created_utc": 1585150624.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "flguq58",
                                    "parent_id": "t1_flgumf5",
                                    "score": 1,
                                    "created_utc": 1585150681.0,
                                    "replies": [
                                        {
                                            "body": "I never said I agreed, but whatever makes you feel better and entertained in this quarantine 😘😘😘",
                                            "author": "perryplats",
                                            "id": "flgvzsl",
                                            "parent_id": "t1_flguq58",
                                            "score": 0,
                                            "created_utc": 1585151379.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "flguk6b",
            "parent_id": "t1_flgq4ge",
            "score": 1,
            "created_utc": 1585150590.0,
            "replies": [
                {
                    "body": "Well I don’t honey dear 😘😘😘",
                    "author": "perryplats",
                    "id": "flgumf5",
                    "parent_id": "t1_flguk6b",
                    "score": 0,
                    "created_utc": 1585150624.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "flguq58",
                            "parent_id": "t1_flgumf5",
                            "score": 1,
                            "created_utc": 1585150681.0,
                            "replies": [
                                {
                                    "body": "I never said I agreed, but whatever makes you feel better and entertained in this quarantine 😘😘😘",
                                    "author": "perryplats",
                                    "id": "flgvzsl",
                                    "parent_id": "t1_flguq58",
                                    "score": 0,
                                    "created_utc": 1585151379.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Well I don’t honey dear 😘😘😘",
            "author": "perryplats",
            "id": "flgumf5",
            "parent_id": "t1_flguk6b",
            "score": 0,
            "created_utc": 1585150624.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "flguq58",
                    "parent_id": "t1_flgumf5",
                    "score": 1,
                    "created_utc": 1585150681.0,
                    "replies": [
                        {
                            "body": "I never said I agreed, but whatever makes you feel better and entertained in this quarantine 😘😘😘",
                            "author": "perryplats",
                            "id": "flgvzsl",
                            "parent_id": "t1_flguq58",
                            "score": 0,
                            "created_utc": 1585151379.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "flguq58",
            "parent_id": "t1_flgumf5",
            "score": 1,
            "created_utc": 1585150681.0,
            "replies": [
                {
                    "body": "I never said I agreed, but whatever makes you feel better and entertained in this quarantine 😘😘😘",
                    "author": "perryplats",
                    "id": "flgvzsl",
                    "parent_id": "t1_flguq58",
                    "score": 0,
                    "created_utc": 1585151379.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I never said I agreed, but whatever makes you feel better and entertained in this quarantine 😘😘😘",
            "author": "perryplats",
            "id": "flgvzsl",
            "parent_id": "t1_flguq58",
            "score": 0,
            "created_utc": 1585151379.0,
            "replies": []
        }
    ]
}