{
    "title": "Wanted ppm but didn't want intimacy because she'd feel like a prostitute",
    "post_id": "10viepd",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/10viepd/wanted_ppm_but_didnt_want_intimacy_because_shed/",
    "author": "Worldly-wanderer",
    "body": "Date 1 last week, platonic meet and greet unpaid coffee. Talked for about 2 hours, great connection. Agreed on second date the following week, dinner and intimacy afterward. Talked specifically about having sex, condoms would be necessary, ppm amount, and that I'd send her test results I had just received a few days prior. \n\nDate 2, Wednesday, she was 45 mins late to dinner but gave me a heads up that she was running behind about 6 mins prior to date time. I was at the restaurant to grab us a table already, so, living nearby, I headed home in the meantime. Dinner convo wasn't terrible, but she was on her phone blatantly about 8 or 10 times over the course of the hour and 15 or so. \n\nWhen dinner was done I suggested we move on back to my place. She asked my address, which I gave her, then said she was texting it to her friend, but wouldn't be able to drive there as she had had her roomie drop her off. She would need to ride with me. \n\nMe, \"Ummm ok.. are you going to need a ride home? I don't really want your roomie coming to my house..\"\n\nHer, \"Yes please.\"\n\nSo we head to my place pleasantly chatting. Conversation continues until she drops in.\n\nHer, \"umm were you thinking we were going to have sex today? I was hoping we could cuddle on the couch and you could give me my allowance for the week. I want to work up to this having-sex thing.\" \n\nMe, \"Oh, I thought we had agreed we would start the arrangement this evening.\"\n\nHer, \"Yes, we have started the arrangement. I just don't want to have sex right away. It would make me feel like a prostitute.\"\n\nMe, \"I see, ok, well I'm happy to not have sex. I mean we can have as many platonic dates as you'd like in order to get to know each other and feel more comfortable.\"\n\nHer, \"Yeah maybe we can just cuddle on the couch or something and talk a bit before you give me my allowance and you take me home? I mean we havent even kissed yet, I'm definitely not going to just have sex with you\"\n\nMe, \"Uhh, no, I'm not going to pay an allowance for platonic dates.. initial platonic dates says to me that we haven't started the arrangement yet and so there wouldn't be an allowance.\"\n\nHer, \"It sounds like you are only valuing me for my body not my time.\"\n\nThings are getting more uncomfortable now, body language-wise.\n\nI objected, \"What happens if we get weeks or months into this and you don't ever feel like you want to have sex?\"\n\nHer, \"Well thats just the way it goes. If you are really sugaring then you are paying for my time, not my body. You just want a prostitute otherwise.\"\n\nMe, \"So if I'm getting this right, unless I pay you money and you decide what you feel comfortable doing or not doing, you aren't interested in an arrangement?\"\n\nHer, \"Yes, that's how sugar works.\"\n\nMe, \"I've been in the scene for a while, and that's not how this works. I'm not looking to be taken for a ride. Any time I've given money in the past, the girls have simply ghosted next, and while I don't think you'd do that... we seem to have a good connection... this isn't how this generally works. Puts the SDs in too vulnerable a position.\"\n\nHer, \"Well, have fun finding a prostitute then.\"\n\nI think she had forgotten that she hadn't driven. \n\nMe, \"Well, I don't want to do that. So, do you need me to drop you off somewhere?\"\n\nHer, \"Yeah, I don't want you knowing where I live, so just take me back to the restaurant and I'll have my roommate pick me up.\"\n\nLet me tell you, ladies and gentlemen. It was a frosty ride.",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/10viepd/wanted_ppm_but_didnt_want_intimacy_because_shed/",
    "score": 104,
    "upvote_ratio": 0.85,
    "created_utc": 1675718103.0,
    "num_comments": 182,
    "links": [
        []
    ],
    "comments": [
        {
            "body": ">she was on her phone blatantly about 8 or 10 times over the course of the hour and 15 or so.\n\nI would have nexted her right there.",
            "author": "EuropeanDaddyDom",
            "id": "j7hqj67",
            "parent_id": "t3_10viepd",
            "score": 105,
            "created_utc": 1675720226.0,
            "replies": [
                {
                    "body": "Likely she was aaking advice from her friend about how to play him. \"He hasnt paid me yet, what do I say?\"",
                    "author": "Upper-District-50",
                    "id": "j7ht7oc",
                    "parent_id": "t1_j7hqj67",
                    "score": 47,
                    "created_utc": 1675721256.0,
                    "replies": [
                        {
                            "body": "Yup. He was not acting just like the tiktok girls said he would !!",
                            "author": "southernslick",
                            "id": "j7i66ga",
                            "parent_id": "t1_j7ht7oc",
                            "score": 44,
                            "created_utc": 1675726483.0,
                            "replies": [
                                {
                                    "body": "This, rofl!",
                                    "author": "SDInLeather",
                                    "id": "j7k734n",
                                    "parent_id": "t1_j7i66ga",
                                    "score": 0,
                                    "created_utc": 1675770345.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": ">I would have nexted her right there.\n\nI think that's reasonable, if you think the objective is to have a relationship with the person then they should be interesting and interested. \n\nOP seemed undeterred in his willingness to give her money and have sex with her tho. I don't think this paints him in the favorable light that he thinks it does.",
                    "author": "NoLimitLexa",
                    "id": "j7hvp1n",
                    "parent_id": "t1_j7hqj67",
                    "score": 26,
                    "created_utc": 1675722239.0,
                    "replies": [
                        {
                            "body": "That's true! Inviting her back after that??",
                            "author": "Azurecole",
                            "id": "j7hzswm",
                            "parent_id": "t1_j7hvp1n",
                            "score": 7,
                            "created_utc": 1675723875.0,
                            "replies": [
                                {
                                    "body": "In a small market with very few options, one has to deal with some amount of bad behavior, it seems, to even get out the gate. \n\nI'd love to be in a bigger market where I could next after borderline rude behavior, but that'd run me out of any POTs pretty quick.",
                                    "author": "Worldly-wanderer",
                                    "id": "j7ibfit",
                                    "parent_id": "t1_j7hzswm",
                                    "score": 9,
                                    "created_utc": 1675728723.0,
                                    "replies": [
                                        {
                                            "body": "[deleted]",
                                            "author": null,
                                            "id": "j7izb8h",
                                            "parent_id": "t1_j7ibfit",
                                            "score": 10,
                                            "created_utc": 1675739671.0,
                                            "replies": [
                                                {
                                                    "body": "I disagree, I think coffee is plenty for an initial meet n greet to see if yall vibe. If I were an SD, I wouldn't want to be paying a bunch of money for a nice dinner or whatever to then find out they suck like this girl does^^^^ I honestly hate the perspective that some women have on the site that they just get to get paid to go out to dinner/spend time whatever. Like no, the rest of us have had to put in work to make that money this is no easy life honey. I think the sugar life is glorified in media nowadays (thinking specifically female rappers). When people don't actually know what it takes. I wonder how young the girl was that OP went on a date with. If I had to guess she would be 18-20 w no experience on the site.",
                                                    "author": "Elephantananda222",
                                                    "id": "j7j8hj7",
                                                    "parent_id": "t1_j7izb8h",
                                                    "score": 5,
                                                    "created_utc": 1675744246.0,
                                                    "replies": [
                                                        {
                                                            "body": "This is the type of response I admire! Most just think it’s one sided and take advantage. It should be beneficial for both sides. I unfortunately, am romantic type so it gets to the point I’m not sure if person likes me or my money.",
                                                            "author": "dynolas1",
                                                            "id": "j7ks4n3",
                                                            "parent_id": "t1_j7j8hj7",
                                                            "score": -4,
                                                            "created_utc": 1675781619.0,
                                                            "replies": []
                                                        },
                                                        {
                                                            "body": "Quality response here. Certainly agree that his prospective SB was seeking to be on his payroll for little to no effort of establishing connection on her part even going back on their word to entertain intimacy on the next date.",
                                                            "author": "Outrageous_Bat8429",
                                                            "id": "j7l9t3c",
                                                            "parent_id": "t1_j7j8hj7",
                                                            "score": 1,
                                                            "created_utc": 1675788786.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "body": "Might depend on how you fish. I exclusively M&G at coffee. I pride myself at being a decent and humorous conversationalist, a lot of the SB's are like \"is that so soon?\" when I remind them it has been 30 minutes, which is all I ask of their time, though frequently we have gone well over that. If those are bottom feeders, bring on more catfish, says I, because they have been wonders.",
                                                    "author": "SDInLeather",
                                                    "id": "j7k7h69",
                                                    "parent_id": "t1_j7izb8h",
                                                    "score": -3,
                                                    "created_utc": 1675770619.0,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "body": "I get that.  I've put up with things that I normally wouldn't if everything else is a green light, and I'm not even in a small market.  But I do take signs of distraction seriously, more difficult to overlook than, say, being late",
                                            "author": "Azurecole",
                                            "id": "j7ibvf9",
                                            "parent_id": "t1_j7ibfit",
                                            "score": 5,
                                            "created_utc": 1675728917.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "Scarcity thinking versus abundance thinking will keep you trapped.",
                                            "author": "Dwight_Manfredi775",
                                            "id": "j9y3m8x",
                                            "parent_id": "t1_j7ibfit",
                                            "score": 1,
                                            "created_utc": 1677326871.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "I think he was pretty reasonable",
                            "author": "throwawayrtyggv",
                            "id": "j7ijc81",
                            "parent_id": "t1_j7hvp1n",
                            "score": 4,
                            "created_utc": 1675732239.0,
                            "replies": []
                        },
                        {
                            "body": "I think he handled it well.  He didn't pull the plug prematurely and he didn't let himself get taken advantage of.",
                            "author": "throwaway48453",
                            "id": "j7jedyq",
                            "parent_id": "t1_j7hvp1n",
                            "score": 1,
                            "created_utc": 1675747642.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Absolutely. There is no opportunity for a second chance. Looking at your phone when you are out with someone, first time or not, is extremely disrespectful. This applies to both SB's and SD's.",
                    "author": "dieselandasphalt",
                    "id": "j7ialhj",
                    "parent_id": "t1_j7hqj67",
                    "score": 2,
                    "created_utc": 1675728366.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "My previous SB was a similar situation but with a much nicer ending.\n\nOur first meeting was in public (it was the start of the pandemic, we just went hiking). Unpaid.\n\nOn our second meeting we went out for dinner and then to her place. I gave her the PPM as soon as we got there. We fooled around some but it became clear she'd rather not have sex. I did not push the issue or confront it. I think she was looking to see that her wishes and boundaries were respected.\n\nOn our third date and all subsequent ones sex was part of our date.",
            "author": "geeky-sd",
            "id": "j7i122h",
            "parent_id": "t3_10viepd",
            "score": 36,
            "created_utc": 1675724375.0,
            "replies": []
        },
        {
            "body": "Honestly, I can see both parties argument. \n\nMen don’t want to get strung along and scammed, but women also fear you’ll only treat us right so you can get the cookie. Lots of women fear being pump and dumped for a measly few hundred. Not saying that was your intention. Seems like you were willing to get to know her without the intimacy, and johns won’t do that. \n\nI’ve had pots give me small $2xx-3xx or take me shopping while still in the talking-phase, and I never ghosted or ran off. It’s really about both parties approach and willingness to compromise. It’s an investment that takes 2 to tango, and sometimes 1 person takes a loss. Each pot who spoiled beforehand, offered it on their own. If she asks or expects it, she’s probably a scammer.",
            "author": "noneya3333",
            "id": "j7hy2e3",
            "parent_id": "t3_10viepd",
            "score": 62,
            "created_utc": 1675723177.0,
            "replies": [
                {
                    "body": "You didn’t ghost and run off with the money… because you’re an SB.  The issue is that there are many women who would run off with the money for every SB.",
                    "author": "DarthDaddius",
                    "id": "j827wrx",
                    "parent_id": "t1_j7hy2e3",
                    "score": 2,
                    "created_utc": 1676081139.0,
                    "replies": []
                },
                {
                    "body": "What would be your reply if we reverse the genders while keeping the same scenario? SD wants to have sex but will spoil/will provide financial assistance when he feels comfortable otherwise he thinks he is being treated like an ATM?",
                    "author": null,
                    "id": "j7ntaz5",
                    "parent_id": "t1_j7hy2e3",
                    "score": 2,
                    "created_utc": 1675826200.0,
                    "replies": [
                        {
                            "body": "I’m curious if you read my follow up comment. I practically addressed that already. There’s plenty of men on sugar sites who already try that. They claim they “don’t want it to feel transactional”. People are free to do whichever they feel comfortable with first, but both people risk being scammed. Anytime you invest in anything.. could be a new career, friendships, relationships, stocks, etc.",
                            "author": "noneya3333",
                            "id": "j7nu5yz",
                            "parent_id": "t1_j7ntaz5",
                            "score": 3,
                            "created_utc": 1675826599.0,
                            "replies": [
                                {
                                    "body": "I would say you are wrong saying SBs are more vulnerable, but it doesn't negate the fact that SDs can also be extorted/blackmailed because they have much to lose.\nJust few examples\n\nhttps://abcnews.go.com/Business/AheadoftheCurve/story?id=7578033&amp;page=1\n\nhttps://www.charlotteobserver.com/news/local/crime/article235521757.html\n\nhttps://www.dailymail.co.uk/news/article-8594687/amp/Sugar-baby-threatens-tell-fathers-family-raunchy-relationship-unless-pays-5-000.html&ved=2ahUKEwjB0dr6hoX9AhWETGwGHWJzBpgQFnoECCoQAQ&usg=AOvVaw086GrEOOqQct8c1SJLbgF3\n\nJust because the men who were extorted/blackmailed doesn't come crying to this sub reddit doesn't imply that extortion/blackmailing doesn't exist. There is danger to both sides of the bowl regardless of where you stand. Its upto you how you vet the other person, whom you are gonna engage with.\n\nSugar relationships are always to be mutually beneficial to both the parties equally, the established member fulfills the financial implications of the relationship while the attractive member provides company which includes intimacy.\n\nSpeaking for OPs case, the girl was straight up rinser because she wants only her benefit. OP was right because he gave her the chance to go on enough platonic dates before arrangement commence but she expects ppm without any intimacy.",
                                    "author": null,
                                    "id": "j7o2cle",
                                    "parent_id": "t1_j7nu5yz",
                                    "score": -1,
                                    "created_utc": 1675830650.0,
                                    "replies": [
                                        {
                                            "body": "Please quote where I said “SBs are more vulnerable”. I didn’t bother reading or clicking the links because I never made that statement in the first place. I’m sure the link is useful, but not relevant right now. (I’m fully aware blackmail exists, but that’s almost a separate topic from the original post.) We’re discussing both parties fear of being strung along, or stiffed. I stated in more ways than one, that arrangements take compromise and potential loss from *both* parties. I’m not understanding what part you’re trying to rebut or disagree with? I also agree with you, & stated in my original comment that the girl in OP’s post (and any girl that expects, asks, or demands prematurely) is probably a scammer.",
                                            "author": "noneya3333",
                                            "id": "j7o3p2o",
                                            "parent_id": "t1_j7o2cle",
                                            "score": 3,
                                            "created_utc": 1675831375.0,
                                            "replies": [
                                                {
                                                    "body": "You never said that but it was implied (supposedly) by your first statement \"There are countless.....\". Since you have said that you statement never meant to show how vulnerable SBs are so I think we are good now (hopefully).\nLooks like we are almost probably on the same page just with different voices.",
                                                    "author": null,
                                                    "id": "j7o6noi",
                                                    "parent_id": "t1_j7o3p2o",
                                                    "score": 0,
                                                    "created_utc": 1675832947.0,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "body": "It looks like you shared some AMP links. These should load faster, but AMP is controversial because of [concerns over privacy and the Open Web](https://www.reddit.com/r/AmputatorBot/comments/ehrq3z/why_did_i_build_amputatorbot).\n\nMaybe check out **the canonical pages** instead: \n\n- **[https://abcnews.go.com/Business/AheadoftheCurve/story?id=7578033&page=1](https://abcnews.go.com/Business/AheadoftheCurve/story?id=7578033&page=1)**\n\n- **[https://www.dailymail.co.uk/news/article-8594687/Sugar-baby-threatens-tell-fathers-family-raunchy-relationship-unless-pays-5-000.html](https://www.dailymail.co.uk/news/article-8594687/Sugar-baby-threatens-tell-fathers-family-raunchy-relationship-unless-pays-5-000.html)**\n\n*****\n\n ^(I'm a bot | )[^(Why & About)](https://www.reddit.com/r/AmputatorBot/comments/ehrq3z/why_did_i_build_amputatorbot)^( | )[^(Summon: u/AmputatorBot)](https://www.reddit.com/r/AmputatorBot/comments/cchly3/you_can_now_summon_amputatorbot/)",
                                            "author": "AmputatorBot",
                                            "id": "j7o2dkr",
                                            "parent_id": "t1_j7o2cle",
                                            "score": 1,
                                            "created_utc": 1675830665.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "j7l1ntt",
                    "parent_id": "t1_j7hy2e3",
                    "score": 2,
                    "created_utc": 1675785565.0,
                    "replies": [
                        {
                            "body": "I disagree. You should read the countless posts on this forum full of women taking a loss by getting scammed, or pump and dumped. The 2 craziest posts I remember from a few months back 1) SB met up with a pot, he persuaded her to get into his car, then he robbed her at knifepoint. 2) SB was missing all her own cash AND the ppm after she got intimate in a hotel with her pot. She briefly left her purse unattended to use the bathroom before going home. She didn’t realize he robbed her until she was halfway home and had to stop for gas. \n\nMen are not the only ones have to invest, or take losses. Lots of other women get shorted on the agreed amount, or get absolutely nothing after trusting their SD and giving him sex first.",
                            "author": "noneya3333",
                            "id": "j7l5j8j",
                            "parent_id": "t1_j7l1ntt",
                            "score": 16,
                            "created_utc": 1675787110.0,
                            "replies": [
                                {
                                    "body": "All of these are things that could 99% of the time be avoided by being smart about what you’re doing. I haven’t heard of any stories of SBs getting out at knifepoint when they’re already in the the hotel room. Meet somewhere public, vet accordingly, if you aren’t comfortable go on public dates with no intimacy until you are, don’t get in a car alone and don’t go anywhere alone.\n\nThis is common sense. Just use common sense and the risk is incredibly low.",
                                    "author": "atxsuda",
                                    "id": "j7pg9zx",
                                    "parent_id": "t1_j7l5j8j",
                                    "score": 1,
                                    "created_utc": 1675865074.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "The difference between prostitution and a sugar relationship isn't that only the prostitute has sex, it's that in a sugar relationship there is, well, a relationship. \n\nShe is 45 minutes late and spends the entire date on her phone. That's not a relationship.",
            "author": "NinCarolina",
            "id": "j7i58zr",
            "parent_id": "t3_10viepd",
            "score": 20,
            "created_utc": 1675726094.0,
            "replies": [
                {
                    "body": "And she’s not a sugar baby, she’s either a scammer or a sex worker that doesn’t wanna have sex because basically she was treating it like a job",
                    "author": "NickPfromYuma",
                    "id": "j7ig0x3",
                    "parent_id": "t1_j7i58zr",
                    "score": 0,
                    "created_utc": 1675730741.0,
                    "replies": [
                        {
                            "body": "This comment regarding sex workers is confusing to me. Wouldn't a sex worker be just fine having sex if her SD/client pays an agreed upon PPM? \n\nBlaming a SB-wannabe who will not have sex for being a sex worker is the equivalent of high schoolers who call the girl who will not sleep with them a whore.",
                            "author": "geeky-sd",
                            "id": "j7k8aqd",
                            "parent_id": "t1_j7ig0x3",
                            "score": 8,
                            "created_utc": 1675771184.0,
                            "replies": [
                                {
                                    "body": "These are clearly the same guys who would cat-call a woman and when she doesn’t respond favorably they neg her 🤡",
                                    "author": "SparklingScorpio",
                                    "id": "j7m9kxe",
                                    "parent_id": "t1_j7k8aqd",
                                    "score": 5,
                                    "created_utc": 1675802609.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I didn't read all the comments, but enough.\n\n**She sounds flaky.  Period.**  The phone, the PPM, the friend, etc.  She is either a **complete newbie or a con artist/escort/whatever**.  If you feel she is a newbie, you can maybe cut her some slack.  But, I'd dam sure tell my **SB (who is on the \"payroll\") to put the** ***FUCKING PHONE DOWN!***\n\nIf she is nervous, flaky, etc.  Then say:  \"OK babe, **when you are ready for real sugar relationship, get back to me**.\"  And **NO MONEY,** except if you are kind and throw her a few $ with promise of more once she decides to **get serious about this**.\n\n**No one likes to talk about pay for play** in this game we play because it sounds so transactional, thus John/Hooker like.  But God dam it!, **almost all the sugar relationship issues, especially early on, revolve around $.**  Pump and Dump. Rinsing,  Robbery (both directions), etc. etc.\n\nPlease tell her this, and assure her this is for you BOTH mutual protection.  Follow the guidelines until trust is established.  Yes, the **first time (or two) will be like pay for play** since its a PPM world.  **Get over it or get out of the game!**",
            "author": "Inside_Office388",
            "id": "j7mpdeb",
            "parent_id": "t3_10viepd",
            "score": 3,
            "created_utc": 1675808704.0,
            "replies": []
        },
        {
            "body": ">If you are really sugaring then you are paying for my time,\n\nIronically, charging for time is exactly how escorting works.  If this is her model of sugar, then she's the one bringing that in... of course, none of these arguments (as per recent threads) is really about building a relationship oriented and mutually beneficial view of sugar relationships, it's about getting paid using any rhetorical argument necessary.  \"You're treating her like an escort\" and \"you should be able to afford it so you shouldn't care\" incoming.\n\nImagine when this is reversed.  SD says \"we are in a relationship so we have sex tonight... but I don't want to feel like I john so I'll start supporting you down the line at a time I decide, and it may never happen\".  Most of us would scream \"scammer!\" and we'd be right.  But even if we weren't right, what he's proposing isn't a sugar relationship, it's having sex and spending time with a hot girl.   Sugar relationships are relationships, but sex and allowance are understood.\n\nSo why, when an SB says exactly the same thing, \"we are in a relationship so you pay me every date, and we may or may not have sex down the line\", is it not EXACTLY THE SAME as the previous case?  Answer: it is exactly the same, and she's the equivalent of our hypothetical scammer/manipulator  in the previous paragraph, and he's almost as likely to be rinsed, as our previous SB was likely to get scammed..\n\nWhich is not to say that some more platonic dates where he spoils and pursues her aren't warranted, until such time as she's comfortable being in an SR, at which point, it's an SR, start giving allowance.",
            "author": "WynnDuppy",
            "id": "j7hqq6s",
            "parent_id": "t3_10viepd",
            "score": 17,
            "created_utc": 1675720301.0,
            "replies": [
                {
                    "body": "Even more ironically she wasn't giving him any time, by being late and on her phone the entire time.",
                    "author": "NinCarolina",
                    "id": "j7i5yv8",
                    "parent_id": "t1_j7hqq6s",
                    "score": 8,
                    "created_utc": 1675726393.0,
                    "replies": []
                },
                {
                    "body": "Well said.",
                    "author": "SDInLeather",
                    "id": "j7k7r56",
                    "parent_id": "t1_j7hqq6s",
                    "score": -1,
                    "created_utc": 1675770809.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I’m glad you stood your ground my friend. Sounds like she thinks she knows what sugar is about, when in fact she has no clue.\n\n“Paying for her time” doesn’t sound like prostitution as well? 🤣🤣🤣😂😂🤣",
            "author": "UnearthlyDinosaur",
            "id": "j7htx2e",
            "parent_id": "t3_10viepd",
            "score": 18,
            "created_utc": 1675721535.0,
            "replies": [
                {
                    "body": "You are paying for the escorts time too technically too and per hour. The sex happens cuz they want to keep you coming back for more since others will offer something more with their time as well. \nYou just aren't a simp. An easy target.  Yeah so you didn't want to pay for platonic to infinity, if you said yes the bext date would be the same too.",
                    "author": "Federal_Garage_4307",
                    "id": "j7imqzs",
                    "parent_id": "t1_j7htx2e",
                    "score": 4,
                    "created_utc": 1675733863.0,
                    "replies": [
                        {
                            "body": "I know. What’s that Charlie sheen quote again?",
                            "author": "UnearthlyDinosaur",
                            "id": "j7imy96",
                            "parent_id": "t1_j7imqzs",
                            "score": 0,
                            "created_utc": 1675733958.0,
                            "replies": [
                                {
                                    "body": "He has had so many words of drug fueled wisdom",
                                    "author": "Federal_Garage_4307",
                                    "id": "j7invli",
                                    "parent_id": "t1_j7imy96",
                                    "score": 1,
                                    "created_utc": 1675734400.0,
                                    "replies": []
                                },
                                {
                                    "body": "didn't originate with him, but he is the most recent famous user of it:\n\n\"I don't pay women for sex. I pay women to go away after sex.\"",
                                    "author": "joc13",
                                    "id": "j7j37nz",
                                    "parent_id": "t1_j7imy96",
                                    "score": 1,
                                    "created_utc": 1675741527.0,
                                    "replies": [
                                        {
                                            "body": "👍👍😁😁",
                                            "author": "UnearthlyDinosaur",
                                            "id": "j7j91lg",
                                            "parent_id": "t1_j7j37nz",
                                            "score": -2,
                                            "created_utc": 1675744550.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "SMH-with a new SB I always verbalize that our arrangement begins when the clothes come off. Your date sounds like an utter moron.",
            "author": "GSSD",
            "id": "j7lncej",
            "parent_id": "t3_10viepd",
            "score": 3,
            "created_utc": 1675794024.0,
            "replies": []
        },
        {
            "body": "You are a better man than me, I would have not entertained the conversation that long and asked her to get the Uber for herself. I am sure she went on the other forum and complained about how you were a John.",
            "author": "xyz553",
            "id": "j7hm1td",
            "parent_id": "t3_10viepd",
            "score": 23,
            "created_utc": 1675718534.0,
            "replies": [
                {
                    "body": "Having sex doesn’t make her a prostitute. People have sex all the time without feeling like a prostitute. \n\nActually, the financial part of this makes her feels like a prostitute. Wouldn’t it be a better idea to say no to the money instead 🤷‍♂️",
                    "author": "geekxp",
                    "id": "j7iwczu",
                    "parent_id": "t1_j7hm1td",
                    "score": 1,
                    "created_utc": 1675738306.0,
                    "replies": [
                        {
                            "body": "True But sex with old men or men in general isn’t fulfilling for women without anything to gain 😂",
                            "author": "Nefarious_evee",
                            "id": "j7k0u0a",
                            "parent_id": "t1_j7iwczu",
                            "score": 2,
                            "created_utc": 1675765341.0,
                            "replies": []
                        },
                        {
                            "body": ">Wouldn’t it be a better idea to say NO to the money instead 🤷‍♂️\n\nfixed that for you",
                            "author": "joc13",
                            "id": "j7j1iv4",
                            "parent_id": "t1_j7iwczu",
                            "score": -2,
                            "created_utc": 1675740704.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Well, he doesn’t come off like a SD, that’s for sure. He’s pretty borderline.",
                    "author": "Weary-Friendship-164",
                    "id": "j7i3if3",
                    "parent_id": "t1_j7hm1td",
                    "score": -10,
                    "created_utc": 1675725381.0,
                    "replies": [
                        {
                            "body": "From everything he explained so far,  he sounds like a perfectly wonderful SD.\n\nAs many platonic dates/dinners as I need to feel comfortable? That's quite lovely and MORE than fair.\n\nPeople need to stop treating the SBs like weak little flowers that have to be protected. We just want to be treated fairly and with respect. OP was doing that and more.",
                            "author": "gamergainzgal",
                            "id": "j7jbem6",
                            "parent_id": "t1_j7i3if3",
                            "score": 8,
                            "created_utc": 1675745865.0,
                            "replies": []
                        },
                        {
                            "body": "Cause he doesn’t pay for platonic dates? Yeah ok bud",
                            "author": "UnearthlyDinosaur",
                            "id": "j7ib70i",
                            "parent_id": "t1_j7i3if3",
                            "score": 7,
                            "created_utc": 1675728620.0,
                            "replies": []
                        },
                        {
                            "body": "What makes you say that?",
                            "author": "xyz553",
                            "id": "j7i44r8",
                            "parent_id": "t1_j7i3if3",
                            "score": 2,
                            "created_utc": 1675725634.0,
                            "replies": []
                        },
                        {
                            "body": "Oh bullshit? Why?",
                            "author": "throwawayrtyggv",
                            "id": "j7ik0h7",
                            "parent_id": "t1_j7i3if3",
                            "score": 0,
                            "created_utc": 1675732554.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "This is ridiculous. I’m glad you shut it down but you sure did take your sweet time to get there. She’s a rinser, and not even a good one.",
            "author": "MsGinathaheaux",
            "id": "j7i3udw",
            "parent_id": "t3_10viepd",
            "score": 13,
            "created_utc": 1675725518.0,
            "replies": [
                {
                    "body": "I’m honestly shocked the rinser went as far as going back to his plavr",
                    "author": "throwawayrtyggv",
                    "id": "j7ijymt",
                    "parent_id": "t1_j7i3udw",
                    "score": 2,
                    "created_utc": 1675732530.0,
                    "replies": [
                        {
                            "body": "Yeah, she didn’t seem to know what she was doing. She had a rough idea, but the execution sucked out loud.",
                            "author": "MsGinathaheaux",
                            "id": "j7irlk0",
                            "parent_id": "t1_j7ijymt",
                            "score": 3,
                            "created_utc": 1675736126.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "> Her, \"Well thats just the way it goes. If you are really sugaring then you are paying for my time, not my body. You just want a prostitute otherwise.\"\n\nThat's really some ass backwards bizarre logic.\n\nThat's not mutually beneficial. If I say that I am happy to have more dates with you without sex, that means I'm willing to invest time in the relationship for you to feel comfortable, which means I'm not in this only for sex and I'm not treating you like a prostitute.\n\nIf you are saying that you NOT willing to go on more dates with me without being paid, that means YOU are treating our interaction like prostitution!",
            "author": "whatever-tata",
            "id": "j7hpwf8",
            "parent_id": "t3_10viepd",
            "score": 13,
            "created_utc": 1675719987.0,
            "replies": [
                {
                    "body": ">That's not mutually beneficial.\n\nbut her presence in near proximity to you is valuable 🤦\n\nher conversation skills are so riveting and entertaining they are obviously worth as much as a good Broadway ticket or a good seat at a ballgame 🤦🤦\n\n>If you are saying that you NOT willing to go on more dates with me without being paid, that means YOU are treating our interaction like prostitution!\n\nyep, cause as someone that used to build websites for independent escorts, I can tell you the sentences \"Any payment provided is solely for my time. Anything else that happens is simply a choice between two *consenting* adults.\" (or similar) were always prominently included on them.\n\nedit: added an important word I left out",
                    "author": "joc13",
                    "id": "j7j2lve",
                    "parent_id": "t1_j7hpwf8",
                    "score": 4,
                    "created_utc": 1675741225.0,
                    "replies": [
                        {
                            "body": "That's funny you used to do that lmaooo",
                            "author": "Elephantananda222",
                            "id": "j7j96r3",
                            "parent_id": "t1_j7j2lve",
                            "score": 0,
                            "created_utc": 1675744627.0,
                            "replies": []
                        },
                        {
                            "body": "Between two consenting adults…",
                            "author": "This_Relation2262",
                            "id": "j7jfbgu",
                            "parent_id": "t1_j7j2lve",
                            "score": 0,
                            "created_utc": 1675748226.0,
                            "replies": [
                                {
                                    "body": "LOL. I knew I should have just copy/pasted off an old web site. fixed it.\n\nthanks",
                                    "author": "joc13",
                                    "id": "j7k4pdp",
                                    "parent_id": "t1_j7jfbgu",
                                    "score": 2,
                                    "created_utc": 1675768581.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Yup. Exactly. Very good point.",
                    "author": "Worldly-wanderer",
                    "id": "j7hq92o",
                    "parent_id": "t1_j7hpwf8",
                    "score": 2,
                    "created_utc": 1675720119.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Ive had gf act like that. Saying only want sex.\n\nFalse, I want everything, mind, body, connection, respect. The whole thing. You wouldn't buy a car without an engine.  Sex and everything else is essential to a good relationship.\n\nShe was speechless.",
            "author": "NotARussianBot1984",
            "id": "j7hoi3s",
            "parent_id": "t3_10viepd",
            "score": 8,
            "created_utc": 1675719458.0,
            "replies": []
        },
        {
            "body": "The irony is \"paying someone for their time\" is what an escort is.\n\nHow I suggest SDs respond to that:\n\n*\"The allowance/PPM is how I generously take care of you when I know we are in a serious, fully consummated sugar relationship. I know that when its intimate. Even after that point, I'm never paying you for your time or your body. I'm taking care of you because I am generous and want to make your life easier.\"*\n\nStill won't work with gold digger rinsers like this, but its worth a shot!",
            "author": "gamergainzgal",
            "id": "j7j9kob",
            "parent_id": "t3_10viepd",
            "score": 8,
            "created_utc": 1675744836.0,
            "replies": [
                {
                    "body": "Well stated and in the spirit of what a sugar relationship is, IMO.  Financial support (not payment, and definitely not payment for time) comes with an actual sugar relationship.  Ideally, it's something he *wants* to do for her, because he wants her happy (though admittedly, as the SR starts, this feeling needs time to build).  They are not, however, in an SR while she is still sorting out her comfort and feelings, which is that these types pretend to miss or don't care about (slf is relationship-forward;  but price-forward types ignore that there's no relationship or SR yet).  There's no basis for any allowance expectations whatsoever, while they're going on dates so she can decide whether he's the SD for her; he should, though, be doing the full court press to win her over, if he likes her.\n\nAnd there's no basis for these escort accusations when there's no SR. They're in an ongoing SR and he refuses support for platonic dates?  Different topic -- this time they're definitely IN an SR already.",
                    "author": "Azurecole",
                    "id": "j7jfyli",
                    "parent_id": "t1_j7j9kob",
                    "score": 2,
                    "created_utc": 1675748640.0,
                    "replies": []
                },
                {
                    "body": "Excellent script!",
                    "author": "Insatiable_Learner",
                    "id": "j7jh5lb",
                    "parent_id": "t1_j7j9kob",
                    "score": 0,
                    "created_utc": 1675749423.0,
                    "replies": [
                        {
                            "body": "Thanks!",
                            "author": "gamergainzgal",
                            "id": "j7lwbsd",
                            "parent_id": "t1_j7jh5lb",
                            "score": 1,
                            "created_utc": 1675797527.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Yup, \"there's a million stories in the naked city and this is just one of them\"...lol.. Ok showing my age from an old 60's TV show. But I'm glad you stuck to your guns and you were a gentleman by taking her back to the restaurant...That being said, having had some similar situations like this it just leaves a bad taste in your mouth. One of my pot SB's years ago came back to my place after a similar discussion that you had about working out the parameters of an arrangement. I was very understanding and said I know just hoping into bed the first time can be awkward..so why don't I give you a massage and we can relax. She gets half naked lying on my bed as I'm massaging her back and shoulders...I complimented her on how soft and wholesome her skin was....then I gently kissed her upper back and she FREAKED!!..\"I can't do this, I can't do this\" she's yelling...She bolts from the bed to put her bra and blouse on and I calmly said, \"No problem, I'm sorry I'll take you wherever you want to go\"..She took a train to my place so I offered to drive her to the station, a friends house anywhere she wanted....Drove her to the station, with a pain  in my gut..thinking what kind of nut job did I get myself rapped up with...Dropped her off, with some money..An hour later comes the ranting text of what a creep I am, blah blah blah....\"Did you really expect me to have sex with you?\"...\"Um yea, what was that part of the discussion about condoms??..Did you think I would put them on my nose or something?\"....Thank God I never heard from her again.....",
            "author": "surfrat54",
            "id": "j7i7gwk",
            "parent_id": "t3_10viepd",
            "score": 5,
            "created_utc": 1675727027.0,
            "replies": [
                {
                    "body": "I don't see she was a nut job, sorry 🙏. She was young and new to it. She thought she could but when it came to it she couldn't. She was embarrassed and scared and didn't know how to handle it (not scared of you; of what she was doing). \n\nShe was lucky you handled it like a gentleman, some wouldn't have and that would have been part of what scared her, she might have felt trapped by that realisation.\n\nI'm your age 'ish. I know that it's a leap for 20 something to have sex with a guy my age. First time isnt going to be easy however brave she seems.\n\nShe was young and in over her head. You can forgive her that? 🙏",
                    "author": "Sunhillian",
                    "id": "j7ioy4d",
                    "parent_id": "t1_j7i7gwk",
                    "score": 16,
                    "created_utc": 1675734902.0,
                    "replies": [
                        {
                            "body": "Yes, you're right....One of the reasons I felt so horrible was putting myself in her shoes...I hold nothing against her...retelling the story here, I remember being worried she would scream rape or something...Another time I took a long break from SA",
                            "author": "surfrat54",
                            "id": "j7iqyqz",
                            "parent_id": "t1_j7ioy4d",
                            "score": 4,
                            "created_utc": 1675735832.0,
                            "replies": [
                                {
                                    "body": "It's not easy getting older 🫣",
                                    "author": "Sunhillian",
                                    "id": "j7irrpz",
                                    "parent_id": "t1_j7iqyqz",
                                    "score": 2,
                                    "created_utc": 1675736203.0,
                                    "replies": [
                                        {
                                            "body": "You can say that again… there’s an expression I once heard.”If you’re lucky you get old”.",
                                            "author": "surfrat54",
                                            "id": "j7j5wpe",
                                            "parent_id": "t1_j7irrpz",
                                            "score": 2,
                                            "created_utc": 1675742881.0,
                                            "replies": [
                                                {
                                                    "body": "Well that's true, I neve heard that before. Puts a whole new positive spin on it 🤣🤣",
                                                    "author": "Sunhillian",
                                                    "id": "j7j62u1",
                                                    "parent_id": "t1_j7j5wpe",
                                                    "score": 1,
                                                    "created_utc": 1675742967.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Oh my god, I feel bad for you .-.That was humiliating :(( You handled it like a gentleman despite that.",
                    "author": "Emotional_Set5737",
                    "id": "j7l9xb7",
                    "parent_id": "t1_j7i7gwk",
                    "score": 0,
                    "created_utc": 1675788830.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Fuck her lol, what a waste of your time",
            "author": "tom26461",
            "id": "j7is7cn",
            "parent_id": "t3_10viepd",
            "score": 5,
            "created_utc": 1675736404.0,
            "replies": []
        },
        {
            "body": "You continued that conversation way too long.   I'd have said\"lets go\" and dropped her at the closest convenience store.",
            "author": "rodeopete3281",
            "id": "j7htzuq",
            "parent_id": "t3_10viepd",
            "score": 10,
            "created_utc": 1675721566.0,
            "replies": []
        },
        {
            "body": "Why *not* just get an escort instead? You can have dinner and conversations and guaranteed sex. you can look through their website to find out more about them and read their reviews from other clients. That by passes the whole m&g.",
            "author": "JazyZazy",
            "id": "j7mcoa7",
            "parent_id": "t3_10viepd",
            "score": 2,
            "created_utc": 1675803776.0,
            "replies": []
        },
        {
            "body": "“I don’t want to feel like a whore”\n\n“And I don’t want to feel like a sucker”\n\nIf she doesn’t want to feel like a whore she could also just not accept a PPM, right?",
            "author": "NotAnEngineer287",
            "id": "j7im43f",
            "parent_id": "t3_10viepd",
            "score": 4,
            "created_utc": 1675733557.0,
            "replies": []
        },
        {
            "body": "If she wanted to go on a few platonic dates before having sex then that seems perfectly reasonable if she communicates that beforehand. She messed up when she agreed before the date to having sex but then tried to renege on her end of the arrangement while still trying to hold you to your end. It's fine if she wants to negotiate a less than ideal arrangement from your perspective but anyone who unfairly violates an agreement should no longer be dealt with.",
            "author": "Garuda_Darkblack",
            "id": "j7ir7h2",
            "parent_id": "t3_10viepd",
            "score": 4,
            "created_utc": 1675735943.0,
            "replies": []
        },
        {
            "body": "Good for you.\n\nFuck.\n\nHer.",
            "author": "LunchBucketSandwich",
            "id": "j7it3p4",
            "parent_id": "t3_10viepd",
            "score": 3,
            "created_utc": 1675736814.0,
            "replies": []
        },
        {
            "body": "I would have called it when she was dicking around on her phone while she was supposed to be on a date with you.\n\nThis is one of the reasons that you should make it clear that sex is expected at every date before even going through with a M&G and if she gives you any hesitation at all you cut bait right then.",
            "author": "RoninG12",
            "id": "j7hnj7i",
            "parent_id": "t3_10viepd",
            "score": 7,
            "created_utc": 1675719093.0,
            "replies": [
                {
                    "body": "You shouldn’t have sex on the first meet n greet! Especially if you jot paying her for it",
                    "author": "Nefarious_evee",
                    "id": "j7k1hyl",
                    "parent_id": "t1_j7hnj7i",
                    "score": 1,
                    "created_utc": 1675765924.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "She is just looking for money without fulfilling her end of the deal. Cut her off and move on. She may or may not find some SIMP out there who just wants to give her money and expect nothing from her in return.",
            "author": "hpygilmr",
            "id": "j7i9myy",
            "parent_id": "t3_10viepd",
            "score": 5,
            "created_utc": 1675727955.0,
            "replies": []
        },
        {
            "body": "If you treat a girl like a prostitute and pay her for a sexual relationship/only when she has sex with you, how do you think that will make her feel?",
            "author": "sassydegrassii",
            "id": "j7hue4d",
            "parent_id": "t3_10viepd",
            "score": 8,
            "created_utc": 1675721721.0,
            "replies": [
                {
                    "body": "This questions is ridiculous :\n\nA sugar baby = a friend and LOVER \n\nIf I just wanted a friend I would be in friendfinder website \n\nIf all I wanted was only sex I would probably go to a sex worker \n\nYou need to be both ( friend and lover ) to me for me to give you ppm/allowance \n\nI am ok with 1 or 2 platonic dates ( and taking you to nice dinners ) but if you think I will hand over ppm before we decide to become both friends and lovers then obviously you think there is a lack of ENTERTAINMENT in my life and that is not true in any form or way",
                    "author": "shamloo77",
                    "id": "j7icgc0",
                    "parent_id": "t1_j7hue4d",
                    "score": 11,
                    "created_utc": 1675729172.0,
                    "replies": []
                },
                {
                    "body": "I'm a SD and I agree.  I've probably started the most natural sugar relationship I've had in years, and it started when I took a leap and skipped PPM and went straight to allowance.  Started the first month in two payments, but beyond that it never went through a transactional phase.\n\nShe felt free to do what she wanted, and it ended up being sex multiple times on our longer date. Sure I'll get rinsed one day on another girl, but I'll trust my gut.",
                    "author": "whataatrip",
                    "id": "j7j8nuc",
                    "parent_id": "t1_j7hue4d",
                    "score": 5,
                    "created_utc": 1675744343.0,
                    "replies": [
                        {
                            "body": "You are a true SD and bless you 👏🏾 when you take care of a women, a women will take care of you. We put time and effort into how we look just to meet you. Only paying us for sex, especially for PPM, makes it feel degrading and cheap. That is an escort, and trust that they get paid that amount for the HOUR and acts. We’d be making less. There are much better SD/SB subreddits and I feel like most the active users on here I would have vetted out just from the stinginess to not show proper masc/feminine etiquette or make me feel like they are a safe provider so that I could let down my hair and actually enjoy time with them.",
                            "author": "cococatrina",
                            "id": "j7jce7f",
                            "parent_id": "t1_j7j8nuc",
                            "score": 5,
                            "created_utc": 1675746435.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "She was late without a heads up and spent the entire \"date\" on her phone. She's treating herself like a prostitute, not someone on a date.",
                    "author": "NinCarolina",
                    "id": "j7i5qyx",
                    "parent_id": "t1_j7hue4d",
                    "score": 4,
                    "created_utc": 1675726302.0,
                    "replies": [
                        {
                            "body": "He’s treating her like a prostitute for only paying her when he gets sex in return, like you know, prostitution. Checking her phone doesn’t make her a sex worker, that’s just a little rude. This arrangement does.",
                            "author": "sassydegrassii",
                            "id": "j7i6icc",
                            "parent_id": "t1_j7i5qyx",
                            "score": -1,
                            "created_utc": 1675726620.0,
                            "replies": [
                                {
                                    "body": "Having sex with someone does not make you a prostitute. \n\nCharging someone \"for your time\" during which you are clearly not interested in them makes you a prostitute.",
                                    "author": "NinCarolina",
                                    "id": "j7i7i0u",
                                    "parent_id": "t1_j7i6icc",
                                    "score": 5,
                                    "created_utc": 1675727041.0,
                                    "replies": [
                                        {
                                            "body": "Having sex for money makes you a sex worker, paying under those conditions makes you a client",
                                            "author": "sassydegrassii",
                                            "id": "j7j6zel",
                                            "parent_id": "t1_j7i7i0u",
                                            "score": 1,
                                            "created_utc": 1675743446.0,
                                            "replies": [
                                                {
                                                    "body": "And if you take money from someone under the pretense of having sex with them and then refuse to have sex with them, that makes you even worse.",
                                                    "author": "NinCarolina",
                                                    "id": "j7j8gh4",
                                                    "parent_id": "t1_j7j6zel",
                                                    "score": 0,
                                                    "created_utc": 1675744230.0,
                                                    "replies": [
                                                        {
                                                            "body": "It’s not about being worse, it’s just calling a spade a spade",
                                                            "author": "sassydegrassii",
                                                            "id": "j7jd2dd",
                                                            "parent_id": "t1_j7j8gh4",
                                                            "score": 1,
                                                            "created_utc": 1675746830.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Like the pro she is. why would she not feel like what she actually is? why delude oneself?",
                    "author": "JeaneyBowl",
                    "id": "j7i1b2h",
                    "parent_id": "t1_j7hue4d",
                    "score": 2,
                    "created_utc": 1675724477.0,
                    "replies": [
                        {
                            "body": "anyone that thinks SR’s are NOT a form of SW is delusional, that’s the point. They’re a kind of sex work that often requires way more emotional labour for less money because y’all will do anything to avoid accepting that you’re engaging in sex work",
                            "author": "sassydegrassii",
                            "id": "j7i7a5f",
                            "parent_id": "t1_j7i1b2h",
                            "score": 10,
                            "created_utc": 1675726948.0,
                            "replies": [
                                {
                                    "body": "Why are you here?",
                                    "author": "throwawayrtyggv",
                                    "id": "j7ikc3s",
                                    "parent_id": "t1_j7i7a5f",
                                    "score": 4,
                                    "created_utc": 1675732705.0,
                                    "replies": [
                                        {
                                            "body": "unfortunately, it’s relevant to me",
                                            "author": "sassydegrassii",
                                            "id": "j7j7bo8",
                                            "parent_id": "t1_j7ikc3s",
                                            "score": 0,
                                            "created_utc": 1675743627.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "I tend to agree w you. Nobody wants to look at the fact that this is sex work. And it requires SEX AND MONEY HAHAHA",
                                    "author": "Elephantananda222",
                                    "id": "j7j9dfs",
                                    "parent_id": "t1_j7i7a5f",
                                    "score": 1,
                                    "created_utc": 1675744727.0,
                                    "replies": []
                                },
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "j7jcjw2",
                                    "parent_id": "t1_j7i7a5f",
                                    "score": -4,
                                    "created_utc": 1675746527.0,
                                    "replies": [
                                        {
                                            "body": "If you pay only for sexual visits, you’re a John. It goes both ways. I don’t care if you’re insulted by that. Sex work isn’t a bad thing.  This is a matter of the whorearchy/whorephobia.",
                                            "author": "sassydegrassii",
                                            "id": "j7jd7g4",
                                            "parent_id": "t1_j7jcjw2",
                                            "score": 1,
                                            "created_utc": 1675746918.0,
                                            "replies": [
                                                {
                                                    "body": "[deleted]",
                                                    "author": null,
                                                    "id": "j7jex9r",
                                                    "parent_id": "t1_j7jd7g4",
                                                    "score": -1,
                                                    "created_utc": 1675747975.0,
                                                    "replies": [
                                                        {
                                                            "body": "I have multiple boards because I’m a sex worker of multiple practices. you don’t have to be high class to be into sugar, it’s proven in here every day",
                                                            "author": "sassydegrassii",
                                                            "id": "j7jgr63",
                                                            "parent_id": "t1_j7jex9r",
                                                            "score": 2,
                                                            "created_utc": 1675749154.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Fucking ridiculous response. Why do so many of you gaslight men for wanting the main component of a sugar relationship.",
                    "author": "throwawayrtyggv",
                    "id": "j7ik7mi",
                    "parent_id": "t1_j7hue4d",
                    "score": 1,
                    "created_utc": 1675732648.0,
                    "replies": [
                        {
                            "body": "Why do so many of the men here gaslight women for wanting THE MAIN component of a sugar relationship?",
                            "author": "thehottubistoohawt",
                            "id": "j7ioxqj",
                            "parent_id": "t1_j7ik7mi",
                            "score": 13,
                            "created_utc": 1675734897.0,
                            "replies": [
                                {
                                    "body": "I don't think that is true. there is no ground swell of men saying that women should have sex without receiving some benefit for being in that sexual relationship with someone.\n\nif anything, it seems to be perfectly clear that the majority here believe that both benefits should start at the same time. to the credit of many of the guys that post here, plenty will say that AFTER the sexual relationship has started, then occasional dates that don't include sex are fine and will receive the same benefits as any other dates.",
                                    "author": "joc13",
                                    "id": "j7j4475",
                                    "parent_id": "t1_j7ioxqj",
                                    "score": 2,
                                    "created_utc": 1675741976.0,
                                    "replies": []
                                },
                                {
                                    "body": "And usually, when does a sugar relationship start?",
                                    "author": "throwawayrtyggv",
                                    "id": "j7iqusd",
                                    "parent_id": "t1_j7ioxqj",
                                    "score": 2,
                                    "created_utc": 1675735781.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I'm so sorry you had to deal with that. It's one thing to say no to intimacy, but it's another to be still expecting allowance without honouring her part of the arrangement.",
            "author": "lookin4asd",
            "id": "j7ht88j",
            "parent_id": "t3_10viepd",
            "score": 3,
            "created_utc": 1675721262.0,
            "replies": []
        },
        {
            "body": "That's a strange turn of events! My guess is that her perspective of these relationship dynamics has some issues/flaws that she needs to work through because it doesn't sound like she expressed what shifted in her mind from those conversations over the progression of dates. You did your best to set up those conversations as best you could to ensure there is clarity and boundaries that are appropriate and comfortable for you both, just unfortunate that she didn't have the maturity and reflectiveness to navigate her feelings around what it would mean to explore sexual connection.\n\nAlso; super rude and annoying that she was on her phone so much, totally unacceptable in my mind when you are spending time with anyone to be that rude. Unfortunately younger generations are so attached to their devices... Saying this as a wise old lady in a young person's body 😂",
            "author": "MissBeehave420",
            "id": "j7iwzl5",
            "parent_id": "t3_10viepd",
            "score": 3,
            "created_utc": 1675738589.0,
            "replies": []
        },
        {
            "body": "you should’ve flipped it back around on her, whenever a woman says that I’m paying for their time, that’s exactly what an escort and prostitute would say as well. You should’ve told her straight up that sugar babies do not get paid for their time. If she wants to get paid for her time, she should either get a job or become an escort.",
            "author": "NickPfromYuma",
            "id": "j7ifryi",
            "parent_id": "t3_10viepd",
            "score": 4,
            "created_utc": 1675730630.0,
            "replies": [
                {
                    "body": "What are sugar babies paid for ?",
                    "author": "Elephantananda222",
                    "id": "j7j91hl",
                    "parent_id": "t1_j7ifryi",
                    "score": 6,
                    "created_utc": 1675744548.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "This one doesn't require deep thinking.  Next.",
            "author": "Ronald_Quacken",
            "id": "j7hz665",
            "parent_id": "t3_10viepd",
            "score": 2,
            "created_utc": 1675723620.0,
            "replies": []
        },
        {
            "body": "I’ve a feeling this one’s going to get ugly. I’ve made some more cocktails but I’m all out of 🍿. So if the SBs could just give it a few minutes while I nip down to the multiplex on Sunset please. Does anyone else think we should turn this into a reality show. Anyone in the entertainment industry?",
            "author": "Sad_Manufacturer9669",
            "id": "j7hpk4m",
            "parent_id": "t3_10viepd",
            "score": 3,
            "created_utc": 1675719855.0,
            "replies": [
                {
                    "body": "I’m in the industry and think about producing that program that reality show all of the time.  I think it kills the whole anonymity thing, but perhaps you have an idea around that.",
                    "author": "PracticePositive69",
                    "id": "j7ijtgs",
                    "parent_id": "t1_j7hpk4m",
                    "score": 0,
                    "created_utc": 1675732463.0,
                    "replies": [
                        {
                            "body": "You could do it in some variant of the bachelor. Between actually single 1-percenter who's not quite high profile and don't mind some TV notoriety and some aspiring model/bachelor that gets bankrolled by the program there's many ways to make it work.",
                            "author": "karmaextract",
                            "id": "j7jjhb9",
                            "parent_id": "t1_j7ijtgs",
                            "score": 0,
                            "created_utc": 1675751035.0,
                            "replies": [
                                {
                                    "body": "Or I was thinking about the guy goes on three M&G’s and we follow him and see which one he chooses.  Sort of like House Hunters.  Working title  — Sugar Hunters.",
                                    "author": "PracticePositive69",
                                    "id": "j7laskr",
                                    "parent_id": "t1_j7jjhb9",
                                    "score": 1,
                                    "created_utc": 1675789164.0,
                                    "replies": [
                                        {
                                            "body": "I think in that format you want to add some element of competition for the audience, say a model with no money vs SD, maybe throw in the average joe vanilla dater and see how their experiences compare, but also make sure its setup in a way that people actually understand how much bullshit men actually have to deal with.",
                                            "author": "karmaextract",
                                            "id": "j7ljos1",
                                            "parent_id": "t1_j7laskr",
                                            "score": 1,
                                            "created_utc": 1675792582.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "There is something that underlies these interactions that bugs me from a different angle.\n\nThose of us that *actually do sugar know how this works.* There is sex on the first or (ideally) second date, maybe the third. It happens between two willing participants who are seeking an arrangement.. An important part of that arrangement is sex... an important part is allowance.\n\nOnce these TikTokToxics start saying \"that's what a prostitute does\" they are totally slut shaming the many women who enter and remain in the bowl willingly (a small number of whom I've had the pleasure of dating for an extended period of time).\n\nThe TikTokToxics are all rinsers. They decided before they met you that the women in arrangements are whores. Yet they pretend to be like these women so they can extract money from you.\n\nThey're destroying the bowl from one side while the sleazy nasty men destroy it from the other side.",
            "author": "marker3000",
            "id": "j7ijy1r",
            "parent_id": "t3_10viepd",
            "score": 4,
            "created_utc": 1675732523.0,
            "replies": [
                {
                    "body": ">Once these TikTokToxics start saying \"that's what a prostitute does\" they are totally slut shaming the many women who enter and remain in the bowl willingly (a small number of whom I've had the pleasure of dating for an extended period of time).\n\nTrue, but that's not really the intent.  The intent here is to manipulate a man who is not her SD (and who she is telling clearly, she is not ready for him to be her SD yet) that he somehow owes her guaranteed payment for her to get to know him more, otherwise he's \"treating her like an escort\", which of course makes him a john.  The escort shaming is unfortunate collateral damage in the pursuit of profit, but she's going to use the tools she has.  The intent is focused on exactly one thing: getting a man who is not her SD, and she doesn't (yet) want to be her SD, to feel obligated and shamed into paying her as if this were an actual SR at this point.  Declining to \"pay\" a random woman who is not his SB, is not \"treating her like an escort\" 🤣🤣\n\nTerms used when men do this to women include \"emotional manipulation\" and \"gaslighting\".  The proSB and rinserverse goes crazy when I properly and accurately apply their terms back to them, but the shoe is fitting very well.",
                    "author": "WynnDuppy",
                    "id": "j7isgmk",
                    "parent_id": "t1_j7ijy1r",
                    "score": 8,
                    "created_utc": 1675736524.0,
                    "replies": []
                },
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "j7vufhf",
                    "parent_id": "t1_j7ijy1r",
                    "score": 1,
                    "created_utc": 1675971854.0,
                    "replies": [
                        {
                            "body": "I'm 10,000% certain you're correct. They have sex with the guy (often, most likely) but somehow it's important to portray themselves as \"just pretty to look at\" rather than admitting what they do.",
                            "author": "marker3000",
                            "id": "j81dv7p",
                            "parent_id": "t1_j7vufhf",
                            "score": 2,
                            "created_utc": 1676067695.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Ugh. That phone thing at dinner says volumes right there. Did you offer her a smaller amount for cuddling/kissing? I might have tried that.",
            "author": "SDInLeather",
            "id": "j7k71ef",
            "parent_id": "t3_10viepd",
            "score": 2,
            "created_utc": 1675770311.0,
            "replies": [
                {
                    "body": ">*Ugh. That phone thing at dinner says volumes right there.*\n\nYes, completely rude\n\n>*Did you offer her a smaller amount for cuddling/kissing? I might have tried that.*\n\nReally? 🤦🏻‍♂️",
                    "author": "Chill_SD1974",
                    "id": "j7k8rr1",
                    "parent_id": "t1_j7k71ef",
                    "score": 1,
                    "created_utc": 1675771512.0,
                    "replies": [
                        {
                            "body": "Yes, two reasons, 1. to eliminate that it was not just nervousness about being close that was her issue (i.e. that she was not actually a rinser) as some also mentioned, 2. I enjoy kissing and have many times sugared for that alone or as a gradual lead to intimacy process with an SB. I was not there though, obviously, only you were so you have a 1,001 personal intuitive experiences etc about her that I don't share.",
                            "author": "SDInLeather",
                            "id": "j7lidsl",
                            "parent_id": "t1_j7k8rr1",
                            "score": 2,
                            "created_utc": 1675792083.0,
                            "replies": [
                                {
                                    "body": "Dude, I mean, I did not claim to be there but re-read the original post and read this woman’s attitude. 🤷🏻‍♂️ \n\nBecause offering a woman a little bit of money to kiss you is a sure way to increase her comfort level.  🤦🏻‍♂️x 100\n\nI’m imagining the Kissing Booth at an old time-y county fair \n\n[“Smooches 50 cents”](https://stepandrepeatla.com/shop/event-props/kissing-booth-rental/)",
                                    "author": "Chill_SD1974",
                                    "id": "j7lm1c9",
                                    "parent_id": "t1_j7lidsl",
                                    "score": 2,
                                    "created_utc": 1675793507.0,
                                    "replies": [
                                        {
                                            "body": "Haha, well, I would like to see the old-timey country fair that had some of the kiss fests I've personally been involved in(some of which were honestly like \"only kissing\" and ended up being intimate on the couch), but I understand your point. And, btw, sorry, I did not look up and thought you were the OP, hence the \"being there\" component. IMO only someone who is sitting across from someone else can truly make an effective read on a situation, no matter how detailed the narrative.:)",
                                            "author": "SDInLeather",
                                            "id": "j7lx8ef",
                                            "parent_id": "t1_j7lm1c9",
                                            "score": 1,
                                            "created_utc": 1675797878.0,
                                            "replies": [
                                                {
                                                    "body": "Not to worry, it’s often challenging to keep up with who is responding to what.",
                                                    "author": "Chill_SD1974",
                                                    "id": "j7m8umt",
                                                    "parent_id": "t1_j7lx8ef",
                                                    "score": 2,
                                                    "created_utc": 1675802334.0,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "body": "And agree, the overall flavor seems as if her attitude towards the whole thing was sucky.",
                                            "author": "SDInLeather",
                                            "id": "j7lxe6t",
                                            "parent_id": "t1_j7lm1c9",
                                            "score": 1,
                                            "created_utc": 1675797940.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "You better than me. Her ass would have been calling her friend or an UBER.",
            "author": "southernslick",
            "id": "j7i62i0",
            "parent_id": "t3_10viepd",
            "score": 3,
            "created_utc": 1675726436.0,
            "replies": []
        },
        {
            "body": "Unfortunately, this new gen of babies has been influenced by social media(mainly Tiktok) into thinking sugaring ISNT sex work and they can make 1000s talking to men in public with all their clothes on(does it happen? Sure. But not the norm and shouldn’t be expected.) I’ve heard tons of stories like this sadly.",
            "author": "Sirennella",
            "id": "j7ivtpc",
            "parent_id": "t3_10viepd",
            "score": 2,
            "created_utc": 1675738060.0,
            "replies": [
                {
                    "body": "I’d agree with you except I don’t think the TikTok-influenced women accept all the arrangement boundaries discussed in date 1 and then pull a 180° on the proposed intimate date. They “know their worth” from the get-go. \n\nShe has some kind of problem, I don’t know what, though.",
                    "author": "Chill_SD1974",
                    "id": "j7kkpzr",
                    "parent_id": "t1_j7ivtpc",
                    "score": 0,
                    "created_utc": 1675778261.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I'm sorry this happened. That's such an obvious scam. Like, how insulting.\n\nBut I wonder how many men fall for this every day?",
            "author": "c4ncelculture",
            "id": "j7hyorv",
            "parent_id": "t3_10viepd",
            "score": 3,
            "created_utc": 1675723427.0,
            "replies": [
                {
                    "body": "Definitely not a scam. She has clearly been used in the past by another sugar daddy and didn’t want it happening again.",
                    "author": "Substantial_Cream231",
                    "id": "j7xkinl",
                    "parent_id": "t1_j7hyorv",
                    "score": 1,
                    "created_utc": 1675997333.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Well done.",
            "author": "Distinct-Animal-9628",
            "id": "j7hm96k",
            "parent_id": "t3_10viepd",
            "score": 2,
            "created_utc": 1675718610.0,
            "replies": []
        },
        {
            "body": "Call an Uber and tell her to stand in the street and wait for it.      Next.",
            "author": "15Warrior15",
            "id": "j7i2fzf",
            "parent_id": "t3_10viepd",
            "score": 3,
            "created_utc": 1675724944.0,
            "replies": []
        },
        {
            "body": "Did you discuss beforehand that sex would happen on date 2? With previous SB’s I’ve had to clearly spell it out for them that ppm starts when intimacy starts.",
            "author": "NewYorkSD",
            "id": "j7ht2vp",
            "parent_id": "t3_10viepd",
            "score": 0,
            "created_utc": 1675721203.0,
            "replies": [
                {
                    "body": "Yes clearly discussed at M&G initial date, that date #2 would be dinner and then my place for intimacy. Then had ppm discussion and condom discussion with my offer of test results.",
                    "author": "Worldly-wanderer",
                    "id": "j7ia4uo",
                    "parent_id": "t1_j7ht2vp",
                    "score": 4,
                    "created_utc": 1675728167.0,
                    "replies": [
                        {
                            "body": "Damn she sounds like a total rinser. Good for you for sticking to your guns.",
                            "author": "NewYorkSD",
                            "id": "j7icwf1",
                            "parent_id": "t1_j7ia4uo",
                            "score": 6,
                            "created_utc": 1675729365.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "The issue here is that sex on the date with use of condoms had been discussed and agreed. It's that aspect of this make makes it feel like it was planned to get paid with no sugar as she backed away from what was agreed and it seems she was a bit smart lipped with it.\n\nHad she been more up front and said \"I would like to receive the allowance and be given the space to build up a connection first. Are you ok if we make out but stop short of piv until I'm comfortable?\"\n\n I would have absolutely gone along with her and had no problem if she wanted to back out after, if she wasn't feeling it. There's no guarantee we are going to click, I don't expect it as a right and bear no ill will if it doesn't happen. The whole thing is a big ask of any woman, experienced or not. \n\nIts a much easier mental acceptance to allow her, a stranger to dip into my wallet than her allow me, a stranger to dip into her kitty. It has to be at her place as long I feel she's genuine.",
            "author": "Sunhillian",
            "id": "j7i647t",
            "parent_id": "t3_10viepd",
            "score": 1,
            "created_utc": 1675726457.0,
            "replies": []
        },
        {
            "body": "Seeking Arrangements closed their doors and became a traditional dating site called seeking with a mission of connecting potential life long partnerships between well to do individuals but there is still somewhat of a S.R. element but my past 3 m&g 1. I just want to be taken care of because me and my boyfriend don’t have the money 2. Wanted to meet at her apartment which by the way was very very nice and then wanted allowance for having me over no intimacy our discussion would happen on next date? 3. M&g wanted allowance I told her not unless she wanted to extend the date then offered shopping before than extension I advised extension first and wow went into an embarrassing meltdown during the lunch crowd and stormed out leaving me embarrassed while waiting for the check. Got in my car cancelled my membership and they wanted to know if it was because of their new direction? I checked too many scammers. F@@k seeking and their ridiculous fee I get better on AdultFriendFinder, free-styling it",
            "author": "vincenzo-101",
            "id": "j7igqco",
            "parent_id": "t3_10viepd",
            "score": 1,
            "created_utc": 1675731053.0,
            "replies": []
        },
        {
            "body": "If \"dinner and intimacy\" were agreed on for the second date, as reported by OP, then she backed out of the agreement, but still expected to be paid. Then proceeded to double down on the notion that she may never agree to have sex, but would still expect to be paid for her time.\n\nNo thanks . . .",
            "author": "throeuhway2022",
            "id": "j7ijsxv",
            "parent_id": "t3_10viepd",
            "score": 1,
            "created_utc": 1675732456.0,
            "replies": []
        },
        {
            "body": "This was a fun story.",
            "author": "SugarDaddyinTraining",
            "id": "j7hoo29",
            "parent_id": "t3_10viepd",
            "score": 1,
            "created_utc": 1675719520.0,
            "replies": []
        },
        {
            "body": "Any SB who thinks that a SD is going to wait weeks for sex while paying xxxx for her time is delusional. He'll be better off with a prostitute. I understand that a few dates before intimacy. It's a getting to know each other process. But this is how it works. Money for honey 🍯.",
            "author": "Automatic_Joke_4414",
            "id": "j7khsuy",
            "parent_id": "t3_10viepd",
            "score": 1,
            "created_utc": 1675776814.0,
            "replies": []
        },
        {
            "body": "Umm, “her time” is not of much value.",
            "author": "LippoLippi1500",
            "id": "j7htcex",
            "parent_id": "t3_10viepd",
            "score": 1,
            "created_utc": 1675721308.0,
            "replies": []
        },
        {
            "body": "Hmm. I suppose I’m a bit of a ‘too trusting and kind’ type, but I’d probably have gone for the kisses and cuddles she offered and also given her immediately at least part of the allowance with the balance following if things progressed. Most girls are terrified of being ‘pumped n dumped’ and need a demonstration of good faith in order to feel safe enough to have sex.",
            "author": "Regular_Lettuce_9064",
            "id": "j7i2pr9",
            "parent_id": "t3_10viepd",
            "score": 0,
            "created_utc": 1675725054.0,
            "replies": [
                {
                    "body": "This is the way to go. The best arrangements I've had were handled this way until I was comfortable enough to be intimate.",
                    "author": "thehottubistoohawt",
                    "id": "j7iphw4",
                    "parent_id": "t1_j7i2pr9",
                    "score": 3,
                    "created_utc": 1675735157.0,
                    "replies": [
                        {
                            "body": "YES thank you! SBs should not settle for less because there are great SDs out there like you 💕💖🥰",
                            "author": "cococatrina",
                            "id": "j7jd5wd",
                            "parent_id": "t1_j7iphw4",
                            "score": 2,
                            "created_utc": 1675746891.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "That’s why you should have gone with a more mature woman, 🤷‍♀️ just sayin.",
            "author": "39sherry",
            "id": "j7kejzc",
            "parent_id": "t3_10viepd",
            "score": 1,
            "created_utc": 1675775071.0,
            "replies": [
                {
                    "body": "Maturity has nothing to do with it. Class, trust and mutual respect is something that should have been present.",
                    "author": "Substantial_Cream231",
                    "id": "j7xifld",
                    "parent_id": "t1_j7kejzc",
                    "score": 1,
                    "created_utc": 1675996373.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "You should charge her a fee for wasting your time.",
            "author": "sugardad123",
            "id": "j7ikm63",
            "parent_id": "t3_10viepd",
            "score": 0,
            "created_utc": 1675732833.0,
            "replies": []
        },
        {
            "body": "Enough with the platonic arrangement. Why pay for a woman’s company??",
            "author": "sloan3140",
            "id": "j7j1yxh",
            "parent_id": "t3_10viepd",
            "score": 0,
            "created_utc": 1675740919.0,
            "replies": [
                {
                    "body": "Because she’s not just any woman. She’s a beautiful younger woman who’s out of your league. The definition of a Sugar baby.",
                    "author": "Substantial_Cream231",
                    "id": "j7xi9tt",
                    "parent_id": "t1_j7j1yxh",
                    "score": 1,
                    "created_utc": 1675996299.0,
                    "replies": [
                        {
                            "body": "So sad!!",
                            "author": "sloan3140",
                            "id": "j8816oi",
                            "parent_id": "t1_j7xi9tt",
                            "score": 1,
                            "created_utc": 1676193881.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "This could have gone completely different but you didn't know how to do anything but be offended.\n\nSince you decided you would tolerate the phone thing. I wouldn't have.",
            "author": "VomitOnSweater",
            "id": "j7j4m5y",
            "parent_id": "t3_10viepd",
            "score": 0,
            "created_utc": 1675742229.0,
            "replies": []
        },
        {
            "body": "I’m glad that she stood up for herself and didn’t have nonconsensual sex in exchange for money.",
            "author": "KetoSeaweed",
            "id": "j7ilfha",
            "parent_id": "t3_10viepd",
            "score": -4,
            "created_utc": 1675733227.0,
            "replies": [
                {
                    "body": "Another ridiculous take. She essentially said she wanted paid for a platonic date. She wanted the money, that’s why she went home with him. They did discuss intimacy in advance.",
                    "author": "throwawayrtyggv",
                    "id": "j7j2wor",
                    "parent_id": "t1_j7ilfha",
                    "score": 2,
                    "created_utc": 1675741373.0,
                    "replies": [
                        {
                            "body": "Then she changed her mind, realized she didn’t want to have sex with him, and didn’t force herself to have sex in exchange for money. She realized she didn’t want to do sex work, and she left the situation. She didn’t blackmail the guy, try to force him to pay, or engage in any unethical behavior. She simply said “no,” and left.",
                            "author": "KetoSeaweed",
                            "id": "j7j58ye",
                            "parent_id": "t1_j7j2wor",
                            "score": 1,
                            "created_utc": 1675742546.0,
                            "replies": [
                                {
                                    "body": ">She realized she didn’t want to do sex work, and she left the situation.\n\nYou forgot to mention the part where she still attempted to gaslight him into fulfilling his side of the agreement without her fulfilling hers.\n\nYou're making it sound amicable when that's not the case.  She's lucky she got a ride back to the train station after the attitude.",
                                    "author": "Veioviz",
                                    "id": "j7m00dn",
                                    "parent_id": "t1_j7j58ye",
                                    "score": 2,
                                    "created_utc": 1675798952.0,
                                    "replies": []
                                },
                                {
                                    "body": "He also gets to consent on his choice of whether to open his wallet or not. He wasn’t feeling it, so he didn’t. Good for him. No man should ever feel coerced to pay a woman for her company.",
                                    "author": "Dry_Dimension_4707",
                                    "id": "j7jfz3d",
                                    "parent_id": "t1_j7j58ye",
                                    "score": 1,
                                    "created_utc": 1675748648.0,
                                    "replies": []
                                },
                                {
                                    "body": "She still fucking asked to be paid and went to his house knowing full well what that likely meant.\nShe’s a scammer and multiple people are defending her. It’s disgusting",
                                    "author": "throwawayrtyggv",
                                    "id": "j7kc3oz",
                                    "parent_id": "t1_j7j58ye",
                                    "score": -2,
                                    "created_utc": 1675773638.0,
                                    "replies": [
                                        {
                                            "body": "Nah, she’s just a woman who was probably in a desperate financial position, thought her only chance to get what she needed was to fuck for money, and then at the last minute realized she couldn’t go through with it. \n\nThat’s not being a scammer. That’s being in an awful position, then realizing that you really don’t want to have sex with somebody you have no interest in as a financial transaction, and clearly articulating that boundary.",
                                            "author": "KetoSeaweed",
                                            "id": "j7kjg8v",
                                            "parent_id": "t1_j7kc3oz",
                                            "score": 3,
                                            "created_utc": 1675777639.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "j7i6vsv",
            "parent_id": "t3_10viepd",
            "score": -5,
            "created_utc": 1675726778.0,
            "replies": [
                {
                    "body": "She didn’t have to ride back with him.\n\nIt is astonishing how often people on here defend this behavior",
                    "author": "throwawayrtyggv",
                    "id": "j7il9oa",
                    "parent_id": "t1_j7i6vsv",
                    "score": 5,
                    "created_utc": 1675733147.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "j7j1gat",
                            "parent_id": "t1_j7il9oa",
                            "score": -2,
                            "created_utc": 1675740669.0,
                            "replies": [
                                {
                                    "body": "That’s some mental gymnastics to justify rinsing",
                                    "author": "throwawayrtyggv",
                                    "id": "j7j2m7u",
                                    "parent_id": "t1_j7j1gat",
                                    "score": 1,
                                    "created_utc": 1675741229.0,
                                    "replies": [
                                        {
                                            "body": "[deleted]",
                                            "author": null,
                                            "id": "j7j3zxy",
                                            "parent_id": "t1_j7j2m7u",
                                            "score": 0,
                                            "created_utc": 1675741917.0,
                                            "replies": [
                                                {
                                                    "body": "HE SAID THEY HAD DISCUSSED IT IN ADVANCE.\n\nI can’t believe you’re defending a scammer",
                                                    "author": "throwawayrtyggv",
                                                    "id": "j7kbyhy",
                                                    "parent_id": "t1_j7j3zxy",
                                                    "score": 1,
                                                    "created_utc": 1675773552.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "They had already discussed ppm and intimacy prior to this date \n\n\nShe suddenly tried to ignore all that and pull a fast one on him ( rinse him )",
                    "author": "shamloo77",
                    "id": "j7id7en",
                    "parent_id": "t1_j7i6vsv",
                    "score": 5,
                    "created_utc": 1675729498.0,
                    "replies": []
                },
                {
                    "body": "Exactly! I feel like the one thing men on this particular subreddit fail to realize is that your money is replaceable, our body and integrity is not. That’s why we want an initial investment. Obviously things have to come to a compromise sometimes, but a PPM for sex is not a recipe for a girl to feel valued and safe. It’s actually the new generation of SBs that are accepting bare minimum behavior, the game was not this way until it became more advertised and saltdaddies found out about SA.",
                    "author": "cococatrina",
                    "id": "j7jcykg",
                    "parent_id": "t1_j7i6vsv",
                    "score": 1,
                    "created_utc": 1675746766.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "j7ijbhp",
            "parent_id": "t3_10viepd",
            "score": 0,
            "created_utc": 1675732229.0,
            "replies": [
                {
                    "body": "Actually the phone thing could be a nervous coping mechanism sometimes.\n\nI had a former subordinate who was like 10+ years younger than me. After she took a job overseas she would always ask to see me when she's in town (up until the pandemic anyway) I always kept it professional especially since at first there's no reason for me to think there was anything going on though we only started meeting out of office a few weeks before she left, all of which she initiated. On the last meet she her excuse was she wanted to run some business ideas through me. When we met, she was all quiet. I asked didn't she want to talk about her business ideas? She said \"No, we don't have to talk about that.\" and stayed on her phone.\n\nThis wasn't SA or anything, this was a real life, organic situation and she objectively spent a lot of time on lunch and dinners with me.\n\nThat last meet was our most awkward meet. I think she may be doing the young woman thing trying to \"test\" me or \"wait\" for me to make a move. I'm sorry, if you came to me with seeking advice as the stated reason, I'm going to give you my most professional and objective advice.\n\nI did console her over phone and text when she was starting out at that new job and struggling and feeling like she got stuck in a dead end career, so there's that. Maybe something changed along the way from genuinely seeking career advice to hoping for something more but she didn't know how to deal with it so she just awkwardly stared at her phone and not a word about her stated reason asking to see me.",
                    "author": "karmaextract",
                    "id": "j7jiwc0",
                    "parent_id": "t1_j7ijbhp",
                    "score": 0,
                    "created_utc": 1675750622.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Need to have a handy retort for that BS.  Clearly she’s watched some TikTok scammer videos.",
            "author": "RedHeavyG603",
            "id": "j7j2ju4",
            "parent_id": "t3_10viepd",
            "score": 0,
            "created_utc": 1675741197.0,
            "replies": []
        },
        {
            "body": "Great story! Wow... I hope the restaurant wasn't far!",
            "author": "everesr1954",
            "id": "j7jju54",
            "parent_id": "t3_10viepd",
            "score": 0,
            "created_utc": 1675751293.0,
            "replies": []
        },
        {
            "body": "At the restaurant I would have asked first is everything alright because being late and on the phone a lot suggest she is having to deal with something else.  We all have things crop up in our life that we have to deal with then and there so give her a chance if that is the case.  But either way it was obvious that her head was not in a place to move on to intimacy so would have dropped her off and maybe suggested another time.",
            "author": "Dazzling_Truth6472",
            "id": "j7k1tnr",
            "parent_id": "t3_10viepd",
            "score": 0,
            "created_utc": 1675766205.0,
            "replies": []
        },
        {
            "body": "Well you want intimacy but not PPM, because if not you’d feel like a John!",
            "author": "DaSugar2020",
            "id": "j7kiqwj",
            "parent_id": "t3_10viepd",
            "score": 0,
            "created_utc": 1675777290.0,
            "replies": []
        },
        {
            "body": "Once had a similar conversation with a lady from seeking. We vibed well, talked about going somewhere nice to eat. She asked if I was fine with platonic only and I was like \"Initially yes\". So we start talking, daily, making plans, that early part of the SR. Then we mentioned that how many platonic dates does she normally do before things \"heat up\". She said \"What\" so I explained in a relationship most people end up sleeping together. I will never forget the text message back \"Well, I am Shocked!\". I was like, wtf. She was like \"You said platonic\" and I was like \"Yeah, initiaily, until we get to know each other\".\n\nWe never did ever meet up in the end....",
            "author": "C12H22O11-EU",
            "id": "j7krh59",
            "parent_id": "t3_10viepd",
            "score": 0,
            "created_utc": 1675781333.0,
            "replies": []
        },
        {
            "body": "Shes right you know. Too many of you men only want sex for money that is prostitution. Obviously she shouldn’t drag it on but you paying for at-least 3 platonic dates shouldn’t be an issue.",
            "author": "VExistence",
            "id": "j7jk7cs",
            "parent_id": "t3_10viepd",
            "score": -2,
            "created_utc": 1675751560.0,
            "replies": [
                {
                    "body": ">but you paying for at-least 3 platonic dates shouldn’t be an issue.\n\nI'm sure it wouldn't be an issue if both parties agreed to it.\n\nYou go to buy a car, expecting to drive it off the lot.  You're signing the papers, and in the middle of signing, the saleguy says \"You know, I might NOT want to sell you this car, but you can pay me for it anyway while I make up my mind to give you the keys\"",
                    "author": "Veioviz",
                    "id": "j7m0f5z",
                    "parent_id": "t1_j7jk7cs",
                    "score": 2,
                    "created_utc": 1675799108.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Your kind I would of told her to get an Uber.",
            "author": "vincenzo-101",
            "id": "j7ido5u",
            "parent_id": "t3_10viepd",
            "score": -1,
            "created_utc": 1675729704.0,
            "replies": []
        },
        {
            "body": "If it was me, I would have pull over to the side of road, told her to step out of the car for a minute so I could make a private call and have her close the door as she exit. Once she done that, I would have lock the door and then drove off leaving her behind.",
            "author": "Sam_TrollSlayer",
            "id": "j7ii3q9",
            "parent_id": "t3_10viepd",
            "score": -5,
            "created_utc": 1675731669.0,
            "replies": [
                {
                    "body": "Wow. So you’d leave a girl stranded on the side of the road because she changed her mind about having sex? She left civilly, after seeing that they weren’t on the same page. You act like she put a gun to his head or something.",
                    "author": "Desperate_timess",
                    "id": "j7jfffq",
                    "parent_id": "t1_j7ii3q9",
                    "score": 3,
                    "created_utc": 1675748295.0,
                    "replies": [
                        {
                            "body": "Actually it more sounded like she tried to guilt him into paying anyway...... hardly sounds civil.....\n\nThe world needs consequences for bullshit shady behavior.....  I wouldn't leave her stranded on the side of the road, more likely in a well-lit gas station or something...",
                            "author": "Veioviz",
                            "id": "j7m4n5d",
                            "parent_id": "t1_j7jfffq",
                            "score": 1,
                            "created_utc": 1675800722.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Eh I can see her side too. Yeah she was late, but it sounds like it took her great effort to get there (her friend drove) and you live so close to the meeting spot you could even chill at home to wait. So you spent hours with her/ 2 dates that were convenient for you (low investment) and expected her to be ready to sleep with you….",
            "author": "12121throwaway12",
            "id": "j7och9n",
            "parent_id": "t3_10viepd",
            "score": 1,
            "created_utc": 1675836505.0,
            "replies": [
                {
                    "body": "100% agree",
                    "author": "Substantial_Cream231",
                    "id": "j7xhmt9",
                    "parent_id": "t1_j7och9n",
                    "score": 2,
                    "created_utc": 1675996000.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "From the dinner phone-checking, sounds like she double booked herself for the evening. Maybe had another SD who she wanted more, or was paying her more, and wanted to save herself for him later that night. \n\nFigured she could make off with two allowances before going to bed.",
            "author": "ItsSlinky2x",
            "id": "j7z3dmm",
            "parent_id": "t3_10viepd",
            "score": 1,
            "created_utc": 1676034062.0,
            "replies": []
        },
        {
            "body": "Likely she was aaking advice from her friend about how to play him. \"He hasnt paid me yet, what do I say?\"",
            "author": "Upper-District-50",
            "id": "j7ht7oc",
            "parent_id": "t1_j7hqj67",
            "score": 47,
            "created_utc": 1675721256.0,
            "replies": [
                {
                    "body": "Yup. He was not acting just like the tiktok girls said he would !!",
                    "author": "southernslick",
                    "id": "j7i66ga",
                    "parent_id": "t1_j7ht7oc",
                    "score": 44,
                    "created_utc": 1675726483.0,
                    "replies": [
                        {
                            "body": "This, rofl!",
                            "author": "SDInLeather",
                            "id": "j7k734n",
                            "parent_id": "t1_j7i66ga",
                            "score": 0,
                            "created_utc": 1675770345.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": ">I would have nexted her right there.\n\nI think that's reasonable, if you think the objective is to have a relationship with the person then they should be interesting and interested. \n\nOP seemed undeterred in his willingness to give her money and have sex with her tho. I don't think this paints him in the favorable light that he thinks it does.",
            "author": "NoLimitLexa",
            "id": "j7hvp1n",
            "parent_id": "t1_j7hqj67",
            "score": 26,
            "created_utc": 1675722239.0,
            "replies": [
                {
                    "body": "That's true! Inviting her back after that??",
                    "author": "Azurecole",
                    "id": "j7hzswm",
                    "parent_id": "t1_j7hvp1n",
                    "score": 7,
                    "created_utc": 1675723875.0,
                    "replies": [
                        {
                            "body": "In a small market with very few options, one has to deal with some amount of bad behavior, it seems, to even get out the gate. \n\nI'd love to be in a bigger market where I could next after borderline rude behavior, but that'd run me out of any POTs pretty quick.",
                            "author": "Worldly-wanderer",
                            "id": "j7ibfit",
                            "parent_id": "t1_j7hzswm",
                            "score": 9,
                            "created_utc": 1675728723.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "j7izb8h",
                                    "parent_id": "t1_j7ibfit",
                                    "score": 10,
                                    "created_utc": 1675739671.0,
                                    "replies": [
                                        {
                                            "body": "I disagree, I think coffee is plenty for an initial meet n greet to see if yall vibe. If I were an SD, I wouldn't want to be paying a bunch of money for a nice dinner or whatever to then find out they suck like this girl does^^^^ I honestly hate the perspective that some women have on the site that they just get to get paid to go out to dinner/spend time whatever. Like no, the rest of us have had to put in work to make that money this is no easy life honey. I think the sugar life is glorified in media nowadays (thinking specifically female rappers). When people don't actually know what it takes. I wonder how young the girl was that OP went on a date with. If I had to guess she would be 18-20 w no experience on the site.",
                                            "author": "Elephantananda222",
                                            "id": "j7j8hj7",
                                            "parent_id": "t1_j7izb8h",
                                            "score": 5,
                                            "created_utc": 1675744246.0,
                                            "replies": [
                                                {
                                                    "body": "This is the type of response I admire! Most just think it’s one sided and take advantage. It should be beneficial for both sides. I unfortunately, am romantic type so it gets to the point I’m not sure if person likes me or my money.",
                                                    "author": "dynolas1",
                                                    "id": "j7ks4n3",
                                                    "parent_id": "t1_j7j8hj7",
                                                    "score": -4,
                                                    "created_utc": 1675781619.0,
                                                    "replies": []
                                                },
                                                {
                                                    "body": "Quality response here. Certainly agree that his prospective SB was seeking to be on his payroll for little to no effort of establishing connection on her part even going back on their word to entertain intimacy on the next date.",
                                                    "author": "Outrageous_Bat8429",
                                                    "id": "j7l9t3c",
                                                    "parent_id": "t1_j7j8hj7",
                                                    "score": 1,
                                                    "created_utc": 1675788786.0,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "body": "Might depend on how you fish. I exclusively M&G at coffee. I pride myself at being a decent and humorous conversationalist, a lot of the SB's are like \"is that so soon?\" when I remind them it has been 30 minutes, which is all I ask of their time, though frequently we have gone well over that. If those are bottom feeders, bring on more catfish, says I, because they have been wonders.",
                                            "author": "SDInLeather",
                                            "id": "j7k7h69",
                                            "parent_id": "t1_j7izb8h",
                                            "score": -3,
                                            "created_utc": 1675770619.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "I get that.  I've put up with things that I normally wouldn't if everything else is a green light, and I'm not even in a small market.  But I do take signs of distraction seriously, more difficult to overlook than, say, being late",
                                    "author": "Azurecole",
                                    "id": "j7ibvf9",
                                    "parent_id": "t1_j7ibfit",
                                    "score": 5,
                                    "created_utc": 1675728917.0,
                                    "replies": []
                                },
                                {
                                    "body": "Scarcity thinking versus abundance thinking will keep you trapped.",
                                    "author": "Dwight_Manfredi775",
                                    "id": "j9y3m8x",
                                    "parent_id": "t1_j7ibfit",
                                    "score": 1,
                                    "created_utc": 1677326871.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "I think he was pretty reasonable",
                    "author": "throwawayrtyggv",
                    "id": "j7ijc81",
                    "parent_id": "t1_j7hvp1n",
                    "score": 4,
                    "created_utc": 1675732239.0,
                    "replies": []
                },
                {
                    "body": "I think he handled it well.  He didn't pull the plug prematurely and he didn't let himself get taken advantage of.",
                    "author": "throwaway48453",
                    "id": "j7jedyq",
                    "parent_id": "t1_j7hvp1n",
                    "score": 1,
                    "created_utc": 1675747642.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Absolutely. There is no opportunity for a second chance. Looking at your phone when you are out with someone, first time or not, is extremely disrespectful. This applies to both SB's and SD's.",
            "author": "dieselandasphalt",
            "id": "j7ialhj",
            "parent_id": "t1_j7hqj67",
            "score": 2,
            "created_utc": 1675728366.0,
            "replies": []
        },
        {
            "body": "You didn’t ghost and run off with the money… because you’re an SB.  The issue is that there are many women who would run off with the money for every SB.",
            "author": "DarthDaddius",
            "id": "j827wrx",
            "parent_id": "t1_j7hy2e3",
            "score": 2,
            "created_utc": 1676081139.0,
            "replies": []
        },
        {
            "body": "What would be your reply if we reverse the genders while keeping the same scenario? SD wants to have sex but will spoil/will provide financial assistance when he feels comfortable otherwise he thinks he is being treated like an ATM?",
            "author": null,
            "id": "j7ntaz5",
            "parent_id": "t1_j7hy2e3",
            "score": 2,
            "created_utc": 1675826200.0,
            "replies": [
                {
                    "body": "I’m curious if you read my follow up comment. I practically addressed that already. There’s plenty of men on sugar sites who already try that. They claim they “don’t want it to feel transactional”. People are free to do whichever they feel comfortable with first, but both people risk being scammed. Anytime you invest in anything.. could be a new career, friendships, relationships, stocks, etc.",
                    "author": "noneya3333",
                    "id": "j7nu5yz",
                    "parent_id": "t1_j7ntaz5",
                    "score": 3,
                    "created_utc": 1675826599.0,
                    "replies": [
                        {
                            "body": "I would say you are wrong saying SBs are more vulnerable, but it doesn't negate the fact that SDs can also be extorted/blackmailed because they have much to lose.\nJust few examples\n\nhttps://abcnews.go.com/Business/AheadoftheCurve/story?id=7578033&amp;page=1\n\nhttps://www.charlotteobserver.com/news/local/crime/article235521757.html\n\nhttps://www.dailymail.co.uk/news/article-8594687/amp/Sugar-baby-threatens-tell-fathers-family-raunchy-relationship-unless-pays-5-000.html&ved=2ahUKEwjB0dr6hoX9AhWETGwGHWJzBpgQFnoECCoQAQ&usg=AOvVaw086GrEOOqQct8c1SJLbgF3\n\nJust because the men who were extorted/blackmailed doesn't come crying to this sub reddit doesn't imply that extortion/blackmailing doesn't exist. There is danger to both sides of the bowl regardless of where you stand. Its upto you how you vet the other person, whom you are gonna engage with.\n\nSugar relationships are always to be mutually beneficial to both the parties equally, the established member fulfills the financial implications of the relationship while the attractive member provides company which includes intimacy.\n\nSpeaking for OPs case, the girl was straight up rinser because she wants only her benefit. OP was right because he gave her the chance to go on enough platonic dates before arrangement commence but she expects ppm without any intimacy.",
                            "author": null,
                            "id": "j7o2cle",
                            "parent_id": "t1_j7nu5yz",
                            "score": -1,
                            "created_utc": 1675830650.0,
                            "replies": [
                                {
                                    "body": "Please quote where I said “SBs are more vulnerable”. I didn’t bother reading or clicking the links because I never made that statement in the first place. I’m sure the link is useful, but not relevant right now. (I’m fully aware blackmail exists, but that’s almost a separate topic from the original post.) We’re discussing both parties fear of being strung along, or stiffed. I stated in more ways than one, that arrangements take compromise and potential loss from *both* parties. I’m not understanding what part you’re trying to rebut or disagree with? I also agree with you, & stated in my original comment that the girl in OP’s post (and any girl that expects, asks, or demands prematurely) is probably a scammer.",
                                    "author": "noneya3333",
                                    "id": "j7o3p2o",
                                    "parent_id": "t1_j7o2cle",
                                    "score": 3,
                                    "created_utc": 1675831375.0,
                                    "replies": [
                                        {
                                            "body": "You never said that but it was implied (supposedly) by your first statement \"There are countless.....\". Since you have said that you statement never meant to show how vulnerable SBs are so I think we are good now (hopefully).\nLooks like we are almost probably on the same page just with different voices.",
                                            "author": null,
                                            "id": "j7o6noi",
                                            "parent_id": "t1_j7o3p2o",
                                            "score": 0,
                                            "created_utc": 1675832947.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "It looks like you shared some AMP links. These should load faster, but AMP is controversial because of [concerns over privacy and the Open Web](https://www.reddit.com/r/AmputatorBot/comments/ehrq3z/why_did_i_build_amputatorbot).\n\nMaybe check out **the canonical pages** instead: \n\n- **[https://abcnews.go.com/Business/AheadoftheCurve/story?id=7578033&page=1](https://abcnews.go.com/Business/AheadoftheCurve/story?id=7578033&page=1)**\n\n- **[https://www.dailymail.co.uk/news/article-8594687/Sugar-baby-threatens-tell-fathers-family-raunchy-relationship-unless-pays-5-000.html](https://www.dailymail.co.uk/news/article-8594687/Sugar-baby-threatens-tell-fathers-family-raunchy-relationship-unless-pays-5-000.html)**\n\n*****\n\n ^(I'm a bot | )[^(Why & About)](https://www.reddit.com/r/AmputatorBot/comments/ehrq3z/why_did_i_build_amputatorbot)^( | )[^(Summon: u/AmputatorBot)](https://www.reddit.com/r/AmputatorBot/comments/cchly3/you_can_now_summon_amputatorbot/)",
                                    "author": "AmputatorBot",
                                    "id": "j7o2dkr",
                                    "parent_id": "t1_j7o2cle",
                                    "score": 1,
                                    "created_utc": 1675830665.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "j7l1ntt",
            "parent_id": "t1_j7hy2e3",
            "score": 2,
            "created_utc": 1675785565.0,
            "replies": [
                {
                    "body": "I disagree. You should read the countless posts on this forum full of women taking a loss by getting scammed, or pump and dumped. The 2 craziest posts I remember from a few months back 1) SB met up with a pot, he persuaded her to get into his car, then he robbed her at knifepoint. 2) SB was missing all her own cash AND the ppm after she got intimate in a hotel with her pot. She briefly left her purse unattended to use the bathroom before going home. She didn’t realize he robbed her until she was halfway home and had to stop for gas. \n\nMen are not the only ones have to invest, or take losses. Lots of other women get shorted on the agreed amount, or get absolutely nothing after trusting their SD and giving him sex first.",
                    "author": "noneya3333",
                    "id": "j7l5j8j",
                    "parent_id": "t1_j7l1ntt",
                    "score": 16,
                    "created_utc": 1675787110.0,
                    "replies": [
                        {
                            "body": "All of these are things that could 99% of the time be avoided by being smart about what you’re doing. I haven’t heard of any stories of SBs getting out at knifepoint when they’re already in the the hotel room. Meet somewhere public, vet accordingly, if you aren’t comfortable go on public dates with no intimacy until you are, don’t get in a car alone and don’t go anywhere alone.\n\nThis is common sense. Just use common sense and the risk is incredibly low.",
                            "author": "atxsuda",
                            "id": "j7pg9zx",
                            "parent_id": "t1_j7l5j8j",
                            "score": 1,
                            "created_utc": 1675865074.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "And she’s not a sugar baby, she’s either a scammer or a sex worker that doesn’t wanna have sex because basically she was treating it like a job",
            "author": "NickPfromYuma",
            "id": "j7ig0x3",
            "parent_id": "t1_j7i58zr",
            "score": 0,
            "created_utc": 1675730741.0,
            "replies": [
                {
                    "body": "This comment regarding sex workers is confusing to me. Wouldn't a sex worker be just fine having sex if her SD/client pays an agreed upon PPM? \n\nBlaming a SB-wannabe who will not have sex for being a sex worker is the equivalent of high schoolers who call the girl who will not sleep with them a whore.",
                    "author": "geeky-sd",
                    "id": "j7k8aqd",
                    "parent_id": "t1_j7ig0x3",
                    "score": 8,
                    "created_utc": 1675771184.0,
                    "replies": [
                        {
                            "body": "These are clearly the same guys who would cat-call a woman and when she doesn’t respond favorably they neg her 🤡",
                            "author": "SparklingScorpio",
                            "id": "j7m9kxe",
                            "parent_id": "t1_j7k8aqd",
                            "score": 5,
                            "created_utc": 1675802609.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Even more ironically she wasn't giving him any time, by being late and on her phone the entire time.",
            "author": "NinCarolina",
            "id": "j7i5yv8",
            "parent_id": "t1_j7hqq6s",
            "score": 8,
            "created_utc": 1675726393.0,
            "replies": []
        },
        {
            "body": "Well said.",
            "author": "SDInLeather",
            "id": "j7k7r56",
            "parent_id": "t1_j7hqq6s",
            "score": -1,
            "created_utc": 1675770809.0,
            "replies": []
        },
        {
            "body": "You are paying for the escorts time too technically too and per hour. The sex happens cuz they want to keep you coming back for more since others will offer something more with their time as well. \nYou just aren't a simp. An easy target.  Yeah so you didn't want to pay for platonic to infinity, if you said yes the bext date would be the same too.",
            "author": "Federal_Garage_4307",
            "id": "j7imqzs",
            "parent_id": "t1_j7htx2e",
            "score": 4,
            "created_utc": 1675733863.0,
            "replies": [
                {
                    "body": "I know. What’s that Charlie sheen quote again?",
                    "author": "UnearthlyDinosaur",
                    "id": "j7imy96",
                    "parent_id": "t1_j7imqzs",
                    "score": 0,
                    "created_utc": 1675733958.0,
                    "replies": [
                        {
                            "body": "He has had so many words of drug fueled wisdom",
                            "author": "Federal_Garage_4307",
                            "id": "j7invli",
                            "parent_id": "t1_j7imy96",
                            "score": 1,
                            "created_utc": 1675734400.0,
                            "replies": []
                        },
                        {
                            "body": "didn't originate with him, but he is the most recent famous user of it:\n\n\"I don't pay women for sex. I pay women to go away after sex.\"",
                            "author": "joc13",
                            "id": "j7j37nz",
                            "parent_id": "t1_j7imy96",
                            "score": 1,
                            "created_utc": 1675741527.0,
                            "replies": [
                                {
                                    "body": "👍👍😁😁",
                                    "author": "UnearthlyDinosaur",
                                    "id": "j7j91lg",
                                    "parent_id": "t1_j7j37nz",
                                    "score": -2,
                                    "created_utc": 1675744550.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Having sex doesn’t make her a prostitute. People have sex all the time without feeling like a prostitute. \n\nActually, the financial part of this makes her feels like a prostitute. Wouldn’t it be a better idea to say no to the money instead 🤷‍♂️",
            "author": "geekxp",
            "id": "j7iwczu",
            "parent_id": "t1_j7hm1td",
            "score": 1,
            "created_utc": 1675738306.0,
            "replies": [
                {
                    "body": "True But sex with old men or men in general isn’t fulfilling for women without anything to gain 😂",
                    "author": "Nefarious_evee",
                    "id": "j7k0u0a",
                    "parent_id": "t1_j7iwczu",
                    "score": 2,
                    "created_utc": 1675765341.0,
                    "replies": []
                },
                {
                    "body": ">Wouldn’t it be a better idea to say NO to the money instead 🤷‍♂️\n\nfixed that for you",
                    "author": "joc13",
                    "id": "j7j1iv4",
                    "parent_id": "t1_j7iwczu",
                    "score": -2,
                    "created_utc": 1675740704.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Well, he doesn’t come off like a SD, that’s for sure. He’s pretty borderline.",
            "author": "Weary-Friendship-164",
            "id": "j7i3if3",
            "parent_id": "t1_j7hm1td",
            "score": -10,
            "created_utc": 1675725381.0,
            "replies": [
                {
                    "body": "From everything he explained so far,  he sounds like a perfectly wonderful SD.\n\nAs many platonic dates/dinners as I need to feel comfortable? That's quite lovely and MORE than fair.\n\nPeople need to stop treating the SBs like weak little flowers that have to be protected. We just want to be treated fairly and with respect. OP was doing that and more.",
                    "author": "gamergainzgal",
                    "id": "j7jbem6",
                    "parent_id": "t1_j7i3if3",
                    "score": 8,
                    "created_utc": 1675745865.0,
                    "replies": []
                },
                {
                    "body": "Cause he doesn’t pay for platonic dates? Yeah ok bud",
                    "author": "UnearthlyDinosaur",
                    "id": "j7ib70i",
                    "parent_id": "t1_j7i3if3",
                    "score": 7,
                    "created_utc": 1675728620.0,
                    "replies": []
                },
                {
                    "body": "What makes you say that?",
                    "author": "xyz553",
                    "id": "j7i44r8",
                    "parent_id": "t1_j7i3if3",
                    "score": 2,
                    "created_utc": 1675725634.0,
                    "replies": []
                },
                {
                    "body": "Oh bullshit? Why?",
                    "author": "throwawayrtyggv",
                    "id": "j7ik0h7",
                    "parent_id": "t1_j7i3if3",
                    "score": 0,
                    "created_utc": 1675732554.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I’m honestly shocked the rinser went as far as going back to his plavr",
            "author": "throwawayrtyggv",
            "id": "j7ijymt",
            "parent_id": "t1_j7i3udw",
            "score": 2,
            "created_utc": 1675732530.0,
            "replies": [
                {
                    "body": "Yeah, she didn’t seem to know what she was doing. She had a rough idea, but the execution sucked out loud.",
                    "author": "MsGinathaheaux",
                    "id": "j7irlk0",
                    "parent_id": "t1_j7ijymt",
                    "score": 3,
                    "created_utc": 1675736126.0,
                    "replies": []
                }
            ]
        },
        {
            "body": ">That's not mutually beneficial.\n\nbut her presence in near proximity to you is valuable 🤦\n\nher conversation skills are so riveting and entertaining they are obviously worth as much as a good Broadway ticket or a good seat at a ballgame 🤦🤦\n\n>If you are saying that you NOT willing to go on more dates with me without being paid, that means YOU are treating our interaction like prostitution!\n\nyep, cause as someone that used to build websites for independent escorts, I can tell you the sentences \"Any payment provided is solely for my time. Anything else that happens is simply a choice between two *consenting* adults.\" (or similar) were always prominently included on them.\n\nedit: added an important word I left out",
            "author": "joc13",
            "id": "j7j2lve",
            "parent_id": "t1_j7hpwf8",
            "score": 4,
            "created_utc": 1675741225.0,
            "replies": [
                {
                    "body": "That's funny you used to do that lmaooo",
                    "author": "Elephantananda222",
                    "id": "j7j96r3",
                    "parent_id": "t1_j7j2lve",
                    "score": 0,
                    "created_utc": 1675744627.0,
                    "replies": []
                },
                {
                    "body": "Between two consenting adults…",
                    "author": "This_Relation2262",
                    "id": "j7jfbgu",
                    "parent_id": "t1_j7j2lve",
                    "score": 0,
                    "created_utc": 1675748226.0,
                    "replies": [
                        {
                            "body": "LOL. I knew I should have just copy/pasted off an old web site. fixed it.\n\nthanks",
                            "author": "joc13",
                            "id": "j7k4pdp",
                            "parent_id": "t1_j7jfbgu",
                            "score": 2,
                            "created_utc": 1675768581.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Yup. Exactly. Very good point.",
            "author": "Worldly-wanderer",
            "id": "j7hq92o",
            "parent_id": "t1_j7hpwf8",
            "score": 2,
            "created_utc": 1675720119.0,
            "replies": []
        },
        {
            "body": "Well stated and in the spirit of what a sugar relationship is, IMO.  Financial support (not payment, and definitely not payment for time) comes with an actual sugar relationship.  Ideally, it's something he *wants* to do for her, because he wants her happy (though admittedly, as the SR starts, this feeling needs time to build).  They are not, however, in an SR while she is still sorting out her comfort and feelings, which is that these types pretend to miss or don't care about (slf is relationship-forward;  but price-forward types ignore that there's no relationship or SR yet).  There's no basis for any allowance expectations whatsoever, while they're going on dates so she can decide whether he's the SD for her; he should, though, be doing the full court press to win her over, if he likes her.\n\nAnd there's no basis for these escort accusations when there's no SR. They're in an ongoing SR and he refuses support for platonic dates?  Different topic -- this time they're definitely IN an SR already.",
            "author": "Azurecole",
            "id": "j7jfyli",
            "parent_id": "t1_j7j9kob",
            "score": 2,
            "created_utc": 1675748640.0,
            "replies": []
        },
        {
            "body": "Excellent script!",
            "author": "Insatiable_Learner",
            "id": "j7jh5lb",
            "parent_id": "t1_j7j9kob",
            "score": 0,
            "created_utc": 1675749423.0,
            "replies": [
                {
                    "body": "Thanks!",
                    "author": "gamergainzgal",
                    "id": "j7lwbsd",
                    "parent_id": "t1_j7jh5lb",
                    "score": 1,
                    "created_utc": 1675797527.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I don't see she was a nut job, sorry 🙏. She was young and new to it. She thought she could but when it came to it she couldn't. She was embarrassed and scared and didn't know how to handle it (not scared of you; of what she was doing). \n\nShe was lucky you handled it like a gentleman, some wouldn't have and that would have been part of what scared her, she might have felt trapped by that realisation.\n\nI'm your age 'ish. I know that it's a leap for 20 something to have sex with a guy my age. First time isnt going to be easy however brave she seems.\n\nShe was young and in over her head. You can forgive her that? 🙏",
            "author": "Sunhillian",
            "id": "j7ioy4d",
            "parent_id": "t1_j7i7gwk",
            "score": 16,
            "created_utc": 1675734902.0,
            "replies": [
                {
                    "body": "Yes, you're right....One of the reasons I felt so horrible was putting myself in her shoes...I hold nothing against her...retelling the story here, I remember being worried she would scream rape or something...Another time I took a long break from SA",
                    "author": "surfrat54",
                    "id": "j7iqyqz",
                    "parent_id": "t1_j7ioy4d",
                    "score": 4,
                    "created_utc": 1675735832.0,
                    "replies": [
                        {
                            "body": "It's not easy getting older 🫣",
                            "author": "Sunhillian",
                            "id": "j7irrpz",
                            "parent_id": "t1_j7iqyqz",
                            "score": 2,
                            "created_utc": 1675736203.0,
                            "replies": [
                                {
                                    "body": "You can say that again… there’s an expression I once heard.”If you’re lucky you get old”.",
                                    "author": "surfrat54",
                                    "id": "j7j5wpe",
                                    "parent_id": "t1_j7irrpz",
                                    "score": 2,
                                    "created_utc": 1675742881.0,
                                    "replies": [
                                        {
                                            "body": "Well that's true, I neve heard that before. Puts a whole new positive spin on it 🤣🤣",
                                            "author": "Sunhillian",
                                            "id": "j7j62u1",
                                            "parent_id": "t1_j7j5wpe",
                                            "score": 1,
                                            "created_utc": 1675742967.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Oh my god, I feel bad for you .-.That was humiliating :(( You handled it like a gentleman despite that.",
            "author": "Emotional_Set5737",
            "id": "j7l9xb7",
            "parent_id": "t1_j7i7gwk",
            "score": 0,
            "created_utc": 1675788830.0,
            "replies": []
        },
        {
            "body": "You shouldn’t have sex on the first meet n greet! Especially if you jot paying her for it",
            "author": "Nefarious_evee",
            "id": "j7k1hyl",
            "parent_id": "t1_j7hnj7i",
            "score": 1,
            "created_utc": 1675765924.0,
            "replies": []
        },
        {
            "body": "This questions is ridiculous :\n\nA sugar baby = a friend and LOVER \n\nIf I just wanted a friend I would be in friendfinder website \n\nIf all I wanted was only sex I would probably go to a sex worker \n\nYou need to be both ( friend and lover ) to me for me to give you ppm/allowance \n\nI am ok with 1 or 2 platonic dates ( and taking you to nice dinners ) but if you think I will hand over ppm before we decide to become both friends and lovers then obviously you think there is a lack of ENTERTAINMENT in my life and that is not true in any form or way",
            "author": "shamloo77",
            "id": "j7icgc0",
            "parent_id": "t1_j7hue4d",
            "score": 11,
            "created_utc": 1675729172.0,
            "replies": []
        },
        {
            "body": "I'm a SD and I agree.  I've probably started the most natural sugar relationship I've had in years, and it started when I took a leap and skipped PPM and went straight to allowance.  Started the first month in two payments, but beyond that it never went through a transactional phase.\n\nShe felt free to do what she wanted, and it ended up being sex multiple times on our longer date. Sure I'll get rinsed one day on another girl, but I'll trust my gut.",
            "author": "whataatrip",
            "id": "j7j8nuc",
            "parent_id": "t1_j7hue4d",
            "score": 5,
            "created_utc": 1675744343.0,
            "replies": [
                {
                    "body": "You are a true SD and bless you 👏🏾 when you take care of a women, a women will take care of you. We put time and effort into how we look just to meet you. Only paying us for sex, especially for PPM, makes it feel degrading and cheap. That is an escort, and trust that they get paid that amount for the HOUR and acts. We’d be making less. There are much better SD/SB subreddits and I feel like most the active users on here I would have vetted out just from the stinginess to not show proper masc/feminine etiquette or make me feel like they are a safe provider so that I could let down my hair and actually enjoy time with them.",
                    "author": "cococatrina",
                    "id": "j7jce7f",
                    "parent_id": "t1_j7j8nuc",
                    "score": 5,
                    "created_utc": 1675746435.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "She was late without a heads up and spent the entire \"date\" on her phone. She's treating herself like a prostitute, not someone on a date.",
            "author": "NinCarolina",
            "id": "j7i5qyx",
            "parent_id": "t1_j7hue4d",
            "score": 4,
            "created_utc": 1675726302.0,
            "replies": [
                {
                    "body": "He’s treating her like a prostitute for only paying her when he gets sex in return, like you know, prostitution. Checking her phone doesn’t make her a sex worker, that’s just a little rude. This arrangement does.",
                    "author": "sassydegrassii",
                    "id": "j7i6icc",
                    "parent_id": "t1_j7i5qyx",
                    "score": -1,
                    "created_utc": 1675726620.0,
                    "replies": [
                        {
                            "body": "Having sex with someone does not make you a prostitute. \n\nCharging someone \"for your time\" during which you are clearly not interested in them makes you a prostitute.",
                            "author": "NinCarolina",
                            "id": "j7i7i0u",
                            "parent_id": "t1_j7i6icc",
                            "score": 5,
                            "created_utc": 1675727041.0,
                            "replies": [
                                {
                                    "body": "Having sex for money makes you a sex worker, paying under those conditions makes you a client",
                                    "author": "sassydegrassii",
                                    "id": "j7j6zel",
                                    "parent_id": "t1_j7i7i0u",
                                    "score": 1,
                                    "created_utc": 1675743446.0,
                                    "replies": [
                                        {
                                            "body": "And if you take money from someone under the pretense of having sex with them and then refuse to have sex with them, that makes you even worse.",
                                            "author": "NinCarolina",
                                            "id": "j7j8gh4",
                                            "parent_id": "t1_j7j6zel",
                                            "score": 0,
                                            "created_utc": 1675744230.0,
                                            "replies": [
                                                {
                                                    "body": "It’s not about being worse, it’s just calling a spade a spade",
                                                    "author": "sassydegrassii",
                                                    "id": "j7jd2dd",
                                                    "parent_id": "t1_j7j8gh4",
                                                    "score": 1,
                                                    "created_utc": 1675746830.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Like the pro she is. why would she not feel like what she actually is? why delude oneself?",
            "author": "JeaneyBowl",
            "id": "j7i1b2h",
            "parent_id": "t1_j7hue4d",
            "score": 2,
            "created_utc": 1675724477.0,
            "replies": [
                {
                    "body": "anyone that thinks SR’s are NOT a form of SW is delusional, that’s the point. They’re a kind of sex work that often requires way more emotional labour for less money because y’all will do anything to avoid accepting that you’re engaging in sex work",
                    "author": "sassydegrassii",
                    "id": "j7i7a5f",
                    "parent_id": "t1_j7i1b2h",
                    "score": 10,
                    "created_utc": 1675726948.0,
                    "replies": [
                        {
                            "body": "Why are you here?",
                            "author": "throwawayrtyggv",
                            "id": "j7ikc3s",
                            "parent_id": "t1_j7i7a5f",
                            "score": 4,
                            "created_utc": 1675732705.0,
                            "replies": [
                                {
                                    "body": "unfortunately, it’s relevant to me",
                                    "author": "sassydegrassii",
                                    "id": "j7j7bo8",
                                    "parent_id": "t1_j7ikc3s",
                                    "score": 0,
                                    "created_utc": 1675743627.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "I tend to agree w you. Nobody wants to look at the fact that this is sex work. And it requires SEX AND MONEY HAHAHA",
                            "author": "Elephantananda222",
                            "id": "j7j9dfs",
                            "parent_id": "t1_j7i7a5f",
                            "score": 1,
                            "created_utc": 1675744727.0,
                            "replies": []
                        },
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "j7jcjw2",
                            "parent_id": "t1_j7i7a5f",
                            "score": -4,
                            "created_utc": 1675746527.0,
                            "replies": [
                                {
                                    "body": "If you pay only for sexual visits, you’re a John. It goes both ways. I don’t care if you’re insulted by that. Sex work isn’t a bad thing.  This is a matter of the whorearchy/whorephobia.",
                                    "author": "sassydegrassii",
                                    "id": "j7jd7g4",
                                    "parent_id": "t1_j7jcjw2",
                                    "score": 1,
                                    "created_utc": 1675746918.0,
                                    "replies": [
                                        {
                                            "body": "[deleted]",
                                            "author": null,
                                            "id": "j7jex9r",
                                            "parent_id": "t1_j7jd7g4",
                                            "score": -1,
                                            "created_utc": 1675747975.0,
                                            "replies": [
                                                {
                                                    "body": "I have multiple boards because I’m a sex worker of multiple practices. you don’t have to be high class to be into sugar, it’s proven in here every day",
                                                    "author": "sassydegrassii",
                                                    "id": "j7jgr63",
                                                    "parent_id": "t1_j7jex9r",
                                                    "score": 2,
                                                    "created_utc": 1675749154.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Fucking ridiculous response. Why do so many of you gaslight men for wanting the main component of a sugar relationship.",
            "author": "throwawayrtyggv",
            "id": "j7ik7mi",
            "parent_id": "t1_j7hue4d",
            "score": 1,
            "created_utc": 1675732648.0,
            "replies": [
                {
                    "body": "Why do so many of the men here gaslight women for wanting THE MAIN component of a sugar relationship?",
                    "author": "thehottubistoohawt",
                    "id": "j7ioxqj",
                    "parent_id": "t1_j7ik7mi",
                    "score": 13,
                    "created_utc": 1675734897.0,
                    "replies": [
                        {
                            "body": "I don't think that is true. there is no ground swell of men saying that women should have sex without receiving some benefit for being in that sexual relationship with someone.\n\nif anything, it seems to be perfectly clear that the majority here believe that both benefits should start at the same time. to the credit of many of the guys that post here, plenty will say that AFTER the sexual relationship has started, then occasional dates that don't include sex are fine and will receive the same benefits as any other dates.",
                            "author": "joc13",
                            "id": "j7j4475",
                            "parent_id": "t1_j7ioxqj",
                            "score": 2,
                            "created_utc": 1675741976.0,
                            "replies": []
                        },
                        {
                            "body": "And usually, when does a sugar relationship start?",
                            "author": "throwawayrtyggv",
                            "id": "j7iqusd",
                            "parent_id": "t1_j7ioxqj",
                            "score": 2,
                            "created_utc": 1675735781.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "What are sugar babies paid for ?",
            "author": "Elephantananda222",
            "id": "j7j91hl",
            "parent_id": "t1_j7ifryi",
            "score": 6,
            "created_utc": 1675744548.0,
            "replies": []
        },
        {
            "body": "I’m in the industry and think about producing that program that reality show all of the time.  I think it kills the whole anonymity thing, but perhaps you have an idea around that.",
            "author": "PracticePositive69",
            "id": "j7ijtgs",
            "parent_id": "t1_j7hpk4m",
            "score": 0,
            "created_utc": 1675732463.0,
            "replies": [
                {
                    "body": "You could do it in some variant of the bachelor. Between actually single 1-percenter who's not quite high profile and don't mind some TV notoriety and some aspiring model/bachelor that gets bankrolled by the program there's many ways to make it work.",
                    "author": "karmaextract",
                    "id": "j7jjhb9",
                    "parent_id": "t1_j7ijtgs",
                    "score": 0,
                    "created_utc": 1675751035.0,
                    "replies": [
                        {
                            "body": "Or I was thinking about the guy goes on three M&G’s and we follow him and see which one he chooses.  Sort of like House Hunters.  Working title  — Sugar Hunters.",
                            "author": "PracticePositive69",
                            "id": "j7laskr",
                            "parent_id": "t1_j7jjhb9",
                            "score": 1,
                            "created_utc": 1675789164.0,
                            "replies": [
                                {
                                    "body": "I think in that format you want to add some element of competition for the audience, say a model with no money vs SD, maybe throw in the average joe vanilla dater and see how their experiences compare, but also make sure its setup in a way that people actually understand how much bullshit men actually have to deal with.",
                                    "author": "karmaextract",
                                    "id": "j7ljos1",
                                    "parent_id": "t1_j7laskr",
                                    "score": 1,
                                    "created_utc": 1675792582.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": ">Once these TikTokToxics start saying \"that's what a prostitute does\" they are totally slut shaming the many women who enter and remain in the bowl willingly (a small number of whom I've had the pleasure of dating for an extended period of time).\n\nTrue, but that's not really the intent.  The intent here is to manipulate a man who is not her SD (and who she is telling clearly, she is not ready for him to be her SD yet) that he somehow owes her guaranteed payment for her to get to know him more, otherwise he's \"treating her like an escort\", which of course makes him a john.  The escort shaming is unfortunate collateral damage in the pursuit of profit, but she's going to use the tools she has.  The intent is focused on exactly one thing: getting a man who is not her SD, and she doesn't (yet) want to be her SD, to feel obligated and shamed into paying her as if this were an actual SR at this point.  Declining to \"pay\" a random woman who is not his SB, is not \"treating her like an escort\" 🤣🤣\n\nTerms used when men do this to women include \"emotional manipulation\" and \"gaslighting\".  The proSB and rinserverse goes crazy when I properly and accurately apply their terms back to them, but the shoe is fitting very well.",
            "author": "WynnDuppy",
            "id": "j7isgmk",
            "parent_id": "t1_j7ijy1r",
            "score": 8,
            "created_utc": 1675736524.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "j7vufhf",
            "parent_id": "t1_j7ijy1r",
            "score": 1,
            "created_utc": 1675971854.0,
            "replies": [
                {
                    "body": "I'm 10,000% certain you're correct. They have sex with the guy (often, most likely) but somehow it's important to portray themselves as \"just pretty to look at\" rather than admitting what they do.",
                    "author": "marker3000",
                    "id": "j81dv7p",
                    "parent_id": "t1_j7vufhf",
                    "score": 2,
                    "created_utc": 1676067695.0,
                    "replies": []
                }
            ]
        },
        {
            "body": ">*Ugh. That phone thing at dinner says volumes right there.*\n\nYes, completely rude\n\n>*Did you offer her a smaller amount for cuddling/kissing? I might have tried that.*\n\nReally? 🤦🏻‍♂️",
            "author": "Chill_SD1974",
            "id": "j7k8rr1",
            "parent_id": "t1_j7k71ef",
            "score": 1,
            "created_utc": 1675771512.0,
            "replies": [
                {
                    "body": "Yes, two reasons, 1. to eliminate that it was not just nervousness about being close that was her issue (i.e. that she was not actually a rinser) as some also mentioned, 2. I enjoy kissing and have many times sugared for that alone or as a gradual lead to intimacy process with an SB. I was not there though, obviously, only you were so you have a 1,001 personal intuitive experiences etc about her that I don't share.",
                    "author": "SDInLeather",
                    "id": "j7lidsl",
                    "parent_id": "t1_j7k8rr1",
                    "score": 2,
                    "created_utc": 1675792083.0,
                    "replies": [
                        {
                            "body": "Dude, I mean, I did not claim to be there but re-read the original post and read this woman’s attitude. 🤷🏻‍♂️ \n\nBecause offering a woman a little bit of money to kiss you is a sure way to increase her comfort level.  🤦🏻‍♂️x 100\n\nI’m imagining the Kissing Booth at an old time-y county fair \n\n[“Smooches 50 cents”](https://stepandrepeatla.com/shop/event-props/kissing-booth-rental/)",
                            "author": "Chill_SD1974",
                            "id": "j7lm1c9",
                            "parent_id": "t1_j7lidsl",
                            "score": 2,
                            "created_utc": 1675793507.0,
                            "replies": [
                                {
                                    "body": "Haha, well, I would like to see the old-timey country fair that had some of the kiss fests I've personally been involved in(some of which were honestly like \"only kissing\" and ended up being intimate on the couch), but I understand your point. And, btw, sorry, I did not look up and thought you were the OP, hence the \"being there\" component. IMO only someone who is sitting across from someone else can truly make an effective read on a situation, no matter how detailed the narrative.:)",
                                    "author": "SDInLeather",
                                    "id": "j7lx8ef",
                                    "parent_id": "t1_j7lm1c9",
                                    "score": 1,
                                    "created_utc": 1675797878.0,
                                    "replies": [
                                        {
                                            "body": "Not to worry, it’s often challenging to keep up with who is responding to what.",
                                            "author": "Chill_SD1974",
                                            "id": "j7m8umt",
                                            "parent_id": "t1_j7lx8ef",
                                            "score": 2,
                                            "created_utc": 1675802334.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "And agree, the overall flavor seems as if her attitude towards the whole thing was sucky.",
                                    "author": "SDInLeather",
                                    "id": "j7lxe6t",
                                    "parent_id": "t1_j7lm1c9",
                                    "score": 1,
                                    "created_utc": 1675797940.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I’d agree with you except I don’t think the TikTok-influenced women accept all the arrangement boundaries discussed in date 1 and then pull a 180° on the proposed intimate date. They “know their worth” from the get-go. \n\nShe has some kind of problem, I don’t know what, though.",
            "author": "Chill_SD1974",
            "id": "j7kkpzr",
            "parent_id": "t1_j7ivtpc",
            "score": 0,
            "created_utc": 1675778261.0,
            "replies": []
        },
        {
            "body": "Definitely not a scam. She has clearly been used in the past by another sugar daddy and didn’t want it happening again.",
            "author": "Substantial_Cream231",
            "id": "j7xkinl",
            "parent_id": "t1_j7hyorv",
            "score": 1,
            "created_utc": 1675997333.0,
            "replies": []
        },
        {
            "body": "Yes clearly discussed at M&G initial date, that date #2 would be dinner and then my place for intimacy. Then had ppm discussion and condom discussion with my offer of test results.",
            "author": "Worldly-wanderer",
            "id": "j7ia4uo",
            "parent_id": "t1_j7ht2vp",
            "score": 4,
            "created_utc": 1675728167.0,
            "replies": [
                {
                    "body": "Damn she sounds like a total rinser. Good for you for sticking to your guns.",
                    "author": "NewYorkSD",
                    "id": "j7icwf1",
                    "parent_id": "t1_j7ia4uo",
                    "score": 6,
                    "created_utc": 1675729365.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "This is the way to go. The best arrangements I've had were handled this way until I was comfortable enough to be intimate.",
            "author": "thehottubistoohawt",
            "id": "j7iphw4",
            "parent_id": "t1_j7i2pr9",
            "score": 3,
            "created_utc": 1675735157.0,
            "replies": [
                {
                    "body": "YES thank you! SBs should not settle for less because there are great SDs out there like you 💕💖🥰",
                    "author": "cococatrina",
                    "id": "j7jd5wd",
                    "parent_id": "t1_j7iphw4",
                    "score": 2,
                    "created_utc": 1675746891.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Maturity has nothing to do with it. Class, trust and mutual respect is something that should have been present.",
            "author": "Substantial_Cream231",
            "id": "j7xifld",
            "parent_id": "t1_j7kejzc",
            "score": 1,
            "created_utc": 1675996373.0,
            "replies": []
        },
        {
            "body": "Because she’s not just any woman. She’s a beautiful younger woman who’s out of your league. The definition of a Sugar baby.",
            "author": "Substantial_Cream231",
            "id": "j7xi9tt",
            "parent_id": "t1_j7j1yxh",
            "score": 1,
            "created_utc": 1675996299.0,
            "replies": [
                {
                    "body": "So sad!!",
                    "author": "sloan3140",
                    "id": "j8816oi",
                    "parent_id": "t1_j7xi9tt",
                    "score": 1,
                    "created_utc": 1676193881.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Another ridiculous take. She essentially said she wanted paid for a platonic date. She wanted the money, that’s why she went home with him. They did discuss intimacy in advance.",
            "author": "throwawayrtyggv",
            "id": "j7j2wor",
            "parent_id": "t1_j7ilfha",
            "score": 2,
            "created_utc": 1675741373.0,
            "replies": [
                {
                    "body": "Then she changed her mind, realized she didn’t want to have sex with him, and didn’t force herself to have sex in exchange for money. She realized she didn’t want to do sex work, and she left the situation. She didn’t blackmail the guy, try to force him to pay, or engage in any unethical behavior. She simply said “no,” and left.",
                    "author": "KetoSeaweed",
                    "id": "j7j58ye",
                    "parent_id": "t1_j7j2wor",
                    "score": 1,
                    "created_utc": 1675742546.0,
                    "replies": [
                        {
                            "body": ">She realized she didn’t want to do sex work, and she left the situation.\n\nYou forgot to mention the part where she still attempted to gaslight him into fulfilling his side of the agreement without her fulfilling hers.\n\nYou're making it sound amicable when that's not the case.  She's lucky she got a ride back to the train station after the attitude.",
                            "author": "Veioviz",
                            "id": "j7m00dn",
                            "parent_id": "t1_j7j58ye",
                            "score": 2,
                            "created_utc": 1675798952.0,
                            "replies": []
                        },
                        {
                            "body": "He also gets to consent on his choice of whether to open his wallet or not. He wasn’t feeling it, so he didn’t. Good for him. No man should ever feel coerced to pay a woman for her company.",
                            "author": "Dry_Dimension_4707",
                            "id": "j7jfz3d",
                            "parent_id": "t1_j7j58ye",
                            "score": 1,
                            "created_utc": 1675748648.0,
                            "replies": []
                        },
                        {
                            "body": "She still fucking asked to be paid and went to his house knowing full well what that likely meant.\nShe’s a scammer and multiple people are defending her. It’s disgusting",
                            "author": "throwawayrtyggv",
                            "id": "j7kc3oz",
                            "parent_id": "t1_j7j58ye",
                            "score": -2,
                            "created_utc": 1675773638.0,
                            "replies": [
                                {
                                    "body": "Nah, she’s just a woman who was probably in a desperate financial position, thought her only chance to get what she needed was to fuck for money, and then at the last minute realized she couldn’t go through with it. \n\nThat’s not being a scammer. That’s being in an awful position, then realizing that you really don’t want to have sex with somebody you have no interest in as a financial transaction, and clearly articulating that boundary.",
                                    "author": "KetoSeaweed",
                                    "id": "j7kjg8v",
                                    "parent_id": "t1_j7kc3oz",
                                    "score": 3,
                                    "created_utc": 1675777639.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "She didn’t have to ride back with him.\n\nIt is astonishing how often people on here defend this behavior",
            "author": "throwawayrtyggv",
            "id": "j7il9oa",
            "parent_id": "t1_j7i6vsv",
            "score": 5,
            "created_utc": 1675733147.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "j7j1gat",
                    "parent_id": "t1_j7il9oa",
                    "score": -2,
                    "created_utc": 1675740669.0,
                    "replies": [
                        {
                            "body": "That’s some mental gymnastics to justify rinsing",
                            "author": "throwawayrtyggv",
                            "id": "j7j2m7u",
                            "parent_id": "t1_j7j1gat",
                            "score": 1,
                            "created_utc": 1675741229.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "j7j3zxy",
                                    "parent_id": "t1_j7j2m7u",
                                    "score": 0,
                                    "created_utc": 1675741917.0,
                                    "replies": [
                                        {
                                            "body": "HE SAID THEY HAD DISCUSSED IT IN ADVANCE.\n\nI can’t believe you’re defending a scammer",
                                            "author": "throwawayrtyggv",
                                            "id": "j7kbyhy",
                                            "parent_id": "t1_j7j3zxy",
                                            "score": 1,
                                            "created_utc": 1675773552.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "They had already discussed ppm and intimacy prior to this date \n\n\nShe suddenly tried to ignore all that and pull a fast one on him ( rinse him )",
            "author": "shamloo77",
            "id": "j7id7en",
            "parent_id": "t1_j7i6vsv",
            "score": 5,
            "created_utc": 1675729498.0,
            "replies": []
        },
        {
            "body": "Exactly! I feel like the one thing men on this particular subreddit fail to realize is that your money is replaceable, our body and integrity is not. That’s why we want an initial investment. Obviously things have to come to a compromise sometimes, but a PPM for sex is not a recipe for a girl to feel valued and safe. It’s actually the new generation of SBs that are accepting bare minimum behavior, the game was not this way until it became more advertised and saltdaddies found out about SA.",
            "author": "cococatrina",
            "id": "j7jcykg",
            "parent_id": "t1_j7i6vsv",
            "score": 1,
            "created_utc": 1675746766.0,
            "replies": []
        },
        {
            "body": "Actually the phone thing could be a nervous coping mechanism sometimes.\n\nI had a former subordinate who was like 10+ years younger than me. After she took a job overseas she would always ask to see me when she's in town (up until the pandemic anyway) I always kept it professional especially since at first there's no reason for me to think there was anything going on though we only started meeting out of office a few weeks before she left, all of which she initiated. On the last meet she her excuse was she wanted to run some business ideas through me. When we met, she was all quiet. I asked didn't she want to talk about her business ideas? She said \"No, we don't have to talk about that.\" and stayed on her phone.\n\nThis wasn't SA or anything, this was a real life, organic situation and she objectively spent a lot of time on lunch and dinners with me.\n\nThat last meet was our most awkward meet. I think she may be doing the young woman thing trying to \"test\" me or \"wait\" for me to make a move. I'm sorry, if you came to me with seeking advice as the stated reason, I'm going to give you my most professional and objective advice.\n\nI did console her over phone and text when she was starting out at that new job and struggling and feeling like she got stuck in a dead end career, so there's that. Maybe something changed along the way from genuinely seeking career advice to hoping for something more but she didn't know how to deal with it so she just awkwardly stared at her phone and not a word about her stated reason asking to see me.",
            "author": "karmaextract",
            "id": "j7jiwc0",
            "parent_id": "t1_j7ijbhp",
            "score": 0,
            "created_utc": 1675750622.0,
            "replies": []
        },
        {
            "body": ">but you paying for at-least 3 platonic dates shouldn’t be an issue.\n\nI'm sure it wouldn't be an issue if both parties agreed to it.\n\nYou go to buy a car, expecting to drive it off the lot.  You're signing the papers, and in the middle of signing, the saleguy says \"You know, I might NOT want to sell you this car, but you can pay me for it anyway while I make up my mind to give you the keys\"",
            "author": "Veioviz",
            "id": "j7m0f5z",
            "parent_id": "t1_j7jk7cs",
            "score": 2,
            "created_utc": 1675799108.0,
            "replies": []
        },
        {
            "body": "Wow. So you’d leave a girl stranded on the side of the road because she changed her mind about having sex? She left civilly, after seeing that they weren’t on the same page. You act like she put a gun to his head or something.",
            "author": "Desperate_timess",
            "id": "j7jfffq",
            "parent_id": "t1_j7ii3q9",
            "score": 3,
            "created_utc": 1675748295.0,
            "replies": [
                {
                    "body": "Actually it more sounded like she tried to guilt him into paying anyway...... hardly sounds civil.....\n\nThe world needs consequences for bullshit shady behavior.....  I wouldn't leave her stranded on the side of the road, more likely in a well-lit gas station or something...",
                    "author": "Veioviz",
                    "id": "j7m4n5d",
                    "parent_id": "t1_j7jfffq",
                    "score": 1,
                    "created_utc": 1675800722.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "100% agree",
            "author": "Substantial_Cream231",
            "id": "j7xhmt9",
            "parent_id": "t1_j7och9n",
            "score": 2,
            "created_utc": 1675996000.0,
            "replies": []
        },
        {
            "body": "Yup. He was not acting just like the tiktok girls said he would !!",
            "author": "southernslick",
            "id": "j7i66ga",
            "parent_id": "t1_j7ht7oc",
            "score": 44,
            "created_utc": 1675726483.0,
            "replies": [
                {
                    "body": "This, rofl!",
                    "author": "SDInLeather",
                    "id": "j7k734n",
                    "parent_id": "t1_j7i66ga",
                    "score": 0,
                    "created_utc": 1675770345.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "That's true! Inviting her back after that??",
            "author": "Azurecole",
            "id": "j7hzswm",
            "parent_id": "t1_j7hvp1n",
            "score": 7,
            "created_utc": 1675723875.0,
            "replies": [
                {
                    "body": "In a small market with very few options, one has to deal with some amount of bad behavior, it seems, to even get out the gate. \n\nI'd love to be in a bigger market where I could next after borderline rude behavior, but that'd run me out of any POTs pretty quick.",
                    "author": "Worldly-wanderer",
                    "id": "j7ibfit",
                    "parent_id": "t1_j7hzswm",
                    "score": 9,
                    "created_utc": 1675728723.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "j7izb8h",
                            "parent_id": "t1_j7ibfit",
                            "score": 10,
                            "created_utc": 1675739671.0,
                            "replies": [
                                {
                                    "body": "I disagree, I think coffee is plenty for an initial meet n greet to see if yall vibe. If I were an SD, I wouldn't want to be paying a bunch of money for a nice dinner or whatever to then find out they suck like this girl does^^^^ I honestly hate the perspective that some women have on the site that they just get to get paid to go out to dinner/spend time whatever. Like no, the rest of us have had to put in work to make that money this is no easy life honey. I think the sugar life is glorified in media nowadays (thinking specifically female rappers). When people don't actually know what it takes. I wonder how young the girl was that OP went on a date with. If I had to guess she would be 18-20 w no experience on the site.",
                                    "author": "Elephantananda222",
                                    "id": "j7j8hj7",
                                    "parent_id": "t1_j7izb8h",
                                    "score": 5,
                                    "created_utc": 1675744246.0,
                                    "replies": [
                                        {
                                            "body": "This is the type of response I admire! Most just think it’s one sided and take advantage. It should be beneficial for both sides. I unfortunately, am romantic type so it gets to the point I’m not sure if person likes me or my money.",
                                            "author": "dynolas1",
                                            "id": "j7ks4n3",
                                            "parent_id": "t1_j7j8hj7",
                                            "score": -4,
                                            "created_utc": 1675781619.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "Quality response here. Certainly agree that his prospective SB was seeking to be on his payroll for little to no effort of establishing connection on her part even going back on their word to entertain intimacy on the next date.",
                                            "author": "Outrageous_Bat8429",
                                            "id": "j7l9t3c",
                                            "parent_id": "t1_j7j8hj7",
                                            "score": 1,
                                            "created_utc": 1675788786.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "Might depend on how you fish. I exclusively M&G at coffee. I pride myself at being a decent and humorous conversationalist, a lot of the SB's are like \"is that so soon?\" when I remind them it has been 30 minutes, which is all I ask of their time, though frequently we have gone well over that. If those are bottom feeders, bring on more catfish, says I, because they have been wonders.",
                                    "author": "SDInLeather",
                                    "id": "j7k7h69",
                                    "parent_id": "t1_j7izb8h",
                                    "score": -3,
                                    "created_utc": 1675770619.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "I get that.  I've put up with things that I normally wouldn't if everything else is a green light, and I'm not even in a small market.  But I do take signs of distraction seriously, more difficult to overlook than, say, being late",
                            "author": "Azurecole",
                            "id": "j7ibvf9",
                            "parent_id": "t1_j7ibfit",
                            "score": 5,
                            "created_utc": 1675728917.0,
                            "replies": []
                        },
                        {
                            "body": "Scarcity thinking versus abundance thinking will keep you trapped.",
                            "author": "Dwight_Manfredi775",
                            "id": "j9y3m8x",
                            "parent_id": "t1_j7ibfit",
                            "score": 1,
                            "created_utc": 1677326871.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I think he was pretty reasonable",
            "author": "throwawayrtyggv",
            "id": "j7ijc81",
            "parent_id": "t1_j7hvp1n",
            "score": 4,
            "created_utc": 1675732239.0,
            "replies": []
        },
        {
            "body": "I think he handled it well.  He didn't pull the plug prematurely and he didn't let himself get taken advantage of.",
            "author": "throwaway48453",
            "id": "j7jedyq",
            "parent_id": "t1_j7hvp1n",
            "score": 1,
            "created_utc": 1675747642.0,
            "replies": []
        },
        {
            "body": "I’m curious if you read my follow up comment. I practically addressed that already. There’s plenty of men on sugar sites who already try that. They claim they “don’t want it to feel transactional”. People are free to do whichever they feel comfortable with first, but both people risk being scammed. Anytime you invest in anything.. could be a new career, friendships, relationships, stocks, etc.",
            "author": "noneya3333",
            "id": "j7nu5yz",
            "parent_id": "t1_j7ntaz5",
            "score": 3,
            "created_utc": 1675826599.0,
            "replies": [
                {
                    "body": "I would say you are wrong saying SBs are more vulnerable, but it doesn't negate the fact that SDs can also be extorted/blackmailed because they have much to lose.\nJust few examples\n\nhttps://abcnews.go.com/Business/AheadoftheCurve/story?id=7578033&amp;page=1\n\nhttps://www.charlotteobserver.com/news/local/crime/article235521757.html\n\nhttps://www.dailymail.co.uk/news/article-8594687/amp/Sugar-baby-threatens-tell-fathers-family-raunchy-relationship-unless-pays-5-000.html&ved=2ahUKEwjB0dr6hoX9AhWETGwGHWJzBpgQFnoECCoQAQ&usg=AOvVaw086GrEOOqQct8c1SJLbgF3\n\nJust because the men who were extorted/blackmailed doesn't come crying to this sub reddit doesn't imply that extortion/blackmailing doesn't exist. There is danger to both sides of the bowl regardless of where you stand. Its upto you how you vet the other person, whom you are gonna engage with.\n\nSugar relationships are always to be mutually beneficial to both the parties equally, the established member fulfills the financial implications of the relationship while the attractive member provides company which includes intimacy.\n\nSpeaking for OPs case, the girl was straight up rinser because she wants only her benefit. OP was right because he gave her the chance to go on enough platonic dates before arrangement commence but she expects ppm without any intimacy.",
                    "author": null,
                    "id": "j7o2cle",
                    "parent_id": "t1_j7nu5yz",
                    "score": -1,
                    "created_utc": 1675830650.0,
                    "replies": [
                        {
                            "body": "Please quote where I said “SBs are more vulnerable”. I didn’t bother reading or clicking the links because I never made that statement in the first place. I’m sure the link is useful, but not relevant right now. (I’m fully aware blackmail exists, but that’s almost a separate topic from the original post.) We’re discussing both parties fear of being strung along, or stiffed. I stated in more ways than one, that arrangements take compromise and potential loss from *both* parties. I’m not understanding what part you’re trying to rebut or disagree with? I also agree with you, & stated in my original comment that the girl in OP’s post (and any girl that expects, asks, or demands prematurely) is probably a scammer.",
                            "author": "noneya3333",
                            "id": "j7o3p2o",
                            "parent_id": "t1_j7o2cle",
                            "score": 3,
                            "created_utc": 1675831375.0,
                            "replies": [
                                {
                                    "body": "You never said that but it was implied (supposedly) by your first statement \"There are countless.....\". Since you have said that you statement never meant to show how vulnerable SBs are so I think we are good now (hopefully).\nLooks like we are almost probably on the same page just with different voices.",
                                    "author": null,
                                    "id": "j7o6noi",
                                    "parent_id": "t1_j7o3p2o",
                                    "score": 0,
                                    "created_utc": 1675832947.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "It looks like you shared some AMP links. These should load faster, but AMP is controversial because of [concerns over privacy and the Open Web](https://www.reddit.com/r/AmputatorBot/comments/ehrq3z/why_did_i_build_amputatorbot).\n\nMaybe check out **the canonical pages** instead: \n\n- **[https://abcnews.go.com/Business/AheadoftheCurve/story?id=7578033&page=1](https://abcnews.go.com/Business/AheadoftheCurve/story?id=7578033&page=1)**\n\n- **[https://www.dailymail.co.uk/news/article-8594687/Sugar-baby-threatens-tell-fathers-family-raunchy-relationship-unless-pays-5-000.html](https://www.dailymail.co.uk/news/article-8594687/Sugar-baby-threatens-tell-fathers-family-raunchy-relationship-unless-pays-5-000.html)**\n\n*****\n\n ^(I'm a bot | )[^(Why & About)](https://www.reddit.com/r/AmputatorBot/comments/ehrq3z/why_did_i_build_amputatorbot)^( | )[^(Summon: u/AmputatorBot)](https://www.reddit.com/r/AmputatorBot/comments/cchly3/you_can_now_summon_amputatorbot/)",
                            "author": "AmputatorBot",
                            "id": "j7o2dkr",
                            "parent_id": "t1_j7o2cle",
                            "score": 1,
                            "created_utc": 1675830665.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I disagree. You should read the countless posts on this forum full of women taking a loss by getting scammed, or pump and dumped. The 2 craziest posts I remember from a few months back 1) SB met up with a pot, he persuaded her to get into his car, then he robbed her at knifepoint. 2) SB was missing all her own cash AND the ppm after she got intimate in a hotel with her pot. She briefly left her purse unattended to use the bathroom before going home. She didn’t realize he robbed her until she was halfway home and had to stop for gas. \n\nMen are not the only ones have to invest, or take losses. Lots of other women get shorted on the agreed amount, or get absolutely nothing after trusting their SD and giving him sex first.",
            "author": "noneya3333",
            "id": "j7l5j8j",
            "parent_id": "t1_j7l1ntt",
            "score": 16,
            "created_utc": 1675787110.0,
            "replies": [
                {
                    "body": "All of these are things that could 99% of the time be avoided by being smart about what you’re doing. I haven’t heard of any stories of SBs getting out at knifepoint when they’re already in the the hotel room. Meet somewhere public, vet accordingly, if you aren’t comfortable go on public dates with no intimacy until you are, don’t get in a car alone and don’t go anywhere alone.\n\nThis is common sense. Just use common sense and the risk is incredibly low.",
                    "author": "atxsuda",
                    "id": "j7pg9zx",
                    "parent_id": "t1_j7l5j8j",
                    "score": 1,
                    "created_utc": 1675865074.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "This comment regarding sex workers is confusing to me. Wouldn't a sex worker be just fine having sex if her SD/client pays an agreed upon PPM? \n\nBlaming a SB-wannabe who will not have sex for being a sex worker is the equivalent of high schoolers who call the girl who will not sleep with them a whore.",
            "author": "geeky-sd",
            "id": "j7k8aqd",
            "parent_id": "t1_j7ig0x3",
            "score": 8,
            "created_utc": 1675771184.0,
            "replies": [
                {
                    "body": "These are clearly the same guys who would cat-call a woman and when she doesn’t respond favorably they neg her 🤡",
                    "author": "SparklingScorpio",
                    "id": "j7m9kxe",
                    "parent_id": "t1_j7k8aqd",
                    "score": 5,
                    "created_utc": 1675802609.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I know. What’s that Charlie sheen quote again?",
            "author": "UnearthlyDinosaur",
            "id": "j7imy96",
            "parent_id": "t1_j7imqzs",
            "score": 0,
            "created_utc": 1675733958.0,
            "replies": [
                {
                    "body": "He has had so many words of drug fueled wisdom",
                    "author": "Federal_Garage_4307",
                    "id": "j7invli",
                    "parent_id": "t1_j7imy96",
                    "score": 1,
                    "created_utc": 1675734400.0,
                    "replies": []
                },
                {
                    "body": "didn't originate with him, but he is the most recent famous user of it:\n\n\"I don't pay women for sex. I pay women to go away after sex.\"",
                    "author": "joc13",
                    "id": "j7j37nz",
                    "parent_id": "t1_j7imy96",
                    "score": 1,
                    "created_utc": 1675741527.0,
                    "replies": [
                        {
                            "body": "👍👍😁😁",
                            "author": "UnearthlyDinosaur",
                            "id": "j7j91lg",
                            "parent_id": "t1_j7j37nz",
                            "score": -2,
                            "created_utc": 1675744550.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "True But sex with old men or men in general isn’t fulfilling for women without anything to gain 😂",
            "author": "Nefarious_evee",
            "id": "j7k0u0a",
            "parent_id": "t1_j7iwczu",
            "score": 2,
            "created_utc": 1675765341.0,
            "replies": []
        },
        {
            "body": ">Wouldn’t it be a better idea to say NO to the money instead 🤷‍♂️\n\nfixed that for you",
            "author": "joc13",
            "id": "j7j1iv4",
            "parent_id": "t1_j7iwczu",
            "score": -2,
            "created_utc": 1675740704.0,
            "replies": []
        },
        {
            "body": "From everything he explained so far,  he sounds like a perfectly wonderful SD.\n\nAs many platonic dates/dinners as I need to feel comfortable? That's quite lovely and MORE than fair.\n\nPeople need to stop treating the SBs like weak little flowers that have to be protected. We just want to be treated fairly and with respect. OP was doing that and more.",
            "author": "gamergainzgal",
            "id": "j7jbem6",
            "parent_id": "t1_j7i3if3",
            "score": 8,
            "created_utc": 1675745865.0,
            "replies": []
        },
        {
            "body": "Cause he doesn’t pay for platonic dates? Yeah ok bud",
            "author": "UnearthlyDinosaur",
            "id": "j7ib70i",
            "parent_id": "t1_j7i3if3",
            "score": 7,
            "created_utc": 1675728620.0,
            "replies": []
        },
        {
            "body": "What makes you say that?",
            "author": "xyz553",
            "id": "j7i44r8",
            "parent_id": "t1_j7i3if3",
            "score": 2,
            "created_utc": 1675725634.0,
            "replies": []
        },
        {
            "body": "Oh bullshit? Why?",
            "author": "throwawayrtyggv",
            "id": "j7ik0h7",
            "parent_id": "t1_j7i3if3",
            "score": 0,
            "created_utc": 1675732554.0,
            "replies": []
        },
        {
            "body": "Yeah, she didn’t seem to know what she was doing. She had a rough idea, but the execution sucked out loud.",
            "author": "MsGinathaheaux",
            "id": "j7irlk0",
            "parent_id": "t1_j7ijymt",
            "score": 3,
            "created_utc": 1675736126.0,
            "replies": []
        },
        {
            "body": "That's funny you used to do that lmaooo",
            "author": "Elephantananda222",
            "id": "j7j96r3",
            "parent_id": "t1_j7j2lve",
            "score": 0,
            "created_utc": 1675744627.0,
            "replies": []
        },
        {
            "body": "Between two consenting adults…",
            "author": "This_Relation2262",
            "id": "j7jfbgu",
            "parent_id": "t1_j7j2lve",
            "score": 0,
            "created_utc": 1675748226.0,
            "replies": [
                {
                    "body": "LOL. I knew I should have just copy/pasted off an old web site. fixed it.\n\nthanks",
                    "author": "joc13",
                    "id": "j7k4pdp",
                    "parent_id": "t1_j7jfbgu",
                    "score": 2,
                    "created_utc": 1675768581.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Thanks!",
            "author": "gamergainzgal",
            "id": "j7lwbsd",
            "parent_id": "t1_j7jh5lb",
            "score": 1,
            "created_utc": 1675797527.0,
            "replies": []
        },
        {
            "body": "Yes, you're right....One of the reasons I felt so horrible was putting myself in her shoes...I hold nothing against her...retelling the story here, I remember being worried she would scream rape or something...Another time I took a long break from SA",
            "author": "surfrat54",
            "id": "j7iqyqz",
            "parent_id": "t1_j7ioy4d",
            "score": 4,
            "created_utc": 1675735832.0,
            "replies": [
                {
                    "body": "It's not easy getting older 🫣",
                    "author": "Sunhillian",
                    "id": "j7irrpz",
                    "parent_id": "t1_j7iqyqz",
                    "score": 2,
                    "created_utc": 1675736203.0,
                    "replies": [
                        {
                            "body": "You can say that again… there’s an expression I once heard.”If you’re lucky you get old”.",
                            "author": "surfrat54",
                            "id": "j7j5wpe",
                            "parent_id": "t1_j7irrpz",
                            "score": 2,
                            "created_utc": 1675742881.0,
                            "replies": [
                                {
                                    "body": "Well that's true, I neve heard that before. Puts a whole new positive spin on it 🤣🤣",
                                    "author": "Sunhillian",
                                    "id": "j7j62u1",
                                    "parent_id": "t1_j7j5wpe",
                                    "score": 1,
                                    "created_utc": 1675742967.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "You are a true SD and bless you 👏🏾 when you take care of a women, a women will take care of you. We put time and effort into how we look just to meet you. Only paying us for sex, especially for PPM, makes it feel degrading and cheap. That is an escort, and trust that they get paid that amount for the HOUR and acts. We’d be making less. There are much better SD/SB subreddits and I feel like most the active users on here I would have vetted out just from the stinginess to not show proper masc/feminine etiquette or make me feel like they are a safe provider so that I could let down my hair and actually enjoy time with them.",
            "author": "cococatrina",
            "id": "j7jce7f",
            "parent_id": "t1_j7j8nuc",
            "score": 5,
            "created_utc": 1675746435.0,
            "replies": []
        },
        {
            "body": "He’s treating her like a prostitute for only paying her when he gets sex in return, like you know, prostitution. Checking her phone doesn’t make her a sex worker, that’s just a little rude. This arrangement does.",
            "author": "sassydegrassii",
            "id": "j7i6icc",
            "parent_id": "t1_j7i5qyx",
            "score": -1,
            "created_utc": 1675726620.0,
            "replies": [
                {
                    "body": "Having sex with someone does not make you a prostitute. \n\nCharging someone \"for your time\" during which you are clearly not interested in them makes you a prostitute.",
                    "author": "NinCarolina",
                    "id": "j7i7i0u",
                    "parent_id": "t1_j7i6icc",
                    "score": 5,
                    "created_utc": 1675727041.0,
                    "replies": [
                        {
                            "body": "Having sex for money makes you a sex worker, paying under those conditions makes you a client",
                            "author": "sassydegrassii",
                            "id": "j7j6zel",
                            "parent_id": "t1_j7i7i0u",
                            "score": 1,
                            "created_utc": 1675743446.0,
                            "replies": [
                                {
                                    "body": "And if you take money from someone under the pretense of having sex with them and then refuse to have sex with them, that makes you even worse.",
                                    "author": "NinCarolina",
                                    "id": "j7j8gh4",
                                    "parent_id": "t1_j7j6zel",
                                    "score": 0,
                                    "created_utc": 1675744230.0,
                                    "replies": [
                                        {
                                            "body": "It’s not about being worse, it’s just calling a spade a spade",
                                            "author": "sassydegrassii",
                                            "id": "j7jd2dd",
                                            "parent_id": "t1_j7j8gh4",
                                            "score": 1,
                                            "created_utc": 1675746830.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "anyone that thinks SR’s are NOT a form of SW is delusional, that’s the point. They’re a kind of sex work that often requires way more emotional labour for less money because y’all will do anything to avoid accepting that you’re engaging in sex work",
            "author": "sassydegrassii",
            "id": "j7i7a5f",
            "parent_id": "t1_j7i1b2h",
            "score": 10,
            "created_utc": 1675726948.0,
            "replies": [
                {
                    "body": "Why are you here?",
                    "author": "throwawayrtyggv",
                    "id": "j7ikc3s",
                    "parent_id": "t1_j7i7a5f",
                    "score": 4,
                    "created_utc": 1675732705.0,
                    "replies": [
                        {
                            "body": "unfortunately, it’s relevant to me",
                            "author": "sassydegrassii",
                            "id": "j7j7bo8",
                            "parent_id": "t1_j7ikc3s",
                            "score": 0,
                            "created_utc": 1675743627.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "I tend to agree w you. Nobody wants to look at the fact that this is sex work. And it requires SEX AND MONEY HAHAHA",
                    "author": "Elephantananda222",
                    "id": "j7j9dfs",
                    "parent_id": "t1_j7i7a5f",
                    "score": 1,
                    "created_utc": 1675744727.0,
                    "replies": []
                },
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "j7jcjw2",
                    "parent_id": "t1_j7i7a5f",
                    "score": -4,
                    "created_utc": 1675746527.0,
                    "replies": [
                        {
                            "body": "If you pay only for sexual visits, you’re a John. It goes both ways. I don’t care if you’re insulted by that. Sex work isn’t a bad thing.  This is a matter of the whorearchy/whorephobia.",
                            "author": "sassydegrassii",
                            "id": "j7jd7g4",
                            "parent_id": "t1_j7jcjw2",
                            "score": 1,
                            "created_utc": 1675746918.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "j7jex9r",
                                    "parent_id": "t1_j7jd7g4",
                                    "score": -1,
                                    "created_utc": 1675747975.0,
                                    "replies": [
                                        {
                                            "body": "I have multiple boards because I’m a sex worker of multiple practices. you don’t have to be high class to be into sugar, it’s proven in here every day",
                                            "author": "sassydegrassii",
                                            "id": "j7jgr63",
                                            "parent_id": "t1_j7jex9r",
                                            "score": 2,
                                            "created_utc": 1675749154.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Why do so many of the men here gaslight women for wanting THE MAIN component of a sugar relationship?",
            "author": "thehottubistoohawt",
            "id": "j7ioxqj",
            "parent_id": "t1_j7ik7mi",
            "score": 13,
            "created_utc": 1675734897.0,
            "replies": [
                {
                    "body": "I don't think that is true. there is no ground swell of men saying that women should have sex without receiving some benefit for being in that sexual relationship with someone.\n\nif anything, it seems to be perfectly clear that the majority here believe that both benefits should start at the same time. to the credit of many of the guys that post here, plenty will say that AFTER the sexual relationship has started, then occasional dates that don't include sex are fine and will receive the same benefits as any other dates.",
                    "author": "joc13",
                    "id": "j7j4475",
                    "parent_id": "t1_j7ioxqj",
                    "score": 2,
                    "created_utc": 1675741976.0,
                    "replies": []
                },
                {
                    "body": "And usually, when does a sugar relationship start?",
                    "author": "throwawayrtyggv",
                    "id": "j7iqusd",
                    "parent_id": "t1_j7ioxqj",
                    "score": 2,
                    "created_utc": 1675735781.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "You could do it in some variant of the bachelor. Between actually single 1-percenter who's not quite high profile and don't mind some TV notoriety and some aspiring model/bachelor that gets bankrolled by the program there's many ways to make it work.",
            "author": "karmaextract",
            "id": "j7jjhb9",
            "parent_id": "t1_j7ijtgs",
            "score": 0,
            "created_utc": 1675751035.0,
            "replies": [
                {
                    "body": "Or I was thinking about the guy goes on three M&G’s and we follow him and see which one he chooses.  Sort of like House Hunters.  Working title  — Sugar Hunters.",
                    "author": "PracticePositive69",
                    "id": "j7laskr",
                    "parent_id": "t1_j7jjhb9",
                    "score": 1,
                    "created_utc": 1675789164.0,
                    "replies": [
                        {
                            "body": "I think in that format you want to add some element of competition for the audience, say a model with no money vs SD, maybe throw in the average joe vanilla dater and see how their experiences compare, but also make sure its setup in a way that people actually understand how much bullshit men actually have to deal with.",
                            "author": "karmaextract",
                            "id": "j7ljos1",
                            "parent_id": "t1_j7laskr",
                            "score": 1,
                            "created_utc": 1675792582.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I'm 10,000% certain you're correct. They have sex with the guy (often, most likely) but somehow it's important to portray themselves as \"just pretty to look at\" rather than admitting what they do.",
            "author": "marker3000",
            "id": "j81dv7p",
            "parent_id": "t1_j7vufhf",
            "score": 2,
            "created_utc": 1676067695.0,
            "replies": []
        },
        {
            "body": "Yes, two reasons, 1. to eliminate that it was not just nervousness about being close that was her issue (i.e. that she was not actually a rinser) as some also mentioned, 2. I enjoy kissing and have many times sugared for that alone or as a gradual lead to intimacy process with an SB. I was not there though, obviously, only you were so you have a 1,001 personal intuitive experiences etc about her that I don't share.",
            "author": "SDInLeather",
            "id": "j7lidsl",
            "parent_id": "t1_j7k8rr1",
            "score": 2,
            "created_utc": 1675792083.0,
            "replies": [
                {
                    "body": "Dude, I mean, I did not claim to be there but re-read the original post and read this woman’s attitude. 🤷🏻‍♂️ \n\nBecause offering a woman a little bit of money to kiss you is a sure way to increase her comfort level.  🤦🏻‍♂️x 100\n\nI’m imagining the Kissing Booth at an old time-y county fair \n\n[“Smooches 50 cents”](https://stepandrepeatla.com/shop/event-props/kissing-booth-rental/)",
                    "author": "Chill_SD1974",
                    "id": "j7lm1c9",
                    "parent_id": "t1_j7lidsl",
                    "score": 2,
                    "created_utc": 1675793507.0,
                    "replies": [
                        {
                            "body": "Haha, well, I would like to see the old-timey country fair that had some of the kiss fests I've personally been involved in(some of which were honestly like \"only kissing\" and ended up being intimate on the couch), but I understand your point. And, btw, sorry, I did not look up and thought you were the OP, hence the \"being there\" component. IMO only someone who is sitting across from someone else can truly make an effective read on a situation, no matter how detailed the narrative.:)",
                            "author": "SDInLeather",
                            "id": "j7lx8ef",
                            "parent_id": "t1_j7lm1c9",
                            "score": 1,
                            "created_utc": 1675797878.0,
                            "replies": [
                                {
                                    "body": "Not to worry, it’s often challenging to keep up with who is responding to what.",
                                    "author": "Chill_SD1974",
                                    "id": "j7m8umt",
                                    "parent_id": "t1_j7lx8ef",
                                    "score": 2,
                                    "created_utc": 1675802334.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "And agree, the overall flavor seems as if her attitude towards the whole thing was sucky.",
                            "author": "SDInLeather",
                            "id": "j7lxe6t",
                            "parent_id": "t1_j7lm1c9",
                            "score": 1,
                            "created_utc": 1675797940.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Damn she sounds like a total rinser. Good for you for sticking to your guns.",
            "author": "NewYorkSD",
            "id": "j7icwf1",
            "parent_id": "t1_j7ia4uo",
            "score": 6,
            "created_utc": 1675729365.0,
            "replies": []
        },
        {
            "body": "YES thank you! SBs should not settle for less because there are great SDs out there like you 💕💖🥰",
            "author": "cococatrina",
            "id": "j7jd5wd",
            "parent_id": "t1_j7iphw4",
            "score": 2,
            "created_utc": 1675746891.0,
            "replies": []
        },
        {
            "body": "So sad!!",
            "author": "sloan3140",
            "id": "j8816oi",
            "parent_id": "t1_j7xi9tt",
            "score": 1,
            "created_utc": 1676193881.0,
            "replies": []
        },
        {
            "body": "Then she changed her mind, realized she didn’t want to have sex with him, and didn’t force herself to have sex in exchange for money. She realized she didn’t want to do sex work, and she left the situation. She didn’t blackmail the guy, try to force him to pay, or engage in any unethical behavior. She simply said “no,” and left.",
            "author": "KetoSeaweed",
            "id": "j7j58ye",
            "parent_id": "t1_j7j2wor",
            "score": 1,
            "created_utc": 1675742546.0,
            "replies": [
                {
                    "body": ">She realized she didn’t want to do sex work, and she left the situation.\n\nYou forgot to mention the part where she still attempted to gaslight him into fulfilling his side of the agreement without her fulfilling hers.\n\nYou're making it sound amicable when that's not the case.  She's lucky she got a ride back to the train station after the attitude.",
                    "author": "Veioviz",
                    "id": "j7m00dn",
                    "parent_id": "t1_j7j58ye",
                    "score": 2,
                    "created_utc": 1675798952.0,
                    "replies": []
                },
                {
                    "body": "He also gets to consent on his choice of whether to open his wallet or not. He wasn’t feeling it, so he didn’t. Good for him. No man should ever feel coerced to pay a woman for her company.",
                    "author": "Dry_Dimension_4707",
                    "id": "j7jfz3d",
                    "parent_id": "t1_j7j58ye",
                    "score": 1,
                    "created_utc": 1675748648.0,
                    "replies": []
                },
                {
                    "body": "She still fucking asked to be paid and went to his house knowing full well what that likely meant.\nShe’s a scammer and multiple people are defending her. It’s disgusting",
                    "author": "throwawayrtyggv",
                    "id": "j7kc3oz",
                    "parent_id": "t1_j7j58ye",
                    "score": -2,
                    "created_utc": 1675773638.0,
                    "replies": [
                        {
                            "body": "Nah, she’s just a woman who was probably in a desperate financial position, thought her only chance to get what she needed was to fuck for money, and then at the last minute realized she couldn’t go through with it. \n\nThat’s not being a scammer. That’s being in an awful position, then realizing that you really don’t want to have sex with somebody you have no interest in as a financial transaction, and clearly articulating that boundary.",
                            "author": "KetoSeaweed",
                            "id": "j7kjg8v",
                            "parent_id": "t1_j7kc3oz",
                            "score": 3,
                            "created_utc": 1675777639.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "j7j1gat",
            "parent_id": "t1_j7il9oa",
            "score": -2,
            "created_utc": 1675740669.0,
            "replies": [
                {
                    "body": "That’s some mental gymnastics to justify rinsing",
                    "author": "throwawayrtyggv",
                    "id": "j7j2m7u",
                    "parent_id": "t1_j7j1gat",
                    "score": 1,
                    "created_utc": 1675741229.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "j7j3zxy",
                            "parent_id": "t1_j7j2m7u",
                            "score": 0,
                            "created_utc": 1675741917.0,
                            "replies": [
                                {
                                    "body": "HE SAID THEY HAD DISCUSSED IT IN ADVANCE.\n\nI can’t believe you’re defending a scammer",
                                    "author": "throwawayrtyggv",
                                    "id": "j7kbyhy",
                                    "parent_id": "t1_j7j3zxy",
                                    "score": 1,
                                    "created_utc": 1675773552.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Actually it more sounded like she tried to guilt him into paying anyway...... hardly sounds civil.....\n\nThe world needs consequences for bullshit shady behavior.....  I wouldn't leave her stranded on the side of the road, more likely in a well-lit gas station or something...",
            "author": "Veioviz",
            "id": "j7m4n5d",
            "parent_id": "t1_j7jfffq",
            "score": 1,
            "created_utc": 1675800722.0,
            "replies": []
        },
        {
            "body": "This, rofl!",
            "author": "SDInLeather",
            "id": "j7k734n",
            "parent_id": "t1_j7i66ga",
            "score": 0,
            "created_utc": 1675770345.0,
            "replies": []
        },
        {
            "body": "In a small market with very few options, one has to deal with some amount of bad behavior, it seems, to even get out the gate. \n\nI'd love to be in a bigger market where I could next after borderline rude behavior, but that'd run me out of any POTs pretty quick.",
            "author": "Worldly-wanderer",
            "id": "j7ibfit",
            "parent_id": "t1_j7hzswm",
            "score": 9,
            "created_utc": 1675728723.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "j7izb8h",
                    "parent_id": "t1_j7ibfit",
                    "score": 10,
                    "created_utc": 1675739671.0,
                    "replies": [
                        {
                            "body": "I disagree, I think coffee is plenty for an initial meet n greet to see if yall vibe. If I were an SD, I wouldn't want to be paying a bunch of money for a nice dinner or whatever to then find out they suck like this girl does^^^^ I honestly hate the perspective that some women have on the site that they just get to get paid to go out to dinner/spend time whatever. Like no, the rest of us have had to put in work to make that money this is no easy life honey. I think the sugar life is glorified in media nowadays (thinking specifically female rappers). When people don't actually know what it takes. I wonder how young the girl was that OP went on a date with. If I had to guess she would be 18-20 w no experience on the site.",
                            "author": "Elephantananda222",
                            "id": "j7j8hj7",
                            "parent_id": "t1_j7izb8h",
                            "score": 5,
                            "created_utc": 1675744246.0,
                            "replies": [
                                {
                                    "body": "This is the type of response I admire! Most just think it’s one sided and take advantage. It should be beneficial for both sides. I unfortunately, am romantic type so it gets to the point I’m not sure if person likes me or my money.",
                                    "author": "dynolas1",
                                    "id": "j7ks4n3",
                                    "parent_id": "t1_j7j8hj7",
                                    "score": -4,
                                    "created_utc": 1675781619.0,
                                    "replies": []
                                },
                                {
                                    "body": "Quality response here. Certainly agree that his prospective SB was seeking to be on his payroll for little to no effort of establishing connection on her part even going back on their word to entertain intimacy on the next date.",
                                    "author": "Outrageous_Bat8429",
                                    "id": "j7l9t3c",
                                    "parent_id": "t1_j7j8hj7",
                                    "score": 1,
                                    "created_utc": 1675788786.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "Might depend on how you fish. I exclusively M&G at coffee. I pride myself at being a decent and humorous conversationalist, a lot of the SB's are like \"is that so soon?\" when I remind them it has been 30 minutes, which is all I ask of their time, though frequently we have gone well over that. If those are bottom feeders, bring on more catfish, says I, because they have been wonders.",
                            "author": "SDInLeather",
                            "id": "j7k7h69",
                            "parent_id": "t1_j7izb8h",
                            "score": -3,
                            "created_utc": 1675770619.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "I get that.  I've put up with things that I normally wouldn't if everything else is a green light, and I'm not even in a small market.  But I do take signs of distraction seriously, more difficult to overlook than, say, being late",
                    "author": "Azurecole",
                    "id": "j7ibvf9",
                    "parent_id": "t1_j7ibfit",
                    "score": 5,
                    "created_utc": 1675728917.0,
                    "replies": []
                },
                {
                    "body": "Scarcity thinking versus abundance thinking will keep you trapped.",
                    "author": "Dwight_Manfredi775",
                    "id": "j9y3m8x",
                    "parent_id": "t1_j7ibfit",
                    "score": 1,
                    "created_utc": 1677326871.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I would say you are wrong saying SBs are more vulnerable, but it doesn't negate the fact that SDs can also be extorted/blackmailed because they have much to lose.\nJust few examples\n\nhttps://abcnews.go.com/Business/AheadoftheCurve/story?id=7578033&amp;page=1\n\nhttps://www.charlotteobserver.com/news/local/crime/article235521757.html\n\nhttps://www.dailymail.co.uk/news/article-8594687/amp/Sugar-baby-threatens-tell-fathers-family-raunchy-relationship-unless-pays-5-000.html&ved=2ahUKEwjB0dr6hoX9AhWETGwGHWJzBpgQFnoECCoQAQ&usg=AOvVaw086GrEOOqQct8c1SJLbgF3\n\nJust because the men who were extorted/blackmailed doesn't come crying to this sub reddit doesn't imply that extortion/blackmailing doesn't exist. There is danger to both sides of the bowl regardless of where you stand. Its upto you how you vet the other person, whom you are gonna engage with.\n\nSugar relationships are always to be mutually beneficial to both the parties equally, the established member fulfills the financial implications of the relationship while the attractive member provides company which includes intimacy.\n\nSpeaking for OPs case, the girl was straight up rinser because she wants only her benefit. OP was right because he gave her the chance to go on enough platonic dates before arrangement commence but she expects ppm without any intimacy.",
            "author": null,
            "id": "j7o2cle",
            "parent_id": "t1_j7nu5yz",
            "score": -1,
            "created_utc": 1675830650.0,
            "replies": [
                {
                    "body": "Please quote where I said “SBs are more vulnerable”. I didn’t bother reading or clicking the links because I never made that statement in the first place. I’m sure the link is useful, but not relevant right now. (I’m fully aware blackmail exists, but that’s almost a separate topic from the original post.) We’re discussing both parties fear of being strung along, or stiffed. I stated in more ways than one, that arrangements take compromise and potential loss from *both* parties. I’m not understanding what part you’re trying to rebut or disagree with? I also agree with you, & stated in my original comment that the girl in OP’s post (and any girl that expects, asks, or demands prematurely) is probably a scammer.",
                    "author": "noneya3333",
                    "id": "j7o3p2o",
                    "parent_id": "t1_j7o2cle",
                    "score": 3,
                    "created_utc": 1675831375.0,
                    "replies": [
                        {
                            "body": "You never said that but it was implied (supposedly) by your first statement \"There are countless.....\". Since you have said that you statement never meant to show how vulnerable SBs are so I think we are good now (hopefully).\nLooks like we are almost probably on the same page just with different voices.",
                            "author": null,
                            "id": "j7o6noi",
                            "parent_id": "t1_j7o3p2o",
                            "score": 0,
                            "created_utc": 1675832947.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "It looks like you shared some AMP links. These should load faster, but AMP is controversial because of [concerns over privacy and the Open Web](https://www.reddit.com/r/AmputatorBot/comments/ehrq3z/why_did_i_build_amputatorbot).\n\nMaybe check out **the canonical pages** instead: \n\n- **[https://abcnews.go.com/Business/AheadoftheCurve/story?id=7578033&page=1](https://abcnews.go.com/Business/AheadoftheCurve/story?id=7578033&page=1)**\n\n- **[https://www.dailymail.co.uk/news/article-8594687/Sugar-baby-threatens-tell-fathers-family-raunchy-relationship-unless-pays-5-000.html](https://www.dailymail.co.uk/news/article-8594687/Sugar-baby-threatens-tell-fathers-family-raunchy-relationship-unless-pays-5-000.html)**\n\n*****\n\n ^(I'm a bot | )[^(Why & About)](https://www.reddit.com/r/AmputatorBot/comments/ehrq3z/why_did_i_build_amputatorbot)^( | )[^(Summon: u/AmputatorBot)](https://www.reddit.com/r/AmputatorBot/comments/cchly3/you_can_now_summon_amputatorbot/)",
                    "author": "AmputatorBot",
                    "id": "j7o2dkr",
                    "parent_id": "t1_j7o2cle",
                    "score": 1,
                    "created_utc": 1675830665.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "All of these are things that could 99% of the time be avoided by being smart about what you’re doing. I haven’t heard of any stories of SBs getting out at knifepoint when they’re already in the the hotel room. Meet somewhere public, vet accordingly, if you aren’t comfortable go on public dates with no intimacy until you are, don’t get in a car alone and don’t go anywhere alone.\n\nThis is common sense. Just use common sense and the risk is incredibly low.",
            "author": "atxsuda",
            "id": "j7pg9zx",
            "parent_id": "t1_j7l5j8j",
            "score": 1,
            "created_utc": 1675865074.0,
            "replies": []
        },
        {
            "body": "These are clearly the same guys who would cat-call a woman and when she doesn’t respond favorably they neg her 🤡",
            "author": "SparklingScorpio",
            "id": "j7m9kxe",
            "parent_id": "t1_j7k8aqd",
            "score": 5,
            "created_utc": 1675802609.0,
            "replies": []
        },
        {
            "body": "He has had so many words of drug fueled wisdom",
            "author": "Federal_Garage_4307",
            "id": "j7invli",
            "parent_id": "t1_j7imy96",
            "score": 1,
            "created_utc": 1675734400.0,
            "replies": []
        },
        {
            "body": "didn't originate with him, but he is the most recent famous user of it:\n\n\"I don't pay women for sex. I pay women to go away after sex.\"",
            "author": "joc13",
            "id": "j7j37nz",
            "parent_id": "t1_j7imy96",
            "score": 1,
            "created_utc": 1675741527.0,
            "replies": [
                {
                    "body": "👍👍😁😁",
                    "author": "UnearthlyDinosaur",
                    "id": "j7j91lg",
                    "parent_id": "t1_j7j37nz",
                    "score": -2,
                    "created_utc": 1675744550.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "LOL. I knew I should have just copy/pasted off an old web site. fixed it.\n\nthanks",
            "author": "joc13",
            "id": "j7k4pdp",
            "parent_id": "t1_j7jfbgu",
            "score": 2,
            "created_utc": 1675768581.0,
            "replies": []
        },
        {
            "body": "It's not easy getting older 🫣",
            "author": "Sunhillian",
            "id": "j7irrpz",
            "parent_id": "t1_j7iqyqz",
            "score": 2,
            "created_utc": 1675736203.0,
            "replies": [
                {
                    "body": "You can say that again… there’s an expression I once heard.”If you’re lucky you get old”.",
                    "author": "surfrat54",
                    "id": "j7j5wpe",
                    "parent_id": "t1_j7irrpz",
                    "score": 2,
                    "created_utc": 1675742881.0,
                    "replies": [
                        {
                            "body": "Well that's true, I neve heard that before. Puts a whole new positive spin on it 🤣🤣",
                            "author": "Sunhillian",
                            "id": "j7j62u1",
                            "parent_id": "t1_j7j5wpe",
                            "score": 1,
                            "created_utc": 1675742967.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Having sex with someone does not make you a prostitute. \n\nCharging someone \"for your time\" during which you are clearly not interested in them makes you a prostitute.",
            "author": "NinCarolina",
            "id": "j7i7i0u",
            "parent_id": "t1_j7i6icc",
            "score": 5,
            "created_utc": 1675727041.0,
            "replies": [
                {
                    "body": "Having sex for money makes you a sex worker, paying under those conditions makes you a client",
                    "author": "sassydegrassii",
                    "id": "j7j6zel",
                    "parent_id": "t1_j7i7i0u",
                    "score": 1,
                    "created_utc": 1675743446.0,
                    "replies": [
                        {
                            "body": "And if you take money from someone under the pretense of having sex with them and then refuse to have sex with them, that makes you even worse.",
                            "author": "NinCarolina",
                            "id": "j7j8gh4",
                            "parent_id": "t1_j7j6zel",
                            "score": 0,
                            "created_utc": 1675744230.0,
                            "replies": [
                                {
                                    "body": "It’s not about being worse, it’s just calling a spade a spade",
                                    "author": "sassydegrassii",
                                    "id": "j7jd2dd",
                                    "parent_id": "t1_j7j8gh4",
                                    "score": 1,
                                    "created_utc": 1675746830.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Why are you here?",
            "author": "throwawayrtyggv",
            "id": "j7ikc3s",
            "parent_id": "t1_j7i7a5f",
            "score": 4,
            "created_utc": 1675732705.0,
            "replies": [
                {
                    "body": "unfortunately, it’s relevant to me",
                    "author": "sassydegrassii",
                    "id": "j7j7bo8",
                    "parent_id": "t1_j7ikc3s",
                    "score": 0,
                    "created_utc": 1675743627.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I tend to agree w you. Nobody wants to look at the fact that this is sex work. And it requires SEX AND MONEY HAHAHA",
            "author": "Elephantananda222",
            "id": "j7j9dfs",
            "parent_id": "t1_j7i7a5f",
            "score": 1,
            "created_utc": 1675744727.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "j7jcjw2",
            "parent_id": "t1_j7i7a5f",
            "score": -4,
            "created_utc": 1675746527.0,
            "replies": [
                {
                    "body": "If you pay only for sexual visits, you’re a John. It goes both ways. I don’t care if you’re insulted by that. Sex work isn’t a bad thing.  This is a matter of the whorearchy/whorephobia.",
                    "author": "sassydegrassii",
                    "id": "j7jd7g4",
                    "parent_id": "t1_j7jcjw2",
                    "score": 1,
                    "created_utc": 1675746918.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "j7jex9r",
                            "parent_id": "t1_j7jd7g4",
                            "score": -1,
                            "created_utc": 1675747975.0,
                            "replies": [
                                {
                                    "body": "I have multiple boards because I’m a sex worker of multiple practices. you don’t have to be high class to be into sugar, it’s proven in here every day",
                                    "author": "sassydegrassii",
                                    "id": "j7jgr63",
                                    "parent_id": "t1_j7jex9r",
                                    "score": 2,
                                    "created_utc": 1675749154.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I don't think that is true. there is no ground swell of men saying that women should have sex without receiving some benefit for being in that sexual relationship with someone.\n\nif anything, it seems to be perfectly clear that the majority here believe that both benefits should start at the same time. to the credit of many of the guys that post here, plenty will say that AFTER the sexual relationship has started, then occasional dates that don't include sex are fine and will receive the same benefits as any other dates.",
            "author": "joc13",
            "id": "j7j4475",
            "parent_id": "t1_j7ioxqj",
            "score": 2,
            "created_utc": 1675741976.0,
            "replies": []
        },
        {
            "body": "And usually, when does a sugar relationship start?",
            "author": "throwawayrtyggv",
            "id": "j7iqusd",
            "parent_id": "t1_j7ioxqj",
            "score": 2,
            "created_utc": 1675735781.0,
            "replies": []
        },
        {
            "body": "Or I was thinking about the guy goes on three M&G’s and we follow him and see which one he chooses.  Sort of like House Hunters.  Working title  — Sugar Hunters.",
            "author": "PracticePositive69",
            "id": "j7laskr",
            "parent_id": "t1_j7jjhb9",
            "score": 1,
            "created_utc": 1675789164.0,
            "replies": [
                {
                    "body": "I think in that format you want to add some element of competition for the audience, say a model with no money vs SD, maybe throw in the average joe vanilla dater and see how their experiences compare, but also make sure its setup in a way that people actually understand how much bullshit men actually have to deal with.",
                    "author": "karmaextract",
                    "id": "j7ljos1",
                    "parent_id": "t1_j7laskr",
                    "score": 1,
                    "created_utc": 1675792582.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Dude, I mean, I did not claim to be there but re-read the original post and read this woman’s attitude. 🤷🏻‍♂️ \n\nBecause offering a woman a little bit of money to kiss you is a sure way to increase her comfort level.  🤦🏻‍♂️x 100\n\nI’m imagining the Kissing Booth at an old time-y county fair \n\n[“Smooches 50 cents”](https://stepandrepeatla.com/shop/event-props/kissing-booth-rental/)",
            "author": "Chill_SD1974",
            "id": "j7lm1c9",
            "parent_id": "t1_j7lidsl",
            "score": 2,
            "created_utc": 1675793507.0,
            "replies": [
                {
                    "body": "Haha, well, I would like to see the old-timey country fair that had some of the kiss fests I've personally been involved in(some of which were honestly like \"only kissing\" and ended up being intimate on the couch), but I understand your point. And, btw, sorry, I did not look up and thought you were the OP, hence the \"being there\" component. IMO only someone who is sitting across from someone else can truly make an effective read on a situation, no matter how detailed the narrative.:)",
                    "author": "SDInLeather",
                    "id": "j7lx8ef",
                    "parent_id": "t1_j7lm1c9",
                    "score": 1,
                    "created_utc": 1675797878.0,
                    "replies": [
                        {
                            "body": "Not to worry, it’s often challenging to keep up with who is responding to what.",
                            "author": "Chill_SD1974",
                            "id": "j7m8umt",
                            "parent_id": "t1_j7lx8ef",
                            "score": 2,
                            "created_utc": 1675802334.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "And agree, the overall flavor seems as if her attitude towards the whole thing was sucky.",
                    "author": "SDInLeather",
                    "id": "j7lxe6t",
                    "parent_id": "t1_j7lm1c9",
                    "score": 1,
                    "created_utc": 1675797940.0,
                    "replies": []
                }
            ]
        },
        {
            "body": ">She realized she didn’t want to do sex work, and she left the situation.\n\nYou forgot to mention the part where she still attempted to gaslight him into fulfilling his side of the agreement without her fulfilling hers.\n\nYou're making it sound amicable when that's not the case.  She's lucky she got a ride back to the train station after the attitude.",
            "author": "Veioviz",
            "id": "j7m00dn",
            "parent_id": "t1_j7j58ye",
            "score": 2,
            "created_utc": 1675798952.0,
            "replies": []
        },
        {
            "body": "He also gets to consent on his choice of whether to open his wallet or not. He wasn’t feeling it, so he didn’t. Good for him. No man should ever feel coerced to pay a woman for her company.",
            "author": "Dry_Dimension_4707",
            "id": "j7jfz3d",
            "parent_id": "t1_j7j58ye",
            "score": 1,
            "created_utc": 1675748648.0,
            "replies": []
        },
        {
            "body": "She still fucking asked to be paid and went to his house knowing full well what that likely meant.\nShe’s a scammer and multiple people are defending her. It’s disgusting",
            "author": "throwawayrtyggv",
            "id": "j7kc3oz",
            "parent_id": "t1_j7j58ye",
            "score": -2,
            "created_utc": 1675773638.0,
            "replies": [
                {
                    "body": "Nah, she’s just a woman who was probably in a desperate financial position, thought her only chance to get what she needed was to fuck for money, and then at the last minute realized she couldn’t go through with it. \n\nThat’s not being a scammer. That’s being in an awful position, then realizing that you really don’t want to have sex with somebody you have no interest in as a financial transaction, and clearly articulating that boundary.",
                    "author": "KetoSeaweed",
                    "id": "j7kjg8v",
                    "parent_id": "t1_j7kc3oz",
                    "score": 3,
                    "created_utc": 1675777639.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "That’s some mental gymnastics to justify rinsing",
            "author": "throwawayrtyggv",
            "id": "j7j2m7u",
            "parent_id": "t1_j7j1gat",
            "score": 1,
            "created_utc": 1675741229.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "j7j3zxy",
                    "parent_id": "t1_j7j2m7u",
                    "score": 0,
                    "created_utc": 1675741917.0,
                    "replies": [
                        {
                            "body": "HE SAID THEY HAD DISCUSSED IT IN ADVANCE.\n\nI can’t believe you’re defending a scammer",
                            "author": "throwawayrtyggv",
                            "id": "j7kbyhy",
                            "parent_id": "t1_j7j3zxy",
                            "score": 1,
                            "created_utc": 1675773552.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "j7izb8h",
            "parent_id": "t1_j7ibfit",
            "score": 10,
            "created_utc": 1675739671.0,
            "replies": [
                {
                    "body": "I disagree, I think coffee is plenty for an initial meet n greet to see if yall vibe. If I were an SD, I wouldn't want to be paying a bunch of money for a nice dinner or whatever to then find out they suck like this girl does^^^^ I honestly hate the perspective that some women have on the site that they just get to get paid to go out to dinner/spend time whatever. Like no, the rest of us have had to put in work to make that money this is no easy life honey. I think the sugar life is glorified in media nowadays (thinking specifically female rappers). When people don't actually know what it takes. I wonder how young the girl was that OP went on a date with. If I had to guess she would be 18-20 w no experience on the site.",
                    "author": "Elephantananda222",
                    "id": "j7j8hj7",
                    "parent_id": "t1_j7izb8h",
                    "score": 5,
                    "created_utc": 1675744246.0,
                    "replies": [
                        {
                            "body": "This is the type of response I admire! Most just think it’s one sided and take advantage. It should be beneficial for both sides. I unfortunately, am romantic type so it gets to the point I’m not sure if person likes me or my money.",
                            "author": "dynolas1",
                            "id": "j7ks4n3",
                            "parent_id": "t1_j7j8hj7",
                            "score": -4,
                            "created_utc": 1675781619.0,
                            "replies": []
                        },
                        {
                            "body": "Quality response here. Certainly agree that his prospective SB was seeking to be on his payroll for little to no effort of establishing connection on her part even going back on their word to entertain intimacy on the next date.",
                            "author": "Outrageous_Bat8429",
                            "id": "j7l9t3c",
                            "parent_id": "t1_j7j8hj7",
                            "score": 1,
                            "created_utc": 1675788786.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Might depend on how you fish. I exclusively M&G at coffee. I pride myself at being a decent and humorous conversationalist, a lot of the SB's are like \"is that so soon?\" when I remind them it has been 30 minutes, which is all I ask of their time, though frequently we have gone well over that. If those are bottom feeders, bring on more catfish, says I, because they have been wonders.",
                    "author": "SDInLeather",
                    "id": "j7k7h69",
                    "parent_id": "t1_j7izb8h",
                    "score": -3,
                    "created_utc": 1675770619.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I get that.  I've put up with things that I normally wouldn't if everything else is a green light, and I'm not even in a small market.  But I do take signs of distraction seriously, more difficult to overlook than, say, being late",
            "author": "Azurecole",
            "id": "j7ibvf9",
            "parent_id": "t1_j7ibfit",
            "score": 5,
            "created_utc": 1675728917.0,
            "replies": []
        },
        {
            "body": "Scarcity thinking versus abundance thinking will keep you trapped.",
            "author": "Dwight_Manfredi775",
            "id": "j9y3m8x",
            "parent_id": "t1_j7ibfit",
            "score": 1,
            "created_utc": 1677326871.0,
            "replies": []
        },
        {
            "body": "Please quote where I said “SBs are more vulnerable”. I didn’t bother reading or clicking the links because I never made that statement in the first place. I’m sure the link is useful, but not relevant right now. (I’m fully aware blackmail exists, but that’s almost a separate topic from the original post.) We’re discussing both parties fear of being strung along, or stiffed. I stated in more ways than one, that arrangements take compromise and potential loss from *both* parties. I’m not understanding what part you’re trying to rebut or disagree with? I also agree with you, & stated in my original comment that the girl in OP’s post (and any girl that expects, asks, or demands prematurely) is probably a scammer.",
            "author": "noneya3333",
            "id": "j7o3p2o",
            "parent_id": "t1_j7o2cle",
            "score": 3,
            "created_utc": 1675831375.0,
            "replies": [
                {
                    "body": "You never said that but it was implied (supposedly) by your first statement \"There are countless.....\". Since you have said that you statement never meant to show how vulnerable SBs are so I think we are good now (hopefully).\nLooks like we are almost probably on the same page just with different voices.",
                    "author": null,
                    "id": "j7o6noi",
                    "parent_id": "t1_j7o3p2o",
                    "score": 0,
                    "created_utc": 1675832947.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "It looks like you shared some AMP links. These should load faster, but AMP is controversial because of [concerns over privacy and the Open Web](https://www.reddit.com/r/AmputatorBot/comments/ehrq3z/why_did_i_build_amputatorbot).\n\nMaybe check out **the canonical pages** instead: \n\n- **[https://abcnews.go.com/Business/AheadoftheCurve/story?id=7578033&page=1](https://abcnews.go.com/Business/AheadoftheCurve/story?id=7578033&page=1)**\n\n- **[https://www.dailymail.co.uk/news/article-8594687/Sugar-baby-threatens-tell-fathers-family-raunchy-relationship-unless-pays-5-000.html](https://www.dailymail.co.uk/news/article-8594687/Sugar-baby-threatens-tell-fathers-family-raunchy-relationship-unless-pays-5-000.html)**\n\n*****\n\n ^(I'm a bot | )[^(Why & About)](https://www.reddit.com/r/AmputatorBot/comments/ehrq3z/why_did_i_build_amputatorbot)^( | )[^(Summon: u/AmputatorBot)](https://www.reddit.com/r/AmputatorBot/comments/cchly3/you_can_now_summon_amputatorbot/)",
            "author": "AmputatorBot",
            "id": "j7o2dkr",
            "parent_id": "t1_j7o2cle",
            "score": 1,
            "created_utc": 1675830665.0,
            "replies": []
        },
        {
            "body": "👍👍😁😁",
            "author": "UnearthlyDinosaur",
            "id": "j7j91lg",
            "parent_id": "t1_j7j37nz",
            "score": -2,
            "created_utc": 1675744550.0,
            "replies": []
        },
        {
            "body": "You can say that again… there’s an expression I once heard.”If you’re lucky you get old”.",
            "author": "surfrat54",
            "id": "j7j5wpe",
            "parent_id": "t1_j7irrpz",
            "score": 2,
            "created_utc": 1675742881.0,
            "replies": [
                {
                    "body": "Well that's true, I neve heard that before. Puts a whole new positive spin on it 🤣🤣",
                    "author": "Sunhillian",
                    "id": "j7j62u1",
                    "parent_id": "t1_j7j5wpe",
                    "score": 1,
                    "created_utc": 1675742967.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Having sex for money makes you a sex worker, paying under those conditions makes you a client",
            "author": "sassydegrassii",
            "id": "j7j6zel",
            "parent_id": "t1_j7i7i0u",
            "score": 1,
            "created_utc": 1675743446.0,
            "replies": [
                {
                    "body": "And if you take money from someone under the pretense of having sex with them and then refuse to have sex with them, that makes you even worse.",
                    "author": "NinCarolina",
                    "id": "j7j8gh4",
                    "parent_id": "t1_j7j6zel",
                    "score": 0,
                    "created_utc": 1675744230.0,
                    "replies": [
                        {
                            "body": "It’s not about being worse, it’s just calling a spade a spade",
                            "author": "sassydegrassii",
                            "id": "j7jd2dd",
                            "parent_id": "t1_j7j8gh4",
                            "score": 1,
                            "created_utc": 1675746830.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "unfortunately, it’s relevant to me",
            "author": "sassydegrassii",
            "id": "j7j7bo8",
            "parent_id": "t1_j7ikc3s",
            "score": 0,
            "created_utc": 1675743627.0,
            "replies": []
        },
        {
            "body": "If you pay only for sexual visits, you’re a John. It goes both ways. I don’t care if you’re insulted by that. Sex work isn’t a bad thing.  This is a matter of the whorearchy/whorephobia.",
            "author": "sassydegrassii",
            "id": "j7jd7g4",
            "parent_id": "t1_j7jcjw2",
            "score": 1,
            "created_utc": 1675746918.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "j7jex9r",
                    "parent_id": "t1_j7jd7g4",
                    "score": -1,
                    "created_utc": 1675747975.0,
                    "replies": [
                        {
                            "body": "I have multiple boards because I’m a sex worker of multiple practices. you don’t have to be high class to be into sugar, it’s proven in here every day",
                            "author": "sassydegrassii",
                            "id": "j7jgr63",
                            "parent_id": "t1_j7jex9r",
                            "score": 2,
                            "created_utc": 1675749154.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I think in that format you want to add some element of competition for the audience, say a model with no money vs SD, maybe throw in the average joe vanilla dater and see how their experiences compare, but also make sure its setup in a way that people actually understand how much bullshit men actually have to deal with.",
            "author": "karmaextract",
            "id": "j7ljos1",
            "parent_id": "t1_j7laskr",
            "score": 1,
            "created_utc": 1675792582.0,
            "replies": []
        },
        {
            "body": "Haha, well, I would like to see the old-timey country fair that had some of the kiss fests I've personally been involved in(some of which were honestly like \"only kissing\" and ended up being intimate on the couch), but I understand your point. And, btw, sorry, I did not look up and thought you were the OP, hence the \"being there\" component. IMO only someone who is sitting across from someone else can truly make an effective read on a situation, no matter how detailed the narrative.:)",
            "author": "SDInLeather",
            "id": "j7lx8ef",
            "parent_id": "t1_j7lm1c9",
            "score": 1,
            "created_utc": 1675797878.0,
            "replies": [
                {
                    "body": "Not to worry, it’s often challenging to keep up with who is responding to what.",
                    "author": "Chill_SD1974",
                    "id": "j7m8umt",
                    "parent_id": "t1_j7lx8ef",
                    "score": 2,
                    "created_utc": 1675802334.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "And agree, the overall flavor seems as if her attitude towards the whole thing was sucky.",
            "author": "SDInLeather",
            "id": "j7lxe6t",
            "parent_id": "t1_j7lm1c9",
            "score": 1,
            "created_utc": 1675797940.0,
            "replies": []
        },
        {
            "body": "Nah, she’s just a woman who was probably in a desperate financial position, thought her only chance to get what she needed was to fuck for money, and then at the last minute realized she couldn’t go through with it. \n\nThat’s not being a scammer. That’s being in an awful position, then realizing that you really don’t want to have sex with somebody you have no interest in as a financial transaction, and clearly articulating that boundary.",
            "author": "KetoSeaweed",
            "id": "j7kjg8v",
            "parent_id": "t1_j7kc3oz",
            "score": 3,
            "created_utc": 1675777639.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "j7j3zxy",
            "parent_id": "t1_j7j2m7u",
            "score": 0,
            "created_utc": 1675741917.0,
            "replies": [
                {
                    "body": "HE SAID THEY HAD DISCUSSED IT IN ADVANCE.\n\nI can’t believe you’re defending a scammer",
                    "author": "throwawayrtyggv",
                    "id": "j7kbyhy",
                    "parent_id": "t1_j7j3zxy",
                    "score": 1,
                    "created_utc": 1675773552.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I disagree, I think coffee is plenty for an initial meet n greet to see if yall vibe. If I were an SD, I wouldn't want to be paying a bunch of money for a nice dinner or whatever to then find out they suck like this girl does^^^^ I honestly hate the perspective that some women have on the site that they just get to get paid to go out to dinner/spend time whatever. Like no, the rest of us have had to put in work to make that money this is no easy life honey. I think the sugar life is glorified in media nowadays (thinking specifically female rappers). When people don't actually know what it takes. I wonder how young the girl was that OP went on a date with. If I had to guess she would be 18-20 w no experience on the site.",
            "author": "Elephantananda222",
            "id": "j7j8hj7",
            "parent_id": "t1_j7izb8h",
            "score": 5,
            "created_utc": 1675744246.0,
            "replies": [
                {
                    "body": "This is the type of response I admire! Most just think it’s one sided and take advantage. It should be beneficial for both sides. I unfortunately, am romantic type so it gets to the point I’m not sure if person likes me or my money.",
                    "author": "dynolas1",
                    "id": "j7ks4n3",
                    "parent_id": "t1_j7j8hj7",
                    "score": -4,
                    "created_utc": 1675781619.0,
                    "replies": []
                },
                {
                    "body": "Quality response here. Certainly agree that his prospective SB was seeking to be on his payroll for little to no effort of establishing connection on her part even going back on their word to entertain intimacy on the next date.",
                    "author": "Outrageous_Bat8429",
                    "id": "j7l9t3c",
                    "parent_id": "t1_j7j8hj7",
                    "score": 1,
                    "created_utc": 1675788786.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Might depend on how you fish. I exclusively M&G at coffee. I pride myself at being a decent and humorous conversationalist, a lot of the SB's are like \"is that so soon?\" when I remind them it has been 30 minutes, which is all I ask of their time, though frequently we have gone well over that. If those are bottom feeders, bring on more catfish, says I, because they have been wonders.",
            "author": "SDInLeather",
            "id": "j7k7h69",
            "parent_id": "t1_j7izb8h",
            "score": -3,
            "created_utc": 1675770619.0,
            "replies": []
        },
        {
            "body": "You never said that but it was implied (supposedly) by your first statement \"There are countless.....\". Since you have said that you statement never meant to show how vulnerable SBs are so I think we are good now (hopefully).\nLooks like we are almost probably on the same page just with different voices.",
            "author": null,
            "id": "j7o6noi",
            "parent_id": "t1_j7o3p2o",
            "score": 0,
            "created_utc": 1675832947.0,
            "replies": []
        },
        {
            "body": "Well that's true, I neve heard that before. Puts a whole new positive spin on it 🤣🤣",
            "author": "Sunhillian",
            "id": "j7j62u1",
            "parent_id": "t1_j7j5wpe",
            "score": 1,
            "created_utc": 1675742967.0,
            "replies": []
        },
        {
            "body": "And if you take money from someone under the pretense of having sex with them and then refuse to have sex with them, that makes you even worse.",
            "author": "NinCarolina",
            "id": "j7j8gh4",
            "parent_id": "t1_j7j6zel",
            "score": 0,
            "created_utc": 1675744230.0,
            "replies": [
                {
                    "body": "It’s not about being worse, it’s just calling a spade a spade",
                    "author": "sassydegrassii",
                    "id": "j7jd2dd",
                    "parent_id": "t1_j7j8gh4",
                    "score": 1,
                    "created_utc": 1675746830.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "j7jex9r",
            "parent_id": "t1_j7jd7g4",
            "score": -1,
            "created_utc": 1675747975.0,
            "replies": [
                {
                    "body": "I have multiple boards because I’m a sex worker of multiple practices. you don’t have to be high class to be into sugar, it’s proven in here every day",
                    "author": "sassydegrassii",
                    "id": "j7jgr63",
                    "parent_id": "t1_j7jex9r",
                    "score": 2,
                    "created_utc": 1675749154.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Not to worry, it’s often challenging to keep up with who is responding to what.",
            "author": "Chill_SD1974",
            "id": "j7m8umt",
            "parent_id": "t1_j7lx8ef",
            "score": 2,
            "created_utc": 1675802334.0,
            "replies": []
        },
        {
            "body": "HE SAID THEY HAD DISCUSSED IT IN ADVANCE.\n\nI can’t believe you’re defending a scammer",
            "author": "throwawayrtyggv",
            "id": "j7kbyhy",
            "parent_id": "t1_j7j3zxy",
            "score": 1,
            "created_utc": 1675773552.0,
            "replies": []
        },
        {
            "body": "This is the type of response I admire! Most just think it’s one sided and take advantage. It should be beneficial for both sides. I unfortunately, am romantic type so it gets to the point I’m not sure if person likes me or my money.",
            "author": "dynolas1",
            "id": "j7ks4n3",
            "parent_id": "t1_j7j8hj7",
            "score": -4,
            "created_utc": 1675781619.0,
            "replies": []
        },
        {
            "body": "Quality response here. Certainly agree that his prospective SB was seeking to be on his payroll for little to no effort of establishing connection on her part even going back on their word to entertain intimacy on the next date.",
            "author": "Outrageous_Bat8429",
            "id": "j7l9t3c",
            "parent_id": "t1_j7j8hj7",
            "score": 1,
            "created_utc": 1675788786.0,
            "replies": []
        },
        {
            "body": "It’s not about being worse, it’s just calling a spade a spade",
            "author": "sassydegrassii",
            "id": "j7jd2dd",
            "parent_id": "t1_j7j8gh4",
            "score": 1,
            "created_utc": 1675746830.0,
            "replies": []
        },
        {
            "body": "I have multiple boards because I’m a sex worker of multiple practices. you don’t have to be high class to be into sugar, it’s proven in here every day",
            "author": "sassydegrassii",
            "id": "j7jgr63",
            "parent_id": "t1_j7jex9r",
            "score": 2,
            "created_utc": 1675749154.0,
            "replies": []
        }
    ]
}