{
    "title": "Sukjin gives Somin a ride to the airport in new Jeeseokjin World youtube video",
    "post_id": "xlsooo",
    "post_url": "https://www.reddit.com/r/runningman/comments/xlsooo/sukjin_gives_somin_a_ride_to_the_airport_in_new/",
    "author": "botolsusu",
    "body": "",
    "url": "https://www.youtube.com/watch?v=YgEq-h4cAro",
    "score": 282,
    "upvote_ratio": 0.98,
    "created_utc": 1663925230.0,
    "num_comments": 63,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "Lmao, they're really playing that \"Suk Jin didn't drive Somin home\" shtick.",
            "author": "Sphincterinthenose",
            "id": "ipktx93",
            "parent_id": "t3_xlsooo",
            "score": 111,
            "created_utc": 1663925509.0,
            "replies": []
        },
        {
            "body": "i think this was when somin went on a trip with her parents. i wished sukjin had met somin's mom at the airport lol. \"noona, don't curse at me.\"",
            "author": "botolsusu",
            "id": "ipkuftu",
            "parent_id": "t3_xlsooo",
            "score": 66,
            "created_utc": 1663925992.0,
            "replies": [
                {
                    "body": "Does he translates the vid now? I could never watch the vid because it wasnt translated before",
                    "author": "naz_1992",
                    "id": "ipl12m9",
                    "parent_id": "t1_ipkuftu",
                    "score": 6,
                    "created_utc": 1663931483.0,
                    "replies": [
                        {
                            "body": "looking at his channel, all recent videos have [ENG] in the titles. this video with somin also had english subs when it first came out earlier.",
                            "author": "botolsusu",
                            "id": "ipl2kub",
                            "parent_id": "t1_ipl12m9",
                            "score": 27,
                            "created_utc": 1663932528.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "The conversation between the two was so rapid fire that I had to slow down the playback speed to keep up. A pity it was so short. Anticipating a part 2. Maybe he could pick her up from the airport next time.\nEdit: fixed grammar",
            "author": "Mission-Loquat9290",
            "id": "ipl99p2",
            "parent_id": "t3_xlsooo",
            "score": 24,
            "created_utc": 1663936721.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "ipky2gk",
            "parent_id": "t3_xlsooo",
            "score": 50,
            "created_utc": 1663929175.0,
            "replies": [
                {
                    "body": "I'm actually against that for JSM's sake.  Korean Entertainment News Media are vicious and has no ethics.  everything she does will be exaggerated and on all over the news.  Whenever SJH and JSM posts something on their instagram, there's clickbait articles in k-news about how sexy they are and their ... sizes.\n\nNot to mention she'll be overwhelmed by hate from SEA \"fans\"",
                    "author": "gyojoo",
                    "id": "iplxqxe",
                    "parent_id": "t1_ipky2gk",
                    "score": 21,
                    "created_utc": 1663948517.0,
                    "replies": [
                        {
                            "body": "I agree for Somin's sake I would be against her having a YouTube channel. They don't leave her alone on her own Instagram page. Imagine what they would say in the comments section of her YouTube channel. The actor Kwak Si Yang left a friendly comment under one of Somin's  holiday posts recently and in that same thread a person left a vile comment calling Somin evil and telling him to stay away from her. They did something similar when Ha Seok Jin posted a picture with Somin after he guested on Sixth Sense. Thankfully both Si Yang and Ha Seok Jin continue to comment on Somin's Instagram page.\nThere are certain people instructing Somin fans not to talk about the personal attacks/slander because 'it's not that bad now'. 🙄",
                            "author": "Mission-Loquat9290",
                            "id": "ipm6uwd",
                            "parent_id": "t1_iplxqxe",
                            "score": 24,
                            "created_utc": 1663952544.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "She is well-loved in Korea. If she makes a channel it's like opening a door from hell. Her YT will be overwhelmed by the so called \"fans\" from SEA.",
                    "author": "lookomma",
                    "id": "ipm9z6k",
                    "parent_id": "t1_ipky2gk",
                    "score": 14,
                    "created_utc": 1663953915.0,
                    "replies": [
                        {
                            "body": "We all know who those \"fans\" are. I'm pretty sure SJH herself knows as well. I mean, the rest of the cast sure do (JSJ saying we'll get criticized if we attack her), yet they keep silent. It is very difficult to justify this silence and respect the person when numerous people have been attacked because of her. \n\nI've said this before, but I can give accounts of other people sticking up for their co-workers or even people they don't really know so their fans either not attack them or stop. Why go far, prime example of such class act is JSM. She rarely posts pictures with another person before an episode to show off her outfit. When YSC came under fire for his tactless remarks in Ep587, JSM took to her Instagram and posted a picture with him from Ep588. This made a lot of people pull back because this sent the message: \"me and SeChan are good. No need for all you're doing.\" \n\nIt's not that hard to stick up to people. I will never understand how SJH can just look the other way and live with this. I'd be feeling guilty and ashamed all the time. But her fans never consider how what they do makes her feel and look to her co-workers. In fact, her toxic SEA fans might very well be the reason the cast are not close with her/feel uncomfortable with her.\n\nImportant edit: I do not mean to say SJH should feel ashamed or owes anyone anything. I'm saying there is an alternative way to handle it and that if it were me, I would've felt bad.",
                            "author": null,
                            "id": "ipmf1zx",
                            "parent_id": "t1_ipm9z6k",
                            "score": 31,
                            "created_utc": 1663956132.0,
                            "replies": [
                                {
                                    "body": "Not to mention her stylist got attacked because of her hair, she was quiet about it and later on she admitted that it was her who cut it when she was drunk. \n\nIf it wasn't to Yoo Jae Suk deffending the stylist the attack will never stop.",
                                    "author": "lookomma",
                                    "id": "ipmfzid",
                                    "parent_id": "t1_ipmf1zx",
                                    "score": 28,
                                    "created_utc": 1663956549.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "She has been using that caller ringtone for awhile now (5+ months?). Hope this segment will take off. Would love to see SJH and other RM members on it.\n\nEdit: Btw, I enjoy the interview-like quality of this segment. It's nice to hear some serious conversations from RM members, once in awhile. E.g. the conversations on their onscreen personas, the type of humor they prefer (wit or slapstick), maintaining relationships, work-life balance etc. Wish it was longer, tbh.",
            "author": "Arktoscircle",
            "id": "ipkwm15",
            "parent_id": "t3_xlsooo",
            "score": 44,
            "created_utc": 1663927929.0,
            "replies": [
                {
                    "body": "Low key wishing JSJ should make his own version of carpool karaoke with celeb guests. Would watch his channel more often.",
                    "author": "buddhabear07",
                    "id": "ipmxtyz",
                    "parent_id": "t1_ipkwm15",
                    "score": 19,
                    "created_utc": 1663964503.0,
                    "replies": [
                        {
                            "body": "That's a great idea. Would love to see some sing-alongs or quizzes on the segment. But, having songs on the channel are going to cost some money. And hopefully the format of carpool karaoke isn't trademarked.",
                            "author": "Arktoscircle",
                            "id": "ipncwdl",
                            "parent_id": "t1_ipmxtyz",
                            "score": 10,
                            "created_utc": 1663971213.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "I think SJH is definitely next. There's a photo of SJH at JSJ agency recently.",
                    "author": "Tod_on",
                    "id": "ipkylq2",
                    "parent_id": "t1_ipkwm15",
                    "score": 17,
                    "created_utc": 1663929610.0,
                    "replies": [
                        {
                            "body": "Wow, that's great news",
                            "author": "Arktoscircle",
                            "id": "ipl1c0w",
                            "parent_id": "t1_ipkylq2",
                            "score": 8,
                            "created_utc": 1663931672.0,
                            "replies": [
                                {
                                    "body": "This is the photo📷:\n\nhttps://www.instagram.com/p/Ch_oBELBD_s/?igshid=YmMyMTA2M2Y=\n\nYou can see the hashtag #jeeseokjinworld in the comment section as well, tagged by the poster himself.",
                                    "author": "Deroucadetoo",
                                    "id": "ipmlrvk",
                                    "parent_id": "t1_ipl1c0w",
                                    "score": 5,
                                    "created_utc": 1663959104.0,
                                    "replies": [
                                        {
                                            "body": "I'm always amazed by your ability to quickly find such information. Thank you for sharing",
                                            "author": "Arktoscircle",
                                            "id": "ipnd8t5",
                                            "parent_id": "t1_ipmlrvk",
                                            "score": 3,
                                            "created_utc": 1663971377.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "“our program is about fun” - Somin 2022\n\n“Somin isn't here to win, she is here to make it fun” - yoo jae seok to woo jae, episode 601.\n\nThat's the burden Somin is carrying, not winning or avoiding penalties, but actually make the show more entertaining to watch. This really shows how level-headed Somin is actually, and how much she cares for RM.",
            "author": "Minguri22",
            "id": "ipl98xn",
            "parent_id": "t3_xlsooo",
            "score": 62,
            "created_utc": 1663936709.0,
            "replies": [
                {
                    "body": "Same as Kwangsoo. Kwangsoo, Somin and Sukjin are there not to win but to make the show fun. In Sukjin case, it's not his choice but the casts decides he shouldn't win lol\n\nYou need a straight man like Jongkook and Jihyo to balance things out. \n\nRemember when Tom Cruise and the mission impossible casts guest on the show and played \"What's in the box?\" and it was almost awkward coz they thought it was actually a contest, they did not know the korean variety way was to squirm and scream. \n\nSome fans regard win-lose standing like it is Survivor. Of course Kwangsoo or Jaesuk would get the penalty coz it will be boring if the medium level penalty(non Nevis swing and standing on top of the plane) are done by others.\n\nAlthough, the few times Kwangsoo won, he made it look so epic.",
                    "author": "JADlloyd",
                    "id": "ipma7x7",
                    "parent_id": "t1_ipl98xn",
                    "score": 27,
                    "created_utc": 1663954022.0,
                    "replies": [
                        {
                            "body": "Totally agree. Plus, if they all become too competitive and went all out on each other on games, there risks of injuries, and the shooting may be too tiresome (it is actually tiresome as it is).\nSomin when she kind of give up and try not challenging others, specially the male cast, it make it easier for them too. It's not really a good sight and not funny when a guy goes all out on a women during a physical game, and he may be worried himself about the backlash that may result from it from the general public. So, she just let the oppas battle it in between them and step back without making it too obvious (ex: in the grap a chair game a couple of episodes back, you can see her not contesting from the start, eliminated 1st and used her time just dancing to the songs being played).\n\nEven LKS, when he is in a winning mood can contest against anyone, and you can also see KJK being flustered by it multiple times. It's not about who is too strong, cause KJK is obviously number 1, but if he over use his strength he may injure himself or LKS, and that he obviously does not want. Yet, he have an image of being the strongest to protect at the time, and finds himself in a dilemma. \n\nThere are just soo many hidden dynamics and unspoken rules, to make the shooting go smoothly and without incidents, cause they care for each other. Somin's way of helping, is by always taking the initiative, interacting and creating situations where other may join in and not just her (ex: she started the loveline with Sechan to help him out, cause he was falling behind at the time, or lovelines with guests to get them screetime cause they can find the timing to step in or not used to variety shows...). She delivers regular amounts of footage for the pds to edit and choose from. That reduce sometimes even the shooting hours and get the cast to rest earlier.\n\nEdit: wording",
                            "author": "Minguri22",
                            "id": "ipmg88y",
                            "parent_id": "t1_ipma7x7",
                            "score": 22,
                            "created_utc": 1663956656.0,
                            "replies": [
                                {
                                    "body": "Remember in the early days of RM they were actually very competitive (maybe because of the penalties). I think Song Joong Ki was one of the most competitive as he was new to variety shows those times. Anyway, maybe, the competitiveness of the members eventually toned down because of the injuries (and risk of injuries) they have suffered.",
                                    "author": "heavencatnip",
                                    "id": "ipn71wt",
                                    "parent_id": "t1_ipmg88y",
                                    "score": 3,
                                    "created_utc": 1663968573.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Can’t help noticing how lately RM members keep mentioning outside of RM that the lovelines are not real. Maybe the folks involved in the lovelines have become uncomfortable with it.",
            "author": "shimilimili",
            "id": "ipkze86",
            "parent_id": "t3_xlsooo",
            "score": 60,
            "created_utc": 1663930228.0,
            "replies": [
                {
                    "body": "Probably because the number of people who don’t understand that love lines are fake has become intolerable.",
                    "author": "UnderOurPants",
                    "id": "ipm0vao",
                    "parent_id": "t1_ipkze86",
                    "score": 45,
                    "created_utc": 1663949921.0,
                    "replies": []
                },
                {
                    "body": "There were people that were outraged at the joke love line between Seok Jin and Somin when they found a picture of Somin in his car in 491. I do wish that they played that joke here since Seok Jin definitely remembers it since he commented on it in \"Outrun.\"\n\nHong Jin Young in 392 made a comment of being harassed by Jong Kook fans. (Unsure whether it's fully shipper related or delusional Jong Kook fans thinking he belongs to them)\n\nYoon Eun Hye's CEO made a (Joke) comment to Jae Seok when she appeared in \"How Do You Play\" for him to take responsibility for her love life. \n\nEveryone in the entertainment industry is fully aware of extreme shipper netizens that they need to remind that it is just an act.",
                    "author": "areyousrs111",
                    "id": "ipok1mx",
                    "parent_id": "t1_ipkze86",
                    "score": 13,
                    "created_utc": 1663993980.0,
                    "replies": [
                        {
                            "body": "The forbidden love shouldn't be a joke though. In the Outrun, JSJ said it clearly that the manager set him up. Considering JSJ - JSM age gap (+ he's married and and has a son) the joke was too unnecessary. JSJ clearly was not comfortable when they teased him about the sticker and condemn the PD at that time by saying to not cut the scene because he has nothing to hide. Even asking JSM to deny it and stop the joke but the RM members keep on playing that forbidden love card. The fact that JSJ still wanted to clear things up in the 'Outrun' years after just show how disappointed he was with the joke. The outrage was justified.\n\nThis was one of the most unnecessary joke they played on JSJ imo. The other one was when they tried to accuse JSJ of cheating to his wife when he went on a trip to Vietnam not knowing JSJ actually went on to that trip together with his wife.",
                            "author": "Ideapad02",
                            "id": "ipt8rjr",
                            "parent_id": "t1_ipok1mx",
                            "score": 10,
                            "created_utc": 1664088627.0,
                            "replies": [
                                {
                                    "body": "Another one of such jokes in poor taste was the bank account his wife doesn't know about. They don't realize that these types of jokes really are not at the expense of JSJ but also his wife and son. \n\nBut the joke with JSJ and JSM was just way too uncomfortable. I'm glad they received backlash for it.",
                                    "author": null,
                                    "id": "iptw5aj",
                                    "parent_id": "t1_ipt8rjr",
                                    "score": 5,
                                    "created_utc": 1664107303.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "Do you happen to know which episode on outrun Sukjin talked about it or better yet, what exactly did he say?",
                            "author": null,
                            "id": "ipsg6na",
                            "parent_id": "t1_ipok1mx",
                            "score": 2,
                            "created_utc": 1664070648.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "This, and it actually prevents everyone involved from meeting 'right' person. \n\nI think they're increasingly telling everyone love lines are there for the shows.",
                    "author": "gyojoo",
                    "id": "iplxvyt",
                    "parent_id": "t1_ipkze86",
                    "score": 21,
                    "created_utc": 1663948582.0,
                    "replies": []
                },
                {
                    "body": "It’s always strange to see fans shipping real people. Even going as far as to tag them in posts",
                    "author": "magablossom",
                    "id": "ipofps6",
                    "parent_id": "t1_ipkze86",
                    "score": 2,
                    "created_utc": 1663991240.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "This is so sweet and at the same time quite an amazing move by JSJ.\n\nJust loved to see them both talking nonchalantly. \n\nJSM is such a cutie, and hats off to JSJ for thinking of this segment.",
            "author": "NavdeepNSG",
            "id": "ipkztww",
            "parent_id": "t3_xlsooo",
            "score": 43,
            "created_utc": 1663930565.0,
            "replies": [
                {
                    "body": "I don’t know where I heard it but it was revealed that JSJ is actually fond of JSM like a younger sister. So all the teasing they get about how they are not close to each other are only for the show.",
                    "author": "heavencatnip",
                    "id": "ipn5gu7",
                    "parent_id": "t1_ipkztww",
                    "score": 17,
                    "created_utc": 1663967864.0,
                    "replies": [
                        {
                            "body": "Wait, have they ever said that they're not close?",
                            "author": null,
                            "id": "ipncsg0",
                            "parent_id": "t1_ipn5gu7",
                            "score": 6,
                            "created_utc": 1663971161.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "This is such wholesome content. \n\nI am a big fan of their father daughter dynamic. This was a small glimpse into SoMin's mind, and I want more. She really is a genius.",
            "author": null,
            "id": "ipl86az",
            "parent_id": "t3_xlsooo",
            "score": 36,
            "created_utc": 1663936082.0,
            "replies": [
                {
                    "body": "Somin is a deep thinker. She has a poetic mind.  Her EQ is very high. Despite her kkangkkang role/image on RM, she is extremely intelligent. \nI saw a comment made under this video  (by a person called April who is pretending to be a Somin fan -a Tadpole ) mock praising  Somin for causing the distance between Jongkook and Jihyo and also causing a rift between Haha and Jihyo. She's also accusing Tadpoles of spreading hate against Jihyo on all media platforms.  She must follow the belief that if you repeat a lie enough people will start to see it as truth. 🙄",
                    "author": "Mission-Loquat9290",
                    "id": "iplavdz",
                    "parent_id": "t1_ipl86az",
                    "score": 29,
                    "created_utc": 1663937612.0,
                    "replies": [
                        {
                            "body": ">She's also accusing Tadpoles of spreading hate against Jihyo on all   \nmedia platforms.  She must follow the belief that if you repeat a lie   \nenough people will start to see it as truth. 🙄\n\nI hope more people become aware of this disinformation campaign and get savvy it to it. Learn to recognize it and reject it. \n\nBecause even on reddit, there are people that push that false narrative regularly whenever they have a chance - even if neither Jihyo nor Somin are mentioned first.",
                            "author": "it-s-luminescent",
                            "id": "iplfrv2",
                            "parent_id": "t1_iplavdz",
                            "score": 18,
                            "created_utc": 1663940154.0,
                            "replies": [
                                {
                                    "body": "It really is just misogyny. You don't see any other members getting this kind of treatment, because to these haters - JSM and SJH being woman is the reason for hate. Even their language is inherently misogynistic: treating adult women like children or fragile damsels in distress who need saving and protection and need to be treated with kid gloves, praising their bias for doing the absolute minimum, etc. Not to mention, especially on the recent few episodes, I have been seeing so many legitimately creepy comments on SJH's body. It makes me so angry to read those comments because it isn't them praising this beautiful woman; it's them sexualizing her and her body. As a big-breasted woman myself, I am highly aware of all of this. When I was younger and a lot thinner, I still had large boobs and I kid you not I used to judge men I first met by where they looked first when they saw me. A lot of men glance a look before they even meet your eyes. So seeing people leave those comments about SJH makes me uncomfortable. I don't know if they are her fans or just creeps, but it's immature and rude. Praise her for her beauty and admire it. But don't insult her and other women.",
                                    "author": null,
                                    "id": "ipljc76",
                                    "parent_id": "t1_iplfrv2",
                                    "score": 15,
                                    "created_utc": 1663941879.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "that april is not a somin fan..a troll maybe..her comment always wants to make other fandom hate somin..can watch a clip on her acc (if still there)..the profile pic also using the same pict that somin haters always use..",
                            "author": "Next_Topic3790",
                            "id": "ipld219",
                            "parent_id": "t1_iplavdz",
                            "score": 14,
                            "created_utc": 1663938777.0,
                            "replies": []
                        },
                        {
                            "body": "That account is quite well-known actually, they are Also on Instagram. I don't think there is anybody out there who thinks that nonsense is true, but I also didn't think there were people who actually thought spartace were in love; so...",
                            "author": null,
                            "id": "iplij5b",
                            "parent_id": "t1_iplavdz",
                            "score": 8,
                            "created_utc": 1663941494.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Such a nice thing to see RM members talk freely about their bts RM works. I hope JSJ continues this content. It would be crazy if he can invite LKS and have a small talk like this.",
            "author": "Pyeonsae",
            "id": "ipm79rl",
            "parent_id": "t3_xlsooo",
            "score": 14,
            "created_utc": 1663952728.0,
            "replies": []
        },
        {
            "body": "Love this, the insights during RM shooting. Like Sukjin said, she has innate talent for variety shows and on top of that she looks so good even with a simple attire.",
            "author": "honechan",
            "id": "ipkzng4",
            "parent_id": "t3_xlsooo",
            "score": 29,
            "created_utc": 1663930426.0,
            "replies": []
        },
        {
            "body": "This is such a wholesome segment. You always see how JSJ adores JSM in the show. He genuinely laughs at her antics. \n\nSomin always fascinates me because you just assume she's just good in variety and that's it. Well, she is but it's surprising how much thought and effort she puts into doing variety. Like she thinks about her screen tine while doing the show, she notices if she's doing great by the way the writer talks to her etc. She's much closer to Jaesuk in this sense how they think behind the scene aspects like how much quality content they're giving to the directors and editors.",
            "author": "JADlloyd",
            "id": "ipmbiau",
            "parent_id": "t3_xlsooo",
            "score": 27,
            "created_utc": 1663954572.0,
            "replies": []
        },
        {
            "body": "and also please subscribe!",
            "author": "Gotchapawn",
            "id": "ipku5xl",
            "parent_id": "t3_xlsooo",
            "score": 22,
            "created_utc": 1663925732.0,
            "replies": []
        },
        {
            "body": "I really admire how much JSM thoughts to make the show funny and not boring. She is really pro true entertainer. She strategically think what jokes and acts to mining the laughter.",
            "author": "MyGopek",
            "id": "ipl8vou",
            "parent_id": "t3_xlsooo",
            "score": 32,
            "created_utc": 1663936499.0,
            "replies": []
        },
        {
            "body": "Random thoughts:\n\n- BMWs look a bit \"too much\" from the outside these days but the interiour and sun roof look amazing. Some of his investments must have worked out after all. I do wonder what happend to the Jeesla though\n- Whoever edited this really made Somin shine and used a lot of nice pictures for her introduction. (This is not a rotten compliment but meant 100% positive)\n- Would like to see both of them together in more non-runningman shows. They are chatty and hilarious in the most random ways.\n- It's crazy how much I have grown to like Suk Jin Hyung over the years and in comparison to the start of RM. He has become a really positive person now",
            "author": "letuerk",
            "id": "iplogzm",
            "parent_id": "t3_xlsooo",
            "score": 27,
            "created_utc": 1663944300.0,
            "replies": [
                {
                    "body": "On the last point, me too. He really shines these couple years. \nThey need to vlogs, they're really fun chatty people. So many interesting topics.",
                    "author": "daikindes",
                    "id": "ipnhp5p",
                    "parent_id": "t1_iplogzm",
                    "score": 15,
                    "created_utc": 1663973488.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Fun fact. This concept is actually taken from JSJ's recent sponsored program ([T-Map Mobility](https://youtu.be/n3YE-h4TMWw)). It's nice to see JSJ really love the concept and continuing it on his channel.",
            "author": "Pyeonsae",
            "id": "ipmdtf0",
            "parent_id": "t3_xlsooo",
            "score": 9,
            "created_utc": 1663955581.0,
            "replies": []
        },
        {
            "body": "Guys, I love So Min so much I wanna protect this babi forever huhu",
            "author": "glassesinglamour",
            "id": "ipleoqf",
            "parent_id": "t3_xlsooo",
            "score": 26,
            "created_utc": 1663939604.0,
            "replies": [
                {
                    "body": "I once read a comment that said they wanted to steal (as in a good way) SoMin and teach her how things work 😂 I don't know why I found that so cute.",
                    "author": null,
                    "id": "ipljgpk",
                    "parent_id": "t1_ipleoqf",
                    "score": 10,
                    "created_utc": 1663941939.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Oh i think he told the members this in an episode before right? But of course they knew it was for filming lol",
            "author": "Ok-Squirrel693",
            "id": "iplugei",
            "parent_id": "t3_xlsooo",
            "score": 6,
            "created_utc": 1663947047.0,
            "replies": []
        },
        {
            "body": "HAHAHAHA tryna help his image innit 🤣🤣",
            "author": "lalaby21",
            "id": "ipkxk5u",
            "parent_id": "t3_xlsooo",
            "score": 12,
            "created_utc": 1663928747.0,
            "replies": []
        },
        {
            "body": "This definitely has the making of a good show going forward. I actually hope to see YSC![img](emote|t5_2u830|4971) appear on this show, given the type of conversations JSM![img](emote|t5_2u830|4974) & JSJ![img](emote|t5_2u830|4976) had on the car.\n\nI have really grown to like him & would love to see his insights into his work/life. We don't really get to see much of him other than his Variety Show personality, so this will be a great opportunity to know more about him.",
            "author": "Deroucadetoo",
            "id": "ipl3p4t",
            "parent_id": "t3_xlsooo",
            "score": 11,
            "created_utc": 1663933279.0,
            "replies": [
                {
                    "body": "YSC was actually the 1st RM member to appear (voice) on [JSJ world](https://youtu.be/D3x4CdMbplA). Many don't know but, outside of RM, JSJ and YSC had multiple shows together before (Sales King, Royal Adventure, Talk Hero etc). I really hope YSC can come and talk deeply with JSJ too\\^\\^. Btw, based on SJH fan account on IG, SJH might be the next guest for this content (there's a photo of SJH and JSJ outside of RM filming few weeks ago).",
                    "author": "Pyeonsae",
                    "id": "ipm66e8",
                    "parent_id": "t1_ipl3p4t",
                    "score": 9,
                    "created_utc": 1663952243.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I love their honest talk here. A big fan of Jeeseokjin World and been watching every week. Never really followed Somin before. But this talk just show how a sweet of a person she is.\r  \n\r  \nBased on the leaked photo by JSJ's staff, SJH will be the next guest for October. I hope they can talk freely and touch on their deep feeling like this episode too.",
            "author": "Tod_on",
            "id": "iplgyqe",
            "parent_id": "t3_xlsooo",
            "score": 11,
            "created_utc": 1663940739.0,
            "replies": [
                {
                    "body": "Can't wait for next episode. Fun segment.",
                    "author": "daikindes",
                    "id": "ipnhy5e",
                    "parent_id": "t1_iplgyqe",
                    "score": 4,
                    "created_utc": 1663973607.0,
                    "replies": []
                },
                {
                    "body": "For those who are curious, this is the photo📷:\n\nhttps://www.instagram.com/p/Ch_oBELBD_s/?igshid=YmMyMTA2M2Y=\n\nThe poster himself hashtagged #jeeseokjinworld in the comments too.",
                    "author": "Deroucadetoo",
                    "id": "ipml7rq",
                    "parent_id": "t1_iplgyqe",
                    "score": 5,
                    "created_utc": 1663958857.0,
                    "replies": []
                },
                {
                    "body": "SJH is much more comfortable outside of RM. I hope she opens up and doesn't stick to protecting her RM image, and I hope she talks about why she doesn't leave her home often. A lot of people struggle with that, myself included.",
                    "author": null,
                    "id": "ipljndf",
                    "parent_id": "t1_iplgyqe",
                    "score": 4,
                    "created_utc": 1663942029.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Are you telling me SukJin doesn't actually always roll a 1?",
            "author": "BusinessKangaroo",
            "id": "iplvdzh",
            "parent_id": "t3_xlsooo",
            "score": 3,
            "created_utc": 1663947464.0,
            "replies": []
        },
        {
            "body": "WHAT IS THE TITLE OF THE SONG IN SOMIN'S PHONE 1:08",
            "author": "Professional-Aioli94",
            "id": "iq7aidj",
            "parent_id": "t3_xlsooo",
            "score": 1,
            "created_utc": 1664342953.0,
            "replies": [
                {
                    "body": "[Do You Want To Hear](https://youtu.be/se4YnKDdxY4) by MSG Wannabe (M.O.M)",
                    "author": "Pyeonsae",
                    "id": "iq8bgxc",
                    "parent_id": "t1_iq7aidj",
                    "score": 4,
                    "created_utc": 1664370401.0,
                    "replies": []
                },
                {
                    "body": "I got a match with this song: \n\n**Uncle JoJo** by Dialgo (00:34; matched: `100%`)\n\nAlbum: `Lagos`. Released on `2020-10-23` by `Artlist Original`.",
                    "author": "auddbot",
                    "id": "iq7ajb6",
                    "parent_id": "t1_iq7aidj",
                    "score": 1,
                    "created_utc": 1664342972.0,
                    "replies": [
                        {
                            "body": "Links to the streaming platforms:\n\n[**Uncle JoJo** by Dialgo](https://lis.tn/UncleJoJo?t=34)\n\n*I am a bot and this action was performed automatically* | [GitHub](https://github.com/AudDMusic/RedditBot) [^(new issue)](https://github.com/AudDMusic/RedditBot/issues/new) | [Donate](https://github.com/AudDMusic/RedditBot/wiki/Please-consider-donating) ^(Please consider supporting me on Patreon or giving a star on GitHub. Music recognition costs a lot)",
                            "author": "auddbot",
                            "id": "iq7ajc4",
                            "parent_id": "t1_iq7ajb6",
                            "score": 1,
                            "created_utc": 1664342973.0,
                            "replies": [
                                {
                                    "body": "What r u talking about?",
                                    "author": "Professional-Aioli94",
                                    "id": "iq7aq6s",
                                    "parent_id": "t1_iq7ajc4",
                                    "score": 1,
                                    "created_utc": 1664343107.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Does he translates the vid now? I could never watch the vid because it wasnt translated before",
            "author": "naz_1992",
            "id": "ipl12m9",
            "parent_id": "t1_ipkuftu",
            "score": 6,
            "created_utc": 1663931483.0,
            "replies": [
                {
                    "body": "looking at his channel, all recent videos have [ENG] in the titles. this video with somin also had english subs when it first came out earlier.",
                    "author": "botolsusu",
                    "id": "ipl2kub",
                    "parent_id": "t1_ipl12m9",
                    "score": 27,
                    "created_utc": 1663932528.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I'm actually against that for JSM's sake.  Korean Entertainment News Media are vicious and has no ethics.  everything she does will be exaggerated and on all over the news.  Whenever SJH and JSM posts something on their instagram, there's clickbait articles in k-news about how sexy they are and their ... sizes.\n\nNot to mention she'll be overwhelmed by hate from SEA \"fans\"",
            "author": "gyojoo",
            "id": "iplxqxe",
            "parent_id": "t1_ipky2gk",
            "score": 21,
            "created_utc": 1663948517.0,
            "replies": [
                {
                    "body": "I agree for Somin's sake I would be against her having a YouTube channel. They don't leave her alone on her own Instagram page. Imagine what they would say in the comments section of her YouTube channel. The actor Kwak Si Yang left a friendly comment under one of Somin's  holiday posts recently and in that same thread a person left a vile comment calling Somin evil and telling him to stay away from her. They did something similar when Ha Seok Jin posted a picture with Somin after he guested on Sixth Sense. Thankfully both Si Yang and Ha Seok Jin continue to comment on Somin's Instagram page.\nThere are certain people instructing Somin fans not to talk about the personal attacks/slander because 'it's not that bad now'. 🙄",
                    "author": "Mission-Loquat9290",
                    "id": "ipm6uwd",
                    "parent_id": "t1_iplxqxe",
                    "score": 24,
                    "created_utc": 1663952544.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "She is well-loved in Korea. If she makes a channel it's like opening a door from hell. Her YT will be overwhelmed by the so called \"fans\" from SEA.",
            "author": "lookomma",
            "id": "ipm9z6k",
            "parent_id": "t1_ipky2gk",
            "score": 14,
            "created_utc": 1663953915.0,
            "replies": [
                {
                    "body": "We all know who those \"fans\" are. I'm pretty sure SJH herself knows as well. I mean, the rest of the cast sure do (JSJ saying we'll get criticized if we attack her), yet they keep silent. It is very difficult to justify this silence and respect the person when numerous people have been attacked because of her. \n\nI've said this before, but I can give accounts of other people sticking up for their co-workers or even people they don't really know so their fans either not attack them or stop. Why go far, prime example of such class act is JSM. She rarely posts pictures with another person before an episode to show off her outfit. When YSC came under fire for his tactless remarks in Ep587, JSM took to her Instagram and posted a picture with him from Ep588. This made a lot of people pull back because this sent the message: \"me and SeChan are good. No need for all you're doing.\" \n\nIt's not that hard to stick up to people. I will never understand how SJH can just look the other way and live with this. I'd be feeling guilty and ashamed all the time. But her fans never consider how what they do makes her feel and look to her co-workers. In fact, her toxic SEA fans might very well be the reason the cast are not close with her/feel uncomfortable with her.\n\nImportant edit: I do not mean to say SJH should feel ashamed or owes anyone anything. I'm saying there is an alternative way to handle it and that if it were me, I would've felt bad.",
                    "author": null,
                    "id": "ipmf1zx",
                    "parent_id": "t1_ipm9z6k",
                    "score": 31,
                    "created_utc": 1663956132.0,
                    "replies": [
                        {
                            "body": "Not to mention her stylist got attacked because of her hair, she was quiet about it and later on she admitted that it was her who cut it when she was drunk. \n\nIf it wasn't to Yoo Jae Suk deffending the stylist the attack will never stop.",
                            "author": "lookomma",
                            "id": "ipmfzid",
                            "parent_id": "t1_ipmf1zx",
                            "score": 28,
                            "created_utc": 1663956549.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Low key wishing JSJ should make his own version of carpool karaoke with celeb guests. Would watch his channel more often.",
            "author": "buddhabear07",
            "id": "ipmxtyz",
            "parent_id": "t1_ipkwm15",
            "score": 19,
            "created_utc": 1663964503.0,
            "replies": [
                {
                    "body": "That's a great idea. Would love to see some sing-alongs or quizzes on the segment. But, having songs on the channel are going to cost some money. And hopefully the format of carpool karaoke isn't trademarked.",
                    "author": "Arktoscircle",
                    "id": "ipncwdl",
                    "parent_id": "t1_ipmxtyz",
                    "score": 10,
                    "created_utc": 1663971213.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I think SJH is definitely next. There's a photo of SJH at JSJ agency recently.",
            "author": "Tod_on",
            "id": "ipkylq2",
            "parent_id": "t1_ipkwm15",
            "score": 17,
            "created_utc": 1663929610.0,
            "replies": [
                {
                    "body": "Wow, that's great news",
                    "author": "Arktoscircle",
                    "id": "ipl1c0w",
                    "parent_id": "t1_ipkylq2",
                    "score": 8,
                    "created_utc": 1663931672.0,
                    "replies": [
                        {
                            "body": "This is the photo📷:\n\nhttps://www.instagram.com/p/Ch_oBELBD_s/?igshid=YmMyMTA2M2Y=\n\nYou can see the hashtag #jeeseokjinworld in the comment section as well, tagged by the poster himself.",
                            "author": "Deroucadetoo",
                            "id": "ipmlrvk",
                            "parent_id": "t1_ipl1c0w",
                            "score": 5,
                            "created_utc": 1663959104.0,
                            "replies": [
                                {
                                    "body": "I'm always amazed by your ability to quickly find such information. Thank you for sharing",
                                    "author": "Arktoscircle",
                                    "id": "ipnd8t5",
                                    "parent_id": "t1_ipmlrvk",
                                    "score": 3,
                                    "created_utc": 1663971377.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Same as Kwangsoo. Kwangsoo, Somin and Sukjin are there not to win but to make the show fun. In Sukjin case, it's not his choice but the casts decides he shouldn't win lol\n\nYou need a straight man like Jongkook and Jihyo to balance things out. \n\nRemember when Tom Cruise and the mission impossible casts guest on the show and played \"What's in the box?\" and it was almost awkward coz they thought it was actually a contest, they did not know the korean variety way was to squirm and scream. \n\nSome fans regard win-lose standing like it is Survivor. Of course Kwangsoo or Jaesuk would get the penalty coz it will be boring if the medium level penalty(non Nevis swing and standing on top of the plane) are done by others.\n\nAlthough, the few times Kwangsoo won, he made it look so epic.",
            "author": "JADlloyd",
            "id": "ipma7x7",
            "parent_id": "t1_ipl98xn",
            "score": 27,
            "created_utc": 1663954022.0,
            "replies": [
                {
                    "body": "Totally agree. Plus, if they all become too competitive and went all out on each other on games, there risks of injuries, and the shooting may be too tiresome (it is actually tiresome as it is).\nSomin when she kind of give up and try not challenging others, specially the male cast, it make it easier for them too. It's not really a good sight and not funny when a guy goes all out on a women during a physical game, and he may be worried himself about the backlash that may result from it from the general public. So, she just let the oppas battle it in between them and step back without making it too obvious (ex: in the grap a chair game a couple of episodes back, you can see her not contesting from the start, eliminated 1st and used her time just dancing to the songs being played).\n\nEven LKS, when he is in a winning mood can contest against anyone, and you can also see KJK being flustered by it multiple times. It's not about who is too strong, cause KJK is obviously number 1, but if he over use his strength he may injure himself or LKS, and that he obviously does not want. Yet, he have an image of being the strongest to protect at the time, and finds himself in a dilemma. \n\nThere are just soo many hidden dynamics and unspoken rules, to make the shooting go smoothly and without incidents, cause they care for each other. Somin's way of helping, is by always taking the initiative, interacting and creating situations where other may join in and not just her (ex: she started the loveline with Sechan to help him out, cause he was falling behind at the time, or lovelines with guests to get them screetime cause they can find the timing to step in or not used to variety shows...). She delivers regular amounts of footage for the pds to edit and choose from. That reduce sometimes even the shooting hours and get the cast to rest earlier.\n\nEdit: wording",
                    "author": "Minguri22",
                    "id": "ipmg88y",
                    "parent_id": "t1_ipma7x7",
                    "score": 22,
                    "created_utc": 1663956656.0,
                    "replies": [
                        {
                            "body": "Remember in the early days of RM they were actually very competitive (maybe because of the penalties). I think Song Joong Ki was one of the most competitive as he was new to variety shows those times. Anyway, maybe, the competitiveness of the members eventually toned down because of the injuries (and risk of injuries) they have suffered.",
                            "author": "heavencatnip",
                            "id": "ipn71wt",
                            "parent_id": "t1_ipmg88y",
                            "score": 3,
                            "created_utc": 1663968573.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Probably because the number of people who don’t understand that love lines are fake has become intolerable.",
            "author": "UnderOurPants",
            "id": "ipm0vao",
            "parent_id": "t1_ipkze86",
            "score": 45,
            "created_utc": 1663949921.0,
            "replies": []
        },
        {
            "body": "There were people that were outraged at the joke love line between Seok Jin and Somin when they found a picture of Somin in his car in 491. I do wish that they played that joke here since Seok Jin definitely remembers it since he commented on it in \"Outrun.\"\n\nHong Jin Young in 392 made a comment of being harassed by Jong Kook fans. (Unsure whether it's fully shipper related or delusional Jong Kook fans thinking he belongs to them)\n\nYoon Eun Hye's CEO made a (Joke) comment to Jae Seok when she appeared in \"How Do You Play\" for him to take responsibility for her love life. \n\nEveryone in the entertainment industry is fully aware of extreme shipper netizens that they need to remind that it is just an act.",
            "author": "areyousrs111",
            "id": "ipok1mx",
            "parent_id": "t1_ipkze86",
            "score": 13,
            "created_utc": 1663993980.0,
            "replies": [
                {
                    "body": "The forbidden love shouldn't be a joke though. In the Outrun, JSJ said it clearly that the manager set him up. Considering JSJ - JSM age gap (+ he's married and and has a son) the joke was too unnecessary. JSJ clearly was not comfortable when they teased him about the sticker and condemn the PD at that time by saying to not cut the scene because he has nothing to hide. Even asking JSM to deny it and stop the joke but the RM members keep on playing that forbidden love card. The fact that JSJ still wanted to clear things up in the 'Outrun' years after just show how disappointed he was with the joke. The outrage was justified.\n\nThis was one of the most unnecessary joke they played on JSJ imo. The other one was when they tried to accuse JSJ of cheating to his wife when he went on a trip to Vietnam not knowing JSJ actually went on to that trip together with his wife.",
                    "author": "Ideapad02",
                    "id": "ipt8rjr",
                    "parent_id": "t1_ipok1mx",
                    "score": 10,
                    "created_utc": 1664088627.0,
                    "replies": [
                        {
                            "body": "Another one of such jokes in poor taste was the bank account his wife doesn't know about. They don't realize that these types of jokes really are not at the expense of JSJ but also his wife and son. \n\nBut the joke with JSJ and JSM was just way too uncomfortable. I'm glad they received backlash for it.",
                            "author": null,
                            "id": "iptw5aj",
                            "parent_id": "t1_ipt8rjr",
                            "score": 5,
                            "created_utc": 1664107303.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Do you happen to know which episode on outrun Sukjin talked about it or better yet, what exactly did he say?",
                    "author": null,
                    "id": "ipsg6na",
                    "parent_id": "t1_ipok1mx",
                    "score": 2,
                    "created_utc": 1664070648.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "This, and it actually prevents everyone involved from meeting 'right' person. \n\nI think they're increasingly telling everyone love lines are there for the shows.",
            "author": "gyojoo",
            "id": "iplxvyt",
            "parent_id": "t1_ipkze86",
            "score": 21,
            "created_utc": 1663948582.0,
            "replies": []
        },
        {
            "body": "It’s always strange to see fans shipping real people. Even going as far as to tag them in posts",
            "author": "magablossom",
            "id": "ipofps6",
            "parent_id": "t1_ipkze86",
            "score": 2,
            "created_utc": 1663991240.0,
            "replies": []
        },
        {
            "body": "I don’t know where I heard it but it was revealed that JSJ is actually fond of JSM like a younger sister. So all the teasing they get about how they are not close to each other are only for the show.",
            "author": "heavencatnip",
            "id": "ipn5gu7",
            "parent_id": "t1_ipkztww",
            "score": 17,
            "created_utc": 1663967864.0,
            "replies": [
                {
                    "body": "Wait, have they ever said that they're not close?",
                    "author": null,
                    "id": "ipncsg0",
                    "parent_id": "t1_ipn5gu7",
                    "score": 6,
                    "created_utc": 1663971161.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Somin is a deep thinker. She has a poetic mind.  Her EQ is very high. Despite her kkangkkang role/image on RM, she is extremely intelligent. \nI saw a comment made under this video  (by a person called April who is pretending to be a Somin fan -a Tadpole ) mock praising  Somin for causing the distance between Jongkook and Jihyo and also causing a rift between Haha and Jihyo. She's also accusing Tadpoles of spreading hate against Jihyo on all media platforms.  She must follow the belief that if you repeat a lie enough people will start to see it as truth. 🙄",
            "author": "Mission-Loquat9290",
            "id": "iplavdz",
            "parent_id": "t1_ipl86az",
            "score": 29,
            "created_utc": 1663937612.0,
            "replies": [
                {
                    "body": ">She's also accusing Tadpoles of spreading hate against Jihyo on all   \nmedia platforms.  She must follow the belief that if you repeat a lie   \nenough people will start to see it as truth. 🙄\n\nI hope more people become aware of this disinformation campaign and get savvy it to it. Learn to recognize it and reject it. \n\nBecause even on reddit, there are people that push that false narrative regularly whenever they have a chance - even if neither Jihyo nor Somin are mentioned first.",
                    "author": "it-s-luminescent",
                    "id": "iplfrv2",
                    "parent_id": "t1_iplavdz",
                    "score": 18,
                    "created_utc": 1663940154.0,
                    "replies": [
                        {
                            "body": "It really is just misogyny. You don't see any other members getting this kind of treatment, because to these haters - JSM and SJH being woman is the reason for hate. Even their language is inherently misogynistic: treating adult women like children or fragile damsels in distress who need saving and protection and need to be treated with kid gloves, praising their bias for doing the absolute minimum, etc. Not to mention, especially on the recent few episodes, I have been seeing so many legitimately creepy comments on SJH's body. It makes me so angry to read those comments because it isn't them praising this beautiful woman; it's them sexualizing her and her body. As a big-breasted woman myself, I am highly aware of all of this. When I was younger and a lot thinner, I still had large boobs and I kid you not I used to judge men I first met by where they looked first when they saw me. A lot of men glance a look before they even meet your eyes. So seeing people leave those comments about SJH makes me uncomfortable. I don't know if they are her fans or just creeps, but it's immature and rude. Praise her for her beauty and admire it. But don't insult her and other women.",
                            "author": null,
                            "id": "ipljc76",
                            "parent_id": "t1_iplfrv2",
                            "score": 15,
                            "created_utc": 1663941879.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "that april is not a somin fan..a troll maybe..her comment always wants to make other fandom hate somin..can watch a clip on her acc (if still there)..the profile pic also using the same pict that somin haters always use..",
                    "author": "Next_Topic3790",
                    "id": "ipld219",
                    "parent_id": "t1_iplavdz",
                    "score": 14,
                    "created_utc": 1663938777.0,
                    "replies": []
                },
                {
                    "body": "That account is quite well-known actually, they are Also on Instagram. I don't think there is anybody out there who thinks that nonsense is true, but I also didn't think there were people who actually thought spartace were in love; so...",
                    "author": null,
                    "id": "iplij5b",
                    "parent_id": "t1_iplavdz",
                    "score": 8,
                    "created_utc": 1663941494.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "On the last point, me too. He really shines these couple years. \nThey need to vlogs, they're really fun chatty people. So many interesting topics.",
            "author": "daikindes",
            "id": "ipnhp5p",
            "parent_id": "t1_iplogzm",
            "score": 15,
            "created_utc": 1663973488.0,
            "replies": []
        },
        {
            "body": "I once read a comment that said they wanted to steal (as in a good way) SoMin and teach her how things work 😂 I don't know why I found that so cute.",
            "author": null,
            "id": "ipljgpk",
            "parent_id": "t1_ipleoqf",
            "score": 10,
            "created_utc": 1663941939.0,
            "replies": []
        },
        {
            "body": "YSC was actually the 1st RM member to appear (voice) on [JSJ world](https://youtu.be/D3x4CdMbplA). Many don't know but, outside of RM, JSJ and YSC had multiple shows together before (Sales King, Royal Adventure, Talk Hero etc). I really hope YSC can come and talk deeply with JSJ too\\^\\^. Btw, based on SJH fan account on IG, SJH might be the next guest for this content (there's a photo of SJH and JSJ outside of RM filming few weeks ago).",
            "author": "Pyeonsae",
            "id": "ipm66e8",
            "parent_id": "t1_ipl3p4t",
            "score": 9,
            "created_utc": 1663952243.0,
            "replies": []
        },
        {
            "body": "Can't wait for next episode. Fun segment.",
            "author": "daikindes",
            "id": "ipnhy5e",
            "parent_id": "t1_iplgyqe",
            "score": 4,
            "created_utc": 1663973607.0,
            "replies": []
        },
        {
            "body": "For those who are curious, this is the photo📷:\n\nhttps://www.instagram.com/p/Ch_oBELBD_s/?igshid=YmMyMTA2M2Y=\n\nThe poster himself hashtagged #jeeseokjinworld in the comments too.",
            "author": "Deroucadetoo",
            "id": "ipml7rq",
            "parent_id": "t1_iplgyqe",
            "score": 5,
            "created_utc": 1663958857.0,
            "replies": []
        },
        {
            "body": "SJH is much more comfortable outside of RM. I hope she opens up and doesn't stick to protecting her RM image, and I hope she talks about why she doesn't leave her home often. A lot of people struggle with that, myself included.",
            "author": null,
            "id": "ipljndf",
            "parent_id": "t1_iplgyqe",
            "score": 4,
            "created_utc": 1663942029.0,
            "replies": []
        },
        {
            "body": "[Do You Want To Hear](https://youtu.be/se4YnKDdxY4) by MSG Wannabe (M.O.M)",
            "author": "Pyeonsae",
            "id": "iq8bgxc",
            "parent_id": "t1_iq7aidj",
            "score": 4,
            "created_utc": 1664370401.0,
            "replies": []
        },
        {
            "body": "I got a match with this song: \n\n**Uncle JoJo** by Dialgo (00:34; matched: `100%`)\n\nAlbum: `Lagos`. Released on `2020-10-23` by `Artlist Original`.",
            "author": "auddbot",
            "id": "iq7ajb6",
            "parent_id": "t1_iq7aidj",
            "score": 1,
            "created_utc": 1664342972.0,
            "replies": [
                {
                    "body": "Links to the streaming platforms:\n\n[**Uncle JoJo** by Dialgo](https://lis.tn/UncleJoJo?t=34)\n\n*I am a bot and this action was performed automatically* | [GitHub](https://github.com/AudDMusic/RedditBot) [^(new issue)](https://github.com/AudDMusic/RedditBot/issues/new) | [Donate](https://github.com/AudDMusic/RedditBot/wiki/Please-consider-donating) ^(Please consider supporting me on Patreon or giving a star on GitHub. Music recognition costs a lot)",
                    "author": "auddbot",
                    "id": "iq7ajc4",
                    "parent_id": "t1_iq7ajb6",
                    "score": 1,
                    "created_utc": 1664342973.0,
                    "replies": [
                        {
                            "body": "What r u talking about?",
                            "author": "Professional-Aioli94",
                            "id": "iq7aq6s",
                            "parent_id": "t1_iq7ajc4",
                            "score": 1,
                            "created_utc": 1664343107.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "looking at his channel, all recent videos have [ENG] in the titles. this video with somin also had english subs when it first came out earlier.",
            "author": "botolsusu",
            "id": "ipl2kub",
            "parent_id": "t1_ipl12m9",
            "score": 27,
            "created_utc": 1663932528.0,
            "replies": []
        },
        {
            "body": "I agree for Somin's sake I would be against her having a YouTube channel. They don't leave her alone on her own Instagram page. Imagine what they would say in the comments section of her YouTube channel. The actor Kwak Si Yang left a friendly comment under one of Somin's  holiday posts recently and in that same thread a person left a vile comment calling Somin evil and telling him to stay away from her. They did something similar when Ha Seok Jin posted a picture with Somin after he guested on Sixth Sense. Thankfully both Si Yang and Ha Seok Jin continue to comment on Somin's Instagram page.\nThere are certain people instructing Somin fans not to talk about the personal attacks/slander because 'it's not that bad now'. 🙄",
            "author": "Mission-Loquat9290",
            "id": "ipm6uwd",
            "parent_id": "t1_iplxqxe",
            "score": 24,
            "created_utc": 1663952544.0,
            "replies": []
        },
        {
            "body": "We all know who those \"fans\" are. I'm pretty sure SJH herself knows as well. I mean, the rest of the cast sure do (JSJ saying we'll get criticized if we attack her), yet they keep silent. It is very difficult to justify this silence and respect the person when numerous people have been attacked because of her. \n\nI've said this before, but I can give accounts of other people sticking up for their co-workers or even people they don't really know so their fans either not attack them or stop. Why go far, prime example of such class act is JSM. She rarely posts pictures with another person before an episode to show off her outfit. When YSC came under fire for his tactless remarks in Ep587, JSM took to her Instagram and posted a picture with him from Ep588. This made a lot of people pull back because this sent the message: \"me and SeChan are good. No need for all you're doing.\" \n\nIt's not that hard to stick up to people. I will never understand how SJH can just look the other way and live with this. I'd be feeling guilty and ashamed all the time. But her fans never consider how what they do makes her feel and look to her co-workers. In fact, her toxic SEA fans might very well be the reason the cast are not close with her/feel uncomfortable with her.\n\nImportant edit: I do not mean to say SJH should feel ashamed or owes anyone anything. I'm saying there is an alternative way to handle it and that if it were me, I would've felt bad.",
            "author": null,
            "id": "ipmf1zx",
            "parent_id": "t1_ipm9z6k",
            "score": 31,
            "created_utc": 1663956132.0,
            "replies": [
                {
                    "body": "Not to mention her stylist got attacked because of her hair, she was quiet about it and later on she admitted that it was her who cut it when she was drunk. \n\nIf it wasn't to Yoo Jae Suk deffending the stylist the attack will never stop.",
                    "author": "lookomma",
                    "id": "ipmfzid",
                    "parent_id": "t1_ipmf1zx",
                    "score": 28,
                    "created_utc": 1663956549.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "That's a great idea. Would love to see some sing-alongs or quizzes on the segment. But, having songs on the channel are going to cost some money. And hopefully the format of carpool karaoke isn't trademarked.",
            "author": "Arktoscircle",
            "id": "ipncwdl",
            "parent_id": "t1_ipmxtyz",
            "score": 10,
            "created_utc": 1663971213.0,
            "replies": []
        },
        {
            "body": "Wow, that's great news",
            "author": "Arktoscircle",
            "id": "ipl1c0w",
            "parent_id": "t1_ipkylq2",
            "score": 8,
            "created_utc": 1663931672.0,
            "replies": [
                {
                    "body": "This is the photo📷:\n\nhttps://www.instagram.com/p/Ch_oBELBD_s/?igshid=YmMyMTA2M2Y=\n\nYou can see the hashtag #jeeseokjinworld in the comment section as well, tagged by the poster himself.",
                    "author": "Deroucadetoo",
                    "id": "ipmlrvk",
                    "parent_id": "t1_ipl1c0w",
                    "score": 5,
                    "created_utc": 1663959104.0,
                    "replies": [
                        {
                            "body": "I'm always amazed by your ability to quickly find such information. Thank you for sharing",
                            "author": "Arktoscircle",
                            "id": "ipnd8t5",
                            "parent_id": "t1_ipmlrvk",
                            "score": 3,
                            "created_utc": 1663971377.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Totally agree. Plus, if they all become too competitive and went all out on each other on games, there risks of injuries, and the shooting may be too tiresome (it is actually tiresome as it is).\nSomin when she kind of give up and try not challenging others, specially the male cast, it make it easier for them too. It's not really a good sight and not funny when a guy goes all out on a women during a physical game, and he may be worried himself about the backlash that may result from it from the general public. So, she just let the oppas battle it in between them and step back without making it too obvious (ex: in the grap a chair game a couple of episodes back, you can see her not contesting from the start, eliminated 1st and used her time just dancing to the songs being played).\n\nEven LKS, when he is in a winning mood can contest against anyone, and you can also see KJK being flustered by it multiple times. It's not about who is too strong, cause KJK is obviously number 1, but if he over use his strength he may injure himself or LKS, and that he obviously does not want. Yet, he have an image of being the strongest to protect at the time, and finds himself in a dilemma. \n\nThere are just soo many hidden dynamics and unspoken rules, to make the shooting go smoothly and without incidents, cause they care for each other. Somin's way of helping, is by always taking the initiative, interacting and creating situations where other may join in and not just her (ex: she started the loveline with Sechan to help him out, cause he was falling behind at the time, or lovelines with guests to get them screetime cause they can find the timing to step in or not used to variety shows...). She delivers regular amounts of footage for the pds to edit and choose from. That reduce sometimes even the shooting hours and get the cast to rest earlier.\n\nEdit: wording",
            "author": "Minguri22",
            "id": "ipmg88y",
            "parent_id": "t1_ipma7x7",
            "score": 22,
            "created_utc": 1663956656.0,
            "replies": [
                {
                    "body": "Remember in the early days of RM they were actually very competitive (maybe because of the penalties). I think Song Joong Ki was one of the most competitive as he was new to variety shows those times. Anyway, maybe, the competitiveness of the members eventually toned down because of the injuries (and risk of injuries) they have suffered.",
                    "author": "heavencatnip",
                    "id": "ipn71wt",
                    "parent_id": "t1_ipmg88y",
                    "score": 3,
                    "created_utc": 1663968573.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "The forbidden love shouldn't be a joke though. In the Outrun, JSJ said it clearly that the manager set him up. Considering JSJ - JSM age gap (+ he's married and and has a son) the joke was too unnecessary. JSJ clearly was not comfortable when they teased him about the sticker and condemn the PD at that time by saying to not cut the scene because he has nothing to hide. Even asking JSM to deny it and stop the joke but the RM members keep on playing that forbidden love card. The fact that JSJ still wanted to clear things up in the 'Outrun' years after just show how disappointed he was with the joke. The outrage was justified.\n\nThis was one of the most unnecessary joke they played on JSJ imo. The other one was when they tried to accuse JSJ of cheating to his wife when he went on a trip to Vietnam not knowing JSJ actually went on to that trip together with his wife.",
            "author": "Ideapad02",
            "id": "ipt8rjr",
            "parent_id": "t1_ipok1mx",
            "score": 10,
            "created_utc": 1664088627.0,
            "replies": [
                {
                    "body": "Another one of such jokes in poor taste was the bank account his wife doesn't know about. They don't realize that these types of jokes really are not at the expense of JSJ but also his wife and son. \n\nBut the joke with JSJ and JSM was just way too uncomfortable. I'm glad they received backlash for it.",
                    "author": null,
                    "id": "iptw5aj",
                    "parent_id": "t1_ipt8rjr",
                    "score": 5,
                    "created_utc": 1664107303.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Do you happen to know which episode on outrun Sukjin talked about it or better yet, what exactly did he say?",
            "author": null,
            "id": "ipsg6na",
            "parent_id": "t1_ipok1mx",
            "score": 2,
            "created_utc": 1664070648.0,
            "replies": []
        },
        {
            "body": "Wait, have they ever said that they're not close?",
            "author": null,
            "id": "ipncsg0",
            "parent_id": "t1_ipn5gu7",
            "score": 6,
            "created_utc": 1663971161.0,
            "replies": []
        },
        {
            "body": ">She's also accusing Tadpoles of spreading hate against Jihyo on all   \nmedia platforms.  She must follow the belief that if you repeat a lie   \nenough people will start to see it as truth. 🙄\n\nI hope more people become aware of this disinformation campaign and get savvy it to it. Learn to recognize it and reject it. \n\nBecause even on reddit, there are people that push that false narrative regularly whenever they have a chance - even if neither Jihyo nor Somin are mentioned first.",
            "author": "it-s-luminescent",
            "id": "iplfrv2",
            "parent_id": "t1_iplavdz",
            "score": 18,
            "created_utc": 1663940154.0,
            "replies": [
                {
                    "body": "It really is just misogyny. You don't see any other members getting this kind of treatment, because to these haters - JSM and SJH being woman is the reason for hate. Even their language is inherently misogynistic: treating adult women like children or fragile damsels in distress who need saving and protection and need to be treated with kid gloves, praising their bias for doing the absolute minimum, etc. Not to mention, especially on the recent few episodes, I have been seeing so many legitimately creepy comments on SJH's body. It makes me so angry to read those comments because it isn't them praising this beautiful woman; it's them sexualizing her and her body. As a big-breasted woman myself, I am highly aware of all of this. When I was younger and a lot thinner, I still had large boobs and I kid you not I used to judge men I first met by where they looked first when they saw me. A lot of men glance a look before they even meet your eyes. So seeing people leave those comments about SJH makes me uncomfortable. I don't know if they are her fans or just creeps, but it's immature and rude. Praise her for her beauty and admire it. But don't insult her and other women.",
                    "author": null,
                    "id": "ipljc76",
                    "parent_id": "t1_iplfrv2",
                    "score": 15,
                    "created_utc": 1663941879.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "that april is not a somin fan..a troll maybe..her comment always wants to make other fandom hate somin..can watch a clip on her acc (if still there)..the profile pic also using the same pict that somin haters always use..",
            "author": "Next_Topic3790",
            "id": "ipld219",
            "parent_id": "t1_iplavdz",
            "score": 14,
            "created_utc": 1663938777.0,
            "replies": []
        },
        {
            "body": "That account is quite well-known actually, they are Also on Instagram. I don't think there is anybody out there who thinks that nonsense is true, but I also didn't think there were people who actually thought spartace were in love; so...",
            "author": null,
            "id": "iplij5b",
            "parent_id": "t1_iplavdz",
            "score": 8,
            "created_utc": 1663941494.0,
            "replies": []
        },
        {
            "body": "Links to the streaming platforms:\n\n[**Uncle JoJo** by Dialgo](https://lis.tn/UncleJoJo?t=34)\n\n*I am a bot and this action was performed automatically* | [GitHub](https://github.com/AudDMusic/RedditBot) [^(new issue)](https://github.com/AudDMusic/RedditBot/issues/new) | [Donate](https://github.com/AudDMusic/RedditBot/wiki/Please-consider-donating) ^(Please consider supporting me on Patreon or giving a star on GitHub. Music recognition costs a lot)",
            "author": "auddbot",
            "id": "iq7ajc4",
            "parent_id": "t1_iq7ajb6",
            "score": 1,
            "created_utc": 1664342973.0,
            "replies": [
                {
                    "body": "What r u talking about?",
                    "author": "Professional-Aioli94",
                    "id": "iq7aq6s",
                    "parent_id": "t1_iq7ajc4",
                    "score": 1,
                    "created_utc": 1664343107.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Not to mention her stylist got attacked because of her hair, she was quiet about it and later on she admitted that it was her who cut it when she was drunk. \n\nIf it wasn't to Yoo Jae Suk deffending the stylist the attack will never stop.",
            "author": "lookomma",
            "id": "ipmfzid",
            "parent_id": "t1_ipmf1zx",
            "score": 28,
            "created_utc": 1663956549.0,
            "replies": []
        },
        {
            "body": "This is the photo📷:\n\nhttps://www.instagram.com/p/Ch_oBELBD_s/?igshid=YmMyMTA2M2Y=\n\nYou can see the hashtag #jeeseokjinworld in the comment section as well, tagged by the poster himself.",
            "author": "Deroucadetoo",
            "id": "ipmlrvk",
            "parent_id": "t1_ipl1c0w",
            "score": 5,
            "created_utc": 1663959104.0,
            "replies": [
                {
                    "body": "I'm always amazed by your ability to quickly find such information. Thank you for sharing",
                    "author": "Arktoscircle",
                    "id": "ipnd8t5",
                    "parent_id": "t1_ipmlrvk",
                    "score": 3,
                    "created_utc": 1663971377.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Remember in the early days of RM they were actually very competitive (maybe because of the penalties). I think Song Joong Ki was one of the most competitive as he was new to variety shows those times. Anyway, maybe, the competitiveness of the members eventually toned down because of the injuries (and risk of injuries) they have suffered.",
            "author": "heavencatnip",
            "id": "ipn71wt",
            "parent_id": "t1_ipmg88y",
            "score": 3,
            "created_utc": 1663968573.0,
            "replies": []
        },
        {
            "body": "Another one of such jokes in poor taste was the bank account his wife doesn't know about. They don't realize that these types of jokes really are not at the expense of JSJ but also his wife and son. \n\nBut the joke with JSJ and JSM was just way too uncomfortable. I'm glad they received backlash for it.",
            "author": null,
            "id": "iptw5aj",
            "parent_id": "t1_ipt8rjr",
            "score": 5,
            "created_utc": 1664107303.0,
            "replies": []
        },
        {
            "body": "It really is just misogyny. You don't see any other members getting this kind of treatment, because to these haters - JSM and SJH being woman is the reason for hate. Even their language is inherently misogynistic: treating adult women like children or fragile damsels in distress who need saving and protection and need to be treated with kid gloves, praising their bias for doing the absolute minimum, etc. Not to mention, especially on the recent few episodes, I have been seeing so many legitimately creepy comments on SJH's body. It makes me so angry to read those comments because it isn't them praising this beautiful woman; it's them sexualizing her and her body. As a big-breasted woman myself, I am highly aware of all of this. When I was younger and a lot thinner, I still had large boobs and I kid you not I used to judge men I first met by where they looked first when they saw me. A lot of men glance a look before they even meet your eyes. So seeing people leave those comments about SJH makes me uncomfortable. I don't know if they are her fans or just creeps, but it's immature and rude. Praise her for her beauty and admire it. But don't insult her and other women.",
            "author": null,
            "id": "ipljc76",
            "parent_id": "t1_iplfrv2",
            "score": 15,
            "created_utc": 1663941879.0,
            "replies": []
        },
        {
            "body": "What r u talking about?",
            "author": "Professional-Aioli94",
            "id": "iq7aq6s",
            "parent_id": "t1_iq7ajc4",
            "score": 1,
            "created_utc": 1664343107.0,
            "replies": []
        },
        {
            "body": "I'm always amazed by your ability to quickly find such information. Thank you for sharing",
            "author": "Arktoscircle",
            "id": "ipnd8t5",
            "parent_id": "t1_ipmlrvk",
            "score": 3,
            "created_utc": 1663971377.0,
            "replies": []
        }
    ]
}