{
    "title": "Like, the Uchihas get a novel worth of explanations while Uzumaki get a few paragraphs",
    "post_id": "xg24ep",
    "post_url": "https://www.reddit.com/r/dankruto/comments/xg24ep/like_the_uchihas_get_a_novel_worth_of/",
    "author": "ConanCimmerian",
    "body": "",
    "url": "https://i.redd.it/tcln0anl6ao91.jpg",
    "score": 3817,
    "upvote_ratio": 0.99,
    "created_utc": 1663360285.0,
    "num_comments": 98,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "Kishimoto explaining what happened to the senju: the what",
            "author": "Sad-Buddy-5293",
            "id": "iopx3du",
            "parent_id": "t3_xg24ep",
            "score": 627,
            "created_utc": 1663364102.0,
            "replies": [
                {
                    "body": ">Kishimoto explaining what happened to the senju: the what\n\nThat's good question.\nWhat DID happen to the Senju's? Did they all went extinct?",
                    "author": "KayWiszmanski",
                    "id": "ioq94lu",
                    "parent_id": "t1_iopx3du",
                    "score": 208,
                    "created_utc": 1663369430.0,
                    "replies": [
                        {
                            "body": "Their spirits live on in Tsunade's gigantic boobs.",
                            "author": "Phantom_Beef",
                            "id": "ioqurit",
                            "parent_id": "t1_ioq94lu",
                            "score": 221,
                            "created_utc": 1663379837.0,
                            "replies": []
                        },
                        {
                            "body": "I think they just merged and bred with everyone in konoha",
                            "author": "DopeEspeon",
                            "id": "ioqddrd",
                            "parent_id": "t1_ioq94lu",
                            "score": 187,
                            "created_utc": 1663371447.0,
                            "replies": [
                                {
                                    "body": "And none of them were worthy of keeping the Senju name? There should still be _some_ Senju around - it’s not like they only ever had daughters or something.",
                                    "author": "Slight-Pound",
                                    "id": "ioqzwwh",
                                    "parent_id": "t1_ioqddrd",
                                    "score": 154,
                                    "created_utc": 1663382391.0,
                                    "replies": [
                                        {
                                            "body": "Madara's ghost came and used the Sharingan to convince the Senju's to change their surname cause they were so much weaker than Hashirama.",
                                            "author": "Few_Pay_5313",
                                            "id": "ior7y1c",
                                            "parent_id": "t1_ioqzwwh",
                                            "score": 113,
                                            "created_utc": 1663386702.0,
                                            "replies": [
                                                {
                                                    "body": "He probably would've done/said the same to the Uchihas, but foresaw Itachi take care of that problem",
                                                    "author": null,
                                                    "id": "iorp29f",
                                                    "parent_id": "t1_ior7y1c",
                                                    "score": 48,
                                                    "created_utc": 1663398193.0,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "body": "No, Hashirama and tobirama decided as the clan elders that they should take others names and propagate their genes throughout the village, as opposed to the Uchiha who chose inbreeding and an insular clan system. The Senju genes being widespread across the village is why the hidden leaf is the strongest village as a whole.",
                                            "author": "elementnix",
                                            "id": "iori9rm",
                                            "parent_id": "t1_ioqzwwh",
                                            "score": 54,
                                            "created_utc": 1663393182.0,
                                            "replies": [
                                                {
                                                    "body": "That's headcanon, you know that right?\nLike literally everything you have just said it's made up.",
                                                    "author": "frenin",
                                                    "id": "iorjded",
                                                    "parent_id": "t1_iori9rm",
                                                    "score": 86,
                                                    "created_utc": 1663393954.0,
                                                    "replies": [
                                                        {
                                                            "body": "Source: I made it up",
                                                            "author": "elementnix",
                                                            "id": "iorjea4",
                                                            "parent_id": "t1_iorjded",
                                                            "score": 73,
                                                            "created_utc": 1663393972.0,
                                                            "replies": []
                                                        },
                                                        {
                                                            "body": "Hashirama did ordered them to marry other clans but nothing has been said about taking other family names",
                                                            "author": "Background_69_69",
                                                            "id": "iork2p1",
                                                            "parent_id": "t1_iorjded",
                                                            "score": 16,
                                                            "created_utc": 1663394473.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Where's said that he did?",
                                                                    "author": "frenin",
                                                                    "id": "iorkm5k",
                                                                    "parent_id": "t1_iork2p1",
                                                                    "score": 15,
                                                                    "created_utc": 1663394860.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "Novels",
                                                                            "author": "Background_69_69",
                                                                            "id": "iorkw2k",
                                                                            "parent_id": "t1_iorkm5k",
                                                                            "score": 6,
                                                                            "created_utc": 1663395062.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "I have read them and it certainly doesn't say so.\nIt does say that some Senju married out but not that it was a policy and never that it was so prominent that it literally made them die out.",
                                                                                    "author": "frenin",
                                                                                    "id": "iorl21l",
                                                                                    "parent_id": "t1_iorkw2k",
                                                                                    "score": 19,
                                                                                    "created_utc": 1663395186.0,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "body": "It’s a feasible explanation. I mean only two clans were supposed to have the power of chakra but we saw so many other clans with that power. Senju’s spread their genes among other clans like Uzumaki clan is also derived from Senju.",
                                                    "author": "Rohan-kun",
                                                    "id": "iork16c",
                                                    "parent_id": "t1_iori9rm",
                                                    "score": 11,
                                                    "created_utc": 1663394442.0,
                                                    "replies": [
                                                        {
                                                            "body": "only 2 clans? every single living breathing thing has chakra. there are literal ninja dogs and turtles. these two clans were just so much stronger than most other clans that most other clans didn’t bother to fight them. but you are right senju did spread around their genes, like uzumaki and sarutobi",
                                                            "author": "SmegmaLord420",
                                                            "id": "iorrdkd",
                                                            "parent_id": "t1_iork16c",
                                                            "score": 12,
                                                            "created_utc": 1663400024.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Yes, I mistook chakra with Ninshu.",
                                                                    "author": "Rohan-kun",
                                                                    "id": "ioryn5b",
                                                                    "parent_id": "t1_iorrdkd",
                                                                    "score": 3,
                                                                    "created_utc": 1663405902.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "body": "The Uchiha Clan isn't inbreeding. That's like saying every Japanese, African or Swedish person is inbreeding.\n\nAlso the Uchiha Clan has a sister clan called the Fūma Clan in Part 2 & Bort.",
                                                    "author": "Successful_Ad9924354",
                                                    "id": "ip1c9m2",
                                                    "parent_id": "t1_iori9rm",
                                                    "score": 0,
                                                    "created_utc": 1663572516.0,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "body": "People's head canon is that Hashirama told them to take their spouses family names. I think Sakura is probably mostly a Senju because it makes no sense for her to be able to just emulate Tsunade and be one of the strongest ninja in konoha during Boruto",
                                            "author": "Background_69_69",
                                            "id": "iorjxf4",
                                            "parent_id": "t1_ioqzwwh",
                                            "score": 6,
                                            "created_utc": 1663394363.0,
                                            "replies": [
                                                {
                                                    "body": "That makes some sense, but you’d think they wouldn’t still treat the Senju as literally dying out still. They’re still Senju in blood, and they aren’t _that_ many generations removed from that initial decision, and it’s still weird that ALL of them agreed to it, too. The emphasis on clan techniques and power wouldn’t let their name legacy stay quiet, either. Everyone would be paying a lot of attention to Senju descendants.\n\nI’m more confused how they don’t keep up a community with each other, same name or not. They were still raised as siblings and cousins - family you can still reach out to. Tsunade seemed so isolated with Hashirama and Tobirama as her only family connections other than Nawaki. No other uncles, aunts, or cousins she was raised with, and presumably parents that died early on. This would make more sense if the Senju had already been getting pretty small by the countries founding, and it wasn’t.\n\nI’m fine with Sakura emulating her because I’m sick and tired of the only “good” ninjas coming from insane legacies. I want to have this, at least. Let the underdog narrative exist in more than just Lee.",
                                                    "author": "Slight-Pound",
                                                    "id": "iorndud",
                                                    "parent_id": "t1_iorjxf4",
                                                    "score": 21,
                                                    "created_utc": 1663396908.0,
                                                    "replies": [
                                                        {
                                                            "body": "The thing is that Tsunade's techniques are borderline senju exclusive because of the insane amounts of chakra and also ridiculous physical strength is a Senju trait. \n\nI think the head canon makes way more sense than the idea that the senju got wiped out during the wars or whatever because there was a ton of Uchiha and those guys were their equals and somehow the Hyugas straight up supplanted the Senju as the village rulers (remember the Hyugas were supposed to be the strongest clan and the Byakugan was supposed to be stronger than the sharingan lol good times)...\n\nMaybe the bulk of the Senju got absorbed into the Hyugas",
                                                            "author": "Background_69_69",
                                                            "id": "iorpfah",
                                                            "parent_id": "t1_iorndud",
                                                            "score": 13,
                                                            "created_utc": 1663398469.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Yeah, that’s fair. I still would have liked more non-clan powerhouses in this show. It also reminds me of how we used to think Sakura could be a poison/illusion specialist before Tsunade seriously entered the narrative. What a time.\n\nThe headcanon makes the best sense out of the nonsensical writing of _why_ the Senju were wiped out during peace times, for sure. The other ninja clans of Naruto deserved better, really.\n\nI remember hoping for more Hyuuga world-building after meeting Neji in the Chuunin Exam and meeting Hinata and Neji again after the timeskip. I thought it would be a great way to really introduce making Hinata and Naruto friends - through learning about her clan and how Neji has found a way to thrive despite its shackles. I was, of course, devastatingly wrong. Kept waiting for other clans beside the Uchiha to get a turn, to no avail.\n\nThe Hyuuga’s seem like even bigger “blood purists” than the Uchiha’s give the air of, so I doubt it. I also doubt the Senju would be too chill about the Main/Side Branch thing, too. I think they became parts of civilian families for the most part, and some minor clans like the Ino-Shika-Chou. They seem chill enough to mingle with.",
                                                                    "author": "Slight-Pound",
                                                                    "id": "iorrnfp",
                                                                    "parent_id": "t1_iorpfah",
                                                                    "score": 6,
                                                                    "created_utc": 1663400240.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "It would be hilarious if Sarada just awoke the Rinegan out of nowhere because of the blood lines and learning the techniques developed by Tsunade despite it taking hundreds of years and a ridiculously complicated plan  to awaken it once",
                                                                            "author": "Background_69_69",
                                                                            "id": "iorsq6q",
                                                                            "parent_id": "t1_iorrnfp",
                                                                            "score": 2,
                                                                            "created_utc": 1663401095.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "I’m honestly surprised something like that hasn’t happened yet.",
                                                                                    "author": "Slight-Pound",
                                                                                    "id": "iorsuxa",
                                                                                    "parent_id": "t1_iorsq6q",
                                                                                    "score": 1,
                                                                                    "created_utc": 1663401204.0,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "body": "No, I don't remember because the Byakugan was never said to be stronger than the Sharingan. In canon Kishimoto had Kakashi say that the Byakugan is only superior in sight AKA distance.",
                                                                    "author": "Successful_Ad9924354",
                                                                    "id": "ip1cg8t",
                                                                    "parent_id": "t1_iorpfah",
                                                                    "score": 1,
                                                                    "created_utc": 1663572675.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "body": "\"senju\" is a clan name. so if you join another clan, you use that clan name not \"senju\".",
                                            "author": "nizzy2k11",
                                            "id": "iosxbeq",
                                            "parent_id": "t1_ioqzwwh",
                                            "score": 1,
                                            "created_utc": 1663426549.0,
                                            "replies": [
                                                {
                                                    "body": "That’s the thing - I doubt _all_ of them joined clans (I think a lot of them joined regular/civilian families, too) and even then, no one joined _theirs?_ Absolutely no one? No one wanted to have their family be called Senju like they were? Sons are also often the ones to carry the family name, and their wives and kids carry that name as a result. That’s why I mentioned “only having daughters” in the first place. Because that clearly _wasn’t_ the case.\n\n_That’s_ what doesn’t make sense. They’re not the only clan in Konoha that might have intermingled with others, either - the Ino-Shika-Chou is a group I think would most likely do something similar, but _they_ are still around, and they seemed smaller than the Senju, so why aren’t the Senju? The Senju were just unnecessarily written out of the story and there isn’t a lot of reasonable excuses to make sense of it - or rather, there shouldn’t have to be.\n\nEdit: the last line",
                                                    "author": "Slight-Pound",
                                                    "id": "ioszdq1",
                                                    "parent_id": "t1_iosxbeq",
                                                    "score": 2,
                                                    "created_utc": 1663427440.0,
                                                    "replies": [
                                                        {
                                                            "body": "It was never said that those with the name senju were a significant part of the alliance, just that they were powerful. The 3 sanin alone could take out thousands of rank and file ninja, it wouldn't take much to be powerful with good training.",
                                                            "author": "nizzy2k11",
                                                            "id": "iot6hnx",
                                                            "parent_id": "t1_ioszdq1",
                                                            "score": 1,
                                                            "created_utc": 1663430409.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "body": "People with the senju name were deliberately targeted on the battlefield by enemy operativesm like Nawaki. \nGiving up the last name was probably the safest option.",
                                            "author": "depressed_panda0191",
                                            "id": "iousane",
                                            "parent_id": "t1_ioqzwwh",
                                            "score": 1,
                                            "created_utc": 1663454948.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "Apparently. Don’t know how that worked, considering that both the Uchiha and the Senju were sizable, and we had no reason to believe that the Senju were dying out from something like fertility issues _before._ It really doesn’t make much sense.",
                            "author": "Slight-Pound",
                            "id": "ioqzttd",
                            "parent_id": "t1_ioq94lu",
                            "score": 29,
                            "created_utc": 1663382346.0,
                            "replies": [
                                {
                                    "body": "tsunades tatas are sizable \n\nohhhhhh",
                                    "author": "God_Of_Asscheeks",
                                    "id": "ior3jkc",
                                    "parent_id": "t1_ioqzttd",
                                    "score": 4,
                                    "created_utc": 1663384288.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "*go",
                            "author": "NameOfNoSignificance",
                            "id": "iornwl3",
                            "parent_id": "t1_ioq94lu",
                            "score": 2,
                            "created_utc": 1663397298.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Kishimoto explaining how Itachi got a hold of the most broken weapones in the whole universe that somehow fit on a susano'o",
                    "author": "Similor",
                    "id": "ioq2ur6",
                    "parent_id": "t1_iopx3du",
                    "score": 146,
                    "created_utc": 1663366606.0,
                    "replies": [
                        {
                            "body": ">Kishimoto explaining how Itachi got a hold of the most broken weapones in the whole universe that somehow fit on a susano'o\n\nMy theory was that Yata Mirror and Totsuka Blade just adjust to size of User or to his will, otherwise it makes no fucking sense. Like, what use would have any non Uchiha Shinobi with a sword 10x his size?",
                            "author": "KayWiszmanski",
                            "id": "ioq903j",
                            "parent_id": "t1_ioq2ur6",
                            "score": 83,
                            "created_utc": 1663369372.0,
                            "replies": []
                        },
                        {
                            "body": "Maybe he took it off his fellow Uchiha during the massacre?",
                            "author": "CaptainPragmatism",
                            "id": "iorsvsk",
                            "parent_id": "t1_ioq2ur6",
                            "score": 2,
                            "created_utc": 1663401224.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "*Kishimoto expanding on uchihas for the 12th time*\n\nOh how awful. What about plans to flesh out the senju?\n\nTo shreds you say? Tsk tsk tsk.\n\nWell how’s the other clans backstories holding up?\n\nTo shreds you say? Tsk tsk tsk.",
                    "author": "TriforceofSwag",
                    "id": "ior680n",
                    "parent_id": "t1_iopx3du",
                    "score": 19,
                    "created_utc": 1663385739.0,
                    "replies": []
                },
                {
                    "body": "People forget but the Senju & Uzumaki wasn't supposed to be a clan. Kishimoto created them halfway before part 2 was done.",
                    "author": "Successful_Ad9924354",
                    "id": "ip1c0zl",
                    "parent_id": "t1_iopx3du",
                    "score": 1,
                    "created_utc": 1663572307.0,
                    "replies": [
                        {
                            "body": "But Narutos last name was Uzumaki ?\n\nAnd Hashirama and Tobirama existed already ?",
                            "author": "cracked_camel",
                            "id": "ire0e5r",
                            "parent_id": "t1_ip1c0zl",
                            "score": 1,
                            "created_utc": 1665138017.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Yeah fr, man did the senjus and uzumakis dirty",
            "author": "DopeEspeon",
            "id": "ioqdba0",
            "parent_id": "t3_xg24ep",
            "score": 179,
            "created_utc": 1663371415.0,
            "replies": [
                {
                    "body": "And the Hyuga clan with their Byakugan that was supposed to rival the Uchihas and their Sharingan. But he just did a one and done with The Last movie",
                    "author": null,
                    "id": "iorpc5o",
                    "parent_id": "t1_ioqdba0",
                    "score": 73,
                    "created_utc": 1663398402.0,
                    "replies": [
                        {
                            "body": "As soon as MS showed up it vacant real fodder",
                            "author": "Adorable_Notice5427",
                            "id": "iosip0b",
                            "parent_id": "t1_iorpc5o",
                            "score": 19,
                            "created_utc": 1663419654.0,
                            "replies": []
                        },
                        {
                            "body": "To be fair, an average Hyuuga clan member was supposed to be stronger than a random Uchiha if they were still around, canonically\n\nMost people were stuck with base sharingan their whole lives and something like EMS was practically unheard of besides madara",
                            "author": "Kinstray",
                            "id": "iovkan9",
                            "parent_id": "t1_iorpc5o",
                            "score": 4,
                            "created_utc": 1663468223.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Kishimoto explaining the Hyuga and Kaguya clan :",
            "author": "Tsukinotaku",
            "id": "ioqpgia",
            "parent_id": "t3_xg24ep",
            "score": 109,
            "created_utc": 1663377260.0,
            "replies": [
                {
                    "body": "This is the explanation we get for the Otsutsuki clan:\n\n![gif](giphy|3oEjI789af0AVurF60)",
                    "author": "tew2tew",
                    "id": "ior8tmm",
                    "parent_id": "t1_ioqpgia",
                    "score": 90,
                    "created_utc": 1663387211.0,
                    "replies": [
                        {
                            "body": "At least they were valued and strong lol\n\n\nThe Hyuga and Kaguya clan got powers from the head goddess of the whole tree itself yet they're weak af \n\nThe Byakugan got heavily shafted which is sad. Even the evolution has some \"otsutsuki only\" bullshit restriction so well never see it again lol\n\n\nThe Kaguya clan with Shikotsumyaku have it worse too.\nThey were fucking exterminated and are now extinct...\n\nHell they didn't even need a war. Just having Kaguya's blood poisoned them to death lol\n\nSuper sad that both of my favorite clans are just garbage  that Kishimoto will never use again...\n\nThe only relevant Hyuga character is Himawari now and its not like she's gonna be a huge plot focus.\n\n\nThe Kaguya clan is basically gone now so I gave up on them.",
                            "author": "Tsukinotaku",
                            "id": "ios3tvc",
                            "parent_id": "t1_ior8tmm",
                            "score": 5,
                            "created_utc": 1663409948.0,
                            "replies": []
                        },
                        {
                            "body": "Trees and Alien Moon Wizards",
                            "author": "Lord_Sauron",
                            "id": "ios978k",
                            "parent_id": "t1_ior8tmm",
                            "score": 1,
                            "created_utc": 1663413954.0,
                            "replies": [
                                {
                                    "body": "By kaguya clan I meant the actual Kaguya clan.\n\nThe one with Shikotsumyaku",
                                    "author": "Tsukinotaku",
                                    "id": "iosfmj0",
                                    "parent_id": "t1_ios978k",
                                    "score": 5,
                                    "created_utc": 1663417952.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Kishi: Well, they were strong, were an offshoot of the Senju, lived on an island, had strong life force, had a contract with the Shinigami and their Fuinjutsu was so powerful that multiple villages had to gang up to destroy them.\n\nReaders: ...you ever gonna elaborate on any of that?\n\nKishi: Lmao fuck off ill kill Kurama again before explaining anything.",
            "author": "Ambitious-Raise8107",
            "id": "ioq0abu",
            "parent_id": "t3_xg24ep",
            "score": 203,
            "created_utc": 1663365472.0,
            "replies": [
                {
                    "body": "I thought the Uzumaki were from another nation entirely and were just a foreign clan that had two members married to the Senju?",
                    "author": "SinglePostOfAccount",
                    "id": "ios53vh",
                    "parent_id": "t1_ioq0abu",
                    "score": 8,
                    "created_utc": 1663410929.0,
                    "replies": [
                        {
                            "body": "Nah, they from the land whirling tides which was an island nation. Aloes been said before they were distant relatives and the Uzumaki kind of have to be an offshoot of the senju otherwise Asura wouldn't have been able to reincarnate into Naruto and it seems in the Narutoverse Reincarnation is done along bloodlines.",
                            "author": "Ambitious-Raise8107",
                            "id": "ios5b8m",
                            "parent_id": "t1_ios53vh",
                            "score": 15,
                            "created_utc": 1663411087.0,
                            "replies": [
                                {
                                    "body": "Minato was from the Senju?\n\nEdit: I'll explain that basically the Uchiha clan's gripe was that they always went with the Senju clan for Hokage. When Minato was instated and the nine tails attacked, they were pretty much done as they thought that Sasuke's dad should've been Hokage and being sent to the border as being suspected as instigators of the attack. \n\nSo Minato, more likely than not, is from the Senju.",
                                    "author": "SinglePostOfAccount",
                                    "id": "ios5jay",
                                    "parent_id": "t1_ios5b8m",
                                    "score": 1,
                                    "created_utc": 1663411257.0,
                                    "replies": [
                                        {
                                            "body": "No, far as we know he's an orphan",
                                            "author": "Ambitious-Raise8107",
                                            "id": "ios5qfw",
                                            "parent_id": "t1_ios5jay",
                                            "score": 9,
                                            "created_utc": 1663411411.0,
                                            "replies": [
                                                {
                                                    "body": "I added a bit of an explanation above and it makes less sense for the Uzumaki, from an island nation, to be connected to the Senju when Minato, on the other hand, at least has Uchiha spite for becoming Hokage.",
                                                    "author": "SinglePostOfAccount",
                                                    "id": "ios61gv",
                                                    "parent_id": "t1_ios5qfw",
                                                    "score": 1,
                                                    "created_utc": 1663411645.0,
                                                    "replies": [
                                                        {
                                                            "body": "And behold we have looped back to the point of the meme, the Uzumaki clan being poorly explained.",
                                                            "author": "Ambitious-Raise8107",
                                                            "id": "ios6615",
                                                            "parent_id": "t1_ios61gv",
                                                            "score": 4,
                                                            "created_utc": 1663411743.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Oh wait, nah the Uzumaki were distant relatives to the Senju. So I guess a bit of in breeding when Hashirama married an Uzumaki.\n\nAlso YUP, it was a singek panel saying that they were distantly related, so it wasn't like they were the off shoot of the Uzumakis but literal cousins in a sense.",
                                                                    "author": "SinglePostOfAccount",
                                                                    "id": "ios6dbw",
                                                                    "parent_id": "t1_ios6615",
                                                                    "score": 1,
                                                                    "created_utc": 1663411896.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "Really reeks of Kishis's trademark \"lmao not gonna explain shit.\"\n\nHell, only reason we know that the Kaguya and Hyuga clans are cousin clans is due to a single text box if explaining Kaguya's bone abilities in the databook. He's never been overly good when it comes to tying together lore threads. Like how Madara's timeline of events makes no sense.",
                                                                            "author": "Ambitious-Raise8107",
                                                                            "id": "ios6pmj",
                                                                            "parent_id": "t1_ios6dbw",
                                                                            "score": 5,
                                                                            "created_utc": 1663412156.0,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "body": "Minato married into the uzumakis",
                                            "author": null,
                                            "id": "iose8ve",
                                            "parent_id": "t1_ios5jay",
                                            "score": 3,
                                            "created_utc": 1663417147.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "“Oh yeah and like Naruto actually is related to all these people they just don’t know it ever.”",
            "author": "BeastaBubbles",
            "id": "ioqoc33",
            "parent_id": "t3_xg24ep",
            "score": 58,
            "created_utc": 1663376711.0,
            "replies": []
        },
        {
            "body": "Nagato and Karin deserved better.  Especially Karin, since they never even did her the decency of even having Naruto acknowledge it despite all the connections they share in a peacetime setting.",
            "author": "deadlysnoots",
            "id": "ioqyh1e",
            "parent_id": "t3_xg24ep",
            "score": 45,
            "created_utc": 1663381672.0,
            "replies": [
                {
                    "body": "Imagine growing up without a family and then learning you have a long lost cousin who also doesn’t have family and then letting that cousin live with a creepy snake pedophile instead of connecting with them",
                    "author": "SeductivePillowcase",
                    "id": "ios9crz",
                    "parent_id": "t1_ioqyh1e",
                    "score": 24,
                    "created_utc": 1663414061.0,
                    "replies": []
                },
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "ior61yv",
                    "parent_id": "t1_ioqyh1e",
                    "score": -11,
                    "created_utc": 1663385645.0,
                    "replies": [
                        {
                            "body": "Naruto? The same Naruto who's been begging for a scrap of family since he was a child? That one? lol",
                            "author": "Ecstatic-Grass-2353",
                            "id": "iorbk8i",
                            "parent_id": "t1_ior61yv",
                            "score": 36,
                            "created_utc": 1663388820.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "iorbuq1",
                                    "parent_id": "t1_iorbk8i",
                                    "score": -9,
                                    "created_utc": 1663389000.0,
                                    "replies": [
                                        {
                                            "body": "If that's what you think, cool. Personally, I think he would get hella excited and drag her into random hijinks for no reason. That's just the kind of person he is (going by Naruto and Naruto: Shippuden standards).",
                                            "author": "Ecstatic-Grass-2353",
                                            "id": "iorc8hk",
                                            "parent_id": "t1_iorbuq1",
                                            "score": 24,
                                            "created_utc": 1663389238.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I just love the fact that Kishimoto forgot about the clan of the main character because \"magic red-eye guys cool\"\n\nLike, with some minor tweaks, kushina doesn't even need to be from a clan, just some woman born with strong chakra, Naruto doesn't even know shit about sealing, Ya know, the thing not only his clan but his non-Uzumaki parent specialized in.\n\nSo the torch wasn't given fully to naruto, sure he had sage mode and Rasengan (and Kurama to an extent), But Naruto isn't really fit to be the \"legacy of the Uzumaki's\" it would've been better if his mother was a clanless but strong shinobi.\n\nEven the Ashura descendant part could be written as \"narutos great grandmother was a civilian Senju woman who married civilian man, and got her last name changed as a result and that man or kushinas dad could have the last name of Uzumaki.\n\nThis would've made naruto more of an **underdog** that he was **suppose** to be.  \nHe came from civilian blood, and his rival was from a clan of people with eyes who can mind fuck you just by staring into them, the fact that he had Senju blood would be meaningless because that senju was a no-name civilian.\n\nThat would've proven Neji wrong about destiny, his father being the hokage wouldn't be that important because barely gave him an advantage in early life, 1 strong technique doesn't compare to years worth of training from a shinobi parent or relative lost.",
            "author": "DrunkSaruman",
            "id": "iorywkf",
            "parent_id": "t3_xg24ep",
            "score": 22,
            "created_utc": 1663406111.0,
            "replies": []
        },
        {
            "body": "The Uzumaki clan is nothing more than a plot device.",
            "author": null,
            "id": "ioqv116",
            "parent_id": "t3_xg24ep",
            "score": 43,
            "created_utc": 1663379968.0,
            "replies": [
                {
                    "body": "Just like Hashirama Cells^TM",
                    "author": null,
                    "id": "iorpfpn",
                    "parent_id": "t1_ioqv116",
                    "score": 26,
                    "created_utc": 1663398478.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Yeah Kishimoto did a very poor job on world building in Naruto.",
            "author": "YesImDavid",
            "id": "ioqvjns",
            "parent_id": "t3_xg24ep",
            "score": 61,
            "created_utc": 1663380221.0,
            "replies": [
                {
                    "body": "like with many stuff in naruto, he did a good job on the things he actually tried like Konoha compared with the other villages, the Uchiha compared with the other clans, etc",
                    "author": "LilQuasar",
                    "id": "ior9ml6",
                    "parent_id": "t1_ioqvjns",
                    "score": 38,
                    "created_utc": 1663387675.0,
                    "replies": [
                        {
                            "body": "Of course! I’m not trying to say he’s bad at writing as that would just be pure ignorance. I’m a big fan of the series but I also wish we could’ve seen more from it especially in the world building aspect of it. It was set up amazingly but little was done with it leaving much of the audience including me with a lot of questions.",
                            "author": "YesImDavid",
                            "id": "iorisn1",
                            "parent_id": "t1_ior9ml6",
                            "score": 8,
                            "created_utc": 1663393540.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "To be fair, part at fault are his edditors.\n\nFor example they forced on him chunin exam arc. While Kishi wanted to send Team 7 on more missions and explore the world, with showing off more other villages and the whole team Gai meant to be from other village.",
                    "author": "DrunkSaruman",
                    "id": "iorvh1m",
                    "parent_id": "t1_ioqvjns",
                    "score": 14,
                    "created_utc": 1663403273.0,
                    "replies": []
                },
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "ior5yau",
                    "parent_id": "t1_ioqvjns",
                    "score": -13,
                    "created_utc": 1663385587.0,
                    "replies": [
                        {
                            "body": "We know very little about the other villages especially sand even though an entire arc took place there, we only know of a handful of clans in the leaf and only one of them is focused on regularly throughout the series, the only information we get about places outside of the leaf other than the land hidden in whirlpools is through filler, we know there are other Jinchuriki but we don’t even see most of them until the end of the series… these things are just off the top of my head. It isn’t extreme to point out an area lacking in a series. I already love Naruto but if the world was expanded more and if Kishimoto kept up with the world building he had been doing at the start of the series it would’ve been much more enjoyable.",
                            "author": "YesImDavid",
                            "id": "ior7hya",
                            "parent_id": "t1_ior5yau",
                            "score": 16,
                            "created_utc": 1663386452.0,
                            "replies": [
                                {
                                    "body": "The Garra novel did go into a bit detail about the sand inner politic and other minor detail, might worth a read if you are interested , although even then dont expect too much",
                                    "author": "long909",
                                    "id": "iorc5fr",
                                    "parent_id": "t1_ior7hya",
                                    "score": 4,
                                    "created_utc": 1663389186.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "This is one of the things that bothered me the most about Naruto, how did the main character’s clan get nearly no attention or worldbuilding",
            "author": "mpaiva97",
            "id": "iostb1f",
            "parent_id": "t3_xg24ep",
            "score": 6,
            "created_utc": 1663424793.0,
            "replies": []
        },
        {
            "body": "The Uzumaki clan should never have been a thing in the first place",
            "author": "D3ATHSTR0KE_",
            "id": "ioqc7qj",
            "parent_id": "t3_xg24ep",
            "score": 29,
            "created_utc": 1663370885.0,
            "replies": []
        },
        {
            "body": "\"They big chakra\"",
            "author": "alonyer1",
            "id": "iorl0rs",
            "parent_id": "t3_xg24ep",
            "score": 7,
            "created_utc": 1663395159.0,
            "replies": []
        },
        {
            "body": "Well we do only see two of them in the entire series, and both are plot devices",
            "author": "xxXMrDarknessXxx",
            "id": "ioqkrw7",
            "parent_id": "t3_xg24ep",
            "score": 5,
            "created_utc": 1663374999.0,
            "replies": [
                {
                    "body": "Uhh, no we meet 5...\nNaruto, Nagato, Kushina, Karin, and Mito (first Jinjuriki of the nine-tails) \nYou could even say 6 technically since we do SEE Nagato's mother (Fuso Uzamaki) she just has no real role to play. But yeah definitely more than 2",
                    "author": "Mashed_Watermelon",
                    "id": "iorp0yq",
                    "parent_id": "t1_ioqkrw7",
                    "score": 11,
                    "created_utc": 1663398164.0,
                    "replies": [
                        {
                            "body": "Considering we only know Nagato as Pain until basically after he dies, and both Kushina and Mito are dead as doornails, I would cut that number down",
                            "author": "xxXMrDarknessXxx",
                            "id": "iorz1fl",
                            "parent_id": "t1_iorp0yq",
                            "score": -5,
                            "created_utc": 1663406213.0,
                            "replies": [
                                {
                                    "body": "Your comment said \"We only see two of them throughout the series\" I was simply pointing out that that's is untrue, even if you want to say all of that that does not change the fact that they were all Uzamaki's that we had met during the story of Naruto",
                                    "author": "Mashed_Watermelon",
                                    "id": "ios1kty",
                                    "parent_id": "t1_iorz1fl",
                                    "score": 7,
                                    "created_utc": 1663408193.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Three.",
                    "author": "Physics_Useful",
                    "id": "ioricv0",
                    "parent_id": "t1_ioqkrw7",
                    "score": 1,
                    "created_utc": 1663393241.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Uzumaki long life red hair",
            "author": "GetGetFresh",
            "id": "iorh3jw",
            "parent_id": "t3_xg24ep",
            "score": 5,
            "created_utc": 1663392376.0,
            "replies": []
        },
        {
            "body": "Who would be down for a spin off on the Uzumaki?",
            "author": "Dizent",
            "id": "ioqz87b",
            "parent_id": "t3_xg24ep",
            "score": 8,
            "created_utc": 1663382049.0,
            "replies": []
        },
        {
            "body": "![gif](giphy|3ohzdDls6viEANKHtK)\n\nKishimoto when asked about female characters",
            "author": "Possible-Affect-2350",
            "id": "iordj6j",
            "parent_id": "t3_xg24ep",
            "score": 4,
            "created_utc": 1663390054.0,
            "replies": []
        },
        {
            "body": "Kishikoto explaining any other clan:",
            "author": "KayWiszmanski",
            "id": "ioq97ky",
            "parent_id": "t3_xg24ep",
            "score": 11,
            "created_utc": 1663369468.0,
            "replies": []
        },
        {
            "body": "They’re not really important so he doesn’t necessarily have a reason to go in depth about them.\n\nMeanwhile the Uchiha are pivotal to the entire plot of the story.",
            "author": "HeavensHellFire",
            "id": "ior1bhw",
            "parent_id": "t3_xg24ep",
            "score": 8,
            "created_utc": 1663383115.0,
            "replies": []
        },
        {
            "body": "I genuinely prefer the pure strain Uzumakis over the Uchihas. That's why I only ever play as them in RPs",
            "author": "Meager1169",
            "id": "ioq6j5s",
            "parent_id": "t3_xg24ep",
            "score": 13,
            "created_utc": 1663368246.0,
            "replies": []
        },
        {
            "body": "Uchiha: *Receives detailed history and gives last one unlimited plot armor \nUzumaki: *Kishimoto “they strong, try jumping”",
            "author": "Money2648",
            "id": "iosxgnj",
            "parent_id": "t3_xg24ep",
            "score": 3,
            "created_utc": 1663426612.0,
            "replies": []
        },
        {
            "body": "I remember i posted something similar on a naruto forum in like 2014 and they attacked me like their lives were on the line, toxic asf. This is something i noticed tss back in 2014. Being a senju fan myself and just a genral curious fan because the uchiha got 803939392929 side plots and explanations and we didn’t/don’t know who minatos parents were or an awesome side plot of minato and how nasty he really was like he single handily won the 3rd great ninja war getting him promoted to hokage they make him seem so innocent yet he probably killed more people than itachi its crazy i would literally pay to see a minato arch of his dark days. Or how hashirama died, an awesome hashirama arch of him fighting the tailed beasts or bringing villages together just quick montage. Literally the uchiha slaughter night got like 100 different perspectives. Who nagatos parents really were and how they made it from the land of fire to the rain village. And they never explained",
            "author": "youngadvocate25",
            "id": "iou6ktk",
            "parent_id": "t3_xg24ep",
            "score": 3,
            "created_utc": 1663445426.0,
            "replies": []
        },
        {
            "body": "Wtf is up with these cihuahua clan uzaki clan?",
            "author": "RNGesus____",
            "id": "iorst7e",
            "parent_id": "t3_xg24ep",
            "score": 2,
            "created_utc": 1663401165.0,
            "replies": []
        },
        {
            "body": "They’re a clan that’s related to the Senju, they’re known for their big chakra reservoir and sealing jutsu’s making them perfect as vessels for tailed beast.",
            "author": "Business_Mix_2705",
            "id": "iorypqv",
            "parent_id": "t3_xg24ep",
            "score": 2,
            "created_utc": 1663405965.0,
            "replies": []
        },
        {
            "body": "\"They have red hair and are good at healing\" - The entire Uzumaki Clan lore",
            "author": "Worm_Scavenger",
            "id": "ioty7h4",
            "parent_id": "t3_xg24ep",
            "score": 2,
            "created_utc": 1663441852.0,
            "replies": []
        },
        {
            "body": "Kishimoto explaining every other clan*",
            "author": "Objective-Conflict44",
            "id": "ip83s2t",
            "parent_id": "t3_xg24ep",
            "score": 2,
            "created_utc": 1663697332.0,
            "replies": []
        },
        {
            "body": "Few paragraphs? Make that few sentences.",
            "author": "toweroflore",
            "id": "ir707uj",
            "parent_id": "t3_xg24ep",
            "score": 2,
            "created_utc": 1665000419.0,
            "replies": []
        },
        {
            "body": "Kishimoto when he's figuring out what to do with Dosu and his team",
            "author": "V4POR97",
            "id": "ioqa8on",
            "parent_id": "t3_xg24ep",
            "score": 3,
            "created_utc": 1663369952.0,
            "replies": []
        },
        {
            "body": "Yeah it’s cuz he’s a bigger fan of the Uchiha’s and rightfully so [+]",
            "author": "Plebe-Uchiha",
            "id": "ioreckx",
            "parent_id": "t3_xg24ep",
            "score": 1,
            "created_utc": 1663390580.0,
            "replies": []
        },
        {
            "body": "Uchiha are cooler that’s why",
            "author": "squeege22",
            "id": "iorgk8l",
            "parent_id": "t3_xg24ep",
            "score": -2,
            "created_utc": 1663392018.0,
            "replies": []
        },
        {
            "body": "Yeah it’s almost like the world building is only done when convenient to the plot and not anywhere else",
            "author": "stauvix",
            "id": "ior3lhq",
            "parent_id": "t3_xg24ep",
            "score": -4,
            "created_utc": 1663384318.0,
            "replies": []
        },
        {
            "body": "Damn that's true",
            "author": "la_legende",
            "id": "ios82ib",
            "parent_id": "t3_xg24ep",
            "score": 1,
            "created_utc": 1663413156.0,
            "replies": []
        },
        {
            "body": "Kishimoto develops Sharingan: / Kishimoto develops Byakugan:",
            "author": "EvaHarven",
            "id": "iou1vwx",
            "parent_id": "t3_xg24ep",
            "score": 1,
            "created_utc": 1663443430.0,
            "replies": []
        },
        {
            "body": ">Kishimoto explaining what happened to the senju: the what\n\nThat's good question.\nWhat DID happen to the Senju's? Did they all went extinct?",
            "author": "KayWiszmanski",
            "id": "ioq94lu",
            "parent_id": "t1_iopx3du",
            "score": 208,
            "created_utc": 1663369430.0,
            "replies": [
                {
                    "body": "Their spirits live on in Tsunade's gigantic boobs.",
                    "author": "Phantom_Beef",
                    "id": "ioqurit",
                    "parent_id": "t1_ioq94lu",
                    "score": 221,
                    "created_utc": 1663379837.0,
                    "replies": []
                },
                {
                    "body": "I think they just merged and bred with everyone in konoha",
                    "author": "DopeEspeon",
                    "id": "ioqddrd",
                    "parent_id": "t1_ioq94lu",
                    "score": 187,
                    "created_utc": 1663371447.0,
                    "replies": [
                        {
                            "body": "And none of them were worthy of keeping the Senju name? There should still be _some_ Senju around - it’s not like they only ever had daughters or something.",
                            "author": "Slight-Pound",
                            "id": "ioqzwwh",
                            "parent_id": "t1_ioqddrd",
                            "score": 154,
                            "created_utc": 1663382391.0,
                            "replies": [
                                {
                                    "body": "Madara's ghost came and used the Sharingan to convince the Senju's to change their surname cause they were so much weaker than Hashirama.",
                                    "author": "Few_Pay_5313",
                                    "id": "ior7y1c",
                                    "parent_id": "t1_ioqzwwh",
                                    "score": 113,
                                    "created_utc": 1663386702.0,
                                    "replies": [
                                        {
                                            "body": "He probably would've done/said the same to the Uchihas, but foresaw Itachi take care of that problem",
                                            "author": null,
                                            "id": "iorp29f",
                                            "parent_id": "t1_ior7y1c",
                                            "score": 48,
                                            "created_utc": 1663398193.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "No, Hashirama and tobirama decided as the clan elders that they should take others names and propagate their genes throughout the village, as opposed to the Uchiha who chose inbreeding and an insular clan system. The Senju genes being widespread across the village is why the hidden leaf is the strongest village as a whole.",
                                    "author": "elementnix",
                                    "id": "iori9rm",
                                    "parent_id": "t1_ioqzwwh",
                                    "score": 54,
                                    "created_utc": 1663393182.0,
                                    "replies": [
                                        {
                                            "body": "That's headcanon, you know that right?\nLike literally everything you have just said it's made up.",
                                            "author": "frenin",
                                            "id": "iorjded",
                                            "parent_id": "t1_iori9rm",
                                            "score": 86,
                                            "created_utc": 1663393954.0,
                                            "replies": [
                                                {
                                                    "body": "Source: I made it up",
                                                    "author": "elementnix",
                                                    "id": "iorjea4",
                                                    "parent_id": "t1_iorjded",
                                                    "score": 73,
                                                    "created_utc": 1663393972.0,
                                                    "replies": []
                                                },
                                                {
                                                    "body": "Hashirama did ordered them to marry other clans but nothing has been said about taking other family names",
                                                    "author": "Background_69_69",
                                                    "id": "iork2p1",
                                                    "parent_id": "t1_iorjded",
                                                    "score": 16,
                                                    "created_utc": 1663394473.0,
                                                    "replies": [
                                                        {
                                                            "body": "Where's said that he did?",
                                                            "author": "frenin",
                                                            "id": "iorkm5k",
                                                            "parent_id": "t1_iork2p1",
                                                            "score": 15,
                                                            "created_utc": 1663394860.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Novels",
                                                                    "author": "Background_69_69",
                                                                    "id": "iorkw2k",
                                                                    "parent_id": "t1_iorkm5k",
                                                                    "score": 6,
                                                                    "created_utc": 1663395062.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "I have read them and it certainly doesn't say so.\nIt does say that some Senju married out but not that it was a policy and never that it was so prominent that it literally made them die out.",
                                                                            "author": "frenin",
                                                                            "id": "iorl21l",
                                                                            "parent_id": "t1_iorkw2k",
                                                                            "score": 19,
                                                                            "created_utc": 1663395186.0,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "body": "It’s a feasible explanation. I mean only two clans were supposed to have the power of chakra but we saw so many other clans with that power. Senju’s spread their genes among other clans like Uzumaki clan is also derived from Senju.",
                                            "author": "Rohan-kun",
                                            "id": "iork16c",
                                            "parent_id": "t1_iori9rm",
                                            "score": 11,
                                            "created_utc": 1663394442.0,
                                            "replies": [
                                                {
                                                    "body": "only 2 clans? every single living breathing thing has chakra. there are literal ninja dogs and turtles. these two clans were just so much stronger than most other clans that most other clans didn’t bother to fight them. but you are right senju did spread around their genes, like uzumaki and sarutobi",
                                                    "author": "SmegmaLord420",
                                                    "id": "iorrdkd",
                                                    "parent_id": "t1_iork16c",
                                                    "score": 12,
                                                    "created_utc": 1663400024.0,
                                                    "replies": [
                                                        {
                                                            "body": "Yes, I mistook chakra with Ninshu.",
                                                            "author": "Rohan-kun",
                                                            "id": "ioryn5b",
                                                            "parent_id": "t1_iorrdkd",
                                                            "score": 3,
                                                            "created_utc": 1663405902.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "body": "The Uchiha Clan isn't inbreeding. That's like saying every Japanese, African or Swedish person is inbreeding.\n\nAlso the Uchiha Clan has a sister clan called the Fūma Clan in Part 2 & Bort.",
                                            "author": "Successful_Ad9924354",
                                            "id": "ip1c9m2",
                                            "parent_id": "t1_iori9rm",
                                            "score": 0,
                                            "created_utc": 1663572516.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "People's head canon is that Hashirama told them to take their spouses family names. I think Sakura is probably mostly a Senju because it makes no sense for her to be able to just emulate Tsunade and be one of the strongest ninja in konoha during Boruto",
                                    "author": "Background_69_69",
                                    "id": "iorjxf4",
                                    "parent_id": "t1_ioqzwwh",
                                    "score": 6,
                                    "created_utc": 1663394363.0,
                                    "replies": [
                                        {
                                            "body": "That makes some sense, but you’d think they wouldn’t still treat the Senju as literally dying out still. They’re still Senju in blood, and they aren’t _that_ many generations removed from that initial decision, and it’s still weird that ALL of them agreed to it, too. The emphasis on clan techniques and power wouldn’t let their name legacy stay quiet, either. Everyone would be paying a lot of attention to Senju descendants.\n\nI’m more confused how they don’t keep up a community with each other, same name or not. They were still raised as siblings and cousins - family you can still reach out to. Tsunade seemed so isolated with Hashirama and Tobirama as her only family connections other than Nawaki. No other uncles, aunts, or cousins she was raised with, and presumably parents that died early on. This would make more sense if the Senju had already been getting pretty small by the countries founding, and it wasn’t.\n\nI’m fine with Sakura emulating her because I’m sick and tired of the only “good” ninjas coming from insane legacies. I want to have this, at least. Let the underdog narrative exist in more than just Lee.",
                                            "author": "Slight-Pound",
                                            "id": "iorndud",
                                            "parent_id": "t1_iorjxf4",
                                            "score": 21,
                                            "created_utc": 1663396908.0,
                                            "replies": [
                                                {
                                                    "body": "The thing is that Tsunade's techniques are borderline senju exclusive because of the insane amounts of chakra and also ridiculous physical strength is a Senju trait. \n\nI think the head canon makes way more sense than the idea that the senju got wiped out during the wars or whatever because there was a ton of Uchiha and those guys were their equals and somehow the Hyugas straight up supplanted the Senju as the village rulers (remember the Hyugas were supposed to be the strongest clan and the Byakugan was supposed to be stronger than the sharingan lol good times)...\n\nMaybe the bulk of the Senju got absorbed into the Hyugas",
                                                    "author": "Background_69_69",
                                                    "id": "iorpfah",
                                                    "parent_id": "t1_iorndud",
                                                    "score": 13,
                                                    "created_utc": 1663398469.0,
                                                    "replies": [
                                                        {
                                                            "body": "Yeah, that’s fair. I still would have liked more non-clan powerhouses in this show. It also reminds me of how we used to think Sakura could be a poison/illusion specialist before Tsunade seriously entered the narrative. What a time.\n\nThe headcanon makes the best sense out of the nonsensical writing of _why_ the Senju were wiped out during peace times, for sure. The other ninja clans of Naruto deserved better, really.\n\nI remember hoping for more Hyuuga world-building after meeting Neji in the Chuunin Exam and meeting Hinata and Neji again after the timeskip. I thought it would be a great way to really introduce making Hinata and Naruto friends - through learning about her clan and how Neji has found a way to thrive despite its shackles. I was, of course, devastatingly wrong. Kept waiting for other clans beside the Uchiha to get a turn, to no avail.\n\nThe Hyuuga’s seem like even bigger “blood purists” than the Uchiha’s give the air of, so I doubt it. I also doubt the Senju would be too chill about the Main/Side Branch thing, too. I think they became parts of civilian families for the most part, and some minor clans like the Ino-Shika-Chou. They seem chill enough to mingle with.",
                                                            "author": "Slight-Pound",
                                                            "id": "iorrnfp",
                                                            "parent_id": "t1_iorpfah",
                                                            "score": 6,
                                                            "created_utc": 1663400240.0,
                                                            "replies": [
                                                                {
                                                                    "body": "It would be hilarious if Sarada just awoke the Rinegan out of nowhere because of the blood lines and learning the techniques developed by Tsunade despite it taking hundreds of years and a ridiculously complicated plan  to awaken it once",
                                                                    "author": "Background_69_69",
                                                                    "id": "iorsq6q",
                                                                    "parent_id": "t1_iorrnfp",
                                                                    "score": 2,
                                                                    "created_utc": 1663401095.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "I’m honestly surprised something like that hasn’t happened yet.",
                                                                            "author": "Slight-Pound",
                                                                            "id": "iorsuxa",
                                                                            "parent_id": "t1_iorsq6q",
                                                                            "score": 1,
                                                                            "created_utc": 1663401204.0,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "body": "No, I don't remember because the Byakugan was never said to be stronger than the Sharingan. In canon Kishimoto had Kakashi say that the Byakugan is only superior in sight AKA distance.",
                                                            "author": "Successful_Ad9924354",
                                                            "id": "ip1cg8t",
                                                            "parent_id": "t1_iorpfah",
                                                            "score": 1,
                                                            "created_utc": 1663572675.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "\"senju\" is a clan name. so if you join another clan, you use that clan name not \"senju\".",
                                    "author": "nizzy2k11",
                                    "id": "iosxbeq",
                                    "parent_id": "t1_ioqzwwh",
                                    "score": 1,
                                    "created_utc": 1663426549.0,
                                    "replies": [
                                        {
                                            "body": "That’s the thing - I doubt _all_ of them joined clans (I think a lot of them joined regular/civilian families, too) and even then, no one joined _theirs?_ Absolutely no one? No one wanted to have their family be called Senju like they were? Sons are also often the ones to carry the family name, and their wives and kids carry that name as a result. That’s why I mentioned “only having daughters” in the first place. Because that clearly _wasn’t_ the case.\n\n_That’s_ what doesn’t make sense. They’re not the only clan in Konoha that might have intermingled with others, either - the Ino-Shika-Chou is a group I think would most likely do something similar, but _they_ are still around, and they seemed smaller than the Senju, so why aren’t the Senju? The Senju were just unnecessarily written out of the story and there isn’t a lot of reasonable excuses to make sense of it - or rather, there shouldn’t have to be.\n\nEdit: the last line",
                                            "author": "Slight-Pound",
                                            "id": "ioszdq1",
                                            "parent_id": "t1_iosxbeq",
                                            "score": 2,
                                            "created_utc": 1663427440.0,
                                            "replies": [
                                                {
                                                    "body": "It was never said that those with the name senju were a significant part of the alliance, just that they were powerful. The 3 sanin alone could take out thousands of rank and file ninja, it wouldn't take much to be powerful with good training.",
                                                    "author": "nizzy2k11",
                                                    "id": "iot6hnx",
                                                    "parent_id": "t1_ioszdq1",
                                                    "score": 1,
                                                    "created_utc": 1663430409.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "People with the senju name were deliberately targeted on the battlefield by enemy operativesm like Nawaki. \nGiving up the last name was probably the safest option.",
                                    "author": "depressed_panda0191",
                                    "id": "iousane",
                                    "parent_id": "t1_ioqzwwh",
                                    "score": 1,
                                    "created_utc": 1663454948.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Apparently. Don’t know how that worked, considering that both the Uchiha and the Senju were sizable, and we had no reason to believe that the Senju were dying out from something like fertility issues _before._ It really doesn’t make much sense.",
                    "author": "Slight-Pound",
                    "id": "ioqzttd",
                    "parent_id": "t1_ioq94lu",
                    "score": 29,
                    "created_utc": 1663382346.0,
                    "replies": [
                        {
                            "body": "tsunades tatas are sizable \n\nohhhhhh",
                            "author": "God_Of_Asscheeks",
                            "id": "ior3jkc",
                            "parent_id": "t1_ioqzttd",
                            "score": 4,
                            "created_utc": 1663384288.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "*go",
                    "author": "NameOfNoSignificance",
                    "id": "iornwl3",
                    "parent_id": "t1_ioq94lu",
                    "score": 2,
                    "created_utc": 1663397298.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Kishimoto explaining how Itachi got a hold of the most broken weapones in the whole universe that somehow fit on a susano'o",
            "author": "Similor",
            "id": "ioq2ur6",
            "parent_id": "t1_iopx3du",
            "score": 146,
            "created_utc": 1663366606.0,
            "replies": [
                {
                    "body": ">Kishimoto explaining how Itachi got a hold of the most broken weapones in the whole universe that somehow fit on a susano'o\n\nMy theory was that Yata Mirror and Totsuka Blade just adjust to size of User or to his will, otherwise it makes no fucking sense. Like, what use would have any non Uchiha Shinobi with a sword 10x his size?",
                    "author": "KayWiszmanski",
                    "id": "ioq903j",
                    "parent_id": "t1_ioq2ur6",
                    "score": 83,
                    "created_utc": 1663369372.0,
                    "replies": []
                },
                {
                    "body": "Maybe he took it off his fellow Uchiha during the massacre?",
                    "author": "CaptainPragmatism",
                    "id": "iorsvsk",
                    "parent_id": "t1_ioq2ur6",
                    "score": 2,
                    "created_utc": 1663401224.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "*Kishimoto expanding on uchihas for the 12th time*\n\nOh how awful. What about plans to flesh out the senju?\n\nTo shreds you say? Tsk tsk tsk.\n\nWell how’s the other clans backstories holding up?\n\nTo shreds you say? Tsk tsk tsk.",
            "author": "TriforceofSwag",
            "id": "ior680n",
            "parent_id": "t1_iopx3du",
            "score": 19,
            "created_utc": 1663385739.0,
            "replies": []
        },
        {
            "body": "People forget but the Senju & Uzumaki wasn't supposed to be a clan. Kishimoto created them halfway before part 2 was done.",
            "author": "Successful_Ad9924354",
            "id": "ip1c0zl",
            "parent_id": "t1_iopx3du",
            "score": 1,
            "created_utc": 1663572307.0,
            "replies": [
                {
                    "body": "But Narutos last name was Uzumaki ?\n\nAnd Hashirama and Tobirama existed already ?",
                    "author": "cracked_camel",
                    "id": "ire0e5r",
                    "parent_id": "t1_ip1c0zl",
                    "score": 1,
                    "created_utc": 1665138017.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "And the Hyuga clan with their Byakugan that was supposed to rival the Uchihas and their Sharingan. But he just did a one and done with The Last movie",
            "author": null,
            "id": "iorpc5o",
            "parent_id": "t1_ioqdba0",
            "score": 73,
            "created_utc": 1663398402.0,
            "replies": [
                {
                    "body": "As soon as MS showed up it vacant real fodder",
                    "author": "Adorable_Notice5427",
                    "id": "iosip0b",
                    "parent_id": "t1_iorpc5o",
                    "score": 19,
                    "created_utc": 1663419654.0,
                    "replies": []
                },
                {
                    "body": "To be fair, an average Hyuuga clan member was supposed to be stronger than a random Uchiha if they were still around, canonically\n\nMost people were stuck with base sharingan their whole lives and something like EMS was practically unheard of besides madara",
                    "author": "Kinstray",
                    "id": "iovkan9",
                    "parent_id": "t1_iorpc5o",
                    "score": 4,
                    "created_utc": 1663468223.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "This is the explanation we get for the Otsutsuki clan:\n\n![gif](giphy|3oEjI789af0AVurF60)",
            "author": "tew2tew",
            "id": "ior8tmm",
            "parent_id": "t1_ioqpgia",
            "score": 90,
            "created_utc": 1663387211.0,
            "replies": [
                {
                    "body": "At least they were valued and strong lol\n\n\nThe Hyuga and Kaguya clan got powers from the head goddess of the whole tree itself yet they're weak af \n\nThe Byakugan got heavily shafted which is sad. Even the evolution has some \"otsutsuki only\" bullshit restriction so well never see it again lol\n\n\nThe Kaguya clan with Shikotsumyaku have it worse too.\nThey were fucking exterminated and are now extinct...\n\nHell they didn't even need a war. Just having Kaguya's blood poisoned them to death lol\n\nSuper sad that both of my favorite clans are just garbage  that Kishimoto will never use again...\n\nThe only relevant Hyuga character is Himawari now and its not like she's gonna be a huge plot focus.\n\n\nThe Kaguya clan is basically gone now so I gave up on them.",
                    "author": "Tsukinotaku",
                    "id": "ios3tvc",
                    "parent_id": "t1_ior8tmm",
                    "score": 5,
                    "created_utc": 1663409948.0,
                    "replies": []
                },
                {
                    "body": "Trees and Alien Moon Wizards",
                    "author": "Lord_Sauron",
                    "id": "ios978k",
                    "parent_id": "t1_ior8tmm",
                    "score": 1,
                    "created_utc": 1663413954.0,
                    "replies": [
                        {
                            "body": "By kaguya clan I meant the actual Kaguya clan.\n\nThe one with Shikotsumyaku",
                            "author": "Tsukinotaku",
                            "id": "iosfmj0",
                            "parent_id": "t1_ios978k",
                            "score": 5,
                            "created_utc": 1663417952.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I thought the Uzumaki were from another nation entirely and were just a foreign clan that had two members married to the Senju?",
            "author": "SinglePostOfAccount",
            "id": "ios53vh",
            "parent_id": "t1_ioq0abu",
            "score": 8,
            "created_utc": 1663410929.0,
            "replies": [
                {
                    "body": "Nah, they from the land whirling tides which was an island nation. Aloes been said before they were distant relatives and the Uzumaki kind of have to be an offshoot of the senju otherwise Asura wouldn't have been able to reincarnate into Naruto and it seems in the Narutoverse Reincarnation is done along bloodlines.",
                    "author": "Ambitious-Raise8107",
                    "id": "ios5b8m",
                    "parent_id": "t1_ios53vh",
                    "score": 15,
                    "created_utc": 1663411087.0,
                    "replies": [
                        {
                            "body": "Minato was from the Senju?\n\nEdit: I'll explain that basically the Uchiha clan's gripe was that they always went with the Senju clan for Hokage. When Minato was instated and the nine tails attacked, they were pretty much done as they thought that Sasuke's dad should've been Hokage and being sent to the border as being suspected as instigators of the attack. \n\nSo Minato, more likely than not, is from the Senju.",
                            "author": "SinglePostOfAccount",
                            "id": "ios5jay",
                            "parent_id": "t1_ios5b8m",
                            "score": 1,
                            "created_utc": 1663411257.0,
                            "replies": [
                                {
                                    "body": "No, far as we know he's an orphan",
                                    "author": "Ambitious-Raise8107",
                                    "id": "ios5qfw",
                                    "parent_id": "t1_ios5jay",
                                    "score": 9,
                                    "created_utc": 1663411411.0,
                                    "replies": [
                                        {
                                            "body": "I added a bit of an explanation above and it makes less sense for the Uzumaki, from an island nation, to be connected to the Senju when Minato, on the other hand, at least has Uchiha spite for becoming Hokage.",
                                            "author": "SinglePostOfAccount",
                                            "id": "ios61gv",
                                            "parent_id": "t1_ios5qfw",
                                            "score": 1,
                                            "created_utc": 1663411645.0,
                                            "replies": [
                                                {
                                                    "body": "And behold we have looped back to the point of the meme, the Uzumaki clan being poorly explained.",
                                                    "author": "Ambitious-Raise8107",
                                                    "id": "ios6615",
                                                    "parent_id": "t1_ios61gv",
                                                    "score": 4,
                                                    "created_utc": 1663411743.0,
                                                    "replies": [
                                                        {
                                                            "body": "Oh wait, nah the Uzumaki were distant relatives to the Senju. So I guess a bit of in breeding when Hashirama married an Uzumaki.\n\nAlso YUP, it was a singek panel saying that they were distantly related, so it wasn't like they were the off shoot of the Uzumakis but literal cousins in a sense.",
                                                            "author": "SinglePostOfAccount",
                                                            "id": "ios6dbw",
                                                            "parent_id": "t1_ios6615",
                                                            "score": 1,
                                                            "created_utc": 1663411896.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Really reeks of Kishis's trademark \"lmao not gonna explain shit.\"\n\nHell, only reason we know that the Kaguya and Hyuga clans are cousin clans is due to a single text box if explaining Kaguya's bone abilities in the databook. He's never been overly good when it comes to tying together lore threads. Like how Madara's timeline of events makes no sense.",
                                                                    "author": "Ambitious-Raise8107",
                                                                    "id": "ios6pmj",
                                                                    "parent_id": "t1_ios6dbw",
                                                                    "score": 5,
                                                                    "created_utc": 1663412156.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "Minato married into the uzumakis",
                                    "author": null,
                                    "id": "iose8ve",
                                    "parent_id": "t1_ios5jay",
                                    "score": 3,
                                    "created_utc": 1663417147.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Imagine growing up without a family and then learning you have a long lost cousin who also doesn’t have family and then letting that cousin live with a creepy snake pedophile instead of connecting with them",
            "author": "SeductivePillowcase",
            "id": "ios9crz",
            "parent_id": "t1_ioqyh1e",
            "score": 24,
            "created_utc": 1663414061.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "ior61yv",
            "parent_id": "t1_ioqyh1e",
            "score": -11,
            "created_utc": 1663385645.0,
            "replies": [
                {
                    "body": "Naruto? The same Naruto who's been begging for a scrap of family since he was a child? That one? lol",
                    "author": "Ecstatic-Grass-2353",
                    "id": "iorbk8i",
                    "parent_id": "t1_ior61yv",
                    "score": 36,
                    "created_utc": 1663388820.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "iorbuq1",
                            "parent_id": "t1_iorbk8i",
                            "score": -9,
                            "created_utc": 1663389000.0,
                            "replies": [
                                {
                                    "body": "If that's what you think, cool. Personally, I think he would get hella excited and drag her into random hijinks for no reason. That's just the kind of person he is (going by Naruto and Naruto: Shippuden standards).",
                                    "author": "Ecstatic-Grass-2353",
                                    "id": "iorc8hk",
                                    "parent_id": "t1_iorbuq1",
                                    "score": 24,
                                    "created_utc": 1663389238.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Just like Hashirama Cells^TM",
            "author": null,
            "id": "iorpfpn",
            "parent_id": "t1_ioqv116",
            "score": 26,
            "created_utc": 1663398478.0,
            "replies": []
        },
        {
            "body": "like with many stuff in naruto, he did a good job on the things he actually tried like Konoha compared with the other villages, the Uchiha compared with the other clans, etc",
            "author": "LilQuasar",
            "id": "ior9ml6",
            "parent_id": "t1_ioqvjns",
            "score": 38,
            "created_utc": 1663387675.0,
            "replies": [
                {
                    "body": "Of course! I’m not trying to say he’s bad at writing as that would just be pure ignorance. I’m a big fan of the series but I also wish we could’ve seen more from it especially in the world building aspect of it. It was set up amazingly but little was done with it leaving much of the audience including me with a lot of questions.",
                    "author": "YesImDavid",
                    "id": "iorisn1",
                    "parent_id": "t1_ior9ml6",
                    "score": 8,
                    "created_utc": 1663393540.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "To be fair, part at fault are his edditors.\n\nFor example they forced on him chunin exam arc. While Kishi wanted to send Team 7 on more missions and explore the world, with showing off more other villages and the whole team Gai meant to be from other village.",
            "author": "DrunkSaruman",
            "id": "iorvh1m",
            "parent_id": "t1_ioqvjns",
            "score": 14,
            "created_utc": 1663403273.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "ior5yau",
            "parent_id": "t1_ioqvjns",
            "score": -13,
            "created_utc": 1663385587.0,
            "replies": [
                {
                    "body": "We know very little about the other villages especially sand even though an entire arc took place there, we only know of a handful of clans in the leaf and only one of them is focused on regularly throughout the series, the only information we get about places outside of the leaf other than the land hidden in whirlpools is through filler, we know there are other Jinchuriki but we don’t even see most of them until the end of the series… these things are just off the top of my head. It isn’t extreme to point out an area lacking in a series. I already love Naruto but if the world was expanded more and if Kishimoto kept up with the world building he had been doing at the start of the series it would’ve been much more enjoyable.",
                    "author": "YesImDavid",
                    "id": "ior7hya",
                    "parent_id": "t1_ior5yau",
                    "score": 16,
                    "created_utc": 1663386452.0,
                    "replies": [
                        {
                            "body": "The Garra novel did go into a bit detail about the sand inner politic and other minor detail, might worth a read if you are interested , although even then dont expect too much",
                            "author": "long909",
                            "id": "iorc5fr",
                            "parent_id": "t1_ior7hya",
                            "score": 4,
                            "created_utc": 1663389186.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Uhh, no we meet 5...\nNaruto, Nagato, Kushina, Karin, and Mito (first Jinjuriki of the nine-tails) \nYou could even say 6 technically since we do SEE Nagato's mother (Fuso Uzamaki) she just has no real role to play. But yeah definitely more than 2",
            "author": "Mashed_Watermelon",
            "id": "iorp0yq",
            "parent_id": "t1_ioqkrw7",
            "score": 11,
            "created_utc": 1663398164.0,
            "replies": [
                {
                    "body": "Considering we only know Nagato as Pain until basically after he dies, and both Kushina and Mito are dead as doornails, I would cut that number down",
                    "author": "xxXMrDarknessXxx",
                    "id": "iorz1fl",
                    "parent_id": "t1_iorp0yq",
                    "score": -5,
                    "created_utc": 1663406213.0,
                    "replies": [
                        {
                            "body": "Your comment said \"We only see two of them throughout the series\" I was simply pointing out that that's is untrue, even if you want to say all of that that does not change the fact that they were all Uzamaki's that we had met during the story of Naruto",
                            "author": "Mashed_Watermelon",
                            "id": "ios1kty",
                            "parent_id": "t1_iorz1fl",
                            "score": 7,
                            "created_utc": 1663408193.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Three.",
            "author": "Physics_Useful",
            "id": "ioricv0",
            "parent_id": "t1_ioqkrw7",
            "score": 1,
            "created_utc": 1663393241.0,
            "replies": []
        },
        {
            "body": "Their spirits live on in Tsunade's gigantic boobs.",
            "author": "Phantom_Beef",
            "id": "ioqurit",
            "parent_id": "t1_ioq94lu",
            "score": 221,
            "created_utc": 1663379837.0,
            "replies": []
        },
        {
            "body": "I think they just merged and bred with everyone in konoha",
            "author": "DopeEspeon",
            "id": "ioqddrd",
            "parent_id": "t1_ioq94lu",
            "score": 187,
            "created_utc": 1663371447.0,
            "replies": [
                {
                    "body": "And none of them were worthy of keeping the Senju name? There should still be _some_ Senju around - it’s not like they only ever had daughters or something.",
                    "author": "Slight-Pound",
                    "id": "ioqzwwh",
                    "parent_id": "t1_ioqddrd",
                    "score": 154,
                    "created_utc": 1663382391.0,
                    "replies": [
                        {
                            "body": "Madara's ghost came and used the Sharingan to convince the Senju's to change their surname cause they were so much weaker than Hashirama.",
                            "author": "Few_Pay_5313",
                            "id": "ior7y1c",
                            "parent_id": "t1_ioqzwwh",
                            "score": 113,
                            "created_utc": 1663386702.0,
                            "replies": [
                                {
                                    "body": "He probably would've done/said the same to the Uchihas, but foresaw Itachi take care of that problem",
                                    "author": null,
                                    "id": "iorp29f",
                                    "parent_id": "t1_ior7y1c",
                                    "score": 48,
                                    "created_utc": 1663398193.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "No, Hashirama and tobirama decided as the clan elders that they should take others names and propagate their genes throughout the village, as opposed to the Uchiha who chose inbreeding and an insular clan system. The Senju genes being widespread across the village is why the hidden leaf is the strongest village as a whole.",
                            "author": "elementnix",
                            "id": "iori9rm",
                            "parent_id": "t1_ioqzwwh",
                            "score": 54,
                            "created_utc": 1663393182.0,
                            "replies": [
                                {
                                    "body": "That's headcanon, you know that right?\nLike literally everything you have just said it's made up.",
                                    "author": "frenin",
                                    "id": "iorjded",
                                    "parent_id": "t1_iori9rm",
                                    "score": 86,
                                    "created_utc": 1663393954.0,
                                    "replies": [
                                        {
                                            "body": "Source: I made it up",
                                            "author": "elementnix",
                                            "id": "iorjea4",
                                            "parent_id": "t1_iorjded",
                                            "score": 73,
                                            "created_utc": 1663393972.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "Hashirama did ordered them to marry other clans but nothing has been said about taking other family names",
                                            "author": "Background_69_69",
                                            "id": "iork2p1",
                                            "parent_id": "t1_iorjded",
                                            "score": 16,
                                            "created_utc": 1663394473.0,
                                            "replies": [
                                                {
                                                    "body": "Where's said that he did?",
                                                    "author": "frenin",
                                                    "id": "iorkm5k",
                                                    "parent_id": "t1_iork2p1",
                                                    "score": 15,
                                                    "created_utc": 1663394860.0,
                                                    "replies": [
                                                        {
                                                            "body": "Novels",
                                                            "author": "Background_69_69",
                                                            "id": "iorkw2k",
                                                            "parent_id": "t1_iorkm5k",
                                                            "score": 6,
                                                            "created_utc": 1663395062.0,
                                                            "replies": [
                                                                {
                                                                    "body": "I have read them and it certainly doesn't say so.\nIt does say that some Senju married out but not that it was a policy and never that it was so prominent that it literally made them die out.",
                                                                    "author": "frenin",
                                                                    "id": "iorl21l",
                                                                    "parent_id": "t1_iorkw2k",
                                                                    "score": 19,
                                                                    "created_utc": 1663395186.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "It’s a feasible explanation. I mean only two clans were supposed to have the power of chakra but we saw so many other clans with that power. Senju’s spread their genes among other clans like Uzumaki clan is also derived from Senju.",
                                    "author": "Rohan-kun",
                                    "id": "iork16c",
                                    "parent_id": "t1_iori9rm",
                                    "score": 11,
                                    "created_utc": 1663394442.0,
                                    "replies": [
                                        {
                                            "body": "only 2 clans? every single living breathing thing has chakra. there are literal ninja dogs and turtles. these two clans were just so much stronger than most other clans that most other clans didn’t bother to fight them. but you are right senju did spread around their genes, like uzumaki and sarutobi",
                                            "author": "SmegmaLord420",
                                            "id": "iorrdkd",
                                            "parent_id": "t1_iork16c",
                                            "score": 12,
                                            "created_utc": 1663400024.0,
                                            "replies": [
                                                {
                                                    "body": "Yes, I mistook chakra with Ninshu.",
                                                    "author": "Rohan-kun",
                                                    "id": "ioryn5b",
                                                    "parent_id": "t1_iorrdkd",
                                                    "score": 3,
                                                    "created_utc": 1663405902.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "The Uchiha Clan isn't inbreeding. That's like saying every Japanese, African or Swedish person is inbreeding.\n\nAlso the Uchiha Clan has a sister clan called the Fūma Clan in Part 2 & Bort.",
                                    "author": "Successful_Ad9924354",
                                    "id": "ip1c9m2",
                                    "parent_id": "t1_iori9rm",
                                    "score": 0,
                                    "created_utc": 1663572516.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "People's head canon is that Hashirama told them to take their spouses family names. I think Sakura is probably mostly a Senju because it makes no sense for her to be able to just emulate Tsunade and be one of the strongest ninja in konoha during Boruto",
                            "author": "Background_69_69",
                            "id": "iorjxf4",
                            "parent_id": "t1_ioqzwwh",
                            "score": 6,
                            "created_utc": 1663394363.0,
                            "replies": [
                                {
                                    "body": "That makes some sense, but you’d think they wouldn’t still treat the Senju as literally dying out still. They’re still Senju in blood, and they aren’t _that_ many generations removed from that initial decision, and it’s still weird that ALL of them agreed to it, too. The emphasis on clan techniques and power wouldn’t let their name legacy stay quiet, either. Everyone would be paying a lot of attention to Senju descendants.\n\nI’m more confused how they don’t keep up a community with each other, same name or not. They were still raised as siblings and cousins - family you can still reach out to. Tsunade seemed so isolated with Hashirama and Tobirama as her only family connections other than Nawaki. No other uncles, aunts, or cousins she was raised with, and presumably parents that died early on. This would make more sense if the Senju had already been getting pretty small by the countries founding, and it wasn’t.\n\nI’m fine with Sakura emulating her because I’m sick and tired of the only “good” ninjas coming from insane legacies. I want to have this, at least. Let the underdog narrative exist in more than just Lee.",
                                    "author": "Slight-Pound",
                                    "id": "iorndud",
                                    "parent_id": "t1_iorjxf4",
                                    "score": 21,
                                    "created_utc": 1663396908.0,
                                    "replies": [
                                        {
                                            "body": "The thing is that Tsunade's techniques are borderline senju exclusive because of the insane amounts of chakra and also ridiculous physical strength is a Senju trait. \n\nI think the head canon makes way more sense than the idea that the senju got wiped out during the wars or whatever because there was a ton of Uchiha and those guys were their equals and somehow the Hyugas straight up supplanted the Senju as the village rulers (remember the Hyugas were supposed to be the strongest clan and the Byakugan was supposed to be stronger than the sharingan lol good times)...\n\nMaybe the bulk of the Senju got absorbed into the Hyugas",
                                            "author": "Background_69_69",
                                            "id": "iorpfah",
                                            "parent_id": "t1_iorndud",
                                            "score": 13,
                                            "created_utc": 1663398469.0,
                                            "replies": [
                                                {
                                                    "body": "Yeah, that’s fair. I still would have liked more non-clan powerhouses in this show. It also reminds me of how we used to think Sakura could be a poison/illusion specialist before Tsunade seriously entered the narrative. What a time.\n\nThe headcanon makes the best sense out of the nonsensical writing of _why_ the Senju were wiped out during peace times, for sure. The other ninja clans of Naruto deserved better, really.\n\nI remember hoping for more Hyuuga world-building after meeting Neji in the Chuunin Exam and meeting Hinata and Neji again after the timeskip. I thought it would be a great way to really introduce making Hinata and Naruto friends - through learning about her clan and how Neji has found a way to thrive despite its shackles. I was, of course, devastatingly wrong. Kept waiting for other clans beside the Uchiha to get a turn, to no avail.\n\nThe Hyuuga’s seem like even bigger “blood purists” than the Uchiha’s give the air of, so I doubt it. I also doubt the Senju would be too chill about the Main/Side Branch thing, too. I think they became parts of civilian families for the most part, and some minor clans like the Ino-Shika-Chou. They seem chill enough to mingle with.",
                                                    "author": "Slight-Pound",
                                                    "id": "iorrnfp",
                                                    "parent_id": "t1_iorpfah",
                                                    "score": 6,
                                                    "created_utc": 1663400240.0,
                                                    "replies": [
                                                        {
                                                            "body": "It would be hilarious if Sarada just awoke the Rinegan out of nowhere because of the blood lines and learning the techniques developed by Tsunade despite it taking hundreds of years and a ridiculously complicated plan  to awaken it once",
                                                            "author": "Background_69_69",
                                                            "id": "iorsq6q",
                                                            "parent_id": "t1_iorrnfp",
                                                            "score": 2,
                                                            "created_utc": 1663401095.0,
                                                            "replies": [
                                                                {
                                                                    "body": "I’m honestly surprised something like that hasn’t happened yet.",
                                                                    "author": "Slight-Pound",
                                                                    "id": "iorsuxa",
                                                                    "parent_id": "t1_iorsq6q",
                                                                    "score": 1,
                                                                    "created_utc": 1663401204.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "body": "No, I don't remember because the Byakugan was never said to be stronger than the Sharingan. In canon Kishimoto had Kakashi say that the Byakugan is only superior in sight AKA distance.",
                                                    "author": "Successful_Ad9924354",
                                                    "id": "ip1cg8t",
                                                    "parent_id": "t1_iorpfah",
                                                    "score": 1,
                                                    "created_utc": 1663572675.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "\"senju\" is a clan name. so if you join another clan, you use that clan name not \"senju\".",
                            "author": "nizzy2k11",
                            "id": "iosxbeq",
                            "parent_id": "t1_ioqzwwh",
                            "score": 1,
                            "created_utc": 1663426549.0,
                            "replies": [
                                {
                                    "body": "That’s the thing - I doubt _all_ of them joined clans (I think a lot of them joined regular/civilian families, too) and even then, no one joined _theirs?_ Absolutely no one? No one wanted to have their family be called Senju like they were? Sons are also often the ones to carry the family name, and their wives and kids carry that name as a result. That’s why I mentioned “only having daughters” in the first place. Because that clearly _wasn’t_ the case.\n\n_That’s_ what doesn’t make sense. They’re not the only clan in Konoha that might have intermingled with others, either - the Ino-Shika-Chou is a group I think would most likely do something similar, but _they_ are still around, and they seemed smaller than the Senju, so why aren’t the Senju? The Senju were just unnecessarily written out of the story and there isn’t a lot of reasonable excuses to make sense of it - or rather, there shouldn’t have to be.\n\nEdit: the last line",
                                    "author": "Slight-Pound",
                                    "id": "ioszdq1",
                                    "parent_id": "t1_iosxbeq",
                                    "score": 2,
                                    "created_utc": 1663427440.0,
                                    "replies": [
                                        {
                                            "body": "It was never said that those with the name senju were a significant part of the alliance, just that they were powerful. The 3 sanin alone could take out thousands of rank and file ninja, it wouldn't take much to be powerful with good training.",
                                            "author": "nizzy2k11",
                                            "id": "iot6hnx",
                                            "parent_id": "t1_ioszdq1",
                                            "score": 1,
                                            "created_utc": 1663430409.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "People with the senju name were deliberately targeted on the battlefield by enemy operativesm like Nawaki. \nGiving up the last name was probably the safest option.",
                            "author": "depressed_panda0191",
                            "id": "iousane",
                            "parent_id": "t1_ioqzwwh",
                            "score": 1,
                            "created_utc": 1663454948.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Apparently. Don’t know how that worked, considering that both the Uchiha and the Senju were sizable, and we had no reason to believe that the Senju were dying out from something like fertility issues _before._ It really doesn’t make much sense.",
            "author": "Slight-Pound",
            "id": "ioqzttd",
            "parent_id": "t1_ioq94lu",
            "score": 29,
            "created_utc": 1663382346.0,
            "replies": [
                {
                    "body": "tsunades tatas are sizable \n\nohhhhhh",
                    "author": "God_Of_Asscheeks",
                    "id": "ior3jkc",
                    "parent_id": "t1_ioqzttd",
                    "score": 4,
                    "created_utc": 1663384288.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "*go",
            "author": "NameOfNoSignificance",
            "id": "iornwl3",
            "parent_id": "t1_ioq94lu",
            "score": 2,
            "created_utc": 1663397298.0,
            "replies": []
        },
        {
            "body": ">Kishimoto explaining how Itachi got a hold of the most broken weapones in the whole universe that somehow fit on a susano'o\n\nMy theory was that Yata Mirror and Totsuka Blade just adjust to size of User or to his will, otherwise it makes no fucking sense. Like, what use would have any non Uchiha Shinobi with a sword 10x his size?",
            "author": "KayWiszmanski",
            "id": "ioq903j",
            "parent_id": "t1_ioq2ur6",
            "score": 83,
            "created_utc": 1663369372.0,
            "replies": []
        },
        {
            "body": "Maybe he took it off his fellow Uchiha during the massacre?",
            "author": "CaptainPragmatism",
            "id": "iorsvsk",
            "parent_id": "t1_ioq2ur6",
            "score": 2,
            "created_utc": 1663401224.0,
            "replies": []
        },
        {
            "body": "But Narutos last name was Uzumaki ?\n\nAnd Hashirama and Tobirama existed already ?",
            "author": "cracked_camel",
            "id": "ire0e5r",
            "parent_id": "t1_ip1c0zl",
            "score": 1,
            "created_utc": 1665138017.0,
            "replies": []
        },
        {
            "body": "As soon as MS showed up it vacant real fodder",
            "author": "Adorable_Notice5427",
            "id": "iosip0b",
            "parent_id": "t1_iorpc5o",
            "score": 19,
            "created_utc": 1663419654.0,
            "replies": []
        },
        {
            "body": "To be fair, an average Hyuuga clan member was supposed to be stronger than a random Uchiha if they were still around, canonically\n\nMost people were stuck with base sharingan their whole lives and something like EMS was practically unheard of besides madara",
            "author": "Kinstray",
            "id": "iovkan9",
            "parent_id": "t1_iorpc5o",
            "score": 4,
            "created_utc": 1663468223.0,
            "replies": []
        },
        {
            "body": "At least they were valued and strong lol\n\n\nThe Hyuga and Kaguya clan got powers from the head goddess of the whole tree itself yet they're weak af \n\nThe Byakugan got heavily shafted which is sad. Even the evolution has some \"otsutsuki only\" bullshit restriction so well never see it again lol\n\n\nThe Kaguya clan with Shikotsumyaku have it worse too.\nThey were fucking exterminated and are now extinct...\n\nHell they didn't even need a war. Just having Kaguya's blood poisoned them to death lol\n\nSuper sad that both of my favorite clans are just garbage  that Kishimoto will never use again...\n\nThe only relevant Hyuga character is Himawari now and its not like she's gonna be a huge plot focus.\n\n\nThe Kaguya clan is basically gone now so I gave up on them.",
            "author": "Tsukinotaku",
            "id": "ios3tvc",
            "parent_id": "t1_ior8tmm",
            "score": 5,
            "created_utc": 1663409948.0,
            "replies": []
        },
        {
            "body": "Trees and Alien Moon Wizards",
            "author": "Lord_Sauron",
            "id": "ios978k",
            "parent_id": "t1_ior8tmm",
            "score": 1,
            "created_utc": 1663413954.0,
            "replies": [
                {
                    "body": "By kaguya clan I meant the actual Kaguya clan.\n\nThe one with Shikotsumyaku",
                    "author": "Tsukinotaku",
                    "id": "iosfmj0",
                    "parent_id": "t1_ios978k",
                    "score": 5,
                    "created_utc": 1663417952.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Nah, they from the land whirling tides which was an island nation. Aloes been said before they were distant relatives and the Uzumaki kind of have to be an offshoot of the senju otherwise Asura wouldn't have been able to reincarnate into Naruto and it seems in the Narutoverse Reincarnation is done along bloodlines.",
            "author": "Ambitious-Raise8107",
            "id": "ios5b8m",
            "parent_id": "t1_ios53vh",
            "score": 15,
            "created_utc": 1663411087.0,
            "replies": [
                {
                    "body": "Minato was from the Senju?\n\nEdit: I'll explain that basically the Uchiha clan's gripe was that they always went with the Senju clan for Hokage. When Minato was instated and the nine tails attacked, they were pretty much done as they thought that Sasuke's dad should've been Hokage and being sent to the border as being suspected as instigators of the attack. \n\nSo Minato, more likely than not, is from the Senju.",
                    "author": "SinglePostOfAccount",
                    "id": "ios5jay",
                    "parent_id": "t1_ios5b8m",
                    "score": 1,
                    "created_utc": 1663411257.0,
                    "replies": [
                        {
                            "body": "No, far as we know he's an orphan",
                            "author": "Ambitious-Raise8107",
                            "id": "ios5qfw",
                            "parent_id": "t1_ios5jay",
                            "score": 9,
                            "created_utc": 1663411411.0,
                            "replies": [
                                {
                                    "body": "I added a bit of an explanation above and it makes less sense for the Uzumaki, from an island nation, to be connected to the Senju when Minato, on the other hand, at least has Uchiha spite for becoming Hokage.",
                                    "author": "SinglePostOfAccount",
                                    "id": "ios61gv",
                                    "parent_id": "t1_ios5qfw",
                                    "score": 1,
                                    "created_utc": 1663411645.0,
                                    "replies": [
                                        {
                                            "body": "And behold we have looped back to the point of the meme, the Uzumaki clan being poorly explained.",
                                            "author": "Ambitious-Raise8107",
                                            "id": "ios6615",
                                            "parent_id": "t1_ios61gv",
                                            "score": 4,
                                            "created_utc": 1663411743.0,
                                            "replies": [
                                                {
                                                    "body": "Oh wait, nah the Uzumaki were distant relatives to the Senju. So I guess a bit of in breeding when Hashirama married an Uzumaki.\n\nAlso YUP, it was a singek panel saying that they were distantly related, so it wasn't like they were the off shoot of the Uzumakis but literal cousins in a sense.",
                                                    "author": "SinglePostOfAccount",
                                                    "id": "ios6dbw",
                                                    "parent_id": "t1_ios6615",
                                                    "score": 1,
                                                    "created_utc": 1663411896.0,
                                                    "replies": [
                                                        {
                                                            "body": "Really reeks of Kishis's trademark \"lmao not gonna explain shit.\"\n\nHell, only reason we know that the Kaguya and Hyuga clans are cousin clans is due to a single text box if explaining Kaguya's bone abilities in the databook. He's never been overly good when it comes to tying together lore threads. Like how Madara's timeline of events makes no sense.",
                                                            "author": "Ambitious-Raise8107",
                                                            "id": "ios6pmj",
                                                            "parent_id": "t1_ios6dbw",
                                                            "score": 5,
                                                            "created_utc": 1663412156.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "Minato married into the uzumakis",
                            "author": null,
                            "id": "iose8ve",
                            "parent_id": "t1_ios5jay",
                            "score": 3,
                            "created_utc": 1663417147.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Naruto? The same Naruto who's been begging for a scrap of family since he was a child? That one? lol",
            "author": "Ecstatic-Grass-2353",
            "id": "iorbk8i",
            "parent_id": "t1_ior61yv",
            "score": 36,
            "created_utc": 1663388820.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "iorbuq1",
                    "parent_id": "t1_iorbk8i",
                    "score": -9,
                    "created_utc": 1663389000.0,
                    "replies": [
                        {
                            "body": "If that's what you think, cool. Personally, I think he would get hella excited and drag her into random hijinks for no reason. That's just the kind of person he is (going by Naruto and Naruto: Shippuden standards).",
                            "author": "Ecstatic-Grass-2353",
                            "id": "iorc8hk",
                            "parent_id": "t1_iorbuq1",
                            "score": 24,
                            "created_utc": 1663389238.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Of course! I’m not trying to say he’s bad at writing as that would just be pure ignorance. I’m a big fan of the series but I also wish we could’ve seen more from it especially in the world building aspect of it. It was set up amazingly but little was done with it leaving much of the audience including me with a lot of questions.",
            "author": "YesImDavid",
            "id": "iorisn1",
            "parent_id": "t1_ior9ml6",
            "score": 8,
            "created_utc": 1663393540.0,
            "replies": []
        },
        {
            "body": "We know very little about the other villages especially sand even though an entire arc took place there, we only know of a handful of clans in the leaf and only one of them is focused on regularly throughout the series, the only information we get about places outside of the leaf other than the land hidden in whirlpools is through filler, we know there are other Jinchuriki but we don’t even see most of them until the end of the series… these things are just off the top of my head. It isn’t extreme to point out an area lacking in a series. I already love Naruto but if the world was expanded more and if Kishimoto kept up with the world building he had been doing at the start of the series it would’ve been much more enjoyable.",
            "author": "YesImDavid",
            "id": "ior7hya",
            "parent_id": "t1_ior5yau",
            "score": 16,
            "created_utc": 1663386452.0,
            "replies": [
                {
                    "body": "The Garra novel did go into a bit detail about the sand inner politic and other minor detail, might worth a read if you are interested , although even then dont expect too much",
                    "author": "long909",
                    "id": "iorc5fr",
                    "parent_id": "t1_ior7hya",
                    "score": 4,
                    "created_utc": 1663389186.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Considering we only know Nagato as Pain until basically after he dies, and both Kushina and Mito are dead as doornails, I would cut that number down",
            "author": "xxXMrDarknessXxx",
            "id": "iorz1fl",
            "parent_id": "t1_iorp0yq",
            "score": -5,
            "created_utc": 1663406213.0,
            "replies": [
                {
                    "body": "Your comment said \"We only see two of them throughout the series\" I was simply pointing out that that's is untrue, even if you want to say all of that that does not change the fact that they were all Uzamaki's that we had met during the story of Naruto",
                    "author": "Mashed_Watermelon",
                    "id": "ios1kty",
                    "parent_id": "t1_iorz1fl",
                    "score": 7,
                    "created_utc": 1663408193.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "And none of them were worthy of keeping the Senju name? There should still be _some_ Senju around - it’s not like they only ever had daughters or something.",
            "author": "Slight-Pound",
            "id": "ioqzwwh",
            "parent_id": "t1_ioqddrd",
            "score": 154,
            "created_utc": 1663382391.0,
            "replies": [
                {
                    "body": "Madara's ghost came and used the Sharingan to convince the Senju's to change their surname cause they were so much weaker than Hashirama.",
                    "author": "Few_Pay_5313",
                    "id": "ior7y1c",
                    "parent_id": "t1_ioqzwwh",
                    "score": 113,
                    "created_utc": 1663386702.0,
                    "replies": [
                        {
                            "body": "He probably would've done/said the same to the Uchihas, but foresaw Itachi take care of that problem",
                            "author": null,
                            "id": "iorp29f",
                            "parent_id": "t1_ior7y1c",
                            "score": 48,
                            "created_utc": 1663398193.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "No, Hashirama and tobirama decided as the clan elders that they should take others names and propagate their genes throughout the village, as opposed to the Uchiha who chose inbreeding and an insular clan system. The Senju genes being widespread across the village is why the hidden leaf is the strongest village as a whole.",
                    "author": "elementnix",
                    "id": "iori9rm",
                    "parent_id": "t1_ioqzwwh",
                    "score": 54,
                    "created_utc": 1663393182.0,
                    "replies": [
                        {
                            "body": "That's headcanon, you know that right?\nLike literally everything you have just said it's made up.",
                            "author": "frenin",
                            "id": "iorjded",
                            "parent_id": "t1_iori9rm",
                            "score": 86,
                            "created_utc": 1663393954.0,
                            "replies": [
                                {
                                    "body": "Source: I made it up",
                                    "author": "elementnix",
                                    "id": "iorjea4",
                                    "parent_id": "t1_iorjded",
                                    "score": 73,
                                    "created_utc": 1663393972.0,
                                    "replies": []
                                },
                                {
                                    "body": "Hashirama did ordered them to marry other clans but nothing has been said about taking other family names",
                                    "author": "Background_69_69",
                                    "id": "iork2p1",
                                    "parent_id": "t1_iorjded",
                                    "score": 16,
                                    "created_utc": 1663394473.0,
                                    "replies": [
                                        {
                                            "body": "Where's said that he did?",
                                            "author": "frenin",
                                            "id": "iorkm5k",
                                            "parent_id": "t1_iork2p1",
                                            "score": 15,
                                            "created_utc": 1663394860.0,
                                            "replies": [
                                                {
                                                    "body": "Novels",
                                                    "author": "Background_69_69",
                                                    "id": "iorkw2k",
                                                    "parent_id": "t1_iorkm5k",
                                                    "score": 6,
                                                    "created_utc": 1663395062.0,
                                                    "replies": [
                                                        {
                                                            "body": "I have read them and it certainly doesn't say so.\nIt does say that some Senju married out but not that it was a policy and never that it was so prominent that it literally made them die out.",
                                                            "author": "frenin",
                                                            "id": "iorl21l",
                                                            "parent_id": "t1_iorkw2k",
                                                            "score": 19,
                                                            "created_utc": 1663395186.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "It’s a feasible explanation. I mean only two clans were supposed to have the power of chakra but we saw so many other clans with that power. Senju’s spread their genes among other clans like Uzumaki clan is also derived from Senju.",
                            "author": "Rohan-kun",
                            "id": "iork16c",
                            "parent_id": "t1_iori9rm",
                            "score": 11,
                            "created_utc": 1663394442.0,
                            "replies": [
                                {
                                    "body": "only 2 clans? every single living breathing thing has chakra. there are literal ninja dogs and turtles. these two clans were just so much stronger than most other clans that most other clans didn’t bother to fight them. but you are right senju did spread around their genes, like uzumaki and sarutobi",
                                    "author": "SmegmaLord420",
                                    "id": "iorrdkd",
                                    "parent_id": "t1_iork16c",
                                    "score": 12,
                                    "created_utc": 1663400024.0,
                                    "replies": [
                                        {
                                            "body": "Yes, I mistook chakra with Ninshu.",
                                            "author": "Rohan-kun",
                                            "id": "ioryn5b",
                                            "parent_id": "t1_iorrdkd",
                                            "score": 3,
                                            "created_utc": 1663405902.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "The Uchiha Clan isn't inbreeding. That's like saying every Japanese, African or Swedish person is inbreeding.\n\nAlso the Uchiha Clan has a sister clan called the Fūma Clan in Part 2 & Bort.",
                            "author": "Successful_Ad9924354",
                            "id": "ip1c9m2",
                            "parent_id": "t1_iori9rm",
                            "score": 0,
                            "created_utc": 1663572516.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "People's head canon is that Hashirama told them to take their spouses family names. I think Sakura is probably mostly a Senju because it makes no sense for her to be able to just emulate Tsunade and be one of the strongest ninja in konoha during Boruto",
                    "author": "Background_69_69",
                    "id": "iorjxf4",
                    "parent_id": "t1_ioqzwwh",
                    "score": 6,
                    "created_utc": 1663394363.0,
                    "replies": [
                        {
                            "body": "That makes some sense, but you’d think they wouldn’t still treat the Senju as literally dying out still. They’re still Senju in blood, and they aren’t _that_ many generations removed from that initial decision, and it’s still weird that ALL of them agreed to it, too. The emphasis on clan techniques and power wouldn’t let their name legacy stay quiet, either. Everyone would be paying a lot of attention to Senju descendants.\n\nI’m more confused how they don’t keep up a community with each other, same name or not. They were still raised as siblings and cousins - family you can still reach out to. Tsunade seemed so isolated with Hashirama and Tobirama as her only family connections other than Nawaki. No other uncles, aunts, or cousins she was raised with, and presumably parents that died early on. This would make more sense if the Senju had already been getting pretty small by the countries founding, and it wasn’t.\n\nI’m fine with Sakura emulating her because I’m sick and tired of the only “good” ninjas coming from insane legacies. I want to have this, at least. Let the underdog narrative exist in more than just Lee.",
                            "author": "Slight-Pound",
                            "id": "iorndud",
                            "parent_id": "t1_iorjxf4",
                            "score": 21,
                            "created_utc": 1663396908.0,
                            "replies": [
                                {
                                    "body": "The thing is that Tsunade's techniques are borderline senju exclusive because of the insane amounts of chakra and also ridiculous physical strength is a Senju trait. \n\nI think the head canon makes way more sense than the idea that the senju got wiped out during the wars or whatever because there was a ton of Uchiha and those guys were their equals and somehow the Hyugas straight up supplanted the Senju as the village rulers (remember the Hyugas were supposed to be the strongest clan and the Byakugan was supposed to be stronger than the sharingan lol good times)...\n\nMaybe the bulk of the Senju got absorbed into the Hyugas",
                                    "author": "Background_69_69",
                                    "id": "iorpfah",
                                    "parent_id": "t1_iorndud",
                                    "score": 13,
                                    "created_utc": 1663398469.0,
                                    "replies": [
                                        {
                                            "body": "Yeah, that’s fair. I still would have liked more non-clan powerhouses in this show. It also reminds me of how we used to think Sakura could be a poison/illusion specialist before Tsunade seriously entered the narrative. What a time.\n\nThe headcanon makes the best sense out of the nonsensical writing of _why_ the Senju were wiped out during peace times, for sure. The other ninja clans of Naruto deserved better, really.\n\nI remember hoping for more Hyuuga world-building after meeting Neji in the Chuunin Exam and meeting Hinata and Neji again after the timeskip. I thought it would be a great way to really introduce making Hinata and Naruto friends - through learning about her clan and how Neji has found a way to thrive despite its shackles. I was, of course, devastatingly wrong. Kept waiting for other clans beside the Uchiha to get a turn, to no avail.\n\nThe Hyuuga’s seem like even bigger “blood purists” than the Uchiha’s give the air of, so I doubt it. I also doubt the Senju would be too chill about the Main/Side Branch thing, too. I think they became parts of civilian families for the most part, and some minor clans like the Ino-Shika-Chou. They seem chill enough to mingle with.",
                                            "author": "Slight-Pound",
                                            "id": "iorrnfp",
                                            "parent_id": "t1_iorpfah",
                                            "score": 6,
                                            "created_utc": 1663400240.0,
                                            "replies": [
                                                {
                                                    "body": "It would be hilarious if Sarada just awoke the Rinegan out of nowhere because of the blood lines and learning the techniques developed by Tsunade despite it taking hundreds of years and a ridiculously complicated plan  to awaken it once",
                                                    "author": "Background_69_69",
                                                    "id": "iorsq6q",
                                                    "parent_id": "t1_iorrnfp",
                                                    "score": 2,
                                                    "created_utc": 1663401095.0,
                                                    "replies": [
                                                        {
                                                            "body": "I’m honestly surprised something like that hasn’t happened yet.",
                                                            "author": "Slight-Pound",
                                                            "id": "iorsuxa",
                                                            "parent_id": "t1_iorsq6q",
                                                            "score": 1,
                                                            "created_utc": 1663401204.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "body": "No, I don't remember because the Byakugan was never said to be stronger than the Sharingan. In canon Kishimoto had Kakashi say that the Byakugan is only superior in sight AKA distance.",
                                            "author": "Successful_Ad9924354",
                                            "id": "ip1cg8t",
                                            "parent_id": "t1_iorpfah",
                                            "score": 1,
                                            "created_utc": 1663572675.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "\"senju\" is a clan name. so if you join another clan, you use that clan name not \"senju\".",
                    "author": "nizzy2k11",
                    "id": "iosxbeq",
                    "parent_id": "t1_ioqzwwh",
                    "score": 1,
                    "created_utc": 1663426549.0,
                    "replies": [
                        {
                            "body": "That’s the thing - I doubt _all_ of them joined clans (I think a lot of them joined regular/civilian families, too) and even then, no one joined _theirs?_ Absolutely no one? No one wanted to have their family be called Senju like they were? Sons are also often the ones to carry the family name, and their wives and kids carry that name as a result. That’s why I mentioned “only having daughters” in the first place. Because that clearly _wasn’t_ the case.\n\n_That’s_ what doesn’t make sense. They’re not the only clan in Konoha that might have intermingled with others, either - the Ino-Shika-Chou is a group I think would most likely do something similar, but _they_ are still around, and they seemed smaller than the Senju, so why aren’t the Senju? The Senju were just unnecessarily written out of the story and there isn’t a lot of reasonable excuses to make sense of it - or rather, there shouldn’t have to be.\n\nEdit: the last line",
                            "author": "Slight-Pound",
                            "id": "ioszdq1",
                            "parent_id": "t1_iosxbeq",
                            "score": 2,
                            "created_utc": 1663427440.0,
                            "replies": [
                                {
                                    "body": "It was never said that those with the name senju were a significant part of the alliance, just that they were powerful. The 3 sanin alone could take out thousands of rank and file ninja, it wouldn't take much to be powerful with good training.",
                                    "author": "nizzy2k11",
                                    "id": "iot6hnx",
                                    "parent_id": "t1_ioszdq1",
                                    "score": 1,
                                    "created_utc": 1663430409.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "People with the senju name were deliberately targeted on the battlefield by enemy operativesm like Nawaki. \nGiving up the last name was probably the safest option.",
                    "author": "depressed_panda0191",
                    "id": "iousane",
                    "parent_id": "t1_ioqzwwh",
                    "score": 1,
                    "created_utc": 1663454948.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "tsunades tatas are sizable \n\nohhhhhh",
            "author": "God_Of_Asscheeks",
            "id": "ior3jkc",
            "parent_id": "t1_ioqzttd",
            "score": 4,
            "created_utc": 1663384288.0,
            "replies": []
        },
        {
            "body": "By kaguya clan I meant the actual Kaguya clan.\n\nThe one with Shikotsumyaku",
            "author": "Tsukinotaku",
            "id": "iosfmj0",
            "parent_id": "t1_ios978k",
            "score": 5,
            "created_utc": 1663417952.0,
            "replies": []
        },
        {
            "body": "Minato was from the Senju?\n\nEdit: I'll explain that basically the Uchiha clan's gripe was that they always went with the Senju clan for Hokage. When Minato was instated and the nine tails attacked, they were pretty much done as they thought that Sasuke's dad should've been Hokage and being sent to the border as being suspected as instigators of the attack. \n\nSo Minato, more likely than not, is from the Senju.",
            "author": "SinglePostOfAccount",
            "id": "ios5jay",
            "parent_id": "t1_ios5b8m",
            "score": 1,
            "created_utc": 1663411257.0,
            "replies": [
                {
                    "body": "No, far as we know he's an orphan",
                    "author": "Ambitious-Raise8107",
                    "id": "ios5qfw",
                    "parent_id": "t1_ios5jay",
                    "score": 9,
                    "created_utc": 1663411411.0,
                    "replies": [
                        {
                            "body": "I added a bit of an explanation above and it makes less sense for the Uzumaki, from an island nation, to be connected to the Senju when Minato, on the other hand, at least has Uchiha spite for becoming Hokage.",
                            "author": "SinglePostOfAccount",
                            "id": "ios61gv",
                            "parent_id": "t1_ios5qfw",
                            "score": 1,
                            "created_utc": 1663411645.0,
                            "replies": [
                                {
                                    "body": "And behold we have looped back to the point of the meme, the Uzumaki clan being poorly explained.",
                                    "author": "Ambitious-Raise8107",
                                    "id": "ios6615",
                                    "parent_id": "t1_ios61gv",
                                    "score": 4,
                                    "created_utc": 1663411743.0,
                                    "replies": [
                                        {
                                            "body": "Oh wait, nah the Uzumaki were distant relatives to the Senju. So I guess a bit of in breeding when Hashirama married an Uzumaki.\n\nAlso YUP, it was a singek panel saying that they were distantly related, so it wasn't like they were the off shoot of the Uzumakis but literal cousins in a sense.",
                                            "author": "SinglePostOfAccount",
                                            "id": "ios6dbw",
                                            "parent_id": "t1_ios6615",
                                            "score": 1,
                                            "created_utc": 1663411896.0,
                                            "replies": [
                                                {
                                                    "body": "Really reeks of Kishis's trademark \"lmao not gonna explain shit.\"\n\nHell, only reason we know that the Kaguya and Hyuga clans are cousin clans is due to a single text box if explaining Kaguya's bone abilities in the databook. He's never been overly good when it comes to tying together lore threads. Like how Madara's timeline of events makes no sense.",
                                                    "author": "Ambitious-Raise8107",
                                                    "id": "ios6pmj",
                                                    "parent_id": "t1_ios6dbw",
                                                    "score": 5,
                                                    "created_utc": 1663412156.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Minato married into the uzumakis",
                    "author": null,
                    "id": "iose8ve",
                    "parent_id": "t1_ios5jay",
                    "score": 3,
                    "created_utc": 1663417147.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "iorbuq1",
            "parent_id": "t1_iorbk8i",
            "score": -9,
            "created_utc": 1663389000.0,
            "replies": [
                {
                    "body": "If that's what you think, cool. Personally, I think he would get hella excited and drag her into random hijinks for no reason. That's just the kind of person he is (going by Naruto and Naruto: Shippuden standards).",
                    "author": "Ecstatic-Grass-2353",
                    "id": "iorc8hk",
                    "parent_id": "t1_iorbuq1",
                    "score": 24,
                    "created_utc": 1663389238.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "The Garra novel did go into a bit detail about the sand inner politic and other minor detail, might worth a read if you are interested , although even then dont expect too much",
            "author": "long909",
            "id": "iorc5fr",
            "parent_id": "t1_ior7hya",
            "score": 4,
            "created_utc": 1663389186.0,
            "replies": []
        },
        {
            "body": "Your comment said \"We only see two of them throughout the series\" I was simply pointing out that that's is untrue, even if you want to say all of that that does not change the fact that they were all Uzamaki's that we had met during the story of Naruto",
            "author": "Mashed_Watermelon",
            "id": "ios1kty",
            "parent_id": "t1_iorz1fl",
            "score": 7,
            "created_utc": 1663408193.0,
            "replies": []
        },
        {
            "body": "Madara's ghost came and used the Sharingan to convince the Senju's to change their surname cause they were so much weaker than Hashirama.",
            "author": "Few_Pay_5313",
            "id": "ior7y1c",
            "parent_id": "t1_ioqzwwh",
            "score": 113,
            "created_utc": 1663386702.0,
            "replies": [
                {
                    "body": "He probably would've done/said the same to the Uchihas, but foresaw Itachi take care of that problem",
                    "author": null,
                    "id": "iorp29f",
                    "parent_id": "t1_ior7y1c",
                    "score": 48,
                    "created_utc": 1663398193.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "No, Hashirama and tobirama decided as the clan elders that they should take others names and propagate their genes throughout the village, as opposed to the Uchiha who chose inbreeding and an insular clan system. The Senju genes being widespread across the village is why the hidden leaf is the strongest village as a whole.",
            "author": "elementnix",
            "id": "iori9rm",
            "parent_id": "t1_ioqzwwh",
            "score": 54,
            "created_utc": 1663393182.0,
            "replies": [
                {
                    "body": "That's headcanon, you know that right?\nLike literally everything you have just said it's made up.",
                    "author": "frenin",
                    "id": "iorjded",
                    "parent_id": "t1_iori9rm",
                    "score": 86,
                    "created_utc": 1663393954.0,
                    "replies": [
                        {
                            "body": "Source: I made it up",
                            "author": "elementnix",
                            "id": "iorjea4",
                            "parent_id": "t1_iorjded",
                            "score": 73,
                            "created_utc": 1663393972.0,
                            "replies": []
                        },
                        {
                            "body": "Hashirama did ordered them to marry other clans but nothing has been said about taking other family names",
                            "author": "Background_69_69",
                            "id": "iork2p1",
                            "parent_id": "t1_iorjded",
                            "score": 16,
                            "created_utc": 1663394473.0,
                            "replies": [
                                {
                                    "body": "Where's said that he did?",
                                    "author": "frenin",
                                    "id": "iorkm5k",
                                    "parent_id": "t1_iork2p1",
                                    "score": 15,
                                    "created_utc": 1663394860.0,
                                    "replies": [
                                        {
                                            "body": "Novels",
                                            "author": "Background_69_69",
                                            "id": "iorkw2k",
                                            "parent_id": "t1_iorkm5k",
                                            "score": 6,
                                            "created_utc": 1663395062.0,
                                            "replies": [
                                                {
                                                    "body": "I have read them and it certainly doesn't say so.\nIt does say that some Senju married out but not that it was a policy and never that it was so prominent that it literally made them die out.",
                                                    "author": "frenin",
                                                    "id": "iorl21l",
                                                    "parent_id": "t1_iorkw2k",
                                                    "score": 19,
                                                    "created_utc": 1663395186.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "It’s a feasible explanation. I mean only two clans were supposed to have the power of chakra but we saw so many other clans with that power. Senju’s spread their genes among other clans like Uzumaki clan is also derived from Senju.",
                    "author": "Rohan-kun",
                    "id": "iork16c",
                    "parent_id": "t1_iori9rm",
                    "score": 11,
                    "created_utc": 1663394442.0,
                    "replies": [
                        {
                            "body": "only 2 clans? every single living breathing thing has chakra. there are literal ninja dogs and turtles. these two clans were just so much stronger than most other clans that most other clans didn’t bother to fight them. but you are right senju did spread around their genes, like uzumaki and sarutobi",
                            "author": "SmegmaLord420",
                            "id": "iorrdkd",
                            "parent_id": "t1_iork16c",
                            "score": 12,
                            "created_utc": 1663400024.0,
                            "replies": [
                                {
                                    "body": "Yes, I mistook chakra with Ninshu.",
                                    "author": "Rohan-kun",
                                    "id": "ioryn5b",
                                    "parent_id": "t1_iorrdkd",
                                    "score": 3,
                                    "created_utc": 1663405902.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "The Uchiha Clan isn't inbreeding. That's like saying every Japanese, African or Swedish person is inbreeding.\n\nAlso the Uchiha Clan has a sister clan called the Fūma Clan in Part 2 & Bort.",
                    "author": "Successful_Ad9924354",
                    "id": "ip1c9m2",
                    "parent_id": "t1_iori9rm",
                    "score": 0,
                    "created_utc": 1663572516.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "People's head canon is that Hashirama told them to take their spouses family names. I think Sakura is probably mostly a Senju because it makes no sense for her to be able to just emulate Tsunade and be one of the strongest ninja in konoha during Boruto",
            "author": "Background_69_69",
            "id": "iorjxf4",
            "parent_id": "t1_ioqzwwh",
            "score": 6,
            "created_utc": 1663394363.0,
            "replies": [
                {
                    "body": "That makes some sense, but you’d think they wouldn’t still treat the Senju as literally dying out still. They’re still Senju in blood, and they aren’t _that_ many generations removed from that initial decision, and it’s still weird that ALL of them agreed to it, too. The emphasis on clan techniques and power wouldn’t let their name legacy stay quiet, either. Everyone would be paying a lot of attention to Senju descendants.\n\nI’m more confused how they don’t keep up a community with each other, same name or not. They were still raised as siblings and cousins - family you can still reach out to. Tsunade seemed so isolated with Hashirama and Tobirama as her only family connections other than Nawaki. No other uncles, aunts, or cousins she was raised with, and presumably parents that died early on. This would make more sense if the Senju had already been getting pretty small by the countries founding, and it wasn’t.\n\nI’m fine with Sakura emulating her because I’m sick and tired of the only “good” ninjas coming from insane legacies. I want to have this, at least. Let the underdog narrative exist in more than just Lee.",
                    "author": "Slight-Pound",
                    "id": "iorndud",
                    "parent_id": "t1_iorjxf4",
                    "score": 21,
                    "created_utc": 1663396908.0,
                    "replies": [
                        {
                            "body": "The thing is that Tsunade's techniques are borderline senju exclusive because of the insane amounts of chakra and also ridiculous physical strength is a Senju trait. \n\nI think the head canon makes way more sense than the idea that the senju got wiped out during the wars or whatever because there was a ton of Uchiha and those guys were their equals and somehow the Hyugas straight up supplanted the Senju as the village rulers (remember the Hyugas were supposed to be the strongest clan and the Byakugan was supposed to be stronger than the sharingan lol good times)...\n\nMaybe the bulk of the Senju got absorbed into the Hyugas",
                            "author": "Background_69_69",
                            "id": "iorpfah",
                            "parent_id": "t1_iorndud",
                            "score": 13,
                            "created_utc": 1663398469.0,
                            "replies": [
                                {
                                    "body": "Yeah, that’s fair. I still would have liked more non-clan powerhouses in this show. It also reminds me of how we used to think Sakura could be a poison/illusion specialist before Tsunade seriously entered the narrative. What a time.\n\nThe headcanon makes the best sense out of the nonsensical writing of _why_ the Senju were wiped out during peace times, for sure. The other ninja clans of Naruto deserved better, really.\n\nI remember hoping for more Hyuuga world-building after meeting Neji in the Chuunin Exam and meeting Hinata and Neji again after the timeskip. I thought it would be a great way to really introduce making Hinata and Naruto friends - through learning about her clan and how Neji has found a way to thrive despite its shackles. I was, of course, devastatingly wrong. Kept waiting for other clans beside the Uchiha to get a turn, to no avail.\n\nThe Hyuuga’s seem like even bigger “blood purists” than the Uchiha’s give the air of, so I doubt it. I also doubt the Senju would be too chill about the Main/Side Branch thing, too. I think they became parts of civilian families for the most part, and some minor clans like the Ino-Shika-Chou. They seem chill enough to mingle with.",
                                    "author": "Slight-Pound",
                                    "id": "iorrnfp",
                                    "parent_id": "t1_iorpfah",
                                    "score": 6,
                                    "created_utc": 1663400240.0,
                                    "replies": [
                                        {
                                            "body": "It would be hilarious if Sarada just awoke the Rinegan out of nowhere because of the blood lines and learning the techniques developed by Tsunade despite it taking hundreds of years and a ridiculously complicated plan  to awaken it once",
                                            "author": "Background_69_69",
                                            "id": "iorsq6q",
                                            "parent_id": "t1_iorrnfp",
                                            "score": 2,
                                            "created_utc": 1663401095.0,
                                            "replies": [
                                                {
                                                    "body": "I’m honestly surprised something like that hasn’t happened yet.",
                                                    "author": "Slight-Pound",
                                                    "id": "iorsuxa",
                                                    "parent_id": "t1_iorsq6q",
                                                    "score": 1,
                                                    "created_utc": 1663401204.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "No, I don't remember because the Byakugan was never said to be stronger than the Sharingan. In canon Kishimoto had Kakashi say that the Byakugan is only superior in sight AKA distance.",
                                    "author": "Successful_Ad9924354",
                                    "id": "ip1cg8t",
                                    "parent_id": "t1_iorpfah",
                                    "score": 1,
                                    "created_utc": 1663572675.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "\"senju\" is a clan name. so if you join another clan, you use that clan name not \"senju\".",
            "author": "nizzy2k11",
            "id": "iosxbeq",
            "parent_id": "t1_ioqzwwh",
            "score": 1,
            "created_utc": 1663426549.0,
            "replies": [
                {
                    "body": "That’s the thing - I doubt _all_ of them joined clans (I think a lot of them joined regular/civilian families, too) and even then, no one joined _theirs?_ Absolutely no one? No one wanted to have their family be called Senju like they were? Sons are also often the ones to carry the family name, and their wives and kids carry that name as a result. That’s why I mentioned “only having daughters” in the first place. Because that clearly _wasn’t_ the case.\n\n_That’s_ what doesn’t make sense. They’re not the only clan in Konoha that might have intermingled with others, either - the Ino-Shika-Chou is a group I think would most likely do something similar, but _they_ are still around, and they seemed smaller than the Senju, so why aren’t the Senju? The Senju were just unnecessarily written out of the story and there isn’t a lot of reasonable excuses to make sense of it - or rather, there shouldn’t have to be.\n\nEdit: the last line",
                    "author": "Slight-Pound",
                    "id": "ioszdq1",
                    "parent_id": "t1_iosxbeq",
                    "score": 2,
                    "created_utc": 1663427440.0,
                    "replies": [
                        {
                            "body": "It was never said that those with the name senju were a significant part of the alliance, just that they were powerful. The 3 sanin alone could take out thousands of rank and file ninja, it wouldn't take much to be powerful with good training.",
                            "author": "nizzy2k11",
                            "id": "iot6hnx",
                            "parent_id": "t1_ioszdq1",
                            "score": 1,
                            "created_utc": 1663430409.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "People with the senju name were deliberately targeted on the battlefield by enemy operativesm like Nawaki. \nGiving up the last name was probably the safest option.",
            "author": "depressed_panda0191",
            "id": "iousane",
            "parent_id": "t1_ioqzwwh",
            "score": 1,
            "created_utc": 1663454948.0,
            "replies": []
        },
        {
            "body": "No, far as we know he's an orphan",
            "author": "Ambitious-Raise8107",
            "id": "ios5qfw",
            "parent_id": "t1_ios5jay",
            "score": 9,
            "created_utc": 1663411411.0,
            "replies": [
                {
                    "body": "I added a bit of an explanation above and it makes less sense for the Uzumaki, from an island nation, to be connected to the Senju when Minato, on the other hand, at least has Uchiha spite for becoming Hokage.",
                    "author": "SinglePostOfAccount",
                    "id": "ios61gv",
                    "parent_id": "t1_ios5qfw",
                    "score": 1,
                    "created_utc": 1663411645.0,
                    "replies": [
                        {
                            "body": "And behold we have looped back to the point of the meme, the Uzumaki clan being poorly explained.",
                            "author": "Ambitious-Raise8107",
                            "id": "ios6615",
                            "parent_id": "t1_ios61gv",
                            "score": 4,
                            "created_utc": 1663411743.0,
                            "replies": [
                                {
                                    "body": "Oh wait, nah the Uzumaki were distant relatives to the Senju. So I guess a bit of in breeding when Hashirama married an Uzumaki.\n\nAlso YUP, it was a singek panel saying that they were distantly related, so it wasn't like they were the off shoot of the Uzumakis but literal cousins in a sense.",
                                    "author": "SinglePostOfAccount",
                                    "id": "ios6dbw",
                                    "parent_id": "t1_ios6615",
                                    "score": 1,
                                    "created_utc": 1663411896.0,
                                    "replies": [
                                        {
                                            "body": "Really reeks of Kishis's trademark \"lmao not gonna explain shit.\"\n\nHell, only reason we know that the Kaguya and Hyuga clans are cousin clans is due to a single text box if explaining Kaguya's bone abilities in the databook. He's never been overly good when it comes to tying together lore threads. Like how Madara's timeline of events makes no sense.",
                                            "author": "Ambitious-Raise8107",
                                            "id": "ios6pmj",
                                            "parent_id": "t1_ios6dbw",
                                            "score": 5,
                                            "created_utc": 1663412156.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Minato married into the uzumakis",
            "author": null,
            "id": "iose8ve",
            "parent_id": "t1_ios5jay",
            "score": 3,
            "created_utc": 1663417147.0,
            "replies": []
        },
        {
            "body": "If that's what you think, cool. Personally, I think he would get hella excited and drag her into random hijinks for no reason. That's just the kind of person he is (going by Naruto and Naruto: Shippuden standards).",
            "author": "Ecstatic-Grass-2353",
            "id": "iorc8hk",
            "parent_id": "t1_iorbuq1",
            "score": 24,
            "created_utc": 1663389238.0,
            "replies": []
        },
        {
            "body": "He probably would've done/said the same to the Uchihas, but foresaw Itachi take care of that problem",
            "author": null,
            "id": "iorp29f",
            "parent_id": "t1_ior7y1c",
            "score": 48,
            "created_utc": 1663398193.0,
            "replies": []
        },
        {
            "body": "That's headcanon, you know that right?\nLike literally everything you have just said it's made up.",
            "author": "frenin",
            "id": "iorjded",
            "parent_id": "t1_iori9rm",
            "score": 86,
            "created_utc": 1663393954.0,
            "replies": [
                {
                    "body": "Source: I made it up",
                    "author": "elementnix",
                    "id": "iorjea4",
                    "parent_id": "t1_iorjded",
                    "score": 73,
                    "created_utc": 1663393972.0,
                    "replies": []
                },
                {
                    "body": "Hashirama did ordered them to marry other clans but nothing has been said about taking other family names",
                    "author": "Background_69_69",
                    "id": "iork2p1",
                    "parent_id": "t1_iorjded",
                    "score": 16,
                    "created_utc": 1663394473.0,
                    "replies": [
                        {
                            "body": "Where's said that he did?",
                            "author": "frenin",
                            "id": "iorkm5k",
                            "parent_id": "t1_iork2p1",
                            "score": 15,
                            "created_utc": 1663394860.0,
                            "replies": [
                                {
                                    "body": "Novels",
                                    "author": "Background_69_69",
                                    "id": "iorkw2k",
                                    "parent_id": "t1_iorkm5k",
                                    "score": 6,
                                    "created_utc": 1663395062.0,
                                    "replies": [
                                        {
                                            "body": "I have read them and it certainly doesn't say so.\nIt does say that some Senju married out but not that it was a policy and never that it was so prominent that it literally made them die out.",
                                            "author": "frenin",
                                            "id": "iorl21l",
                                            "parent_id": "t1_iorkw2k",
                                            "score": 19,
                                            "created_utc": 1663395186.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "It’s a feasible explanation. I mean only two clans were supposed to have the power of chakra but we saw so many other clans with that power. Senju’s spread their genes among other clans like Uzumaki clan is also derived from Senju.",
            "author": "Rohan-kun",
            "id": "iork16c",
            "parent_id": "t1_iori9rm",
            "score": 11,
            "created_utc": 1663394442.0,
            "replies": [
                {
                    "body": "only 2 clans? every single living breathing thing has chakra. there are literal ninja dogs and turtles. these two clans were just so much stronger than most other clans that most other clans didn’t bother to fight them. but you are right senju did spread around their genes, like uzumaki and sarutobi",
                    "author": "SmegmaLord420",
                    "id": "iorrdkd",
                    "parent_id": "t1_iork16c",
                    "score": 12,
                    "created_utc": 1663400024.0,
                    "replies": [
                        {
                            "body": "Yes, I mistook chakra with Ninshu.",
                            "author": "Rohan-kun",
                            "id": "ioryn5b",
                            "parent_id": "t1_iorrdkd",
                            "score": 3,
                            "created_utc": 1663405902.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "The Uchiha Clan isn't inbreeding. That's like saying every Japanese, African or Swedish person is inbreeding.\n\nAlso the Uchiha Clan has a sister clan called the Fūma Clan in Part 2 & Bort.",
            "author": "Successful_Ad9924354",
            "id": "ip1c9m2",
            "parent_id": "t1_iori9rm",
            "score": 0,
            "created_utc": 1663572516.0,
            "replies": []
        },
        {
            "body": "That makes some sense, but you’d think they wouldn’t still treat the Senju as literally dying out still. They’re still Senju in blood, and they aren’t _that_ many generations removed from that initial decision, and it’s still weird that ALL of them agreed to it, too. The emphasis on clan techniques and power wouldn’t let their name legacy stay quiet, either. Everyone would be paying a lot of attention to Senju descendants.\n\nI’m more confused how they don’t keep up a community with each other, same name or not. They were still raised as siblings and cousins - family you can still reach out to. Tsunade seemed so isolated with Hashirama and Tobirama as her only family connections other than Nawaki. No other uncles, aunts, or cousins she was raised with, and presumably parents that died early on. This would make more sense if the Senju had already been getting pretty small by the countries founding, and it wasn’t.\n\nI’m fine with Sakura emulating her because I’m sick and tired of the only “good” ninjas coming from insane legacies. I want to have this, at least. Let the underdog narrative exist in more than just Lee.",
            "author": "Slight-Pound",
            "id": "iorndud",
            "parent_id": "t1_iorjxf4",
            "score": 21,
            "created_utc": 1663396908.0,
            "replies": [
                {
                    "body": "The thing is that Tsunade's techniques are borderline senju exclusive because of the insane amounts of chakra and also ridiculous physical strength is a Senju trait. \n\nI think the head canon makes way more sense than the idea that the senju got wiped out during the wars or whatever because there was a ton of Uchiha and those guys were their equals and somehow the Hyugas straight up supplanted the Senju as the village rulers (remember the Hyugas were supposed to be the strongest clan and the Byakugan was supposed to be stronger than the sharingan lol good times)...\n\nMaybe the bulk of the Senju got absorbed into the Hyugas",
                    "author": "Background_69_69",
                    "id": "iorpfah",
                    "parent_id": "t1_iorndud",
                    "score": 13,
                    "created_utc": 1663398469.0,
                    "replies": [
                        {
                            "body": "Yeah, that’s fair. I still would have liked more non-clan powerhouses in this show. It also reminds me of how we used to think Sakura could be a poison/illusion specialist before Tsunade seriously entered the narrative. What a time.\n\nThe headcanon makes the best sense out of the nonsensical writing of _why_ the Senju were wiped out during peace times, for sure. The other ninja clans of Naruto deserved better, really.\n\nI remember hoping for more Hyuuga world-building after meeting Neji in the Chuunin Exam and meeting Hinata and Neji again after the timeskip. I thought it would be a great way to really introduce making Hinata and Naruto friends - through learning about her clan and how Neji has found a way to thrive despite its shackles. I was, of course, devastatingly wrong. Kept waiting for other clans beside the Uchiha to get a turn, to no avail.\n\nThe Hyuuga’s seem like even bigger “blood purists” than the Uchiha’s give the air of, so I doubt it. I also doubt the Senju would be too chill about the Main/Side Branch thing, too. I think they became parts of civilian families for the most part, and some minor clans like the Ino-Shika-Chou. They seem chill enough to mingle with.",
                            "author": "Slight-Pound",
                            "id": "iorrnfp",
                            "parent_id": "t1_iorpfah",
                            "score": 6,
                            "created_utc": 1663400240.0,
                            "replies": [
                                {
                                    "body": "It would be hilarious if Sarada just awoke the Rinegan out of nowhere because of the blood lines and learning the techniques developed by Tsunade despite it taking hundreds of years and a ridiculously complicated plan  to awaken it once",
                                    "author": "Background_69_69",
                                    "id": "iorsq6q",
                                    "parent_id": "t1_iorrnfp",
                                    "score": 2,
                                    "created_utc": 1663401095.0,
                                    "replies": [
                                        {
                                            "body": "I’m honestly surprised something like that hasn’t happened yet.",
                                            "author": "Slight-Pound",
                                            "id": "iorsuxa",
                                            "parent_id": "t1_iorsq6q",
                                            "score": 1,
                                            "created_utc": 1663401204.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "No, I don't remember because the Byakugan was never said to be stronger than the Sharingan. In canon Kishimoto had Kakashi say that the Byakugan is only superior in sight AKA distance.",
                            "author": "Successful_Ad9924354",
                            "id": "ip1cg8t",
                            "parent_id": "t1_iorpfah",
                            "score": 1,
                            "created_utc": 1663572675.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "That’s the thing - I doubt _all_ of them joined clans (I think a lot of them joined regular/civilian families, too) and even then, no one joined _theirs?_ Absolutely no one? No one wanted to have their family be called Senju like they were? Sons are also often the ones to carry the family name, and their wives and kids carry that name as a result. That’s why I mentioned “only having daughters” in the first place. Because that clearly _wasn’t_ the case.\n\n_That’s_ what doesn’t make sense. They’re not the only clan in Konoha that might have intermingled with others, either - the Ino-Shika-Chou is a group I think would most likely do something similar, but _they_ are still around, and they seemed smaller than the Senju, so why aren’t the Senju? The Senju were just unnecessarily written out of the story and there isn’t a lot of reasonable excuses to make sense of it - or rather, there shouldn’t have to be.\n\nEdit: the last line",
            "author": "Slight-Pound",
            "id": "ioszdq1",
            "parent_id": "t1_iosxbeq",
            "score": 2,
            "created_utc": 1663427440.0,
            "replies": [
                {
                    "body": "It was never said that those with the name senju were a significant part of the alliance, just that they were powerful. The 3 sanin alone could take out thousands of rank and file ninja, it wouldn't take much to be powerful with good training.",
                    "author": "nizzy2k11",
                    "id": "iot6hnx",
                    "parent_id": "t1_ioszdq1",
                    "score": 1,
                    "created_utc": 1663430409.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I added a bit of an explanation above and it makes less sense for the Uzumaki, from an island nation, to be connected to the Senju when Minato, on the other hand, at least has Uchiha spite for becoming Hokage.",
            "author": "SinglePostOfAccount",
            "id": "ios61gv",
            "parent_id": "t1_ios5qfw",
            "score": 1,
            "created_utc": 1663411645.0,
            "replies": [
                {
                    "body": "And behold we have looped back to the point of the meme, the Uzumaki clan being poorly explained.",
                    "author": "Ambitious-Raise8107",
                    "id": "ios6615",
                    "parent_id": "t1_ios61gv",
                    "score": 4,
                    "created_utc": 1663411743.0,
                    "replies": [
                        {
                            "body": "Oh wait, nah the Uzumaki were distant relatives to the Senju. So I guess a bit of in breeding when Hashirama married an Uzumaki.\n\nAlso YUP, it was a singek panel saying that they were distantly related, so it wasn't like they were the off shoot of the Uzumakis but literal cousins in a sense.",
                            "author": "SinglePostOfAccount",
                            "id": "ios6dbw",
                            "parent_id": "t1_ios6615",
                            "score": 1,
                            "created_utc": 1663411896.0,
                            "replies": [
                                {
                                    "body": "Really reeks of Kishis's trademark \"lmao not gonna explain shit.\"\n\nHell, only reason we know that the Kaguya and Hyuga clans are cousin clans is due to a single text box if explaining Kaguya's bone abilities in the databook. He's never been overly good when it comes to tying together lore threads. Like how Madara's timeline of events makes no sense.",
                                    "author": "Ambitious-Raise8107",
                                    "id": "ios6pmj",
                                    "parent_id": "t1_ios6dbw",
                                    "score": 5,
                                    "created_utc": 1663412156.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Source: I made it up",
            "author": "elementnix",
            "id": "iorjea4",
            "parent_id": "t1_iorjded",
            "score": 73,
            "created_utc": 1663393972.0,
            "replies": []
        },
        {
            "body": "Hashirama did ordered them to marry other clans but nothing has been said about taking other family names",
            "author": "Background_69_69",
            "id": "iork2p1",
            "parent_id": "t1_iorjded",
            "score": 16,
            "created_utc": 1663394473.0,
            "replies": [
                {
                    "body": "Where's said that he did?",
                    "author": "frenin",
                    "id": "iorkm5k",
                    "parent_id": "t1_iork2p1",
                    "score": 15,
                    "created_utc": 1663394860.0,
                    "replies": [
                        {
                            "body": "Novels",
                            "author": "Background_69_69",
                            "id": "iorkw2k",
                            "parent_id": "t1_iorkm5k",
                            "score": 6,
                            "created_utc": 1663395062.0,
                            "replies": [
                                {
                                    "body": "I have read them and it certainly doesn't say so.\nIt does say that some Senju married out but not that it was a policy and never that it was so prominent that it literally made them die out.",
                                    "author": "frenin",
                                    "id": "iorl21l",
                                    "parent_id": "t1_iorkw2k",
                                    "score": 19,
                                    "created_utc": 1663395186.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "only 2 clans? every single living breathing thing has chakra. there are literal ninja dogs and turtles. these two clans were just so much stronger than most other clans that most other clans didn’t bother to fight them. but you are right senju did spread around their genes, like uzumaki and sarutobi",
            "author": "SmegmaLord420",
            "id": "iorrdkd",
            "parent_id": "t1_iork16c",
            "score": 12,
            "created_utc": 1663400024.0,
            "replies": [
                {
                    "body": "Yes, I mistook chakra with Ninshu.",
                    "author": "Rohan-kun",
                    "id": "ioryn5b",
                    "parent_id": "t1_iorrdkd",
                    "score": 3,
                    "created_utc": 1663405902.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "The thing is that Tsunade's techniques are borderline senju exclusive because of the insane amounts of chakra and also ridiculous physical strength is a Senju trait. \n\nI think the head canon makes way more sense than the idea that the senju got wiped out during the wars or whatever because there was a ton of Uchiha and those guys were their equals and somehow the Hyugas straight up supplanted the Senju as the village rulers (remember the Hyugas were supposed to be the strongest clan and the Byakugan was supposed to be stronger than the sharingan lol good times)...\n\nMaybe the bulk of the Senju got absorbed into the Hyugas",
            "author": "Background_69_69",
            "id": "iorpfah",
            "parent_id": "t1_iorndud",
            "score": 13,
            "created_utc": 1663398469.0,
            "replies": [
                {
                    "body": "Yeah, that’s fair. I still would have liked more non-clan powerhouses in this show. It also reminds me of how we used to think Sakura could be a poison/illusion specialist before Tsunade seriously entered the narrative. What a time.\n\nThe headcanon makes the best sense out of the nonsensical writing of _why_ the Senju were wiped out during peace times, for sure. The other ninja clans of Naruto deserved better, really.\n\nI remember hoping for more Hyuuga world-building after meeting Neji in the Chuunin Exam and meeting Hinata and Neji again after the timeskip. I thought it would be a great way to really introduce making Hinata and Naruto friends - through learning about her clan and how Neji has found a way to thrive despite its shackles. I was, of course, devastatingly wrong. Kept waiting for other clans beside the Uchiha to get a turn, to no avail.\n\nThe Hyuuga’s seem like even bigger “blood purists” than the Uchiha’s give the air of, so I doubt it. I also doubt the Senju would be too chill about the Main/Side Branch thing, too. I think they became parts of civilian families for the most part, and some minor clans like the Ino-Shika-Chou. They seem chill enough to mingle with.",
                    "author": "Slight-Pound",
                    "id": "iorrnfp",
                    "parent_id": "t1_iorpfah",
                    "score": 6,
                    "created_utc": 1663400240.0,
                    "replies": [
                        {
                            "body": "It would be hilarious if Sarada just awoke the Rinegan out of nowhere because of the blood lines and learning the techniques developed by Tsunade despite it taking hundreds of years and a ridiculously complicated plan  to awaken it once",
                            "author": "Background_69_69",
                            "id": "iorsq6q",
                            "parent_id": "t1_iorrnfp",
                            "score": 2,
                            "created_utc": 1663401095.0,
                            "replies": [
                                {
                                    "body": "I’m honestly surprised something like that hasn’t happened yet.",
                                    "author": "Slight-Pound",
                                    "id": "iorsuxa",
                                    "parent_id": "t1_iorsq6q",
                                    "score": 1,
                                    "created_utc": 1663401204.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "No, I don't remember because the Byakugan was never said to be stronger than the Sharingan. In canon Kishimoto had Kakashi say that the Byakugan is only superior in sight AKA distance.",
                    "author": "Successful_Ad9924354",
                    "id": "ip1cg8t",
                    "parent_id": "t1_iorpfah",
                    "score": 1,
                    "created_utc": 1663572675.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "It was never said that those with the name senju were a significant part of the alliance, just that they were powerful. The 3 sanin alone could take out thousands of rank and file ninja, it wouldn't take much to be powerful with good training.",
            "author": "nizzy2k11",
            "id": "iot6hnx",
            "parent_id": "t1_ioszdq1",
            "score": 1,
            "created_utc": 1663430409.0,
            "replies": []
        },
        {
            "body": "And behold we have looped back to the point of the meme, the Uzumaki clan being poorly explained.",
            "author": "Ambitious-Raise8107",
            "id": "ios6615",
            "parent_id": "t1_ios61gv",
            "score": 4,
            "created_utc": 1663411743.0,
            "replies": [
                {
                    "body": "Oh wait, nah the Uzumaki were distant relatives to the Senju. So I guess a bit of in breeding when Hashirama married an Uzumaki.\n\nAlso YUP, it was a singek panel saying that they were distantly related, so it wasn't like they were the off shoot of the Uzumakis but literal cousins in a sense.",
                    "author": "SinglePostOfAccount",
                    "id": "ios6dbw",
                    "parent_id": "t1_ios6615",
                    "score": 1,
                    "created_utc": 1663411896.0,
                    "replies": [
                        {
                            "body": "Really reeks of Kishis's trademark \"lmao not gonna explain shit.\"\n\nHell, only reason we know that the Kaguya and Hyuga clans are cousin clans is due to a single text box if explaining Kaguya's bone abilities in the databook. He's never been overly good when it comes to tying together lore threads. Like how Madara's timeline of events makes no sense.",
                            "author": "Ambitious-Raise8107",
                            "id": "ios6pmj",
                            "parent_id": "t1_ios6dbw",
                            "score": 5,
                            "created_utc": 1663412156.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Where's said that he did?",
            "author": "frenin",
            "id": "iorkm5k",
            "parent_id": "t1_iork2p1",
            "score": 15,
            "created_utc": 1663394860.0,
            "replies": [
                {
                    "body": "Novels",
                    "author": "Background_69_69",
                    "id": "iorkw2k",
                    "parent_id": "t1_iorkm5k",
                    "score": 6,
                    "created_utc": 1663395062.0,
                    "replies": [
                        {
                            "body": "I have read them and it certainly doesn't say so.\nIt does say that some Senju married out but not that it was a policy and never that it was so prominent that it literally made them die out.",
                            "author": "frenin",
                            "id": "iorl21l",
                            "parent_id": "t1_iorkw2k",
                            "score": 19,
                            "created_utc": 1663395186.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Yes, I mistook chakra with Ninshu.",
            "author": "Rohan-kun",
            "id": "ioryn5b",
            "parent_id": "t1_iorrdkd",
            "score": 3,
            "created_utc": 1663405902.0,
            "replies": []
        },
        {
            "body": "Yeah, that’s fair. I still would have liked more non-clan powerhouses in this show. It also reminds me of how we used to think Sakura could be a poison/illusion specialist before Tsunade seriously entered the narrative. What a time.\n\nThe headcanon makes the best sense out of the nonsensical writing of _why_ the Senju were wiped out during peace times, for sure. The other ninja clans of Naruto deserved better, really.\n\nI remember hoping for more Hyuuga world-building after meeting Neji in the Chuunin Exam and meeting Hinata and Neji again after the timeskip. I thought it would be a great way to really introduce making Hinata and Naruto friends - through learning about her clan and how Neji has found a way to thrive despite its shackles. I was, of course, devastatingly wrong. Kept waiting for other clans beside the Uchiha to get a turn, to no avail.\n\nThe Hyuuga’s seem like even bigger “blood purists” than the Uchiha’s give the air of, so I doubt it. I also doubt the Senju would be too chill about the Main/Side Branch thing, too. I think they became parts of civilian families for the most part, and some minor clans like the Ino-Shika-Chou. They seem chill enough to mingle with.",
            "author": "Slight-Pound",
            "id": "iorrnfp",
            "parent_id": "t1_iorpfah",
            "score": 6,
            "created_utc": 1663400240.0,
            "replies": [
                {
                    "body": "It would be hilarious if Sarada just awoke the Rinegan out of nowhere because of the blood lines and learning the techniques developed by Tsunade despite it taking hundreds of years and a ridiculously complicated plan  to awaken it once",
                    "author": "Background_69_69",
                    "id": "iorsq6q",
                    "parent_id": "t1_iorrnfp",
                    "score": 2,
                    "created_utc": 1663401095.0,
                    "replies": [
                        {
                            "body": "I’m honestly surprised something like that hasn’t happened yet.",
                            "author": "Slight-Pound",
                            "id": "iorsuxa",
                            "parent_id": "t1_iorsq6q",
                            "score": 1,
                            "created_utc": 1663401204.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "No, I don't remember because the Byakugan was never said to be stronger than the Sharingan. In canon Kishimoto had Kakashi say that the Byakugan is only superior in sight AKA distance.",
            "author": "Successful_Ad9924354",
            "id": "ip1cg8t",
            "parent_id": "t1_iorpfah",
            "score": 1,
            "created_utc": 1663572675.0,
            "replies": []
        },
        {
            "body": "Oh wait, nah the Uzumaki were distant relatives to the Senju. So I guess a bit of in breeding when Hashirama married an Uzumaki.\n\nAlso YUP, it was a singek panel saying that they were distantly related, so it wasn't like they were the off shoot of the Uzumakis but literal cousins in a sense.",
            "author": "SinglePostOfAccount",
            "id": "ios6dbw",
            "parent_id": "t1_ios6615",
            "score": 1,
            "created_utc": 1663411896.0,
            "replies": [
                {
                    "body": "Really reeks of Kishis's trademark \"lmao not gonna explain shit.\"\n\nHell, only reason we know that the Kaguya and Hyuga clans are cousin clans is due to a single text box if explaining Kaguya's bone abilities in the databook. He's never been overly good when it comes to tying together lore threads. Like how Madara's timeline of events makes no sense.",
                    "author": "Ambitious-Raise8107",
                    "id": "ios6pmj",
                    "parent_id": "t1_ios6dbw",
                    "score": 5,
                    "created_utc": 1663412156.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Novels",
            "author": "Background_69_69",
            "id": "iorkw2k",
            "parent_id": "t1_iorkm5k",
            "score": 6,
            "created_utc": 1663395062.0,
            "replies": [
                {
                    "body": "I have read them and it certainly doesn't say so.\nIt does say that some Senju married out but not that it was a policy and never that it was so prominent that it literally made them die out.",
                    "author": "frenin",
                    "id": "iorl21l",
                    "parent_id": "t1_iorkw2k",
                    "score": 19,
                    "created_utc": 1663395186.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "It would be hilarious if Sarada just awoke the Rinegan out of nowhere because of the blood lines and learning the techniques developed by Tsunade despite it taking hundreds of years and a ridiculously complicated plan  to awaken it once",
            "author": "Background_69_69",
            "id": "iorsq6q",
            "parent_id": "t1_iorrnfp",
            "score": 2,
            "created_utc": 1663401095.0,
            "replies": [
                {
                    "body": "I’m honestly surprised something like that hasn’t happened yet.",
                    "author": "Slight-Pound",
                    "id": "iorsuxa",
                    "parent_id": "t1_iorsq6q",
                    "score": 1,
                    "created_utc": 1663401204.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Really reeks of Kishis's trademark \"lmao not gonna explain shit.\"\n\nHell, only reason we know that the Kaguya and Hyuga clans are cousin clans is due to a single text box if explaining Kaguya's bone abilities in the databook. He's never been overly good when it comes to tying together lore threads. Like how Madara's timeline of events makes no sense.",
            "author": "Ambitious-Raise8107",
            "id": "ios6pmj",
            "parent_id": "t1_ios6dbw",
            "score": 5,
            "created_utc": 1663412156.0,
            "replies": []
        },
        {
            "body": "I have read them and it certainly doesn't say so.\nIt does say that some Senju married out but not that it was a policy and never that it was so prominent that it literally made them die out.",
            "author": "frenin",
            "id": "iorl21l",
            "parent_id": "t1_iorkw2k",
            "score": 19,
            "created_utc": 1663395186.0,
            "replies": []
        },
        {
            "body": "I’m honestly surprised something like that hasn’t happened yet.",
            "author": "Slight-Pound",
            "id": "iorsuxa",
            "parent_id": "t1_iorsq6q",
            "score": 1,
            "created_utc": 1663401204.0,
            "replies": []
        }
    ]
}