{
    "title": "SB/SD 105: PPM / Allowance / Benjis / Digital Money / Financial Support",
    "post_id": "lupi2v",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/lupi2v/sbsd_105_ppm_allowance_benjis_digital_money/",
    "author": "ExExpectations",
    "body": "Being a veteran SB in the sugar dating community (on and off for the last 9 years), I get a lot of DMs asking me various questions, ranging from Can you help with my question on xyz to Let's meet because I really want to take you to Paris and then Bali when covid is over (okay, I've not gotten the latter DM, yet).\n\nOne of the prevalent questions is money, and everything around it. NOTE, I am in the US, and this knowledge is US-centric. Apps and methods may be different for you if you're outside of the US. (Also note, I'm not perfect, and may be wrong in some of my assertions, do chime in with *verifiable links* if you find an inaccuracy)\n\n# On transferring/receiving\n\n\\- **CHC. Cold Hard Cash is the best IMO.** No traceability. Not reversible or disputable compared to digital transferring.\n\n**- Digital payment methods**: Some people want to stick with cash all the time. In other SRs, as you gain trust between each other, digital payment makes things so much easier. There's PayPal, Venmo, CashApp, Apple Pay / Google Pay, Zelle, and wire transfer. *And, who doesn't like to send/receive a surprise gift once in a while! Easily done via digital platforms!*\n\nI personally have received Benjis in all 6 of these digital platforms from long term SDs. I go with whatever format each individual SD is comfortable using.\n\nWorth noting, there's a daily/weekly/monthly limit on the SENDER'S end, depending on the platform (PayPal limit is 10k per transaction, Venmo it's 5k per week, etc). As far as I know, there's no limit on the receiver's end on how much can be received (I noted some SBs have multiple SDs at a time).\n\nAs with all things, use your common sense. Don't be a schmuck and put the note/message as anything resembling something fishy or odd. One of my SDs play up the note/message with funny things like \"thanks for fixing my kitchen\"\n\nMost importantly, DO NOT SHARE YOUR LOGIN ID OR PASSWORD WITH ANYONE for any of your digital payment accounts or bank accounts. It may seem like a silly and redundant reminder to a lot of people, but the more naive and lurking ones needs to read and understand this to avoid scams. (Also, read the scam-sticky post on this forum)\n\n1. **PayPal.** As an SB, I would NOT recommend accepting funds via PayPal until you've established a lot of trust with someone, as it's often touted as not \"sex work\" friendly (sugar dating is not SW, but the lines are blurred even in the sugar community itself, but especially so in the eyes of general society). It should be sent as \"friends/family\" and there should not be a fee deducted by the platform. Two of my (previous) SDs preferred using this method. Make sure they don't put any weird notes/messages when they send it via PayPal. Use ambiguous language. One thing to note is, I also use this PayPal account as payment when shopping online. Some sites accept PayPal payment. So there's incoming and outgoing money. I've had this account for years and use an Alias name for anonymity. I'm not sure if new accounts can have Alias names or not.\n2. **Venmo**. It's owned by PayPal. You can only have ONE Venmo account. I would suggest using your burner number to sign up, and if you've already signed up with your real phone number, that's fine, just change/update your Venmo name ID to reflect some anonymity. It can be changed after the fact. DO NOT allow Venmo to access your \"Contact list\" and DO NOT have any Friends on your Friends List. The last thing you'd want is have some (disgruntled) man contact your friends/families...!\n3. **CashApp.** Owned by Square. Your outward-name and cashtag can be anonymous. Set it that way. If I recall, Square does require you to verify your real name and ID - your sender will not be able to see that info.\n4. **Apple Pay/Google Pay** Sent via an iPhone number. (I don't know much about google pay, I assume it's very similar?)\n5. **Zelle.** Sender will need an email or phone number to send it to. I \\*think\\* the sender will see the receiver's name once it's accepted/linked to the receivers bank. I'm not 100% certain.\n6. **Wire Transfer.** Sender will need the receiver's full name, as well as the bank routing, account number, and address on the bank account. This last one requires a hell lot of trust on the receivers' end. Do not use this lightly or with someone you hardly know or new.\n\n# On saving/spending\n\n* Spend your cash in person in whatever you can, groceries/gas, doctor's office visits, etc. And then just deposit/invest the rest as you get them.\n* With these digital payment formats, you can request PayPal / Venmo / CashApp to mail you a physical debit card. I believe PayPal's is also a credit card whereas the other two are just debit cards.\n* At times, I use cash to buy gift cards at the grocery store and then transfer those gift cards into my online shopping accounts. Amazon is a great one for that since I do a lot of shopping on amazon. Or whatever other site you use often. There's also the option of buying a prepaid Visa card but that has a fee to it, so being the mindful spender that I am, I choose options that don't require fees.\n\n# On Taxes\n\n**Sugar dating allowance and presents are gifts and are not taxable, regardless of amount received per time or per year. SBs do not pay taxes on the gifts or need to include in in their income tax return.**\n\nPlease note, this is only applicable in the US (I do not know tax laws and regulations in other countries, esp ones where SW is legalized)\n\nLots of people on here like to argue about this point, but after much research and reading, this is what I've found. SBs, do feel free to pay taxes on the gifts if that's what you want to do.\n\nHere's the down low.\n\n* It is illegal to ***structure your deposits*** to avoid the \"reporting\" or \"flagging\" by your bank. It is not illegal to deposit cash gifts. And receiving cash gifts is not illegal, in any amount.\n* The gift giver/SD \\*should\\* report it on his/her tax return if the amount given to any one specific individual exceeds 15k per calendar year. Anything under that, he's not obligated to. And, many SDs don't report it even if it's over the 15k mark - it is 100% the SDs' duty and it's up to him.\n* SDs do not have to pay taxes on it. He just has to REPORT it / write it on his tax return. All he needs is SB's full name.\n* Gift givers do not pay taxes until he/she has reached a lifetime gifting amount of **11.7 MILLION USD (for year 2021).** Any amount AFTER that would be taxable. That's right. You are not obligated or bound to pay any taxes on gift giving until that amount has been reached.\n\nLastly, I've done extensive research and I have zero intention to argue with anyone re the tax section. All comments disputing that part will be ignored. *I am not a tax advisor. Nor licensed.🙄Take all things you read online with a grain of salt.*\n\nMay the sugar gods be generous to those who are generous. Have fun!",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/lupi2v/sbsd_105_ppm_allowance_benjis_digital_money/",
    "score": 122,
    "upvote_ratio": 0.92,
    "created_utc": 1614543852.0,
    "num_comments": 77,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "Extra upvote for clearly stating you are talking from US point of view ♥️\n\nI get a small heart attack every time I see \"you as a receiver don't need to worry about taxes\" advice given to SBs, without being sure they are US based. All the countries I've been dealing with within EU charge gift tax even for ridiculously small monetary amounts, and in all countries the person subject to tax is the receiver.. You can play around it of course if you know what you're doing, but the principal rule is that you as a receiver need to report and pay taxes on any gifts received. The chances of running into problems is quite minimal even if depositing or receiving bank transfers, but there is a risk, so either know your local rules, or go with cash never deposited into your acc.",
            "author": "EstrellaDulce",
            "id": "gp852v6",
            "parent_id": "t3_lupi2v",
            "score": 25,
            "created_utc": 1614546129.0,
            "replies": [
                {
                    "body": "Not on the uk.   There are no limits on how much you can receive as a gift.",
                    "author": "brit-sd",
                    "id": "gp96far",
                    "parent_id": "t1_gp852v6",
                    "score": 3,
                    "created_utc": 1614563653.0,
                    "replies": [
                        {
                            "body": "\"As it stands, the gift tax rules for 2021 remain the same as in recent years, with a £3,000 annual exemption, £250 smaller gift giving allowance, and the seven-year clawback rule.\"\n\nAs said, no problem as long as you know your local regulations, but in EU the receiver is pretty much always the one legally obliged to report and pay.",
                            "author": "EstrellaDulce",
                            "id": "gp970xh",
                            "parent_id": "t1_gp96far",
                            "score": 1,
                            "created_utc": 1614563993.0,
                            "replies": [
                                {
                                    "body": "You are confusing rules about income and inheritance.  There is no limit on gifts for income tax in the uk.  What you refer is only due to inheritance tax when the gifter dies  If tax is due it comes from the estate not the individual.   There is a small risk that if the person dies and there is no money left in the estate then a gift can be clawed back but this is only likely for very large sums and the amount tapers over the 7years. \n\nIn any case, gifts made out of excess income (income above what the gifter needs for day to day living) are exempt from even inheritance tax.  \n\nSo in the context of a person giving money in a relationship, unless it was a large sum that was not excess income and the person dies soon afterwards, it is completely free of all taxes.  \n\nIn pretty well most cases gifts like sugar are from excess income and therefore exempt from inheritance tax.    \n\nAnyone getting money from me in the uk will never ever need to pay tax of any type.",
                                    "author": "brit-sd",
                                    "id": "gpa244t",
                                    "parent_id": "t1_gp970xh",
                                    "score": 5,
                                    "created_utc": 1614585287.0,
                                    "replies": [
                                        {
                                            "body": "Ah, it's true. You have that funny rule of surplus income being ok to give away tax-free.\n\nBut then, I think for example Ireland limits tax-free gifts to something like 15-20k lifetime, no matter who is the gifter. Germany has also limit of 20k, though I think it's only for 10yrs and per gifter. Sweden does not have gift tax at all nowadays, Finland limits to 5k during 3 years per gifter, Spain and France have nothing tax-free, taxing starts basically from 0.\n\nThe point is that you need to know your local rules. Still haven't seen a country in Europe which would tax the payer like in US. In all countries it is the receiver who pays taxes, and it is important for European SBs to understand that. We mostly have no problem giving out our bank details, which seems to be huge red in the States. However, depending on your country, you might not want money arriving to your bank acc, because it will be noted and you will end up paying taxes.",
                                            "author": "EstrellaDulce",
                                            "id": "gpamzvu",
                                            "parent_id": "t1_gpa244t",
                                            "score": 2,
                                            "created_utc": 1614604067.0,
                                            "replies": [
                                                {
                                                    "body": "So interesting! \n\nSo how do you typically receive your allowance/support? Is it directly deposited into your bank account or is it cash, or digital? \n\nIf it’s deposited into a bank, is it automatically counted as gift?",
                                                    "author": "ExExpectations",
                                                    "id": "gpff7ob",
                                                    "parent_id": "t1_gpamzvu",
                                                    "score": 1,
                                                    "created_utc": 1614701834.0,
                                                    "replies": [
                                                        {
                                                            "body": "Cash. Prefer cash any time so I can deal with it in a way that suits me best.. I do transfers as well, but it's really a special case. Haven't gotten into problems so far, even though they are in USD.. There would jump in the international agreements between countries. Because he is liable to tax as US gifter, in theory the obligation should not be duplicated at my end. I also have him as a resident in my address (signed in notary for his permanent visa), so I could claim it's not a gift, he's only paying his part of the running costs as my life-partner, which would easily be supported by the fact that he always transfers me money 2 days before my rent is due.\n\nI think in all countries, gifts are supposed to be voluntarily reported by the receiver, which obviously never happens for smaller amounts. In reality, you are not going to be checked by anyone as long as one-time transfers are not too big. But well, the risk is there, and really depends on the country.\n\nI'm accountant, so I know my risks and anything I do, I know I will be fully responsible if \"getting caught\". There are things I do voluntarily report, like my tiny capital gains. Fingers crossed it's enough to keep tax office happy in future too :D",
                                                            "author": "EstrellaDulce",
                                                            "id": "gpks0ai",
                                                            "parent_id": "t1_gpff7ob",
                                                            "score": 2,
                                                            "created_utc": 1614804618.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Aaaaannnndddd bookmarked!\n\nThe 'thanks for fixing my kitchen' had me laughing...I was like, 'in return for cleaning my pipes *waggles eyebrows*'...🤣🤣🤣",
            "author": "ShaArt5",
            "id": "gp8k6a5",
            "parent_id": "t3_lupi2v",
            "score": 10,
            "created_utc": 1614551974.0,
            "replies": [
                {
                    "body": "Ahh. The list of fun notes were endless 😂I was with him for 4.5 years (with some breaks).",
                    "author": "ExExpectations",
                    "id": "gp8mh3h",
                    "parent_id": "t1_gp8k6a5",
                    "score": 4,
                    "created_utc": 1614553024.0,
                    "replies": [
                        {
                            "body": "My kind of SD...🥰😁",
                            "author": "ShaArt5",
                            "id": "gp8mrvx",
                            "parent_id": "t1_gp8mh3h",
                            "score": 3,
                            "created_utc": 1614553169.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "> Gift givers do not pay taxes until he/she has reached a gifting amount of 11.7 MILLION USD\n\nNote that this changes from time to time (it always goes up, never down).",
            "author": "Y_4Z44",
            "id": "gp80hpn",
            "parent_id": "t3_lupi2v",
            "score": 8,
            "created_utc": 1614544702.0,
            "replies": [
                {
                    "body": "Oh shit, I'm at $11.6m YTD.",
                    "author": "whatever-tata",
                    "id": "gp817np",
                    "parent_id": "t1_gp80hpn",
                    "score": 2,
                    "created_utc": 1614544927.0,
                    "replies": [
                        {
                            "body": "That's lifetime, not per year.",
                            "author": "Y_4Z44",
                            "id": "gp81dop",
                            "parent_id": "t1_gp817np",
                            "score": 1,
                            "created_utc": 1614544977.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "gp9izr6",
                    "parent_id": "t1_gp80hpn",
                    "score": -1,
                    "created_utc": 1614570888.0,
                    "replies": [
                        {
                            "body": "> The 11.7 million is the estate tax exemption\n\nNot sure what your point is here. The estate tax is a tax on property transferred *after someone is deceased*. The \"gift tax\" is a tax levied on gifts *while someone is alive*. They are two separate and distinct things. We're not talking about estate taxes here.",
                            "author": "Y_4Z44",
                            "id": "gp9tnku",
                            "parent_id": "t1_gp9izr6",
                            "score": 4,
                            "created_utc": 1614578149.0,
                            "replies": [
                                {
                                    "body": "If you are in a situation where the lifetime exclusion is going to apply to your estate, I hope you can improve your understanding of how this works.\n\nu/beach_sd has been exactly on point. The estate tax exemption *is* the lifetime gift tax exemption. In the eyes of the IRS, your remaining estate when you pass is a giant gift to your heir (to be taxed accordingly).",
                                    "author": "SD_in_training",
                                    "id": "gpfw8o3",
                                    "parent_id": "t1_gp9tnku",
                                    "score": -1,
                                    "created_utc": 1614709272.0,
                                    "replies": [
                                        {
                                            "body": "And that is *wholly irrelevant* to the subject under discussion in this thread. The post was about living people in SRs, not what happens to an SD's estate when he passes. Thus my questioning about his point. I'm not arguing he's incorrect, but that whatever \"point\" he thinks he's making is entirely irrelevant to the subject of the OP's post.",
                                            "author": "Y_4Z44",
                                            "id": "gpfwsax",
                                            "parent_id": "t1_gpfw8o3",
                                            "score": 2,
                                            "created_utc": 1614709507.0,
                                            "replies": [
                                                {
                                                    "body": "I would expect that real live SDs in SRs currently would be interested in an accurate understanding of how giving gifts may impact what they leave to their heirs.\n\nSeems relevant to me, but we can disagree.",
                                                    "author": "SD_in_training",
                                                    "id": "gpfyg9f",
                                                    "parent_id": "t1_gpfwsax",
                                                    "score": 0,
                                                    "created_utc": 1614710221.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Very well compiled and great advice all around! Good work!",
            "author": "clutchcitysd",
            "id": "gp85l2v",
            "parent_id": "t3_lupi2v",
            "score": 5,
            "created_utc": 1614546287.0,
            "replies": []
        },
        {
            "body": "Great post. \n\nIn regards to the Zelle: Max of $2500/24 hours usually, first and last name plus phone number and/or email required, and is usually instant deposit (but can take up to 3 business days) plus cannot be cancelled once initiated (auto deposits into your account) 😋",
            "author": "hereyougococo",
            "id": "gp81bmx",
            "parent_id": "t3_lupi2v",
            "score": 8,
            "created_utc": 1614544960.0,
            "replies": [
                {
                    "body": "Actually, more can be transferred and received via zelle, I think up to $9999. And it’s usually instant deposit.",
                    "author": null,
                    "id": "gp8bhzu",
                    "parent_id": "t1_gp81bmx",
                    "score": 3,
                    "created_utc": 1614548131.0,
                    "replies": [
                        {
                            "body": "zelle varies depending on the bank you use",
                            "author": "sucRoseToTheOccasion",
                            "id": "gp95tvz",
                            "parent_id": "t1_gp8bhzu",
                            "score": 3,
                            "created_utc": 1614563318.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Sweet!",
            "author": null,
            "id": "gp811bh",
            "parent_id": "t3_lupi2v",
            "score": 4,
            "created_utc": 1614544872.0,
            "replies": []
        },
        {
            "body": "Thank you for taking the time to do that.  Especially how it is super comprehensive.  🤓",
            "author": "KittenReigns",
            "id": "gp84jci",
            "parent_id": "t3_lupi2v",
            "score": 4,
            "created_utc": 1614545962.0,
            "replies": []
        },
        {
            "body": "Well said!",
            "author": "mraspencer",
            "id": "gp8fyok",
            "parent_id": "t3_lupi2v",
            "score": 4,
            "created_utc": 1614550055.0,
            "replies": []
        },
        {
            "body": "I'm adding bitcoin/cryptocurrency to the conversation. \n\nI did a mix of cash + crypto with one SB. Worked out pretty well for her.\n\nWhy might bitcoin/crypto be a good option:\n\n1. Transaction finality - bitcoin/ethereum transactions are not reversible\n2.  Can promote savings/investment mentality - just holding btc/eth. you can also tap into the world of decentralized finance and access more complex investment strategies (yield generation, loans, options, etc...)\n3. Exposure to new asset class - useful to learn about this stuff imo, it's here to stay\n4. Easy to convert into US dollars (or your local currency) by linking your crypto wallet to a bank account\n\nObv helps if the SD already knows about crypto.",
            "author": "SwimmingInSugar",
            "id": "gpbaw48",
            "parent_id": "t3_lupi2v",
            "score": 3,
            "created_utc": 1614616471.0,
            "replies": [
                {
                    "body": "Oh 😍how I love thee. Do you have a brother? A twin? A replica perhaps? 😊",
                    "author": "ExExpectations",
                    "id": "gpbc7db",
                    "parent_id": "t1_gpbaw48",
                    "score": 3,
                    "created_utc": 1614617057.0,
                    "replies": [
                        {
                            "body": "Aww.. 😊",
                            "author": "SwimmingInSugar",
                            "id": "gpeyt1w",
                            "parent_id": "t1_gpbc7db",
                            "score": 2,
                            "created_utc": 1614694089.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "You are absolutely wonderful, thanks so much for sharing your knowledge!",
            "author": "babysugar69",
            "id": "gp8nnav",
            "parent_id": "t3_lupi2v",
            "score": 3,
            "created_utc": 1614553574.0,
            "replies": []
        },
        {
            "body": "So detailed and informative. Much appreciated. Thanks for taking the time to make this and share with us 💖",
            "author": "koalandi",
            "id": "gp8qsci",
            "parent_id": "t3_lupi2v",
            "score": 3,
            "created_utc": 1614555053.0,
            "replies": []
        },
        {
            "body": "Google Pay can be attached to any Google email and used that way, meaning it can be fairly anonymous if you set up an email specifically for this purpose. It has much higher limits. As noted, the danger with apps is always reversal, and PayPal and Venmo are *not* SW friendly and *will permanently ban your account without warning* if you’re presumed to be utilizing them for SW.\n\nVenmo and Cashapp can both be used as full-blown bank accounts, now, including the distribution of a free debit card. I use each for different reasons. You can even have a paycheck/tax return direct deposited into either! \n\nExcellent post.",
            "author": "FoxyFreckles1989",
            "id": "gp8t5c8",
            "parent_id": "t3_lupi2v",
            "score": 3,
            "created_utc": 1614556230.0,
            "replies": []
        },
        {
            "body": "Also important to know that none of your money you have stored on apps like Venmo is backed up / insured. Meaning if the app crashes, your money is gone. It’s safer to transfer it out.",
            "author": "unabridgedglory",
            "id": "gpa0i4f",
            "parent_id": "t3_lupi2v",
            "score": 3,
            "created_utc": 1614583828.0,
            "replies": [
                {
                    "body": "These digital apps are here to stay. And if a company dissolve, they are required to provide x amount of time for users to take action regarding their data/money/etc before they can legally shut down.",
                    "author": "ExExpectations",
                    "id": "gpbd7lu",
                    "parent_id": "t1_gpa0i4f",
                    "score": 1,
                    "created_utc": 1614617510.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "tax info is correct.",
            "author": "bluelunarmonkey",
            "id": "gpb4mcv",
            "parent_id": "t3_lupi2v",
            "score": 3,
            "created_utc": 1614613561.0,
            "replies": [
                {
                    "body": "**correct, tax info is.** \n\n*-bluelunarmonkey*\n\n***\n\n\n\n^(Commands: 'opt out', 'delete')",
                    "author": "IamYodaBot",
                    "id": "gpb4ops",
                    "parent_id": "t1_gpb4mcv",
                    "score": 1,
                    "created_utc": 1614613593.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Some info/a correction about PayPal: the debit card can only be used to spend the money currently in your account balance. There is a separate PayPal Credit service, that requires a separate application, and can only be used online via retailers who accept PayPal or to send money to others. The physical card cannot be used to access the available PayPal Credit funds.",
            "author": "isglitteracolor",
            "id": "gpc9aki",
            "parent_id": "t3_lupi2v",
            "score": 3,
            "created_utc": 1614631635.0,
            "replies": []
        },
        {
            "body": "While she may not want to consider the potential taxability of the financial benefits of an arrangement the definition of a gift  and the definition of a sugar arrangement create a gray area.  Some major past cases resulted in rulings favorable to the SB but those involved large sums of money and things of value and predated the Phoenix like rise of internet initiated arrangements. \n\nAlso an additional vehicle for the arrangement with well established relationship is a debit card on a separate account created by the SD using his bank.  The SB has the card and can use it to pay or obtain cash.  \n\nWhile, worst case , the IRS might in some case decide to pursue the SB for some portion of the allowance it is good to remember that in states like California the chances are that a married SD is delivering community property to you and wifey has a 50% interest in that cash or property.  Donald Sterling's wife recovered $2.6 mil from his SB who ironically initiated the publicity that killed his marriage and forced his sale of the LA Clippers",
            "author": "pinotandsugar",
            "id": "gp87i33",
            "parent_id": "t3_lupi2v",
            "score": 5,
            "created_utc": 1614546876.0,
            "replies": []
        },
        {
            "body": "Man what was the username for the woman who kept claiming it was totally legal to structure deposits to avoid flagging suspicion?",
            "author": "Impolite69Pluto",
            "id": "gp8tves",
            "parent_id": "t3_lupi2v",
            "score": 2,
            "created_utc": 1614556613.0,
            "replies": []
        },
        {
            "body": "I don't have any links, but I, for one, have at least two venmo accounts. I downloaded zelle after a time waster told me to, and he never sent anything. I didn't like that I couldn't use any name that I wanted. I get that it's used more formally than venmo and cash app, but I wouldn't start using that one with an SD until I was comfortable with him knowing that much about me. Somethin about it just felt intrusive.",
            "author": "CodiKo",
            "id": "gp9a2u4",
            "parent_id": "t3_lupi2v",
            "score": 2,
            "created_utc": 1614565704.0,
            "replies": [
                {
                    "body": "That’s really interesting! \nI was trying to help someone figure out if it’s possible to have a second venmo account, but I couldn’t find any info!! \nDo you have an iPhone? Or Android? Is it on two separate phones? \nCan I DM you?",
                    "author": "ExExpectations",
                    "id": "gp9bw2v",
                    "parent_id": "t1_gp9a2u4",
                    "score": 2,
                    "created_utc": 1614566720.0,
                    "replies": [
                        {
                            "body": "I have an Android. And sure! I think I'm using two separate email accounts. I'll check in the meantime.\nUPDATE: That was faster than I thought. :) Yeah, I'm using two separate email accounts. One for friends and family, one for randos. Everything's private on the latter.",
                            "author": "CodiKo",
                            "id": "gp9c1k9",
                            "parent_id": "t1_gp9bw2v",
                            "score": 2,
                            "created_utc": 1614566808.0,
                            "replies": [
                                {
                                    "body": "That is so cool! So you have access to both of these Venmo accounts on one phone? Do you just login or out between the two to access them? Just trying to get an understanding as I’d like to set up a second one as well!",
                                    "author": "sizzlepopsun",
                                    "id": "gpfjvft",
                                    "parent_id": "t1_gp9c1k9",
                                    "score": 2,
                                    "created_utc": 1614703888.0,
                                    "replies": [
                                        {
                                            "body": "Yeah, I can't be logged into both at the same time. They're under different email addresses. I have 4 different email addresses that I use on a ~daily basis, so I had that option at my disposal. I have three different cash app accounts. Haha",
                                            "author": "CodiKo",
                                            "id": "gpfm6ov",
                                            "parent_id": "t1_gpfjvft",
                                            "score": 2,
                                            "created_utc": 1614704894.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": ">Gift givers do not pay taxes until he/she has reached a lifetime gifting amount of **11.7 MILLION USD (for year 2021).** Any amount AFTER that would be taxable. That's right. You are not obligated or bound to pay any taxes on gift giving until that amount has been reached.\n\nThis isn't really a great summary of how gift giving impacts estate tax implications, however I am confident that any SDs who might be in this situation won't be looking here on Reddit for tax advice.\n\nRest of the summary on taxes is solid! Thanks for writing this up.",
            "author": "SD_in_training",
            "id": "gp9hjgp",
            "parent_id": "t3_lupi2v",
            "score": 2,
            "created_utc": 1614570006.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gp9ijg5",
            "parent_id": "t3_lupi2v",
            "score": 2,
            "created_utc": 1614570612.0,
            "replies": [
                {
                    "body": "That seems like a stretch of what the IRS might do. That CPA is looking for clicks and clients, and selling books. I don't think his legal position is necessarily correct (except on the OnlyFans part, which is definitely taxable).\n\nThe problem with that CPA's logic is: where is the line drawn? For example, what about a plain vanilla GF, who a guy showers with cash and gifts, to the tune of a thousand Benjamins per year? Every time he stops giving her gifts, she stops putting out. When the gifts re-start, she is back in bed with him. \n\nLike you said, we have to go with substance over form, and in that 'vanilla' scenario I described, the substance related to the quid pro quo is not materially different than an \"official\" SD/SB relationship that started on SA.\n\nI am going to look for US tax court case law. I am sure there are cases from the past, where the IRS found a 7 figure bank account that a rich guy's girlfriend had, and they tried to tax it. The outcomes from those types of cases will tell the real story on taxability, as the line has to be drawn somewhere. \n\nThat CPA's website should be talking about that type of case law, to support his argument, but he doesn't. Sugaring has been around for 5,000 years, so I don't think a SD/SB who found each other on SA, are in some new territory, in terms of taxability.",
                    "author": "Nomad_Bill",
                    "id": "gpg2zet",
                    "parent_id": "t1_gp9ijg5",
                    "score": 2,
                    "created_utc": 1614712145.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "gpgwhew",
                            "parent_id": "t1_gpg2zet",
                            "score": 2,
                            "created_utc": 1614725010.0,
                            "replies": [
                                {
                                    "body": "That makes sense, good points. \n\nAnd as you probably know, the IRS (at the audit stage) isn't necessarily going to conform to case law standards. \n\nAnd it works in both directions: I have seen the IRS \\*under\\*-assess a taxpayer what they could have assessed, based on the IRS agent's ignorance of even the basic tax regs (let alone case law). \n\nSo I guess it comes down to basic risk management. Is it really worth it for a SB to pay (including FICA) approx 35% taxes, to avoid an adverse outcome from an audit, which has about a 1% annual chance of happening? \n\nMaybe, maybe not. If we're talking big $ for a SB, I would take a close look at the case law on gifts, quid pro quo, and the various factors that determine gifts versus \"compensation\", in various types of payment scenarios. I'm not convinced that it's as black-and-white as that CPA makes it out to be.\n\nAnd then, depending on what the case law shows, if the SB can make a good faith argument that the gift $ are non-taxable, the SB should disclose all bank account data to a tax lawyer, and have that lawyer prepare the return and sign-off on it.",
                                    "author": "Nomad_Bill",
                                    "id": "gpgzmmv",
                                    "parent_id": "t1_gpgwhew",
                                    "score": 1,
                                    "created_utc": 1614726535.0,
                                    "replies": [
                                        {
                                            "body": "[deleted]",
                                            "author": null,
                                            "id": "gph0qg5",
                                            "parent_id": "t1_gpgzmmv",
                                            "score": 1,
                                            "created_utc": 1614727087.0,
                                            "replies": [
                                                {
                                                    "body": "Believe it or not, that advice isn't that far from the truth. \n\nThe most error-prone \"professionals\" I have ever dealt with, are lawyers and accountants. I have spent countless hours and $, cleaning up their messes.\n\nAt this point, I do most of my tax planning, and tax returns, on my own. When I have tough questions, I 'crowdsource' them in online forums. And I never take any lawyer's or accountant's advice at face-value, and on high-risk issues, I get 2nd and 3rd opinions.",
                                                    "author": "Nomad_Bill",
                                                    "id": "gph2882",
                                                    "parent_id": "t1_gph0qg5",
                                                    "score": 1,
                                                    "created_utc": 1614727843.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Attorney here. Ignoring the debate regarding the gift status of allowances, I would strongly urge SB’s to report any digital payments on their Schedule C, to deduct reasonable expenses and pay self employment taxes every year. You will receive:\n- Peace of mind\n- Healthy habit of putting aside estimated taxes (starting in year #2)\n- Pay taxes at a (presumably) low rate\n- Be able to, over a few years of Schedule C tax returns, use them to apply for leases and mortgages.",
            "author": "PlanetHoneyG",
            "id": "gp8r23q",
            "parent_id": "t3_lupi2v",
            "score": 4,
            "created_utc": 1614555188.0,
            "replies": [
                {
                    "body": "Upvoted, as I think this is an important detail for those SBs who ask how they might include sugaring money toward getting approved for a mortgage/apartment rental. SBs might be sacrificing some money in the immediate term, but for those in situations where sugaring is a substantial amount of income, this helps a lot!",
                    "author": "SD_in_training",
                    "id": "gp9gypr",
                    "parent_id": "t1_gp8r23q",
                    "score": 2,
                    "created_utc": 1614569663.0,
                    "replies": []
                },
                {
                    "body": "This!",
                    "author": null,
                    "id": "gp909mg",
                    "parent_id": "t1_gp8r23q",
                    "score": 1,
                    "created_utc": 1614560181.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "The lifetime limit is gonna get Biden'd soon",
            "author": "JeaneyBowl",
            "id": "gp8k1n4",
            "parent_id": "t3_lupi2v",
            "score": 4,
            "created_utc": 1614551917.0,
            "replies": [
                {
                    "body": "I doubt it. If it does change, it would INCREASE, not decrease. Wanna do a bet?! \n\nWe can circle back in 4years time.",
                    "author": "ExExpectations",
                    "id": "gp8mtzd",
                    "parent_id": "t1_gp8k1n4",
                    "score": 4,
                    "created_utc": 1614553197.0,
                    "replies": [
                        {
                            "body": "**ExExpectations** , kminder 4 years on [**28-Feb-2025 22:59Z**](https://www.reminddit.com/time?dt=2025-02-28 22:59:57&reminder_id=326d39cc13b44cebae1078cc8ff141d3&subreddit=sugarlifestyleforum)\n\n> [**sugarlifestyleforum/Sbsd_105_ppm_allowance_benjis_digital_money**](/r/sugarlifestyleforum/comments/lupi2v/sbsd_105_ppm_allowance_benjis_digital_money/gp8mtzd/?context=3)\n\n> I doubt it. Wanna do a bet?!\n\n[**CLICK HERE**](https://reddit.com/message/compose/?to=remindditbot&subject=Reminder%20from%20Link&message=your_message%0Akminder%202025-02-28T22%3A59%3A57%0A%0A%0A%0A---Server%20settings%20below.%20Do%20not%20change---%0A%0Apermalink%21%20%2Fr%2Fsugarlifestyleforum%2Fcomments%2Flupi2v%2Fsbsd_105_ppm_allowance_benjis_digital_money%2Fgp8mtzd%2F) to also be reminded. Thread has 1 reminder.\n\n^(OP can )[^(**Delete reminder and comment, Set timezone, and more here**)](https://www.reminddit.com/time?dt=2025-02-28 22:59:57&reminder_id=326d39cc13b44cebae1078cc8ff141d3&subreddit=sugarlifestyleforum)\n\n\n\n*****\n\n[**Reminddit**](https://www.reminddit.com) · [Create Reminder](https://reddit.com/message/compose/?to=remindditbot&subject=Reminder&message=your_message%0A%0Akminder%20time_or_time_from_now) · [Your Reminders](https://reddit.com/message/compose/?to=remindditbot&subject=List%20Of%20Reminders&message=listReminders%21) · [Fuel Me](https://paypal.me/reminddit)",
                            "author": "remindditbot",
                            "id": "gp8o3yx",
                            "parent_id": "t1_gp8mtzd",
                            "score": 4,
                            "created_utc": 1614553792.0,
                            "replies": []
                        },
                        {
                            "body": "why would you doubt it? Biden wants to decrease it down to $3.5mill. Trump is the one who raised it.\n\nhttps://www.forbes.com/sites/ashleaebeling/2020/10/26/irs-announces-higher-estate-and-gift-tax-limits-for-2021/",
                            "author": "sucRoseToTheOccasion",
                            "id": "gp96156",
                            "parent_id": "t1_gp8mtzd",
                            "score": 1,
                            "created_utc": 1614563430.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I think you misstate the issue with the lifetime gift limit. You don’t have to give 11.7 mil as gifts to have to pay tax on it. If you leave an estate of let’s say 15.7 mil, then 4 mil is subject to estate tax. If in a given year you give an SB more than her fifteen k gift tax limit, then you would report the amount above that and it would get deducted from your lifetime exclusion and would be taxed upon death in this situation. So yes it does get taxed, just not now.\n\nAlso, a gift over 15 k has to be reported on the gift tax form and requires the SB’s name and social security number. If the SD’s wife is happy to gift share, the limit becomes 30 k. Trust me, I’ve been filing gift tax returns for years, so I’m quite familiar with how the process works.",
            "author": "RealisticSD",
            "id": "gp8n90h",
            "parent_id": "t3_lupi2v",
            "score": 1,
            "created_utc": 1614553388.0,
            "replies": []
        },
        {
            "body": "It's not illegal to deposit cash, but it's highly inadvisable to do this. Banks can and do file SAR's, whenever they feel like it. The IRS can and does seize cash, whenever they feel like it.\n\nIt doesn't matter that the cash is 100% legally obtained, and it doesn't matter if you comply with all tax laws. Cash is still subject to seizure, even when you are 100% legally compliant. It's called 'civil asset forfeiture', and the courts allow it. There are thousands of cases on the internet, of people with cash, 100% legally obtained, and all taxes paid, and they still lost it to the IRS (To clarify: this has nothing to do with structuring, and occurs even when there is no structuring by the depositor).\n\nIs it \\*likely\\* that it will be seized? No, not even close. But, not a risk you want to take.\n\nWhen I win money at sports betting, I get paid in cash from the casino, 5 figures worth typically, and I report it on my taxes. But, I NEVER would deposit that into the bank. I use it for normal daily living expenses.",
            "author": "Nomad_Bill",
            "id": "gp98ee9",
            "parent_id": "t3_lupi2v",
            "score": 1,
            "created_utc": 1614564762.0,
            "replies": [
                {
                    "body": "I was getting ready to post more of a reply when I recognized your username.\n\nWe already discussed this topic at-length in a different thread. Any curious readers can go back in posting histories to get the recap.\n\nInstead, I will just comment - best advice is for an SB to use cash received to the greatest extent practical, and if there is still more cash (like in a particularly heavy monthly allowance or PPM situation) they need to weigh the risk of keeping so much cash on hand, vs. depositing it in the bank for peace of mind, recognizing that there is a (minute) threat of asset forfeiture.",
                    "author": "SD_in_training",
                    "id": "gp9hbxo",
                    "parent_id": "t1_gp98ee9",
                    "score": 3,
                    "created_utc": 1614569881.0,
                    "replies": [
                        {
                            "body": "Yes, sounds like we had this debate before :-)\n\nYour point is valid. There is a risk to keeping that much cash at home, and not in the bank. I only raise the SAR/forfeiture issue so that a person can make an informed decision, with full knowledge of the risks inherent in each strategy. \n\nAll of this is just basic Risk Management 101.",
                            "author": "Nomad_Bill",
                            "id": "gpfu0w3",
                            "parent_id": "t1_gp9hbxo",
                            "score": 2,
                            "created_utc": 1614708309.0,
                            "replies": []
                        },
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "gpagevf",
                            "parent_id": "t1_gp9hbxo",
                            "score": 1,
                            "created_utc": 1614599150.0,
                            "replies": [
                                {
                                    "body": "I know absolutely nothing about banking regulations in whichever Scandinavian country you're in, so I can't really answer your question. Based on your story though, it seems like the bank would be satisfied if you just said it's a gift again.\n\nOther plausible stories could include having a job that typically pays you in cash/tips, you operate a small business, or that you had some success at the casino... or buying prepaid cards at a grocery store even, but I have no clue how applicable these ideas can be in your country.\n\nIn the US, the typical threshold where the cause for concern comes into play is right around $10K/month. I don't know how much gifts you've been receiving, but for many there isn't too much of a real threat of these issues.",
                                    "author": "SD_in_training",
                                    "id": "gpaie0i",
                                    "parent_id": "t1_gpagevf",
                                    "score": 2,
                                    "created_utc": 1614600767.0,
                                    "replies": [
                                        {
                                            "body": "Any amount, well below $10k, can trigger a SAR. Millions of SAR's are filed each year, for amounts below $10k.\n\nNor is the $10k threshold that you are speaking of, based on \"per month\". CTR's are based on a per transaction amount... calendar frequency has no affect on CTR's.",
                                            "author": "Nomad_Bill",
                                            "id": "gpfs9p7",
                                            "parent_id": "t1_gpaie0i",
                                            "score": 0,
                                            "created_utc": 1614707551.0,
                                            "replies": [
                                                {
                                                    "body": "You are correct, but $10K works as a reasonable rule of thumb I think in terms of how much concern a given person should have.\n\nApparent structuring is the classic example of how many SARs get triggered, though a given bank or teller may view other situations as suspicious in their judgment. If the total value of transactions is well below $10K, the relative risk is certainly less to that person, but if they are approaching or above that threshold, they must be significantly more thoughtful.",
                                                    "author": "SD_in_training",
                                                    "id": "gpfx3wx",
                                                    "parent_id": "t1_gpfs9p7",
                                                    "score": 2,
                                                    "created_utc": 1614709644.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "You'll want to check on the case law in your country's courts, and see how 'civil asset forfeiture' cases are treated. Also look for news items on the same subject. \n\nThe outcomes (and risks) on this issue will vary widely from country to country.",
                                    "author": "Nomad_Bill",
                                    "id": "gpfslhn",
                                    "parent_id": "t1_gpagevf",
                                    "score": 1,
                                    "created_utc": 1614707691.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "How is an allowance a gift?    The “giver” is receiving fair value in return.",
            "author": "Scared_Celebration38",
            "id": "gp8kqrw",
            "parent_id": "t3_lupi2v",
            "score": 0,
            "created_utc": 1614552237.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "gp8zniw",
                    "parent_id": "t1_gp8kqrw",
                    "score": 3,
                    "created_utc": 1614559829.0,
                    "replies": [
                        {
                            "body": "100% agree.",
                            "author": "ExExpectations",
                            "id": "gp924wm",
                            "parent_id": "t1_gp8zniw",
                            "score": 2,
                            "created_utc": 1614561244.0,
                            "replies": []
                        },
                        {
                            "body": "If you pay an allowance in advance...you’re really a noob. Or just a fool.  Do you pay your babysitter in advance?   It’s an exchange. If either party stopped providing....the arrangement would soon end......get real about the concept",
                            "author": "Scared_Celebration38",
                            "id": "gp9cne9",
                            "parent_id": "t1_gp8zniw",
                            "score": -1,
                            "created_utc": 1614567155.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "gp9fk7o",
                                    "parent_id": "t1_gp9cne9",
                                    "score": 4,
                                    "created_utc": 1614568837.0,
                                    "replies": [
                                        {
                                            "body": "[removed]",
                                            "author": null,
                                            "id": "gp9fucw",
                                            "parent_id": "t1_gp9fk7o",
                                            "score": 0,
                                            "created_utc": 1614569001.0,
                                            "replies": [
                                                {
                                                    "body": "[deleted]",
                                                    "author": null,
                                                    "id": "gp9fzpq",
                                                    "parent_id": "t1_gp9fucw",
                                                    "score": 4,
                                                    "created_utc": 1614569088.0,
                                                    "replies": [
                                                        {
                                                            "body": "So.....either you are in a sexless SR...or you are lying to yourself about the entire concept....These women WOULD NOT spend time with you without compensation. Please stop with the noble, white knight BS....you are only fooling yourself",
                                                            "author": "Scared_Celebration38",
                                                            "id": "gp9gb4b",
                                                            "parent_id": "t1_gp9fzpq",
                                                            "score": 0,
                                                            "created_utc": 1614569274.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Yeah, the legal definition of a gift is that there is no expectation of anything in return. In sugar dating, there is clear expectation when ppm or allowance is given.\n\nWith my current SB for example, I give her a monthly allowance for meeting 8 times a month. This is not a gift because I expect something from her in return. However, I gave her money for the downpayment of her car and I told her that would be her Valentine’s Day and birthday gift; that is legally a gift because I don’t expect anything tangible in return.\n\nI think most arrangements are structured as payment in return for something. I’ve told my SBs that if the IRS were to ask me, I’d say nothing myself (what idiot explains things to any government agent without a lawyer is beyond me), but my lawyer would say that I gave money for services rendered. Her lawyer can claim it was a gift.",
                    "author": "RealisticSD",
                    "id": "gp8miil",
                    "parent_id": "t1_gp8kqrw",
                    "score": 2,
                    "created_utc": 1614553043.0,
                    "replies": [
                        {
                            "body": "It’s my opinion that the OP is advising others how to commit tax fraud.",
                            "author": "Scared_Celebration38",
                            "id": "gp8mvtc",
                            "parent_id": "t1_gp8miil",
                            "score": 3,
                            "created_utc": 1614553222.0,
                            "replies": [
                                {
                                    "body": "🙄🙄I’m not advising anyone. I’m simply writing what I’ve experienced, researched, know.",
                                    "author": "ExExpectations",
                                    "id": "gp8pf12",
                                    "parent_id": "t1_gp8mvtc",
                                    "score": 2,
                                    "created_utc": 1614554399.0,
                                    "replies": [
                                        {
                                            "body": ">researched\n\nWealthy man's girlfriend. He's going to give her jewelry, clothes, pay her rent, give her money so she has less stress on her life. He's happy when she's happy. If a wealthy man shared nothing, most people would think that out of the norm and call him a cheapskate. I would say it's somewhat a societal expectation. OTOH, if you are PPMing and get 2 hours of sex and do nothing else, there may be an argument for pay for service. But there's no market value on a date to a hookah bar, or going out to dinner, or a museum... when ppm is given whether intimate or not - vs pps. But even pps is arguably OK since there's 'fuck buddies' and fwb's who hook up and never go on dates. Last I checked there's no published price chart for having a girlfriend.",
                                            "author": "bluelunarmonkey",
                                            "id": "gpb7jjn",
                                            "parent_id": "t1_gp8pf12",
                                            "score": 3,
                                            "created_utc": 1614614933.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "More like what you want to believe. Hiding income might be possible but many illegal activities are possible.  Calling a payment for services a “gift” does not make it so",
                                            "author": "Scared_Celebration38",
                                            "id": "gp8q0au",
                                            "parent_id": "t1_gp8pf12",
                                            "score": 3,
                                            "created_utc": 1614554675.0,
                                            "replies": [
                                                {
                                                    "body": "LOL okay buddy. You do you. My SDs give me gifts and allowance and ppms and they’re all gifts. And yes, wiring large sums through bank accounts too.",
                                                    "author": "ExExpectations",
                                                    "id": "gp8qog1",
                                                    "parent_id": "t1_gp8q0au",
                                                    "score": 1,
                                                    "created_utc": 1614554998.0,
                                                    "replies": [
                                                        {
                                                            "body": "You can do you, but I believe your interpretation is wrong on the tax issue.  If you or any other SB wants to avoid reporting, that's your choice, but don't tell me based on your research it's correct and a regulator would see it that way.\n\nSaying what you know and telling others to do likewise constitutes advice.",
                                                            "author": null,
                                                            "id": "gp905hu",
                                                            "parent_id": "t1_gp8qog1",
                                                            "score": 3,
                                                            "created_utc": 1614560116.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Everyone’s got an opinion. Everyone’s got an asshole too.",
                                                                    "author": "ExExpectations",
                                                                    "id": "gp9110l",
                                                                    "parent_id": "t1_gp905hu",
                                                                    "score": 2,
                                                                    "created_utc": 1614560619.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Tax free gift comment is incorrect you can gift up to 12500 to 15k per year tax free after that you have to fill a gift tax return.\n\n[IRS gift tax ](https://www.irs.gov/businesses/small-businesses-self-employed/frequently-asked-questions-on-gift-taxes)",
            "author": "ntxstud007",
            "id": "hah554t",
            "parent_id": "t3_lupi2v",
            "score": 0,
            "created_utc": 1630012928.0,
            "replies": []
        },
        {
            "body": "Circling back around to this post to ask a clarifying question. Regarding depositing cash gifts into your bank account: do you deposit the amount you receive monthly (minus paying for things you can with cash), or do you save cash and deposit a larger sum less frequently? \n\nParticularly now, there isn’t much that I pay for in cash because I get a lot of pickup/delivery orders, or have set up autopay. I have always saved cash that I receive (from family, selling things on Craigslist) and occasionally have deposited it when it’s needed, but mostly I just keep it on hand. I want to keep doing this, but I will also need to deposit some of my sugar money for bills. And given that I know virtually zero about taxes/legalities, I’m over analyzing what it’d look like to deposit $XXX or $XXXX once a month and what I would necessarily say to my CPA.",
            "author": "buttery_bees",
            "id": "gvgldcc",
            "parent_id": "t3_lupi2v",
            "score": 1,
            "created_utc": 1619108884.0,
            "replies": []
        },
        {
            "body": "Not on the uk.   There are no limits on how much you can receive as a gift.",
            "author": "brit-sd",
            "id": "gp96far",
            "parent_id": "t1_gp852v6",
            "score": 3,
            "created_utc": 1614563653.0,
            "replies": [
                {
                    "body": "\"As it stands, the gift tax rules for 2021 remain the same as in recent years, with a £3,000 annual exemption, £250 smaller gift giving allowance, and the seven-year clawback rule.\"\n\nAs said, no problem as long as you know your local regulations, but in EU the receiver is pretty much always the one legally obliged to report and pay.",
                    "author": "EstrellaDulce",
                    "id": "gp970xh",
                    "parent_id": "t1_gp96far",
                    "score": 1,
                    "created_utc": 1614563993.0,
                    "replies": [
                        {
                            "body": "You are confusing rules about income and inheritance.  There is no limit on gifts for income tax in the uk.  What you refer is only due to inheritance tax when the gifter dies  If tax is due it comes from the estate not the individual.   There is a small risk that if the person dies and there is no money left in the estate then a gift can be clawed back but this is only likely for very large sums and the amount tapers over the 7years. \n\nIn any case, gifts made out of excess income (income above what the gifter needs for day to day living) are exempt from even inheritance tax.  \n\nSo in the context of a person giving money in a relationship, unless it was a large sum that was not excess income and the person dies soon afterwards, it is completely free of all taxes.  \n\nIn pretty well most cases gifts like sugar are from excess income and therefore exempt from inheritance tax.    \n\nAnyone getting money from me in the uk will never ever need to pay tax of any type.",
                            "author": "brit-sd",
                            "id": "gpa244t",
                            "parent_id": "t1_gp970xh",
                            "score": 5,
                            "created_utc": 1614585287.0,
                            "replies": [
                                {
                                    "body": "Ah, it's true. You have that funny rule of surplus income being ok to give away tax-free.\n\nBut then, I think for example Ireland limits tax-free gifts to something like 15-20k lifetime, no matter who is the gifter. Germany has also limit of 20k, though I think it's only for 10yrs and per gifter. Sweden does not have gift tax at all nowadays, Finland limits to 5k during 3 years per gifter, Spain and France have nothing tax-free, taxing starts basically from 0.\n\nThe point is that you need to know your local rules. Still haven't seen a country in Europe which would tax the payer like in US. In all countries it is the receiver who pays taxes, and it is important for European SBs to understand that. We mostly have no problem giving out our bank details, which seems to be huge red in the States. However, depending on your country, you might not want money arriving to your bank acc, because it will be noted and you will end up paying taxes.",
                                    "author": "EstrellaDulce",
                                    "id": "gpamzvu",
                                    "parent_id": "t1_gpa244t",
                                    "score": 2,
                                    "created_utc": 1614604067.0,
                                    "replies": [
                                        {
                                            "body": "So interesting! \n\nSo how do you typically receive your allowance/support? Is it directly deposited into your bank account or is it cash, or digital? \n\nIf it’s deposited into a bank, is it automatically counted as gift?",
                                            "author": "ExExpectations",
                                            "id": "gpff7ob",
                                            "parent_id": "t1_gpamzvu",
                                            "score": 1,
                                            "created_utc": 1614701834.0,
                                            "replies": [
                                                {
                                                    "body": "Cash. Prefer cash any time so I can deal with it in a way that suits me best.. I do transfers as well, but it's really a special case. Haven't gotten into problems so far, even though they are in USD.. There would jump in the international agreements between countries. Because he is liable to tax as US gifter, in theory the obligation should not be duplicated at my end. I also have him as a resident in my address (signed in notary for his permanent visa), so I could claim it's not a gift, he's only paying his part of the running costs as my life-partner, which would easily be supported by the fact that he always transfers me money 2 days before my rent is due.\n\nI think in all countries, gifts are supposed to be voluntarily reported by the receiver, which obviously never happens for smaller amounts. In reality, you are not going to be checked by anyone as long as one-time transfers are not too big. But well, the risk is there, and really depends on the country.\n\nI'm accountant, so I know my risks and anything I do, I know I will be fully responsible if \"getting caught\". There are things I do voluntarily report, like my tiny capital gains. Fingers crossed it's enough to keep tax office happy in future too :D",
                                                    "author": "EstrellaDulce",
                                                    "id": "gpks0ai",
                                                    "parent_id": "t1_gpff7ob",
                                                    "score": 2,
                                                    "created_utc": 1614804618.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Ahh. The list of fun notes were endless 😂I was with him for 4.5 years (with some breaks).",
            "author": "ExExpectations",
            "id": "gp8mh3h",
            "parent_id": "t1_gp8k6a5",
            "score": 4,
            "created_utc": 1614553024.0,
            "replies": [
                {
                    "body": "My kind of SD...🥰😁",
                    "author": "ShaArt5",
                    "id": "gp8mrvx",
                    "parent_id": "t1_gp8mh3h",
                    "score": 3,
                    "created_utc": 1614553169.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Oh shit, I'm at $11.6m YTD.",
            "author": "whatever-tata",
            "id": "gp817np",
            "parent_id": "t1_gp80hpn",
            "score": 2,
            "created_utc": 1614544927.0,
            "replies": [
                {
                    "body": "That's lifetime, not per year.",
                    "author": "Y_4Z44",
                    "id": "gp81dop",
                    "parent_id": "t1_gp817np",
                    "score": 1,
                    "created_utc": 1614544977.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gp9izr6",
            "parent_id": "t1_gp80hpn",
            "score": -1,
            "created_utc": 1614570888.0,
            "replies": [
                {
                    "body": "> The 11.7 million is the estate tax exemption\n\nNot sure what your point is here. The estate tax is a tax on property transferred *after someone is deceased*. The \"gift tax\" is a tax levied on gifts *while someone is alive*. They are two separate and distinct things. We're not talking about estate taxes here.",
                    "author": "Y_4Z44",
                    "id": "gp9tnku",
                    "parent_id": "t1_gp9izr6",
                    "score": 4,
                    "created_utc": 1614578149.0,
                    "replies": [
                        {
                            "body": "If you are in a situation where the lifetime exclusion is going to apply to your estate, I hope you can improve your understanding of how this works.\n\nu/beach_sd has been exactly on point. The estate tax exemption *is* the lifetime gift tax exemption. In the eyes of the IRS, your remaining estate when you pass is a giant gift to your heir (to be taxed accordingly).",
                            "author": "SD_in_training",
                            "id": "gpfw8o3",
                            "parent_id": "t1_gp9tnku",
                            "score": -1,
                            "created_utc": 1614709272.0,
                            "replies": [
                                {
                                    "body": "And that is *wholly irrelevant* to the subject under discussion in this thread. The post was about living people in SRs, not what happens to an SD's estate when he passes. Thus my questioning about his point. I'm not arguing he's incorrect, but that whatever \"point\" he thinks he's making is entirely irrelevant to the subject of the OP's post.",
                                    "author": "Y_4Z44",
                                    "id": "gpfwsax",
                                    "parent_id": "t1_gpfw8o3",
                                    "score": 2,
                                    "created_utc": 1614709507.0,
                                    "replies": [
                                        {
                                            "body": "I would expect that real live SDs in SRs currently would be interested in an accurate understanding of how giving gifts may impact what they leave to their heirs.\n\nSeems relevant to me, but we can disagree.",
                                            "author": "SD_in_training",
                                            "id": "gpfyg9f",
                                            "parent_id": "t1_gpfwsax",
                                            "score": 0,
                                            "created_utc": 1614710221.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Actually, more can be transferred and received via zelle, I think up to $9999. And it’s usually instant deposit.",
            "author": null,
            "id": "gp8bhzu",
            "parent_id": "t1_gp81bmx",
            "score": 3,
            "created_utc": 1614548131.0,
            "replies": [
                {
                    "body": "zelle varies depending on the bank you use",
                    "author": "sucRoseToTheOccasion",
                    "id": "gp95tvz",
                    "parent_id": "t1_gp8bhzu",
                    "score": 3,
                    "created_utc": 1614563318.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Oh 😍how I love thee. Do you have a brother? A twin? A replica perhaps? 😊",
            "author": "ExExpectations",
            "id": "gpbc7db",
            "parent_id": "t1_gpbaw48",
            "score": 3,
            "created_utc": 1614617057.0,
            "replies": [
                {
                    "body": "Aww.. 😊",
                    "author": "SwimmingInSugar",
                    "id": "gpeyt1w",
                    "parent_id": "t1_gpbc7db",
                    "score": 2,
                    "created_utc": 1614694089.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "These digital apps are here to stay. And if a company dissolve, they are required to provide x amount of time for users to take action regarding their data/money/etc before they can legally shut down.",
            "author": "ExExpectations",
            "id": "gpbd7lu",
            "parent_id": "t1_gpa0i4f",
            "score": 1,
            "created_utc": 1614617510.0,
            "replies": []
        },
        {
            "body": "**correct, tax info is.** \n\n*-bluelunarmonkey*\n\n***\n\n\n\n^(Commands: 'opt out', 'delete')",
            "author": "IamYodaBot",
            "id": "gpb4ops",
            "parent_id": "t1_gpb4mcv",
            "score": 1,
            "created_utc": 1614613593.0,
            "replies": []
        },
        {
            "body": "That’s really interesting! \nI was trying to help someone figure out if it’s possible to have a second venmo account, but I couldn’t find any info!! \nDo you have an iPhone? Or Android? Is it on two separate phones? \nCan I DM you?",
            "author": "ExExpectations",
            "id": "gp9bw2v",
            "parent_id": "t1_gp9a2u4",
            "score": 2,
            "created_utc": 1614566720.0,
            "replies": [
                {
                    "body": "I have an Android. And sure! I think I'm using two separate email accounts. I'll check in the meantime.\nUPDATE: That was faster than I thought. :) Yeah, I'm using two separate email accounts. One for friends and family, one for randos. Everything's private on the latter.",
                    "author": "CodiKo",
                    "id": "gp9c1k9",
                    "parent_id": "t1_gp9bw2v",
                    "score": 2,
                    "created_utc": 1614566808.0,
                    "replies": [
                        {
                            "body": "That is so cool! So you have access to both of these Venmo accounts on one phone? Do you just login or out between the two to access them? Just trying to get an understanding as I’d like to set up a second one as well!",
                            "author": "sizzlepopsun",
                            "id": "gpfjvft",
                            "parent_id": "t1_gp9c1k9",
                            "score": 2,
                            "created_utc": 1614703888.0,
                            "replies": [
                                {
                                    "body": "Yeah, I can't be logged into both at the same time. They're under different email addresses. I have 4 different email addresses that I use on a ~daily basis, so I had that option at my disposal. I have three different cash app accounts. Haha",
                                    "author": "CodiKo",
                                    "id": "gpfm6ov",
                                    "parent_id": "t1_gpfjvft",
                                    "score": 2,
                                    "created_utc": 1614704894.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "That seems like a stretch of what the IRS might do. That CPA is looking for clicks and clients, and selling books. I don't think his legal position is necessarily correct (except on the OnlyFans part, which is definitely taxable).\n\nThe problem with that CPA's logic is: where is the line drawn? For example, what about a plain vanilla GF, who a guy showers with cash and gifts, to the tune of a thousand Benjamins per year? Every time he stops giving her gifts, she stops putting out. When the gifts re-start, she is back in bed with him. \n\nLike you said, we have to go with substance over form, and in that 'vanilla' scenario I described, the substance related to the quid pro quo is not materially different than an \"official\" SD/SB relationship that started on SA.\n\nI am going to look for US tax court case law. I am sure there are cases from the past, where the IRS found a 7 figure bank account that a rich guy's girlfriend had, and they tried to tax it. The outcomes from those types of cases will tell the real story on taxability, as the line has to be drawn somewhere. \n\nThat CPA's website should be talking about that type of case law, to support his argument, but he doesn't. Sugaring has been around for 5,000 years, so I don't think a SD/SB who found each other on SA, are in some new territory, in terms of taxability.",
            "author": "Nomad_Bill",
            "id": "gpg2zet",
            "parent_id": "t1_gp9ijg5",
            "score": 2,
            "created_utc": 1614712145.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "gpgwhew",
                    "parent_id": "t1_gpg2zet",
                    "score": 2,
                    "created_utc": 1614725010.0,
                    "replies": [
                        {
                            "body": "That makes sense, good points. \n\nAnd as you probably know, the IRS (at the audit stage) isn't necessarily going to conform to case law standards. \n\nAnd it works in both directions: I have seen the IRS \\*under\\*-assess a taxpayer what they could have assessed, based on the IRS agent's ignorance of even the basic tax regs (let alone case law). \n\nSo I guess it comes down to basic risk management. Is it really worth it for a SB to pay (including FICA) approx 35% taxes, to avoid an adverse outcome from an audit, which has about a 1% annual chance of happening? \n\nMaybe, maybe not. If we're talking big $ for a SB, I would take a close look at the case law on gifts, quid pro quo, and the various factors that determine gifts versus \"compensation\", in various types of payment scenarios. I'm not convinced that it's as black-and-white as that CPA makes it out to be.\n\nAnd then, depending on what the case law shows, if the SB can make a good faith argument that the gift $ are non-taxable, the SB should disclose all bank account data to a tax lawyer, and have that lawyer prepare the return and sign-off on it.",
                            "author": "Nomad_Bill",
                            "id": "gpgzmmv",
                            "parent_id": "t1_gpgwhew",
                            "score": 1,
                            "created_utc": 1614726535.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "gph0qg5",
                                    "parent_id": "t1_gpgzmmv",
                                    "score": 1,
                                    "created_utc": 1614727087.0,
                                    "replies": [
                                        {
                                            "body": "Believe it or not, that advice isn't that far from the truth. \n\nThe most error-prone \"professionals\" I have ever dealt with, are lawyers and accountants. I have spent countless hours and $, cleaning up their messes.\n\nAt this point, I do most of my tax planning, and tax returns, on my own. When I have tough questions, I 'crowdsource' them in online forums. And I never take any lawyer's or accountant's advice at face-value, and on high-risk issues, I get 2nd and 3rd opinions.",
                                            "author": "Nomad_Bill",
                                            "id": "gph2882",
                                            "parent_id": "t1_gph0qg5",
                                            "score": 1,
                                            "created_utc": 1614727843.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Upvoted, as I think this is an important detail for those SBs who ask how they might include sugaring money toward getting approved for a mortgage/apartment rental. SBs might be sacrificing some money in the immediate term, but for those in situations where sugaring is a substantial amount of income, this helps a lot!",
            "author": "SD_in_training",
            "id": "gp9gypr",
            "parent_id": "t1_gp8r23q",
            "score": 2,
            "created_utc": 1614569663.0,
            "replies": []
        },
        {
            "body": "This!",
            "author": null,
            "id": "gp909mg",
            "parent_id": "t1_gp8r23q",
            "score": 1,
            "created_utc": 1614560181.0,
            "replies": []
        },
        {
            "body": "I doubt it. If it does change, it would INCREASE, not decrease. Wanna do a bet?! \n\nWe can circle back in 4years time.",
            "author": "ExExpectations",
            "id": "gp8mtzd",
            "parent_id": "t1_gp8k1n4",
            "score": 4,
            "created_utc": 1614553197.0,
            "replies": [
                {
                    "body": "**ExExpectations** , kminder 4 years on [**28-Feb-2025 22:59Z**](https://www.reminddit.com/time?dt=2025-02-28 22:59:57&reminder_id=326d39cc13b44cebae1078cc8ff141d3&subreddit=sugarlifestyleforum)\n\n> [**sugarlifestyleforum/Sbsd_105_ppm_allowance_benjis_digital_money**](/r/sugarlifestyleforum/comments/lupi2v/sbsd_105_ppm_allowance_benjis_digital_money/gp8mtzd/?context=3)\n\n> I doubt it. Wanna do a bet?!\n\n[**CLICK HERE**](https://reddit.com/message/compose/?to=remindditbot&subject=Reminder%20from%20Link&message=your_message%0Akminder%202025-02-28T22%3A59%3A57%0A%0A%0A%0A---Server%20settings%20below.%20Do%20not%20change---%0A%0Apermalink%21%20%2Fr%2Fsugarlifestyleforum%2Fcomments%2Flupi2v%2Fsbsd_105_ppm_allowance_benjis_digital_money%2Fgp8mtzd%2F) to also be reminded. Thread has 1 reminder.\n\n^(OP can )[^(**Delete reminder and comment, Set timezone, and more here**)](https://www.reminddit.com/time?dt=2025-02-28 22:59:57&reminder_id=326d39cc13b44cebae1078cc8ff141d3&subreddit=sugarlifestyleforum)\n\n\n\n*****\n\n[**Reminddit**](https://www.reminddit.com) · [Create Reminder](https://reddit.com/message/compose/?to=remindditbot&subject=Reminder&message=your_message%0A%0Akminder%20time_or_time_from_now) · [Your Reminders](https://reddit.com/message/compose/?to=remindditbot&subject=List%20Of%20Reminders&message=listReminders%21) · [Fuel Me](https://paypal.me/reminddit)",
                    "author": "remindditbot",
                    "id": "gp8o3yx",
                    "parent_id": "t1_gp8mtzd",
                    "score": 4,
                    "created_utc": 1614553792.0,
                    "replies": []
                },
                {
                    "body": "why would you doubt it? Biden wants to decrease it down to $3.5mill. Trump is the one who raised it.\n\nhttps://www.forbes.com/sites/ashleaebeling/2020/10/26/irs-announces-higher-estate-and-gift-tax-limits-for-2021/",
                    "author": "sucRoseToTheOccasion",
                    "id": "gp96156",
                    "parent_id": "t1_gp8mtzd",
                    "score": 1,
                    "created_utc": 1614563430.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I was getting ready to post more of a reply when I recognized your username.\n\nWe already discussed this topic at-length in a different thread. Any curious readers can go back in posting histories to get the recap.\n\nInstead, I will just comment - best advice is for an SB to use cash received to the greatest extent practical, and if there is still more cash (like in a particularly heavy monthly allowance or PPM situation) they need to weigh the risk of keeping so much cash on hand, vs. depositing it in the bank for peace of mind, recognizing that there is a (minute) threat of asset forfeiture.",
            "author": "SD_in_training",
            "id": "gp9hbxo",
            "parent_id": "t1_gp98ee9",
            "score": 3,
            "created_utc": 1614569881.0,
            "replies": [
                {
                    "body": "Yes, sounds like we had this debate before :-)\n\nYour point is valid. There is a risk to keeping that much cash at home, and not in the bank. I only raise the SAR/forfeiture issue so that a person can make an informed decision, with full knowledge of the risks inherent in each strategy. \n\nAll of this is just basic Risk Management 101.",
                    "author": "Nomad_Bill",
                    "id": "gpfu0w3",
                    "parent_id": "t1_gp9hbxo",
                    "score": 2,
                    "created_utc": 1614708309.0,
                    "replies": []
                },
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "gpagevf",
                    "parent_id": "t1_gp9hbxo",
                    "score": 1,
                    "created_utc": 1614599150.0,
                    "replies": [
                        {
                            "body": "I know absolutely nothing about banking regulations in whichever Scandinavian country you're in, so I can't really answer your question. Based on your story though, it seems like the bank would be satisfied if you just said it's a gift again.\n\nOther plausible stories could include having a job that typically pays you in cash/tips, you operate a small business, or that you had some success at the casino... or buying prepaid cards at a grocery store even, but I have no clue how applicable these ideas can be in your country.\n\nIn the US, the typical threshold where the cause for concern comes into play is right around $10K/month. I don't know how much gifts you've been receiving, but for many there isn't too much of a real threat of these issues.",
                            "author": "SD_in_training",
                            "id": "gpaie0i",
                            "parent_id": "t1_gpagevf",
                            "score": 2,
                            "created_utc": 1614600767.0,
                            "replies": [
                                {
                                    "body": "Any amount, well below $10k, can trigger a SAR. Millions of SAR's are filed each year, for amounts below $10k.\n\nNor is the $10k threshold that you are speaking of, based on \"per month\". CTR's are based on a per transaction amount... calendar frequency has no affect on CTR's.",
                                    "author": "Nomad_Bill",
                                    "id": "gpfs9p7",
                                    "parent_id": "t1_gpaie0i",
                                    "score": 0,
                                    "created_utc": 1614707551.0,
                                    "replies": [
                                        {
                                            "body": "You are correct, but $10K works as a reasonable rule of thumb I think in terms of how much concern a given person should have.\n\nApparent structuring is the classic example of how many SARs get triggered, though a given bank or teller may view other situations as suspicious in their judgment. If the total value of transactions is well below $10K, the relative risk is certainly less to that person, but if they are approaching or above that threshold, they must be significantly more thoughtful.",
                                            "author": "SD_in_training",
                                            "id": "gpfx3wx",
                                            "parent_id": "t1_gpfs9p7",
                                            "score": 2,
                                            "created_utc": 1614709644.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "You'll want to check on the case law in your country's courts, and see how 'civil asset forfeiture' cases are treated. Also look for news items on the same subject. \n\nThe outcomes (and risks) on this issue will vary widely from country to country.",
                            "author": "Nomad_Bill",
                            "id": "gpfslhn",
                            "parent_id": "t1_gpagevf",
                            "score": 1,
                            "created_utc": 1614707691.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gp8zniw",
            "parent_id": "t1_gp8kqrw",
            "score": 3,
            "created_utc": 1614559829.0,
            "replies": [
                {
                    "body": "100% agree.",
                    "author": "ExExpectations",
                    "id": "gp924wm",
                    "parent_id": "t1_gp8zniw",
                    "score": 2,
                    "created_utc": 1614561244.0,
                    "replies": []
                },
                {
                    "body": "If you pay an allowance in advance...you’re really a noob. Or just a fool.  Do you pay your babysitter in advance?   It’s an exchange. If either party stopped providing....the arrangement would soon end......get real about the concept",
                    "author": "Scared_Celebration38",
                    "id": "gp9cne9",
                    "parent_id": "t1_gp8zniw",
                    "score": -1,
                    "created_utc": 1614567155.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "gp9fk7o",
                            "parent_id": "t1_gp9cne9",
                            "score": 4,
                            "created_utc": 1614568837.0,
                            "replies": [
                                {
                                    "body": "[removed]",
                                    "author": null,
                                    "id": "gp9fucw",
                                    "parent_id": "t1_gp9fk7o",
                                    "score": 0,
                                    "created_utc": 1614569001.0,
                                    "replies": [
                                        {
                                            "body": "[deleted]",
                                            "author": null,
                                            "id": "gp9fzpq",
                                            "parent_id": "t1_gp9fucw",
                                            "score": 4,
                                            "created_utc": 1614569088.0,
                                            "replies": [
                                                {
                                                    "body": "So.....either you are in a sexless SR...or you are lying to yourself about the entire concept....These women WOULD NOT spend time with you without compensation. Please stop with the noble, white knight BS....you are only fooling yourself",
                                                    "author": "Scared_Celebration38",
                                                    "id": "gp9gb4b",
                                                    "parent_id": "t1_gp9fzpq",
                                                    "score": 0,
                                                    "created_utc": 1614569274.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Yeah, the legal definition of a gift is that there is no expectation of anything in return. In sugar dating, there is clear expectation when ppm or allowance is given.\n\nWith my current SB for example, I give her a monthly allowance for meeting 8 times a month. This is not a gift because I expect something from her in return. However, I gave her money for the downpayment of her car and I told her that would be her Valentine’s Day and birthday gift; that is legally a gift because I don’t expect anything tangible in return.\n\nI think most arrangements are structured as payment in return for something. I’ve told my SBs that if the IRS were to ask me, I’d say nothing myself (what idiot explains things to any government agent without a lawyer is beyond me), but my lawyer would say that I gave money for services rendered. Her lawyer can claim it was a gift.",
            "author": "RealisticSD",
            "id": "gp8miil",
            "parent_id": "t1_gp8kqrw",
            "score": 2,
            "created_utc": 1614553043.0,
            "replies": [
                {
                    "body": "It’s my opinion that the OP is advising others how to commit tax fraud.",
                    "author": "Scared_Celebration38",
                    "id": "gp8mvtc",
                    "parent_id": "t1_gp8miil",
                    "score": 3,
                    "created_utc": 1614553222.0,
                    "replies": [
                        {
                            "body": "🙄🙄I’m not advising anyone. I’m simply writing what I’ve experienced, researched, know.",
                            "author": "ExExpectations",
                            "id": "gp8pf12",
                            "parent_id": "t1_gp8mvtc",
                            "score": 2,
                            "created_utc": 1614554399.0,
                            "replies": [
                                {
                                    "body": ">researched\n\nWealthy man's girlfriend. He's going to give her jewelry, clothes, pay her rent, give her money so she has less stress on her life. He's happy when she's happy. If a wealthy man shared nothing, most people would think that out of the norm and call him a cheapskate. I would say it's somewhat a societal expectation. OTOH, if you are PPMing and get 2 hours of sex and do nothing else, there may be an argument for pay for service. But there's no market value on a date to a hookah bar, or going out to dinner, or a museum... when ppm is given whether intimate or not - vs pps. But even pps is arguably OK since there's 'fuck buddies' and fwb's who hook up and never go on dates. Last I checked there's no published price chart for having a girlfriend.",
                                    "author": "bluelunarmonkey",
                                    "id": "gpb7jjn",
                                    "parent_id": "t1_gp8pf12",
                                    "score": 3,
                                    "created_utc": 1614614933.0,
                                    "replies": []
                                },
                                {
                                    "body": "More like what you want to believe. Hiding income might be possible but many illegal activities are possible.  Calling a payment for services a “gift” does not make it so",
                                    "author": "Scared_Celebration38",
                                    "id": "gp8q0au",
                                    "parent_id": "t1_gp8pf12",
                                    "score": 3,
                                    "created_utc": 1614554675.0,
                                    "replies": [
                                        {
                                            "body": "LOL okay buddy. You do you. My SDs give me gifts and allowance and ppms and they’re all gifts. And yes, wiring large sums through bank accounts too.",
                                            "author": "ExExpectations",
                                            "id": "gp8qog1",
                                            "parent_id": "t1_gp8q0au",
                                            "score": 1,
                                            "created_utc": 1614554998.0,
                                            "replies": [
                                                {
                                                    "body": "You can do you, but I believe your interpretation is wrong on the tax issue.  If you or any other SB wants to avoid reporting, that's your choice, but don't tell me based on your research it's correct and a regulator would see it that way.\n\nSaying what you know and telling others to do likewise constitutes advice.",
                                                    "author": null,
                                                    "id": "gp905hu",
                                                    "parent_id": "t1_gp8qog1",
                                                    "score": 3,
                                                    "created_utc": 1614560116.0,
                                                    "replies": [
                                                        {
                                                            "body": "Everyone’s got an opinion. Everyone’s got an asshole too.",
                                                            "author": "ExExpectations",
                                                            "id": "gp9110l",
                                                            "parent_id": "t1_gp905hu",
                                                            "score": 2,
                                                            "created_utc": 1614560619.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "\"As it stands, the gift tax rules for 2021 remain the same as in recent years, with a £3,000 annual exemption, £250 smaller gift giving allowance, and the seven-year clawback rule.\"\n\nAs said, no problem as long as you know your local regulations, but in EU the receiver is pretty much always the one legally obliged to report and pay.",
            "author": "EstrellaDulce",
            "id": "gp970xh",
            "parent_id": "t1_gp96far",
            "score": 1,
            "created_utc": 1614563993.0,
            "replies": [
                {
                    "body": "You are confusing rules about income and inheritance.  There is no limit on gifts for income tax in the uk.  What you refer is only due to inheritance tax when the gifter dies  If tax is due it comes from the estate not the individual.   There is a small risk that if the person dies and there is no money left in the estate then a gift can be clawed back but this is only likely for very large sums and the amount tapers over the 7years. \n\nIn any case, gifts made out of excess income (income above what the gifter needs for day to day living) are exempt from even inheritance tax.  \n\nSo in the context of a person giving money in a relationship, unless it was a large sum that was not excess income and the person dies soon afterwards, it is completely free of all taxes.  \n\nIn pretty well most cases gifts like sugar are from excess income and therefore exempt from inheritance tax.    \n\nAnyone getting money from me in the uk will never ever need to pay tax of any type.",
                    "author": "brit-sd",
                    "id": "gpa244t",
                    "parent_id": "t1_gp970xh",
                    "score": 5,
                    "created_utc": 1614585287.0,
                    "replies": [
                        {
                            "body": "Ah, it's true. You have that funny rule of surplus income being ok to give away tax-free.\n\nBut then, I think for example Ireland limits tax-free gifts to something like 15-20k lifetime, no matter who is the gifter. Germany has also limit of 20k, though I think it's only for 10yrs and per gifter. Sweden does not have gift tax at all nowadays, Finland limits to 5k during 3 years per gifter, Spain and France have nothing tax-free, taxing starts basically from 0.\n\nThe point is that you need to know your local rules. Still haven't seen a country in Europe which would tax the payer like in US. In all countries it is the receiver who pays taxes, and it is important for European SBs to understand that. We mostly have no problem giving out our bank details, which seems to be huge red in the States. However, depending on your country, you might not want money arriving to your bank acc, because it will be noted and you will end up paying taxes.",
                            "author": "EstrellaDulce",
                            "id": "gpamzvu",
                            "parent_id": "t1_gpa244t",
                            "score": 2,
                            "created_utc": 1614604067.0,
                            "replies": [
                                {
                                    "body": "So interesting! \n\nSo how do you typically receive your allowance/support? Is it directly deposited into your bank account or is it cash, or digital? \n\nIf it’s deposited into a bank, is it automatically counted as gift?",
                                    "author": "ExExpectations",
                                    "id": "gpff7ob",
                                    "parent_id": "t1_gpamzvu",
                                    "score": 1,
                                    "created_utc": 1614701834.0,
                                    "replies": [
                                        {
                                            "body": "Cash. Prefer cash any time so I can deal with it in a way that suits me best.. I do transfers as well, but it's really a special case. Haven't gotten into problems so far, even though they are in USD.. There would jump in the international agreements between countries. Because he is liable to tax as US gifter, in theory the obligation should not be duplicated at my end. I also have him as a resident in my address (signed in notary for his permanent visa), so I could claim it's not a gift, he's only paying his part of the running costs as my life-partner, which would easily be supported by the fact that he always transfers me money 2 days before my rent is due.\n\nI think in all countries, gifts are supposed to be voluntarily reported by the receiver, which obviously never happens for smaller amounts. In reality, you are not going to be checked by anyone as long as one-time transfers are not too big. But well, the risk is there, and really depends on the country.\n\nI'm accountant, so I know my risks and anything I do, I know I will be fully responsible if \"getting caught\". There are things I do voluntarily report, like my tiny capital gains. Fingers crossed it's enough to keep tax office happy in future too :D",
                                            "author": "EstrellaDulce",
                                            "id": "gpks0ai",
                                            "parent_id": "t1_gpff7ob",
                                            "score": 2,
                                            "created_utc": 1614804618.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "My kind of SD...🥰😁",
            "author": "ShaArt5",
            "id": "gp8mrvx",
            "parent_id": "t1_gp8mh3h",
            "score": 3,
            "created_utc": 1614553169.0,
            "replies": []
        },
        {
            "body": "That's lifetime, not per year.",
            "author": "Y_4Z44",
            "id": "gp81dop",
            "parent_id": "t1_gp817np",
            "score": 1,
            "created_utc": 1614544977.0,
            "replies": []
        },
        {
            "body": "> The 11.7 million is the estate tax exemption\n\nNot sure what your point is here. The estate tax is a tax on property transferred *after someone is deceased*. The \"gift tax\" is a tax levied on gifts *while someone is alive*. They are two separate and distinct things. We're not talking about estate taxes here.",
            "author": "Y_4Z44",
            "id": "gp9tnku",
            "parent_id": "t1_gp9izr6",
            "score": 4,
            "created_utc": 1614578149.0,
            "replies": [
                {
                    "body": "If you are in a situation where the lifetime exclusion is going to apply to your estate, I hope you can improve your understanding of how this works.\n\nu/beach_sd has been exactly on point. The estate tax exemption *is* the lifetime gift tax exemption. In the eyes of the IRS, your remaining estate when you pass is a giant gift to your heir (to be taxed accordingly).",
                    "author": "SD_in_training",
                    "id": "gpfw8o3",
                    "parent_id": "t1_gp9tnku",
                    "score": -1,
                    "created_utc": 1614709272.0,
                    "replies": [
                        {
                            "body": "And that is *wholly irrelevant* to the subject under discussion in this thread. The post was about living people in SRs, not what happens to an SD's estate when he passes. Thus my questioning about his point. I'm not arguing he's incorrect, but that whatever \"point\" he thinks he's making is entirely irrelevant to the subject of the OP's post.",
                            "author": "Y_4Z44",
                            "id": "gpfwsax",
                            "parent_id": "t1_gpfw8o3",
                            "score": 2,
                            "created_utc": 1614709507.0,
                            "replies": [
                                {
                                    "body": "I would expect that real live SDs in SRs currently would be interested in an accurate understanding of how giving gifts may impact what they leave to their heirs.\n\nSeems relevant to me, but we can disagree.",
                                    "author": "SD_in_training",
                                    "id": "gpfyg9f",
                                    "parent_id": "t1_gpfwsax",
                                    "score": 0,
                                    "created_utc": 1614710221.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "zelle varies depending on the bank you use",
            "author": "sucRoseToTheOccasion",
            "id": "gp95tvz",
            "parent_id": "t1_gp8bhzu",
            "score": 3,
            "created_utc": 1614563318.0,
            "replies": []
        },
        {
            "body": "Aww.. 😊",
            "author": "SwimmingInSugar",
            "id": "gpeyt1w",
            "parent_id": "t1_gpbc7db",
            "score": 2,
            "created_utc": 1614694089.0,
            "replies": []
        },
        {
            "body": "I have an Android. And sure! I think I'm using two separate email accounts. I'll check in the meantime.\nUPDATE: That was faster than I thought. :) Yeah, I'm using two separate email accounts. One for friends and family, one for randos. Everything's private on the latter.",
            "author": "CodiKo",
            "id": "gp9c1k9",
            "parent_id": "t1_gp9bw2v",
            "score": 2,
            "created_utc": 1614566808.0,
            "replies": [
                {
                    "body": "That is so cool! So you have access to both of these Venmo accounts on one phone? Do you just login or out between the two to access them? Just trying to get an understanding as I’d like to set up a second one as well!",
                    "author": "sizzlepopsun",
                    "id": "gpfjvft",
                    "parent_id": "t1_gp9c1k9",
                    "score": 2,
                    "created_utc": 1614703888.0,
                    "replies": [
                        {
                            "body": "Yeah, I can't be logged into both at the same time. They're under different email addresses. I have 4 different email addresses that I use on a ~daily basis, so I had that option at my disposal. I have three different cash app accounts. Haha",
                            "author": "CodiKo",
                            "id": "gpfm6ov",
                            "parent_id": "t1_gpfjvft",
                            "score": 2,
                            "created_utc": 1614704894.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gpgwhew",
            "parent_id": "t1_gpg2zet",
            "score": 2,
            "created_utc": 1614725010.0,
            "replies": [
                {
                    "body": "That makes sense, good points. \n\nAnd as you probably know, the IRS (at the audit stage) isn't necessarily going to conform to case law standards. \n\nAnd it works in both directions: I have seen the IRS \\*under\\*-assess a taxpayer what they could have assessed, based on the IRS agent's ignorance of even the basic tax regs (let alone case law). \n\nSo I guess it comes down to basic risk management. Is it really worth it for a SB to pay (including FICA) approx 35% taxes, to avoid an adverse outcome from an audit, which has about a 1% annual chance of happening? \n\nMaybe, maybe not. If we're talking big $ for a SB, I would take a close look at the case law on gifts, quid pro quo, and the various factors that determine gifts versus \"compensation\", in various types of payment scenarios. I'm not convinced that it's as black-and-white as that CPA makes it out to be.\n\nAnd then, depending on what the case law shows, if the SB can make a good faith argument that the gift $ are non-taxable, the SB should disclose all bank account data to a tax lawyer, and have that lawyer prepare the return and sign-off on it.",
                    "author": "Nomad_Bill",
                    "id": "gpgzmmv",
                    "parent_id": "t1_gpgwhew",
                    "score": 1,
                    "created_utc": 1614726535.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "gph0qg5",
                            "parent_id": "t1_gpgzmmv",
                            "score": 1,
                            "created_utc": 1614727087.0,
                            "replies": [
                                {
                                    "body": "Believe it or not, that advice isn't that far from the truth. \n\nThe most error-prone \"professionals\" I have ever dealt with, are lawyers and accountants. I have spent countless hours and $, cleaning up their messes.\n\nAt this point, I do most of my tax planning, and tax returns, on my own. When I have tough questions, I 'crowdsource' them in online forums. And I never take any lawyer's or accountant's advice at face-value, and on high-risk issues, I get 2nd and 3rd opinions.",
                                    "author": "Nomad_Bill",
                                    "id": "gph2882",
                                    "parent_id": "t1_gph0qg5",
                                    "score": 1,
                                    "created_utc": 1614727843.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "**ExExpectations** , kminder 4 years on [**28-Feb-2025 22:59Z**](https://www.reminddit.com/time?dt=2025-02-28 22:59:57&reminder_id=326d39cc13b44cebae1078cc8ff141d3&subreddit=sugarlifestyleforum)\n\n> [**sugarlifestyleforum/Sbsd_105_ppm_allowance_benjis_digital_money**](/r/sugarlifestyleforum/comments/lupi2v/sbsd_105_ppm_allowance_benjis_digital_money/gp8mtzd/?context=3)\n\n> I doubt it. Wanna do a bet?!\n\n[**CLICK HERE**](https://reddit.com/message/compose/?to=remindditbot&subject=Reminder%20from%20Link&message=your_message%0Akminder%202025-02-28T22%3A59%3A57%0A%0A%0A%0A---Server%20settings%20below.%20Do%20not%20change---%0A%0Apermalink%21%20%2Fr%2Fsugarlifestyleforum%2Fcomments%2Flupi2v%2Fsbsd_105_ppm_allowance_benjis_digital_money%2Fgp8mtzd%2F) to also be reminded. Thread has 1 reminder.\n\n^(OP can )[^(**Delete reminder and comment, Set timezone, and more here**)](https://www.reminddit.com/time?dt=2025-02-28 22:59:57&reminder_id=326d39cc13b44cebae1078cc8ff141d3&subreddit=sugarlifestyleforum)\n\n\n\n*****\n\n[**Reminddit**](https://www.reminddit.com) · [Create Reminder](https://reddit.com/message/compose/?to=remindditbot&subject=Reminder&message=your_message%0A%0Akminder%20time_or_time_from_now) · [Your Reminders](https://reddit.com/message/compose/?to=remindditbot&subject=List%20Of%20Reminders&message=listReminders%21) · [Fuel Me](https://paypal.me/reminddit)",
            "author": "remindditbot",
            "id": "gp8o3yx",
            "parent_id": "t1_gp8mtzd",
            "score": 4,
            "created_utc": 1614553792.0,
            "replies": []
        },
        {
            "body": "why would you doubt it? Biden wants to decrease it down to $3.5mill. Trump is the one who raised it.\n\nhttps://www.forbes.com/sites/ashleaebeling/2020/10/26/irs-announces-higher-estate-and-gift-tax-limits-for-2021/",
            "author": "sucRoseToTheOccasion",
            "id": "gp96156",
            "parent_id": "t1_gp8mtzd",
            "score": 1,
            "created_utc": 1614563430.0,
            "replies": []
        },
        {
            "body": "Yes, sounds like we had this debate before :-)\n\nYour point is valid. There is a risk to keeping that much cash at home, and not in the bank. I only raise the SAR/forfeiture issue so that a person can make an informed decision, with full knowledge of the risks inherent in each strategy. \n\nAll of this is just basic Risk Management 101.",
            "author": "Nomad_Bill",
            "id": "gpfu0w3",
            "parent_id": "t1_gp9hbxo",
            "score": 2,
            "created_utc": 1614708309.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gpagevf",
            "parent_id": "t1_gp9hbxo",
            "score": 1,
            "created_utc": 1614599150.0,
            "replies": [
                {
                    "body": "I know absolutely nothing about banking regulations in whichever Scandinavian country you're in, so I can't really answer your question. Based on your story though, it seems like the bank would be satisfied if you just said it's a gift again.\n\nOther plausible stories could include having a job that typically pays you in cash/tips, you operate a small business, or that you had some success at the casino... or buying prepaid cards at a grocery store even, but I have no clue how applicable these ideas can be in your country.\n\nIn the US, the typical threshold where the cause for concern comes into play is right around $10K/month. I don't know how much gifts you've been receiving, but for many there isn't too much of a real threat of these issues.",
                    "author": "SD_in_training",
                    "id": "gpaie0i",
                    "parent_id": "t1_gpagevf",
                    "score": 2,
                    "created_utc": 1614600767.0,
                    "replies": [
                        {
                            "body": "Any amount, well below $10k, can trigger a SAR. Millions of SAR's are filed each year, for amounts below $10k.\n\nNor is the $10k threshold that you are speaking of, based on \"per month\". CTR's are based on a per transaction amount... calendar frequency has no affect on CTR's.",
                            "author": "Nomad_Bill",
                            "id": "gpfs9p7",
                            "parent_id": "t1_gpaie0i",
                            "score": 0,
                            "created_utc": 1614707551.0,
                            "replies": [
                                {
                                    "body": "You are correct, but $10K works as a reasonable rule of thumb I think in terms of how much concern a given person should have.\n\nApparent structuring is the classic example of how many SARs get triggered, though a given bank or teller may view other situations as suspicious in their judgment. If the total value of transactions is well below $10K, the relative risk is certainly less to that person, but if they are approaching or above that threshold, they must be significantly more thoughtful.",
                                    "author": "SD_in_training",
                                    "id": "gpfx3wx",
                                    "parent_id": "t1_gpfs9p7",
                                    "score": 2,
                                    "created_utc": 1614709644.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "You'll want to check on the case law in your country's courts, and see how 'civil asset forfeiture' cases are treated. Also look for news items on the same subject. \n\nThe outcomes (and risks) on this issue will vary widely from country to country.",
                    "author": "Nomad_Bill",
                    "id": "gpfslhn",
                    "parent_id": "t1_gpagevf",
                    "score": 1,
                    "created_utc": 1614707691.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "100% agree.",
            "author": "ExExpectations",
            "id": "gp924wm",
            "parent_id": "t1_gp8zniw",
            "score": 2,
            "created_utc": 1614561244.0,
            "replies": []
        },
        {
            "body": "If you pay an allowance in advance...you’re really a noob. Or just a fool.  Do you pay your babysitter in advance?   It’s an exchange. If either party stopped providing....the arrangement would soon end......get real about the concept",
            "author": "Scared_Celebration38",
            "id": "gp9cne9",
            "parent_id": "t1_gp8zniw",
            "score": -1,
            "created_utc": 1614567155.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "gp9fk7o",
                    "parent_id": "t1_gp9cne9",
                    "score": 4,
                    "created_utc": 1614568837.0,
                    "replies": [
                        {
                            "body": "[removed]",
                            "author": null,
                            "id": "gp9fucw",
                            "parent_id": "t1_gp9fk7o",
                            "score": 0,
                            "created_utc": 1614569001.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "gp9fzpq",
                                    "parent_id": "t1_gp9fucw",
                                    "score": 4,
                                    "created_utc": 1614569088.0,
                                    "replies": [
                                        {
                                            "body": "So.....either you are in a sexless SR...or you are lying to yourself about the entire concept....These women WOULD NOT spend time with you without compensation. Please stop with the noble, white knight BS....you are only fooling yourself",
                                            "author": "Scared_Celebration38",
                                            "id": "gp9gb4b",
                                            "parent_id": "t1_gp9fzpq",
                                            "score": 0,
                                            "created_utc": 1614569274.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "It’s my opinion that the OP is advising others how to commit tax fraud.",
            "author": "Scared_Celebration38",
            "id": "gp8mvtc",
            "parent_id": "t1_gp8miil",
            "score": 3,
            "created_utc": 1614553222.0,
            "replies": [
                {
                    "body": "🙄🙄I’m not advising anyone. I’m simply writing what I’ve experienced, researched, know.",
                    "author": "ExExpectations",
                    "id": "gp8pf12",
                    "parent_id": "t1_gp8mvtc",
                    "score": 2,
                    "created_utc": 1614554399.0,
                    "replies": [
                        {
                            "body": ">researched\n\nWealthy man's girlfriend. He's going to give her jewelry, clothes, pay her rent, give her money so she has less stress on her life. He's happy when she's happy. If a wealthy man shared nothing, most people would think that out of the norm and call him a cheapskate. I would say it's somewhat a societal expectation. OTOH, if you are PPMing and get 2 hours of sex and do nothing else, there may be an argument for pay for service. But there's no market value on a date to a hookah bar, or going out to dinner, or a museum... when ppm is given whether intimate or not - vs pps. But even pps is arguably OK since there's 'fuck buddies' and fwb's who hook up and never go on dates. Last I checked there's no published price chart for having a girlfriend.",
                            "author": "bluelunarmonkey",
                            "id": "gpb7jjn",
                            "parent_id": "t1_gp8pf12",
                            "score": 3,
                            "created_utc": 1614614933.0,
                            "replies": []
                        },
                        {
                            "body": "More like what you want to believe. Hiding income might be possible but many illegal activities are possible.  Calling a payment for services a “gift” does not make it so",
                            "author": "Scared_Celebration38",
                            "id": "gp8q0au",
                            "parent_id": "t1_gp8pf12",
                            "score": 3,
                            "created_utc": 1614554675.0,
                            "replies": [
                                {
                                    "body": "LOL okay buddy. You do you. My SDs give me gifts and allowance and ppms and they’re all gifts. And yes, wiring large sums through bank accounts too.",
                                    "author": "ExExpectations",
                                    "id": "gp8qog1",
                                    "parent_id": "t1_gp8q0au",
                                    "score": 1,
                                    "created_utc": 1614554998.0,
                                    "replies": [
                                        {
                                            "body": "You can do you, but I believe your interpretation is wrong on the tax issue.  If you or any other SB wants to avoid reporting, that's your choice, but don't tell me based on your research it's correct and a regulator would see it that way.\n\nSaying what you know and telling others to do likewise constitutes advice.",
                                            "author": null,
                                            "id": "gp905hu",
                                            "parent_id": "t1_gp8qog1",
                                            "score": 3,
                                            "created_utc": 1614560116.0,
                                            "replies": [
                                                {
                                                    "body": "Everyone’s got an opinion. Everyone’s got an asshole too.",
                                                    "author": "ExExpectations",
                                                    "id": "gp9110l",
                                                    "parent_id": "t1_gp905hu",
                                                    "score": 2,
                                                    "created_utc": 1614560619.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "You are confusing rules about income and inheritance.  There is no limit on gifts for income tax in the uk.  What you refer is only due to inheritance tax when the gifter dies  If tax is due it comes from the estate not the individual.   There is a small risk that if the person dies and there is no money left in the estate then a gift can be clawed back but this is only likely for very large sums and the amount tapers over the 7years. \n\nIn any case, gifts made out of excess income (income above what the gifter needs for day to day living) are exempt from even inheritance tax.  \n\nSo in the context of a person giving money in a relationship, unless it was a large sum that was not excess income and the person dies soon afterwards, it is completely free of all taxes.  \n\nIn pretty well most cases gifts like sugar are from excess income and therefore exempt from inheritance tax.    \n\nAnyone getting money from me in the uk will never ever need to pay tax of any type.",
            "author": "brit-sd",
            "id": "gpa244t",
            "parent_id": "t1_gp970xh",
            "score": 5,
            "created_utc": 1614585287.0,
            "replies": [
                {
                    "body": "Ah, it's true. You have that funny rule of surplus income being ok to give away tax-free.\n\nBut then, I think for example Ireland limits tax-free gifts to something like 15-20k lifetime, no matter who is the gifter. Germany has also limit of 20k, though I think it's only for 10yrs and per gifter. Sweden does not have gift tax at all nowadays, Finland limits to 5k during 3 years per gifter, Spain and France have nothing tax-free, taxing starts basically from 0.\n\nThe point is that you need to know your local rules. Still haven't seen a country in Europe which would tax the payer like in US. In all countries it is the receiver who pays taxes, and it is important for European SBs to understand that. We mostly have no problem giving out our bank details, which seems to be huge red in the States. However, depending on your country, you might not want money arriving to your bank acc, because it will be noted and you will end up paying taxes.",
                    "author": "EstrellaDulce",
                    "id": "gpamzvu",
                    "parent_id": "t1_gpa244t",
                    "score": 2,
                    "created_utc": 1614604067.0,
                    "replies": [
                        {
                            "body": "So interesting! \n\nSo how do you typically receive your allowance/support? Is it directly deposited into your bank account or is it cash, or digital? \n\nIf it’s deposited into a bank, is it automatically counted as gift?",
                            "author": "ExExpectations",
                            "id": "gpff7ob",
                            "parent_id": "t1_gpamzvu",
                            "score": 1,
                            "created_utc": 1614701834.0,
                            "replies": [
                                {
                                    "body": "Cash. Prefer cash any time so I can deal with it in a way that suits me best.. I do transfers as well, but it's really a special case. Haven't gotten into problems so far, even though they are in USD.. There would jump in the international agreements between countries. Because he is liable to tax as US gifter, in theory the obligation should not be duplicated at my end. I also have him as a resident in my address (signed in notary for his permanent visa), so I could claim it's not a gift, he's only paying his part of the running costs as my life-partner, which would easily be supported by the fact that he always transfers me money 2 days before my rent is due.\n\nI think in all countries, gifts are supposed to be voluntarily reported by the receiver, which obviously never happens for smaller amounts. In reality, you are not going to be checked by anyone as long as one-time transfers are not too big. But well, the risk is there, and really depends on the country.\n\nI'm accountant, so I know my risks and anything I do, I know I will be fully responsible if \"getting caught\". There are things I do voluntarily report, like my tiny capital gains. Fingers crossed it's enough to keep tax office happy in future too :D",
                                    "author": "EstrellaDulce",
                                    "id": "gpks0ai",
                                    "parent_id": "t1_gpff7ob",
                                    "score": 2,
                                    "created_utc": 1614804618.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "If you are in a situation where the lifetime exclusion is going to apply to your estate, I hope you can improve your understanding of how this works.\n\nu/beach_sd has been exactly on point. The estate tax exemption *is* the lifetime gift tax exemption. In the eyes of the IRS, your remaining estate when you pass is a giant gift to your heir (to be taxed accordingly).",
            "author": "SD_in_training",
            "id": "gpfw8o3",
            "parent_id": "t1_gp9tnku",
            "score": -1,
            "created_utc": 1614709272.0,
            "replies": [
                {
                    "body": "And that is *wholly irrelevant* to the subject under discussion in this thread. The post was about living people in SRs, not what happens to an SD's estate when he passes. Thus my questioning about his point. I'm not arguing he's incorrect, but that whatever \"point\" he thinks he's making is entirely irrelevant to the subject of the OP's post.",
                    "author": "Y_4Z44",
                    "id": "gpfwsax",
                    "parent_id": "t1_gpfw8o3",
                    "score": 2,
                    "created_utc": 1614709507.0,
                    "replies": [
                        {
                            "body": "I would expect that real live SDs in SRs currently would be interested in an accurate understanding of how giving gifts may impact what they leave to their heirs.\n\nSeems relevant to me, but we can disagree.",
                            "author": "SD_in_training",
                            "id": "gpfyg9f",
                            "parent_id": "t1_gpfwsax",
                            "score": 0,
                            "created_utc": 1614710221.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "That is so cool! So you have access to both of these Venmo accounts on one phone? Do you just login or out between the two to access them? Just trying to get an understanding as I’d like to set up a second one as well!",
            "author": "sizzlepopsun",
            "id": "gpfjvft",
            "parent_id": "t1_gp9c1k9",
            "score": 2,
            "created_utc": 1614703888.0,
            "replies": [
                {
                    "body": "Yeah, I can't be logged into both at the same time. They're under different email addresses. I have 4 different email addresses that I use on a ~daily basis, so I had that option at my disposal. I have three different cash app accounts. Haha",
                    "author": "CodiKo",
                    "id": "gpfm6ov",
                    "parent_id": "t1_gpfjvft",
                    "score": 2,
                    "created_utc": 1614704894.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "That makes sense, good points. \n\nAnd as you probably know, the IRS (at the audit stage) isn't necessarily going to conform to case law standards. \n\nAnd it works in both directions: I have seen the IRS \\*under\\*-assess a taxpayer what they could have assessed, based on the IRS agent's ignorance of even the basic tax regs (let alone case law). \n\nSo I guess it comes down to basic risk management. Is it really worth it for a SB to pay (including FICA) approx 35% taxes, to avoid an adverse outcome from an audit, which has about a 1% annual chance of happening? \n\nMaybe, maybe not. If we're talking big $ for a SB, I would take a close look at the case law on gifts, quid pro quo, and the various factors that determine gifts versus \"compensation\", in various types of payment scenarios. I'm not convinced that it's as black-and-white as that CPA makes it out to be.\n\nAnd then, depending on what the case law shows, if the SB can make a good faith argument that the gift $ are non-taxable, the SB should disclose all bank account data to a tax lawyer, and have that lawyer prepare the return and sign-off on it.",
            "author": "Nomad_Bill",
            "id": "gpgzmmv",
            "parent_id": "t1_gpgwhew",
            "score": 1,
            "created_utc": 1614726535.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "gph0qg5",
                    "parent_id": "t1_gpgzmmv",
                    "score": 1,
                    "created_utc": 1614727087.0,
                    "replies": [
                        {
                            "body": "Believe it or not, that advice isn't that far from the truth. \n\nThe most error-prone \"professionals\" I have ever dealt with, are lawyers and accountants. I have spent countless hours and $, cleaning up their messes.\n\nAt this point, I do most of my tax planning, and tax returns, on my own. When I have tough questions, I 'crowdsource' them in online forums. And I never take any lawyer's or accountant's advice at face-value, and on high-risk issues, I get 2nd and 3rd opinions.",
                            "author": "Nomad_Bill",
                            "id": "gph2882",
                            "parent_id": "t1_gph0qg5",
                            "score": 1,
                            "created_utc": 1614727843.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I know absolutely nothing about banking regulations in whichever Scandinavian country you're in, so I can't really answer your question. Based on your story though, it seems like the bank would be satisfied if you just said it's a gift again.\n\nOther plausible stories could include having a job that typically pays you in cash/tips, you operate a small business, or that you had some success at the casino... or buying prepaid cards at a grocery store even, but I have no clue how applicable these ideas can be in your country.\n\nIn the US, the typical threshold where the cause for concern comes into play is right around $10K/month. I don't know how much gifts you've been receiving, but for many there isn't too much of a real threat of these issues.",
            "author": "SD_in_training",
            "id": "gpaie0i",
            "parent_id": "t1_gpagevf",
            "score": 2,
            "created_utc": 1614600767.0,
            "replies": [
                {
                    "body": "Any amount, well below $10k, can trigger a SAR. Millions of SAR's are filed each year, for amounts below $10k.\n\nNor is the $10k threshold that you are speaking of, based on \"per month\". CTR's are based on a per transaction amount... calendar frequency has no affect on CTR's.",
                    "author": "Nomad_Bill",
                    "id": "gpfs9p7",
                    "parent_id": "t1_gpaie0i",
                    "score": 0,
                    "created_utc": 1614707551.0,
                    "replies": [
                        {
                            "body": "You are correct, but $10K works as a reasonable rule of thumb I think in terms of how much concern a given person should have.\n\nApparent structuring is the classic example of how many SARs get triggered, though a given bank or teller may view other situations as suspicious in their judgment. If the total value of transactions is well below $10K, the relative risk is certainly less to that person, but if they are approaching or above that threshold, they must be significantly more thoughtful.",
                            "author": "SD_in_training",
                            "id": "gpfx3wx",
                            "parent_id": "t1_gpfs9p7",
                            "score": 2,
                            "created_utc": 1614709644.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "You'll want to check on the case law in your country's courts, and see how 'civil asset forfeiture' cases are treated. Also look for news items on the same subject. \n\nThe outcomes (and risks) on this issue will vary widely from country to country.",
            "author": "Nomad_Bill",
            "id": "gpfslhn",
            "parent_id": "t1_gpagevf",
            "score": 1,
            "created_utc": 1614707691.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gp9fk7o",
            "parent_id": "t1_gp9cne9",
            "score": 4,
            "created_utc": 1614568837.0,
            "replies": [
                {
                    "body": "[removed]",
                    "author": null,
                    "id": "gp9fucw",
                    "parent_id": "t1_gp9fk7o",
                    "score": 0,
                    "created_utc": 1614569001.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "gp9fzpq",
                            "parent_id": "t1_gp9fucw",
                            "score": 4,
                            "created_utc": 1614569088.0,
                            "replies": [
                                {
                                    "body": "So.....either you are in a sexless SR...or you are lying to yourself about the entire concept....These women WOULD NOT spend time with you without compensation. Please stop with the noble, white knight BS....you are only fooling yourself",
                                    "author": "Scared_Celebration38",
                                    "id": "gp9gb4b",
                                    "parent_id": "t1_gp9fzpq",
                                    "score": 0,
                                    "created_utc": 1614569274.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "🙄🙄I’m not advising anyone. I’m simply writing what I’ve experienced, researched, know.",
            "author": "ExExpectations",
            "id": "gp8pf12",
            "parent_id": "t1_gp8mvtc",
            "score": 2,
            "created_utc": 1614554399.0,
            "replies": [
                {
                    "body": ">researched\n\nWealthy man's girlfriend. He's going to give her jewelry, clothes, pay her rent, give her money so she has less stress on her life. He's happy when she's happy. If a wealthy man shared nothing, most people would think that out of the norm and call him a cheapskate. I would say it's somewhat a societal expectation. OTOH, if you are PPMing and get 2 hours of sex and do nothing else, there may be an argument for pay for service. But there's no market value on a date to a hookah bar, or going out to dinner, or a museum... when ppm is given whether intimate or not - vs pps. But even pps is arguably OK since there's 'fuck buddies' and fwb's who hook up and never go on dates. Last I checked there's no published price chart for having a girlfriend.",
                    "author": "bluelunarmonkey",
                    "id": "gpb7jjn",
                    "parent_id": "t1_gp8pf12",
                    "score": 3,
                    "created_utc": 1614614933.0,
                    "replies": []
                },
                {
                    "body": "More like what you want to believe. Hiding income might be possible but many illegal activities are possible.  Calling a payment for services a “gift” does not make it so",
                    "author": "Scared_Celebration38",
                    "id": "gp8q0au",
                    "parent_id": "t1_gp8pf12",
                    "score": 3,
                    "created_utc": 1614554675.0,
                    "replies": [
                        {
                            "body": "LOL okay buddy. You do you. My SDs give me gifts and allowance and ppms and they’re all gifts. And yes, wiring large sums through bank accounts too.",
                            "author": "ExExpectations",
                            "id": "gp8qog1",
                            "parent_id": "t1_gp8q0au",
                            "score": 1,
                            "created_utc": 1614554998.0,
                            "replies": [
                                {
                                    "body": "You can do you, but I believe your interpretation is wrong on the tax issue.  If you or any other SB wants to avoid reporting, that's your choice, but don't tell me based on your research it's correct and a regulator would see it that way.\n\nSaying what you know and telling others to do likewise constitutes advice.",
                                    "author": null,
                                    "id": "gp905hu",
                                    "parent_id": "t1_gp8qog1",
                                    "score": 3,
                                    "created_utc": 1614560116.0,
                                    "replies": [
                                        {
                                            "body": "Everyone’s got an opinion. Everyone’s got an asshole too.",
                                            "author": "ExExpectations",
                                            "id": "gp9110l",
                                            "parent_id": "t1_gp905hu",
                                            "score": 2,
                                            "created_utc": 1614560619.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Ah, it's true. You have that funny rule of surplus income being ok to give away tax-free.\n\nBut then, I think for example Ireland limits tax-free gifts to something like 15-20k lifetime, no matter who is the gifter. Germany has also limit of 20k, though I think it's only for 10yrs and per gifter. Sweden does not have gift tax at all nowadays, Finland limits to 5k during 3 years per gifter, Spain and France have nothing tax-free, taxing starts basically from 0.\n\nThe point is that you need to know your local rules. Still haven't seen a country in Europe which would tax the payer like in US. In all countries it is the receiver who pays taxes, and it is important for European SBs to understand that. We mostly have no problem giving out our bank details, which seems to be huge red in the States. However, depending on your country, you might not want money arriving to your bank acc, because it will be noted and you will end up paying taxes.",
            "author": "EstrellaDulce",
            "id": "gpamzvu",
            "parent_id": "t1_gpa244t",
            "score": 2,
            "created_utc": 1614604067.0,
            "replies": [
                {
                    "body": "So interesting! \n\nSo how do you typically receive your allowance/support? Is it directly deposited into your bank account or is it cash, or digital? \n\nIf it’s deposited into a bank, is it automatically counted as gift?",
                    "author": "ExExpectations",
                    "id": "gpff7ob",
                    "parent_id": "t1_gpamzvu",
                    "score": 1,
                    "created_utc": 1614701834.0,
                    "replies": [
                        {
                            "body": "Cash. Prefer cash any time so I can deal with it in a way that suits me best.. I do transfers as well, but it's really a special case. Haven't gotten into problems so far, even though they are in USD.. There would jump in the international agreements between countries. Because he is liable to tax as US gifter, in theory the obligation should not be duplicated at my end. I also have him as a resident in my address (signed in notary for his permanent visa), so I could claim it's not a gift, he's only paying his part of the running costs as my life-partner, which would easily be supported by the fact that he always transfers me money 2 days before my rent is due.\n\nI think in all countries, gifts are supposed to be voluntarily reported by the receiver, which obviously never happens for smaller amounts. In reality, you are not going to be checked by anyone as long as one-time transfers are not too big. But well, the risk is there, and really depends on the country.\n\nI'm accountant, so I know my risks and anything I do, I know I will be fully responsible if \"getting caught\". There are things I do voluntarily report, like my tiny capital gains. Fingers crossed it's enough to keep tax office happy in future too :D",
                            "author": "EstrellaDulce",
                            "id": "gpks0ai",
                            "parent_id": "t1_gpff7ob",
                            "score": 2,
                            "created_utc": 1614804618.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "And that is *wholly irrelevant* to the subject under discussion in this thread. The post was about living people in SRs, not what happens to an SD's estate when he passes. Thus my questioning about his point. I'm not arguing he's incorrect, but that whatever \"point\" he thinks he's making is entirely irrelevant to the subject of the OP's post.",
            "author": "Y_4Z44",
            "id": "gpfwsax",
            "parent_id": "t1_gpfw8o3",
            "score": 2,
            "created_utc": 1614709507.0,
            "replies": [
                {
                    "body": "I would expect that real live SDs in SRs currently would be interested in an accurate understanding of how giving gifts may impact what they leave to their heirs.\n\nSeems relevant to me, but we can disagree.",
                    "author": "SD_in_training",
                    "id": "gpfyg9f",
                    "parent_id": "t1_gpfwsax",
                    "score": 0,
                    "created_utc": 1614710221.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Yeah, I can't be logged into both at the same time. They're under different email addresses. I have 4 different email addresses that I use on a ~daily basis, so I had that option at my disposal. I have three different cash app accounts. Haha",
            "author": "CodiKo",
            "id": "gpfm6ov",
            "parent_id": "t1_gpfjvft",
            "score": 2,
            "created_utc": 1614704894.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gph0qg5",
            "parent_id": "t1_gpgzmmv",
            "score": 1,
            "created_utc": 1614727087.0,
            "replies": [
                {
                    "body": "Believe it or not, that advice isn't that far from the truth. \n\nThe most error-prone \"professionals\" I have ever dealt with, are lawyers and accountants. I have spent countless hours and $, cleaning up their messes.\n\nAt this point, I do most of my tax planning, and tax returns, on my own. When I have tough questions, I 'crowdsource' them in online forums. And I never take any lawyer's or accountant's advice at face-value, and on high-risk issues, I get 2nd and 3rd opinions.",
                    "author": "Nomad_Bill",
                    "id": "gph2882",
                    "parent_id": "t1_gph0qg5",
                    "score": 1,
                    "created_utc": 1614727843.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Any amount, well below $10k, can trigger a SAR. Millions of SAR's are filed each year, for amounts below $10k.\n\nNor is the $10k threshold that you are speaking of, based on \"per month\". CTR's are based on a per transaction amount... calendar frequency has no affect on CTR's.",
            "author": "Nomad_Bill",
            "id": "gpfs9p7",
            "parent_id": "t1_gpaie0i",
            "score": 0,
            "created_utc": 1614707551.0,
            "replies": [
                {
                    "body": "You are correct, but $10K works as a reasonable rule of thumb I think in terms of how much concern a given person should have.\n\nApparent structuring is the classic example of how many SARs get triggered, though a given bank or teller may view other situations as suspicious in their judgment. If the total value of transactions is well below $10K, the relative risk is certainly less to that person, but if they are approaching or above that threshold, they must be significantly more thoughtful.",
                    "author": "SD_in_training",
                    "id": "gpfx3wx",
                    "parent_id": "t1_gpfs9p7",
                    "score": 2,
                    "created_utc": 1614709644.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[removed]",
            "author": null,
            "id": "gp9fucw",
            "parent_id": "t1_gp9fk7o",
            "score": 0,
            "created_utc": 1614569001.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "gp9fzpq",
                    "parent_id": "t1_gp9fucw",
                    "score": 4,
                    "created_utc": 1614569088.0,
                    "replies": [
                        {
                            "body": "So.....either you are in a sexless SR...or you are lying to yourself about the entire concept....These women WOULD NOT spend time with you without compensation. Please stop with the noble, white knight BS....you are only fooling yourself",
                            "author": "Scared_Celebration38",
                            "id": "gp9gb4b",
                            "parent_id": "t1_gp9fzpq",
                            "score": 0,
                            "created_utc": 1614569274.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": ">researched\n\nWealthy man's girlfriend. He's going to give her jewelry, clothes, pay her rent, give her money so she has less stress on her life. He's happy when she's happy. If a wealthy man shared nothing, most people would think that out of the norm and call him a cheapskate. I would say it's somewhat a societal expectation. OTOH, if you are PPMing and get 2 hours of sex and do nothing else, there may be an argument for pay for service. But there's no market value on a date to a hookah bar, or going out to dinner, or a museum... when ppm is given whether intimate or not - vs pps. But even pps is arguably OK since there's 'fuck buddies' and fwb's who hook up and never go on dates. Last I checked there's no published price chart for having a girlfriend.",
            "author": "bluelunarmonkey",
            "id": "gpb7jjn",
            "parent_id": "t1_gp8pf12",
            "score": 3,
            "created_utc": 1614614933.0,
            "replies": []
        },
        {
            "body": "More like what you want to believe. Hiding income might be possible but many illegal activities are possible.  Calling a payment for services a “gift” does not make it so",
            "author": "Scared_Celebration38",
            "id": "gp8q0au",
            "parent_id": "t1_gp8pf12",
            "score": 3,
            "created_utc": 1614554675.0,
            "replies": [
                {
                    "body": "LOL okay buddy. You do you. My SDs give me gifts and allowance and ppms and they’re all gifts. And yes, wiring large sums through bank accounts too.",
                    "author": "ExExpectations",
                    "id": "gp8qog1",
                    "parent_id": "t1_gp8q0au",
                    "score": 1,
                    "created_utc": 1614554998.0,
                    "replies": [
                        {
                            "body": "You can do you, but I believe your interpretation is wrong on the tax issue.  If you or any other SB wants to avoid reporting, that's your choice, but don't tell me based on your research it's correct and a regulator would see it that way.\n\nSaying what you know and telling others to do likewise constitutes advice.",
                            "author": null,
                            "id": "gp905hu",
                            "parent_id": "t1_gp8qog1",
                            "score": 3,
                            "created_utc": 1614560116.0,
                            "replies": [
                                {
                                    "body": "Everyone’s got an opinion. Everyone’s got an asshole too.",
                                    "author": "ExExpectations",
                                    "id": "gp9110l",
                                    "parent_id": "t1_gp905hu",
                                    "score": 2,
                                    "created_utc": 1614560619.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "So interesting! \n\nSo how do you typically receive your allowance/support? Is it directly deposited into your bank account or is it cash, or digital? \n\nIf it’s deposited into a bank, is it automatically counted as gift?",
            "author": "ExExpectations",
            "id": "gpff7ob",
            "parent_id": "t1_gpamzvu",
            "score": 1,
            "created_utc": 1614701834.0,
            "replies": [
                {
                    "body": "Cash. Prefer cash any time so I can deal with it in a way that suits me best.. I do transfers as well, but it's really a special case. Haven't gotten into problems so far, even though they are in USD.. There would jump in the international agreements between countries. Because he is liable to tax as US gifter, in theory the obligation should not be duplicated at my end. I also have him as a resident in my address (signed in notary for his permanent visa), so I could claim it's not a gift, he's only paying his part of the running costs as my life-partner, which would easily be supported by the fact that he always transfers me money 2 days before my rent is due.\n\nI think in all countries, gifts are supposed to be voluntarily reported by the receiver, which obviously never happens for smaller amounts. In reality, you are not going to be checked by anyone as long as one-time transfers are not too big. But well, the risk is there, and really depends on the country.\n\nI'm accountant, so I know my risks and anything I do, I know I will be fully responsible if \"getting caught\". There are things I do voluntarily report, like my tiny capital gains. Fingers crossed it's enough to keep tax office happy in future too :D",
                    "author": "EstrellaDulce",
                    "id": "gpks0ai",
                    "parent_id": "t1_gpff7ob",
                    "score": 2,
                    "created_utc": 1614804618.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I would expect that real live SDs in SRs currently would be interested in an accurate understanding of how giving gifts may impact what they leave to their heirs.\n\nSeems relevant to me, but we can disagree.",
            "author": "SD_in_training",
            "id": "gpfyg9f",
            "parent_id": "t1_gpfwsax",
            "score": 0,
            "created_utc": 1614710221.0,
            "replies": []
        },
        {
            "body": "Believe it or not, that advice isn't that far from the truth. \n\nThe most error-prone \"professionals\" I have ever dealt with, are lawyers and accountants. I have spent countless hours and $, cleaning up their messes.\n\nAt this point, I do most of my tax planning, and tax returns, on my own. When I have tough questions, I 'crowdsource' them in online forums. And I never take any lawyer's or accountant's advice at face-value, and on high-risk issues, I get 2nd and 3rd opinions.",
            "author": "Nomad_Bill",
            "id": "gph2882",
            "parent_id": "t1_gph0qg5",
            "score": 1,
            "created_utc": 1614727843.0,
            "replies": []
        },
        {
            "body": "You are correct, but $10K works as a reasonable rule of thumb I think in terms of how much concern a given person should have.\n\nApparent structuring is the classic example of how many SARs get triggered, though a given bank or teller may view other situations as suspicious in their judgment. If the total value of transactions is well below $10K, the relative risk is certainly less to that person, but if they are approaching or above that threshold, they must be significantly more thoughtful.",
            "author": "SD_in_training",
            "id": "gpfx3wx",
            "parent_id": "t1_gpfs9p7",
            "score": 2,
            "created_utc": 1614709644.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gp9fzpq",
            "parent_id": "t1_gp9fucw",
            "score": 4,
            "created_utc": 1614569088.0,
            "replies": [
                {
                    "body": "So.....either you are in a sexless SR...or you are lying to yourself about the entire concept....These women WOULD NOT spend time with you without compensation. Please stop with the noble, white knight BS....you are only fooling yourself",
                    "author": "Scared_Celebration38",
                    "id": "gp9gb4b",
                    "parent_id": "t1_gp9fzpq",
                    "score": 0,
                    "created_utc": 1614569274.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "LOL okay buddy. You do you. My SDs give me gifts and allowance and ppms and they’re all gifts. And yes, wiring large sums through bank accounts too.",
            "author": "ExExpectations",
            "id": "gp8qog1",
            "parent_id": "t1_gp8q0au",
            "score": 1,
            "created_utc": 1614554998.0,
            "replies": [
                {
                    "body": "You can do you, but I believe your interpretation is wrong on the tax issue.  If you or any other SB wants to avoid reporting, that's your choice, but don't tell me based on your research it's correct and a regulator would see it that way.\n\nSaying what you know and telling others to do likewise constitutes advice.",
                    "author": null,
                    "id": "gp905hu",
                    "parent_id": "t1_gp8qog1",
                    "score": 3,
                    "created_utc": 1614560116.0,
                    "replies": [
                        {
                            "body": "Everyone’s got an opinion. Everyone’s got an asshole too.",
                            "author": "ExExpectations",
                            "id": "gp9110l",
                            "parent_id": "t1_gp905hu",
                            "score": 2,
                            "created_utc": 1614560619.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Cash. Prefer cash any time so I can deal with it in a way that suits me best.. I do transfers as well, but it's really a special case. Haven't gotten into problems so far, even though they are in USD.. There would jump in the international agreements between countries. Because he is liable to tax as US gifter, in theory the obligation should not be duplicated at my end. I also have him as a resident in my address (signed in notary for his permanent visa), so I could claim it's not a gift, he's only paying his part of the running costs as my life-partner, which would easily be supported by the fact that he always transfers me money 2 days before my rent is due.\n\nI think in all countries, gifts are supposed to be voluntarily reported by the receiver, which obviously never happens for smaller amounts. In reality, you are not going to be checked by anyone as long as one-time transfers are not too big. But well, the risk is there, and really depends on the country.\n\nI'm accountant, so I know my risks and anything I do, I know I will be fully responsible if \"getting caught\". There are things I do voluntarily report, like my tiny capital gains. Fingers crossed it's enough to keep tax office happy in future too :D",
            "author": "EstrellaDulce",
            "id": "gpks0ai",
            "parent_id": "t1_gpff7ob",
            "score": 2,
            "created_utc": 1614804618.0,
            "replies": []
        },
        {
            "body": "So.....either you are in a sexless SR...or you are lying to yourself about the entire concept....These women WOULD NOT spend time with you without compensation. Please stop with the noble, white knight BS....you are only fooling yourself",
            "author": "Scared_Celebration38",
            "id": "gp9gb4b",
            "parent_id": "t1_gp9fzpq",
            "score": 0,
            "created_utc": 1614569274.0,
            "replies": []
        },
        {
            "body": "You can do you, but I believe your interpretation is wrong on the tax issue.  If you or any other SB wants to avoid reporting, that's your choice, but don't tell me based on your research it's correct and a regulator would see it that way.\n\nSaying what you know and telling others to do likewise constitutes advice.",
            "author": null,
            "id": "gp905hu",
            "parent_id": "t1_gp8qog1",
            "score": 3,
            "created_utc": 1614560116.0,
            "replies": [
                {
                    "body": "Everyone’s got an opinion. Everyone’s got an asshole too.",
                    "author": "ExExpectations",
                    "id": "gp9110l",
                    "parent_id": "t1_gp905hu",
                    "score": 2,
                    "created_utc": 1614560619.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Everyone’s got an opinion. Everyone’s got an asshole too.",
            "author": "ExExpectations",
            "id": "gp9110l",
            "parent_id": "t1_gp905hu",
            "score": 2,
            "created_utc": 1614560619.0,
            "replies": []
        }
    ]
}