{
    "title": "LKS leaving will be an eventual boon to the other members",
    "post_id": "o6kblg",
    "post_url": "https://www.reddit.com/r/runningman/comments/o6kblg/lks_leaving_will_be_an_eventual_boon_to_the_other/",
    "author": "ScorpiusDX",
    "body": "LKS is a variety monster. We all know that. He's been blessed by the variety gods and gives 110% every time. He's got impeccable timing and unnaturally bad luck, scripted or not. His presence dominates the show and thus he ends up getting most of the screen time.\n\nHowever, that is also a problem in itself. He dominated the screen time. He gets the punishment many times because he puts himself in that position for entertainment's sake. In a show that was crowded enough with 8 members, LKS was a mainstay in screen time consistency. Now that he's gone, there's gonna be a lot of \"it's not the same without LKS\" and \"how can the show survive without LKS?\" Yes, absolutely it's different now. But I'd say it's a disservice to the other members if we all get hung up about the show losing its mojo without LKS.\n\nHis absence now allows for completely new dynamics. Bringing in JSM and YSC refreshed some stuff but the show's crew dynamic was still fairly consistent because LKS was one of the central pillars of the show. Other members will now be able to flourish even more and step their game up. We got a brief glimpse of this when he was out during his recovery. This was also mentioned in the latest episode, him being gone means SBS doesn't need to pay him. This allows for RM to have a bigger budget unless SBS decides to just withhold that money.\n\nLKS's absence will be felt for a long time but the crew and the show will have a new dynamic that will let them flourish even more.",
    "url": "https://www.reddit.com/r/runningman/comments/o6kblg/lks_leaving_will_be_an_eventual_boon_to_the_other/",
    "score": 267,
    "upvote_ratio": 0.96,
    "created_utc": 1624477314.0,
    "num_comments": 69,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "Viki has the very first episodes of RM up and the funniest member in those episodes wasnt Kwang Soo...it was Seok Jin.\n\nEven with this latest episode, while everyone looked somber, Seok Jin remained entertaining.\n\nRM can be super funny again despite the loss of KS.",
            "author": "knawmeen",
            "id": "h2um4sh",
            "parent_id": "t3_o6kblg",
            "score": 71,
            "created_utc": 1624507960.0,
            "replies": [
                {
                    "body": "Seok Jin super underrated. He carried the first few episode of RM especially the first one along with the usual variety veterans",
                    "author": "ItsKaZing",
                    "id": "h2velgm",
                    "parent_id": "t1_h2um4sh",
                    "score": 40,
                    "created_utc": 1624532305.0,
                    "replies": []
                },
                {
                    "body": "Yessss I love Kwang Soo but Suk Jin is my favorite member!!!",
                    "author": "BoxStrange3765",
                    "id": "h5w19fr",
                    "parent_id": "t1_h2um4sh",
                    "score": 2,
                    "created_utc": 1626797404.0,
                    "replies": []
                },
                {
                    "body": "Totally agree with your last sentence. \n\nWhen Gary left, it left a sour taste because he was so funny. Not in your face or over the top funny but a very unique way of funny. Doesn't come often but when it does, he has you laughing out loud \n\nLKS in my opinion isn't a unique character. Can could easily be replaced. I mean since, Si Chan has come in he already lost the Maknae role and just get bullied by Jae Suk mainly. His traitor role is overplayed and you can see it in the other members faces when he does it too much. \n\nI'm looking forward to the new look of Running man. I stopped watching for ages now as it got stale and only watched funny parts from YouTube.",
                    "author": "Dunkiez",
                    "id": "h2vj8u1",
                    "parent_id": "t1_h2um4sh",
                    "score": 4,
                    "created_utc": 1624535818.0,
                    "replies": [
                        {
                            "body": "Why did you get downvoted? Seems like any statement which is not a positive sentiment towards a member is getting downvoted a lot",
                            "author": "ALEKHYA8",
                            "id": "h2wnnf2",
                            "parent_id": "t1_h2vj8u1",
                            "score": 6,
                            "created_utc": 1624555496.0,
                            "replies": [
                                {
                                    "body": "People love LKS here and they down voted anyone who doesn't share their love for him. Seen this happen so many times.",
                                    "author": "Dunkiez",
                                    "id": "h2wzjm2",
                                    "parent_id": "t1_h2wnnf2",
                                    "score": 5,
                                    "created_utc": 1624560757.0,
                                    "replies": [
                                        {
                                            "body": "Yeah I love him too. My flair is about him. But people may have different opinions",
                                            "author": "ALEKHYA8",
                                            "id": "h2x3847",
                                            "parent_id": "t1_h2wzjm2",
                                            "score": 3,
                                            "created_utc": 1624562413.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "h2yt4ee",
                            "parent_id": "t1_h2vj8u1",
                            "score": 2,
                            "created_utc": 1624600387.0,
                            "replies": [
                                {
                                    "body": "No. It wasn't because of LKS that I stopped watching. After watching religiously for so many years it just got a bit stale and life just got busier.\n\nI would still watch the episodes if there was good guests or when my brother recommended one as he was still watching them.",
                                    "author": "Dunkiez",
                                    "id": "h2z2svh",
                                    "parent_id": "t1_h2yt4ee",
                                    "score": 4,
                                    "created_utc": 1624608628.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I absolutely agree with you.   \nSechan has been AMAZING and I think that's not even enough to praise him. It was obvious from the start Somin would be a fantastic addition but man, Sechan is flaming hot recently and not to mention KJK has been hilarious as well.  \n\n\nI know that adding a new face to the cast is a terrible idea but if they do plan to add a new face to RM, I hope it would be one from the family project. That cast was PERFECT.",
            "author": "faralei",
            "id": "h2tfeel",
            "parent_id": "t3_o6kblg",
            "score": 97,
            "created_utc": 1624485094.0,
            "replies": [
                {
                    "body": "Yeah i agree, i noticed KJK are funnier during LKS's last episodes and after he's gone. They really trying to step up their game!",
                    "author": "Kuasawan-Murbawan",
                    "id": "h2wpcrk",
                    "parent_id": "t1_h2tfeel",
                    "score": 4,
                    "created_utc": 1624556232.0,
                    "replies": []
                },
                {
                    "body": "I dunno, Se Chan's been so so for me with some good moves here and there. But yeah, not particularly amazing. Edit: So I guess I'm gonna get even more downvoted with this, but he's a decent comedian who  had a stroke of luck and had some shining moments to his credit. But he isn't as amazing as you claim to be, guys, sorry.",
                    "author": "hyouka09",
                    "id": "h2w4lpg",
                    "parent_id": "t1_h2tfeel",
                    "score": 0,
                    "created_utc": 1624547117.0,
                    "replies": [
                        {
                            "body": "That's cus he's been shadowed by the master comedian kwang soo ;)",
                            "author": "tacocheeze",
                            "id": "h2xt0af",
                            "parent_id": "t1_h2w4lpg",
                            "score": 3,
                            "created_utc": 1624579256.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "For real! Also it really helps that Se chan is close to most of the members even outside of running man bc i always see him hanging out with jong kook and appearing on other shows w some of the members of running man...the haha/kjk/ysc trio is p close in and out of rm",
                    "author": "tacocheeze",
                    "id": "h2xsxqv",
                    "parent_id": "t1_h2tfeel",
                    "score": 1,
                    "created_utc": 1624579218.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I know I will get downvoted for this but knowing LKS leaving the show was a win-win situation for him and the program. For the past few episodes the noticeable awkwardness between him and JSM is really hard to watch. After people here in reddit started to notice it, I always anticipate their interactions every new weekly episode and hoping that it will improve. In his last few episodes their interaction was literally near zero. I'm a fan of the show and all of the members but I hate to see them giving their all to make us laugh while I think their could be some kind of beef going on between the members. Dont get me wrong I don't hate him or anything but him leaving was also a career move for him. Recently he won best supporting actor If I remember correctly and this might be his stepping stone for more serious/big roles and only hoping the best for him in the future. 11 years and 559 episodes is already enough content for an actor who works at a comedy variety show. \n\nHoping in the future fans won't bug him that he should return if his \"ankles\" will get better. Cannot believe so many people are really naive that he is hurt while YJS rides his back and the members never once mentioned  his injured \"ankles\".",
            "author": "nitsnits345",
            "id": "h2t5y3v",
            "parent_id": "t3_o6kblg",
            "score": 122,
            "created_utc": 1624480781.0,
            "replies": [
                {
                    "body": "I mean, in the end, it is his life and his career. He does not owe anyone his own future. It definitely seems like a career move, which I totally respect. I just feel sad that he knows that the fans would drive him insane if he didn't announce the reason to be his ankles. \n\nLKS will always be the best boi and everyone in the whole world will always remember him to be. He did his job extremely well, but even the most devoted employees would eventually choose to follow their own path. \n\nAlthough they joke, it has never not been apparent just how much LKS loves acting. He has never picked any variety shows except RM and Busted (And I suspect his involvement with Busted was a combination of YJS's presence and Netflix money). He constantly picks challenging roles and experimental projects. In spite of his ambitions, he still remained steadfast with the RM cast and crew for eleven whole years, internal issues notwithstanding. So yeah, this is a happy retirement for the MVP of this insane production.",
                    "author": "Why_Must_You_Be",
                    "id": "h2tk694",
                    "parent_id": "t1_h2t5y3v",
                    "score": 60,
                    "created_utc": 1624487462.0,
                    "replies": [
                        {
                            "body": "I just love that last line: \"MVP of this insane production.\"",
                            "author": "Crashingshores",
                            "id": "h2tqd2x",
                            "parent_id": "t1_h2tk694",
                            "score": 17,
                            "created_utc": 1624490679.0,
                            "replies": []
                        },
                        {
                            "body": "I’ll get downvoted for this but as much as I love Kwangsoo, I can’t picture the Korean audience seeing him as a lead actor. I don’t foresee him being a lead actor due to a celebrities popularity in acting being based on looks. I mean when I think of Kang Ha Neul, Song Joong Ki, Lee Dong Wook, Hyun Bin, I don’t see Kwang Soo mentally in these guys’s tier. Do supporting actors get the same recognition? Idk. Runningman is popular overseas but not in Korea so it’s even harder for him to get recognition because no ones going to watch a drama JUST because Kwangsoo is in it.",
                            "author": "MigukOppa",
                            "id": "h2tya01",
                            "parent_id": "t1_h2tk694",
                            "score": 13,
                            "created_utc": 1624494874.0,
                            "replies": [
                                {
                                    "body": "But he doesn't have to be popular to be a good actor though. He doesn't need to be a Song Joongki, as long as he enjoys his work. He has repeatedly mentioned that he loves acting. He is good enough to keep getting prominent roles and that is success in itself no? \n\nNot gonna downvote but it is a little presumptuous to measure success based on popularity. Oh Jung Se, supporting actor in Its okay to not be okay, got all the accolades and the public love. The baeksang best actor award wasn't given to Song Joongki for Vincenzo. Despite both Vincenzo and Joongki's popularity, the award was given to Shin Ha-Kyun of Beyond Evil, an almost 50 year old seasoned actor. Even outside of Korea, Parasite is unarguably the most popular Korean film, and you can't really attribute the success of the standout actors like Song Kang Ho and Lee Jeong-Eun to their appearance. \n\nPoint is Kwangsoo does not need to be popular he only need to be a good actor attached to interesting highbudget projects. He is popular enough to get those projects. You never know, he could star, maybe even as a supporting role, in a film as big as Parasite. He wants to pick projects that could challenge him to be characters beyond the Girin character he created for RM. And how can you blame the guy for not wanted to be pigeonholed in a single role for the rest of his life.",
                                    "author": "Why_Must_You_Be",
                                    "id": "h2u2h6s",
                                    "parent_id": "t1_h2tya01",
                                    "score": 70,
                                    "created_utc": 1624497129.0,
                                    "replies": []
                                },
                                {
                                    "body": "\"Running Man is not popular in Korea\" LOL every Koreans know RM is existing. It is a show running for eleven freaking years. It's just the viewership rating isnt' the same as before. But hello? You could ask anyone in Korea and they could name every member of it.",
                                    "author": "Efficient-Aside-8919",
                                    "id": "h2vjmk0",
                                    "parent_id": "t1_h2tya01",
                                    "score": 9,
                                    "created_utc": 1624536075.0,
                                    "replies": [
                                        {
                                            "body": "Doesn’t mean it’s popular… I have a friend from Seoul in market analytics. Runningman is for international fans and not really for Koreans.",
                                            "author": "MigukOppa",
                                            "id": "h2vurwp",
                                            "parent_id": "t1_h2vjmk0",
                                            "score": -4,
                                            "created_utc": 1624542507.0,
                                            "replies": [
                                                {
                                                    "body": "That's just one guy.... yet all my Korean friends know Running Man and have watched it since they were kids.",
                                                    "author": "tacocheeze",
                                                    "id": "h2xt77l",
                                                    "parent_id": "t1_h2vurwp",
                                                    "score": 6,
                                                    "created_utc": 1624579362.0,
                                                    "replies": []
                                                },
                                                {
                                                    "body": "[removed]",
                                                    "author": null,
                                                    "id": "h2x70cu",
                                                    "parent_id": "t1_h2vurwp",
                                                    "score": 3,
                                                    "created_utc": 1624564125.0,
                                                    "replies": [
                                                        {
                                                            "body": "[removed]",
                                                            "author": null,
                                                            "id": "h2xtixm",
                                                            "parent_id": "t1_h2x70cu",
                                                            "score": 4,
                                                            "created_utc": 1624579538.0,
                                                            "replies": []
                                                        },
                                                        {
                                                            "body": "[removed]",
                                                            "author": null,
                                                            "id": "h2xa6w5",
                                                            "parent_id": "t1_h2x70cu",
                                                            "score": -1,
                                                            "created_utc": 1624565572.0,
                                                            "replies": [
                                                                {
                                                                    "body": "[removed]",
                                                                    "author": null,
                                                                    "id": "h2z2n48",
                                                                    "parent_id": "t1_h2xa6w5",
                                                                    "score": 1,
                                                                    "created_utc": 1624608476.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "[removed]",
                                                                            "author": null,
                                                                            "id": "h2znbzj",
                                                                            "parent_id": "t1_h2z2n48",
                                                                            "score": -1,
                                                                            "created_utc": 1624625450.0,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "You mean except for the times he's already been a lead actor? \n\nIf Ahn Jae Hong can be a lead actor, LKS certainly can. It's just not going to be for traditional romantic main lead roles",
                                    "author": "xander_yi",
                                    "id": "h38dwr7",
                                    "parent_id": "t1_h2tya01",
                                    "score": 2,
                                    "created_utc": 1624815959.0,
                                    "replies": []
                                },
                                {
                                    "body": "Yep but Kwangsoo seems to go for more inventive and experimental roles rather than typical drama lead. So I think he can still find success. People like Song Kang Ho are still finding success due to their acting ability even if they don't fit into the \"typical\" drama lead look - probably because that kind of job is not even on their radar in the first place",
                                    "author": "justahalfling",
                                    "id": "h2vf5wb",
                                    "parent_id": "t1_h2tya01",
                                    "score": 1,
                                    "created_utc": 1624532773.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Yup. Pretty sure it’s a career move. Staying in RM will keep him typecast in the same character he’s played. As an actor he’s probably looking for a serious MC role.",
                    "author": "bpdizle",
                    "id": "h2tcw7d",
                    "parent_id": "t1_h2t5y3v",
                    "score": 47,
                    "created_utc": 1624483918.0,
                    "replies": []
                },
                {
                    "body": "Yea i have the same thought, i know being an actor some sort of a dream/goal for him and I think the time is right before he gets too old. This is like his prime years so he need to do something.",
                    "author": "luckypanda95",
                    "id": "h2tu4qj",
                    "parent_id": "t1_h2t5y3v",
                    "score": 13,
                    "created_utc": 1624492699.0,
                    "replies": []
                },
                {
                    "body": "Not sure what's the real reason but I never really believed it was his ankles. That is just a great and convenient reason to avoid controversies. If it was really an issue, it would have been dealt with much earlier, I mean why would he even return to the show with crutches during one of the episodes. I truly believe the PD will not push him to return if he's not 100%. And it's nearly 1.5 to 2 years too.\n\nI respect his decision whatever the reasons. He has given his all, 110%. Many times he's on verge of winning, but decided to gamble and lose all etc to make it more entertaining.\n\nHope he does well.",
                    "author": "kaktusmint",
                    "id": "h2tweqm",
                    "parent_id": "t1_h2t5y3v",
                    "score": 22,
                    "created_utc": 1624493887.0,
                    "replies": []
                },
                {
                    "body": "ya our bb won a baeksang award!! Honestly I feel like he's just doing what Joong ki is doing, focusing on his acting career. he himself said he sees himself more as an actor than a comedian/variety star. if he's pouring this much attention and care into RM can you imagine the level of care he puts into his acting career?",
                    "author": "catsandtings",
                    "id": "h2td26u",
                    "parent_id": "t1_h2t5y3v",
                    "score": 21,
                    "created_utc": 1624483997.0,
                    "replies": []
                },
                {
                    "body": "i never noticed the awkwardness. since when did that happen? and did something happen?",
                    "author": "tinyglow",
                    "id": "h2u0lam",
                    "parent_id": "t1_h2t5y3v",
                    "score": 19,
                    "created_utc": 1624496110.0,
                    "replies": [
                        {
                            "body": "i think people started picking up on the awkwardness last year when people saw that they were unfollowing and following each other on ig quite a bit and both somin's brother and kwangsoo unfollowed each other. i also think last year is when their interactions on the show started dwindling down and i thought it was nothing at the beginning but it became more noticeable with the yjs and kjk battle of daesangs episode where whenever it was just the two of them they would either not talk or just speak to the pd.",
                            "author": "ashyashhh",
                            "id": "h2uf4dc",
                            "parent_id": "t1_h2u0lam",
                            "score": 21,
                            "created_utc": 1624503783.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "never even noticed that JSM and LKS “awkwardness” that ppl here in this sub always seem to bring up. genuinely feel like that’s just a reddit thing lol i enjoyed the past few eps w/o ever needing to see their interactions",
                    "author": "10ist",
                    "id": "h2u9vz0",
                    "parent_id": "t1_h2t5y3v",
                    "score": 25,
                    "created_utc": 1624501042.0,
                    "replies": [
                        {
                            "body": "agreed. there was no awkwardness between them but i can't deny the fact that something is going on behind the scene between both of them. they were an amazing pair but in the recent episode we can barely see any LKS and JSM moment/interaction. none. last interaction i remembered was during the chair scene where they need to hold a bowl of water. even in his last episode,  JSM is only in frame with LKS while taking pictures or just butt in when YJS piggy ride him.",
                            "author": "najmiii",
                            "id": "h2udglm",
                            "parent_id": "t1_h2u9vz0",
                            "score": 16,
                            "created_utc": 1624502921.0,
                            "replies": []
                        },
                        {
                            "body": "There was a recent ep the YJS vs KJK one, where it showed JSM & the camera panned out & LKS was there but they didn’t speak to each other, it was quite noticeable.",
                            "author": "jhdnhc",
                            "id": "h2wy5we",
                            "parent_id": "t1_h2u9vz0",
                            "score": 4,
                            "created_utc": 1624560146.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Totally agree with the career move and not solely for the \"ankle\" reason. Definitely used it for those close-minded fans.\nAnyway, just wanna ask if someone can explain further on the JSM issue? I 100% didn't notice it, I thought everything's fine with them.",
                    "author": "meitantei4869",
                    "id": "h2u9am4",
                    "parent_id": "t1_h2t5y3v",
                    "score": 10,
                    "created_utc": 1624500729.0,
                    "replies": [
                        {
                            "body": "At first I also didn't noticed it but when I saw people here raised their concerns on what is going on between them, I started to rewatch their previous episodes. I think it began during the first penthouse episode. There was a time when YSC is teasing LKS and he is telling JSM about it and her response was a bit off or she didn't even care. After that episode their interactions went really downhill. As a fan it was really hard to watch and makes you think if they are really okay behind the scenes.",
                            "author": "nitsnits345",
                            "id": "h2wrpye",
                            "parent_id": "t1_h2u9am4",
                            "score": 6,
                            "created_utc": 1624557270.0,
                            "replies": []
                        },
                        {
                            "body": "No one know what happen behind the door, all the thing that people said all speculation, you want to believe or not its your choice.\n\nBut 1 things for sure, their \"awkwardness\" is so obvious. We all know how close they used to be. They literally the penalty duo sibling (japan, uk, indonesia, australia). Now they even never standing next to each other (you can check it from the daesang episode until current one). They not even make eyes contact, and the conversation seems fake. Its so obvious, its like seeing a chaotic sibling that suddenly become distant but force to get together because the other family member are there.",
                            "author": "Important-Turnover65",
                            "id": "h2wsrua",
                            "parent_id": "t1_h2u9am4",
                            "score": 6,
                            "created_utc": 1624557737.0,
                            "replies": []
                        },
                        {
                            "body": "There are many posts in this sub about this. ANyway latest update was that somin followed him again. Actually, it is this following-unfollowing-following thing that made me relax. Kinda feel like if it was something realllly grave they wouldn't have been so childish about it lol",
                            "author": "rainsunicecream",
                            "id": "h30kdfh",
                            "parent_id": "t1_h2u9am4",
                            "score": 3,
                            "created_utc": 1624641053.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "What happened between LKS and JSM?",
                    "author": "bubblegumsssss",
                    "id": "h2tfh1c",
                    "parent_id": "t1_h2t5y3v",
                    "score": 14,
                    "created_utc": 1624485128.0,
                    "replies": [
                        {
                            "body": "No one knows, maybe nothing...they just stopped following each other on Instagram so people are suspicious",
                            "author": "n0cn1l",
                            "id": "h2theov",
                            "parent_id": "t1_h2tfh1c",
                            "score": 22,
                            "created_utc": 1624486074.0,
                            "replies": [
                                {
                                    "body": "I checked and somin follows kwang soo but he still doesn’t follow her. Hopefully they become okay",
                                    "author": "thesagitaurus",
                                    "id": "h2u2b94",
                                    "parent_id": "t1_h2theov",
                                    "score": 10,
                                    "created_utc": 1624497039.0,
                                    "replies": []
                                },
                                {
                                    "body": "Thanks for that!",
                                    "author": "bubblegumsssss",
                                    "id": "h2tlo0g",
                                    "parent_id": "t1_h2theov",
                                    "score": 5,
                                    "created_utc": 1624488190.0,
                                    "replies": []
                                },
                                {
                                    "body": "The timing of everything happened I believe soon after Somin joined LKS's agency. All the awkwardness I feel was directed by King Kong Entertainment.",
                                    "author": "xander_yi",
                                    "id": "h3104bu",
                                    "parent_id": "t1_h2theov",
                                    "score": 2,
                                    "created_utc": 1624648267.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "The interaction between LKS and JSM on the show went from one of the most chaotic pairings to practically non-existent. Combine that with LKS and JSM unfollowing each other on Insta a while back drove wild speculations on what's going on behind the scenes. But take note that everything fans say about their relationship is purely speculation.",
                            "author": "ScorpiusDX",
                            "id": "h2thebj",
                            "parent_id": "t1_h2tfh1c",
                            "score": 51,
                            "created_utc": 1624486068.0,
                            "replies": [
                                {
                                    "body": "Oh i see. Thank you. I dont notice things like that lol",
                                    "author": "bubblegumsssss",
                                    "id": "h2tllym",
                                    "parent_id": "t1_h2thebj",
                                    "score": 14,
                                    "created_utc": 1624488162.0,
                                    "replies": []
                                },
                                {
                                    "body": "isnt somin still really quiet even after lks left?",
                                    "author": "shadowmushroom12",
                                    "id": "h2uhuld",
                                    "parent_id": "t1_h2thebj",
                                    "score": 6,
                                    "created_utc": 1624505320.0,
                                    "replies": []
                                },
                                {
                                    "body": "Was there any specific moments which is awkward? The current pairing is Sechan and JSM right now right? THey were chaotic during the beginning but by the time LKS got a girlfriend, it toned way down.",
                                    "author": "netgames2000",
                                    "id": "h2uaj9g",
                                    "parent_id": "t1_h2thebj",
                                    "score": 7,
                                    "created_utc": 1624501382.0,
                                    "replies": [
                                        {
                                            "body": "I can't recall any particular moments that felt awkward onscreen. While the chaos did get toned down, it got to the point where they were barely even seen talking to each other onscreen within the last several months or so. Whether that was by design cause the show wanted JSM to focus on YSC is unknown but that shouldn't prevent her from interacting with other members.",
                                            "author": "ScorpiusDX",
                                            "id": "h2ukd20",
                                            "parent_id": "t1_h2uaj9g",
                                            "score": 7,
                                            "created_utc": 1624506842.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "I don’t think it’s his ankles specifically I think his body just can’t handle doing both things at once anymore. Which is why he’s leaving to focus on acting.",
                    "author": "Purplesheart",
                    "id": "h2v7484",
                    "parent_id": "t1_h2t5y3v",
                    "score": 3,
                    "created_utc": 1624525320.0,
                    "replies": []
                },
                {
                    "body": "Does anyone know what happened between him and JSM?",
                    "author": "sangrelatto",
                    "id": "h2vapz9",
                    "parent_id": "t1_h2t5y3v",
                    "score": 2,
                    "created_utc": 1624528853.0,
                    "replies": []
                },
                {
                    "body": "To be honest, I'm kinda new with Running Man (just started watching it late last year), so I never noticed the awkwardness between JSM and LKS. When did it start?",
                    "author": "tojtwl",
                    "id": "h2ujgw8",
                    "parent_id": "t1_h2t5y3v",
                    "score": 1,
                    "created_utc": 1624506299.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Hear, hear! I know a lot of people are disheartened by LKS leaving the show, but I don't think it's a reason for fans to drop the show. If we truly love the show, we stay because of everyone and not leave just because someone else left.\n\nIf you watched the most recent episode, even if Kwang Soo is sorely missed by both the members and the audience, they are still doing a good job at it. Perhaps this will be a time for the members to shine in a new way.",
            "author": "tojtwl",
            "id": "h2uja9b",
            "parent_id": "t3_o6kblg",
            "score": 8,
            "created_utc": 1624506186.0,
            "replies": [
                {
                    "body": "Yep. And I think a lot of RM fans grew up loving the show. We'd support them all the way til the end. :)",
                    "author": "hyouka09",
                    "id": "h2wul7t",
                    "parent_id": "t1_h2uja9b",
                    "score": 5,
                    "created_utc": 1624558541.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Let's cheers to this and hope it happens",
            "author": "AxzMusashi",
            "id": "h2ucqkx",
            "parent_id": "t3_o6kblg",
            "score": 4,
            "created_utc": 1624502542.0,
            "replies": []
        },
        {
            "body": "I admire this optimism. But pretty sure the whole cast and crew needed and still need to pull themselves by the bootstraps to fill the void left by LKS and for the more uncertain future of Running Man. And they know these.",
            "author": "hyouka09",
            "id": "h2w4vk8",
            "parent_id": "t3_o6kblg",
            "score": 4,
            "created_utc": 1624547244.0,
            "replies": []
        },
        {
            "body": "i feel like this type of post is way too soon..i feel like people (or maybe its just me) still feel very sad about him leaving and probably need a month to process before even thinking about this type of thing",
            "author": "shadowmushroom12",
            "id": "h2unza4",
            "parent_id": "t3_o6kblg",
            "score": -5,
            "created_utc": 1624509178.0,
            "replies": [
                {
                    "body": "Yeah actually, I agree.",
                    "author": "hyouka09",
                    "id": "h2xto2n",
                    "parent_id": "t1_h2unza4",
                    "score": 1,
                    "created_utc": 1624579616.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I don't agree. I associate Running Man mainly with Lee Kwang Soo and as an integral part of the show. And I never thought Lee Kwang Soo dominated the show. Not even in the past old episodes. And in the newer episodes Lee Kwang Soo showtime was similar to every other member it's just he did more in the given screen time.\n\nIn the newer episodes you can clearly see Sechan was given more screentime artificially. Some people might enjoy it but as someone who loves the old format of the show I do not enjoy Sechan. He might create a new dynamic but I do not like that new dynamic.\n\nAll I wanted was for the show to go back to its old format of episodes with the addition of Somin only and Bo Oil actually did it. Bo Pil PDs games remind me of the old episodes.\n\nBut the thing that other members were not receiving screentime when Lee Kwang Soo was there is simply wrong. \n\nAnd this new thing that Sechan will replace Lee Kwang Soo I don't like it. I want the focus to be on more older members and keep the format that way rather than moulding the format of the show to feature more of Yang Sechan.",
            "author": "Tnr2D",
            "id": "h2uzbk7",
            "parent_id": "t3_o6kblg",
            "score": -15,
            "created_utc": 1624517895.0,
            "replies": []
        },
        {
            "body": "Nah man.\nMy cousins and i watched running man and we agree on one thing. JSM and YSC overbully LKS.\nNow LKS leave our hate for those two increases.\nJSM more often ruin a joke and just feel unfit.\nYSC will funny but 75% of his joke involving bullying LKS.\nAnd show to the new dynamic? No thanks.",
            "author": "Simon-Edwin",
            "id": "h2um4yx",
            "parent_id": "t3_o6kblg",
            "score": -35,
            "created_utc": 1624507964.0,
            "replies": [
                {
                    "body": "I dont get the hate for JSM and YSC. They're working hard just like the other members. I agree, i often noticed YSC bullying or making fun of LKS but aren't YJS, too? He often cuts off LKS which irritates me but i dont hate him. I love them all equally because i love RM wholly despite its flaws and members' individual differences.",
                    "author": "bubblegumsssss",
                    "id": "h2vb0c3",
                    "parent_id": "t1_h2um4yx",
                    "score": 11,
                    "created_utc": 1624529118.0,
                    "replies": [
                        {
                            "body": "TBH we don't hate JSM that much. Its just editer unnecessary pointing to JSM like a simp(and it completely ruin the scene) . Alright YJS bully LKS but know where to stop but YSC doesn't stop and situation become painful to watch.",
                            "author": "Simon-Edwin",
                            "id": "h2vc1dr",
                            "parent_id": "t1_h2vb0c3",
                            "score": -8,
                            "created_utc": 1624530069.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "I honestly agree, i actually like Yang Se Chan and Jeon So Min and actually love that they are in the show unlike people that hate it however Yang Se Chan Joke sometimes can get out of hand like he doesn't know when to stop. Still Yang Se Chan is very funny though when his \"Suppose to Be Loveline\" with So Min appear or when he is becoming a servant or shy/embarrassed. So Min love comment and romanticist persona is also a really fresh addition to the show when the member romance joke is always just funny/indicating to an adult joke where Jeon So Min love joke is a mix between romance and funny vibe.",
                    "author": "WinterSnowBless",
                    "id": "h2vru9v",
                    "parent_id": "t1_h2um4yx",
                    "score": 2,
                    "created_utc": 1624540997.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Yes.",
            "author": "NobleArch",
            "id": "h3ajbop",
            "parent_id": "t3_o6kblg",
            "score": 1,
            "created_utc": 1624859171.0,
            "replies": []
        },
        {
            "body": "Seok Jin super underrated. He carried the first few episode of RM especially the first one along with the usual variety veterans",
            "author": "ItsKaZing",
            "id": "h2velgm",
            "parent_id": "t1_h2um4sh",
            "score": 40,
            "created_utc": 1624532305.0,
            "replies": []
        },
        {
            "body": "Yessss I love Kwang Soo but Suk Jin is my favorite member!!!",
            "author": "BoxStrange3765",
            "id": "h5w19fr",
            "parent_id": "t1_h2um4sh",
            "score": 2,
            "created_utc": 1626797404.0,
            "replies": []
        },
        {
            "body": "Totally agree with your last sentence. \n\nWhen Gary left, it left a sour taste because he was so funny. Not in your face or over the top funny but a very unique way of funny. Doesn't come often but when it does, he has you laughing out loud \n\nLKS in my opinion isn't a unique character. Can could easily be replaced. I mean since, Si Chan has come in he already lost the Maknae role and just get bullied by Jae Suk mainly. His traitor role is overplayed and you can see it in the other members faces when he does it too much. \n\nI'm looking forward to the new look of Running man. I stopped watching for ages now as it got stale and only watched funny parts from YouTube.",
            "author": "Dunkiez",
            "id": "h2vj8u1",
            "parent_id": "t1_h2um4sh",
            "score": 4,
            "created_utc": 1624535818.0,
            "replies": [
                {
                    "body": "Why did you get downvoted? Seems like any statement which is not a positive sentiment towards a member is getting downvoted a lot",
                    "author": "ALEKHYA8",
                    "id": "h2wnnf2",
                    "parent_id": "t1_h2vj8u1",
                    "score": 6,
                    "created_utc": 1624555496.0,
                    "replies": [
                        {
                            "body": "People love LKS here and they down voted anyone who doesn't share their love for him. Seen this happen so many times.",
                            "author": "Dunkiez",
                            "id": "h2wzjm2",
                            "parent_id": "t1_h2wnnf2",
                            "score": 5,
                            "created_utc": 1624560757.0,
                            "replies": [
                                {
                                    "body": "Yeah I love him too. My flair is about him. But people may have different opinions",
                                    "author": "ALEKHYA8",
                                    "id": "h2x3847",
                                    "parent_id": "t1_h2wzjm2",
                                    "score": 3,
                                    "created_utc": 1624562413.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "h2yt4ee",
                    "parent_id": "t1_h2vj8u1",
                    "score": 2,
                    "created_utc": 1624600387.0,
                    "replies": [
                        {
                            "body": "No. It wasn't because of LKS that I stopped watching. After watching religiously for so many years it just got a bit stale and life just got busier.\n\nI would still watch the episodes if there was good guests or when my brother recommended one as he was still watching them.",
                            "author": "Dunkiez",
                            "id": "h2z2svh",
                            "parent_id": "t1_h2yt4ee",
                            "score": 4,
                            "created_utc": 1624608628.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Yeah i agree, i noticed KJK are funnier during LKS's last episodes and after he's gone. They really trying to step up their game!",
            "author": "Kuasawan-Murbawan",
            "id": "h2wpcrk",
            "parent_id": "t1_h2tfeel",
            "score": 4,
            "created_utc": 1624556232.0,
            "replies": []
        },
        {
            "body": "I dunno, Se Chan's been so so for me with some good moves here and there. But yeah, not particularly amazing. Edit: So I guess I'm gonna get even more downvoted with this, but he's a decent comedian who  had a stroke of luck and had some shining moments to his credit. But he isn't as amazing as you claim to be, guys, sorry.",
            "author": "hyouka09",
            "id": "h2w4lpg",
            "parent_id": "t1_h2tfeel",
            "score": 0,
            "created_utc": 1624547117.0,
            "replies": [
                {
                    "body": "That's cus he's been shadowed by the master comedian kwang soo ;)",
                    "author": "tacocheeze",
                    "id": "h2xt0af",
                    "parent_id": "t1_h2w4lpg",
                    "score": 3,
                    "created_utc": 1624579256.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "For real! Also it really helps that Se chan is close to most of the members even outside of running man bc i always see him hanging out with jong kook and appearing on other shows w some of the members of running man...the haha/kjk/ysc trio is p close in and out of rm",
            "author": "tacocheeze",
            "id": "h2xsxqv",
            "parent_id": "t1_h2tfeel",
            "score": 1,
            "created_utc": 1624579218.0,
            "replies": []
        },
        {
            "body": "I mean, in the end, it is his life and his career. He does not owe anyone his own future. It definitely seems like a career move, which I totally respect. I just feel sad that he knows that the fans would drive him insane if he didn't announce the reason to be his ankles. \n\nLKS will always be the best boi and everyone in the whole world will always remember him to be. He did his job extremely well, but even the most devoted employees would eventually choose to follow their own path. \n\nAlthough they joke, it has never not been apparent just how much LKS loves acting. He has never picked any variety shows except RM and Busted (And I suspect his involvement with Busted was a combination of YJS's presence and Netflix money). He constantly picks challenging roles and experimental projects. In spite of his ambitions, he still remained steadfast with the RM cast and crew for eleven whole years, internal issues notwithstanding. So yeah, this is a happy retirement for the MVP of this insane production.",
            "author": "Why_Must_You_Be",
            "id": "h2tk694",
            "parent_id": "t1_h2t5y3v",
            "score": 60,
            "created_utc": 1624487462.0,
            "replies": [
                {
                    "body": "I just love that last line: \"MVP of this insane production.\"",
                    "author": "Crashingshores",
                    "id": "h2tqd2x",
                    "parent_id": "t1_h2tk694",
                    "score": 17,
                    "created_utc": 1624490679.0,
                    "replies": []
                },
                {
                    "body": "I’ll get downvoted for this but as much as I love Kwangsoo, I can’t picture the Korean audience seeing him as a lead actor. I don’t foresee him being a lead actor due to a celebrities popularity in acting being based on looks. I mean when I think of Kang Ha Neul, Song Joong Ki, Lee Dong Wook, Hyun Bin, I don’t see Kwang Soo mentally in these guys’s tier. Do supporting actors get the same recognition? Idk. Runningman is popular overseas but not in Korea so it’s even harder for him to get recognition because no ones going to watch a drama JUST because Kwangsoo is in it.",
                    "author": "MigukOppa",
                    "id": "h2tya01",
                    "parent_id": "t1_h2tk694",
                    "score": 13,
                    "created_utc": 1624494874.0,
                    "replies": [
                        {
                            "body": "But he doesn't have to be popular to be a good actor though. He doesn't need to be a Song Joongki, as long as he enjoys his work. He has repeatedly mentioned that he loves acting. He is good enough to keep getting prominent roles and that is success in itself no? \n\nNot gonna downvote but it is a little presumptuous to measure success based on popularity. Oh Jung Se, supporting actor in Its okay to not be okay, got all the accolades and the public love. The baeksang best actor award wasn't given to Song Joongki for Vincenzo. Despite both Vincenzo and Joongki's popularity, the award was given to Shin Ha-Kyun of Beyond Evil, an almost 50 year old seasoned actor. Even outside of Korea, Parasite is unarguably the most popular Korean film, and you can't really attribute the success of the standout actors like Song Kang Ho and Lee Jeong-Eun to their appearance. \n\nPoint is Kwangsoo does not need to be popular he only need to be a good actor attached to interesting highbudget projects. He is popular enough to get those projects. You never know, he could star, maybe even as a supporting role, in a film as big as Parasite. He wants to pick projects that could challenge him to be characters beyond the Girin character he created for RM. And how can you blame the guy for not wanted to be pigeonholed in a single role for the rest of his life.",
                            "author": "Why_Must_You_Be",
                            "id": "h2u2h6s",
                            "parent_id": "t1_h2tya01",
                            "score": 70,
                            "created_utc": 1624497129.0,
                            "replies": []
                        },
                        {
                            "body": "\"Running Man is not popular in Korea\" LOL every Koreans know RM is existing. It is a show running for eleven freaking years. It's just the viewership rating isnt' the same as before. But hello? You could ask anyone in Korea and they could name every member of it.",
                            "author": "Efficient-Aside-8919",
                            "id": "h2vjmk0",
                            "parent_id": "t1_h2tya01",
                            "score": 9,
                            "created_utc": 1624536075.0,
                            "replies": [
                                {
                                    "body": "Doesn’t mean it’s popular… I have a friend from Seoul in market analytics. Runningman is for international fans and not really for Koreans.",
                                    "author": "MigukOppa",
                                    "id": "h2vurwp",
                                    "parent_id": "t1_h2vjmk0",
                                    "score": -4,
                                    "created_utc": 1624542507.0,
                                    "replies": [
                                        {
                                            "body": "That's just one guy.... yet all my Korean friends know Running Man and have watched it since they were kids.",
                                            "author": "tacocheeze",
                                            "id": "h2xt77l",
                                            "parent_id": "t1_h2vurwp",
                                            "score": 6,
                                            "created_utc": 1624579362.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "[removed]",
                                            "author": null,
                                            "id": "h2x70cu",
                                            "parent_id": "t1_h2vurwp",
                                            "score": 3,
                                            "created_utc": 1624564125.0,
                                            "replies": [
                                                {
                                                    "body": "[removed]",
                                                    "author": null,
                                                    "id": "h2xtixm",
                                                    "parent_id": "t1_h2x70cu",
                                                    "score": 4,
                                                    "created_utc": 1624579538.0,
                                                    "replies": []
                                                },
                                                {
                                                    "body": "[removed]",
                                                    "author": null,
                                                    "id": "h2xa6w5",
                                                    "parent_id": "t1_h2x70cu",
                                                    "score": -1,
                                                    "created_utc": 1624565572.0,
                                                    "replies": [
                                                        {
                                                            "body": "[removed]",
                                                            "author": null,
                                                            "id": "h2z2n48",
                                                            "parent_id": "t1_h2xa6w5",
                                                            "score": 1,
                                                            "created_utc": 1624608476.0,
                                                            "replies": [
                                                                {
                                                                    "body": "[removed]",
                                                                    "author": null,
                                                                    "id": "h2znbzj",
                                                                    "parent_id": "t1_h2z2n48",
                                                                    "score": -1,
                                                                    "created_utc": 1624625450.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "You mean except for the times he's already been a lead actor? \n\nIf Ahn Jae Hong can be a lead actor, LKS certainly can. It's just not going to be for traditional romantic main lead roles",
                            "author": "xander_yi",
                            "id": "h38dwr7",
                            "parent_id": "t1_h2tya01",
                            "score": 2,
                            "created_utc": 1624815959.0,
                            "replies": []
                        },
                        {
                            "body": "Yep but Kwangsoo seems to go for more inventive and experimental roles rather than typical drama lead. So I think he can still find success. People like Song Kang Ho are still finding success due to their acting ability even if they don't fit into the \"typical\" drama lead look - probably because that kind of job is not even on their radar in the first place",
                            "author": "justahalfling",
                            "id": "h2vf5wb",
                            "parent_id": "t1_h2tya01",
                            "score": 1,
                            "created_utc": 1624532773.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Yup. Pretty sure it’s a career move. Staying in RM will keep him typecast in the same character he’s played. As an actor he’s probably looking for a serious MC role.",
            "author": "bpdizle",
            "id": "h2tcw7d",
            "parent_id": "t1_h2t5y3v",
            "score": 47,
            "created_utc": 1624483918.0,
            "replies": []
        },
        {
            "body": "Yea i have the same thought, i know being an actor some sort of a dream/goal for him and I think the time is right before he gets too old. This is like his prime years so he need to do something.",
            "author": "luckypanda95",
            "id": "h2tu4qj",
            "parent_id": "t1_h2t5y3v",
            "score": 13,
            "created_utc": 1624492699.0,
            "replies": []
        },
        {
            "body": "Not sure what's the real reason but I never really believed it was his ankles. That is just a great and convenient reason to avoid controversies. If it was really an issue, it would have been dealt with much earlier, I mean why would he even return to the show with crutches during one of the episodes. I truly believe the PD will not push him to return if he's not 100%. And it's nearly 1.5 to 2 years too.\n\nI respect his decision whatever the reasons. He has given his all, 110%. Many times he's on verge of winning, but decided to gamble and lose all etc to make it more entertaining.\n\nHope he does well.",
            "author": "kaktusmint",
            "id": "h2tweqm",
            "parent_id": "t1_h2t5y3v",
            "score": 22,
            "created_utc": 1624493887.0,
            "replies": []
        },
        {
            "body": "ya our bb won a baeksang award!! Honestly I feel like he's just doing what Joong ki is doing, focusing on his acting career. he himself said he sees himself more as an actor than a comedian/variety star. if he's pouring this much attention and care into RM can you imagine the level of care he puts into his acting career?",
            "author": "catsandtings",
            "id": "h2td26u",
            "parent_id": "t1_h2t5y3v",
            "score": 21,
            "created_utc": 1624483997.0,
            "replies": []
        },
        {
            "body": "i never noticed the awkwardness. since when did that happen? and did something happen?",
            "author": "tinyglow",
            "id": "h2u0lam",
            "parent_id": "t1_h2t5y3v",
            "score": 19,
            "created_utc": 1624496110.0,
            "replies": [
                {
                    "body": "i think people started picking up on the awkwardness last year when people saw that they were unfollowing and following each other on ig quite a bit and both somin's brother and kwangsoo unfollowed each other. i also think last year is when their interactions on the show started dwindling down and i thought it was nothing at the beginning but it became more noticeable with the yjs and kjk battle of daesangs episode where whenever it was just the two of them they would either not talk or just speak to the pd.",
                    "author": "ashyashhh",
                    "id": "h2uf4dc",
                    "parent_id": "t1_h2u0lam",
                    "score": 21,
                    "created_utc": 1624503783.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "never even noticed that JSM and LKS “awkwardness” that ppl here in this sub always seem to bring up. genuinely feel like that’s just a reddit thing lol i enjoyed the past few eps w/o ever needing to see their interactions",
            "author": "10ist",
            "id": "h2u9vz0",
            "parent_id": "t1_h2t5y3v",
            "score": 25,
            "created_utc": 1624501042.0,
            "replies": [
                {
                    "body": "agreed. there was no awkwardness between them but i can't deny the fact that something is going on behind the scene between both of them. they were an amazing pair but in the recent episode we can barely see any LKS and JSM moment/interaction. none. last interaction i remembered was during the chair scene where they need to hold a bowl of water. even in his last episode,  JSM is only in frame with LKS while taking pictures or just butt in when YJS piggy ride him.",
                    "author": "najmiii",
                    "id": "h2udglm",
                    "parent_id": "t1_h2u9vz0",
                    "score": 16,
                    "created_utc": 1624502921.0,
                    "replies": []
                },
                {
                    "body": "There was a recent ep the YJS vs KJK one, where it showed JSM & the camera panned out & LKS was there but they didn’t speak to each other, it was quite noticeable.",
                    "author": "jhdnhc",
                    "id": "h2wy5we",
                    "parent_id": "t1_h2u9vz0",
                    "score": 4,
                    "created_utc": 1624560146.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Totally agree with the career move and not solely for the \"ankle\" reason. Definitely used it for those close-minded fans.\nAnyway, just wanna ask if someone can explain further on the JSM issue? I 100% didn't notice it, I thought everything's fine with them.",
            "author": "meitantei4869",
            "id": "h2u9am4",
            "parent_id": "t1_h2t5y3v",
            "score": 10,
            "created_utc": 1624500729.0,
            "replies": [
                {
                    "body": "At first I also didn't noticed it but when I saw people here raised their concerns on what is going on between them, I started to rewatch their previous episodes. I think it began during the first penthouse episode. There was a time when YSC is teasing LKS and he is telling JSM about it and her response was a bit off or she didn't even care. After that episode their interactions went really downhill. As a fan it was really hard to watch and makes you think if they are really okay behind the scenes.",
                    "author": "nitsnits345",
                    "id": "h2wrpye",
                    "parent_id": "t1_h2u9am4",
                    "score": 6,
                    "created_utc": 1624557270.0,
                    "replies": []
                },
                {
                    "body": "No one know what happen behind the door, all the thing that people said all speculation, you want to believe or not its your choice.\n\nBut 1 things for sure, their \"awkwardness\" is so obvious. We all know how close they used to be. They literally the penalty duo sibling (japan, uk, indonesia, australia). Now they even never standing next to each other (you can check it from the daesang episode until current one). They not even make eyes contact, and the conversation seems fake. Its so obvious, its like seeing a chaotic sibling that suddenly become distant but force to get together because the other family member are there.",
                    "author": "Important-Turnover65",
                    "id": "h2wsrua",
                    "parent_id": "t1_h2u9am4",
                    "score": 6,
                    "created_utc": 1624557737.0,
                    "replies": []
                },
                {
                    "body": "There are many posts in this sub about this. ANyway latest update was that somin followed him again. Actually, it is this following-unfollowing-following thing that made me relax. Kinda feel like if it was something realllly grave they wouldn't have been so childish about it lol",
                    "author": "rainsunicecream",
                    "id": "h30kdfh",
                    "parent_id": "t1_h2u9am4",
                    "score": 3,
                    "created_utc": 1624641053.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "What happened between LKS and JSM?",
            "author": "bubblegumsssss",
            "id": "h2tfh1c",
            "parent_id": "t1_h2t5y3v",
            "score": 14,
            "created_utc": 1624485128.0,
            "replies": [
                {
                    "body": "No one knows, maybe nothing...they just stopped following each other on Instagram so people are suspicious",
                    "author": "n0cn1l",
                    "id": "h2theov",
                    "parent_id": "t1_h2tfh1c",
                    "score": 22,
                    "created_utc": 1624486074.0,
                    "replies": [
                        {
                            "body": "I checked and somin follows kwang soo but he still doesn’t follow her. Hopefully they become okay",
                            "author": "thesagitaurus",
                            "id": "h2u2b94",
                            "parent_id": "t1_h2theov",
                            "score": 10,
                            "created_utc": 1624497039.0,
                            "replies": []
                        },
                        {
                            "body": "Thanks for that!",
                            "author": "bubblegumsssss",
                            "id": "h2tlo0g",
                            "parent_id": "t1_h2theov",
                            "score": 5,
                            "created_utc": 1624488190.0,
                            "replies": []
                        },
                        {
                            "body": "The timing of everything happened I believe soon after Somin joined LKS's agency. All the awkwardness I feel was directed by King Kong Entertainment.",
                            "author": "xander_yi",
                            "id": "h3104bu",
                            "parent_id": "t1_h2theov",
                            "score": 2,
                            "created_utc": 1624648267.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "The interaction between LKS and JSM on the show went from one of the most chaotic pairings to practically non-existent. Combine that with LKS and JSM unfollowing each other on Insta a while back drove wild speculations on what's going on behind the scenes. But take note that everything fans say about their relationship is purely speculation.",
                    "author": "ScorpiusDX",
                    "id": "h2thebj",
                    "parent_id": "t1_h2tfh1c",
                    "score": 51,
                    "created_utc": 1624486068.0,
                    "replies": [
                        {
                            "body": "Oh i see. Thank you. I dont notice things like that lol",
                            "author": "bubblegumsssss",
                            "id": "h2tllym",
                            "parent_id": "t1_h2thebj",
                            "score": 14,
                            "created_utc": 1624488162.0,
                            "replies": []
                        },
                        {
                            "body": "isnt somin still really quiet even after lks left?",
                            "author": "shadowmushroom12",
                            "id": "h2uhuld",
                            "parent_id": "t1_h2thebj",
                            "score": 6,
                            "created_utc": 1624505320.0,
                            "replies": []
                        },
                        {
                            "body": "Was there any specific moments which is awkward? The current pairing is Sechan and JSM right now right? THey were chaotic during the beginning but by the time LKS got a girlfriend, it toned way down.",
                            "author": "netgames2000",
                            "id": "h2uaj9g",
                            "parent_id": "t1_h2thebj",
                            "score": 7,
                            "created_utc": 1624501382.0,
                            "replies": [
                                {
                                    "body": "I can't recall any particular moments that felt awkward onscreen. While the chaos did get toned down, it got to the point where they were barely even seen talking to each other onscreen within the last several months or so. Whether that was by design cause the show wanted JSM to focus on YSC is unknown but that shouldn't prevent her from interacting with other members.",
                                    "author": "ScorpiusDX",
                                    "id": "h2ukd20",
                                    "parent_id": "t1_h2uaj9g",
                                    "score": 7,
                                    "created_utc": 1624506842.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I don’t think it’s his ankles specifically I think his body just can’t handle doing both things at once anymore. Which is why he’s leaving to focus on acting.",
            "author": "Purplesheart",
            "id": "h2v7484",
            "parent_id": "t1_h2t5y3v",
            "score": 3,
            "created_utc": 1624525320.0,
            "replies": []
        },
        {
            "body": "Does anyone know what happened between him and JSM?",
            "author": "sangrelatto",
            "id": "h2vapz9",
            "parent_id": "t1_h2t5y3v",
            "score": 2,
            "created_utc": 1624528853.0,
            "replies": []
        },
        {
            "body": "To be honest, I'm kinda new with Running Man (just started watching it late last year), so I never noticed the awkwardness between JSM and LKS. When did it start?",
            "author": "tojtwl",
            "id": "h2ujgw8",
            "parent_id": "t1_h2t5y3v",
            "score": 1,
            "created_utc": 1624506299.0,
            "replies": []
        },
        {
            "body": "Yep. And I think a lot of RM fans grew up loving the show. We'd support them all the way til the end. :)",
            "author": "hyouka09",
            "id": "h2wul7t",
            "parent_id": "t1_h2uja9b",
            "score": 5,
            "created_utc": 1624558541.0,
            "replies": []
        },
        {
            "body": "Yeah actually, I agree.",
            "author": "hyouka09",
            "id": "h2xto2n",
            "parent_id": "t1_h2unza4",
            "score": 1,
            "created_utc": 1624579616.0,
            "replies": []
        },
        {
            "body": "I dont get the hate for JSM and YSC. They're working hard just like the other members. I agree, i often noticed YSC bullying or making fun of LKS but aren't YJS, too? He often cuts off LKS which irritates me but i dont hate him. I love them all equally because i love RM wholly despite its flaws and members' individual differences.",
            "author": "bubblegumsssss",
            "id": "h2vb0c3",
            "parent_id": "t1_h2um4yx",
            "score": 11,
            "created_utc": 1624529118.0,
            "replies": [
                {
                    "body": "TBH we don't hate JSM that much. Its just editer unnecessary pointing to JSM like a simp(and it completely ruin the scene) . Alright YJS bully LKS but know where to stop but YSC doesn't stop and situation become painful to watch.",
                    "author": "Simon-Edwin",
                    "id": "h2vc1dr",
                    "parent_id": "t1_h2vb0c3",
                    "score": -8,
                    "created_utc": 1624530069.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I honestly agree, i actually like Yang Se Chan and Jeon So Min and actually love that they are in the show unlike people that hate it however Yang Se Chan Joke sometimes can get out of hand like he doesn't know when to stop. Still Yang Se Chan is very funny though when his \"Suppose to Be Loveline\" with So Min appear or when he is becoming a servant or shy/embarrassed. So Min love comment and romanticist persona is also a really fresh addition to the show when the member romance joke is always just funny/indicating to an adult joke where Jeon So Min love joke is a mix between romance and funny vibe.",
            "author": "WinterSnowBless",
            "id": "h2vru9v",
            "parent_id": "t1_h2um4yx",
            "score": 2,
            "created_utc": 1624540997.0,
            "replies": []
        },
        {
            "body": "Why did you get downvoted? Seems like any statement which is not a positive sentiment towards a member is getting downvoted a lot",
            "author": "ALEKHYA8",
            "id": "h2wnnf2",
            "parent_id": "t1_h2vj8u1",
            "score": 6,
            "created_utc": 1624555496.0,
            "replies": [
                {
                    "body": "People love LKS here and they down voted anyone who doesn't share their love for him. Seen this happen so many times.",
                    "author": "Dunkiez",
                    "id": "h2wzjm2",
                    "parent_id": "t1_h2wnnf2",
                    "score": 5,
                    "created_utc": 1624560757.0,
                    "replies": [
                        {
                            "body": "Yeah I love him too. My flair is about him. But people may have different opinions",
                            "author": "ALEKHYA8",
                            "id": "h2x3847",
                            "parent_id": "t1_h2wzjm2",
                            "score": 3,
                            "created_utc": 1624562413.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "h2yt4ee",
            "parent_id": "t1_h2vj8u1",
            "score": 2,
            "created_utc": 1624600387.0,
            "replies": [
                {
                    "body": "No. It wasn't because of LKS that I stopped watching. After watching religiously for so many years it just got a bit stale and life just got busier.\n\nI would still watch the episodes if there was good guests or when my brother recommended one as he was still watching them.",
                    "author": "Dunkiez",
                    "id": "h2z2svh",
                    "parent_id": "t1_h2yt4ee",
                    "score": 4,
                    "created_utc": 1624608628.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "That's cus he's been shadowed by the master comedian kwang soo ;)",
            "author": "tacocheeze",
            "id": "h2xt0af",
            "parent_id": "t1_h2w4lpg",
            "score": 3,
            "created_utc": 1624579256.0,
            "replies": []
        },
        {
            "body": "I just love that last line: \"MVP of this insane production.\"",
            "author": "Crashingshores",
            "id": "h2tqd2x",
            "parent_id": "t1_h2tk694",
            "score": 17,
            "created_utc": 1624490679.0,
            "replies": []
        },
        {
            "body": "I’ll get downvoted for this but as much as I love Kwangsoo, I can’t picture the Korean audience seeing him as a lead actor. I don’t foresee him being a lead actor due to a celebrities popularity in acting being based on looks. I mean when I think of Kang Ha Neul, Song Joong Ki, Lee Dong Wook, Hyun Bin, I don’t see Kwang Soo mentally in these guys’s tier. Do supporting actors get the same recognition? Idk. Runningman is popular overseas but not in Korea so it’s even harder for him to get recognition because no ones going to watch a drama JUST because Kwangsoo is in it.",
            "author": "MigukOppa",
            "id": "h2tya01",
            "parent_id": "t1_h2tk694",
            "score": 13,
            "created_utc": 1624494874.0,
            "replies": [
                {
                    "body": "But he doesn't have to be popular to be a good actor though. He doesn't need to be a Song Joongki, as long as he enjoys his work. He has repeatedly mentioned that he loves acting. He is good enough to keep getting prominent roles and that is success in itself no? \n\nNot gonna downvote but it is a little presumptuous to measure success based on popularity. Oh Jung Se, supporting actor in Its okay to not be okay, got all the accolades and the public love. The baeksang best actor award wasn't given to Song Joongki for Vincenzo. Despite both Vincenzo and Joongki's popularity, the award was given to Shin Ha-Kyun of Beyond Evil, an almost 50 year old seasoned actor. Even outside of Korea, Parasite is unarguably the most popular Korean film, and you can't really attribute the success of the standout actors like Song Kang Ho and Lee Jeong-Eun to their appearance. \n\nPoint is Kwangsoo does not need to be popular he only need to be a good actor attached to interesting highbudget projects. He is popular enough to get those projects. You never know, he could star, maybe even as a supporting role, in a film as big as Parasite. He wants to pick projects that could challenge him to be characters beyond the Girin character he created for RM. And how can you blame the guy for not wanted to be pigeonholed in a single role for the rest of his life.",
                    "author": "Why_Must_You_Be",
                    "id": "h2u2h6s",
                    "parent_id": "t1_h2tya01",
                    "score": 70,
                    "created_utc": 1624497129.0,
                    "replies": []
                },
                {
                    "body": "\"Running Man is not popular in Korea\" LOL every Koreans know RM is existing. It is a show running for eleven freaking years. It's just the viewership rating isnt' the same as before. But hello? You could ask anyone in Korea and they could name every member of it.",
                    "author": "Efficient-Aside-8919",
                    "id": "h2vjmk0",
                    "parent_id": "t1_h2tya01",
                    "score": 9,
                    "created_utc": 1624536075.0,
                    "replies": [
                        {
                            "body": "Doesn’t mean it’s popular… I have a friend from Seoul in market analytics. Runningman is for international fans and not really for Koreans.",
                            "author": "MigukOppa",
                            "id": "h2vurwp",
                            "parent_id": "t1_h2vjmk0",
                            "score": -4,
                            "created_utc": 1624542507.0,
                            "replies": [
                                {
                                    "body": "That's just one guy.... yet all my Korean friends know Running Man and have watched it since they were kids.",
                                    "author": "tacocheeze",
                                    "id": "h2xt77l",
                                    "parent_id": "t1_h2vurwp",
                                    "score": 6,
                                    "created_utc": 1624579362.0,
                                    "replies": []
                                },
                                {
                                    "body": "[removed]",
                                    "author": null,
                                    "id": "h2x70cu",
                                    "parent_id": "t1_h2vurwp",
                                    "score": 3,
                                    "created_utc": 1624564125.0,
                                    "replies": [
                                        {
                                            "body": "[removed]",
                                            "author": null,
                                            "id": "h2xtixm",
                                            "parent_id": "t1_h2x70cu",
                                            "score": 4,
                                            "created_utc": 1624579538.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "[removed]",
                                            "author": null,
                                            "id": "h2xa6w5",
                                            "parent_id": "t1_h2x70cu",
                                            "score": -1,
                                            "created_utc": 1624565572.0,
                                            "replies": [
                                                {
                                                    "body": "[removed]",
                                                    "author": null,
                                                    "id": "h2z2n48",
                                                    "parent_id": "t1_h2xa6w5",
                                                    "score": 1,
                                                    "created_utc": 1624608476.0,
                                                    "replies": [
                                                        {
                                                            "body": "[removed]",
                                                            "author": null,
                                                            "id": "h2znbzj",
                                                            "parent_id": "t1_h2z2n48",
                                                            "score": -1,
                                                            "created_utc": 1624625450.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "You mean except for the times he's already been a lead actor? \n\nIf Ahn Jae Hong can be a lead actor, LKS certainly can. It's just not going to be for traditional romantic main lead roles",
                    "author": "xander_yi",
                    "id": "h38dwr7",
                    "parent_id": "t1_h2tya01",
                    "score": 2,
                    "created_utc": 1624815959.0,
                    "replies": []
                },
                {
                    "body": "Yep but Kwangsoo seems to go for more inventive and experimental roles rather than typical drama lead. So I think he can still find success. People like Song Kang Ho are still finding success due to their acting ability even if they don't fit into the \"typical\" drama lead look - probably because that kind of job is not even on their radar in the first place",
                    "author": "justahalfling",
                    "id": "h2vf5wb",
                    "parent_id": "t1_h2tya01",
                    "score": 1,
                    "created_utc": 1624532773.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "i think people started picking up on the awkwardness last year when people saw that they were unfollowing and following each other on ig quite a bit and both somin's brother and kwangsoo unfollowed each other. i also think last year is when their interactions on the show started dwindling down and i thought it was nothing at the beginning but it became more noticeable with the yjs and kjk battle of daesangs episode where whenever it was just the two of them they would either not talk or just speak to the pd.",
            "author": "ashyashhh",
            "id": "h2uf4dc",
            "parent_id": "t1_h2u0lam",
            "score": 21,
            "created_utc": 1624503783.0,
            "replies": []
        },
        {
            "body": "agreed. there was no awkwardness between them but i can't deny the fact that something is going on behind the scene between both of them. they were an amazing pair but in the recent episode we can barely see any LKS and JSM moment/interaction. none. last interaction i remembered was during the chair scene where they need to hold a bowl of water. even in his last episode,  JSM is only in frame with LKS while taking pictures or just butt in when YJS piggy ride him.",
            "author": "najmiii",
            "id": "h2udglm",
            "parent_id": "t1_h2u9vz0",
            "score": 16,
            "created_utc": 1624502921.0,
            "replies": []
        },
        {
            "body": "There was a recent ep the YJS vs KJK one, where it showed JSM & the camera panned out & LKS was there but they didn’t speak to each other, it was quite noticeable.",
            "author": "jhdnhc",
            "id": "h2wy5we",
            "parent_id": "t1_h2u9vz0",
            "score": 4,
            "created_utc": 1624560146.0,
            "replies": []
        },
        {
            "body": "At first I also didn't noticed it but when I saw people here raised their concerns on what is going on between them, I started to rewatch their previous episodes. I think it began during the first penthouse episode. There was a time when YSC is teasing LKS and he is telling JSM about it and her response was a bit off or she didn't even care. After that episode their interactions went really downhill. As a fan it was really hard to watch and makes you think if they are really okay behind the scenes.",
            "author": "nitsnits345",
            "id": "h2wrpye",
            "parent_id": "t1_h2u9am4",
            "score": 6,
            "created_utc": 1624557270.0,
            "replies": []
        },
        {
            "body": "No one know what happen behind the door, all the thing that people said all speculation, you want to believe or not its your choice.\n\nBut 1 things for sure, their \"awkwardness\" is so obvious. We all know how close they used to be. They literally the penalty duo sibling (japan, uk, indonesia, australia). Now they even never standing next to each other (you can check it from the daesang episode until current one). They not even make eyes contact, and the conversation seems fake. Its so obvious, its like seeing a chaotic sibling that suddenly become distant but force to get together because the other family member are there.",
            "author": "Important-Turnover65",
            "id": "h2wsrua",
            "parent_id": "t1_h2u9am4",
            "score": 6,
            "created_utc": 1624557737.0,
            "replies": []
        },
        {
            "body": "There are many posts in this sub about this. ANyway latest update was that somin followed him again. Actually, it is this following-unfollowing-following thing that made me relax. Kinda feel like if it was something realllly grave they wouldn't have been so childish about it lol",
            "author": "rainsunicecream",
            "id": "h30kdfh",
            "parent_id": "t1_h2u9am4",
            "score": 3,
            "created_utc": 1624641053.0,
            "replies": []
        },
        {
            "body": "No one knows, maybe nothing...they just stopped following each other on Instagram so people are suspicious",
            "author": "n0cn1l",
            "id": "h2theov",
            "parent_id": "t1_h2tfh1c",
            "score": 22,
            "created_utc": 1624486074.0,
            "replies": [
                {
                    "body": "I checked and somin follows kwang soo but he still doesn’t follow her. Hopefully they become okay",
                    "author": "thesagitaurus",
                    "id": "h2u2b94",
                    "parent_id": "t1_h2theov",
                    "score": 10,
                    "created_utc": 1624497039.0,
                    "replies": []
                },
                {
                    "body": "Thanks for that!",
                    "author": "bubblegumsssss",
                    "id": "h2tlo0g",
                    "parent_id": "t1_h2theov",
                    "score": 5,
                    "created_utc": 1624488190.0,
                    "replies": []
                },
                {
                    "body": "The timing of everything happened I believe soon after Somin joined LKS's agency. All the awkwardness I feel was directed by King Kong Entertainment.",
                    "author": "xander_yi",
                    "id": "h3104bu",
                    "parent_id": "t1_h2theov",
                    "score": 2,
                    "created_utc": 1624648267.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "The interaction between LKS and JSM on the show went from one of the most chaotic pairings to practically non-existent. Combine that with LKS and JSM unfollowing each other on Insta a while back drove wild speculations on what's going on behind the scenes. But take note that everything fans say about their relationship is purely speculation.",
            "author": "ScorpiusDX",
            "id": "h2thebj",
            "parent_id": "t1_h2tfh1c",
            "score": 51,
            "created_utc": 1624486068.0,
            "replies": [
                {
                    "body": "Oh i see. Thank you. I dont notice things like that lol",
                    "author": "bubblegumsssss",
                    "id": "h2tllym",
                    "parent_id": "t1_h2thebj",
                    "score": 14,
                    "created_utc": 1624488162.0,
                    "replies": []
                },
                {
                    "body": "isnt somin still really quiet even after lks left?",
                    "author": "shadowmushroom12",
                    "id": "h2uhuld",
                    "parent_id": "t1_h2thebj",
                    "score": 6,
                    "created_utc": 1624505320.0,
                    "replies": []
                },
                {
                    "body": "Was there any specific moments which is awkward? The current pairing is Sechan and JSM right now right? THey were chaotic during the beginning but by the time LKS got a girlfriend, it toned way down.",
                    "author": "netgames2000",
                    "id": "h2uaj9g",
                    "parent_id": "t1_h2thebj",
                    "score": 7,
                    "created_utc": 1624501382.0,
                    "replies": [
                        {
                            "body": "I can't recall any particular moments that felt awkward onscreen. While the chaos did get toned down, it got to the point where they were barely even seen talking to each other onscreen within the last several months or so. Whether that was by design cause the show wanted JSM to focus on YSC is unknown but that shouldn't prevent her from interacting with other members.",
                            "author": "ScorpiusDX",
                            "id": "h2ukd20",
                            "parent_id": "t1_h2uaj9g",
                            "score": 7,
                            "created_utc": 1624506842.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "TBH we don't hate JSM that much. Its just editer unnecessary pointing to JSM like a simp(and it completely ruin the scene) . Alright YJS bully LKS but know where to stop but YSC doesn't stop and situation become painful to watch.",
            "author": "Simon-Edwin",
            "id": "h2vc1dr",
            "parent_id": "t1_h2vb0c3",
            "score": -8,
            "created_utc": 1624530069.0,
            "replies": []
        },
        {
            "body": "People love LKS here and they down voted anyone who doesn't share their love for him. Seen this happen so many times.",
            "author": "Dunkiez",
            "id": "h2wzjm2",
            "parent_id": "t1_h2wnnf2",
            "score": 5,
            "created_utc": 1624560757.0,
            "replies": [
                {
                    "body": "Yeah I love him too. My flair is about him. But people may have different opinions",
                    "author": "ALEKHYA8",
                    "id": "h2x3847",
                    "parent_id": "t1_h2wzjm2",
                    "score": 3,
                    "created_utc": 1624562413.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "No. It wasn't because of LKS that I stopped watching. After watching religiously for so many years it just got a bit stale and life just got busier.\n\nI would still watch the episodes if there was good guests or when my brother recommended one as he was still watching them.",
            "author": "Dunkiez",
            "id": "h2z2svh",
            "parent_id": "t1_h2yt4ee",
            "score": 4,
            "created_utc": 1624608628.0,
            "replies": []
        },
        {
            "body": "But he doesn't have to be popular to be a good actor though. He doesn't need to be a Song Joongki, as long as he enjoys his work. He has repeatedly mentioned that he loves acting. He is good enough to keep getting prominent roles and that is success in itself no? \n\nNot gonna downvote but it is a little presumptuous to measure success based on popularity. Oh Jung Se, supporting actor in Its okay to not be okay, got all the accolades and the public love. The baeksang best actor award wasn't given to Song Joongki for Vincenzo. Despite both Vincenzo and Joongki's popularity, the award was given to Shin Ha-Kyun of Beyond Evil, an almost 50 year old seasoned actor. Even outside of Korea, Parasite is unarguably the most popular Korean film, and you can't really attribute the success of the standout actors like Song Kang Ho and Lee Jeong-Eun to their appearance. \n\nPoint is Kwangsoo does not need to be popular he only need to be a good actor attached to interesting highbudget projects. He is popular enough to get those projects. You never know, he could star, maybe even as a supporting role, in a film as big as Parasite. He wants to pick projects that could challenge him to be characters beyond the Girin character he created for RM. And how can you blame the guy for not wanted to be pigeonholed in a single role for the rest of his life.",
            "author": "Why_Must_You_Be",
            "id": "h2u2h6s",
            "parent_id": "t1_h2tya01",
            "score": 70,
            "created_utc": 1624497129.0,
            "replies": []
        },
        {
            "body": "\"Running Man is not popular in Korea\" LOL every Koreans know RM is existing. It is a show running for eleven freaking years. It's just the viewership rating isnt' the same as before. But hello? You could ask anyone in Korea and they could name every member of it.",
            "author": "Efficient-Aside-8919",
            "id": "h2vjmk0",
            "parent_id": "t1_h2tya01",
            "score": 9,
            "created_utc": 1624536075.0,
            "replies": [
                {
                    "body": "Doesn’t mean it’s popular… I have a friend from Seoul in market analytics. Runningman is for international fans and not really for Koreans.",
                    "author": "MigukOppa",
                    "id": "h2vurwp",
                    "parent_id": "t1_h2vjmk0",
                    "score": -4,
                    "created_utc": 1624542507.0,
                    "replies": [
                        {
                            "body": "That's just one guy.... yet all my Korean friends know Running Man and have watched it since they were kids.",
                            "author": "tacocheeze",
                            "id": "h2xt77l",
                            "parent_id": "t1_h2vurwp",
                            "score": 6,
                            "created_utc": 1624579362.0,
                            "replies": []
                        },
                        {
                            "body": "[removed]",
                            "author": null,
                            "id": "h2x70cu",
                            "parent_id": "t1_h2vurwp",
                            "score": 3,
                            "created_utc": 1624564125.0,
                            "replies": [
                                {
                                    "body": "[removed]",
                                    "author": null,
                                    "id": "h2xtixm",
                                    "parent_id": "t1_h2x70cu",
                                    "score": 4,
                                    "created_utc": 1624579538.0,
                                    "replies": []
                                },
                                {
                                    "body": "[removed]",
                                    "author": null,
                                    "id": "h2xa6w5",
                                    "parent_id": "t1_h2x70cu",
                                    "score": -1,
                                    "created_utc": 1624565572.0,
                                    "replies": [
                                        {
                                            "body": "[removed]",
                                            "author": null,
                                            "id": "h2z2n48",
                                            "parent_id": "t1_h2xa6w5",
                                            "score": 1,
                                            "created_utc": 1624608476.0,
                                            "replies": [
                                                {
                                                    "body": "[removed]",
                                                    "author": null,
                                                    "id": "h2znbzj",
                                                    "parent_id": "t1_h2z2n48",
                                                    "score": -1,
                                                    "created_utc": 1624625450.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "You mean except for the times he's already been a lead actor? \n\nIf Ahn Jae Hong can be a lead actor, LKS certainly can. It's just not going to be for traditional romantic main lead roles",
            "author": "xander_yi",
            "id": "h38dwr7",
            "parent_id": "t1_h2tya01",
            "score": 2,
            "created_utc": 1624815959.0,
            "replies": []
        },
        {
            "body": "Yep but Kwangsoo seems to go for more inventive and experimental roles rather than typical drama lead. So I think he can still find success. People like Song Kang Ho are still finding success due to their acting ability even if they don't fit into the \"typical\" drama lead look - probably because that kind of job is not even on their radar in the first place",
            "author": "justahalfling",
            "id": "h2vf5wb",
            "parent_id": "t1_h2tya01",
            "score": 1,
            "created_utc": 1624532773.0,
            "replies": []
        },
        {
            "body": "I checked and somin follows kwang soo but he still doesn’t follow her. Hopefully they become okay",
            "author": "thesagitaurus",
            "id": "h2u2b94",
            "parent_id": "t1_h2theov",
            "score": 10,
            "created_utc": 1624497039.0,
            "replies": []
        },
        {
            "body": "Thanks for that!",
            "author": "bubblegumsssss",
            "id": "h2tlo0g",
            "parent_id": "t1_h2theov",
            "score": 5,
            "created_utc": 1624488190.0,
            "replies": []
        },
        {
            "body": "The timing of everything happened I believe soon after Somin joined LKS's agency. All the awkwardness I feel was directed by King Kong Entertainment.",
            "author": "xander_yi",
            "id": "h3104bu",
            "parent_id": "t1_h2theov",
            "score": 2,
            "created_utc": 1624648267.0,
            "replies": []
        },
        {
            "body": "Oh i see. Thank you. I dont notice things like that lol",
            "author": "bubblegumsssss",
            "id": "h2tllym",
            "parent_id": "t1_h2thebj",
            "score": 14,
            "created_utc": 1624488162.0,
            "replies": []
        },
        {
            "body": "isnt somin still really quiet even after lks left?",
            "author": "shadowmushroom12",
            "id": "h2uhuld",
            "parent_id": "t1_h2thebj",
            "score": 6,
            "created_utc": 1624505320.0,
            "replies": []
        },
        {
            "body": "Was there any specific moments which is awkward? The current pairing is Sechan and JSM right now right? THey were chaotic during the beginning but by the time LKS got a girlfriend, it toned way down.",
            "author": "netgames2000",
            "id": "h2uaj9g",
            "parent_id": "t1_h2thebj",
            "score": 7,
            "created_utc": 1624501382.0,
            "replies": [
                {
                    "body": "I can't recall any particular moments that felt awkward onscreen. While the chaos did get toned down, it got to the point where they were barely even seen talking to each other onscreen within the last several months or so. Whether that was by design cause the show wanted JSM to focus on YSC is unknown but that shouldn't prevent her from interacting with other members.",
                    "author": "ScorpiusDX",
                    "id": "h2ukd20",
                    "parent_id": "t1_h2uaj9g",
                    "score": 7,
                    "created_utc": 1624506842.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Yeah I love him too. My flair is about him. But people may have different opinions",
            "author": "ALEKHYA8",
            "id": "h2x3847",
            "parent_id": "t1_h2wzjm2",
            "score": 3,
            "created_utc": 1624562413.0,
            "replies": []
        },
        {
            "body": "Doesn’t mean it’s popular… I have a friend from Seoul in market analytics. Runningman is for international fans and not really for Koreans.",
            "author": "MigukOppa",
            "id": "h2vurwp",
            "parent_id": "t1_h2vjmk0",
            "score": -4,
            "created_utc": 1624542507.0,
            "replies": [
                {
                    "body": "That's just one guy.... yet all my Korean friends know Running Man and have watched it since they were kids.",
                    "author": "tacocheeze",
                    "id": "h2xt77l",
                    "parent_id": "t1_h2vurwp",
                    "score": 6,
                    "created_utc": 1624579362.0,
                    "replies": []
                },
                {
                    "body": "[removed]",
                    "author": null,
                    "id": "h2x70cu",
                    "parent_id": "t1_h2vurwp",
                    "score": 3,
                    "created_utc": 1624564125.0,
                    "replies": [
                        {
                            "body": "[removed]",
                            "author": null,
                            "id": "h2xtixm",
                            "parent_id": "t1_h2x70cu",
                            "score": 4,
                            "created_utc": 1624579538.0,
                            "replies": []
                        },
                        {
                            "body": "[removed]",
                            "author": null,
                            "id": "h2xa6w5",
                            "parent_id": "t1_h2x70cu",
                            "score": -1,
                            "created_utc": 1624565572.0,
                            "replies": [
                                {
                                    "body": "[removed]",
                                    "author": null,
                                    "id": "h2z2n48",
                                    "parent_id": "t1_h2xa6w5",
                                    "score": 1,
                                    "created_utc": 1624608476.0,
                                    "replies": [
                                        {
                                            "body": "[removed]",
                                            "author": null,
                                            "id": "h2znbzj",
                                            "parent_id": "t1_h2z2n48",
                                            "score": -1,
                                            "created_utc": 1624625450.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I can't recall any particular moments that felt awkward onscreen. While the chaos did get toned down, it got to the point where they were barely even seen talking to each other onscreen within the last several months or so. Whether that was by design cause the show wanted JSM to focus on YSC is unknown but that shouldn't prevent her from interacting with other members.",
            "author": "ScorpiusDX",
            "id": "h2ukd20",
            "parent_id": "t1_h2uaj9g",
            "score": 7,
            "created_utc": 1624506842.0,
            "replies": []
        },
        {
            "body": "That's just one guy.... yet all my Korean friends know Running Man and have watched it since they were kids.",
            "author": "tacocheeze",
            "id": "h2xt77l",
            "parent_id": "t1_h2vurwp",
            "score": 6,
            "created_utc": 1624579362.0,
            "replies": []
        },
        {
            "body": "[removed]",
            "author": null,
            "id": "h2x70cu",
            "parent_id": "t1_h2vurwp",
            "score": 3,
            "created_utc": 1624564125.0,
            "replies": [
                {
                    "body": "[removed]",
                    "author": null,
                    "id": "h2xtixm",
                    "parent_id": "t1_h2x70cu",
                    "score": 4,
                    "created_utc": 1624579538.0,
                    "replies": []
                },
                {
                    "body": "[removed]",
                    "author": null,
                    "id": "h2xa6w5",
                    "parent_id": "t1_h2x70cu",
                    "score": -1,
                    "created_utc": 1624565572.0,
                    "replies": [
                        {
                            "body": "[removed]",
                            "author": null,
                            "id": "h2z2n48",
                            "parent_id": "t1_h2xa6w5",
                            "score": 1,
                            "created_utc": 1624608476.0,
                            "replies": [
                                {
                                    "body": "[removed]",
                                    "author": null,
                                    "id": "h2znbzj",
                                    "parent_id": "t1_h2z2n48",
                                    "score": -1,
                                    "created_utc": 1624625450.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "[removed]",
            "author": null,
            "id": "h2xtixm",
            "parent_id": "t1_h2x70cu",
            "score": 4,
            "created_utc": 1624579538.0,
            "replies": []
        },
        {
            "body": "[removed]",
            "author": null,
            "id": "h2xa6w5",
            "parent_id": "t1_h2x70cu",
            "score": -1,
            "created_utc": 1624565572.0,
            "replies": [
                {
                    "body": "[removed]",
                    "author": null,
                    "id": "h2z2n48",
                    "parent_id": "t1_h2xa6w5",
                    "score": 1,
                    "created_utc": 1624608476.0,
                    "replies": [
                        {
                            "body": "[removed]",
                            "author": null,
                            "id": "h2znbzj",
                            "parent_id": "t1_h2z2n48",
                            "score": -1,
                            "created_utc": 1624625450.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "[removed]",
            "author": null,
            "id": "h2z2n48",
            "parent_id": "t1_h2xa6w5",
            "score": 1,
            "created_utc": 1624608476.0,
            "replies": [
                {
                    "body": "[removed]",
                    "author": null,
                    "id": "h2znbzj",
                    "parent_id": "t1_h2z2n48",
                    "score": -1,
                    "created_utc": 1624625450.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[removed]",
            "author": null,
            "id": "h2znbzj",
            "parent_id": "t1_h2z2n48",
            "score": -1,
            "created_utc": 1624625450.0,
            "replies": []
        }
    ]
}