{
    "title": "Saying goodbye to the SB I love.",
    "post_id": "ichoem",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/ichoem/saying_goodbye_to_the_sb_i_love/",
    "author": "ThePapaBones",
    "body": "I had to end my arrangement with my wonderful SB. And damn it hurts.\n\nA couple of months ago she mentioned to me that she was looking at vanilla dating, I am not a very possessive man, so I gave her my blessing. We have been in a long term SR and we trust each other. So she found a lad and they have been dating full time for a couple of months. He does not know that she is my SB.\n\nI noticed the change in her over a couple of weeks and I could tell that she was truly smitten with him.\n\nIt was her birthday 2 days ago and today I saw her and we ended it.\n\nMy ex wife had an long term affair which ended our marriage 10 years ago and being cheated on is a huge trauma point for me. And over the past few weeks, I have been unable to not put myself in her boyfriend's shoes. I know how much it hurt me and I didn't want him to have to go through that pain.\n\nI adore her and I am truly heavily in love with my SB. I already miss her terribly and keep breaking into tears. I know I am making the right decision and that they should focus on each other without me in the picture. But holy hell this hurts.\n\nHow do people deal with this?",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/ichoem/saying_goodbye_to_the_sb_i_love/",
    "score": 197,
    "upvote_ratio": 0.96,
    "created_utc": 1597814522.0,
    "num_comments": 60,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "Like any relationships--grieve, mourn, and then move on with time.  All I'd recommend is taking it easy and being big on the self care.  I know a lot guys aren't into that, but it's necessary to move on in a healthy way.  Treat yourself, be easy on yourself, do your hobbies, whatever it takes to get your swagger back.",
            "author": null,
            "id": "g22nwa7",
            "parent_id": "t3_ichoem",
            "score": 68,
            "created_utc": 1597814991.0,
            "replies": [
                {
                    "body": "Echoing and amplifying this - especially given your feelings for her. It takes time ... and let's face it, most women will pick up on the wounds if you jump back too soon. \n\nGood luck, we feel for you.",
                    "author": "sfwinefan",
                    "id": "g23x5zv",
                    "parent_id": "t1_g22nwa7",
                    "score": 12,
                    "created_utc": 1597849505.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "A side note. If you still talk to your SB, do let her know that she has to be extremely careful in deciding whether to let her new bf know about her past SR.\n\nSome men can ignore the past and some just cannot look past that - as we have learnt in this sub couple of times.\n\nIn the event that she broke up with her bf in couple of months time, would you take her back?",
            "author": "eurosd",
            "id": "g22vnon",
            "parent_id": "t3_ichoem",
            "score": 30,
            "created_utc": 1597822013.0,
            "replies": [
                {
                    "body": "In all honesty. I would take her back. While she is smitten with her BF, l am pretty damn smitten with her. But l would have to be very careful.",
                    "author": "ThePapaBones",
                    "id": "g22w3fi",
                    "parent_id": "t1_g22vnon",
                    "score": 18,
                    "created_utc": 1597822457.0,
                    "replies": [
                        {
                            "body": ">If you still talk to your SB...\n\n(But also don't do this.  Remember kids, the best way to get over a breakup is to go no contact.  It sucks to have the one you love just gone from your life one day, but it's best for you.)\n\nGood luck OP!",
                            "author": null,
                            "id": "g238bgj",
                            "parent_id": "t1_g22w3fi",
                            "score": 14,
                            "created_utc": 1597835312.0,
                            "replies": [
                                {
                                    "body": "100% this. Nothing drags out the recovery like staying in touch. Let her know you’re there if she changes her mind but otherwise, you have to focus on your life.",
                                    "author": null,
                                    "id": "g242u73",
                                    "parent_id": "t1_g238bgj",
                                    "score": 6,
                                    "created_utc": 1597852218.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "As a fellow SD who thrives on getting to the level of closeness you have achieved, try to savor this moment.  That sounds strange and opposite to what others are saying but one vital stage of a sugar relationship is the ability to let them go on to another stage of their life.  Thanks to you, she knows the good aspects of a relationship and how to act to keep a healthy and loving relationship.  Some people will never get this education.  Be proud and happy you enriched someone’s life like that.  It’s part of the mentorship we can give to the SB.  \n\nAs some advice from one SD to another, one thing I like to do after leaving a deep relationship is to go on a trip.  I live in Asia so it’s easy for me to bounce to another city and pick up with a new sugar or non-sugar relationship to heal the pain.  I also find writing my thoughts and memories in 2 emails helps the healing process.  One email is to me, and the other is the departing SB.  Even though I never send either email it allows me to formalize and digest the grief and pain.  Be well fellow SD.",
            "author": "thespicyroot",
            "id": "g22ulde",
            "parent_id": "t3_ichoem",
            "score": 39,
            "created_utc": 1597820965.0,
            "replies": [
                {
                    "body": "I like that idea. Thanks mate.",
                    "author": "ThePapaBones",
                    "id": "g22urwv",
                    "parent_id": "t1_g22ulde",
                    "score": 14,
                    "created_utc": 1597821142.0,
                    "replies": [
                        {
                            "body": "Damn, those onions.\n\nEchoing u/thespicyroot When I had a longer term SR end earlier, I did something similar. I typed up a letter to the SB which shared my feelings, recapped some of my favorite positive memories, and wished her well with her life and this new relationship. I never actually sent the letter, but putting it on paper was cathartic. It wasn't a complete answer, but it helped.",
                            "author": "BinghamtonSD",
                            "id": "g23j4ge",
                            "parent_id": "t1_g22urwv",
                            "score": 7,
                            "created_utc": 1597842658.0,
                            "replies": [
                                {
                                    "body": "I'm curious why you and u/thespicyroot did not send the email.   I would think that if it's written as a \"what we had was so great, and I'll miss it, but I wish you the best of luck\" kind of thing that it would be good to send.",
                                    "author": "UseTheForceRey",
                                    "id": "g23v6c5",
                                    "parent_id": "t1_g23j4ge",
                                    "score": 2,
                                    "created_utc": 1597848557.0,
                                    "replies": [
                                        {
                                            "body": "For me, this self grieving exercise was not an external good-bye statement, but more for internal self healing to allow me to compartmentalize my feelings and emotions.  Not all those feelings and emotions are sad, and in fact, most of my writing was about the good memories.  Plus, I have always felt that the more detailed you can write into the note the better.\n\nAs an extra note.  The reason I added this experience is the OP mentioned that his SB was (or has already?) transitioned to her new beau and seemed he wanted minimal impact to let her move on.  If he sent the note, it might lead to bad feelings and make the situation worse.  If I were in his shoes, I would cut the cord and move on the best that I can.\n\nHope this helps clarify.",
                                            "author": "thespicyroot",
                                            "id": "g25fz6n",
                                            "parent_id": "t1_g23v6c5",
                                            "score": 4,
                                            "created_utc": 1597875365.0,
                                            "replies": [
                                                {
                                                    "body": "Thanks, that makes sense.",
                                                    "author": "UseTheForceRey",
                                                    "id": "g261auu",
                                                    "parent_id": "t1_g25fz6n",
                                                    "score": 1,
                                                    "created_utc": 1597886800.0,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "body": "Hmmm. One some level we had a conversation at our final coffee meet when she ended our SR, and i covered some of that ground already. I didn't think that the letter I wrote, which was more effusive and detailed, would have hit the right note after the fact. Does that make sense?",
                                            "author": "BinghamtonSD",
                                            "id": "g243056",
                                            "parent_id": "t1_g23v6c5",
                                            "score": 2,
                                            "created_utc": 1597852293.0,
                                            "replies": [
                                                {
                                                    "body": "Yeah, that makes sense.  If you’ve said enough already and more words are just your way of putting your thoughts together I can understand that.",
                                                    "author": "UseTheForceRey",
                                                    "id": "g25cwqx",
                                                    "parent_id": "t1_g243056",
                                                    "score": 2,
                                                    "created_utc": 1597873768.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "You summed it up better than I could.  Thank you kind stranger.",
                                    "author": "thespicyroot",
                                    "id": "g25g2qh",
                                    "parent_id": "t1_g23j4ge",
                                    "score": 2,
                                    "created_utc": 1597875415.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "This is some truly excellent advice.  On the surface,  it's not a natural thought process to understand this role as an SD at the natural end of a SR.  Too often, we treat the ending of a SR like an end to a vanilla relationship and may get caught up in our own insecurities or unrealistic expectations.   Consciously having the ability to allow them to move forward to a different life stage is lost on most of us I'm sure.  But this message is an excellent reminder to all SD's.  One close SA friend told me something that I will always remember as my long term SR was ending last year-\"Be proud about how you leave things with her\".  We dont want to look back, 6 months, a year or 5 years from now and regret how things were handled.   Thanks for reminding me of this.  The truth is  that it applies to all relationships.",
                    "author": "jackaustin35",
                    "id": "g28hyt1",
                    "parent_id": "t1_g22ulde",
                    "score": 3,
                    "created_utc": 1597945893.0,
                    "replies": []
                },
                {
                    "body": "I've done similar.  I use google docs on a gmail account that I don't really use much.  They remain unshared.  \nIt should be there if I want to go back and revisit those stored memories.",
                    "author": "missing_touch",
                    "id": "g24u8qv",
                    "parent_id": "t1_g22ulde",
                    "score": 2,
                    "created_utc": 1597864886.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I've been there and it's hard.  My situation was a little different but the end result was similar.   After three amazing years together,  I had to let her go.  The pain was deeper than I've ever felt.  It's been a year now and I think about her every day and still miss her badly.   The smartest thing I did was talk to someone.  Find someone you trust.   I couldn't share my situation with friends or family so I began seeing a therapist which has helped.  It gets easier but slowly.  A SR is a relationship and it can get intense so we have to be prepared to deal with the fallout when it ends. It's a loss so you need to grieve and process it.  Takes time but will get better.  Move on slowly and have fun.  Dont compare her to your next SR or the one after that.  Just enjoy the new experiences as they come with low expectations.   Best of luck to you.",
            "author": "jackaustin35",
            "id": "g22t0ce",
            "parent_id": "t3_ichoem",
            "score": 14,
            "created_utc": 1597819457.0,
            "replies": []
        },
        {
            "body": "Fuckity fuck fuck fuck. \n\nYou, Sir, are the best of us. \n\nWe borrow their youth, to make is FEEL young. It Is worth so much more than the pieces of paper we give them.\n\nKeeping her for your own, stopping her starting a life, is stealing and devouring her youth. It is evil. \n\nThe break up will hurt, the memories, of your love, for a time, will be hard.\n\nTime will pass. They will be joyous, even more so as you, Sir, are the best of us.",
            "author": null,
            "id": "g231wl2",
            "parent_id": "t3_ichoem",
            "score": 35,
            "created_utc": 1597828626.0,
            "replies": [
                {
                    "body": "This ⬆️",
                    "author": "solomon2609",
                    "id": "g24b081",
                    "parent_id": "t1_g231wl2",
                    "score": 3,
                    "created_utc": 1597856143.0,
                    "replies": []
                },
                {
                    "body": "You should post this comment as its own thread. Really beautifully said.",
                    "author": "Actually_a_bot_accnt",
                    "id": "g24y2k6",
                    "parent_id": "t1_g231wl2",
                    "score": 2,
                    "created_utc": 1597866628.0,
                    "replies": [
                        {
                            "body": "Thanks. Info my best work staring into the bottom of a empty pint jar",
                            "author": null,
                            "id": "g259l77",
                            "parent_id": "t1_g24y2k6",
                            "score": 1,
                            "created_utc": 1597872125.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "It’s hard but you made the right call. The first few days are always the worst. I’m sure she’s feeling the same pain you are.",
            "author": null,
            "id": "g22qjgo",
            "parent_id": "t3_ichoem",
            "score": 12,
            "created_utc": 1597817214.0,
            "replies": [
                {
                    "body": "Yeah, I do not doubt it. She is such a beautiful and sensitive soul. I know that continuing our arrangement would have been tearing her apart as much as it was me. I can just hope that she understands and will look on our time together fondly.",
                    "author": "ThePapaBones",
                    "id": "g22rsvx",
                    "parent_id": "t1_g22qjgo",
                    "score": 10,
                    "created_utc": 1597818345.0,
                    "replies": [
                        {
                            "body": ">I can just hope that she understands and will look on our time together fondly.\n\nThis is key. We all know these things will end. The important thing is for them to end as well as possible so both of you can look on your time together fondly.",
                            "author": "BinghamtonSD",
                            "id": "g23j9zt",
                            "parent_id": "t1_g22rsvx",
                            "score": 4,
                            "created_utc": 1597842735.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "You are a good man. Take solace in that. You know the pain being on the other side of this equation. You didn’t want to be the bearer of that pain to someone else. You can look in the mirror in the morning while you brush your teeth. The world needs more people like you. I appreciate your empathy and I thank you",
            "author": "medicus_vulneratum",
            "id": "g22rzn0",
            "parent_id": "t3_ichoem",
            "score": 21,
            "created_utc": 1597818514.0,
            "replies": []
        },
        {
            "body": "You are a good man, it takes time but it gets better and look for another Sb, just go slow",
            "author": null,
            "id": "g22o4fd",
            "parent_id": "t3_ichoem",
            "score": 16,
            "created_utc": 1597815169.0,
            "replies": []
        },
        {
            "body": "I can understand how that on both sides, SD/SB, one can develop strong feelings (in love)  You made the right call. Letting go hurts so be kind to yourself during this period. And though it sounds like you both made the decision to move on, you had more than an inkling when your (I presume much younger) SB wanted to 'vanilla' date, that was ultimately her decision, but at least she was honest with you, which is good. You refer to her now boyfriend as a 'lad', and that she found POT love with him so holding on to her would have served no one, least of all you. Sounds like you have a heart of gold. Curious, have you considered vanilla dating yourself?",
            "author": "Professional-Bad-236",
            "id": "g22wihk",
            "parent_id": "t3_ichoem",
            "score": 6,
            "created_utc": 1597822890.0,
            "replies": [
                {
                    "body": "I would love to vanilla date. Pre covid my work hours were 10-14hrs a day at points. So maintaining relationships especially when l also travelled for work, was difficult.\nWhen l love, l fall hard, and l do believe that she loved me. We could not have had the fantastic connection otherwise. My SB just turned 23 and l am 46. So you are correct.",
                    "author": "ThePapaBones",
                    "id": "g22wodc",
                    "parent_id": "t1_g22wihk",
                    "score": 4,
                    "created_utc": 1597823062.0,
                    "replies": [
                        {
                            "body": "I can understand an arrangement makes sense given your hours. I'm sure your SB loved.cared about you from the sounds of things, though you were 'in love' with her. She's a young woman who may want marriage kids one day, You are both at two different stages in life. I know for myself I have created intimacy with someone where there's less likelihood of getting hurt. I suspect the pain you felt from your ex's infidelity hurts more than saying goodbye to this young girl. I'm sorry that happened. You deserve a love to be reciprocated and from a partner who won't 'cheat'. Give yourself space now to mourn, and when ready, another arrangement, but do consider a woman at a similar place in life closer to your age as well.",
                            "author": "Professional-Bad-236",
                            "id": "g22ynzp",
                            "parent_id": "t1_g22wodc",
                            "score": 4,
                            "created_utc": 1597825150.0,
                            "replies": [
                                {
                                    "body": "Thanks for the understanding and perspective there mate. I appreciate it.",
                                    "author": "ThePapaBones",
                                    "id": "g22yup5",
                                    "parent_id": "t1_g22ynzp",
                                    "score": 4,
                                    "created_utc": 1597825350.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "What a lot of people don't understand, but you clearly do, is that real love requires sacrifice. Take your time to get over it, but keep your head up high and the good memories alive.",
            "author": "Cledaddy23",
            "id": "g23kd9e",
            "parent_id": "t3_ichoem",
            "score": 5,
            "created_utc": 1597843277.0,
            "replies": []
        },
        {
            "body": "You, sir, are a good man. You love her enough to let her go.",
            "author": "Inacompetent",
            "id": "g23ksyu",
            "parent_id": "t3_ichoem",
            "score": 5,
            "created_utc": 1597843497.0,
            "replies": []
        },
        {
            "body": "This made my day. I'm sorry for your pain and loss, but so proud of your integrity and genuine love. I'm so burnt out on the bowl scene. This made my heart smile. ❤",
            "author": "nucple2xplor",
            "id": "g23n042",
            "parent_id": "t3_ichoem",
            "score": 3,
            "created_utc": 1597844551.0,
            "replies": []
        },
        {
            "body": "When I was 19 I fell in love with a man 25 years my senior. It was to outsiders a SB relationship, but we met in the vanilla world and our passion was unmatchable. \n\nAfter 3 years and college ending I knew marriage was not in the cards. He told me up front, but I knew we were in different places. We had a “Break up” dinner a month after ending it. He said he would marry me if that’s what I needed, but there was no ring... or anything symbolic of a ring. I stayed firm.\n\n20 years have passed. He grew his businesses, dated, experienced love but that too passed. I married a year after. He had actually sent me a new luggage set when he heard I would travel with my soon to be fiancé, later husband, to Europe. \n\nWe checked in every few years. I will always love him and be there if he needed me. Every relationship and situation is different. I am of the belief we can love someone forever, even if a traditional relationship is not in the cards.\n\nGive it time. Work on what makes you happy. Be happy for her, but let her know you are always there.",
            "author": "Copperdelight",
            "id": "g24lzkb",
            "parent_id": "t3_ichoem",
            "score": 4,
            "created_utc": 1597861258.0,
            "replies": []
        },
        {
            "body": "I am so very sorry you have had to go through this. It is of course the right decision but that doesn’t make it any easier. \n\nAll I can do is echo what has already been said: focus on taking care of yourself, talk to somebody (I’m a huge believer in therapy but a trusted friend is good too), take time before searching for another partner. \n\nu/whynotbehappynow is right. You are one of the best. *huge hugs*",
            "author": "Layla_Fox2",
            "id": "g2354uv",
            "parent_id": "t3_ichoem",
            "score": 3,
            "created_utc": 1597832097.0,
            "replies": []
        },
        {
            "body": "The best exit out of an SR is to leave your SB in a good place where she feels happy! Glad you are thinking along those lines and moving on. You will find someone new in due course. Nature of SRs is they come with an expiry date.",
            "author": null,
            "id": "g23fuaj",
            "parent_id": "t3_ichoem",
            "score": 3,
            "created_utc": 1597840907.0,
            "replies": []
        },
        {
            "body": "I had exactly the same thing happen.  I will not even say she was a SB with me it was just a difference of 30 years and I acted more as a mentor.  I was as in love as I was with my first great love 30 years before that.   She had broken up with two other young men she liked and had started dating because she had been honest about me and they could not deal with it.  So one day again she met someone her age, and this time I could see how much she liked him and I stepped up and said listen do not tell him about me and let us end this so that you can have a life with someone your own age.\n\nShe is still with him two years later.  We see each other for coffee one every 6 months or so.  I still love her, I never will stop doing so.  But with 30 years difference I could never have given her the life she thinks she wants now.",
            "author": "montrealthreesomes",
            "id": "g23qrvn",
            "parent_id": "t3_ichoem",
            "score": 3,
            "created_utc": 1597846424.0,
            "replies": []
        },
        {
            "body": "Sorry for your pain but this post and the amazing response has lifted my spirits about this forum.  I have been seriously disappointed in some of the recent posts and felt very disenchanted with it.  But seeing the excellent responses has renewed my faith in this sub.\n\nYou are an awesome person.  Please take time to process and know you did good!",
            "author": "MrsCurious4",
            "id": "g24c2sb",
            "parent_id": "t3_ichoem",
            "score": 3,
            "created_utc": 1597856649.0,
            "replies": []
        },
        {
            "body": "A sweet and caring man like yourself that thinks of others and their feelings and puts good in the world will revieve it back. Sorry to hear it ended, but just remember that closing that door will only open another. Take care of yourself 😊",
            "author": "w4termelonsug4r",
            "id": "g24ztfc",
            "parent_id": "t3_ichoem",
            "score": 3,
            "created_utc": 1597867453.0,
            "replies": []
        },
        {
            "body": "If she was ok with seeing the both of you, why stop it. You said you don't want to be an accomplice to cheating. Sucks that she put you in a position that you couldn't participate in. \n\nIf the boyfriend was aware of you and ok with it, would you stay with her?",
            "author": "ElementShow",
            "id": "g23qhd3",
            "parent_id": "t3_ichoem",
            "score": 2,
            "created_utc": 1597846281.0,
            "replies": [
                {
                    "body": "That would mean that there was consent on all 3 parties. But I do not know how mature I was at his age to consider the arrangement staying. But I could see it was causing her pain as well. I think that their love came as a surprise to her as much as me. She knows how much I love her, and I can recognize that mirrored in her for him.",
                    "author": "ThePapaBones",
                    "id": "g2640r7",
                    "parent_id": "t1_g23qhd3",
                    "score": 1,
                    "created_utc": 1597888290.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Incredible timing to come across this, I just ended my SR last night.  I’m prepared to deal with it but yes it hurts and maybe very disruptive to my day to day for awhile (hope not).  I plan to focus on self care and continue building my businesses.  Good luck man, just know you’re not alone out there.",
            "author": "jundoima",
            "id": "g243qx3",
            "parent_id": "t3_ichoem",
            "score": 2,
            "created_utc": 1597852633.0,
            "replies": []
        },
        {
            "body": "I'm so sorry. That's so rotten feeling.",
            "author": "Imworkingwitch",
            "id": "g24alc5",
            "parent_id": "t3_ichoem",
            "score": 2,
            "created_utc": 1597855942.0,
            "replies": []
        },
        {
            "body": "One day at a time 🖤 sorry you're hurting",
            "author": "Theycallm3margo1",
            "id": "g24obi8",
            "parent_id": "t3_ichoem",
            "score": 2,
            "created_utc": 1597862281.0,
            "replies": []
        },
        {
            "body": "I am sorry you’re experiencing heartache over this. And I do not mean to minimize your pain when I say I truly envy that you got to experience that. I hope I will get that kind of healing connection someday.",
            "author": null,
            "id": "g24sglq",
            "parent_id": "t3_ichoem",
            "score": 2,
            "created_utc": 1597864118.0,
            "replies": []
        },
        {
            "body": "I am so sorry that happened to you. I strive to find a SD/SM that cares deeply about me like that. I don't necessarily agree that you have to cut her out of your life, not all break ups require cutting eachother off. If you feel you can't handle having her in your life anymore that is different but sometimes you can still maintain an amazing friendship. Take care <3",
            "author": "bongsprodom",
            "id": "g25sp45",
            "parent_id": "t3_ichoem",
            "score": 2,
            "created_utc": 1597882136.0,
            "replies": []
        },
        {
            "body": "The total agony of love! Ugh. Feel happy soon! You’ll find someone special 😉😊",
            "author": "TresChicPetite14",
            "id": "g25t6mz",
            "parent_id": "t3_ichoem",
            "score": 2,
            "created_utc": 1597882400.0,
            "replies": []
        },
        {
            "body": "Thanks for the support folks. It is really appreciated.\n\nWhile I understand the sentiment of advice to just find a new SB, I am confident that that would not be helpful emotionally or mentally for me atm.\n\nI would rather find eventually find someone quality (like her) than just filling a void.\n\nAnd I am more like u/Copperdelight, I tend not to fall out of love. It is still always there, instead I take pleasure in their future success, knowing that I may have helped, than in their physical and emotional company.\n\nBut I am also a hopeless romantic.\n\nThanks Family, you have really helped at a tough time.",
            "author": "ThePapaBones",
            "id": "g2670aw",
            "parent_id": "t3_ichoem",
            "score": 2,
            "created_utc": 1597889934.0,
            "replies": []
        },
        {
            "body": "I just went through the exact same thing. We suspended things in March due to COVID (we are in NYC). We kept talking every week or so. She moved to a new place and ran into a guy she met when she was 15 and he was 18; she had a huge teen crush on him and was FWB for a year after she graduated college. He ran into her and could not believe how confident and self-assured she had become. She told him she had no interest in him because of how he treated her in the past, and he basically groveled at her feet for six weeks before she took him back. She is Ukrainian and her parents married at 17 and are upset that she wasn't even dating anyone at 25. So they are now very serious and I went through what you went through - we loved each other - and I felt dumped, etc. - but now I am talking online to a few amazing women and trying to decide who will be my next and taking pride in how I impacted here life.  PS - a note she sent me after the end has become my new \"marketing material\" - she thinks it's great.",
            "author": null,
            "id": "g2aptis",
            "parent_id": "t3_ichoem",
            "score": 2,
            "created_utc": 1597986622.0,
            "replies": []
        },
        {
            "body": "Keep the line of communication open there and let her know that if you’re single when she’s single and be willing to take her back. The odds are that in our boyfriend will be the flavor of the month he’ll do something stupid and she’ll come back",
            "author": "ruphun",
            "id": "g2393do",
            "parent_id": "t3_ichoem",
            "score": 2,
            "created_utc": 1597836018.0,
            "replies": []
        },
        {
            "body": "Sorry for your loss. But you are giving her the best shot at success with the vanilla. Other partners in the picture divide loyalty and can sabotage chances for true connection. \n\nThe good news is she might be back once the vanilla proves himself to not measure up to what she has been used to.",
            "author": "GSSD",
            "id": "g23d7r4",
            "parent_id": "t3_ichoem",
            "score": 2,
            "created_utc": 1597839400.0,
            "replies": []
        },
        {
            "body": "1) don't get married\n\n2) find another SB, there's plenty of them in the bowl",
            "author": "UnearthlyDinosaur",
            "id": "g2aby9e",
            "parent_id": "t3_ichoem",
            "score": 1,
            "created_utc": 1597977794.0,
            "replies": []
        },
        {
            "body": "Find another SB\n\nBut I am sorry for you",
            "author": "BigBearSD",
            "id": "g23co5e",
            "parent_id": "t3_ichoem",
            "score": -1,
            "created_utc": 1597838999.0,
            "replies": []
        },
        {
            "body": "You have to live with this choice or fight to get her back.  If not willing to do that, then deal with the pain and eventually it will get better.  I still pine for my old SB, things happened that ruined it, but I live with the pain as just part of my life.\n\nI feel sorry that you are hurting though.  Wish more people saw that there should be more to this than sex and money.",
            "author": "SelectIndependence3",
            "id": "g23uaxl",
            "parent_id": "t3_ichoem",
            "score": 0,
            "created_utc": 1597848144.0,
            "replies": []
        },
        {
            "body": "You'll probably get a text once her account is getting low. Js. They usually come back. In one way or another.",
            "author": "dade_murphy1",
            "id": "g24d3ne",
            "parent_id": "t3_ichoem",
            "score": -2,
            "created_utc": 1597857117.0,
            "replies": []
        },
        {
            "body": "Wait what? You ended your long term affair because...your wife was having a LONG TERM AFFAIR?Seriously now.",
            "author": "nemo69_1999",
            "id": "g22p26n",
            "parent_id": "t3_ichoem",
            "score": -11,
            "created_utc": 1597815944.0,
            "replies": [
                {
                    "body": "No. My wife and I divorced 10 years ago. I ended my SR because I was unable not to associate my past pain, with her Vanilla Boyfriend. Something was bound to slip, he would see a message or something and I know how that pain feels.",
                    "author": "ThePapaBones",
                    "id": "g22pa8x",
                    "parent_id": "t1_g22p26n",
                    "score": 8,
                    "created_utc": 1597816128.0,
                    "replies": [
                        {
                            "body": "Integrity and character. You did the right thing.",
                            "author": "clair-cummings",
                            "id": "g22w5nz",
                            "parent_id": "t1_g22pa8x",
                            "score": 6,
                            "created_utc": 1597822521.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Echoing and amplifying this - especially given your feelings for her. It takes time ... and let's face it, most women will pick up on the wounds if you jump back too soon. \n\nGood luck, we feel for you.",
            "author": "sfwinefan",
            "id": "g23x5zv",
            "parent_id": "t1_g22nwa7",
            "score": 12,
            "created_utc": 1597849505.0,
            "replies": []
        },
        {
            "body": "In all honesty. I would take her back. While she is smitten with her BF, l am pretty damn smitten with her. But l would have to be very careful.",
            "author": "ThePapaBones",
            "id": "g22w3fi",
            "parent_id": "t1_g22vnon",
            "score": 18,
            "created_utc": 1597822457.0,
            "replies": [
                {
                    "body": ">If you still talk to your SB...\n\n(But also don't do this.  Remember kids, the best way to get over a breakup is to go no contact.  It sucks to have the one you love just gone from your life one day, but it's best for you.)\n\nGood luck OP!",
                    "author": null,
                    "id": "g238bgj",
                    "parent_id": "t1_g22w3fi",
                    "score": 14,
                    "created_utc": 1597835312.0,
                    "replies": [
                        {
                            "body": "100% this. Nothing drags out the recovery like staying in touch. Let her know you’re there if she changes her mind but otherwise, you have to focus on your life.",
                            "author": null,
                            "id": "g242u73",
                            "parent_id": "t1_g238bgj",
                            "score": 6,
                            "created_utc": 1597852218.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I like that idea. Thanks mate.",
            "author": "ThePapaBones",
            "id": "g22urwv",
            "parent_id": "t1_g22ulde",
            "score": 14,
            "created_utc": 1597821142.0,
            "replies": [
                {
                    "body": "Damn, those onions.\n\nEchoing u/thespicyroot When I had a longer term SR end earlier, I did something similar. I typed up a letter to the SB which shared my feelings, recapped some of my favorite positive memories, and wished her well with her life and this new relationship. I never actually sent the letter, but putting it on paper was cathartic. It wasn't a complete answer, but it helped.",
                    "author": "BinghamtonSD",
                    "id": "g23j4ge",
                    "parent_id": "t1_g22urwv",
                    "score": 7,
                    "created_utc": 1597842658.0,
                    "replies": [
                        {
                            "body": "I'm curious why you and u/thespicyroot did not send the email.   I would think that if it's written as a \"what we had was so great, and I'll miss it, but I wish you the best of luck\" kind of thing that it would be good to send.",
                            "author": "UseTheForceRey",
                            "id": "g23v6c5",
                            "parent_id": "t1_g23j4ge",
                            "score": 2,
                            "created_utc": 1597848557.0,
                            "replies": [
                                {
                                    "body": "For me, this self grieving exercise was not an external good-bye statement, but more for internal self healing to allow me to compartmentalize my feelings and emotions.  Not all those feelings and emotions are sad, and in fact, most of my writing was about the good memories.  Plus, I have always felt that the more detailed you can write into the note the better.\n\nAs an extra note.  The reason I added this experience is the OP mentioned that his SB was (or has already?) transitioned to her new beau and seemed he wanted minimal impact to let her move on.  If he sent the note, it might lead to bad feelings and make the situation worse.  If I were in his shoes, I would cut the cord and move on the best that I can.\n\nHope this helps clarify.",
                                    "author": "thespicyroot",
                                    "id": "g25fz6n",
                                    "parent_id": "t1_g23v6c5",
                                    "score": 4,
                                    "created_utc": 1597875365.0,
                                    "replies": [
                                        {
                                            "body": "Thanks, that makes sense.",
                                            "author": "UseTheForceRey",
                                            "id": "g261auu",
                                            "parent_id": "t1_g25fz6n",
                                            "score": 1,
                                            "created_utc": 1597886800.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "Hmmm. One some level we had a conversation at our final coffee meet when she ended our SR, and i covered some of that ground already. I didn't think that the letter I wrote, which was more effusive and detailed, would have hit the right note after the fact. Does that make sense?",
                                    "author": "BinghamtonSD",
                                    "id": "g243056",
                                    "parent_id": "t1_g23v6c5",
                                    "score": 2,
                                    "created_utc": 1597852293.0,
                                    "replies": [
                                        {
                                            "body": "Yeah, that makes sense.  If you’ve said enough already and more words are just your way of putting your thoughts together I can understand that.",
                                            "author": "UseTheForceRey",
                                            "id": "g25cwqx",
                                            "parent_id": "t1_g243056",
                                            "score": 2,
                                            "created_utc": 1597873768.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "You summed it up better than I could.  Thank you kind stranger.",
                            "author": "thespicyroot",
                            "id": "g25g2qh",
                            "parent_id": "t1_g23j4ge",
                            "score": 2,
                            "created_utc": 1597875415.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "This is some truly excellent advice.  On the surface,  it's not a natural thought process to understand this role as an SD at the natural end of a SR.  Too often, we treat the ending of a SR like an end to a vanilla relationship and may get caught up in our own insecurities or unrealistic expectations.   Consciously having the ability to allow them to move forward to a different life stage is lost on most of us I'm sure.  But this message is an excellent reminder to all SD's.  One close SA friend told me something that I will always remember as my long term SR was ending last year-\"Be proud about how you leave things with her\".  We dont want to look back, 6 months, a year or 5 years from now and regret how things were handled.   Thanks for reminding me of this.  The truth is  that it applies to all relationships.",
            "author": "jackaustin35",
            "id": "g28hyt1",
            "parent_id": "t1_g22ulde",
            "score": 3,
            "created_utc": 1597945893.0,
            "replies": []
        },
        {
            "body": "I've done similar.  I use google docs on a gmail account that I don't really use much.  They remain unshared.  \nIt should be there if I want to go back and revisit those stored memories.",
            "author": "missing_touch",
            "id": "g24u8qv",
            "parent_id": "t1_g22ulde",
            "score": 2,
            "created_utc": 1597864886.0,
            "replies": []
        },
        {
            "body": "This ⬆️",
            "author": "solomon2609",
            "id": "g24b081",
            "parent_id": "t1_g231wl2",
            "score": 3,
            "created_utc": 1597856143.0,
            "replies": []
        },
        {
            "body": "You should post this comment as its own thread. Really beautifully said.",
            "author": "Actually_a_bot_accnt",
            "id": "g24y2k6",
            "parent_id": "t1_g231wl2",
            "score": 2,
            "created_utc": 1597866628.0,
            "replies": [
                {
                    "body": "Thanks. Info my best work staring into the bottom of a empty pint jar",
                    "author": null,
                    "id": "g259l77",
                    "parent_id": "t1_g24y2k6",
                    "score": 1,
                    "created_utc": 1597872125.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Yeah, I do not doubt it. She is such a beautiful and sensitive soul. I know that continuing our arrangement would have been tearing her apart as much as it was me. I can just hope that she understands and will look on our time together fondly.",
            "author": "ThePapaBones",
            "id": "g22rsvx",
            "parent_id": "t1_g22qjgo",
            "score": 10,
            "created_utc": 1597818345.0,
            "replies": [
                {
                    "body": ">I can just hope that she understands and will look on our time together fondly.\n\nThis is key. We all know these things will end. The important thing is for them to end as well as possible so both of you can look on your time together fondly.",
                    "author": "BinghamtonSD",
                    "id": "g23j9zt",
                    "parent_id": "t1_g22rsvx",
                    "score": 4,
                    "created_utc": 1597842735.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I would love to vanilla date. Pre covid my work hours were 10-14hrs a day at points. So maintaining relationships especially when l also travelled for work, was difficult.\nWhen l love, l fall hard, and l do believe that she loved me. We could not have had the fantastic connection otherwise. My SB just turned 23 and l am 46. So you are correct.",
            "author": "ThePapaBones",
            "id": "g22wodc",
            "parent_id": "t1_g22wihk",
            "score": 4,
            "created_utc": 1597823062.0,
            "replies": [
                {
                    "body": "I can understand an arrangement makes sense given your hours. I'm sure your SB loved.cared about you from the sounds of things, though you were 'in love' with her. She's a young woman who may want marriage kids one day, You are both at two different stages in life. I know for myself I have created intimacy with someone where there's less likelihood of getting hurt. I suspect the pain you felt from your ex's infidelity hurts more than saying goodbye to this young girl. I'm sorry that happened. You deserve a love to be reciprocated and from a partner who won't 'cheat'. Give yourself space now to mourn, and when ready, another arrangement, but do consider a woman at a similar place in life closer to your age as well.",
                    "author": "Professional-Bad-236",
                    "id": "g22ynzp",
                    "parent_id": "t1_g22wodc",
                    "score": 4,
                    "created_utc": 1597825150.0,
                    "replies": [
                        {
                            "body": "Thanks for the understanding and perspective there mate. I appreciate it.",
                            "author": "ThePapaBones",
                            "id": "g22yup5",
                            "parent_id": "t1_g22ynzp",
                            "score": 4,
                            "created_utc": 1597825350.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "That would mean that there was consent on all 3 parties. But I do not know how mature I was at his age to consider the arrangement staying. But I could see it was causing her pain as well. I think that their love came as a surprise to her as much as me. She knows how much I love her, and I can recognize that mirrored in her for him.",
            "author": "ThePapaBones",
            "id": "g2640r7",
            "parent_id": "t1_g23qhd3",
            "score": 1,
            "created_utc": 1597888290.0,
            "replies": []
        },
        {
            "body": "No. My wife and I divorced 10 years ago. I ended my SR because I was unable not to associate my past pain, with her Vanilla Boyfriend. Something was bound to slip, he would see a message or something and I know how that pain feels.",
            "author": "ThePapaBones",
            "id": "g22pa8x",
            "parent_id": "t1_g22p26n",
            "score": 8,
            "created_utc": 1597816128.0,
            "replies": [
                {
                    "body": "Integrity and character. You did the right thing.",
                    "author": "clair-cummings",
                    "id": "g22w5nz",
                    "parent_id": "t1_g22pa8x",
                    "score": 6,
                    "created_utc": 1597822521.0,
                    "replies": []
                }
            ]
        },
        {
            "body": ">If you still talk to your SB...\n\n(But also don't do this.  Remember kids, the best way to get over a breakup is to go no contact.  It sucks to have the one you love just gone from your life one day, but it's best for you.)\n\nGood luck OP!",
            "author": null,
            "id": "g238bgj",
            "parent_id": "t1_g22w3fi",
            "score": 14,
            "created_utc": 1597835312.0,
            "replies": [
                {
                    "body": "100% this. Nothing drags out the recovery like staying in touch. Let her know you’re there if she changes her mind but otherwise, you have to focus on your life.",
                    "author": null,
                    "id": "g242u73",
                    "parent_id": "t1_g238bgj",
                    "score": 6,
                    "created_utc": 1597852218.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Damn, those onions.\n\nEchoing u/thespicyroot When I had a longer term SR end earlier, I did something similar. I typed up a letter to the SB which shared my feelings, recapped some of my favorite positive memories, and wished her well with her life and this new relationship. I never actually sent the letter, but putting it on paper was cathartic. It wasn't a complete answer, but it helped.",
            "author": "BinghamtonSD",
            "id": "g23j4ge",
            "parent_id": "t1_g22urwv",
            "score": 7,
            "created_utc": 1597842658.0,
            "replies": [
                {
                    "body": "I'm curious why you and u/thespicyroot did not send the email.   I would think that if it's written as a \"what we had was so great, and I'll miss it, but I wish you the best of luck\" kind of thing that it would be good to send.",
                    "author": "UseTheForceRey",
                    "id": "g23v6c5",
                    "parent_id": "t1_g23j4ge",
                    "score": 2,
                    "created_utc": 1597848557.0,
                    "replies": [
                        {
                            "body": "For me, this self grieving exercise was not an external good-bye statement, but more for internal self healing to allow me to compartmentalize my feelings and emotions.  Not all those feelings and emotions are sad, and in fact, most of my writing was about the good memories.  Plus, I have always felt that the more detailed you can write into the note the better.\n\nAs an extra note.  The reason I added this experience is the OP mentioned that his SB was (or has already?) transitioned to her new beau and seemed he wanted minimal impact to let her move on.  If he sent the note, it might lead to bad feelings and make the situation worse.  If I were in his shoes, I would cut the cord and move on the best that I can.\n\nHope this helps clarify.",
                            "author": "thespicyroot",
                            "id": "g25fz6n",
                            "parent_id": "t1_g23v6c5",
                            "score": 4,
                            "created_utc": 1597875365.0,
                            "replies": [
                                {
                                    "body": "Thanks, that makes sense.",
                                    "author": "UseTheForceRey",
                                    "id": "g261auu",
                                    "parent_id": "t1_g25fz6n",
                                    "score": 1,
                                    "created_utc": 1597886800.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "Hmmm. One some level we had a conversation at our final coffee meet when she ended our SR, and i covered some of that ground already. I didn't think that the letter I wrote, which was more effusive and detailed, would have hit the right note after the fact. Does that make sense?",
                            "author": "BinghamtonSD",
                            "id": "g243056",
                            "parent_id": "t1_g23v6c5",
                            "score": 2,
                            "created_utc": 1597852293.0,
                            "replies": [
                                {
                                    "body": "Yeah, that makes sense.  If you’ve said enough already and more words are just your way of putting your thoughts together I can understand that.",
                                    "author": "UseTheForceRey",
                                    "id": "g25cwqx",
                                    "parent_id": "t1_g243056",
                                    "score": 2,
                                    "created_utc": 1597873768.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "You summed it up better than I could.  Thank you kind stranger.",
                    "author": "thespicyroot",
                    "id": "g25g2qh",
                    "parent_id": "t1_g23j4ge",
                    "score": 2,
                    "created_utc": 1597875415.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Thanks. Info my best work staring into the bottom of a empty pint jar",
            "author": null,
            "id": "g259l77",
            "parent_id": "t1_g24y2k6",
            "score": 1,
            "created_utc": 1597872125.0,
            "replies": []
        },
        {
            "body": ">I can just hope that she understands and will look on our time together fondly.\n\nThis is key. We all know these things will end. The important thing is for them to end as well as possible so both of you can look on your time together fondly.",
            "author": "BinghamtonSD",
            "id": "g23j9zt",
            "parent_id": "t1_g22rsvx",
            "score": 4,
            "created_utc": 1597842735.0,
            "replies": []
        },
        {
            "body": "I can understand an arrangement makes sense given your hours. I'm sure your SB loved.cared about you from the sounds of things, though you were 'in love' with her. She's a young woman who may want marriage kids one day, You are both at two different stages in life. I know for myself I have created intimacy with someone where there's less likelihood of getting hurt. I suspect the pain you felt from your ex's infidelity hurts more than saying goodbye to this young girl. I'm sorry that happened. You deserve a love to be reciprocated and from a partner who won't 'cheat'. Give yourself space now to mourn, and when ready, another arrangement, but do consider a woman at a similar place in life closer to your age as well.",
            "author": "Professional-Bad-236",
            "id": "g22ynzp",
            "parent_id": "t1_g22wodc",
            "score": 4,
            "created_utc": 1597825150.0,
            "replies": [
                {
                    "body": "Thanks for the understanding and perspective there mate. I appreciate it.",
                    "author": "ThePapaBones",
                    "id": "g22yup5",
                    "parent_id": "t1_g22ynzp",
                    "score": 4,
                    "created_utc": 1597825350.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Integrity and character. You did the right thing.",
            "author": "clair-cummings",
            "id": "g22w5nz",
            "parent_id": "t1_g22pa8x",
            "score": 6,
            "created_utc": 1597822521.0,
            "replies": []
        },
        {
            "body": "100% this. Nothing drags out the recovery like staying in touch. Let her know you’re there if she changes her mind but otherwise, you have to focus on your life.",
            "author": null,
            "id": "g242u73",
            "parent_id": "t1_g238bgj",
            "score": 6,
            "created_utc": 1597852218.0,
            "replies": []
        },
        {
            "body": "I'm curious why you and u/thespicyroot did not send the email.   I would think that if it's written as a \"what we had was so great, and I'll miss it, but I wish you the best of luck\" kind of thing that it would be good to send.",
            "author": "UseTheForceRey",
            "id": "g23v6c5",
            "parent_id": "t1_g23j4ge",
            "score": 2,
            "created_utc": 1597848557.0,
            "replies": [
                {
                    "body": "For me, this self grieving exercise was not an external good-bye statement, but more for internal self healing to allow me to compartmentalize my feelings and emotions.  Not all those feelings and emotions are sad, and in fact, most of my writing was about the good memories.  Plus, I have always felt that the more detailed you can write into the note the better.\n\nAs an extra note.  The reason I added this experience is the OP mentioned that his SB was (or has already?) transitioned to her new beau and seemed he wanted minimal impact to let her move on.  If he sent the note, it might lead to bad feelings and make the situation worse.  If I were in his shoes, I would cut the cord and move on the best that I can.\n\nHope this helps clarify.",
                    "author": "thespicyroot",
                    "id": "g25fz6n",
                    "parent_id": "t1_g23v6c5",
                    "score": 4,
                    "created_utc": 1597875365.0,
                    "replies": [
                        {
                            "body": "Thanks, that makes sense.",
                            "author": "UseTheForceRey",
                            "id": "g261auu",
                            "parent_id": "t1_g25fz6n",
                            "score": 1,
                            "created_utc": 1597886800.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Hmmm. One some level we had a conversation at our final coffee meet when she ended our SR, and i covered some of that ground already. I didn't think that the letter I wrote, which was more effusive and detailed, would have hit the right note after the fact. Does that make sense?",
                    "author": "BinghamtonSD",
                    "id": "g243056",
                    "parent_id": "t1_g23v6c5",
                    "score": 2,
                    "created_utc": 1597852293.0,
                    "replies": [
                        {
                            "body": "Yeah, that makes sense.  If you’ve said enough already and more words are just your way of putting your thoughts together I can understand that.",
                            "author": "UseTheForceRey",
                            "id": "g25cwqx",
                            "parent_id": "t1_g243056",
                            "score": 2,
                            "created_utc": 1597873768.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "You summed it up better than I could.  Thank you kind stranger.",
            "author": "thespicyroot",
            "id": "g25g2qh",
            "parent_id": "t1_g23j4ge",
            "score": 2,
            "created_utc": 1597875415.0,
            "replies": []
        },
        {
            "body": "Thanks for the understanding and perspective there mate. I appreciate it.",
            "author": "ThePapaBones",
            "id": "g22yup5",
            "parent_id": "t1_g22ynzp",
            "score": 4,
            "created_utc": 1597825350.0,
            "replies": []
        },
        {
            "body": "For me, this self grieving exercise was not an external good-bye statement, but more for internal self healing to allow me to compartmentalize my feelings and emotions.  Not all those feelings and emotions are sad, and in fact, most of my writing was about the good memories.  Plus, I have always felt that the more detailed you can write into the note the better.\n\nAs an extra note.  The reason I added this experience is the OP mentioned that his SB was (or has already?) transitioned to her new beau and seemed he wanted minimal impact to let her move on.  If he sent the note, it might lead to bad feelings and make the situation worse.  If I were in his shoes, I would cut the cord and move on the best that I can.\n\nHope this helps clarify.",
            "author": "thespicyroot",
            "id": "g25fz6n",
            "parent_id": "t1_g23v6c5",
            "score": 4,
            "created_utc": 1597875365.0,
            "replies": [
                {
                    "body": "Thanks, that makes sense.",
                    "author": "UseTheForceRey",
                    "id": "g261auu",
                    "parent_id": "t1_g25fz6n",
                    "score": 1,
                    "created_utc": 1597886800.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Hmmm. One some level we had a conversation at our final coffee meet when she ended our SR, and i covered some of that ground already. I didn't think that the letter I wrote, which was more effusive and detailed, would have hit the right note after the fact. Does that make sense?",
            "author": "BinghamtonSD",
            "id": "g243056",
            "parent_id": "t1_g23v6c5",
            "score": 2,
            "created_utc": 1597852293.0,
            "replies": [
                {
                    "body": "Yeah, that makes sense.  If you’ve said enough already and more words are just your way of putting your thoughts together I can understand that.",
                    "author": "UseTheForceRey",
                    "id": "g25cwqx",
                    "parent_id": "t1_g243056",
                    "score": 2,
                    "created_utc": 1597873768.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Thanks, that makes sense.",
            "author": "UseTheForceRey",
            "id": "g261auu",
            "parent_id": "t1_g25fz6n",
            "score": 1,
            "created_utc": 1597886800.0,
            "replies": []
        },
        {
            "body": "Yeah, that makes sense.  If you’ve said enough already and more words are just your way of putting your thoughts together I can understand that.",
            "author": "UseTheForceRey",
            "id": "g25cwqx",
            "parent_id": "t1_g243056",
            "score": 2,
            "created_utc": 1597873768.0,
            "replies": []
        }
    ]
}