{
    "title": "The question shouldn't be \"Am I too old?\" But rather \"Am I attractive Enough?\"",
    "post_id": "mwt0j1",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/mwt0j1/the_question_shouldnt_be_am_i_too_old_but_rather/",
    "author": "BigBearSD",
    "body": "We see this question a lot, and a lot of times by surprisingly young women / people. No you are not too old, unless you are retirement age / close to it, then yeah you probably are for the majority. \n\nYes, there are a lot of SDs who prefer them young. And that's fine. But plenty are open to late 20s on up crowd (using that as a loose age, since that's when we see a lot of women asking the question). I know some guys, such as me, prefer a woman with some life experience / maturity etc... vs. Immaturity, naivety,  flakeness etc...\n\nBut the elephant in the room crux of this question shouldn't be are you too old, but rather are you attractive enough? \n\nThe bowl is a shallow place by in large. Age is relatively irrelevant, but looks are not. Looks get you in the door. \n\nSo instead of \"Am I too old?\" Maybe think \"Do I look good at my age?\" E.g., a 40 something frumpy house frau type, OR a hot 40 something fitness guru. \n\nIf the former you will have problems finding an SD, if the latter you shouldn't have problems finding an SD, and may even attract someone a little younger than you.\n\nGood luck.",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/mwt0j1/the_question_shouldnt_be_am_i_too_old_but_rather/",
    "score": 138,
    "upvote_ratio": 0.91,
    "created_utc": 1619176804.0,
    "num_comments": 60,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "haha, I read this whole thing and I thought you were talking about whether the SD was good looking enough. 😂",
            "author": "steelmanfallacy",
            "id": "gvk74ck",
            "parent_id": "t3_mwt0j1",
            "score": 17,
            "created_utc": 1619182280.0,
            "replies": [
                {
                    "body": "HAHAHA I mean that does play a factor I am sure, especially with women who are doing this more for a kick / some fun with some help.",
                    "author": "BigBearSD",
                    "id": "gvk9m6v",
                    "parent_id": "t1_gvk74ck",
                    "score": 2,
                    "created_utc": 1619183630.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Here’s my experience. I’m a SD in my early 50s. People meeting me usually assume I’m in my late 30s, early 40s, and although a lot of that is attitude and interests, I do have a boyish face and a decent level of fitness. \n\nI’ve had SBs and pots from 18-42. Honestly, the very best looking of them was probably a 6 and the worst about a 3. It turns out what’s made the difference between the keepers and rejects isn’t age or appearance, per se, but attitude and intelligence. The plump but cute 18 year old with an agile mind, a love of experimentation, and a sex drive that’d put a rabbit to shame was a a keeper. The model trim 22 year old with a beautiful face that couldn’t understand what I did for a living and had a lot of bizarre rules for sex was not a keeper. The tall, gangly, and bespectacled 30 year old whose only physical calling cards were a thin waist and giant breasts was a keeper because she was brilliant, funny, up for adventure, and probably better in bed that any woman I’ve been with before or since.\n\nTL;dr - Age is a number. There are 40 year olds that have it and 20 year olds that don’t. My sweet spot is 26-32 simply because you’re more likely to get looks and personality.\n\n* 10s are not common in the real world. The most beautiful woman I’ve ever vanilla dated was, at best, an 8.",
            "author": "captcreamfiller",
            "id": "gvm4p1v",
            "parent_id": "t3_mwt0j1",
            "score": 12,
            "created_utc": 1619213768.0,
            "replies": []
        },
        {
            "body": "Great point. That’s how I see it. More genéralos:\n\n1) there seems to be a large interest in both women who are younger as well as older than 23. \n2) the largest interest is in women who are conventionally fit and attractive\n3) that said, there are individuals looking for more specific or alternative criteria — these could be preferences or fetishes if you want to label it that way. \n\nIf you don’t fit into the most popular category that’s ok as long as you find a SD who is into you as an individual. \n\nFor me age is the least important factor but personality compatibility is absolutely essential.",
            "author": "daddoms",
            "id": "gvk5r44",
            "parent_id": "t3_mwt0j1",
            "score": 25,
            "created_utc": 1619181494.0,
            "replies": [
                {
                    "body": "I think you hit the nail right on the head! I'm a 51yo Cougar Switch. I do very well in the 3rd category and find that my demeanor, temperment, looks, and experience/skills allow me to pull much younger SD attention from the other two categories. 😎 I'm not alone in that either. I know quite a few older Cougars that are enjoying the same attention. We just fly under the radar and are underestimated. 😼",
                    "author": "LadyMorgan2018",
                    "id": "gvlpt7n",
                    "parent_id": "t1_gvk5r44",
                    "score": 11,
                    "created_utc": 1619206881.0,
                    "replies": [
                        {
                            "body": "Right? agegap isn’t such a big deal in kink ... and I don’t mean the “call me daddy while I slap your ass” variety...",
                            "author": "daddoms",
                            "id": "gvlwmum",
                            "parent_id": "t1_gvlpt7n",
                            "score": 3,
                            "created_utc": 1619209996.0,
                            "replies": [
                                {
                                    "body": "😂😂😂 oh my! I wouldn't know ANYTHING about that! 😎😈",
                                    "author": "LadyMorgan2018",
                                    "id": "gvlzt69",
                                    "parent_id": "t1_gvlwmum",
                                    "score": 3,
                                    "created_utc": 1619211449.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "I agree with this, especially the last point. I guess in this lifestyle, for me, the women I have been with ranged from 23 to 39. Me being 32. As long as we click, we have good chemistry, are in alignment with what we want / look for, and she is attractive, the age is irrelevant (although do get squeamish about the teens / really early 20s).",
                    "author": "BigBearSD",
                    "id": "gvk6tt4",
                    "parent_id": "t1_gvk5r44",
                    "score": 18,
                    "created_utc": 1619182116.0,
                    "replies": []
                },
                {
                    "body": "I agree with this, especially the last point. I guess in this lifestyle, for me, the women I have been with ranged from 23 to 39. Me being 32. As long as we click, we have good chemistry, are in alignment with what we want / look for, and she is attractive, the age is irrelevant (although do get squeamish about the legal teens / really early 20s).",
                    "author": "BigBearSD",
                    "id": "gvk6ufo",
                    "parent_id": "t1_gvk5r44",
                    "score": 6,
                    "created_utc": 1619182126.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I’d put strong odds on at least two, “am I too old” posts before Monday. \n\nThis should be stickied.",
            "author": "sdburner",
            "id": "gvjzpcn",
            "parent_id": "t3_mwt0j1",
            "score": 13,
            "created_utc": 1619177558.0,
            "replies": [
                {
                    "body": "today by noon.\n\nfollowed by 3 \"can I be a platonic/online SB?\"",
                    "author": "Buckeyechamp21",
                    "id": "gvkamg6",
                    "parent_id": "t1_gvjzpcn",
                    "score": 6,
                    "created_utc": 1619184159.0,
                    "replies": [
                        {
                            "body": "Never really thought about it before, but isn’t an online Sb just another name for a cam girl",
                            "author": "sdburner",
                            "id": "gvkbuqt",
                            "parent_id": "t1_gvkamg6",
                            "score": 4,
                            "created_utc": 1619184789.0,
                            "replies": [
                                {
                                    "body": "Basically, yes.",
                                    "author": "Cdnsugarr",
                                    "id": "gvl8oth",
                                    "parent_id": "t1_gvkbuqt",
                                    "score": 3,
                                    "created_utc": 1619199293.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Only 2? You’re optimistic",
                    "author": "mraspencer",
                    "id": "gvk2ype",
                    "parent_id": "t1_gvjzpcn",
                    "score": 1,
                    "created_utc": 1619179776.0,
                    "replies": [
                        {
                            "body": "I have a busy day, so I am projecting that everyone does.",
                            "author": "sdburner",
                            "id": "gvl52sr",
                            "parent_id": "t1_gvk2ype",
                            "score": 3,
                            "created_utc": 1619197724.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Realistically ten percent of girls are the standard outs on sa.  They get all the sugar daddies after them.  Have very high ppm and guys want to see them long term if they arent total bitches or princesses.  They can pick and choose which sd they want too.\n\nSome of the ppm I have seen them ask would be a monthly allowance for others.  And some guys happily pay this too.\n\nAll the rules about sa being made for sd get inverted for the absolute babes.  Getting a response out of them is almost Impossible sometimes",
            "author": "wb19081908",
            "id": "gvk02oe",
            "parent_id": "t3_mwt0j1",
            "score": 16,
            "created_utc": 1619177825.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "gvk197z",
                    "parent_id": "t1_gvk02oe",
                    "score": 8,
                    "created_utc": 1619178652.0,
                    "replies": [
                        {
                            "body": "😂😂😂 you’re fun",
                            "author": "usernamechecksout4u",
                            "id": "gvl5ls9",
                            "parent_id": "t1_gvk197z",
                            "score": 3,
                            "created_utc": 1619197954.0,
                            "replies": []
                        },
                        {
                            "body": "Now remind me about why we don’t agree on anything? 😜",
                            "author": "daddoms",
                            "id": "gvk2o3v",
                            "parent_id": "t1_gvk197z",
                            "score": 3,
                            "created_utc": 1619179588.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Tests your Game ;-)",
                    "author": "Buckeyechamp21",
                    "id": "gvkairz",
                    "parent_id": "t1_gvk02oe",
                    "score": 1,
                    "created_utc": 1619184106.0,
                    "replies": [
                        {
                            "body": "My ltr the one I took years to get over i messaged her 20 times.  Blocked her three times and she cancelled on a planned first meet.\n\nWhen I went to meet her I was sure she wasn't going to show up for dinner so I brought a protein shake to have if she flaked )*",
                            "author": "wb19081908",
                            "id": "gvkb5jg",
                            "parent_id": "t1_gvkairz",
                            "score": 3,
                            "created_utc": 1619184431.0,
                            "replies": [
                                {
                                    "body": ">When I went to meet her I was sure she wasn't going to show up for dinner so I brought a protein shake to have if she flaked \n\nWtf, lmao. I would've just made backup plans; although to be real the protein shake would've been cheaper :D",
                                    "author": "pintodinosaur",
                                    "id": "gvkimvs",
                                    "parent_id": "t1_gvkb5jg",
                                    "score": 6,
                                    "created_utc": 1619188009.0,
                                    "replies": [
                                        {
                                            "body": "Well she was the 4th girl id met that week )*.  And some.of those i gave a protein shake too",
                                            "author": "wb19081908",
                                            "id": "gvmh405",
                                            "parent_id": "t1_gvkimvs",
                                            "score": 2,
                                            "created_utc": 1619220011.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "I'm curious... why a protein shake?\n\nIn no-show restaurant situations I usually order a drink and an appetizer then leave.",
                                    "author": "Aaronm989",
                                    "id": "gvmqqk4",
                                    "parent_id": "t1_gvkb5jg",
                                    "score": 2,
                                    "created_utc": 1619225191.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "INFO: Does this change depending on added factor of known/unknown plastic surgeries/fillers/ vs. Straight-up CrossFit/Yoga/fitness? E.g., the whole \"Plastic\" vs. \"Natural\" vs. Somewhere in-between? \n\nAnd would intelligence/crit thinking/job success (not necessarily in a FIRE/FatFIRE sense, but, for argument, say a good performance review/ \"good at what you do\" context) also influence your original premise, for bad or good?",
            "author": "SephoraRothschild",
            "id": "gvljxyr",
            "parent_id": "t3_mwt0j1",
            "score": 3,
            "created_utc": 1619204231.0,
            "replies": []
        },
        {
            "body": "This. \n\nHonestly it's was why it took me so long to join the bowl. I know I'm not a 10 but i'm not insecure about the way I look. Some men are in to me others aren't. I have a realistic view on things so well see how sugaring works out.",
            "author": "Crezia1591",
            "id": "gvp8u67",
            "parent_id": "t3_mwt0j1",
            "score": 3,
            "created_utc": 1619273045.0,
            "replies": []
        },
        {
            "body": "Very well said Bear..... and yes can this get stickied. I think we are all tired of the “Am I too old” posts",
            "author": "Layla_Fox2",
            "id": "gvk4ej0",
            "parent_id": "t3_mwt0j1",
            "score": 5,
            "created_utc": 1619180680.0,
            "replies": [
                {
                    "body": "But where else will I get the chance to scroll through the “Over 23 and you’re spoiled meat” responses?",
                    "author": "SnooDucks4705",
                    "id": "gvmlt0d",
                    "parent_id": "t1_gvk4ej0",
                    "score": 3,
                    "created_utc": 1619222520.0,
                    "replies": [
                        {
                            "body": "Touché 😂🤣😂🤣😂",
                            "author": "Layla_Fox2",
                            "id": "gvmm4sk",
                            "parent_id": "t1_gvmlt0d",
                            "score": 2,
                            "created_utc": 1619222698.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "There are 2 types of women..those who are insecure about their own attractiveness and those who are confident on the outside while insecure on the inside.\n\nAmazingly, men are attracted to women of all shapes and sizes.  One mans house frau is another mans secret desire (to some extent).  \n\nOnce the clothes come off, everything seems to work out.",
            "author": "sdphilly",
            "id": "gvk4uhs",
            "parent_id": "t3_mwt0j1",
            "score": 9,
            "created_utc": 1619180954.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "gvk5j84",
                    "parent_id": "t1_gvk4uhs",
                    "score": 5,
                    "created_utc": 1619181366.0,
                    "replies": [
                        {
                            "body": "I think SD expectations are much higher in the sugar bowl.  Perhaps too high.  I know my imagination can run wild, especially at the M&G point.  Then, after a few dates, I realize they are real people...and my expectations come back to earth.\n\nBut, some \"hot' pictures just don't appeal to me.  Others do.  I don't think there is universal appeal.  I'm sure there are some guys who don't go for the typical platinum blonde bombshell (usually with crap personalities).",
                            "author": "sdphilly",
                            "id": "gvkeboe",
                            "parent_id": "t1_gvk5j84",
                            "score": 9,
                            "created_utc": 1619186009.0,
                            "replies": []
                        },
                        {
                            "body": "Well said. That's why SA tips the scales back towards the men.",
                            "author": "pintodinosaur",
                            "id": "gvkis5c",
                            "parent_id": "t1_gvk5j84",
                            "score": 4,
                            "created_utc": 1619188075.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "gvkp0xi",
                                    "parent_id": "t1_gvkis5c",
                                    "score": 4,
                                    "created_utc": 1619190812.0,
                                    "replies": [
                                        {
                                            "body": "Not precisely whoever.  My experience is that SBs still discriminate on looks, it's just a more relaxed standard than they normally use.",
                                            "author": "Aaronm989",
                                            "id": "gvmsl68",
                                            "parent_id": "t1_gvkp0xi",
                                            "score": 3,
                                            "created_utc": 1619226208.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "There are typical beauty standard societal norms that most SDs' preferences seem to align with  in this lifestyle. Now we may split hairs on certain features and all of that, but, frumpy is usually not desired in this lifestyle.",
                    "author": "BigBearSD",
                    "id": "gvk5hfk",
                    "parent_id": "t1_gvk4uhs",
                    "score": 1,
                    "created_utc": 1619181337.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Yes! I don’t want to be rude or anything but it’s so darn annoying to see those kinds of forums. Like you said, it’s all about attractiveness. If I knew my looks weren’t a 10, I wouldn’t be on seeking in the first place. It’s a shocker to see men on there who think they’ve got potential but in reality, they should just resort to some regular dating app.",
            "author": null,
            "id": "gvk0pe9",
            "parent_id": "t3_mwt0j1",
            "score": 12,
            "created_utc": 1619178272.0,
            "replies": [
                {
                    "body": ">If I knew my looks weren’t a 10\n\nVery bold statement, don't forget beauty is in the eye of the beholder.",
                    "author": "pintodinosaur",
                    "id": "gvkg71q",
                    "parent_id": "t1_gvk0pe9",
                    "score": 25,
                    "created_utc": 1619186898.0,
                    "replies": [
                        {
                            "body": "Of course, I always take that into consideration. Given the feedback I receive, I think I have that confidence to say that.",
                            "author": null,
                            "id": "gvkgt0v",
                            "parent_id": "t1_gvkg71q",
                            "score": -3,
                            "created_utc": 1619187181.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "There are no 10's. The harsh truth is that no matter how attractive someone is, there's someone somewhere who just got tired of them.",
                    "author": "SeveralGirlsGalore_",
                    "id": "gvlcxe2",
                    "parent_id": "t1_gvk0pe9",
                    "score": 8,
                    "created_utc": 1619201128.0,
                    "replies": [
                        {
                            "body": "This right here. I’m an attractive girl... I wouldn’t run around claiming a 10",
                            "author": "unicornzarecool",
                            "id": "gvm2lbq",
                            "parent_id": "t1_gvlcxe2",
                            "score": 6,
                            "created_utc": 1619212757.0,
                            "replies": []
                        },
                        {
                            "body": "I’m allowed to have my confidence and rate myself at such high number. Sure, there’s probably people out there who think I’m ugly but their input doesn’t matter. I’m not going to let older men hurt my feelings. At the end of the day, I’m the youthful one.",
                            "author": null,
                            "id": "gvldrw6",
                            "parent_id": "t1_gvlcxe2",
                            "score": 4,
                            "created_utc": 1619201497.0,
                            "replies": [
                                {
                                    "body": "My point was mainly that looks, while important, are ultimately subjective. Real attraction (for me at least) is more holistic.\n\n'Being hot' may open more doors, but things like intelligence, humility, humor and maturity keep you in the room.",
                                    "author": "SeveralGirlsGalore_",
                                    "id": "gvlh3na",
                                    "parent_id": "t1_gvldrw6",
                                    "score": 7,
                                    "created_utc": 1619202966.0,
                                    "replies": [
                                        {
                                            "body": "Okay, I totally get your point. I do think those characteristics make you much more attractive than looks. Cause you could look hot/beautiful but if you’ve got a rotten personality, that’s a no.",
                                            "author": null,
                                            "id": "gvlhjpc",
                                            "parent_id": "t1_gvlh3na",
                                            "score": 2,
                                            "created_utc": 1619203164.0,
                                            "replies": [
                                                {
                                                    "body": "Good. Definitely wasn't trying to hurt anyone's feelings!",
                                                    "author": "SeveralGirlsGalore_",
                                                    "id": "gvlk3yg",
                                                    "parent_id": "t1_gvlhjpc",
                                                    "score": 2,
                                                    "created_utc": 1619204305.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "gvlhyfa",
                                    "parent_id": "t1_gvldrw6",
                                    "score": -1,
                                    "created_utc": 1619203347.0,
                                    "replies": [
                                        {
                                            "body": "I agree with this, a 10 is perfection.  They won't be on SA, or even be a freestyling SB, if they decide they want someone to take care of them they are the mistress to a billionaire.\n\n9's are famous runway models who make more money than the SDs that want to date them, you don't see them on SA either.\n\nOccasionally you see an 8, but they want 5x the normal allowance and are taken within a few weeks at most.\n\n6s and 7s drive the bowl, but most aren't willing to rate themselves as that because they think their most beautiful friend is a 10, when she's actually an 8 at best, and don't want to consider themselves 3-4 points lower than their friend.  Even as a 6 they are still more attractive than over half the population which should be enough for their self esteem.",
                                            "author": "storm170",
                                            "id": "gvlsw8j",
                                            "parent_id": "t1_gvlhyfa",
                                            "score": 11,
                                            "created_utc": 1619208294.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "It's subjective.  Like what do you mean by \"flawless\" and \"special\" vs. \"pretty?\"\n\nBut I generally agree.  There is hot for 35 and then there is hot for 22 and a 22-6 will in most cases beats out a 35-8 et cetera.  Or to be more clear the 22 year old is an 8 and the 35 year old is a 6.  Men's looks peak about 8-10 years later than women, it's just the way of things.  I was at my peak hotness circa 30-33.  For women it's typically 20-24.\n\nHOWEVER, an arrangement is more than a lay.  Personality also plays a role and I will give a 35 year old who's cool and likes me a shot over a 22 year old who's boring and only in it for the cash.  Maybe I'm getting older myself but I've had some trouble lately finding things to talk about with the younger SBs.",
                                            "author": "Aaronm989",
                                            "id": "gvmrf48",
                                            "parent_id": "t1_gvlhyfa",
                                            "score": 3,
                                            "created_utc": 1619225563.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "Agree. To me accessibility trumps attraction. If she is good looking (6 - 7 is fine), accessible to date, good personality, I’ll take her anyway vs conventional 10s who barely are on seeking.",
                                            "author": null,
                                            "id": "gvlzos7",
                                            "parent_id": "t1_gvlhyfa",
                                            "score": 3,
                                            "created_utc": 1619211392.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "That’s just your opinion and I have my own. Like I said, I’m not perfect. Surely I’m not a 100 either. I’m a 20 year old who’s always cared about appearance and health than any other thing in this world. Given I don’t smoke nor do drugs, of course I’d look more youthful than the average person my age.",
                                            "author": null,
                                            "id": "gvljpdf",
                                            "parent_id": "t1_gvlhyfa",
                                            "score": 1,
                                            "created_utc": 1619204122.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I think sbs up to mid 40s can still do great as long as they are fit.",
            "author": "dade_murphy1",
            "id": "gvlp7vg",
            "parent_id": "t3_mwt0j1",
            "score": 2,
            "created_utc": 1619206609.0,
            "replies": []
        },
        {
            "body": "I think it’s tough going after 35.",
            "author": "IAMDIRECT",
            "id": "gvmje66",
            "parent_id": "t3_mwt0j1",
            "score": 2,
            "created_utc": 1619221226.0,
            "replies": [
                {
                    "body": "Just ask the >35 Sb crowd here and you will no longer *think*, but *know*.\n\nAnd I will start off : No, it isn't. \n\nIt's easier, because we don't have to compete with hundreds of thousands other attractive peers, and a lot of SDs search explicitly for older SBs.",
                    "author": "A-touchofreality",
                    "id": "gvoy01n",
                    "parent_id": "t1_gvmje66",
                    "score": 2,
                    "created_utc": 1619270110.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gvk45gy",
            "parent_id": "t3_mwt0j1",
            "score": 2,
            "created_utc": 1619180529.0,
            "replies": [
                {
                    "body": "Yep. I find it odd too that most are in their mid to late 20s through early 30s. No, you are not too old. You may be too unattractive, but you are not too old. Now, if say someone comes on here and says \"Am I too old. I'm 75?\" Then yes, yes lady, you are too old.",
                    "author": "BigBearSD",
                    "id": "gvk59tm",
                    "parent_id": "t1_gvk45gy",
                    "score": 5,
                    "created_utc": 1619181211.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[removed]",
            "author": null,
            "id": "gvlve7f",
            "parent_id": "t3_mwt0j1",
            "score": -4,
            "created_utc": 1619209426.0,
            "replies": [
                {
                    "body": "I disagree. 34-47 seems to be the sweet spot for me, given they've kept fit and active. And same with me at 73, also fit and active. Love the existence of life experiences. So much sexier!",
                    "author": "Rusty194799",
                    "id": "gvn7j4n",
                    "parent_id": "t1_gvlve7f",
                    "score": 5,
                    "created_utc": 1619234921.0,
                    "replies": []
                },
                {
                    "body": "Thank God 'beta losers' like Jeff Bezos don't look at  >50 yo 'menopausal' old women the way you do, he lately spend $35 billion to be with one!\n\nYa know, 'Jeff Bezos'! The richest man on earth, and hardly the kind of guy famous for bad investments. But hey! I'm sure you know more about \"diminishing returns\" than he does. LOL",
                    "author": "A-touchofreality",
                    "id": "gvp71g9",
                    "parent_id": "t1_gvlve7f",
                    "score": 3,
                    "created_utc": 1619272565.0,
                    "replies": [
                        {
                            "body": "Jeff Bezos is a laughing stock with his botoxed mutton dressed as lamb who leaked texted photos of his manhood. Of course he can do what he likes, but that doesn't necessarily mean that the majority of billionaires are looking for the same thing.\n\nI am just saying that in a competitive marketplace, the women who are most sexually attractive have the best chance of selling their wares, and fresh produce is usually preferable except in the case of wine and overripe cheese. It would be irresponsible as a vocational counselor to recommend that menopausal women put themselves on the auction block.",
                            "author": "Miercolesian",
                            "id": "gvv10hs",
                            "parent_id": "t1_gvp71g9",
                            "score": 0,
                            "created_utc": 1619386477.0,
                            "replies": [
                                {
                                    "body": "Yeah sure, Jeff Bezos is a laughing stock. \n\nSays who?! LOL",
                                    "author": "A-touchofreality",
                                    "id": "gvxhhsl",
                                    "parent_id": "t1_gvv10hs",
                                    "score": 1,
                                    "created_utc": 1619445442.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gvm6bau",
            "parent_id": "t3_mwt0j1",
            "score": 1,
            "created_utc": 1619214557.0,
            "replies": [
                {
                    "body": ">*It also adds \"baggage\" to the mind*\n\nIt adds *OTHER* 'bagage', each age bracket has their own 'bagage'. Of course it is up to the SD to choose what kind of bagage and drama he finds acceptable for his SR.\n\n*> All of this makes also it more difficult to sugar date older women.*\n\nThat depends, some SDs explicitly search for this life experience because for them that  brings positives to the SR.\n\n*> For a hypothetical 50 year old married man, dating a 41 year old sugar baby is more like cheating. But dating a 23 year old student is more like a sexual transgression like visiting a sex worker.*\n\nThis is the only thing in the usual anti 'older SB' arguments that makes some sense.\n\n*> It is also much more difficult to justify paying for dates, if age difference is smaller.*\n\nBS!  Allowances are paid to compensate for what the SD *cannot* offer his SB by what he *can*.\n\nThe allowance make us oversee flaws we wouldn't oversee in vanilla partners. These flaws may vary wildly: from age gap, availability, personality, level of attractiveness, to lack of future perspective and being married etc.",
                    "author": "A-touchofreality",
                    "id": "gvp0dav",
                    "parent_id": "t1_gvm6bau",
                    "score": 5,
                    "created_utc": 1619270748.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "gvp7epk",
                            "parent_id": "t1_gvp0dav",
                            "score": 1,
                            "created_utc": 1619272666.0,
                            "replies": [
                                {
                                    "body": "And that's what makes this forum interesting: viewing sugar from different angles. :)",
                                    "author": "A-touchofreality",
                                    "id": "gvpbjis",
                                    "parent_id": "t1_gvp7epk",
                                    "score": 2,
                                    "created_utc": 1619273721.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Reasonably photogenic pictures are necessary to get that first click, but the personality is what's important beyond that. In general I am fairly flexible on pictures and wait until the in-person meet to really judge looks.  My experience is that SBs are either better looking or worse looking than their pictures.  It's pretty weird how I very rarely come out of a m&g thinking \"she is exactly what I expected from the pictures.\"\n\nI can't explain exactly what it is that makes me message an SB profile... basically if they're my type I'll do it and if they're not I won't.  I'm pretty flexible on weight and looks if they're my type.  I'll message anyone from 18 up to my current age of 38.  I tend not to message women older than me though, and probably not that many from 35-37.  It feels a little too close to normal online dating.  But I still do occasionally.",
            "author": "Aaronm989",
            "id": "gvmpvfv",
            "parent_id": "t3_mwt0j1",
            "score": 1,
            "created_utc": 1619224722.0,
            "replies": [
                {
                    "body": "I’ve had POTs and vanilla first dates tell me that I look like my photos. It’s possible that the ones who don’t look like their photos are using filters. I never use filters for profile pics. I’m not sure how people show up to a first date knowing they used filters.",
                    "author": "B1oodSugarSexMagik",
                    "id": "gvng2qy",
                    "parent_id": "t1_gvmpvfv",
                    "score": 3,
                    "created_utc": 1619240639.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "HAHAHA I mean that does play a factor I am sure, especially with women who are doing this more for a kick / some fun with some help.",
            "author": "BigBearSD",
            "id": "gvk9m6v",
            "parent_id": "t1_gvk74ck",
            "score": 2,
            "created_utc": 1619183630.0,
            "replies": []
        },
        {
            "body": "I think you hit the nail right on the head! I'm a 51yo Cougar Switch. I do very well in the 3rd category and find that my demeanor, temperment, looks, and experience/skills allow me to pull much younger SD attention from the other two categories. 😎 I'm not alone in that either. I know quite a few older Cougars that are enjoying the same attention. We just fly under the radar and are underestimated. 😼",
            "author": "LadyMorgan2018",
            "id": "gvlpt7n",
            "parent_id": "t1_gvk5r44",
            "score": 11,
            "created_utc": 1619206881.0,
            "replies": [
                {
                    "body": "Right? agegap isn’t such a big deal in kink ... and I don’t mean the “call me daddy while I slap your ass” variety...",
                    "author": "daddoms",
                    "id": "gvlwmum",
                    "parent_id": "t1_gvlpt7n",
                    "score": 3,
                    "created_utc": 1619209996.0,
                    "replies": [
                        {
                            "body": "😂😂😂 oh my! I wouldn't know ANYTHING about that! 😎😈",
                            "author": "LadyMorgan2018",
                            "id": "gvlzt69",
                            "parent_id": "t1_gvlwmum",
                            "score": 3,
                            "created_utc": 1619211449.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I agree with this, especially the last point. I guess in this lifestyle, for me, the women I have been with ranged from 23 to 39. Me being 32. As long as we click, we have good chemistry, are in alignment with what we want / look for, and she is attractive, the age is irrelevant (although do get squeamish about the teens / really early 20s).",
            "author": "BigBearSD",
            "id": "gvk6tt4",
            "parent_id": "t1_gvk5r44",
            "score": 18,
            "created_utc": 1619182116.0,
            "replies": []
        },
        {
            "body": "I agree with this, especially the last point. I guess in this lifestyle, for me, the women I have been with ranged from 23 to 39. Me being 32. As long as we click, we have good chemistry, are in alignment with what we want / look for, and she is attractive, the age is irrelevant (although do get squeamish about the legal teens / really early 20s).",
            "author": "BigBearSD",
            "id": "gvk6ufo",
            "parent_id": "t1_gvk5r44",
            "score": 6,
            "created_utc": 1619182126.0,
            "replies": []
        },
        {
            "body": "today by noon.\n\nfollowed by 3 \"can I be a platonic/online SB?\"",
            "author": "Buckeyechamp21",
            "id": "gvkamg6",
            "parent_id": "t1_gvjzpcn",
            "score": 6,
            "created_utc": 1619184159.0,
            "replies": [
                {
                    "body": "Never really thought about it before, but isn’t an online Sb just another name for a cam girl",
                    "author": "sdburner",
                    "id": "gvkbuqt",
                    "parent_id": "t1_gvkamg6",
                    "score": 4,
                    "created_utc": 1619184789.0,
                    "replies": [
                        {
                            "body": "Basically, yes.",
                            "author": "Cdnsugarr",
                            "id": "gvl8oth",
                            "parent_id": "t1_gvkbuqt",
                            "score": 3,
                            "created_utc": 1619199293.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Only 2? You’re optimistic",
            "author": "mraspencer",
            "id": "gvk2ype",
            "parent_id": "t1_gvjzpcn",
            "score": 1,
            "created_utc": 1619179776.0,
            "replies": [
                {
                    "body": "I have a busy day, so I am projecting that everyone does.",
                    "author": "sdburner",
                    "id": "gvl52sr",
                    "parent_id": "t1_gvk2ype",
                    "score": 3,
                    "created_utc": 1619197724.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gvk197z",
            "parent_id": "t1_gvk02oe",
            "score": 8,
            "created_utc": 1619178652.0,
            "replies": [
                {
                    "body": "😂😂😂 you’re fun",
                    "author": "usernamechecksout4u",
                    "id": "gvl5ls9",
                    "parent_id": "t1_gvk197z",
                    "score": 3,
                    "created_utc": 1619197954.0,
                    "replies": []
                },
                {
                    "body": "Now remind me about why we don’t agree on anything? 😜",
                    "author": "daddoms",
                    "id": "gvk2o3v",
                    "parent_id": "t1_gvk197z",
                    "score": 3,
                    "created_utc": 1619179588.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Tests your Game ;-)",
            "author": "Buckeyechamp21",
            "id": "gvkairz",
            "parent_id": "t1_gvk02oe",
            "score": 1,
            "created_utc": 1619184106.0,
            "replies": [
                {
                    "body": "My ltr the one I took years to get over i messaged her 20 times.  Blocked her three times and she cancelled on a planned first meet.\n\nWhen I went to meet her I was sure she wasn't going to show up for dinner so I brought a protein shake to have if she flaked )*",
                    "author": "wb19081908",
                    "id": "gvkb5jg",
                    "parent_id": "t1_gvkairz",
                    "score": 3,
                    "created_utc": 1619184431.0,
                    "replies": [
                        {
                            "body": ">When I went to meet her I was sure she wasn't going to show up for dinner so I brought a protein shake to have if she flaked \n\nWtf, lmao. I would've just made backup plans; although to be real the protein shake would've been cheaper :D",
                            "author": "pintodinosaur",
                            "id": "gvkimvs",
                            "parent_id": "t1_gvkb5jg",
                            "score": 6,
                            "created_utc": 1619188009.0,
                            "replies": [
                                {
                                    "body": "Well she was the 4th girl id met that week )*.  And some.of those i gave a protein shake too",
                                    "author": "wb19081908",
                                    "id": "gvmh405",
                                    "parent_id": "t1_gvkimvs",
                                    "score": 2,
                                    "created_utc": 1619220011.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "I'm curious... why a protein shake?\n\nIn no-show restaurant situations I usually order a drink and an appetizer then leave.",
                            "author": "Aaronm989",
                            "id": "gvmqqk4",
                            "parent_id": "t1_gvkb5jg",
                            "score": 2,
                            "created_utc": 1619225191.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "But where else will I get the chance to scroll through the “Over 23 and you’re spoiled meat” responses?",
            "author": "SnooDucks4705",
            "id": "gvmlt0d",
            "parent_id": "t1_gvk4ej0",
            "score": 3,
            "created_utc": 1619222520.0,
            "replies": [
                {
                    "body": "Touché 😂🤣😂🤣😂",
                    "author": "Layla_Fox2",
                    "id": "gvmm4sk",
                    "parent_id": "t1_gvmlt0d",
                    "score": 2,
                    "created_utc": 1619222698.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gvk5j84",
            "parent_id": "t1_gvk4uhs",
            "score": 5,
            "created_utc": 1619181366.0,
            "replies": [
                {
                    "body": "I think SD expectations are much higher in the sugar bowl.  Perhaps too high.  I know my imagination can run wild, especially at the M&G point.  Then, after a few dates, I realize they are real people...and my expectations come back to earth.\n\nBut, some \"hot' pictures just don't appeal to me.  Others do.  I don't think there is universal appeal.  I'm sure there are some guys who don't go for the typical platinum blonde bombshell (usually with crap personalities).",
                    "author": "sdphilly",
                    "id": "gvkeboe",
                    "parent_id": "t1_gvk5j84",
                    "score": 9,
                    "created_utc": 1619186009.0,
                    "replies": []
                },
                {
                    "body": "Well said. That's why SA tips the scales back towards the men.",
                    "author": "pintodinosaur",
                    "id": "gvkis5c",
                    "parent_id": "t1_gvk5j84",
                    "score": 4,
                    "created_utc": 1619188075.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "gvkp0xi",
                            "parent_id": "t1_gvkis5c",
                            "score": 4,
                            "created_utc": 1619190812.0,
                            "replies": [
                                {
                                    "body": "Not precisely whoever.  My experience is that SBs still discriminate on looks, it's just a more relaxed standard than they normally use.",
                                    "author": "Aaronm989",
                                    "id": "gvmsl68",
                                    "parent_id": "t1_gvkp0xi",
                                    "score": 3,
                                    "created_utc": 1619226208.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "There are typical beauty standard societal norms that most SDs' preferences seem to align with  in this lifestyle. Now we may split hairs on certain features and all of that, but, frumpy is usually not desired in this lifestyle.",
            "author": "BigBearSD",
            "id": "gvk5hfk",
            "parent_id": "t1_gvk4uhs",
            "score": 1,
            "created_utc": 1619181337.0,
            "replies": []
        },
        {
            "body": ">If I knew my looks weren’t a 10\n\nVery bold statement, don't forget beauty is in the eye of the beholder.",
            "author": "pintodinosaur",
            "id": "gvkg71q",
            "parent_id": "t1_gvk0pe9",
            "score": 25,
            "created_utc": 1619186898.0,
            "replies": [
                {
                    "body": "Of course, I always take that into consideration. Given the feedback I receive, I think I have that confidence to say that.",
                    "author": null,
                    "id": "gvkgt0v",
                    "parent_id": "t1_gvkg71q",
                    "score": -3,
                    "created_utc": 1619187181.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "There are no 10's. The harsh truth is that no matter how attractive someone is, there's someone somewhere who just got tired of them.",
            "author": "SeveralGirlsGalore_",
            "id": "gvlcxe2",
            "parent_id": "t1_gvk0pe9",
            "score": 8,
            "created_utc": 1619201128.0,
            "replies": [
                {
                    "body": "This right here. I’m an attractive girl... I wouldn’t run around claiming a 10",
                    "author": "unicornzarecool",
                    "id": "gvm2lbq",
                    "parent_id": "t1_gvlcxe2",
                    "score": 6,
                    "created_utc": 1619212757.0,
                    "replies": []
                },
                {
                    "body": "I’m allowed to have my confidence and rate myself at such high number. Sure, there’s probably people out there who think I’m ugly but their input doesn’t matter. I’m not going to let older men hurt my feelings. At the end of the day, I’m the youthful one.",
                    "author": null,
                    "id": "gvldrw6",
                    "parent_id": "t1_gvlcxe2",
                    "score": 4,
                    "created_utc": 1619201497.0,
                    "replies": [
                        {
                            "body": "My point was mainly that looks, while important, are ultimately subjective. Real attraction (for me at least) is more holistic.\n\n'Being hot' may open more doors, but things like intelligence, humility, humor and maturity keep you in the room.",
                            "author": "SeveralGirlsGalore_",
                            "id": "gvlh3na",
                            "parent_id": "t1_gvldrw6",
                            "score": 7,
                            "created_utc": 1619202966.0,
                            "replies": [
                                {
                                    "body": "Okay, I totally get your point. I do think those characteristics make you much more attractive than looks. Cause you could look hot/beautiful but if you’ve got a rotten personality, that’s a no.",
                                    "author": null,
                                    "id": "gvlhjpc",
                                    "parent_id": "t1_gvlh3na",
                                    "score": 2,
                                    "created_utc": 1619203164.0,
                                    "replies": [
                                        {
                                            "body": "Good. Definitely wasn't trying to hurt anyone's feelings!",
                                            "author": "SeveralGirlsGalore_",
                                            "id": "gvlk3yg",
                                            "parent_id": "t1_gvlhjpc",
                                            "score": 2,
                                            "created_utc": 1619204305.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "gvlhyfa",
                            "parent_id": "t1_gvldrw6",
                            "score": -1,
                            "created_utc": 1619203347.0,
                            "replies": [
                                {
                                    "body": "I agree with this, a 10 is perfection.  They won't be on SA, or even be a freestyling SB, if they decide they want someone to take care of them they are the mistress to a billionaire.\n\n9's are famous runway models who make more money than the SDs that want to date them, you don't see them on SA either.\n\nOccasionally you see an 8, but they want 5x the normal allowance and are taken within a few weeks at most.\n\n6s and 7s drive the bowl, but most aren't willing to rate themselves as that because they think their most beautiful friend is a 10, when she's actually an 8 at best, and don't want to consider themselves 3-4 points lower than their friend.  Even as a 6 they are still more attractive than over half the population which should be enough for their self esteem.",
                                    "author": "storm170",
                                    "id": "gvlsw8j",
                                    "parent_id": "t1_gvlhyfa",
                                    "score": 11,
                                    "created_utc": 1619208294.0,
                                    "replies": []
                                },
                                {
                                    "body": "It's subjective.  Like what do you mean by \"flawless\" and \"special\" vs. \"pretty?\"\n\nBut I generally agree.  There is hot for 35 and then there is hot for 22 and a 22-6 will in most cases beats out a 35-8 et cetera.  Or to be more clear the 22 year old is an 8 and the 35 year old is a 6.  Men's looks peak about 8-10 years later than women, it's just the way of things.  I was at my peak hotness circa 30-33.  For women it's typically 20-24.\n\nHOWEVER, an arrangement is more than a lay.  Personality also plays a role and I will give a 35 year old who's cool and likes me a shot over a 22 year old who's boring and only in it for the cash.  Maybe I'm getting older myself but I've had some trouble lately finding things to talk about with the younger SBs.",
                                    "author": "Aaronm989",
                                    "id": "gvmrf48",
                                    "parent_id": "t1_gvlhyfa",
                                    "score": 3,
                                    "created_utc": 1619225563.0,
                                    "replies": []
                                },
                                {
                                    "body": "Agree. To me accessibility trumps attraction. If she is good looking (6 - 7 is fine), accessible to date, good personality, I’ll take her anyway vs conventional 10s who barely are on seeking.",
                                    "author": null,
                                    "id": "gvlzos7",
                                    "parent_id": "t1_gvlhyfa",
                                    "score": 3,
                                    "created_utc": 1619211392.0,
                                    "replies": []
                                },
                                {
                                    "body": "That’s just your opinion and I have my own. Like I said, I’m not perfect. Surely I’m not a 100 either. I’m a 20 year old who’s always cared about appearance and health than any other thing in this world. Given I don’t smoke nor do drugs, of course I’d look more youthful than the average person my age.",
                                    "author": null,
                                    "id": "gvljpdf",
                                    "parent_id": "t1_gvlhyfa",
                                    "score": 1,
                                    "created_utc": 1619204122.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Just ask the >35 Sb crowd here and you will no longer *think*, but *know*.\n\nAnd I will start off : No, it isn't. \n\nIt's easier, because we don't have to compete with hundreds of thousands other attractive peers, and a lot of SDs search explicitly for older SBs.",
            "author": "A-touchofreality",
            "id": "gvoy01n",
            "parent_id": "t1_gvmje66",
            "score": 2,
            "created_utc": 1619270110.0,
            "replies": []
        },
        {
            "body": "Yep. I find it odd too that most are in their mid to late 20s through early 30s. No, you are not too old. You may be too unattractive, but you are not too old. Now, if say someone comes on here and says \"Am I too old. I'm 75?\" Then yes, yes lady, you are too old.",
            "author": "BigBearSD",
            "id": "gvk59tm",
            "parent_id": "t1_gvk45gy",
            "score": 5,
            "created_utc": 1619181211.0,
            "replies": []
        },
        {
            "body": "I disagree. 34-47 seems to be the sweet spot for me, given they've kept fit and active. And same with me at 73, also fit and active. Love the existence of life experiences. So much sexier!",
            "author": "Rusty194799",
            "id": "gvn7j4n",
            "parent_id": "t1_gvlve7f",
            "score": 5,
            "created_utc": 1619234921.0,
            "replies": []
        },
        {
            "body": "Thank God 'beta losers' like Jeff Bezos don't look at  >50 yo 'menopausal' old women the way you do, he lately spend $35 billion to be with one!\n\nYa know, 'Jeff Bezos'! The richest man on earth, and hardly the kind of guy famous for bad investments. But hey! I'm sure you know more about \"diminishing returns\" than he does. LOL",
            "author": "A-touchofreality",
            "id": "gvp71g9",
            "parent_id": "t1_gvlve7f",
            "score": 3,
            "created_utc": 1619272565.0,
            "replies": [
                {
                    "body": "Jeff Bezos is a laughing stock with his botoxed mutton dressed as lamb who leaked texted photos of his manhood. Of course he can do what he likes, but that doesn't necessarily mean that the majority of billionaires are looking for the same thing.\n\nI am just saying that in a competitive marketplace, the women who are most sexually attractive have the best chance of selling their wares, and fresh produce is usually preferable except in the case of wine and overripe cheese. It would be irresponsible as a vocational counselor to recommend that menopausal women put themselves on the auction block.",
                    "author": "Miercolesian",
                    "id": "gvv10hs",
                    "parent_id": "t1_gvp71g9",
                    "score": 0,
                    "created_utc": 1619386477.0,
                    "replies": [
                        {
                            "body": "Yeah sure, Jeff Bezos is a laughing stock. \n\nSays who?! LOL",
                            "author": "A-touchofreality",
                            "id": "gvxhhsl",
                            "parent_id": "t1_gvv10hs",
                            "score": 1,
                            "created_utc": 1619445442.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": ">*It also adds \"baggage\" to the mind*\n\nIt adds *OTHER* 'bagage', each age bracket has their own 'bagage'. Of course it is up to the SD to choose what kind of bagage and drama he finds acceptable for his SR.\n\n*> All of this makes also it more difficult to sugar date older women.*\n\nThat depends, some SDs explicitly search for this life experience because for them that  brings positives to the SR.\n\n*> For a hypothetical 50 year old married man, dating a 41 year old sugar baby is more like cheating. But dating a 23 year old student is more like a sexual transgression like visiting a sex worker.*\n\nThis is the only thing in the usual anti 'older SB' arguments that makes some sense.\n\n*> It is also much more difficult to justify paying for dates, if age difference is smaller.*\n\nBS!  Allowances are paid to compensate for what the SD *cannot* offer his SB by what he *can*.\n\nThe allowance make us oversee flaws we wouldn't oversee in vanilla partners. These flaws may vary wildly: from age gap, availability, personality, level of attractiveness, to lack of future perspective and being married etc.",
            "author": "A-touchofreality",
            "id": "gvp0dav",
            "parent_id": "t1_gvm6bau",
            "score": 5,
            "created_utc": 1619270748.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "gvp7epk",
                    "parent_id": "t1_gvp0dav",
                    "score": 1,
                    "created_utc": 1619272666.0,
                    "replies": [
                        {
                            "body": "And that's what makes this forum interesting: viewing sugar from different angles. :)",
                            "author": "A-touchofreality",
                            "id": "gvpbjis",
                            "parent_id": "t1_gvp7epk",
                            "score": 2,
                            "created_utc": 1619273721.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I’ve had POTs and vanilla first dates tell me that I look like my photos. It’s possible that the ones who don’t look like their photos are using filters. I never use filters for profile pics. I’m not sure how people show up to a first date knowing they used filters.",
            "author": "B1oodSugarSexMagik",
            "id": "gvng2qy",
            "parent_id": "t1_gvmpvfv",
            "score": 3,
            "created_utc": 1619240639.0,
            "replies": []
        },
        {
            "body": "Right? agegap isn’t such a big deal in kink ... and I don’t mean the “call me daddy while I slap your ass” variety...",
            "author": "daddoms",
            "id": "gvlwmum",
            "parent_id": "t1_gvlpt7n",
            "score": 3,
            "created_utc": 1619209996.0,
            "replies": [
                {
                    "body": "😂😂😂 oh my! I wouldn't know ANYTHING about that! 😎😈",
                    "author": "LadyMorgan2018",
                    "id": "gvlzt69",
                    "parent_id": "t1_gvlwmum",
                    "score": 3,
                    "created_utc": 1619211449.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Never really thought about it before, but isn’t an online Sb just another name for a cam girl",
            "author": "sdburner",
            "id": "gvkbuqt",
            "parent_id": "t1_gvkamg6",
            "score": 4,
            "created_utc": 1619184789.0,
            "replies": [
                {
                    "body": "Basically, yes.",
                    "author": "Cdnsugarr",
                    "id": "gvl8oth",
                    "parent_id": "t1_gvkbuqt",
                    "score": 3,
                    "created_utc": 1619199293.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I have a busy day, so I am projecting that everyone does.",
            "author": "sdburner",
            "id": "gvl52sr",
            "parent_id": "t1_gvk2ype",
            "score": 3,
            "created_utc": 1619197724.0,
            "replies": []
        },
        {
            "body": "😂😂😂 you’re fun",
            "author": "usernamechecksout4u",
            "id": "gvl5ls9",
            "parent_id": "t1_gvk197z",
            "score": 3,
            "created_utc": 1619197954.0,
            "replies": []
        },
        {
            "body": "Now remind me about why we don’t agree on anything? 😜",
            "author": "daddoms",
            "id": "gvk2o3v",
            "parent_id": "t1_gvk197z",
            "score": 3,
            "created_utc": 1619179588.0,
            "replies": []
        },
        {
            "body": "My ltr the one I took years to get over i messaged her 20 times.  Blocked her three times and she cancelled on a planned first meet.\n\nWhen I went to meet her I was sure she wasn't going to show up for dinner so I brought a protein shake to have if she flaked )*",
            "author": "wb19081908",
            "id": "gvkb5jg",
            "parent_id": "t1_gvkairz",
            "score": 3,
            "created_utc": 1619184431.0,
            "replies": [
                {
                    "body": ">When I went to meet her I was sure she wasn't going to show up for dinner so I brought a protein shake to have if she flaked \n\nWtf, lmao. I would've just made backup plans; although to be real the protein shake would've been cheaper :D",
                    "author": "pintodinosaur",
                    "id": "gvkimvs",
                    "parent_id": "t1_gvkb5jg",
                    "score": 6,
                    "created_utc": 1619188009.0,
                    "replies": [
                        {
                            "body": "Well she was the 4th girl id met that week )*.  And some.of those i gave a protein shake too",
                            "author": "wb19081908",
                            "id": "gvmh405",
                            "parent_id": "t1_gvkimvs",
                            "score": 2,
                            "created_utc": 1619220011.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "I'm curious... why a protein shake?\n\nIn no-show restaurant situations I usually order a drink and an appetizer then leave.",
                    "author": "Aaronm989",
                    "id": "gvmqqk4",
                    "parent_id": "t1_gvkb5jg",
                    "score": 2,
                    "created_utc": 1619225191.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Touché 😂🤣😂🤣😂",
            "author": "Layla_Fox2",
            "id": "gvmm4sk",
            "parent_id": "t1_gvmlt0d",
            "score": 2,
            "created_utc": 1619222698.0,
            "replies": []
        },
        {
            "body": "I think SD expectations are much higher in the sugar bowl.  Perhaps too high.  I know my imagination can run wild, especially at the M&G point.  Then, after a few dates, I realize they are real people...and my expectations come back to earth.\n\nBut, some \"hot' pictures just don't appeal to me.  Others do.  I don't think there is universal appeal.  I'm sure there are some guys who don't go for the typical platinum blonde bombshell (usually with crap personalities).",
            "author": "sdphilly",
            "id": "gvkeboe",
            "parent_id": "t1_gvk5j84",
            "score": 9,
            "created_utc": 1619186009.0,
            "replies": []
        },
        {
            "body": "Well said. That's why SA tips the scales back towards the men.",
            "author": "pintodinosaur",
            "id": "gvkis5c",
            "parent_id": "t1_gvk5j84",
            "score": 4,
            "created_utc": 1619188075.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "gvkp0xi",
                    "parent_id": "t1_gvkis5c",
                    "score": 4,
                    "created_utc": 1619190812.0,
                    "replies": [
                        {
                            "body": "Not precisely whoever.  My experience is that SBs still discriminate on looks, it's just a more relaxed standard than they normally use.",
                            "author": "Aaronm989",
                            "id": "gvmsl68",
                            "parent_id": "t1_gvkp0xi",
                            "score": 3,
                            "created_utc": 1619226208.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Of course, I always take that into consideration. Given the feedback I receive, I think I have that confidence to say that.",
            "author": null,
            "id": "gvkgt0v",
            "parent_id": "t1_gvkg71q",
            "score": -3,
            "created_utc": 1619187181.0,
            "replies": []
        },
        {
            "body": "This right here. I’m an attractive girl... I wouldn’t run around claiming a 10",
            "author": "unicornzarecool",
            "id": "gvm2lbq",
            "parent_id": "t1_gvlcxe2",
            "score": 6,
            "created_utc": 1619212757.0,
            "replies": []
        },
        {
            "body": "I’m allowed to have my confidence and rate myself at such high number. Sure, there’s probably people out there who think I’m ugly but their input doesn’t matter. I’m not going to let older men hurt my feelings. At the end of the day, I’m the youthful one.",
            "author": null,
            "id": "gvldrw6",
            "parent_id": "t1_gvlcxe2",
            "score": 4,
            "created_utc": 1619201497.0,
            "replies": [
                {
                    "body": "My point was mainly that looks, while important, are ultimately subjective. Real attraction (for me at least) is more holistic.\n\n'Being hot' may open more doors, but things like intelligence, humility, humor and maturity keep you in the room.",
                    "author": "SeveralGirlsGalore_",
                    "id": "gvlh3na",
                    "parent_id": "t1_gvldrw6",
                    "score": 7,
                    "created_utc": 1619202966.0,
                    "replies": [
                        {
                            "body": "Okay, I totally get your point. I do think those characteristics make you much more attractive than looks. Cause you could look hot/beautiful but if you’ve got a rotten personality, that’s a no.",
                            "author": null,
                            "id": "gvlhjpc",
                            "parent_id": "t1_gvlh3na",
                            "score": 2,
                            "created_utc": 1619203164.0,
                            "replies": [
                                {
                                    "body": "Good. Definitely wasn't trying to hurt anyone's feelings!",
                                    "author": "SeveralGirlsGalore_",
                                    "id": "gvlk3yg",
                                    "parent_id": "t1_gvlhjpc",
                                    "score": 2,
                                    "created_utc": 1619204305.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "gvlhyfa",
                    "parent_id": "t1_gvldrw6",
                    "score": -1,
                    "created_utc": 1619203347.0,
                    "replies": [
                        {
                            "body": "I agree with this, a 10 is perfection.  They won't be on SA, or even be a freestyling SB, if they decide they want someone to take care of them they are the mistress to a billionaire.\n\n9's are famous runway models who make more money than the SDs that want to date them, you don't see them on SA either.\n\nOccasionally you see an 8, but they want 5x the normal allowance and are taken within a few weeks at most.\n\n6s and 7s drive the bowl, but most aren't willing to rate themselves as that because they think their most beautiful friend is a 10, when she's actually an 8 at best, and don't want to consider themselves 3-4 points lower than their friend.  Even as a 6 they are still more attractive than over half the population which should be enough for their self esteem.",
                            "author": "storm170",
                            "id": "gvlsw8j",
                            "parent_id": "t1_gvlhyfa",
                            "score": 11,
                            "created_utc": 1619208294.0,
                            "replies": []
                        },
                        {
                            "body": "It's subjective.  Like what do you mean by \"flawless\" and \"special\" vs. \"pretty?\"\n\nBut I generally agree.  There is hot for 35 and then there is hot for 22 and a 22-6 will in most cases beats out a 35-8 et cetera.  Or to be more clear the 22 year old is an 8 and the 35 year old is a 6.  Men's looks peak about 8-10 years later than women, it's just the way of things.  I was at my peak hotness circa 30-33.  For women it's typically 20-24.\n\nHOWEVER, an arrangement is more than a lay.  Personality also plays a role and I will give a 35 year old who's cool and likes me a shot over a 22 year old who's boring and only in it for the cash.  Maybe I'm getting older myself but I've had some trouble lately finding things to talk about with the younger SBs.",
                            "author": "Aaronm989",
                            "id": "gvmrf48",
                            "parent_id": "t1_gvlhyfa",
                            "score": 3,
                            "created_utc": 1619225563.0,
                            "replies": []
                        },
                        {
                            "body": "Agree. To me accessibility trumps attraction. If she is good looking (6 - 7 is fine), accessible to date, good personality, I’ll take her anyway vs conventional 10s who barely are on seeking.",
                            "author": null,
                            "id": "gvlzos7",
                            "parent_id": "t1_gvlhyfa",
                            "score": 3,
                            "created_utc": 1619211392.0,
                            "replies": []
                        },
                        {
                            "body": "That’s just your opinion and I have my own. Like I said, I’m not perfect. Surely I’m not a 100 either. I’m a 20 year old who’s always cared about appearance and health than any other thing in this world. Given I don’t smoke nor do drugs, of course I’d look more youthful than the average person my age.",
                            "author": null,
                            "id": "gvljpdf",
                            "parent_id": "t1_gvlhyfa",
                            "score": 1,
                            "created_utc": 1619204122.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Jeff Bezos is a laughing stock with his botoxed mutton dressed as lamb who leaked texted photos of his manhood. Of course he can do what he likes, but that doesn't necessarily mean that the majority of billionaires are looking for the same thing.\n\nI am just saying that in a competitive marketplace, the women who are most sexually attractive have the best chance of selling their wares, and fresh produce is usually preferable except in the case of wine and overripe cheese. It would be irresponsible as a vocational counselor to recommend that menopausal women put themselves on the auction block.",
            "author": "Miercolesian",
            "id": "gvv10hs",
            "parent_id": "t1_gvp71g9",
            "score": 0,
            "created_utc": 1619386477.0,
            "replies": [
                {
                    "body": "Yeah sure, Jeff Bezos is a laughing stock. \n\nSays who?! LOL",
                    "author": "A-touchofreality",
                    "id": "gvxhhsl",
                    "parent_id": "t1_gvv10hs",
                    "score": 1,
                    "created_utc": 1619445442.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gvp7epk",
            "parent_id": "t1_gvp0dav",
            "score": 1,
            "created_utc": 1619272666.0,
            "replies": [
                {
                    "body": "And that's what makes this forum interesting: viewing sugar from different angles. :)",
                    "author": "A-touchofreality",
                    "id": "gvpbjis",
                    "parent_id": "t1_gvp7epk",
                    "score": 2,
                    "created_utc": 1619273721.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "😂😂😂 oh my! I wouldn't know ANYTHING about that! 😎😈",
            "author": "LadyMorgan2018",
            "id": "gvlzt69",
            "parent_id": "t1_gvlwmum",
            "score": 3,
            "created_utc": 1619211449.0,
            "replies": []
        },
        {
            "body": "Basically, yes.",
            "author": "Cdnsugarr",
            "id": "gvl8oth",
            "parent_id": "t1_gvkbuqt",
            "score": 3,
            "created_utc": 1619199293.0,
            "replies": []
        },
        {
            "body": ">When I went to meet her I was sure she wasn't going to show up for dinner so I brought a protein shake to have if she flaked \n\nWtf, lmao. I would've just made backup plans; although to be real the protein shake would've been cheaper :D",
            "author": "pintodinosaur",
            "id": "gvkimvs",
            "parent_id": "t1_gvkb5jg",
            "score": 6,
            "created_utc": 1619188009.0,
            "replies": [
                {
                    "body": "Well she was the 4th girl id met that week )*.  And some.of those i gave a protein shake too",
                    "author": "wb19081908",
                    "id": "gvmh405",
                    "parent_id": "t1_gvkimvs",
                    "score": 2,
                    "created_utc": 1619220011.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I'm curious... why a protein shake?\n\nIn no-show restaurant situations I usually order a drink and an appetizer then leave.",
            "author": "Aaronm989",
            "id": "gvmqqk4",
            "parent_id": "t1_gvkb5jg",
            "score": 2,
            "created_utc": 1619225191.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gvkp0xi",
            "parent_id": "t1_gvkis5c",
            "score": 4,
            "created_utc": 1619190812.0,
            "replies": [
                {
                    "body": "Not precisely whoever.  My experience is that SBs still discriminate on looks, it's just a more relaxed standard than they normally use.",
                    "author": "Aaronm989",
                    "id": "gvmsl68",
                    "parent_id": "t1_gvkp0xi",
                    "score": 3,
                    "created_utc": 1619226208.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "My point was mainly that looks, while important, are ultimately subjective. Real attraction (for me at least) is more holistic.\n\n'Being hot' may open more doors, but things like intelligence, humility, humor and maturity keep you in the room.",
            "author": "SeveralGirlsGalore_",
            "id": "gvlh3na",
            "parent_id": "t1_gvldrw6",
            "score": 7,
            "created_utc": 1619202966.0,
            "replies": [
                {
                    "body": "Okay, I totally get your point. I do think those characteristics make you much more attractive than looks. Cause you could look hot/beautiful but if you’ve got a rotten personality, that’s a no.",
                    "author": null,
                    "id": "gvlhjpc",
                    "parent_id": "t1_gvlh3na",
                    "score": 2,
                    "created_utc": 1619203164.0,
                    "replies": [
                        {
                            "body": "Good. Definitely wasn't trying to hurt anyone's feelings!",
                            "author": "SeveralGirlsGalore_",
                            "id": "gvlk3yg",
                            "parent_id": "t1_gvlhjpc",
                            "score": 2,
                            "created_utc": 1619204305.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gvlhyfa",
            "parent_id": "t1_gvldrw6",
            "score": -1,
            "created_utc": 1619203347.0,
            "replies": [
                {
                    "body": "I agree with this, a 10 is perfection.  They won't be on SA, or even be a freestyling SB, if they decide they want someone to take care of them they are the mistress to a billionaire.\n\n9's are famous runway models who make more money than the SDs that want to date them, you don't see them on SA either.\n\nOccasionally you see an 8, but they want 5x the normal allowance and are taken within a few weeks at most.\n\n6s and 7s drive the bowl, but most aren't willing to rate themselves as that because they think their most beautiful friend is a 10, when she's actually an 8 at best, and don't want to consider themselves 3-4 points lower than their friend.  Even as a 6 they are still more attractive than over half the population which should be enough for their self esteem.",
                    "author": "storm170",
                    "id": "gvlsw8j",
                    "parent_id": "t1_gvlhyfa",
                    "score": 11,
                    "created_utc": 1619208294.0,
                    "replies": []
                },
                {
                    "body": "It's subjective.  Like what do you mean by \"flawless\" and \"special\" vs. \"pretty?\"\n\nBut I generally agree.  There is hot for 35 and then there is hot for 22 and a 22-6 will in most cases beats out a 35-8 et cetera.  Or to be more clear the 22 year old is an 8 and the 35 year old is a 6.  Men's looks peak about 8-10 years later than women, it's just the way of things.  I was at my peak hotness circa 30-33.  For women it's typically 20-24.\n\nHOWEVER, an arrangement is more than a lay.  Personality also plays a role and I will give a 35 year old who's cool and likes me a shot over a 22 year old who's boring and only in it for the cash.  Maybe I'm getting older myself but I've had some trouble lately finding things to talk about with the younger SBs.",
                    "author": "Aaronm989",
                    "id": "gvmrf48",
                    "parent_id": "t1_gvlhyfa",
                    "score": 3,
                    "created_utc": 1619225563.0,
                    "replies": []
                },
                {
                    "body": "Agree. To me accessibility trumps attraction. If she is good looking (6 - 7 is fine), accessible to date, good personality, I’ll take her anyway vs conventional 10s who barely are on seeking.",
                    "author": null,
                    "id": "gvlzos7",
                    "parent_id": "t1_gvlhyfa",
                    "score": 3,
                    "created_utc": 1619211392.0,
                    "replies": []
                },
                {
                    "body": "That’s just your opinion and I have my own. Like I said, I’m not perfect. Surely I’m not a 100 either. I’m a 20 year old who’s always cared about appearance and health than any other thing in this world. Given I don’t smoke nor do drugs, of course I’d look more youthful than the average person my age.",
                    "author": null,
                    "id": "gvljpdf",
                    "parent_id": "t1_gvlhyfa",
                    "score": 1,
                    "created_utc": 1619204122.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Yeah sure, Jeff Bezos is a laughing stock. \n\nSays who?! LOL",
            "author": "A-touchofreality",
            "id": "gvxhhsl",
            "parent_id": "t1_gvv10hs",
            "score": 1,
            "created_utc": 1619445442.0,
            "replies": []
        },
        {
            "body": "And that's what makes this forum interesting: viewing sugar from different angles. :)",
            "author": "A-touchofreality",
            "id": "gvpbjis",
            "parent_id": "t1_gvp7epk",
            "score": 2,
            "created_utc": 1619273721.0,
            "replies": []
        },
        {
            "body": "Well she was the 4th girl id met that week )*.  And some.of those i gave a protein shake too",
            "author": "wb19081908",
            "id": "gvmh405",
            "parent_id": "t1_gvkimvs",
            "score": 2,
            "created_utc": 1619220011.0,
            "replies": []
        },
        {
            "body": "Not precisely whoever.  My experience is that SBs still discriminate on looks, it's just a more relaxed standard than they normally use.",
            "author": "Aaronm989",
            "id": "gvmsl68",
            "parent_id": "t1_gvkp0xi",
            "score": 3,
            "created_utc": 1619226208.0,
            "replies": []
        },
        {
            "body": "Okay, I totally get your point. I do think those characteristics make you much more attractive than looks. Cause you could look hot/beautiful but if you’ve got a rotten personality, that’s a no.",
            "author": null,
            "id": "gvlhjpc",
            "parent_id": "t1_gvlh3na",
            "score": 2,
            "created_utc": 1619203164.0,
            "replies": [
                {
                    "body": "Good. Definitely wasn't trying to hurt anyone's feelings!",
                    "author": "SeveralGirlsGalore_",
                    "id": "gvlk3yg",
                    "parent_id": "t1_gvlhjpc",
                    "score": 2,
                    "created_utc": 1619204305.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I agree with this, a 10 is perfection.  They won't be on SA, or even be a freestyling SB, if they decide they want someone to take care of them they are the mistress to a billionaire.\n\n9's are famous runway models who make more money than the SDs that want to date them, you don't see them on SA either.\n\nOccasionally you see an 8, but they want 5x the normal allowance and are taken within a few weeks at most.\n\n6s and 7s drive the bowl, but most aren't willing to rate themselves as that because they think their most beautiful friend is a 10, when she's actually an 8 at best, and don't want to consider themselves 3-4 points lower than their friend.  Even as a 6 they are still more attractive than over half the population which should be enough for their self esteem.",
            "author": "storm170",
            "id": "gvlsw8j",
            "parent_id": "t1_gvlhyfa",
            "score": 11,
            "created_utc": 1619208294.0,
            "replies": []
        },
        {
            "body": "It's subjective.  Like what do you mean by \"flawless\" and \"special\" vs. \"pretty?\"\n\nBut I generally agree.  There is hot for 35 and then there is hot for 22 and a 22-6 will in most cases beats out a 35-8 et cetera.  Or to be more clear the 22 year old is an 8 and the 35 year old is a 6.  Men's looks peak about 8-10 years later than women, it's just the way of things.  I was at my peak hotness circa 30-33.  For women it's typically 20-24.\n\nHOWEVER, an arrangement is more than a lay.  Personality also plays a role and I will give a 35 year old who's cool and likes me a shot over a 22 year old who's boring and only in it for the cash.  Maybe I'm getting older myself but I've had some trouble lately finding things to talk about with the younger SBs.",
            "author": "Aaronm989",
            "id": "gvmrf48",
            "parent_id": "t1_gvlhyfa",
            "score": 3,
            "created_utc": 1619225563.0,
            "replies": []
        },
        {
            "body": "Agree. To me accessibility trumps attraction. If she is good looking (6 - 7 is fine), accessible to date, good personality, I’ll take her anyway vs conventional 10s who barely are on seeking.",
            "author": null,
            "id": "gvlzos7",
            "parent_id": "t1_gvlhyfa",
            "score": 3,
            "created_utc": 1619211392.0,
            "replies": []
        },
        {
            "body": "That’s just your opinion and I have my own. Like I said, I’m not perfect. Surely I’m not a 100 either. I’m a 20 year old who’s always cared about appearance and health than any other thing in this world. Given I don’t smoke nor do drugs, of course I’d look more youthful than the average person my age.",
            "author": null,
            "id": "gvljpdf",
            "parent_id": "t1_gvlhyfa",
            "score": 1,
            "created_utc": 1619204122.0,
            "replies": []
        },
        {
            "body": "Good. Definitely wasn't trying to hurt anyone's feelings!",
            "author": "SeveralGirlsGalore_",
            "id": "gvlk3yg",
            "parent_id": "t1_gvlhjpc",
            "score": 2,
            "created_utc": 1619204305.0,
            "replies": []
        }
    ]
}