{
    "title": "I FIGURED OUT WHAT TO GET THE SD WHO HAS EVERYTHING!",
    "post_id": "f7uh29",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/f7uh29/i_figured_out_what_to_get_the_sd_who_has/",
    "author": "DevinMills93",
    "body": "There is a TL;DR at the end!\n\nSome time ago I posted on [here](https://www.reddit.com/r/sugarlifestyleforum/comments/e1zds5/what_do_you_get_the_man_who_has_everything_need/?utm_source=share&utm_medium=ios_app&utm_name=iossmf) asking for some advice on what to get my SD for Christmas (now I know he celebrates Hanukkah...oops). You guys gave me amazing advice, and he loved the gifts I gave him. \n\nFast forward to today. We have been dating for 6 months now, and I couldn’t be happier. The only recurring issue was wondering what I get this man for his birthday!? So, I went back to the original post for inspiration and kept seeing suggestions that I buy him a bottle of mezcal (which he loves). \n\nI put some money aside to purchase two bottles of mezcal that I know he drinks regularly—mind you both cost hundreds of dollars. But then I thought, if I’m already going to spend a good amount I might as well get creative with it. \n\nThe idea came to me in a dream. Or maybe when I was in the subway. It could have been on the toilet. I can’t remember. Anyway, I decided to hire a mariachi band to burst into his company and perform around the office. They’ll then get to his office where they will serenade him with songs that I personally picked (I’ve logged like 100 hours of mariachi music on YouTube trying to find the perfect ones). They will give him a card with instructions to go downstairs and get in a car that is waiting for him. That car will drive him to a restaurant that has one of the best/largest mezcal selections in NYC, where I will be waiting for him—shots in hand. \n\nThere were obviously some logistical things that I needed to work out. Like I had to make an awkward call to HR and his secretary to see if it was okay to have a mariachi band pop up and make sure he didn’t have any meetings scheduled after. I also had to like prove who I was, because they didn’t automatically believe me when I told them I was the child bride/girlfriend-ish of a 50-something year old CEO. Go figure.\n\nAnyway, this is all taking place in a few days! I’ll let you guys know how it goes! \n\nTL;DR: You guys suggested I get him mezcal for Christmas so I got a mariachi band at his office and mezcal at a restaurant for his birthday.\n\nEdit: He has never been married and exclusively dates women in their 20s and most people (friends, family, colleagues, employees) are aware. So it wasn’t a shock that a much younger woman was calling his company. They were more shocked that I cared enough to do something elaborate for his birthday.\n\nEdit: Thank you to anonymous for the Gold Award! It’s my first one! And to everyone else I will be updating by Wednesday.\n\nEDIT: [UPDATE!!!](https://www.reddit.com/r/sugarlifestyleforum/comments/fa1lm4/update_surprising_my_sd_with_a_mariachi_band_at/?utm_source=share&utm_medium=ios_app&utm_name=iossmf)",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/f7uh29/i_figured_out_what_to_get_the_sd_who_has/",
    "score": 99,
    "upvote_ratio": 0.96,
    "created_utc": 1582387633.0,
    "num_comments": 67,
    "links": [
        [
            "https://www.reddit.com/r/sugarlifestyleforum/comments/e1zds5/what_do_you_get_the_man_who_has_everything_need/?utm_source=share&utm_medium=ios_app&utm_name=iossmf",
            "https://www.reddit.com/r/sugarlifestyleforum/comments/fa1lm4/update_surprising_my_sd_with_a_mariachi_band_at/?utm_source=share&utm_medium=ios_app&utm_name=iossmf"
        ]
    ],
    "comments": [
        {
            "body": "The idea of my SB talking to my head of HR is...I can't even",
            "author": "sugarthrowSD",
            "id": "fifjvmg",
            "parent_id": "t3_f7uh29",
            "score": 98,
            "created_utc": 1582390498.0,
            "replies": [
                {
                    "body": "This. 😳😳😳",
                    "author": "EastTexas_SD",
                    "id": "fifr6uy",
                    "parent_id": "t1_fifjvmg",
                    "score": 34,
                    "created_utc": 1582392475.0,
                    "replies": [
                        {
                            "body": "He's not married, dates younger women,  owns the company     I expect that they are thrilled that he is with someone who cares......",
                            "author": "pinotandsugar",
                            "id": "fih6zeo",
                            "parent_id": "t1_fifr6uy",
                            "score": 28,
                            "created_utc": 1582407129.0,
                            "replies": [
                                {
                                    "body": "I guess if this is more of an SGF relationship where he introduces OP publicly as his GF, that's maybe ok. Different from my situation.",
                                    "author": "sugarthrowSD",
                                    "id": "fih91sa",
                                    "parent_id": "t1_fih6zeo",
                                    "score": 15,
                                    "created_utc": 1582407855.0,
                                    "replies": []
                                },
                                {
                                    "body": "Happy cakeday u/pinotandsugar !",
                                    "author": "ms_moogle",
                                    "id": "fij4yqr",
                                    "parent_id": "t1_fih6zeo",
                                    "score": 2,
                                    "created_utc": 1582434791.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "We are definitely going to need an update on how this turns out.",
            "author": null,
            "id": "fifh796",
            "parent_id": "t3_f7uh29",
            "score": 40,
            "created_utc": 1582389773.0,
            "replies": []
        },
        {
            "body": "This sounds really, really risky.    First off, you'd better be \\*certain\\* that he is single and otherwise happy with his employees knowing about you.  Even if he is, you have to be \\*certain\\* that he's happy with his workplace being turned into this type of environment.   \n\nFrankly reading this is making me rethink the risk level of being in an SR.",
            "author": "UseTheForceRey",
            "id": "fifi41x",
            "parent_id": "t3_f7uh29",
            "score": 50,
            "created_utc": 1582389948.0,
            "replies": [
                {
                    "body": "He is single. I’m at his home regularly. I leave clothes and toiletries at his house and I have spoken to family members. \nThe second concern is a real one. Like he is fun and silly with me, but he has a TON of employees and I have seen him on the phone with them. He is a tough Boss. I asked and re-asked his secretary. I asked and re-asked the head of HR. Both said that he would be initially embarrassed/confused but that he would love it and it’s a sweet idea.\nHe pretty much exclusively dates girls in their 20s, and has never been married. They have seen girls come and go, so they wouldn’t bullshit me.",
                    "author": "DevinMills93",
                    "id": "fifj661",
                    "parent_id": "t1_fifi41x",
                    "score": 26,
                    "created_utc": 1582390273.0,
                    "replies": [
                        {
                            "body": "OK, well with that context it doesn't feel nearly as risky.   I hope it works out the way you hope!",
                            "author": "UseTheForceRey",
                            "id": "fifk9xv",
                            "parent_id": "t1_fifj661",
                            "score": 16,
                            "created_utc": 1582390626.0,
                            "replies": []
                        },
                        {
                            "body": "Sounds like you did your research. Still might bomb because it’s a pretty crazy idea but sounds amazing. Good luck!",
                            "author": "2fast-2curious",
                            "id": "fifx6h3",
                            "parent_id": "t1_fifj661",
                            "score": 12,
                            "created_utc": 1582394049.0,
                            "replies": []
                        },
                        {
                            "body": "I think it is obvious but just to check ,,,,,,,  he is expecting to see you that evening .......???????",
                            "author": "pinotandsugar",
                            "id": "fih77mu",
                            "parent_id": "t1_fifj661",
                            "score": 8,
                            "created_utc": 1582407212.0,
                            "replies": [
                                {
                                    "body": "Yes! He thinks I’m coming over after class and that we are going to go to dinner. I told him I made reservations at this French restaurant a month ago.",
                                    "author": "DevinMills93",
                                    "id": "fih83o5",
                                    "parent_id": "t1_fih77mu",
                                    "score": 15,
                                    "created_utc": 1582407520.0,
                                    "replies": [
                                        {
                                            "body": "perfect   it should be awesome.........",
                                            "author": "pinotandsugar",
                                            "id": "fih8ie5",
                                            "parent_id": "t1_fih83o5",
                                            "score": 3,
                                            "created_utc": 1582407668.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "My reaction completely. I just commented about my own experience with this on the other side - I was the person receiving a surprise at work - and it was horrible.",
                    "author": "ilovecookies86",
                    "id": "fifod0c",
                    "parent_id": "t1_fifi41x",
                    "score": 16,
                    "created_utc": 1582391665.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "SO glad this actually went well.\n\nThe other side of it, to me, is that it makes me really rethink how risky SRs can be, even with people we know and trust.\n\nMy prior SD had a humongous bouquet delivered to my desk but I hadn't given him my work address. I would've! We were together for 9-ish months and things were fine. But he DM'd one of my coworkers on IG that I'd tagged in a story to ask! I had to explain to my direct report why a 60 year old man messaged her BOSS on Instagram.\n\nIt was unbelievably shocking. I would never have predicted he'd cross such a boundary but it reminded me that people can do the most surprising things.",
            "author": "ilovecookies86",
            "id": "fifo9kc",
            "parent_id": "t3_f7uh29",
            "score": 22,
            "created_utc": 1582391629.0,
            "replies": [
                {
                    "body": "I used to think I didn't need discretion. Now I'm rethinking that.",
                    "author": "Normal_Objective",
                    "id": "figc698",
                    "parent_id": "t1_fifo9kc",
                    "score": 5,
                    "created_utc": 1582398081.0,
                    "replies": [
                        {
                            "body": "For me, discretion is its own form of currency, security, safety. Everyone has their own realities, and for mine, it's extremely important that there's a divide between my \"vanilla life\" and \"sugar life.\" \n\nGetting that bouquet at work honestly made me feel like I was being stalked. Dramatic, but I'd never had something show up somewhere from someone who never should've known that place existed..",
                            "author": "ilovecookies86",
                            "id": "fihkm0s",
                            "parent_id": "t1_figc698",
                            "score": 5,
                            "created_utc": 1582411420.0,
                            "replies": [
                                {
                                    "body": "Yeah I can't imagine messing with someone's job like that.",
                                    "author": "Normal_Objective",
                                    "id": "fikj45z",
                                    "parent_id": "t1_fihkm0s",
                                    "score": 2,
                                    "created_utc": 1582481320.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Ug!",
                    "author": "UseTheForceRey",
                    "id": "fifq1xw",
                    "parent_id": "t1_fifo9kc",
                    "score": 3,
                    "created_utc": 1582392108.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "The dynamics of the comments on this post are pretty bipolar. Either it’s going to go well, or horribad...",
            "author": "EastTexas_SD",
            "id": "fifrfrg",
            "parent_id": "t3_f7uh29",
            "score": 19,
            "created_utc": 1582392551.0,
            "replies": []
        },
        {
            "body": "I really thought this was a joke... \n\nEven if he’s a really laid back and fun/cool guy, please know this could go horribly.",
            "author": "lawbabyesq",
            "id": "fifkojb",
            "parent_id": "t3_f7uh29",
            "score": 9,
            "created_utc": 1582390757.0,
            "replies": []
        },
        {
            "body": "Please reconsider. Please.",
            "author": "expiredbagels",
            "id": "fifqtd5",
            "parent_id": "t3_f7uh29",
            "score": 9,
            "created_utc": 1582392359.0,
            "replies": [
                {
                    "body": "Ahhh! I’m getting so nervous. Tell me why you think it’s a bad idea. I’m definitely open to listen.",
                    "author": "DevinMills93",
                    "id": "fifr2er",
                    "parent_id": "t1_fifqtd5",
                    "score": 1,
                    "created_utc": 1582392436.0,
                    "replies": [
                        {
                            "body": "I think he will like it. As long as the HR person just thinks you are a vanilla girlfriend, I dont see the risk there. \n\nAnd we have had a few marching bands on the trading floor for work anniversaries, birthdays, and departures.\n\nEveryone liked them. Mariachi bands are probably similar.",
                            "author": null,
                            "id": "fifzwde",
                            "parent_id": "t1_fifr2er",
                            "score": 5,
                            "created_utc": 1582394806.0,
                            "replies": []
                        },
                        {
                            "body": "High Risk / Low Reward.\n\nIf you didn't do this, he will still be your SD\nIf you did do this, he may be totally be embarrassed and stop this SR or may want to turn into Vanilla.\n\nAre you prepared for all the outcomes?",
                            "author": "xanfiles",
                            "id": "fij7pv6",
                            "parent_id": "t1_fifr2er",
                            "score": 2,
                            "created_utc": 1582437030.0,
                            "replies": [
                                {
                                    "body": "I’m in the last/hardest semester of my grad program, working in a research lab, studying 40 hours a week for the MCAT, and applying to medical school THIS cycle. \nAt this point high risk, low reward is my middle name. \n\nLol, but seriously, it’ll be fine. I’m not worried.",
                                    "author": "DevinMills93",
                                    "id": "fij85b3",
                                    "parent_id": "t1_fij7pv6",
                                    "score": 5,
                                    "created_utc": 1582437417.0,
                                    "replies": [
                                        {
                                            "body": "applying this cycle? does that mean you’re applying to DO schools? I ask, since MD is closing up interviews about this time of year (then you could start applying June of this year to start med school in fall 2021). also it takes like a month until you get your MCAT score, meaning schools won’t consider your application complete until they have your score (further delay)",
                                            "author": "expiredbagels",
                                            "id": "fime7w4",
                                            "parent_id": "t1_fij85b3",
                                            "score": 1,
                                            "created_utc": 1582526793.0,
                                            "replies": [
                                                {
                                                    "body": "*Upcoming cycle that opens up May 4th.",
                                                    "author": "DevinMills93",
                                                    "id": "fimedxr",
                                                    "parent_id": "t1_fime7w4",
                                                    "score": 1,
                                                    "created_utc": 1582526973.0,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "body": "Actually none of those things you mentioned are high risk. Studying 40 hours for MCAT is not gambling. That is what everybody does who wants to succeed.\n\nhaving said that you have mitigated some of the risks, but there is still uncertainty",
                                            "author": "xanfiles",
                                            "id": "fij8hab",
                                            "parent_id": "t1_fij85b3",
                                            "score": 0,
                                            "created_utc": 1582437728.0,
                                            "replies": [
                                                {
                                                    "body": "I was more so referring to the fact that I’m doing all of those things at the same time and the risk of burnout is YUGE. \n\nBut I get it. I understand how some people could find this cringe-worthy. I don’t mind the differing opinions, it’s all a part of being in a niche community. Everyone sugars differently but it’s cool as long as it’s still sweet.",
                                                    "author": "DevinMills93",
                                                    "id": "fij959f",
                                                    "parent_id": "t1_fij8hab",
                                                    "score": 3,
                                                    "created_utc": 1582438375.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "Lol this is probably one of the worst ideas I've ever heard. I think \"invade Iraq because of WMD's\" was a better idea than this.\n\n1. You're announcing your relationship to his entire office and his employees. Even if you were \"age appropriate\", that would still be incredibly awkward.\n2. Even though you believe some people are aware of his predilictions for younger girls, I doubt everyone in his company are knowledgable to this degree.\n3. He probably doesn't want all of his employees incredibly distracted by his personal life\n4. He probably doesn't want to be carted away from his office, in the middle of a work day, by his 20 year old SB and a mariachi band.\n\nSeriously, such a terrible terrible idea. Is this what female autism looks like?",
                            "author": "ifisch",
                            "id": "file98m",
                            "parent_id": "t1_fifr2er",
                            "score": 2,
                            "created_utc": 1582499620.0,
                            "replies": [
                                {
                                    "body": "Brah, relax.\nYou aren’t hall monitor of the middle school anymore.\n\nIt’s a 15 minute performance in a conference room for his birthday. \n\nHe refers to me as his girlfriend anyway. So, if people ask who it came from he can say it came from his girlfriend. Or he can choose to not disclose who it came from, no biggie. \n\nIt’s at the end of a work day and as stated above I won’t be there.\n\nI know all sugar relationships are different, but I would never do something that could jeopardize our relationship. \n\nIt’s not my fault—that despite spending TONS of money on women over the years—you’ve never been involved with someone who has taken the time to get you a real gift. Not a tie or a set of golf clubs, but something she actually planned out and tailored your interests.",
                                    "author": "DevinMills93",
                                    "id": "filfk74",
                                    "parent_id": "t1_file98m",
                                    "score": 2,
                                    "created_utc": 1582500437.0,
                                    "replies": [
                                        {
                                            "body": "You literally described it as:\n\n*\"I decided to hire a mariachi band to burst into his company and perform around the office.\"*\n\nAlso, when you say that he refers to you as his girlfriend, are you sure he does that in front of everyone?\n\nHave you met his employees? All of them? Do you regularly go to his office during work hours? Would they recognize you?\n\nAlso, you say it's tailored to his interests. You said he likes mezcal. I think it's a pretty big leap to go from liking a drink to liking his place of work being invaded by a mariachi band courtesy of his SB.\n\nDefinitely looking forward to hearing how this goes.",
                                            "author": "ifisch",
                                            "id": "fim17pc",
                                            "parent_id": "t1_filfk74",
                                            "score": 1,
                                            "created_utc": 1582515436.0,
                                            "replies": [
                                                {
                                                    "body": "Reading this back makes me giggle.",
                                                    "author": "DevinMills93",
                                                    "id": "fja3gkv",
                                                    "parent_id": "t1_fim17pc",
                                                    "score": 1,
                                                    "created_utc": 1583165585.0,
                                                    "replies": [
                                                        {
                                                            "body": "well from the way you described it, it didn't happen anyway. So we'll never know I guess.",
                                                            "author": "ifisch",
                                                            "id": "fjakcyi",
                                                            "parent_id": "t1_fja3gkv",
                                                            "score": 1,
                                                            "created_utc": 1583175222.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Nah. We know. He loved the idea. \nBut thanks for the concern.",
                                                                    "author": "DevinMills93",
                                                                    "id": "fjdyja8",
                                                                    "parent_id": "t1_fjakcyi",
                                                                    "score": 1,
                                                                    "created_utc": 1583261720.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "This is either going to be so bad or so good. Definitely need an update!",
            "author": "BeginningList7",
            "id": "fifqpvn",
            "parent_id": "t3_f7uh29",
            "score": 4,
            "created_utc": 1582392329.0,
            "replies": []
        },
        {
            "body": "This is fucking outstanding. If I wasn’t married and my SB did this for me I would laugh my ass off. Your heart and game are both so big.",
            "author": "CMHDaddy79",
            "id": "fig1tj7",
            "parent_id": "t3_f7uh29",
            "score": 10,
            "created_utc": 1582395303.0,
            "replies": [
                {
                    "body": "Omg, thank you!\nI really feel like I know him well enough to plan such an elaborate birthday gift, but these comments definitely made me second guess myself.",
                    "author": "DevinMills93",
                    "id": "fig48a1",
                    "parent_id": "t1_fig1tj7",
                    "score": 2,
                    "created_utc": 1582395974.0,
                    "replies": [
                        {
                            "body": "I’m still chortling over here. This is gonna be great.",
                            "author": "CMHDaddy79",
                            "id": "fiid6ss",
                            "parent_id": "t1_fig48a1",
                            "score": 3,
                            "created_utc": 1582419938.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I'm here for this. Please update us on how it went.",
            "author": "PioneerExperience",
            "id": "figifv6",
            "parent_id": "t3_f7uh29",
            "score": 3,
            "created_utc": 1582399868.0,
            "replies": []
        },
        {
            "body": "I love how much variety sugar has",
            "author": "Elvishgirl",
            "id": "fium0zz",
            "parent_id": "t3_f7uh29",
            "score": 3,
            "created_utc": 1582743964.0,
            "replies": []
        },
        {
            "body": "I personally think this is going to go over very well. Shoutout to you",
            "author": "crystalleencompass",
            "id": "fifm8gg",
            "parent_id": "t3_f7uh29",
            "score": 5,
            "created_utc": 1582391118.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "fift1r2",
            "parent_id": "t3_f7uh29",
            "score": 4,
            "created_utc": 1582392960.0,
            "replies": [
                {
                    "body": "He is just a spontaneous guy. He is both loud and extroverted. For our second date he asked me what plans I had for the weekend, I said none. He responded by sending a limo an hour later to my place of work (a hospital) to pick me up, took me to my apartment to grab clothes, and then we went to a spa resort for the weekend. \n\nFourth date he flew me down to his work conference because he was bored.\n\nHe is awesome and I’m just trying to give some of that energy back. But now I’m nervous.",
                    "author": "DevinMills93",
                    "id": "fifvg1d",
                    "parent_id": "t1_fift1r2",
                    "score": 8,
                    "created_utc": 1582393615.0,
                    "replies": [
                        {
                            "body": "I’m just trying to give some of that energy back. \n\nDo it!!! Especially since you have people who actually know him who agree with you. DON'T LET THE HATERS GET YOU DOWN! Married SDs can't relate at all",
                            "author": "sometimesviolet",
                            "id": "fig62q0",
                            "parent_id": "t1_fifvg1d",
                            "score": 9,
                            "created_utc": 1582396443.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "fiheju4",
                                    "parent_id": "t1_fig62q0",
                                    "score": 1,
                                    "created_utc": 1582409386.0,
                                    "replies": [
                                        {
                                            "body": "Read the rest of the comments.",
                                            "author": "sometimesviolet",
                                            "id": "fihmdgx",
                                            "parent_id": "t1_fiheju4",
                                            "score": 1,
                                            "created_utc": 1582411991.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": ">loud and extroverted  \n>  \n>  spontaneous \n\nkey indicators he'll get it and enjoy it.   introverts don't get it.",
                            "author": "Academic_Set",
                            "id": "fig0zgx",
                            "parent_id": "t1_fifvg1d",
                            "score": 9,
                            "created_utc": 1582395025.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Awesome!",
            "author": "HwdSD",
            "id": "fihdjn7",
            "parent_id": "t3_f7uh29",
            "score": 2,
            "created_utc": 1582409159.0,
            "replies": []
        },
        {
            "body": "Do your thing SB!  You have a connection with him that sounds open and amazing.  At my company, the staff would have fun but then I would have to make sure they got back to work.  I’m sure since he is dating 20 year olds, people already assume the nature of the relationship so own it and have fun.  Just update us😀",
            "author": "markymark-1863",
            "id": "fijryv6",
            "parent_id": "t3_f7uh29",
            "score": 2,
            "created_utc": 1582461863.0,
            "replies": []
        },
        {
            "body": "I can't wait to see how this turns out!",
            "author": null,
            "id": "fifc91l",
            "parent_id": "t3_f7uh29",
            "score": 3,
            "created_utc": 1582388330.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "fifeydc",
                    "parent_id": "t1_fifc91l",
                    "score": 4,
                    "created_utc": 1582389137.0,
                    "replies": [
                        {
                            "body": "Going to be honest I definitely worried about that, especially since it’s a serious work environment. But, I think after the initial shock he will love it. The head of HR agreed with me, and she has been there for years.",
                            "author": "DevinMills93",
                            "id": "fifgm0u",
                            "parent_id": "t1_fifeydc",
                            "score": 2,
                            "created_utc": 1582389602.0,
                            "replies": [
                                {
                                    "body": "If HR and his assistant are on your side I would not worry.  Ignore the advice from those who carry two umbrellas in August",
                                    "author": "pinotandsugar",
                                    "id": "fih7ri4",
                                    "parent_id": "t1_fifgm0u",
                                    "score": 5,
                                    "created_utc": 1582407403.0,
                                    "replies": [
                                        {
                                            "body": "Thank you! \nShe actually blocked his schedule. He thinks he has a bunch of meetings, hahaha. He actually told me that he might get home later that day and that I can let myself in.",
                                            "author": "DevinMills93",
                                            "id": "fih8fek",
                                            "parent_id": "t1_fih7ri4",
                                            "score": 4,
                                            "created_utc": 1582407639.0,
                                            "replies": [
                                                {
                                                    "body": "A little gift for his Assistant might be appropriate.......",
                                                    "author": "pinotandsugar",
                                                    "id": "fihapty",
                                                    "parent_id": "t1_fih8fek",
                                                    "score": 9,
                                                    "created_utc": 1582408295.0,
                                                    "replies": [
                                                        {
                                                            "body": "I didn’t think of that! Thank you. I will definitely get something for her.",
                                                            "author": "DevinMills93",
                                                            "id": "fihflpv",
                                                            "parent_id": "t1_fihapty",
                                                            "score": 5,
                                                            "created_utc": 1582409749.0,
                                                            "replies": [
                                                                {
                                                                    "body": "shots shots shots....",
                                                                    "author": "Academic_Set",
                                                                    "id": "fihh57s",
                                                                    "parent_id": "t1_fihflpv",
                                                                    "score": 4,
                                                                    "created_utc": 1582410337.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "body": "That's a great idea!",
                                                            "author": "Sweettooth_dragon",
                                                            "id": "fiishql",
                                                            "parent_id": "t1_fihapty",
                                                            "score": 2,
                                                            "created_utc": 1582425819.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "At first I thought this thread was a joke, now I still think its a joke but I'm feeling existential dread at the possibility of this being real.",
                                    "author": "Normal_Objective",
                                    "id": "fifj7td",
                                    "parent_id": "t1_fifgm0u",
                                    "score": 2,
                                    "created_utc": 1582390288.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "What company was this? I'm not asking so I can short their stock.",
            "author": "Normal_Objective",
            "id": "fifbvw5",
            "parent_id": "t3_f7uh29",
            "score": 1,
            "created_utc": 1582388206.0,
            "replies": []
        },
        {
            "body": "Did we find out how this went?",
            "author": "sugarthrowSD",
            "id": "fijvpzc",
            "parent_id": "t3_f7uh29",
            "score": 1,
            "created_utc": 1582465629.0,
            "replies": [
                {
                    "body": "Happening this week, I’ll update in a few days!",
                    "author": "DevinMills93",
                    "id": "filwrf5",
                    "parent_id": "t1_fijvpzc",
                    "score": 2,
                    "created_utc": 1582512212.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Remind me! Five days",
            "author": "stopopening",
            "id": "fippesk",
            "parent_id": "t3_f7uh29",
            "score": 1,
            "created_utc": 1582615163.0,
            "replies": [
                {
                    "body": "Hehehe, it’s happening today. 😝",
                    "author": "DevinMills93",
                    "id": "fippjee",
                    "parent_id": "t1_fippesk",
                    "score": 2,
                    "created_utc": 1582615321.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Can’t wait to hear how it goes!",
            "author": "stopopening",
            "id": "fiqykzr",
            "parent_id": "t3_f7uh29",
            "score": 1,
            "created_utc": 1582653937.0,
            "replies": []
        },
        {
            "body": "Genius",
            "author": "paramels",
            "id": "fifb49y",
            "parent_id": "t3_f7uh29",
            "score": 0,
            "created_utc": 1582387934.0,
            "replies": []
        },
        {
            "body": "You have done your homework, and it should be fine, if the shock and embarrassment doesn’t kill him...",
            "author": "SDforreal",
            "id": "fifko1l",
            "parent_id": "t3_f7uh29",
            "score": 0,
            "created_utc": 1582390753.0,
            "replies": []
        },
        {
            "body": "This. 😳😳😳",
            "author": "EastTexas_SD",
            "id": "fifr6uy",
            "parent_id": "t1_fifjvmg",
            "score": 34,
            "created_utc": 1582392475.0,
            "replies": [
                {
                    "body": "He's not married, dates younger women,  owns the company     I expect that they are thrilled that he is with someone who cares......",
                    "author": "pinotandsugar",
                    "id": "fih6zeo",
                    "parent_id": "t1_fifr6uy",
                    "score": 28,
                    "created_utc": 1582407129.0,
                    "replies": [
                        {
                            "body": "I guess if this is more of an SGF relationship where he introduces OP publicly as his GF, that's maybe ok. Different from my situation.",
                            "author": "sugarthrowSD",
                            "id": "fih91sa",
                            "parent_id": "t1_fih6zeo",
                            "score": 15,
                            "created_utc": 1582407855.0,
                            "replies": []
                        },
                        {
                            "body": "Happy cakeday u/pinotandsugar !",
                            "author": "ms_moogle",
                            "id": "fij4yqr",
                            "parent_id": "t1_fih6zeo",
                            "score": 2,
                            "created_utc": 1582434791.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "He is single. I’m at his home regularly. I leave clothes and toiletries at his house and I have spoken to family members. \nThe second concern is a real one. Like he is fun and silly with me, but he has a TON of employees and I have seen him on the phone with them. He is a tough Boss. I asked and re-asked his secretary. I asked and re-asked the head of HR. Both said that he would be initially embarrassed/confused but that he would love it and it’s a sweet idea.\nHe pretty much exclusively dates girls in their 20s, and has never been married. They have seen girls come and go, so they wouldn’t bullshit me.",
            "author": "DevinMills93",
            "id": "fifj661",
            "parent_id": "t1_fifi41x",
            "score": 26,
            "created_utc": 1582390273.0,
            "replies": [
                {
                    "body": "OK, well with that context it doesn't feel nearly as risky.   I hope it works out the way you hope!",
                    "author": "UseTheForceRey",
                    "id": "fifk9xv",
                    "parent_id": "t1_fifj661",
                    "score": 16,
                    "created_utc": 1582390626.0,
                    "replies": []
                },
                {
                    "body": "Sounds like you did your research. Still might bomb because it’s a pretty crazy idea but sounds amazing. Good luck!",
                    "author": "2fast-2curious",
                    "id": "fifx6h3",
                    "parent_id": "t1_fifj661",
                    "score": 12,
                    "created_utc": 1582394049.0,
                    "replies": []
                },
                {
                    "body": "I think it is obvious but just to check ,,,,,,,  he is expecting to see you that evening .......???????",
                    "author": "pinotandsugar",
                    "id": "fih77mu",
                    "parent_id": "t1_fifj661",
                    "score": 8,
                    "created_utc": 1582407212.0,
                    "replies": [
                        {
                            "body": "Yes! He thinks I’m coming over after class and that we are going to go to dinner. I told him I made reservations at this French restaurant a month ago.",
                            "author": "DevinMills93",
                            "id": "fih83o5",
                            "parent_id": "t1_fih77mu",
                            "score": 15,
                            "created_utc": 1582407520.0,
                            "replies": [
                                {
                                    "body": "perfect   it should be awesome.........",
                                    "author": "pinotandsugar",
                                    "id": "fih8ie5",
                                    "parent_id": "t1_fih83o5",
                                    "score": 3,
                                    "created_utc": 1582407668.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "My reaction completely. I just commented about my own experience with this on the other side - I was the person receiving a surprise at work - and it was horrible.",
            "author": "ilovecookies86",
            "id": "fifod0c",
            "parent_id": "t1_fifi41x",
            "score": 16,
            "created_utc": 1582391665.0,
            "replies": []
        },
        {
            "body": "I used to think I didn't need discretion. Now I'm rethinking that.",
            "author": "Normal_Objective",
            "id": "figc698",
            "parent_id": "t1_fifo9kc",
            "score": 5,
            "created_utc": 1582398081.0,
            "replies": [
                {
                    "body": "For me, discretion is its own form of currency, security, safety. Everyone has their own realities, and for mine, it's extremely important that there's a divide between my \"vanilla life\" and \"sugar life.\" \n\nGetting that bouquet at work honestly made me feel like I was being stalked. Dramatic, but I'd never had something show up somewhere from someone who never should've known that place existed..",
                    "author": "ilovecookies86",
                    "id": "fihkm0s",
                    "parent_id": "t1_figc698",
                    "score": 5,
                    "created_utc": 1582411420.0,
                    "replies": [
                        {
                            "body": "Yeah I can't imagine messing with someone's job like that.",
                            "author": "Normal_Objective",
                            "id": "fikj45z",
                            "parent_id": "t1_fihkm0s",
                            "score": 2,
                            "created_utc": 1582481320.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Ug!",
            "author": "UseTheForceRey",
            "id": "fifq1xw",
            "parent_id": "t1_fifo9kc",
            "score": 3,
            "created_utc": 1582392108.0,
            "replies": []
        },
        {
            "body": "Ahhh! I’m getting so nervous. Tell me why you think it’s a bad idea. I’m definitely open to listen.",
            "author": "DevinMills93",
            "id": "fifr2er",
            "parent_id": "t1_fifqtd5",
            "score": 1,
            "created_utc": 1582392436.0,
            "replies": [
                {
                    "body": "I think he will like it. As long as the HR person just thinks you are a vanilla girlfriend, I dont see the risk there. \n\nAnd we have had a few marching bands on the trading floor for work anniversaries, birthdays, and departures.\n\nEveryone liked them. Mariachi bands are probably similar.",
                    "author": null,
                    "id": "fifzwde",
                    "parent_id": "t1_fifr2er",
                    "score": 5,
                    "created_utc": 1582394806.0,
                    "replies": []
                },
                {
                    "body": "High Risk / Low Reward.\n\nIf you didn't do this, he will still be your SD\nIf you did do this, he may be totally be embarrassed and stop this SR or may want to turn into Vanilla.\n\nAre you prepared for all the outcomes?",
                    "author": "xanfiles",
                    "id": "fij7pv6",
                    "parent_id": "t1_fifr2er",
                    "score": 2,
                    "created_utc": 1582437030.0,
                    "replies": [
                        {
                            "body": "I’m in the last/hardest semester of my grad program, working in a research lab, studying 40 hours a week for the MCAT, and applying to medical school THIS cycle. \nAt this point high risk, low reward is my middle name. \n\nLol, but seriously, it’ll be fine. I’m not worried.",
                            "author": "DevinMills93",
                            "id": "fij85b3",
                            "parent_id": "t1_fij7pv6",
                            "score": 5,
                            "created_utc": 1582437417.0,
                            "replies": [
                                {
                                    "body": "applying this cycle? does that mean you’re applying to DO schools? I ask, since MD is closing up interviews about this time of year (then you could start applying June of this year to start med school in fall 2021). also it takes like a month until you get your MCAT score, meaning schools won’t consider your application complete until they have your score (further delay)",
                                    "author": "expiredbagels",
                                    "id": "fime7w4",
                                    "parent_id": "t1_fij85b3",
                                    "score": 1,
                                    "created_utc": 1582526793.0,
                                    "replies": [
                                        {
                                            "body": "*Upcoming cycle that opens up May 4th.",
                                            "author": "DevinMills93",
                                            "id": "fimedxr",
                                            "parent_id": "t1_fime7w4",
                                            "score": 1,
                                            "created_utc": 1582526973.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "Actually none of those things you mentioned are high risk. Studying 40 hours for MCAT is not gambling. That is what everybody does who wants to succeed.\n\nhaving said that you have mitigated some of the risks, but there is still uncertainty",
                                    "author": "xanfiles",
                                    "id": "fij8hab",
                                    "parent_id": "t1_fij85b3",
                                    "score": 0,
                                    "created_utc": 1582437728.0,
                                    "replies": [
                                        {
                                            "body": "I was more so referring to the fact that I’m doing all of those things at the same time and the risk of burnout is YUGE. \n\nBut I get it. I understand how some people could find this cringe-worthy. I don’t mind the differing opinions, it’s all a part of being in a niche community. Everyone sugars differently but it’s cool as long as it’s still sweet.",
                                            "author": "DevinMills93",
                                            "id": "fij959f",
                                            "parent_id": "t1_fij8hab",
                                            "score": 3,
                                            "created_utc": 1582438375.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Lol this is probably one of the worst ideas I've ever heard. I think \"invade Iraq because of WMD's\" was a better idea than this.\n\n1. You're announcing your relationship to his entire office and his employees. Even if you were \"age appropriate\", that would still be incredibly awkward.\n2. Even though you believe some people are aware of his predilictions for younger girls, I doubt everyone in his company are knowledgable to this degree.\n3. He probably doesn't want all of his employees incredibly distracted by his personal life\n4. He probably doesn't want to be carted away from his office, in the middle of a work day, by his 20 year old SB and a mariachi band.\n\nSeriously, such a terrible terrible idea. Is this what female autism looks like?",
                    "author": "ifisch",
                    "id": "file98m",
                    "parent_id": "t1_fifr2er",
                    "score": 2,
                    "created_utc": 1582499620.0,
                    "replies": [
                        {
                            "body": "Brah, relax.\nYou aren’t hall monitor of the middle school anymore.\n\nIt’s a 15 minute performance in a conference room for his birthday. \n\nHe refers to me as his girlfriend anyway. So, if people ask who it came from he can say it came from his girlfriend. Or he can choose to not disclose who it came from, no biggie. \n\nIt’s at the end of a work day and as stated above I won’t be there.\n\nI know all sugar relationships are different, but I would never do something that could jeopardize our relationship. \n\nIt’s not my fault—that despite spending TONS of money on women over the years—you’ve never been involved with someone who has taken the time to get you a real gift. Not a tie or a set of golf clubs, but something she actually planned out and tailored your interests.",
                            "author": "DevinMills93",
                            "id": "filfk74",
                            "parent_id": "t1_file98m",
                            "score": 2,
                            "created_utc": 1582500437.0,
                            "replies": [
                                {
                                    "body": "You literally described it as:\n\n*\"I decided to hire a mariachi band to burst into his company and perform around the office.\"*\n\nAlso, when you say that he refers to you as his girlfriend, are you sure he does that in front of everyone?\n\nHave you met his employees? All of them? Do you regularly go to his office during work hours? Would they recognize you?\n\nAlso, you say it's tailored to his interests. You said he likes mezcal. I think it's a pretty big leap to go from liking a drink to liking his place of work being invaded by a mariachi band courtesy of his SB.\n\nDefinitely looking forward to hearing how this goes.",
                                    "author": "ifisch",
                                    "id": "fim17pc",
                                    "parent_id": "t1_filfk74",
                                    "score": 1,
                                    "created_utc": 1582515436.0,
                                    "replies": [
                                        {
                                            "body": "Reading this back makes me giggle.",
                                            "author": "DevinMills93",
                                            "id": "fja3gkv",
                                            "parent_id": "t1_fim17pc",
                                            "score": 1,
                                            "created_utc": 1583165585.0,
                                            "replies": [
                                                {
                                                    "body": "well from the way you described it, it didn't happen anyway. So we'll never know I guess.",
                                                    "author": "ifisch",
                                                    "id": "fjakcyi",
                                                    "parent_id": "t1_fja3gkv",
                                                    "score": 1,
                                                    "created_utc": 1583175222.0,
                                                    "replies": [
                                                        {
                                                            "body": "Nah. We know. He loved the idea. \nBut thanks for the concern.",
                                                            "author": "DevinMills93",
                                                            "id": "fjdyja8",
                                                            "parent_id": "t1_fjakcyi",
                                                            "score": 1,
                                                            "created_utc": 1583261720.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Omg, thank you!\nI really feel like I know him well enough to plan such an elaborate birthday gift, but these comments definitely made me second guess myself.",
            "author": "DevinMills93",
            "id": "fig48a1",
            "parent_id": "t1_fig1tj7",
            "score": 2,
            "created_utc": 1582395974.0,
            "replies": [
                {
                    "body": "I’m still chortling over here. This is gonna be great.",
                    "author": "CMHDaddy79",
                    "id": "fiid6ss",
                    "parent_id": "t1_fig48a1",
                    "score": 3,
                    "created_utc": 1582419938.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "He is just a spontaneous guy. He is both loud and extroverted. For our second date he asked me what plans I had for the weekend, I said none. He responded by sending a limo an hour later to my place of work (a hospital) to pick me up, took me to my apartment to grab clothes, and then we went to a spa resort for the weekend. \n\nFourth date he flew me down to his work conference because he was bored.\n\nHe is awesome and I’m just trying to give some of that energy back. But now I’m nervous.",
            "author": "DevinMills93",
            "id": "fifvg1d",
            "parent_id": "t1_fift1r2",
            "score": 8,
            "created_utc": 1582393615.0,
            "replies": [
                {
                    "body": "I’m just trying to give some of that energy back. \n\nDo it!!! Especially since you have people who actually know him who agree with you. DON'T LET THE HATERS GET YOU DOWN! Married SDs can't relate at all",
                    "author": "sometimesviolet",
                    "id": "fig62q0",
                    "parent_id": "t1_fifvg1d",
                    "score": 9,
                    "created_utc": 1582396443.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "fiheju4",
                            "parent_id": "t1_fig62q0",
                            "score": 1,
                            "created_utc": 1582409386.0,
                            "replies": [
                                {
                                    "body": "Read the rest of the comments.",
                                    "author": "sometimesviolet",
                                    "id": "fihmdgx",
                                    "parent_id": "t1_fiheju4",
                                    "score": 1,
                                    "created_utc": 1582411991.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": ">loud and extroverted  \n>  \n>  spontaneous \n\nkey indicators he'll get it and enjoy it.   introverts don't get it.",
                    "author": "Academic_Set",
                    "id": "fig0zgx",
                    "parent_id": "t1_fifvg1d",
                    "score": 9,
                    "created_utc": 1582395025.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "fifeydc",
            "parent_id": "t1_fifc91l",
            "score": 4,
            "created_utc": 1582389137.0,
            "replies": [
                {
                    "body": "Going to be honest I definitely worried about that, especially since it’s a serious work environment. But, I think after the initial shock he will love it. The head of HR agreed with me, and she has been there for years.",
                    "author": "DevinMills93",
                    "id": "fifgm0u",
                    "parent_id": "t1_fifeydc",
                    "score": 2,
                    "created_utc": 1582389602.0,
                    "replies": [
                        {
                            "body": "If HR and his assistant are on your side I would not worry.  Ignore the advice from those who carry two umbrellas in August",
                            "author": "pinotandsugar",
                            "id": "fih7ri4",
                            "parent_id": "t1_fifgm0u",
                            "score": 5,
                            "created_utc": 1582407403.0,
                            "replies": [
                                {
                                    "body": "Thank you! \nShe actually blocked his schedule. He thinks he has a bunch of meetings, hahaha. He actually told me that he might get home later that day and that I can let myself in.",
                                    "author": "DevinMills93",
                                    "id": "fih8fek",
                                    "parent_id": "t1_fih7ri4",
                                    "score": 4,
                                    "created_utc": 1582407639.0,
                                    "replies": [
                                        {
                                            "body": "A little gift for his Assistant might be appropriate.......",
                                            "author": "pinotandsugar",
                                            "id": "fihapty",
                                            "parent_id": "t1_fih8fek",
                                            "score": 9,
                                            "created_utc": 1582408295.0,
                                            "replies": [
                                                {
                                                    "body": "I didn’t think of that! Thank you. I will definitely get something for her.",
                                                    "author": "DevinMills93",
                                                    "id": "fihflpv",
                                                    "parent_id": "t1_fihapty",
                                                    "score": 5,
                                                    "created_utc": 1582409749.0,
                                                    "replies": [
                                                        {
                                                            "body": "shots shots shots....",
                                                            "author": "Academic_Set",
                                                            "id": "fihh57s",
                                                            "parent_id": "t1_fihflpv",
                                                            "score": 4,
                                                            "created_utc": 1582410337.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "body": "That's a great idea!",
                                                    "author": "Sweettooth_dragon",
                                                    "id": "fiishql",
                                                    "parent_id": "t1_fihapty",
                                                    "score": 2,
                                                    "created_utc": 1582425819.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "At first I thought this thread was a joke, now I still think its a joke but I'm feeling existential dread at the possibility of this being real.",
                            "author": "Normal_Objective",
                            "id": "fifj7td",
                            "parent_id": "t1_fifgm0u",
                            "score": 2,
                            "created_utc": 1582390288.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Happening this week, I’ll update in a few days!",
            "author": "DevinMills93",
            "id": "filwrf5",
            "parent_id": "t1_fijvpzc",
            "score": 2,
            "created_utc": 1582512212.0,
            "replies": []
        },
        {
            "body": "Hehehe, it’s happening today. 😝",
            "author": "DevinMills93",
            "id": "fippjee",
            "parent_id": "t1_fippesk",
            "score": 2,
            "created_utc": 1582615321.0,
            "replies": []
        },
        {
            "body": "He's not married, dates younger women,  owns the company     I expect that they are thrilled that he is with someone who cares......",
            "author": "pinotandsugar",
            "id": "fih6zeo",
            "parent_id": "t1_fifr6uy",
            "score": 28,
            "created_utc": 1582407129.0,
            "replies": [
                {
                    "body": "I guess if this is more of an SGF relationship where he introduces OP publicly as his GF, that's maybe ok. Different from my situation.",
                    "author": "sugarthrowSD",
                    "id": "fih91sa",
                    "parent_id": "t1_fih6zeo",
                    "score": 15,
                    "created_utc": 1582407855.0,
                    "replies": []
                },
                {
                    "body": "Happy cakeday u/pinotandsugar !",
                    "author": "ms_moogle",
                    "id": "fij4yqr",
                    "parent_id": "t1_fih6zeo",
                    "score": 2,
                    "created_utc": 1582434791.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "OK, well with that context it doesn't feel nearly as risky.   I hope it works out the way you hope!",
            "author": "UseTheForceRey",
            "id": "fifk9xv",
            "parent_id": "t1_fifj661",
            "score": 16,
            "created_utc": 1582390626.0,
            "replies": []
        },
        {
            "body": "Sounds like you did your research. Still might bomb because it’s a pretty crazy idea but sounds amazing. Good luck!",
            "author": "2fast-2curious",
            "id": "fifx6h3",
            "parent_id": "t1_fifj661",
            "score": 12,
            "created_utc": 1582394049.0,
            "replies": []
        },
        {
            "body": "I think it is obvious but just to check ,,,,,,,  he is expecting to see you that evening .......???????",
            "author": "pinotandsugar",
            "id": "fih77mu",
            "parent_id": "t1_fifj661",
            "score": 8,
            "created_utc": 1582407212.0,
            "replies": [
                {
                    "body": "Yes! He thinks I’m coming over after class and that we are going to go to dinner. I told him I made reservations at this French restaurant a month ago.",
                    "author": "DevinMills93",
                    "id": "fih83o5",
                    "parent_id": "t1_fih77mu",
                    "score": 15,
                    "created_utc": 1582407520.0,
                    "replies": [
                        {
                            "body": "perfect   it should be awesome.........",
                            "author": "pinotandsugar",
                            "id": "fih8ie5",
                            "parent_id": "t1_fih83o5",
                            "score": 3,
                            "created_utc": 1582407668.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "For me, discretion is its own form of currency, security, safety. Everyone has their own realities, and for mine, it's extremely important that there's a divide between my \"vanilla life\" and \"sugar life.\" \n\nGetting that bouquet at work honestly made me feel like I was being stalked. Dramatic, but I'd never had something show up somewhere from someone who never should've known that place existed..",
            "author": "ilovecookies86",
            "id": "fihkm0s",
            "parent_id": "t1_figc698",
            "score": 5,
            "created_utc": 1582411420.0,
            "replies": [
                {
                    "body": "Yeah I can't imagine messing with someone's job like that.",
                    "author": "Normal_Objective",
                    "id": "fikj45z",
                    "parent_id": "t1_fihkm0s",
                    "score": 2,
                    "created_utc": 1582481320.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I think he will like it. As long as the HR person just thinks you are a vanilla girlfriend, I dont see the risk there. \n\nAnd we have had a few marching bands on the trading floor for work anniversaries, birthdays, and departures.\n\nEveryone liked them. Mariachi bands are probably similar.",
            "author": null,
            "id": "fifzwde",
            "parent_id": "t1_fifr2er",
            "score": 5,
            "created_utc": 1582394806.0,
            "replies": []
        },
        {
            "body": "High Risk / Low Reward.\n\nIf you didn't do this, he will still be your SD\nIf you did do this, he may be totally be embarrassed and stop this SR or may want to turn into Vanilla.\n\nAre you prepared for all the outcomes?",
            "author": "xanfiles",
            "id": "fij7pv6",
            "parent_id": "t1_fifr2er",
            "score": 2,
            "created_utc": 1582437030.0,
            "replies": [
                {
                    "body": "I’m in the last/hardest semester of my grad program, working in a research lab, studying 40 hours a week for the MCAT, and applying to medical school THIS cycle. \nAt this point high risk, low reward is my middle name. \n\nLol, but seriously, it’ll be fine. I’m not worried.",
                    "author": "DevinMills93",
                    "id": "fij85b3",
                    "parent_id": "t1_fij7pv6",
                    "score": 5,
                    "created_utc": 1582437417.0,
                    "replies": [
                        {
                            "body": "applying this cycle? does that mean you’re applying to DO schools? I ask, since MD is closing up interviews about this time of year (then you could start applying June of this year to start med school in fall 2021). also it takes like a month until you get your MCAT score, meaning schools won’t consider your application complete until they have your score (further delay)",
                            "author": "expiredbagels",
                            "id": "fime7w4",
                            "parent_id": "t1_fij85b3",
                            "score": 1,
                            "created_utc": 1582526793.0,
                            "replies": [
                                {
                                    "body": "*Upcoming cycle that opens up May 4th.",
                                    "author": "DevinMills93",
                                    "id": "fimedxr",
                                    "parent_id": "t1_fime7w4",
                                    "score": 1,
                                    "created_utc": 1582526973.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "Actually none of those things you mentioned are high risk. Studying 40 hours for MCAT is not gambling. That is what everybody does who wants to succeed.\n\nhaving said that you have mitigated some of the risks, but there is still uncertainty",
                            "author": "xanfiles",
                            "id": "fij8hab",
                            "parent_id": "t1_fij85b3",
                            "score": 0,
                            "created_utc": 1582437728.0,
                            "replies": [
                                {
                                    "body": "I was more so referring to the fact that I’m doing all of those things at the same time and the risk of burnout is YUGE. \n\nBut I get it. I understand how some people could find this cringe-worthy. I don’t mind the differing opinions, it’s all a part of being in a niche community. Everyone sugars differently but it’s cool as long as it’s still sweet.",
                                    "author": "DevinMills93",
                                    "id": "fij959f",
                                    "parent_id": "t1_fij8hab",
                                    "score": 3,
                                    "created_utc": 1582438375.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Lol this is probably one of the worst ideas I've ever heard. I think \"invade Iraq because of WMD's\" was a better idea than this.\n\n1. You're announcing your relationship to his entire office and his employees. Even if you were \"age appropriate\", that would still be incredibly awkward.\n2. Even though you believe some people are aware of his predilictions for younger girls, I doubt everyone in his company are knowledgable to this degree.\n3. He probably doesn't want all of his employees incredibly distracted by his personal life\n4. He probably doesn't want to be carted away from his office, in the middle of a work day, by his 20 year old SB and a mariachi band.\n\nSeriously, such a terrible terrible idea. Is this what female autism looks like?",
            "author": "ifisch",
            "id": "file98m",
            "parent_id": "t1_fifr2er",
            "score": 2,
            "created_utc": 1582499620.0,
            "replies": [
                {
                    "body": "Brah, relax.\nYou aren’t hall monitor of the middle school anymore.\n\nIt’s a 15 minute performance in a conference room for his birthday. \n\nHe refers to me as his girlfriend anyway. So, if people ask who it came from he can say it came from his girlfriend. Or he can choose to not disclose who it came from, no biggie. \n\nIt’s at the end of a work day and as stated above I won’t be there.\n\nI know all sugar relationships are different, but I would never do something that could jeopardize our relationship. \n\nIt’s not my fault—that despite spending TONS of money on women over the years—you’ve never been involved with someone who has taken the time to get you a real gift. Not a tie or a set of golf clubs, but something she actually planned out and tailored your interests.",
                    "author": "DevinMills93",
                    "id": "filfk74",
                    "parent_id": "t1_file98m",
                    "score": 2,
                    "created_utc": 1582500437.0,
                    "replies": [
                        {
                            "body": "You literally described it as:\n\n*\"I decided to hire a mariachi band to burst into his company and perform around the office.\"*\n\nAlso, when you say that he refers to you as his girlfriend, are you sure he does that in front of everyone?\n\nHave you met his employees? All of them? Do you regularly go to his office during work hours? Would they recognize you?\n\nAlso, you say it's tailored to his interests. You said he likes mezcal. I think it's a pretty big leap to go from liking a drink to liking his place of work being invaded by a mariachi band courtesy of his SB.\n\nDefinitely looking forward to hearing how this goes.",
                            "author": "ifisch",
                            "id": "fim17pc",
                            "parent_id": "t1_filfk74",
                            "score": 1,
                            "created_utc": 1582515436.0,
                            "replies": [
                                {
                                    "body": "Reading this back makes me giggle.",
                                    "author": "DevinMills93",
                                    "id": "fja3gkv",
                                    "parent_id": "t1_fim17pc",
                                    "score": 1,
                                    "created_utc": 1583165585.0,
                                    "replies": [
                                        {
                                            "body": "well from the way you described it, it didn't happen anyway. So we'll never know I guess.",
                                            "author": "ifisch",
                                            "id": "fjakcyi",
                                            "parent_id": "t1_fja3gkv",
                                            "score": 1,
                                            "created_utc": 1583175222.0,
                                            "replies": [
                                                {
                                                    "body": "Nah. We know. He loved the idea. \nBut thanks for the concern.",
                                                    "author": "DevinMills93",
                                                    "id": "fjdyja8",
                                                    "parent_id": "t1_fjakcyi",
                                                    "score": 1,
                                                    "created_utc": 1583261720.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I’m still chortling over here. This is gonna be great.",
            "author": "CMHDaddy79",
            "id": "fiid6ss",
            "parent_id": "t1_fig48a1",
            "score": 3,
            "created_utc": 1582419938.0,
            "replies": []
        },
        {
            "body": "I’m just trying to give some of that energy back. \n\nDo it!!! Especially since you have people who actually know him who agree with you. DON'T LET THE HATERS GET YOU DOWN! Married SDs can't relate at all",
            "author": "sometimesviolet",
            "id": "fig62q0",
            "parent_id": "t1_fifvg1d",
            "score": 9,
            "created_utc": 1582396443.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "fiheju4",
                    "parent_id": "t1_fig62q0",
                    "score": 1,
                    "created_utc": 1582409386.0,
                    "replies": [
                        {
                            "body": "Read the rest of the comments.",
                            "author": "sometimesviolet",
                            "id": "fihmdgx",
                            "parent_id": "t1_fiheju4",
                            "score": 1,
                            "created_utc": 1582411991.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": ">loud and extroverted  \n>  \n>  spontaneous \n\nkey indicators he'll get it and enjoy it.   introverts don't get it.",
            "author": "Academic_Set",
            "id": "fig0zgx",
            "parent_id": "t1_fifvg1d",
            "score": 9,
            "created_utc": 1582395025.0,
            "replies": []
        },
        {
            "body": "Going to be honest I definitely worried about that, especially since it’s a serious work environment. But, I think after the initial shock he will love it. The head of HR agreed with me, and she has been there for years.",
            "author": "DevinMills93",
            "id": "fifgm0u",
            "parent_id": "t1_fifeydc",
            "score": 2,
            "created_utc": 1582389602.0,
            "replies": [
                {
                    "body": "If HR and his assistant are on your side I would not worry.  Ignore the advice from those who carry two umbrellas in August",
                    "author": "pinotandsugar",
                    "id": "fih7ri4",
                    "parent_id": "t1_fifgm0u",
                    "score": 5,
                    "created_utc": 1582407403.0,
                    "replies": [
                        {
                            "body": "Thank you! \nShe actually blocked his schedule. He thinks he has a bunch of meetings, hahaha. He actually told me that he might get home later that day and that I can let myself in.",
                            "author": "DevinMills93",
                            "id": "fih8fek",
                            "parent_id": "t1_fih7ri4",
                            "score": 4,
                            "created_utc": 1582407639.0,
                            "replies": [
                                {
                                    "body": "A little gift for his Assistant might be appropriate.......",
                                    "author": "pinotandsugar",
                                    "id": "fihapty",
                                    "parent_id": "t1_fih8fek",
                                    "score": 9,
                                    "created_utc": 1582408295.0,
                                    "replies": [
                                        {
                                            "body": "I didn’t think of that! Thank you. I will definitely get something for her.",
                                            "author": "DevinMills93",
                                            "id": "fihflpv",
                                            "parent_id": "t1_fihapty",
                                            "score": 5,
                                            "created_utc": 1582409749.0,
                                            "replies": [
                                                {
                                                    "body": "shots shots shots....",
                                                    "author": "Academic_Set",
                                                    "id": "fihh57s",
                                                    "parent_id": "t1_fihflpv",
                                                    "score": 4,
                                                    "created_utc": 1582410337.0,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "body": "That's a great idea!",
                                            "author": "Sweettooth_dragon",
                                            "id": "fiishql",
                                            "parent_id": "t1_fihapty",
                                            "score": 2,
                                            "created_utc": 1582425819.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "At first I thought this thread was a joke, now I still think its a joke but I'm feeling existential dread at the possibility of this being real.",
                    "author": "Normal_Objective",
                    "id": "fifj7td",
                    "parent_id": "t1_fifgm0u",
                    "score": 2,
                    "created_utc": 1582390288.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I guess if this is more of an SGF relationship where he introduces OP publicly as his GF, that's maybe ok. Different from my situation.",
            "author": "sugarthrowSD",
            "id": "fih91sa",
            "parent_id": "t1_fih6zeo",
            "score": 15,
            "created_utc": 1582407855.0,
            "replies": []
        },
        {
            "body": "Happy cakeday u/pinotandsugar !",
            "author": "ms_moogle",
            "id": "fij4yqr",
            "parent_id": "t1_fih6zeo",
            "score": 2,
            "created_utc": 1582434791.0,
            "replies": []
        },
        {
            "body": "Yes! He thinks I’m coming over after class and that we are going to go to dinner. I told him I made reservations at this French restaurant a month ago.",
            "author": "DevinMills93",
            "id": "fih83o5",
            "parent_id": "t1_fih77mu",
            "score": 15,
            "created_utc": 1582407520.0,
            "replies": [
                {
                    "body": "perfect   it should be awesome.........",
                    "author": "pinotandsugar",
                    "id": "fih8ie5",
                    "parent_id": "t1_fih83o5",
                    "score": 3,
                    "created_utc": 1582407668.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Yeah I can't imagine messing with someone's job like that.",
            "author": "Normal_Objective",
            "id": "fikj45z",
            "parent_id": "t1_fihkm0s",
            "score": 2,
            "created_utc": 1582481320.0,
            "replies": []
        },
        {
            "body": "I’m in the last/hardest semester of my grad program, working in a research lab, studying 40 hours a week for the MCAT, and applying to medical school THIS cycle. \nAt this point high risk, low reward is my middle name. \n\nLol, but seriously, it’ll be fine. I’m not worried.",
            "author": "DevinMills93",
            "id": "fij85b3",
            "parent_id": "t1_fij7pv6",
            "score": 5,
            "created_utc": 1582437417.0,
            "replies": [
                {
                    "body": "applying this cycle? does that mean you’re applying to DO schools? I ask, since MD is closing up interviews about this time of year (then you could start applying June of this year to start med school in fall 2021). also it takes like a month until you get your MCAT score, meaning schools won’t consider your application complete until they have your score (further delay)",
                    "author": "expiredbagels",
                    "id": "fime7w4",
                    "parent_id": "t1_fij85b3",
                    "score": 1,
                    "created_utc": 1582526793.0,
                    "replies": [
                        {
                            "body": "*Upcoming cycle that opens up May 4th.",
                            "author": "DevinMills93",
                            "id": "fimedxr",
                            "parent_id": "t1_fime7w4",
                            "score": 1,
                            "created_utc": 1582526973.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Actually none of those things you mentioned are high risk. Studying 40 hours for MCAT is not gambling. That is what everybody does who wants to succeed.\n\nhaving said that you have mitigated some of the risks, but there is still uncertainty",
                    "author": "xanfiles",
                    "id": "fij8hab",
                    "parent_id": "t1_fij85b3",
                    "score": 0,
                    "created_utc": 1582437728.0,
                    "replies": [
                        {
                            "body": "I was more so referring to the fact that I’m doing all of those things at the same time and the risk of burnout is YUGE. \n\nBut I get it. I understand how some people could find this cringe-worthy. I don’t mind the differing opinions, it’s all a part of being in a niche community. Everyone sugars differently but it’s cool as long as it’s still sweet.",
                            "author": "DevinMills93",
                            "id": "fij959f",
                            "parent_id": "t1_fij8hab",
                            "score": 3,
                            "created_utc": 1582438375.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Brah, relax.\nYou aren’t hall monitor of the middle school anymore.\n\nIt’s a 15 minute performance in a conference room for his birthday. \n\nHe refers to me as his girlfriend anyway. So, if people ask who it came from he can say it came from his girlfriend. Or he can choose to not disclose who it came from, no biggie. \n\nIt’s at the end of a work day and as stated above I won’t be there.\n\nI know all sugar relationships are different, but I would never do something that could jeopardize our relationship. \n\nIt’s not my fault—that despite spending TONS of money on women over the years—you’ve never been involved with someone who has taken the time to get you a real gift. Not a tie or a set of golf clubs, but something she actually planned out and tailored your interests.",
            "author": "DevinMills93",
            "id": "filfk74",
            "parent_id": "t1_file98m",
            "score": 2,
            "created_utc": 1582500437.0,
            "replies": [
                {
                    "body": "You literally described it as:\n\n*\"I decided to hire a mariachi band to burst into his company and perform around the office.\"*\n\nAlso, when you say that he refers to you as his girlfriend, are you sure he does that in front of everyone?\n\nHave you met his employees? All of them? Do you regularly go to his office during work hours? Would they recognize you?\n\nAlso, you say it's tailored to his interests. You said he likes mezcal. I think it's a pretty big leap to go from liking a drink to liking his place of work being invaded by a mariachi band courtesy of his SB.\n\nDefinitely looking forward to hearing how this goes.",
                    "author": "ifisch",
                    "id": "fim17pc",
                    "parent_id": "t1_filfk74",
                    "score": 1,
                    "created_utc": 1582515436.0,
                    "replies": [
                        {
                            "body": "Reading this back makes me giggle.",
                            "author": "DevinMills93",
                            "id": "fja3gkv",
                            "parent_id": "t1_fim17pc",
                            "score": 1,
                            "created_utc": 1583165585.0,
                            "replies": [
                                {
                                    "body": "well from the way you described it, it didn't happen anyway. So we'll never know I guess.",
                                    "author": "ifisch",
                                    "id": "fjakcyi",
                                    "parent_id": "t1_fja3gkv",
                                    "score": 1,
                                    "created_utc": 1583175222.0,
                                    "replies": [
                                        {
                                            "body": "Nah. We know. He loved the idea. \nBut thanks for the concern.",
                                            "author": "DevinMills93",
                                            "id": "fjdyja8",
                                            "parent_id": "t1_fjakcyi",
                                            "score": 1,
                                            "created_utc": 1583261720.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "fiheju4",
            "parent_id": "t1_fig62q0",
            "score": 1,
            "created_utc": 1582409386.0,
            "replies": [
                {
                    "body": "Read the rest of the comments.",
                    "author": "sometimesviolet",
                    "id": "fihmdgx",
                    "parent_id": "t1_fiheju4",
                    "score": 1,
                    "created_utc": 1582411991.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "If HR and his assistant are on your side I would not worry.  Ignore the advice from those who carry two umbrellas in August",
            "author": "pinotandsugar",
            "id": "fih7ri4",
            "parent_id": "t1_fifgm0u",
            "score": 5,
            "created_utc": 1582407403.0,
            "replies": [
                {
                    "body": "Thank you! \nShe actually blocked his schedule. He thinks he has a bunch of meetings, hahaha. He actually told me that he might get home later that day and that I can let myself in.",
                    "author": "DevinMills93",
                    "id": "fih8fek",
                    "parent_id": "t1_fih7ri4",
                    "score": 4,
                    "created_utc": 1582407639.0,
                    "replies": [
                        {
                            "body": "A little gift for his Assistant might be appropriate.......",
                            "author": "pinotandsugar",
                            "id": "fihapty",
                            "parent_id": "t1_fih8fek",
                            "score": 9,
                            "created_utc": 1582408295.0,
                            "replies": [
                                {
                                    "body": "I didn’t think of that! Thank you. I will definitely get something for her.",
                                    "author": "DevinMills93",
                                    "id": "fihflpv",
                                    "parent_id": "t1_fihapty",
                                    "score": 5,
                                    "created_utc": 1582409749.0,
                                    "replies": [
                                        {
                                            "body": "shots shots shots....",
                                            "author": "Academic_Set",
                                            "id": "fihh57s",
                                            "parent_id": "t1_fihflpv",
                                            "score": 4,
                                            "created_utc": 1582410337.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "That's a great idea!",
                                    "author": "Sweettooth_dragon",
                                    "id": "fiishql",
                                    "parent_id": "t1_fihapty",
                                    "score": 2,
                                    "created_utc": 1582425819.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "At first I thought this thread was a joke, now I still think its a joke but I'm feeling existential dread at the possibility of this being real.",
            "author": "Normal_Objective",
            "id": "fifj7td",
            "parent_id": "t1_fifgm0u",
            "score": 2,
            "created_utc": 1582390288.0,
            "replies": []
        },
        {
            "body": "perfect   it should be awesome.........",
            "author": "pinotandsugar",
            "id": "fih8ie5",
            "parent_id": "t1_fih83o5",
            "score": 3,
            "created_utc": 1582407668.0,
            "replies": []
        },
        {
            "body": "applying this cycle? does that mean you’re applying to DO schools? I ask, since MD is closing up interviews about this time of year (then you could start applying June of this year to start med school in fall 2021). also it takes like a month until you get your MCAT score, meaning schools won’t consider your application complete until they have your score (further delay)",
            "author": "expiredbagels",
            "id": "fime7w4",
            "parent_id": "t1_fij85b3",
            "score": 1,
            "created_utc": 1582526793.0,
            "replies": [
                {
                    "body": "*Upcoming cycle that opens up May 4th.",
                    "author": "DevinMills93",
                    "id": "fimedxr",
                    "parent_id": "t1_fime7w4",
                    "score": 1,
                    "created_utc": 1582526973.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Actually none of those things you mentioned are high risk. Studying 40 hours for MCAT is not gambling. That is what everybody does who wants to succeed.\n\nhaving said that you have mitigated some of the risks, but there is still uncertainty",
            "author": "xanfiles",
            "id": "fij8hab",
            "parent_id": "t1_fij85b3",
            "score": 0,
            "created_utc": 1582437728.0,
            "replies": [
                {
                    "body": "I was more so referring to the fact that I’m doing all of those things at the same time and the risk of burnout is YUGE. \n\nBut I get it. I understand how some people could find this cringe-worthy. I don’t mind the differing opinions, it’s all a part of being in a niche community. Everyone sugars differently but it’s cool as long as it’s still sweet.",
                    "author": "DevinMills93",
                    "id": "fij959f",
                    "parent_id": "t1_fij8hab",
                    "score": 3,
                    "created_utc": 1582438375.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "You literally described it as:\n\n*\"I decided to hire a mariachi band to burst into his company and perform around the office.\"*\n\nAlso, when you say that he refers to you as his girlfriend, are you sure he does that in front of everyone?\n\nHave you met his employees? All of them? Do you regularly go to his office during work hours? Would they recognize you?\n\nAlso, you say it's tailored to his interests. You said he likes mezcal. I think it's a pretty big leap to go from liking a drink to liking his place of work being invaded by a mariachi band courtesy of his SB.\n\nDefinitely looking forward to hearing how this goes.",
            "author": "ifisch",
            "id": "fim17pc",
            "parent_id": "t1_filfk74",
            "score": 1,
            "created_utc": 1582515436.0,
            "replies": [
                {
                    "body": "Reading this back makes me giggle.",
                    "author": "DevinMills93",
                    "id": "fja3gkv",
                    "parent_id": "t1_fim17pc",
                    "score": 1,
                    "created_utc": 1583165585.0,
                    "replies": [
                        {
                            "body": "well from the way you described it, it didn't happen anyway. So we'll never know I guess.",
                            "author": "ifisch",
                            "id": "fjakcyi",
                            "parent_id": "t1_fja3gkv",
                            "score": 1,
                            "created_utc": 1583175222.0,
                            "replies": [
                                {
                                    "body": "Nah. We know. He loved the idea. \nBut thanks for the concern.",
                                    "author": "DevinMills93",
                                    "id": "fjdyja8",
                                    "parent_id": "t1_fjakcyi",
                                    "score": 1,
                                    "created_utc": 1583261720.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Read the rest of the comments.",
            "author": "sometimesviolet",
            "id": "fihmdgx",
            "parent_id": "t1_fiheju4",
            "score": 1,
            "created_utc": 1582411991.0,
            "replies": []
        },
        {
            "body": "Thank you! \nShe actually blocked his schedule. He thinks he has a bunch of meetings, hahaha. He actually told me that he might get home later that day and that I can let myself in.",
            "author": "DevinMills93",
            "id": "fih8fek",
            "parent_id": "t1_fih7ri4",
            "score": 4,
            "created_utc": 1582407639.0,
            "replies": [
                {
                    "body": "A little gift for his Assistant might be appropriate.......",
                    "author": "pinotandsugar",
                    "id": "fihapty",
                    "parent_id": "t1_fih8fek",
                    "score": 9,
                    "created_utc": 1582408295.0,
                    "replies": [
                        {
                            "body": "I didn’t think of that! Thank you. I will definitely get something for her.",
                            "author": "DevinMills93",
                            "id": "fihflpv",
                            "parent_id": "t1_fihapty",
                            "score": 5,
                            "created_utc": 1582409749.0,
                            "replies": [
                                {
                                    "body": "shots shots shots....",
                                    "author": "Academic_Set",
                                    "id": "fihh57s",
                                    "parent_id": "t1_fihflpv",
                                    "score": 4,
                                    "created_utc": 1582410337.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "That's a great idea!",
                            "author": "Sweettooth_dragon",
                            "id": "fiishql",
                            "parent_id": "t1_fihapty",
                            "score": 2,
                            "created_utc": 1582425819.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "*Upcoming cycle that opens up May 4th.",
            "author": "DevinMills93",
            "id": "fimedxr",
            "parent_id": "t1_fime7w4",
            "score": 1,
            "created_utc": 1582526973.0,
            "replies": []
        },
        {
            "body": "I was more so referring to the fact that I’m doing all of those things at the same time and the risk of burnout is YUGE. \n\nBut I get it. I understand how some people could find this cringe-worthy. I don’t mind the differing opinions, it’s all a part of being in a niche community. Everyone sugars differently but it’s cool as long as it’s still sweet.",
            "author": "DevinMills93",
            "id": "fij959f",
            "parent_id": "t1_fij8hab",
            "score": 3,
            "created_utc": 1582438375.0,
            "replies": []
        },
        {
            "body": "Reading this back makes me giggle.",
            "author": "DevinMills93",
            "id": "fja3gkv",
            "parent_id": "t1_fim17pc",
            "score": 1,
            "created_utc": 1583165585.0,
            "replies": [
                {
                    "body": "well from the way you described it, it didn't happen anyway. So we'll never know I guess.",
                    "author": "ifisch",
                    "id": "fjakcyi",
                    "parent_id": "t1_fja3gkv",
                    "score": 1,
                    "created_utc": 1583175222.0,
                    "replies": [
                        {
                            "body": "Nah. We know. He loved the idea. \nBut thanks for the concern.",
                            "author": "DevinMills93",
                            "id": "fjdyja8",
                            "parent_id": "t1_fjakcyi",
                            "score": 1,
                            "created_utc": 1583261720.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "A little gift for his Assistant might be appropriate.......",
            "author": "pinotandsugar",
            "id": "fihapty",
            "parent_id": "t1_fih8fek",
            "score": 9,
            "created_utc": 1582408295.0,
            "replies": [
                {
                    "body": "I didn’t think of that! Thank you. I will definitely get something for her.",
                    "author": "DevinMills93",
                    "id": "fihflpv",
                    "parent_id": "t1_fihapty",
                    "score": 5,
                    "created_utc": 1582409749.0,
                    "replies": [
                        {
                            "body": "shots shots shots....",
                            "author": "Academic_Set",
                            "id": "fihh57s",
                            "parent_id": "t1_fihflpv",
                            "score": 4,
                            "created_utc": 1582410337.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "That's a great idea!",
                    "author": "Sweettooth_dragon",
                    "id": "fiishql",
                    "parent_id": "t1_fihapty",
                    "score": 2,
                    "created_utc": 1582425819.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "well from the way you described it, it didn't happen anyway. So we'll never know I guess.",
            "author": "ifisch",
            "id": "fjakcyi",
            "parent_id": "t1_fja3gkv",
            "score": 1,
            "created_utc": 1583175222.0,
            "replies": [
                {
                    "body": "Nah. We know. He loved the idea. \nBut thanks for the concern.",
                    "author": "DevinMills93",
                    "id": "fjdyja8",
                    "parent_id": "t1_fjakcyi",
                    "score": 1,
                    "created_utc": 1583261720.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I didn’t think of that! Thank you. I will definitely get something for her.",
            "author": "DevinMills93",
            "id": "fihflpv",
            "parent_id": "t1_fihapty",
            "score": 5,
            "created_utc": 1582409749.0,
            "replies": [
                {
                    "body": "shots shots shots....",
                    "author": "Academic_Set",
                    "id": "fihh57s",
                    "parent_id": "t1_fihflpv",
                    "score": 4,
                    "created_utc": 1582410337.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "That's a great idea!",
            "author": "Sweettooth_dragon",
            "id": "fiishql",
            "parent_id": "t1_fihapty",
            "score": 2,
            "created_utc": 1582425819.0,
            "replies": []
        },
        {
            "body": "Nah. We know. He loved the idea. \nBut thanks for the concern.",
            "author": "DevinMills93",
            "id": "fjdyja8",
            "parent_id": "t1_fjakcyi",
            "score": 1,
            "created_utc": 1583261720.0,
            "replies": []
        },
        {
            "body": "shots shots shots....",
            "author": "Academic_Set",
            "id": "fihh57s",
            "parent_id": "t1_fihflpv",
            "score": 4,
            "created_utc": 1582410337.0,
            "replies": []
        }
    ]
}