{
    "title": "Update on the SD who kicked me out in the middle of the night. He has some MAJOR personal issues!",
    "post_id": "mkpdo4",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/mkpdo4/update_on_the_sd_who_kicked_me_out_in_the_middle/",
    "author": "altruistic_SB",
    "body": "Since that night, we had 3 dates scheduled and only went on ONE. He apologized about kicking me out and said he got nervous and freaked out. He promised to never do it again and he is more comfortable with me now. We had a scheduled date where he specifically asked me to stay over which I agreed to- but that never happened. We are no longer seeing each other. Here’s how it went down. \n\nWe had a date scheduled two Saturdays ago. I woke up that morning with my period. I texted him to let him know- said I wouldn’t be comfortable having sex but I could take care of him in other ways. He waits until 2 hours before our date to respond and says he wants to cancel. WTF. This is a Saturday NIGHT people!! My time is valuable....he clearly doesn’t feel like it is. \n\nWe reschedule for the following Saturday. On a whim the Friday before our scheduled date he asks me to lunch which I agree to. After our impromptu lunch date, he asks if I can go back to him place for “bonus money”. I politely say no as I have plans for Friday night- (since I blocked off my whole Saturday night the next night for HIM) he got a little upset and I could tell he felt rejected that I didn’t want to go back with him right then and there. Like no dude, I have a life and friends outside of you. \n\nSaturday rolls around. He texts me 3 times between 6:30-10am. I didn’t wake up until 10:30am -so I didn’t respond til around 11. His texts got progressively more aggressive “good morning” to “hello???” to “okay then...guess I’m your second choice.” Huh???? When I finally did respond at 11 am (mind you our date is scheduled at 6pm) he says “you know what I’m just not feeling it, let’s cancel. I feel like you’re not into me” (WTF?!). So many red flags, way too much insecurity and jealousy. Just overall unattractive!!\n\nI pressed further and he said he wants something more serious than what I’m looking for. He is referring to a conversation we had about me ever seeing myself dating a man much older than me. I told him specifically with him, I do not see us in a serious long term relationship because he has a vasectomy and I want to have my own biological kids one day. My thing is WHY string me along for 2 Saturdays in a row- I wasted so much time on this guy! I could have been going on other dates!!! Or made other plans!! Anything! Oh well, back to the bowl and I’m steering clear of newbie SDs from now on. Only experienced SDs apply within 😂",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/mkpdo4/update_on_the_sd_who_kicked_me_out_in_the_middle/",
    "score": 110,
    "upvote_ratio": 0.94,
    "created_utc": 1617642016.0,
    "num_comments": 42,
    "links": [
        []
    ],
    "comments": [
        {
            "body": ">“okay then...guess I’m your second choice\"\n\n\nIf he thinks he's the second choice, he must think pretty highly of himself. I'd put him down as 354th place. Right behind a root canal and poison ivy on the taint.",
            "author": "OldschoolSD",
            "id": "gthk8fs",
            "parent_id": "t3_mkpdo4",
            "score": 50,
            "created_utc": 1617651116.0,
            "replies": [
                {
                    "body": "\"Right behind a root canal and poison ivy on the taint.\"\n\n^^^ made my Monday so much better. Thank you!",
                    "author": null,
                    "id": "gthrlcc",
                    "parent_id": "t1_gthk8fs",
                    "score": 11,
                    "created_utc": 1617654466.0,
                    "replies": []
                },
                {
                    "body": "📣📣🚨🚨TAINT TANNING!!!",
                    "author": "TrumpsCovidfefe",
                    "id": "gtigvfd",
                    "parent_id": "t1_gthk8fs",
                    "score": 6,
                    "created_utc": 1617666844.0,
                    "replies": [
                        {
                            "body": "Yessssss Sawbones reference in the wild!",
                            "author": "xoxo_ruby_darling",
                            "id": "gtkmhl4",
                            "parent_id": "t1_gtigvfd",
                            "score": 1,
                            "created_utc": 1617719085.0,
                            "replies": [
                                {
                                    "body": "I freaking love that podcast. My curiosities for all manner of medical conditions and the human condition are so well indulged by the show. Glad it was a reference that didn't go unappreciated!",
                                    "author": "TrumpsCovidfefe",
                                    "id": "gtkwtf7",
                                    "parent_id": "t1_gtkmhl4",
                                    "score": 2,
                                    "created_utc": 1617723711.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "😆 about where he belongs in my opinion...even as another guy!",
                    "author": "Dragonfly04769",
                    "id": "gyg6beh",
                    "parent_id": "t1_gthk8fs",
                    "score": 1,
                    "created_utc": 1621261972.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Clingy. Insecure. Demanding. Yuck. \n\nSA is blah, but it’s better to be blah than pissed off. \n\nCheers and good luck!",
            "author": "ExExpectations",
            "id": "gth0yj4",
            "parent_id": "t3_mkpdo4",
            "score": 63,
            "created_utc": 1617642343.0,
            "replies": []
        },
        {
            "body": "Ew. No wonder he's after sugar, his wife probably won't fuck his insecure ass either.",
            "author": "Lucy_in_the_sky_0",
            "id": "gthu77l",
            "parent_id": "t3_mkpdo4",
            "score": 26,
            "created_utc": 1617655664.0,
            "replies": [
                {
                    "body": "So true!",
                    "author": "altruistic_SB",
                    "id": "gthw28i",
                    "parent_id": "t1_gthu77l",
                    "score": 10,
                    "created_utc": 1617656513.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Leopards don't change their spots and disturbed people don't get undisturbed without significant intervention.\n\nHere, the guy's disturbed behavior of 'kicking you out' turned out to be consistent with his general nature.\n\nYou took a big risk by seeing him again. I am glad it did not turn out any worse for you!",
            "author": null,
            "id": "gthdqif",
            "parent_id": "t3_mkpdo4",
            "score": 19,
            "created_utc": 1617648139.0,
            "replies": []
        },
        {
            "body": "Oh well, back to the bowl and I’m steering clear of newbie SDs from now on. Only experienced SDs apply within \n\nProbably a very sound rule........\n\nIt does not sound like this was salvageable .\n\nReally important to go back and make a list of all the danger signs that you saw but which did not then fit into a recognizable pattern.\n\nAbout as far from sugar as you can get but  \"Left of Bang\"  is a pretty good book on learning to recognize behavioral signals and a good follow on to Gift of Fear .",
            "author": "pinotandsugar",
            "id": "gthh2n1",
            "parent_id": "t3_mkpdo4",
            "score": 12,
            "created_utc": 1617649666.0,
            "replies": [
                {
                    "body": ">Really important to go back and make a list of all the danger signs that you saw but which did not then fit into a recognizable pattern.\n\nWas a pattern needed after 'he kicked me out in the middle of the night?'  I'm really not sure why she scheduled more dates with him after that :(",
                    "author": null,
                    "id": "gtijzb8",
                    "parent_id": "t1_gthh2n1",
                    "score": 5,
                    "created_utc": 1617668441.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "He sounds like hes a child.  How old is this idiot?",
            "author": "sinvortex",
            "id": "gth3nj9",
            "parent_id": "t3_mkpdo4",
            "score": 8,
            "created_utc": 1617643554.0,
            "replies": [
                {
                    "body": "54 😅",
                    "author": "altruistic_SB",
                    "id": "gthhc6d",
                    "parent_id": "t1_gth3nj9",
                    "score": 6,
                    "created_utc": 1617649790.0,
                    "replies": [
                        {
                            "body": ">54 😅\n\nSome people just grow old, they never grow up. Good riddance.",
                            "author": "ExExpectations",
                            "id": "gthyjr8",
                            "parent_id": "t1_gthhc6d",
                            "score": 6,
                            "created_utc": 1617657685.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Aww the little man-child’s ego got crushed. When will he learn that women don’t exist for his pleasure or entertainment.  \n\nGuys like this are pathetic.",
            "author": "uniballSD",
            "id": "gth57qw",
            "parent_id": "t3_mkpdo4",
            "score": 15,
            "created_utc": 1617644251.0,
            "replies": [
                {
                    "body": "Probably never",
                    "author": null,
                    "id": "gthqc3n",
                    "parent_id": "t1_gth57qw",
                    "score": 4,
                    "created_utc": 1617653892.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Here girl, let me do the facepalms for you. Ugh what a child🙄🙄🤦🏻‍♀️🤦🏻‍♀️",
            "author": "slimshLady00",
            "id": "gthrowj",
            "parent_id": "t3_mkpdo4",
            "score": 3,
            "created_utc": 1617654511.0,
            "replies": []
        },
        {
            "body": "Sounds like my ex 🙄 anyone who tries to bait you like that repeatedly is not worth your time.",
            "author": "Devon_Bunny",
            "id": "gthm1pt",
            "parent_id": "t3_mkpdo4",
            "score": 2,
            "created_utc": 1617651948.0,
            "replies": []
        },
        {
            "body": "If you ever read his profile or messages say, \"I'm just checking it out\" or something similar , DO NOT ENGAGE! 😂\n\nHis ideology alone shows he's a newb. He's looking for an instant committed GIRLFRIEND. Hes expecting to get a girl at his beck and call with only insinuating he'll pay but really has little to no intention to do so. Gross! \n\nThey have no idea how sugaring works and will not provide anything that qualifies as it. They don't understand that you have to be super generous and take the considerations of adjustments to the SBs lifestyle and schedule as well to be an actual Sugar\nDaddy. It's seriously a special person that can make a good SD where both parties are happy and not every joe on the street can do it. Someone with a loose cannon schedule who wants you expects you'll see him when he snaps his fingers is not going to be an SD.\n\nThey have no idea what they're looking for but they want to get laid on the reg and lavished with attention and pay little to nothing. These are the guys that think spending a weekend alone with em on their boat in the middle of nowhere for days straight is payment enough. \"I'm a doctor, why wouldn't my company be enough for her?\". Or you accompanying them on a lame business trip for 4 days where you'll wait around for them in the hotel is acceptable. They don't even think twice at the idea you would lose $;doing this since you're missing work, pet sitting fees, etc. These guys are the ones that laugh when you tell them a reasonable amount . They've never provided for a girl like that and they don't think you're with what you know you are. RUN!!\n\nThere is an Intel station here and it's hilarious how many of the new recent phd grad engineers are looking for GFE with long commutes to them and not even weekly for no more than 2fitty. They are making false hopeful assumptions and always avoid that. \n\nYou'd have to be a complete idiot to assume SA is just another dating site, and everyone knows it isn't. The newbies make up the vast majority who go on the site thinking they can pay for a date or two (just the outing lol) and It'll earn em a long term and unpaid commitment bang maid who will be available at the drop of a hat They want GFE but make zero effort. They will demand and shine for BB because that's what a committed partner would do. The worst are the ones who haven't paid you a dime yet are getting pissy that you aren't responding fast enough (it's been as bad as 10 messages in just a few hours, like every 30 min or less), or if you aren't available on their whim. \n\nExperienced SDs, or even just a super generous strip club/ sex worker regulars, people who know how the exchange works and value your worth, never haggling or expecting more, are the only ones worthy of your time. No one has time to teach someone the games , Especially those fighting it since day 1. They think, \"well I'm different , I won't need to provide at all like those other schmucks\". No, the real schmuck is you since the others are the ones getting laid and having a fun in a satisfying relationship with someone  who actually appreciates em and is happy to get time with them.",
            "author": "kimchi_Queen",
            "id": "gtjt7dd",
            "parent_id": "t3_mkpdo4",
            "score": 2,
            "created_utc": 1617699332.0,
            "replies": []
        },
        {
            "body": "Why are you dating this child?",
            "author": null,
            "id": "gthpswr",
            "parent_id": "t3_mkpdo4",
            "score": 2,
            "created_utc": 1617653647.0,
            "replies": []
        },
        {
            "body": "Do you really allow yourself to gey treated like this?",
            "author": "Sweetgirlgi5",
            "id": "gti2ark",
            "parent_id": "t3_mkpdo4",
            "score": -3,
            "created_utc": 1617659474.0,
            "replies": [
                {
                    "body": "Absolutely not! Do you really post judgy comments without reading the entire post? If you actually read my post you would see that I broke things off with him 😊",
                    "author": "altruistic_SB",
                    "id": "gti30w1",
                    "parent_id": "t1_gti2ark",
                    "score": 1,
                    "created_utc": 1617659830.0,
                    "replies": [
                        {
                            "body": "Girl chill. I only asked if you allow yourself to be treated like this because he sounds like an exhausting clingy manchuld. Good for you!🙌🏽",
                            "author": "Sweetgirlgi5",
                            "id": "gti36sv",
                            "parent_id": "t1_gti30w1",
                            "score": -3,
                            "created_utc": 1617659912.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "If you're in the bowl, you definitely need boundaries. But you also need clear communication skills. And if you are going to work with SDs in general, you need to understand their wake/sleep schedule first and foremost. Generally that can be determined by their work schedule, eg, what time they get up for work. Based on that knowledge, if you're not willing to facilitate communication during the hours when the SD is up, then you either need to establish, clearly, your regular hours yourself, or, not sugar.\n\nIt's pretty much like understanding how to work for a corporate executive. If you have that knowledge of how that culture works, then half the work to understand your SD, and the world he lives in, is done for you. If you're not willing to participate in that world, don't sugar.",
            "author": "SephoraRothschild",
            "id": "gthd126",
            "parent_id": "t3_mkpdo4",
            "score": -15,
            "created_utc": 1617647813.0,
            "replies": [
                {
                    "body": "I’m not sure about this - if a SD can’t cope with a SB not replying for a couple of hours for a valid reason, that’s an issue. Bare in mind read receipts exist so if she’s not read the messages, she’s clearly busy or asleep, not ignoring him, and he’s massively overreacted. \n\nOP makes it sound like this was out of the blue, in which case, he was being way too needy and she shouldn’t have to adjust to him. If it wasn’t out of the blue and he’s been demanding before, she needed to have set some boundaries. I make it clear to SDs that I work set hours Mon-Fri and so might not reply straight away, and haven’t had any problems with neediness yet. \n\nSRs are a two way street, a SB shouldn’t need to adjust her entire sleep schedule to be able to text back on demand. Both parties should be able to find a communication middle-ground, and if they can’t, they should find a different SR.",
                    "author": "Gee_n_tonic",
                    "id": "gthgg0d",
                    "parent_id": "t1_gthd126",
                    "score": 14,
                    "created_utc": 1617649375.0,
                    "replies": []
                },
                {
                    "body": "It is INSANE to expect an SB to text you back early in the morning on a Saturday.",
                    "author": "clemkaddidlehopper",
                    "id": "gthfxga",
                    "parent_id": "t1_gthd126",
                    "score": 14,
                    "created_utc": 1617649136.0,
                    "replies": [
                        {
                            "body": "Absolutely. That goes for anyone.",
                            "author": "OldschoolSD",
                            "id": "gthx7y2",
                            "parent_id": "t1_gthfxga",
                            "score": 3,
                            "created_utc": 1617657058.0,
                            "replies": []
                        },
                        {
                            "body": "Agreed, I might send mine a good morning text (never super early, I'm talking 9-10am), but I also know if she doesn't reply she's likely asleep or busy and will later in the day.",
                            "author": "mraspencer",
                            "id": "gti1332",
                            "parent_id": "t1_gthfxga",
                            "score": 2,
                            "created_utc": 1617658893.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "I think you are misunderstanding my point. He has never expected me to text him back immediately, it was very much out of the blue! He was insecure and overbearing and that came out. Quite frankly, if a SD is so needy that he can’t wait for me to reply within a timely manner the HE needs to not sugar and get a damn puppy or something.",
                    "author": "altruistic_SB",
                    "id": "gthhaas",
                    "parent_id": "t1_gthd126",
                    "score": 6,
                    "created_utc": 1617649765.0,
                    "replies": []
                },
                {
                    "body": "You know, if these guys have teenage kids they should understand the idea of heading out at 11, staying out till 3 and waking up about noon. Yeah I'm up around 6:30 pretty much every morning, but I sort of get that my SB might not.",
                    "author": "ChapterRelative",
                    "id": "gtii4ry",
                    "parent_id": "t1_gthd126",
                    "score": 2,
                    "created_utc": 1617667506.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "🥺",
            "author": "daddoms",
            "id": "gth5oi0",
            "parent_id": "t3_mkpdo4",
            "score": 1,
            "created_utc": 1617644462.0,
            "replies": []
        },
        {
            "body": "I’m glad you saw his true self. I remember a lot of people have feedback along the lines of leaving him alone and keeping with your boundaries first...\n\nHe’s not the SD guy for you and the clashing is evidence.",
            "author": null,
            "id": "gth5tyx",
            "parent_id": "t3_mkpdo4",
            "score": 1,
            "created_utc": 1617644530.0,
            "replies": []
        },
        {
            "body": "Oh wow dump that SD.  He will never grow up.",
            "author": "Samuraiguy747",
            "id": "gthg931",
            "parent_id": "t3_mkpdo4",
            "score": 1,
            "created_utc": 1617649285.0,
            "replies": []
        },
        {
            "body": "[removed]",
            "author": null,
            "id": "gticcn4",
            "parent_id": "t3_mkpdo4",
            "score": 1,
            "created_utc": 1617664511.0,
            "replies": []
        },
        {
            "body": "Ew. I’m so glad you’re done with that mess.",
            "author": "FoxyFreckles1989",
            "id": "gtimo05",
            "parent_id": "t3_mkpdo4",
            "score": 1,
            "created_utc": 1617669797.0,
            "replies": [
                {
                    "body": "Me too!",
                    "author": "altruistic_SB",
                    "id": "gtinbzs",
                    "parent_id": "t1_gtimo05",
                    "score": 1,
                    "created_utc": 1617670139.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I just feel like I am never going to have a SR ending in so much drama to warrant its own SLF post.",
            "author": "bluelunarmonkey",
            "id": "gtiql9k",
            "parent_id": "t3_mkpdo4",
            "score": 1,
            "created_utc": 1617671811.0,
            "replies": []
        },
        {
            "body": "Nah, he has anger issues, he over reacted and kicked you out because he was “nervous”, you were nervous too and he ruined your night. He also seems the jealous type, This is why he is single. You deserve better!! .......Next 😊",
            "author": "moneyanddogs",
            "id": "gtj0p1a",
            "parent_id": "t3_mkpdo4",
            "score": 1,
            "created_utc": 1617677092.0,
            "replies": []
        },
        {
            "body": "Sounds like you dodged a bullet",
            "author": "Zealousideal_Map8100",
            "id": "gtk0pdh",
            "parent_id": "t3_mkpdo4",
            "score": 1,
            "created_utc": 1617706423.0,
            "replies": []
        },
        {
            "body": "“Bonus Money “ how insulting, he had no respect for you or your time.  You need to start loving and respecting yourself and don’t allow any man , sd whatever ,take advantage of you. You were wayy to accommodating.  Next time block them, he wanted to play games with you acting like a manchild.  Fuck him. Your entire post was giving me “broke man” teas.",
            "author": "newsbhere",
            "id": "gtk2t28",
            "parent_id": "t3_mkpdo4",
            "score": 1,
            "created_utc": 1617708077.0,
            "replies": []
        },
        {
            "body": "\"Right behind a root canal and poison ivy on the taint.\"\n\n^^^ made my Monday so much better. Thank you!",
            "author": null,
            "id": "gthrlcc",
            "parent_id": "t1_gthk8fs",
            "score": 11,
            "created_utc": 1617654466.0,
            "replies": []
        },
        {
            "body": "📣📣🚨🚨TAINT TANNING!!!",
            "author": "TrumpsCovidfefe",
            "id": "gtigvfd",
            "parent_id": "t1_gthk8fs",
            "score": 6,
            "created_utc": 1617666844.0,
            "replies": [
                {
                    "body": "Yessssss Sawbones reference in the wild!",
                    "author": "xoxo_ruby_darling",
                    "id": "gtkmhl4",
                    "parent_id": "t1_gtigvfd",
                    "score": 1,
                    "created_utc": 1617719085.0,
                    "replies": [
                        {
                            "body": "I freaking love that podcast. My curiosities for all manner of medical conditions and the human condition are so well indulged by the show. Glad it was a reference that didn't go unappreciated!",
                            "author": "TrumpsCovidfefe",
                            "id": "gtkwtf7",
                            "parent_id": "t1_gtkmhl4",
                            "score": 2,
                            "created_utc": 1617723711.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "😆 about where he belongs in my opinion...even as another guy!",
            "author": "Dragonfly04769",
            "id": "gyg6beh",
            "parent_id": "t1_gthk8fs",
            "score": 1,
            "created_utc": 1621261972.0,
            "replies": []
        },
        {
            "body": "So true!",
            "author": "altruistic_SB",
            "id": "gthw28i",
            "parent_id": "t1_gthu77l",
            "score": 10,
            "created_utc": 1617656513.0,
            "replies": []
        },
        {
            "body": ">Really important to go back and make a list of all the danger signs that you saw but which did not then fit into a recognizable pattern.\n\nWas a pattern needed after 'he kicked me out in the middle of the night?'  I'm really not sure why she scheduled more dates with him after that :(",
            "author": null,
            "id": "gtijzb8",
            "parent_id": "t1_gthh2n1",
            "score": 5,
            "created_utc": 1617668441.0,
            "replies": []
        },
        {
            "body": "54 😅",
            "author": "altruistic_SB",
            "id": "gthhc6d",
            "parent_id": "t1_gth3nj9",
            "score": 6,
            "created_utc": 1617649790.0,
            "replies": [
                {
                    "body": ">54 😅\n\nSome people just grow old, they never grow up. Good riddance.",
                    "author": "ExExpectations",
                    "id": "gthyjr8",
                    "parent_id": "t1_gthhc6d",
                    "score": 6,
                    "created_utc": 1617657685.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Probably never",
            "author": null,
            "id": "gthqc3n",
            "parent_id": "t1_gth57qw",
            "score": 4,
            "created_utc": 1617653892.0,
            "replies": []
        },
        {
            "body": "Absolutely not! Do you really post judgy comments without reading the entire post? If you actually read my post you would see that I broke things off with him 😊",
            "author": "altruistic_SB",
            "id": "gti30w1",
            "parent_id": "t1_gti2ark",
            "score": 1,
            "created_utc": 1617659830.0,
            "replies": [
                {
                    "body": "Girl chill. I only asked if you allow yourself to be treated like this because he sounds like an exhausting clingy manchuld. Good for you!🙌🏽",
                    "author": "Sweetgirlgi5",
                    "id": "gti36sv",
                    "parent_id": "t1_gti30w1",
                    "score": -3,
                    "created_utc": 1617659912.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I’m not sure about this - if a SD can’t cope with a SB not replying for a couple of hours for a valid reason, that’s an issue. Bare in mind read receipts exist so if she’s not read the messages, she’s clearly busy or asleep, not ignoring him, and he’s massively overreacted. \n\nOP makes it sound like this was out of the blue, in which case, he was being way too needy and she shouldn’t have to adjust to him. If it wasn’t out of the blue and he’s been demanding before, she needed to have set some boundaries. I make it clear to SDs that I work set hours Mon-Fri and so might not reply straight away, and haven’t had any problems with neediness yet. \n\nSRs are a two way street, a SB shouldn’t need to adjust her entire sleep schedule to be able to text back on demand. Both parties should be able to find a communication middle-ground, and if they can’t, they should find a different SR.",
            "author": "Gee_n_tonic",
            "id": "gthgg0d",
            "parent_id": "t1_gthd126",
            "score": 14,
            "created_utc": 1617649375.0,
            "replies": []
        },
        {
            "body": "It is INSANE to expect an SB to text you back early in the morning on a Saturday.",
            "author": "clemkaddidlehopper",
            "id": "gthfxga",
            "parent_id": "t1_gthd126",
            "score": 14,
            "created_utc": 1617649136.0,
            "replies": [
                {
                    "body": "Absolutely. That goes for anyone.",
                    "author": "OldschoolSD",
                    "id": "gthx7y2",
                    "parent_id": "t1_gthfxga",
                    "score": 3,
                    "created_utc": 1617657058.0,
                    "replies": []
                },
                {
                    "body": "Agreed, I might send mine a good morning text (never super early, I'm talking 9-10am), but I also know if she doesn't reply she's likely asleep or busy and will later in the day.",
                    "author": "mraspencer",
                    "id": "gti1332",
                    "parent_id": "t1_gthfxga",
                    "score": 2,
                    "created_utc": 1617658893.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I think you are misunderstanding my point. He has never expected me to text him back immediately, it was very much out of the blue! He was insecure and overbearing and that came out. Quite frankly, if a SD is so needy that he can’t wait for me to reply within a timely manner the HE needs to not sugar and get a damn puppy or something.",
            "author": "altruistic_SB",
            "id": "gthhaas",
            "parent_id": "t1_gthd126",
            "score": 6,
            "created_utc": 1617649765.0,
            "replies": []
        },
        {
            "body": "You know, if these guys have teenage kids they should understand the idea of heading out at 11, staying out till 3 and waking up about noon. Yeah I'm up around 6:30 pretty much every morning, but I sort of get that my SB might not.",
            "author": "ChapterRelative",
            "id": "gtii4ry",
            "parent_id": "t1_gthd126",
            "score": 2,
            "created_utc": 1617667506.0,
            "replies": []
        },
        {
            "body": "Me too!",
            "author": "altruistic_SB",
            "id": "gtinbzs",
            "parent_id": "t1_gtimo05",
            "score": 1,
            "created_utc": 1617670139.0,
            "replies": []
        },
        {
            "body": "Yessssss Sawbones reference in the wild!",
            "author": "xoxo_ruby_darling",
            "id": "gtkmhl4",
            "parent_id": "t1_gtigvfd",
            "score": 1,
            "created_utc": 1617719085.0,
            "replies": [
                {
                    "body": "I freaking love that podcast. My curiosities for all manner of medical conditions and the human condition are so well indulged by the show. Glad it was a reference that didn't go unappreciated!",
                    "author": "TrumpsCovidfefe",
                    "id": "gtkwtf7",
                    "parent_id": "t1_gtkmhl4",
                    "score": 2,
                    "created_utc": 1617723711.0,
                    "replies": []
                }
            ]
        },
        {
            "body": ">54 😅\n\nSome people just grow old, they never grow up. Good riddance.",
            "author": "ExExpectations",
            "id": "gthyjr8",
            "parent_id": "t1_gthhc6d",
            "score": 6,
            "created_utc": 1617657685.0,
            "replies": []
        },
        {
            "body": "Girl chill. I only asked if you allow yourself to be treated like this because he sounds like an exhausting clingy manchuld. Good for you!🙌🏽",
            "author": "Sweetgirlgi5",
            "id": "gti36sv",
            "parent_id": "t1_gti30w1",
            "score": -3,
            "created_utc": 1617659912.0,
            "replies": []
        },
        {
            "body": "Absolutely. That goes for anyone.",
            "author": "OldschoolSD",
            "id": "gthx7y2",
            "parent_id": "t1_gthfxga",
            "score": 3,
            "created_utc": 1617657058.0,
            "replies": []
        },
        {
            "body": "Agreed, I might send mine a good morning text (never super early, I'm talking 9-10am), but I also know if she doesn't reply she's likely asleep or busy and will later in the day.",
            "author": "mraspencer",
            "id": "gti1332",
            "parent_id": "t1_gthfxga",
            "score": 2,
            "created_utc": 1617658893.0,
            "replies": []
        },
        {
            "body": "I freaking love that podcast. My curiosities for all manner of medical conditions and the human condition are so well indulged by the show. Glad it was a reference that didn't go unappreciated!",
            "author": "TrumpsCovidfefe",
            "id": "gtkwtf7",
            "parent_id": "t1_gtkmhl4",
            "score": 2,
            "created_utc": 1617723711.0,
            "replies": []
        }
    ]
}