{
    "title": "it's dangerous out there",
    "post_id": "jbv34y",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/jbv34y/its_dangerous_out_there/",
    "author": "xefoda",
    "body": "I have been a long time lurker here and finally decided to make a separate account to post something scary that happened to me. A bit of background, I am a 32 year oldSD that has had a light form of autism and been using SRs as a way to boost my confidence but also gain social interaction skills.\n\nWell I found an SB that is 1 year younger than me who I have met up with and everything seemed to go fine. She was quick to pick up that I am socially challenged and began a slow drip of poison that I didn't pick up on immediately. It was pretty light initially, starting with talking about the difficulties people with autism have when it comes to relationships. It built from there saying how people with autism cannot have friends with neurotypical individuals. To what she said today that autistic individual's best hope was seeking euthanasia. Which at this point I cut my contact with her, including deleting the Google account where my Google Voice number was attached to and starting from new. I began to feel like she wanted to Michelle Carter me. \n\nBefore anyone freaks out, I am not suicidal. Just sharing a recent experience.",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/jbv34y/its_dangerous_out_there/",
    "score": 159,
    "upvote_ratio": 0.93,
    "created_utc": 1602792080.0,
    "num_comments": 45,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "Sir, you managed to become wealthy enough for sugar dating, and alert enough to bail on a toxic relationship pretty early on.  You did this in spite of your disadvantages: autism, and any others you might have that you didnt mention. That's fantastic. Many of us \"normies\" struggle in our careers, love life, and otherwise, despite the fact that we have different advantages and disadvantages.  \n#\nPeople, both in and out of sugar dating will always try to manipulate you. Sometimes its micro level (e.g. getting you to buy something you dont need), and sometimes it will be life threatening.  In or out of sugar dating, dont let the bad guys win man, and take good care of your fellow-traveller good people (sbs and otherwise).",
            "author": "TastySpermDispenser",
            "id": "g8y0oez",
            "parent_id": "t3_jbv34y",
            "score": 185,
            "created_utc": 1602800661.0,
            "replies": [
                {
                    "body": "Yes! So many neurotypical people struggle with cutting off people who hurt them",
                    "author": "violetwraith",
                    "id": "g8yd45b",
                    "parent_id": "t1_g8y0oez",
                    "score": 18,
                    "created_utc": 1602807728.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "That's horrible of her! I'm so sorry you had to hear all that hateful bullshit",
            "author": "violetwraith",
            "id": "g8y07ay",
            "parent_id": "t3_jbv34y",
            "score": 30,
            "created_utc": 1602800400.0,
            "replies": []
        },
        {
            "body": "What a creep. I’m so sorry, that’s incredibly cruel and it sounds like you were very right in cutting off contact.",
            "author": null,
            "id": "g8y188d",
            "parent_id": "t3_jbv34y",
            "score": 25,
            "created_utc": 1602800966.0,
            "replies": []
        },
        {
            "body": "She is disgusting and vile. Be happy you dodged a bullet",
            "author": "01210798",
            "id": "g8y1y9j",
            "parent_id": "t3_jbv34y",
            "score": 19,
            "created_utc": 1602801370.0,
            "replies": []
        },
        {
            "body": "That's really horrible. People with autism are very much valid and I find bring new perspectives to things. One of my close friends can be very blunt sometimes but that's just a quirk of their autism, and tbh its nice to be so straightforward.\n\nAt least you've cut all contacts. Hopefully you'll find someone else who is far better.",
            "author": "b-unrelenting",
            "id": "g8y4143",
            "parent_id": "t3_jbv34y",
            "score": 12,
            "created_utc": 1602802512.0,
            "replies": []
        },
        {
            "body": "Smart enough to pick up on her bs.  🙌",
            "author": "iHeartTylerDurden",
            "id": "g8y1wfy",
            "parent_id": "t3_jbv34y",
            "score": 10,
            "created_utc": 1602801342.0,
            "replies": []
        },
        {
            "body": "Been there myself though bit was a slower burn for me. I have a form of autism too and it seems like there's a target on our backs. Sorry you gone through this, no matter it feels awful. Stay vigilant.",
            "author": "lemondropsman",
            "id": "g8y45op",
            "parent_id": "t3_jbv34y",
            "score": 7,
            "created_utc": 1602802583.0,
            "replies": [
                {
                    "body": "Wow sorry to hear this from both of you. And glad that you recognized it for the garbage it was.. . So shitty.",
                    "author": "Juliet-almost",
                    "id": "g8yfktp",
                    "parent_id": "t1_g8y45op",
                    "score": 1,
                    "created_utc": 1602809100.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "As a person with ASD as well, I can't believe she suggested euthanasia like wtaf",
            "author": "another_asian_person",
            "id": "g8zv2hd",
            "parent_id": "t3_jbv34y",
            "score": 3,
            "created_utc": 1602851363.0,
            "replies": []
        },
        {
            "body": "I don't understand why anyone would think someone with autism, no matter how high the degree, is any less of a person than anyone else.  That a horrible person she is!!",
            "author": "Femalenin",
            "id": "g913ppl",
            "parent_id": "t3_jbv34y",
            "score": 3,
            "created_utc": 1602875116.0,
            "replies": []
        },
        {
            "body": "My previous SD, who is an awesome person (we’re still friends) has AS. I’m sorry this happened to you!",
            "author": "LikeHoney99",
            "id": "g8y7tfn",
            "parent_id": "t3_jbv34y",
            "score": 4,
            "created_utc": 1602804699.0,
            "replies": []
        },
        {
            "body": "My brother has autism and he is very special to me so it breaks my heart to hear that you were treated that way. I’m glad you got out of it and I hope you have better successes in the future!",
            "author": "Juno-bird",
            "id": "g8y3a1y",
            "parent_id": "t3_jbv34y",
            "score": 4,
            "created_utc": 1602802098.0,
            "replies": []
        },
        {
            "body": "You dodged a bullet and you dodged it well! Well done on cutting the cord so early on! What a complete vile human she is! Sorry you had to go through that.",
            "author": "Ghanaiantoffee",
            "id": "g8y7dih",
            "parent_id": "t3_jbv34y",
            "score": 4,
            "created_utc": 1602804445.0,
            "replies": []
        },
        {
            "body": "I am sorry for your experience, there are some cold ass people in this world. If you need to vent or need some help navigating the waters feel free to reach out ❤️",
            "author": null,
            "id": "g8zutw3",
            "parent_id": "t3_jbv34y",
            "score": 2,
            "created_utc": 1602851193.0,
            "replies": []
        },
        {
            "body": "Damn. She trash",
            "author": null,
            "id": "g8yd1qv",
            "parent_id": "t3_jbv34y",
            "score": 4,
            "created_utc": 1602807689.0,
            "replies": []
        },
        {
            "body": "What an uneducated, heartless person. I’m sorry she said those things to you.. people with autism should be treated like any other person. You are no different than we are. Keep trying, we’re not all as awful as that.",
            "author": "noodle--head",
            "id": "g8y7wrt",
            "parent_id": "t3_jbv34y",
            "score": 2,
            "created_utc": 1602804751.0,
            "replies": []
        },
        {
            "body": "She sounds like a sadist. Not the fun kind either. I’m so sorry you went through this but don’t let it discourage you from dating empathetic women who can him help you with social skills.",
            "author": "JuniorScallion5",
            "id": "g8z0fs9",
            "parent_id": "t3_jbv34y",
            "score": 2,
            "created_utc": 1602821990.0,
            "replies": []
        },
        {
            "body": "Who is michelle Carter?",
            "author": "Paul_Drake",
            "id": "g8y76ac",
            "parent_id": "t3_jbv34y",
            "score": 1,
            "created_utc": 1602804329.0,
            "replies": [
                {
                    "body": "A girl who talked her boyfriend into suicide recently. There was a documentary on Netflix, not sure if it’s still on there",
                    "author": null,
                    "id": "g8y8n3n",
                    "parent_id": "t1_g8y76ac",
                    "score": 2,
                    "created_utc": 1602805173.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "okay this makes me sick. my sister has autism as well and i agree with earlier comments, you have been able to reach such a status where you can be a sugar daddy and it’s hard for anyone to reach that type of status ! so, i applaud you and you keep going and f*ck her :/",
            "author": "aqu4baby",
            "id": "g8y8pcf",
            "parent_id": "t3_jbv34y",
            "score": 1,
            "created_utc": 1602805210.0,
            "replies": []
        },
        {
            "body": "I’m so sorry you had an experience like that. Some people can be ridiculously cruel, that’s to no fault of yours. Just so you know I’m an SB and my last vanilla relationship was with a guy who was diagnosed autistic and was supposedly pretty far on the spectrum. He was one of the most significant relationships I’ve had. Please don’t think being on the spectrum impacts what women think of you. It doesn’t.",
            "author": "redheadeddemi",
            "id": "g8yfenq",
            "parent_id": "t3_jbv34y",
            "score": 1,
            "created_utc": 1602809011.0,
            "replies": []
        },
        {
            "body": "My blood boiled reading this. I've been surrounded by autistic people growing up and have no chill for people saying ignorant, toxic, ableist, awful things like this. I'm so, so glad you made a super strong boundary around gtfo-ing from this situation as soon as you picked up on it.",
            "author": "EvaExquisite",
            "id": "g8ygxjd",
            "parent_id": "t3_jbv34y",
            "score": 1,
            "created_utc": 1602809849.0,
            "replies": []
        },
        {
            "body": "That's horrible what she said! I'm so sorry you went through that. I've known so many people on that spectrum so I just can't fathom that someone could say that! So glad you got out of that relationship.",
            "author": "ThickThighsTaylor",
            "id": "g8yhkj0",
            "parent_id": "t3_jbv34y",
            "score": 1,
            "created_utc": 1602810213.0,
            "replies": []
        },
        {
            "body": "I’m so glad you got away from her and that you are safe!",
            "author": null,
            "id": "g8yqt58",
            "parent_id": "t3_jbv34y",
            "score": 1,
            "created_utc": 1602815688.0,
            "replies": []
        },
        {
            "body": "This is sick and twisted as hell, what a creep",
            "author": "chuckmeow",
            "id": "g8yquw5",
            "parent_id": "t3_jbv34y",
            "score": 1,
            "created_utc": 1602815717.0,
            "replies": []
        },
        {
            "body": "As someone else posted, many people are autistic and don’t even know it.\nIt’s nothing to be ashamed about and it’s damn sure nothing to be ridiculed for; it’s just a condition.\nUnfortunately, more people in the world are assholes - and it seems you’ve encountered a major one. \nCount your blessings that it was a brief SR and not an long term toxic encounter.\nYou’ll find the one for you... it’s just a numbers game.\nBest of luck ♥️",
            "author": "AlinaAllure",
            "id": "g8yxz5r",
            "parent_id": "t3_jbv34y",
            "score": 1,
            "created_utc": 1602820252.0,
            "replies": [
                {
                    "body": "If it's a mild form I wouldn't even call it a \"condition\". More like a \"trait\". It can be beneficial for certain types of careers.",
                    "author": "notaskank",
                    "id": "g8zeewr",
                    "parent_id": "t1_g8yxz5r",
                    "score": 2,
                    "created_utc": 1602834706.0,
                    "replies": [
                        {
                            "body": "True.\nI have a friend with Asbergers (sp?) and I would’ve never known unless he told me... I just thought he was shy.",
                            "author": "AlinaAllure",
                            "id": "g90mz1a",
                            "parent_id": "t1_g8zeewr",
                            "score": 1,
                            "created_utc": 1602866696.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I’m so sorry! It’s is truly scary times we are in. Ppl are so fucked up lately. I have horror stories as well regarding verbally abusive dating and seeking people. You’re not alone. You either have to get a rly thick skin or bow out gracefully. Which is what I ended up doing, going back to a spoiling ex who I realized wasn’t so bad after all. Stay strong!",
            "author": null,
            "id": "g8yydev",
            "parent_id": "t3_jbv34y",
            "score": 1,
            "created_utc": 1602820517.0,
            "replies": []
        },
        {
            "body": "So sorry to hear that happened to you! Technically we all have autistic traits even if it’s not that severe. I hope you find someone who isn’t a monster.",
            "author": "Iwannabelikeu",
            "id": "g8y8urg",
            "parent_id": "t3_jbv34y",
            "score": 0,
            "created_utc": 1602805298.0,
            "replies": []
        },
        {
            "body": "this is was very wrong of her to say. i am an sb with mental health issues of my own and i would feel terrible if anyone told me to euthanize myself. you handled the situation in the correct way.",
            "author": "kieannaeliza94",
            "id": "g8ybbyx",
            "parent_id": "t3_jbv34y",
            "score": 0,
            "created_utc": 1602806724.0,
            "replies": []
        },
        {
            "body": "I'm so sorry you went through that gross mess. I'm betting there is a better SB around the corner. This is something I worry about tbh as a potential SB who is neurodivergent :( it have negatively impacted my dating life and I reckon it'll carry over",
            "author": "Mulletpower_",
            "id": "g8ykect",
            "parent_id": "t3_jbv34y",
            "score": 0,
            "created_utc": 1602811852.0,
            "replies": []
        },
        {
            "body": "This saddens me! I'm so sorry you had to go through that!",
            "author": "kitkats82",
            "id": "g8yl0lp",
            "parent_id": "t3_jbv34y",
            "score": 0,
            "created_utc": 1602812222.0,
            "replies": []
        },
        {
            "body": "I’m so sorry you experienced this. That’s horrible!",
            "author": null,
            "id": "g8yp87y",
            "parent_id": "t3_jbv34y",
            "score": 0,
            "created_utc": 1602814733.0,
            "replies": []
        },
        {
            "body": "Ugh, this woman sounds toxic. I’m on the SB side of things, and I usually have way more empathy for SBs than SDs. But this woman seems totally devoid of empathy, and deeply manipulative. Like...I can’t even begin to comprehend her level of cruelty.\n\nI’m far from neurotypical (no autism, but ocd and a few other things). Ableist comments, stigma, and stereotypes are all immediate red flags, in any and all relationships. None of that is acceptable.\n\nI hope that you quickly move on from that toxic person, and I hope that she develops basic empathy.",
            "author": "ToxicGrad",
            "id": "g8ypaqo",
            "parent_id": "t3_jbv34y",
            "score": 0,
            "created_utc": 1602814776.0,
            "replies": []
        },
        {
            "body": "Why would anyone say anything like that to anyone?? What is wrong with people? I’m glad you cut off any and all communication and I’m glad you see the value in your own life to not be influenced by her. Please stay safe",
            "author": "Pettyasarose",
            "id": "g8z4zvp",
            "parent_id": "t3_jbv34y",
            "score": 0,
            "created_utc": 1602825589.0,
            "replies": []
        },
        {
            "body": "My brother has Autism but can't speak at all, in a small way I'm almost grateful because people can't hurt him with their words like this. Honestly I would want to beat a b*tch. I'm sorry that happened to you, she's trash. Glad you're rid of her!",
            "author": "baddassbecca",
            "id": "g902ne4",
            "parent_id": "t3_jbv34y",
            "score": 1,
            "created_utc": 1602856177.0,
            "replies": []
        },
        {
            "body": "Toxic people generally show their true colors sooner rather than later. Kudos to you for recognizing it and cutting her the fuck out. Be safe and be well.",
            "author": "Cledaddy23",
            "id": "g9038it",
            "parent_id": "t3_jbv34y",
            "score": 1,
            "created_utc": 1602856516.0,
            "replies": []
        },
        {
            "body": "It’s her with a mental nutjob issue.\n\nI’m glad you wriggle your way out from a toxic vixen. You sound like a great and intelligent guy and you surely deserve better. Best wishes in everything and anything you do :)",
            "author": "xchromeheartsx",
            "id": "g9059mj",
            "parent_id": "t3_jbv34y",
            "score": 1,
            "created_utc": 1602857661.0,
            "replies": [
                {
                    "body": ">autistic and normal people\n\nI know you didn't have any ill intention, but the term \"neurotypical\" is better to use than the word \"normal\". In fact, I learned the term from reading this post!",
                    "author": "InnocentSweetTooth",
                    "id": "g98peh8",
                    "parent_id": "t1_g9059mj",
                    "score": 2,
                    "created_utc": 1603043411.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Wtf? I’m so sorry this happened to you. People like her don’t deserve a relationship of any kind. Don’t let this discourage you from dating, sugar or vanilla. Not all women are evil like the one you unfortunately stumbled upon. If you’d like a female friend for encouragement, dm me. I’ll be honest with you and don’t need sugar to do so. We should be lifting each other up not putting each other down. Seriously, my offer stands. Always room for a new friend.",
            "author": "OnceInALifetimeSB",
            "id": "g9061d1",
            "parent_id": "t3_jbv34y",
            "score": 1,
            "created_utc": 1602858084.0,
            "replies": []
        },
        {
            "body": "And people try to act like ableism isn’t a thing. Good job and thank you for sharing 💜",
            "author": null,
            "id": "g906nqx",
            "parent_id": "t3_jbv34y",
            "score": 1,
            "created_utc": 1602858429.0,
            "replies": []
        },
        {
            "body": "Wow!  At best, she herself is socially awkward  and just doesn't  know when to keep her opinions to herself.\n\nSomewhere in the middle, she's a narcissist and was starting to gaslight you.\n\nAt worse, like you thought, she was going to poison your thoughts and emotions until you self destructed (suicide or not).\n\nGood think you dumped her.  Although I have to admit, I'm curious as to what her response is to getting ghosted the way you did.  But if she's a narcissist or Michelle Carter, its best to not find out.  You can't let either of those type back into your life.",
            "author": "SDlovesu2",
            "id": "g91h27g",
            "parent_id": "t3_jbv34y",
            "score": 1,
            "created_utc": 1602881578.0,
            "replies": []
        },
        {
            "body": "Wow!  At best, she herself is socially awkward  and just doesn't  know when to keep her opinions to herself.\n\nSomewhere in the middle, she's a narcissist and was starting to gaslight you.\n\nAt worse, like you thought, she was going to poison your thoughts and emotions until you self destructed (suicide or not).\n\nGood think you dumped her.  Although I have to admit, I'm curious as to what her response is to getting ghosted the way you did.  But if she's a narcissist or Michelle Carter, its best to not find out.  You can't let either of those type back into your life.",
            "author": "SDlovesu2",
            "id": "g91h3bp",
            "parent_id": "t3_jbv34y",
            "score": 1,
            "created_utc": 1602881588.0,
            "replies": []
        },
        {
            "body": "Wow!  At best, she herself is socially awkward  and just doesn't  know when to keep her opinions to herself.\n\nSomewhere in the middle, she's a narcissist and was starting to gaslight you.\n\nAt worse, like you thought, she was going to poison your thoughts and emotions until you self destructed (suicide or not).\n\nGood think you dumped her.  Although I have to admit, I'm curious as to what her response is to getting ghosted the way you did.  But if she's a narcissist or Michelle Carter, its best to not find out.  You can't let either of those type back into your life.",
            "author": "SDlovesu2",
            "id": "g91h7ao",
            "parent_id": "t3_jbv34y",
            "score": 1,
            "created_utc": 1602881623.0,
            "replies": []
        },
        {
            "body": "Wow!  At best, she herself is socially awkward  and just doesn't  know when to keep her opinions to herself.\n\nSomewhere in the middle, she's a narcissist and was starting to gaslight you.\n\nAt worse, like you thought, she was going to poison your thoughts and emotions until you self destructed (suicide or not).\n\nGood think you dumped her.  Although I have to admit, I'm curious as to what her response is to getting ghosted the way you did.  But if she's a narcissist or Michelle Carter, its best to not find out.  You can't let either of those type back into your life.",
            "author": "SDlovesu2",
            "id": "g91hehz",
            "parent_id": "t3_jbv34y",
            "score": 1,
            "created_utc": 1602881687.0,
            "replies": []
        },
        {
            "body": "People really shock me sometimes. Glad to hear that you were able to recognize her bs early on and distance yourself.",
            "author": "InnocentSweetTooth",
            "id": "g98ptvj",
            "parent_id": "t3_jbv34y",
            "score": 1,
            "created_utc": 1603043616.0,
            "replies": []
        },
        {
            "body": "Yes! So many neurotypical people struggle with cutting off people who hurt them",
            "author": "violetwraith",
            "id": "g8yd45b",
            "parent_id": "t1_g8y0oez",
            "score": 18,
            "created_utc": 1602807728.0,
            "replies": []
        },
        {
            "body": "Wow sorry to hear this from both of you. And glad that you recognized it for the garbage it was.. . So shitty.",
            "author": "Juliet-almost",
            "id": "g8yfktp",
            "parent_id": "t1_g8y45op",
            "score": 1,
            "created_utc": 1602809100.0,
            "replies": []
        },
        {
            "body": "A girl who talked her boyfriend into suicide recently. There was a documentary on Netflix, not sure if it’s still on there",
            "author": null,
            "id": "g8y8n3n",
            "parent_id": "t1_g8y76ac",
            "score": 2,
            "created_utc": 1602805173.0,
            "replies": []
        },
        {
            "body": "If it's a mild form I wouldn't even call it a \"condition\". More like a \"trait\". It can be beneficial for certain types of careers.",
            "author": "notaskank",
            "id": "g8zeewr",
            "parent_id": "t1_g8yxz5r",
            "score": 2,
            "created_utc": 1602834706.0,
            "replies": [
                {
                    "body": "True.\nI have a friend with Asbergers (sp?) and I would’ve never known unless he told me... I just thought he was shy.",
                    "author": "AlinaAllure",
                    "id": "g90mz1a",
                    "parent_id": "t1_g8zeewr",
                    "score": 1,
                    "created_utc": 1602866696.0,
                    "replies": []
                }
            ]
        },
        {
            "body": ">autistic and normal people\n\nI know you didn't have any ill intention, but the term \"neurotypical\" is better to use than the word \"normal\". In fact, I learned the term from reading this post!",
            "author": "InnocentSweetTooth",
            "id": "g98peh8",
            "parent_id": "t1_g9059mj",
            "score": 2,
            "created_utc": 1603043411.0,
            "replies": []
        },
        {
            "body": "True.\nI have a friend with Asbergers (sp?) and I would’ve never known unless he told me... I just thought he was shy.",
            "author": "AlinaAllure",
            "id": "g90mz1a",
            "parent_id": "t1_g8zeewr",
            "score": 1,
            "created_utc": 1602866696.0,
            "replies": []
        }
    ]
}