{
    "title": "Convince me to quit. Seriously.",
    "post_id": "eymq0s",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/eymq0s/convince_me_to_quit_seriously/",
    "author": "esbeethrowway",
    "body": "I did what you're not supposed to do and I started sugaring because I had less than a week to not get evicted for lack of rent.\n\nI vetted profiles and I did M&Gs that went nowhere and I shoplifted panties from Walmart for the first few dates because all mine had holes. I do my absolute best to keep my sugar and vanilla lives separate, including funds, and by now  (a few months in) I have nearly $3k saved up from a variety of SDs, one-time meetings, M&G gifts, and two fairly short-term but steady arrangements. I got a second minimum wage job so if I lost my first one for taking too many evening shifts off I could still maybe have utilities.\n\nI hate sugaring. I hate going out on dates with men who could be my father if he weren't dead and who expect me to call them Daddy while they finger me too damn hard. I hate smiling and laughing and playing along with jokes that aren't funny. I hate these men.\n\nBut this is more money than I've had in my entire life. I can tell my roommate \"let's go out for dinner\" without meaning \"I'm too burnt out to cook so let's hope my card doesn't overdraft on a Cup'o'Noodles.\" I can afford clothes that fit, even if they are from Walmart or Target. I can buy makeup without walking across town to get to the Dollar General. Heck, I can drive across town without counting every mile and wondering if I would be able to get enough gas to drive two states away if my mother had an emergency. I bought fruit the first week. I spent $20 on nothing but fruit and it was LOVELY.\n\nSo how the hell do I convince myself I'd be better off without it? It should be a no-brainer - shared rent and ramen probably adds up to less than years of therapy does... but if I stay in this lifestyle I could be able afford all the therapy I need. I could travel - really travel. I'm GOOD at this! I spent long enough in Goodwill clothes to know how to make them look, maybe not designer, but good enough! I spent long enough in high school theater classes to know how to push my feelings down and put completely new ones there! I could pay off my mother's mortgage someday if I try hard enough and get over it.\n\nSo how do I do it? How do I believe I'm worth more than this?\n\n\nEDIT: Thanks y'all. I think I just needed a firm kick into reality. I appreciate all the support and advice so much. I'm sorry I can't respond to everyone specifically",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/eymq0s/convince_me_to_quit_seriously/",
    "score": 109,
    "upvote_ratio": 0.91,
    "created_utc": 1580802810.0,
    "num_comments": 68,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "It is really good that you recognize that this is unhealthy for you long term and are seeking out help (here). If you can try to find another SB or SD as a penpal to chat with and that will help you deal with everything.\n\nFirst suggestion - Find a happy medium between not sugaring at all and doing it the way you are now. Find a 35-40yo married guy who you are at least a little attracted to. Then go on a few dates first to build up some chemistry. There is a good chance that, that type of guy is going to offer a lower allowance but it's a relationship that you won't feel bad about. Doing that plus a normal job might be enough money to live comfortably but not extravagantly.\n\nSecond suggestion - Try being a stripper. If you are as good as you say you might be able to do well at that and limit your physical intimacy to a level you are more comfortable with.\n\nThird suggestion is more of a criticism. I have got to be a little hard on you here girl. If you are having a bad time because some guy is fingering you too hard, some of that might be on you. Speak up, say what you want, a lot of SDs truly WANT you to have a good time or to make it as pleasurable as possible.",
            "author": "Paul_Drake",
            "id": "fgi4g09",
            "parent_id": "t3_eymq0s",
            "score": 82,
            "created_utc": 1580805055.0,
            "replies": [
                {
                    "body": "This is sound advice. \n\nShe has options.  She can continue doing what she is doing to survive while looking for a healthier long term Sugar relationship with someone enjoys spending time with and / or look at options like stripping that can be very rewarding for attractive women who know how to play to older men as long as you dont get too caught up in the lifestyle, party to much and start escorting on the side.  \n\nWe all have to do things for a period of time we dont enjoy, but we should have an end in mind to get us where we want to be.  Doing something long term that you truly despise will eat at your soul.",
                    "author": "willfromvb",
                    "id": "fgiveek",
                    "parent_id": "t1_fgi4g09",
                    "score": 17,
                    "created_utc": 1580831747.0,
                    "replies": []
                },
                {
                    "body": "Your first suggestion is basically my current situation. I have a good job but have too many bills, too many dependents. So I recently was lucky enough to find a SD who isn’t much older than me, is attractive, has manners, and I don’t hate fucking him at all. It’s not awkward in public because we look like a regular couple. Sure, he doesn’t pay me as much as an old fat guy would have to but at least it’s not taking the mental toll on me that that would. \n\nFocus on the future. Focus on supporting yourself through sugaring while finding a real career path. If you have money right now that’s great, but make sure it isn’t taking too large of a mental toll and make sure you’re getting some mentoring in as well. Sounds like you’ve had it rough and deserve a stable and happy future. Take what you deserve in this life girl.",
                    "author": "MetalandIron2pt0",
                    "id": "fgjagas",
                    "parent_id": "t1_fgi4g09",
                    "score": 9,
                    "created_utc": 1580840157.0,
                    "replies": [
                        {
                            "body": "I wanted to strongly echo this comment.  OP, never forget that the SB should be the one in charge. She picks the men she wants.  To do that, though, she needs to be able to stand on her own two feet.  I've always seen sugaring as a fun way to get some luxuries I couldn't otherwise afford.  If you need men's money, they have you trapped.  You sound like you're feeling terribly trapped and that's a horrible place to be.  Why not use some of the money you're earning from sugaring (or stripping if you switch to that) to get yourself trained for a career you like?  There's a  whole world out there.  If you're not sure what else you're good at, take one course in anything at the local community college.  That will give you access to their Career Counseling service.  They can give you some aptitude tests to figure out what good fields would be for you.  You may not make as much as a plumber or a computer specialist or any one of dozens of high-paying fields than as a SB, but you'll be a hell of a lot happier.  Once you're making enough money to be self-sufficient, then you can freely deicide if you want to do some sugaring to get the luxury goods like jewelry and trips and you can pick the men you want to provide things like that.",
                            "author": "Candi_in_a_Bikini",
                            "id": "fgjg9c8",
                            "parent_id": "t1_fgjagas",
                            "score": 7,
                            "created_utc": 1580843412.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "I second being a stripper",
                    "author": "KameronKae",
                    "id": "fgibizl",
                    "parent_id": "t1_fgi4g09",
                    "score": 19,
                    "created_utc": 1580815503.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Distinguish between what you need to do to survive (rent, food), and what you might decide to do because of other benefits it might bring you (disposable income).\n\nDon't beat yourself up about what you do because of the former, if you're having to do this in order to afford food/rent it's not sugaring - it's surviving. Choices that you make when you're desperate aren't choices you have to stick to when you have more freedom & control.\n\nI'd never advocate sugaring (or any sex work) to anyone who dosn't enjoy it or isn't comfortable with it. You need to take some time to get some distance between what you had to do, and what you might in the future freely choose to do.\n\nIf you can afford to, take a few weeks or a month off from any sort of sex work (say, half of whatever length of time you can afford, so you've still got a cushion). Look after yourself, spend time with friends, have vanilla sex with guys you actually like. Don't throw the money away on luxuries (because knowing you have savings you can fall back on is important) but be comfortable and enjoy the time.\n\nThen, while you're off, take some time to consider whether you want to start sugaring - that you like the money is a no brainer! Are you going to enjoy it & be happy with yourself doing it? Not spending all the money you've got saved up is important - if you know you've got the money for 2 months food, rent, and bills then you aren't going to be under the pressure you were before. If you decide to come back to the bowl then do so when you've got the time to find guys who pay better and who you're comfortable with. If you do start sugaring then make sure you save as well as spend - once you've paid for any essentials (as a starting point) spend half the rest on making your life better (in whatever ways) and save the other half.\n\nSavings are important - they give you the freedom to change your mind.",
            "author": "xxx_vixy_xxx",
            "id": "fgi831s",
            "parent_id": "t3_eymq0s",
            "score": 44,
            "created_utc": 1580810536.0,
            "replies": [
                {
                    "body": "🙏",
                    "author": null,
                    "id": "fgi92rq",
                    "parent_id": "t1_fgi831s",
                    "score": 3,
                    "created_utc": 1580812047.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "An honest post from the rare SB who isn't trying to market herself to a reddit SD.\n\nThis is what sugar is like now for the majority.  It's straight up sex work, and given the numbers in the reddit allowance thread, I'd say more like survival sex work.  Most girls aren't getting $10,000 a month with no hard strings attached.  Most girls are doing extremely labour intensive and risky work for 3 figures an engagement.\n\nHang in there OP.  Engage in lots of self care.  This is a valid job, and treat it as such.  Maintain boundary's, make sure you're being adequately compensated for the service you're providing.  Constantly test the market and see if you can increase your rates.",
            "author": "sugarsenior",
            "id": "fgj8exe",
            "parent_id": "t3_eymq0s",
            "score": 22,
            "created_utc": 1580839009.0,
            "replies": [
                {
                    "body": "> An honest post from the rare SB who isn't trying to market herself to a reddit SD.\n\nI’m living. Finally someone said it",
                    "author": null,
                    "id": "fgl6ea8",
                    "parent_id": "t1_fgj8exe",
                    "score": 5,
                    "created_utc": 1580883577.0,
                    "replies": []
                },
                {
                    "body": "[removed]",
                    "author": null,
                    "id": "fgk1mbk",
                    "parent_id": "t1_fgj8exe",
                    "score": 12,
                    "created_utc": 1580855627.0,
                    "replies": [
                        {
                            "body": "The truth!",
                            "author": "sugarsenior",
                            "id": "fgl08wc",
                            "parent_id": "t1_fgk1mbk",
                            "score": 6,
                            "created_utc": 1580878105.0,
                            "replies": []
                        },
                        {
                            "body": "AMEN",
                            "author": null,
                            "id": "fgl5z5e",
                            "parent_id": "t1_fgk1mbk",
                            "score": 3,
                            "created_utc": 1580883156.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": ">Most girls aren't getting $10,000 a month with no hard strings attached.\n\nAnd those pictures on SA's website? Marketing.\n\nAnd Pretty Woman? Just a movie.",
                    "author": "Throwawayacct501sd",
                    "id": "fgjbxs0",
                    "parent_id": "t1_fgj8exe",
                    "score": 7,
                    "created_utc": 1580840850.0,
                    "replies": [
                        {
                            "body": "Oh 5 years ago that was a very reasonable mid-to high allowance, and $5k was entry level.",
                            "author": "sugarsenior",
                            "id": "fgkzonz",
                            "parent_id": "t1_fgjbxs0",
                            "score": 3,
                            "created_utc": 1580877651.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "As a Sugar Daddy, I know that I would want to know I'm not doing it right... if I'm \"fingering you too hard\", jesus, tell me! If it's anything but orgasmic bliss, help me make it better!\n\nThere are blurry lines all over the place in and around Sugaring. But, if you have yourself an honest SD, he will want to please and pleasure you. Please don't see that guy again, if you have a choice.\n\nI really hate to hear of any woman depend on a man for survival. Usually, I mean that in the context of a single boyfriend or husband or father, but in this case I guess it's a collective of Johns and Sugar Daddies. I sincerely hope you find yourself the opportunity get a real Sugar Daddy who *wants* to be good to you.\n\nBest wishes OP!",
            "author": "Funtasmcus",
            "id": "fgi9ujo",
            "parent_id": "t3_eymq0s",
            "score": 22,
            "created_utc": 1580813184.0,
            "replies": []
        },
        {
            "body": "Wow. Thanks for sharing this. It's very honest.",
            "author": "Finzi",
            "id": "fgikoyb",
            "parent_id": "t3_eymq0s",
            "score": 6,
            "created_utc": 1580824430.0,
            "replies": []
        },
        {
            "body": "First things first - Take care of yourself and your mental health. This isn’t just sleeping 8 hours a day, and taking vitamins. You need to tell yourself that you’re beautiful, worth it, you’re having fun. Do your affirmations daily, speak your goals and confidence into realty. \n\nYou can’t look at sugaring as desperation or a punishment. Look at it as an experience, a step towards you goals. Be friends with the people you meet. Don’t let your guard down, but dont be tense either. Don’t look at him like an old man you need to talk to for money. \n\nIf it really really bothers you to be out with them, try camming. If it’s the judgemental looks, and public discomfort, have you considered stripping? I know girls who do it and it has changed their life for the better. Nobody is judging you in there lol. \n\nI’ve been in the same boat as you, it’s extremely stressful. I wish you luck ❤️",
            "author": "SBdollyy",
            "id": "fgj6a51",
            "parent_id": "t3_eymq0s",
            "score": 6,
            "created_utc": 1580837780.0,
            "replies": []
        },
        {
            "body": "Damn girl, if that was my experience I’d never do it again ever. ESP if you sounds like you know you’d need therapy. I’ve only really dabbled in sugaring, but I’ve probably been on 30 dates, and I never put up with some shit like that. No that you have some money saved, play harder to get and wait around for the right guy.",
            "author": "BrOs_suck",
            "id": "fgibv4p",
            "parent_id": "t3_eymq0s",
            "score": 6,
            "created_utc": 1580815939.0,
            "replies": []
        },
        {
            "body": "My dear. Take a break. Take your time to find a SD who will take care or you whole heartedly. This is what happens if you keep changing SD or have plenty of SDs. Your heart and mentality gets worn out from all these arrangements that is transactional which you hate them.",
            "author": "JELxin",
            "id": "fgi621j",
            "parent_id": "t3_eymq0s",
            "score": 16,
            "created_utc": 1580807378.0,
            "replies": []
        },
        {
            "body": "It doesn’t sound like you’re really having a sugar relationship. If you’ve been mostly having one off dates, it sounds like you’re mostly meeting John’s instead of SD. You basically don’t like sleeping with a lot of men, just like most women don’t.  The goal with a sugar relationship is to find someone you actually like and enjoy being with and want to have sex with not someone that it’s a chore or work to be with.",
            "author": "ruphun",
            "id": "fgig08e",
            "parent_id": "t3_eymq0s",
            "score": 18,
            "created_utc": 1580820441.0,
            "replies": [
                {
                    "body": "Yes this. It’s a lot of work finding a good SD but think about how cool it would be to have the savings and fruit and cosmetics while going on dates with somebody that you like. They’re out there, but they take some time to find.",
                    "author": "2fast-2curious",
                    "id": "fgihwri",
                    "parent_id": "t1_fgig08e",
                    "score": 6,
                    "created_utc": 1580822145.0,
                    "replies": [
                        {
                            "body": "Yes it does take time to find somebody right. That’s why you should never try sugar dating out of desperation. Because you will make unwise choices put yourself into unsafe predicaments, and most likely sleep with a lot of men that are not the right guy.",
                            "author": "ruphun",
                            "id": "fgiidcp",
                            "parent_id": "t1_fgihwri",
                            "score": 1,
                            "created_utc": 1580822549.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "You should quit what YOU are doing.....that doesn’t mean quitting sugar dating.\n\nYou are doing sugar dating all wrong. \n\nYou sound like you are going on dates with anyone, and you hate them, so you are causing yourself mental anguish. \n\nTry dating with men that you are either attracted to physically, or you are attracted to their personality. When a man truly takes care of you (not gives you money simply for sex) then it’s hard not to become attracted to that man. \n\nYou may think you are good at it, but you don’t sound good at it at all. You sound like you can fake interest in sex with men you hate. And if that is the case, escorting would be more suited to you and more financially rewarding. \n\nI think you have a lack of understanding of sugar relationships. Do it right, with the right man, and it’s an incredibly enriching experience.",
            "author": null,
            "id": "fgi49jv",
            "parent_id": "t3_eymq0s",
            "score": 16,
            "created_utc": 1580804816.0,
            "replies": [
                {
                    "body": "OP was in a financial crisis and did what she had to do to get herself out of that situation. She’s clearly in distress and I don’t think telling her she’s not good at sugar dating, she doesn’t understand it and she’s doing everything wrong is what’s she needs right now...",
                    "author": null,
                    "id": "fgi8tci",
                    "parent_id": "t1_fgi49jv",
                    "score": 14,
                    "created_utc": 1580811645.0,
                    "replies": [
                        {
                            "body": "So it’s better to encourage her to continue the way she is even though she has expressed the mental anguish it is causing her and that she will need therapy from it....\n\n\nPlease, tell me how being overly sensitive has any logic here?\n\nI’m telling her to educate herself on sugar dating and pursue that.",
                            "author": null,
                            "id": "fgi93o1",
                            "parent_id": "t1_fgi8tci",
                            "score": 5,
                            "created_utc": 1580812085.0,
                            "replies": [
                                {
                                    "body": "Not overly sensitive, just a little bit sensitive 👍🏽",
                                    "author": null,
                                    "id": "fgi97nz",
                                    "parent_id": "t1_fgi93o1",
                                    "score": 6,
                                    "created_utc": 1580812256.0,
                                    "replies": [
                                        {
                                            "body": "Op was asking for a way to stop, that was her desperation. \n\nI told her to stop the way she was doing it, educate herself on how to do, and be able to receive the benefits of doing it correctly. \n\nSome people need to be told directly in order to HEAR what is being said. \n\nForgive me for not make my words prettier for you. Walking on eggshells to be sensitive to a person that is clearly causing herself distress is helping no one. OP has the potential to make her situation better by making different choices in how she does sugar dating.",
                                            "author": null,
                                            "id": "fgi9jft",
                                            "parent_id": "t1_fgi97nz",
                                            "score": 5,
                                            "created_utc": 1580812747.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Out of curiosity, do you pay a substantial allowance with no immediate sexual expectations?",
                    "author": "sugarsenior",
                    "id": "fgj93fs",
                    "parent_id": "t1_fgi49jv",
                    "score": 3,
                    "created_utc": 1580839409.0,
                    "replies": [
                        {
                            "body": "I’m an SB. I don’t pay an allowance.",
                            "author": null,
                            "id": "fgkh4qd",
                            "parent_id": "t1_fgj93fs",
                            "score": 1,
                            "created_utc": 1580865440.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "This is so correct. You need to find someone that you are happy being around in the sugar bowl. You have to build chemistry and get things to work for you. Spending time with your sugar partner should be the highlight of your week - not something you dread. One-time hookups aren’t sugar dating - that’s escorting.",
                    "author": "john212223",
                    "id": "fgilsf8",
                    "parent_id": "t1_fgi49jv",
                    "score": 2,
                    "created_utc": 1580825275.0,
                    "replies": []
                },
                {
                    "body": ">You may think you are good at it, but you don’t sound good at it at all. You sound like you can fake interest in sex with men you hate. And if that is the case, escorting would be more suited to you and more financially rewarding.\n\nCheck out r/SexWorkersOnly. You *do not* want to be one of them one day.",
                    "author": "Throwawayacct501sd",
                    "id": "fgjb41n",
                    "parent_id": "t1_fgi49jv",
                    "score": -3,
                    "created_utc": 1580840464.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "There are younger mid thirty sugar daddy’s who you may have more luck with. When I first started my SD was in his 50s, the stuff was nice but the whole time I would think “I hope my friends don’t see me out with this old dude”.\n\nI chose more carefully after I had a bit saved up and now my SD is only 14 years older than me at 38. We have run into my friends and had no problem introducing him and felt proud to because he treats me right. I also had to correct him where he spent too much time down there, they don’t know. \n\nI have snap and drop box premium and an onlyfans that I make over 3k a month on without doing much at all. I just do daily pics and every week I’ll do a video. Thing about those videos is really I did 8-10 of them in a single day and just changed my clothes and a bit of makeup wait to post them like I just did it. That’s if you ever are okay with being found out. I don’t advertise mine locally and hasn’t happened yet. I pay someone to do the advertising for me through bots on tinder. I even paid him first in pics and custom videos. Eventually I’m sure they will be leaked onto sites so I’m prepared for that.",
            "author": "lolaluxe11",
            "id": "fgiqggc",
            "parent_id": "t3_eymq0s",
            "score": 5,
            "created_utc": 1580828585.0,
            "replies": []
        },
        {
            "body": "Mental health is important. If you don’t like what you are doing, STOP. \nYou sound like you’re doing this all wrong. Part of being a sugar baby to a successful person is also learning from their success. You were desperate, now you’re not so take a step back and figure out why you were where you were and take steps to not be there again. \n\nFew life questions:\nDo you budget? Do you know what you need on a monthly basis to survive? Can you create and emergency fund? If not, do this. You can live within your means, if you know what your means are. \n\nWhy do you have two minimum wage jobs? A good non minimum wage job can keep you going. I’m assuming your young, so you can learn. Better yourself \n\nWas it the desperation that caused you not to communicate with your SDs? If you are not enjoying what’s going down, you need to say. How are they supposed to know? \n\nHow has being a sugar baby benefited you other than money and travel? The relationship should be mutually beneficial.",
            "author": "cricketrmgss",
            "id": "fgijpvu",
            "parent_id": "t3_eymq0s",
            "score": 3,
            "created_utc": 1580823655.0,
            "replies": []
        },
        {
            "body": "First off, hopefully you can find someone who's time you actually enjoy as that would be the solution in a perfect world.  In the meantime the over simplified answer is to look long and hard at whether you have more sleepless nights worrying about bills or worrying about the men and even then you have to still heavily lean towards not sugaring as you have to have some built in risk aversion for cases where dates can go even more wrong then they have already.",
            "author": "brock0791",
            "id": "fgjfwrd",
            "parent_id": "t3_eymq0s",
            "score": 3,
            "created_utc": 1580843197.0,
            "replies": []
        },
        {
            "body": "I was in the same position. But it honestly took a huge toll on my mental health. These men act like they wanna take care of you but it’s just thinly veiled escorting once they get it. Then they think they can do whatever they want Bc of money. I stopped almost three years ago, and it has deeply affected my intimacy with men and how I view men. I knew I needed an endgame. I had to save enough to get out of it and into school for me we get a great job supporting my own self. I can’t even recognize my past self and I’m in such a better place after stopping. I never got to experience the glitz and glam. Sure I would have nice dinners and allowances but then it would be about these gross old men getting theirs. This ended up turning into a rant but these were dark times in my life.",
            "author": "plastic_luv",
            "id": "fgm7kdf",
            "parent_id": "t3_eymq0s",
            "score": 3,
            "created_utc": 1580919455.0,
            "replies": []
        },
        {
            "body": "AS a SD I would be totally grossed out to have a SB who felt the way you do. Most of the world does not have the opportunity or desire to sell their bodies for a living. Those broke people make do with other jobs,family or friend support. Sugaring is a gift to be able to earn $ thousands enjoying social activities, dinners and events,and loving intimacy from a guy who can help you through this crisis. Perhaps be more picky when selecting a SD, or find a younger man who can ignite some interest in you. Please do not sugar with the attitude that you have. It will destroy your soul.",
            "author": "GSSD",
            "id": "fgimrqp",
            "parent_id": "t3_eymq0s",
            "score": 7,
            "created_utc": 1580826003.0,
            "replies": [
                {
                    "body": ">Please do not sugar with the attitude that you have. It will destroy your soul.\n\nQFT.",
                    "author": "Throwawayacct501sd",
                    "id": "fgjc2hx",
                    "parent_id": "t1_fgimrqp",
                    "score": 3,
                    "created_utc": 1580840920.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Take a week off, lots of self-care, no dating, zero pressure. Tell everyone you’re sick, and just rest and relax. What I like to do is book myself a nice hotel room and chill for day, just so I can have that one night away from everyone and pretend I’m on an Instagram vacation. \n\nRight now you’re operating in survival mode, I get it and it made sense before, but if you continue you’re going to burn out. Just take some time off and things will be clearer and easier if you decide to get back into it.",
            "author": null,
            "id": "fgi8cu4",
            "parent_id": "t3_eymq0s",
            "score": 4,
            "created_utc": 1580810952.0,
            "replies": []
        },
        {
            "body": "Maybe you should stop \"sugaring\" - sugaring involves a bunch of emotional connection and time.\n\nI think u should move to something less \"emotionally intimate than sugaring\" maybe just start escorting (if you need the money so bad)\nYou dont actually need to pretend you like them so much and it paids immediately after one hour + its your job and you chose what to do or not without having to strictly please someone else..\n\nAnd if you keep sugaring just do it the right way and with the right person. Its an amazing experience when you actually do it out of passion and not just money.",
            "author": null,
            "id": "fgiaqd7",
            "parent_id": "t3_eymq0s",
            "score": 5,
            "created_utc": 1580814429.0,
            "replies": []
        },
        {
            "body": "You should only sugar with a SD that you can connect with. It should be mutual benefit, where that benefit includes fun of all kinds. Your self-respect will suffer if that total mutuality is missing.",
            "author": "ontherdagn",
            "id": "fgi6nvs",
            "parent_id": "t3_eymq0s",
            "score": 4,
            "created_utc": 1580808321.0,
            "replies": []
        },
        {
            "body": "You might like dancing instead",
            "author": "perryplats",
            "id": "fgind9t",
            "parent_id": "t3_eymq0s",
            "score": 4,
            "created_utc": 1580826439.0,
            "replies": []
        },
        {
            "body": "1. You sound like a damn good hustler so 👏👏 on that.\n2. I’d definitely look for a 35-40 yo married guy and have just one arrangement while getting some therapy (be sure it’s a sex-positive therapist!) & maybe doing cam stuff or dancing.\n\n\nBest of luck 💜",
            "author": "BratinaHat",
            "id": "fgipoju",
            "parent_id": "t3_eymq0s",
            "score": 4,
            "created_utc": 1580828061.0,
            "replies": []
        },
        {
            "body": "Please get out of the bowl.  \n\nNo one wants this person across the table/in bed from/with them:\n\n\" I hate sugaring. I hate going out on dates with men who could be my father if he weren't dead and who expect me to call them Daddy while they finger me too damn hard. I hate smiling and laughing and playing along with jokes that aren't funny. I hate these men. \"\n\nRe-read what you said.  You wouldn't want that person out with you.  \n\nI am not judging you.  It isn't for everyone.. It is absolutely NOT for you.",
            "author": "craa141",
            "id": "fgj2ko8",
            "parent_id": "t3_eymq0s",
            "score": 5,
            "created_utc": 1580835778.0,
            "replies": [
                {
                    "body": ">Re-read what you said. You wouldn't want that person out with you.\n\nQuoted for truth.\n\nI mean, the real reason to quit is for you. But you're not doing anyone else any favors.",
                    "author": "Throwawayacct501sd",
                    "id": "fgjas2o",
                    "parent_id": "t1_fgj2ko8",
                    "score": 0,
                    "created_utc": 1580840309.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[removed]",
            "author": null,
            "id": "fgib0vu",
            "parent_id": "t3_eymq0s",
            "score": 2,
            "created_utc": 1580814832.0,
            "replies": [
                {
                    "body": "The Op posted that she doesn’t like sleeping with men twice her age, so now you’re going to tell her to sleep with even more men twice her age..?\n\nNo shade against escorts. I believe prostitution should be legal and has its place. But why is it that escorts feel the need to come on to this sugar lifestyle sub and promote prostitution..?\n\nIs it because you’re worried that sugar babies are affecting your livelihood..?\n\nSugar Babies aren’t coming onto the sex worker subs and promoting the sugar lifestyle & trying to convert escorts into sugar babies are they..?\n\nThe truth is, the majority of women that that become a sugar baby aren’t looking to sleep with a dozen or more guys on a weekly basis. Most are looking to have a relationship with 1 man, that they have an emotional connection with and get financial assistance from. Most are not doing this as a career choice. This isn’t their livelihood. It’s a stepping stone to get them through college or to help them get started when they are starting out in their new career.",
                    "author": "ruphun",
                    "id": "fgiig9l",
                    "parent_id": "t1_fgib0vu",
                    "score": 1,
                    "created_utc": 1580822616.0,
                    "replies": [
                        {
                            "body": "I’m a sugar baby, and as are most escorts. But you guys wouldn’t know that now would you. So these young girls sleeping and spending time with older men isn’t prostitution? It’s a form of prostitution and you would be a fool to think otherwise. She talked about how she has made money from a variety of SDs and one time meetups. So it doesn’t sound like she’s one who wants a relationship with one, in fact it sounds like she doesn’t want to have a relationship with any of them. Sugar babies are sex workers, so yes they do promote the sugar lifestyle in sex worker groups. She said she doesn’t like sugaring, I have plenty of friends who didn’t like sugaring but enjoy escorting. And not all escorts sleep with a dozen men a week, and a lot of emotional connections with their customers. You obviously have preconceived ideas of what escorts are that are entirely incorrect. As most of the “SD” on this sub have incorrect ideas of what escorts do.",
                            "author": "KameronKae",
                            "id": "fgiizo5",
                            "parent_id": "t1_fgiig9l",
                            "score": 6,
                            "created_utc": 1580823064.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "The  promotion of escorting is not allowed in the sub.",
                    "author": "ruphun",
                    "id": "fgifs5d",
                    "parent_id": "t1_fgib0vu",
                    "score": -3,
                    "created_utc": 1580820227.0,
                    "replies": [
                        {
                            "body": "It’s not promotion it’s a suggestion. And the way “sugar daddies” are built nowadays most of them want a cheap escort but try to convince these young girls it’s something else because they are new and don’t understand their worth.",
                            "author": "KameronKae",
                            "id": "fgiimto",
                            "parent_id": "t1_fgifs5d",
                            "score": 6,
                            "created_utc": 1580822769.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "What are you doing to better yourself?   Are you learning any new skills?\n\nMy SB was working $10/hr retail 2 years ago.  I paid for several classes and she is a year into a 17.50/hr job and interviewed yesterday for a 25/hr job.  She went from $200 in savings to >$5k based on her hard work and some classes I paid for.  She put in the hard work.  Are you?\n\nShe will never again depend upon a man (or anyone) to pay her bills.  It can be done.",
            "author": "TXPolyDaddy",
            "id": "fgigk87",
            "parent_id": "t3_eymq0s",
            "score": 3,
            "created_utc": 1580820961.0,
            "replies": [
                {
                    "body": "I see you may have posted a number which is most likely an amount in relations to an arrangement. If this is the case, you are violating Rule#4 - \"No dollar amounts that are in reference to allowance/PPM are allowed.\"\n\n\nIf you are curious about Allowances reported by SLF contributors please see the [Allowance Master Thread 2019-2020](https://www.reddit.com/r/sugarlifestyleforum/comments/dezl91/allowance_master_thread_20192020/?utm_source=reddit&utm_medium=usertext&utm_name=sugarlifestyleforum&utm_content=t3_dnk455)\n\nYour post will not be approved until you remove the amount.  Please read the sub [Rules](https://www.reddit.com/r/sugarlifestyleforum/comments/748zta/updated_and_clarified_rules_for_slf/?utm_source=reddit&utm_medium=usertext&utm_name=sugarlifestyleforum&utm_content=t3_91lpnr) prior to posting anything else. \n\nIf you simply posted a number not referencing a monetary amount, please message the MODs to approve your post.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/sugarlifestyleforum) if you have any questions or concerns.*",
                    "author": "AutoModerator",
                    "id": "fgigk98",
                    "parent_id": "t1_fgigk87",
                    "score": -6,
                    "created_utc": 1580820962.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I am not commenting on your whole issue, but only responding to your last question *how do i believe am worth more than this?\n\nHere you go, this is purely what i felt while reading your words: \n\nYou defenitely have to believe you are worth it, you are pure enough and beautiful from inside, like, come one, you are thinking about your mom (emergency, mortgage..etc) in a responsible caring loving way. (What a lucky mom).  \n\nI actually love how you were raised to be that caring.. \n\nAnd an advice for you, incase  (sugaring) is your only available option at the time being;   \n\nMake sugaring as a way of pampering yourself.. dont force yourself to do anything that you simply dont like. \nTake more time, seeing more Sds, until you feel a chemistry with any of them. \n\nAll my prayers for you for a happy life, fulfilled with love and health and wealth,and to find the job of your dreams that will make you never depending on anyone, but your beautiful self ❤\n\n\n(Say Amen please)",
            "author": "fatinaty",
            "id": "fgij8ol",
            "parent_id": "t3_eymq0s",
            "score": 2,
            "created_utc": 1580823268.0,
            "replies": [
                {
                    "body": ">I am not commenting on your whole issue, but only responding to your last question \\*how do i believe am worth more than this?\n\nThis may be a guy/ girl thing, idk. But, really, what you're worth and what you get are two completely different things.\n\nVan Gogh died in the gutter.\n\nKurt Cobain blew his brains out.\n\nThere are pedophiles worth millions.\n\nWhat you make may be based on what you can do, who know, or even dumb luck. But it does not have anything to do with what you're worth.",
                    "author": "Throwawayacct501sd",
                    "id": "fgje7nd",
                    "parent_id": "t1_fgij8ol",
                    "score": 3,
                    "created_utc": 1580842186.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "So I’m going to tell you a ‘dad’ story that will probably bore you to shit, but bear with me..\n\nWhen I was your age I worked my way through college with 0 support from anyone. I lived on a $3/ day food budget. I ate Ramen w/ onions for flavor & cereal, & stole food from the cafeteria (not proud, just saying). It sucked, but that was my only option.\n\nJust for pretend, suppose you were a guy, and sugaring wasn’t an option. What would you do then?\n\nYou have choices. If sugaring is not a good option - and for you it sounds like it definitely IS NOT - there are other things you can do. If you hate the guys you’re with, you should do something else. The things that you do and say and experience, they’re with you forever. They define who you are. You can’t take them back.",
            "author": "Throwawayacct501sd",
            "id": "fgj71ky",
            "parent_id": "t3_eymq0s",
            "score": 2,
            "created_utc": 1580838203.0,
            "replies": []
        },
        {
            "body": "I say this with no judgement,  I think you are wired to be an escort.  If you hate all the men but will fake it for money then escorting is a faster path to money and you don’t have to deal with dates and emotional babysitting.   The interactions are quicker.  If this is truly how you feel about guys your sugar career will be a bunch of very short arrangements anyway.  You think you are a good actress but you can’t fake the same guy out week after week for months.  You can fake guys out 30-60 minutes at a time.",
            "author": "LotBuilder",
            "id": "fgjb9lc",
            "parent_id": "t3_eymq0s",
            "score": 2,
            "created_utc": 1580840535.0,
            "replies": []
        },
        {
            "body": "I love the positive advice on this post. Everyone has a point, I think you don’t need to give up sugaring. You just need a balance and a sugar daddy you actually like. Set your standards up a bit so that you don’t feel like you’re just going on these dates because you have to. While you look for a sugar daddy you like, I would keep seeing whoever you’re seeing, just so you can still do everything you want to do, once you find someone you like then you can kindly break off what you currently have. And most of all, SPEAK UP ON YOUR SEXUAL NEEDS GIRL",
            "author": null,
            "id": "fgjvfn6",
            "parent_id": "t3_eymq0s",
            "score": 1,
            "created_utc": 1580852160.0,
            "replies": []
        },
        {
            "body": "> How do I believe I'm worth more than this?\n\nValuing yourself with $$$ is the worst thing you could do. Your worth is already determined by the job market and you always make 10x more than that on the bowl. So, I'm not sure why you  have to get all twisted and knotted over this.\n\nSo, why don't you date someone you like even though the allowance may be less?",
            "author": "xanfiles",
            "id": "fgkt5oy",
            "parent_id": "t3_eymq0s",
            "score": 1,
            "created_utc": 1580873038.0,
            "replies": []
        },
        {
            "body": "At the very least, stop seeing SDs that make you feel this way.  This feels like something that could be damaging to your mental health.  In other words, it may end up costing you all of the money you made, and more in the future.  Find a way to be happy or get out.",
            "author": "quefiler",
            "id": "fgn7zok",
            "parent_id": "t3_eymq0s",
            "score": 1,
            "created_utc": 1580939414.0,
            "replies": []
        },
        {
            "body": "Having known some old, fat guys (ahem) it would kill me- them- to think the gal I was with despised it.  I had to search, but eventually found a gal for whom their cultural upbringing views such guys as catches (really.. I promise... checked this out through ad through).  Don't settle.",
            "author": "TY2022",
            "id": "fpwoj7t",
            "parent_id": "t3_eymq0s",
            "score": 1,
            "created_utc": 1588967098.0,
            "replies": []
        },
        {
            "body": "Why dont you go Pro while you are looking for a SD. Finding a SD takes time and effort, and people who are desperate will make mistakes that can put your safety are risk.",
            "author": "Mailbox_throw",
            "id": "fgi44ka",
            "parent_id": "t3_eymq0s",
            "score": 0,
            "created_utc": 1580804624.0,
            "replies": []
        },
        {
            "body": "Maybe I’m over simplifying this ... but why don’t you try to find someone you like, and vice versa. Someone who actually cares for you and respects you.  Communication is always helpful in relationships.  In your situation, maybe they treat you in a particular way, because they don’t know any better (not that it’s an excuse).  Maybe try to set your rules up front.  Try to wear the other person’s shoes and take a look at the situation.",
            "author": "MasterAcct2020",
            "id": "fgi3wcs",
            "parent_id": "t3_eymq0s",
            "score": 1,
            "created_utc": 1580804315.0,
            "replies": [
                {
                    "body": "I really wish I could hold it against them - it's not their fault that I'm not attracted to any of them, by all accounts the men I've met up with have been respectful of every boundary I've set. I'm just...not into them. And it sucks.",
                    "author": "esbeethrowway",
                    "id": "fgi4brx",
                    "parent_id": "t1_fgi3wcs",
                    "score": 7,
                    "created_utc": 1580804900.0,
                    "replies": [
                        {
                            "body": "Were all of them just plain unattractive, or do you just find older guys unattractive in general?",
                            "author": "LucidDion",
                            "id": "fgidpzu",
                            "parent_id": "t1_fgi4brx",
                            "score": 3,
                            "created_utc": 1580818130.0,
                            "replies": []
                        },
                        {
                            "body": "So please please stop.",
                            "author": "Throwawayacct501sd",
                            "id": "fgjch8o",
                            "parent_id": "t1_fgi4brx",
                            "score": -1,
                            "created_utc": 1580841155.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "First of all stop lying to yourself.  I say this out of a true desire to help, not to shame you.  You are not a sugar baby.  It sounds like you've seen a large number of men and numerous \"one time arrangements\" which means you are working as a prostitute.  The sugar baby label is just a tool some women use to make themselves feel better however you are a call girl and you are going to experience all of the negative effects associated from prostitution.\n\nProstitution is easy money.  Working is difficult and stressful but at least it's easier to look at yourself in the mirror.  I would suggest you use some of your newfound money to get therapy and also devote yourself to a career.  It's not easy, in fact it's very difficult but your long term prognosis is not good if you continue doing what you are doing.   It's not the outside world that will condemn you, it's going to be internal.\n\nI wish you the very best of luck no matter what your decision.",
            "author": "JackAttack988",
            "id": "fgiw4z1",
            "parent_id": "t3_eymq0s",
            "score": 1,
            "created_utc": 1580832196.0,
            "replies": [
                {
                    "body": ">Prostitution is easy money\n\nClearly it’s not. Nothing about OP’s post sounds “easy”. And prostitution is working, it’s stressful and it can be a career for some too - although I don’t recommend it to OP.",
                    "author": null,
                    "id": "fgjm9vf",
                    "parent_id": "t1_fgiw4z1",
                    "score": 4,
                    "created_utc": 1580846954.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Maybe do it for a while and save up cash and then relocate to a cheaper part of the world to do other work.",
            "author": "MGTOWManofMystery",
            "id": "fgjkxit",
            "parent_id": "t3_eymq0s",
            "score": -1,
            "created_utc": 1580846170.0,
            "replies": []
        },
        {
            "body": "The reason women can't find real relationships in this day and aga is because they think too much of themselves. If you want to be more financially stable, you should find someone to date with marriage in mind. Morons say marriage is expensive. These are people making excuses. You pay 1200 for rent, he pays 1200 for rent. Guess what, you move in together and you save 1200 a month as a couple, or you get a bigger apartment for 1600 and only save 600 together. \n\nThe reason women don't find marriage partners is because they don't date men who are going to marry them. You spend your 20s on Tinder fucking guys that are fucking a bunch of other girls. If you went to the third best campus of a state school you need to be looking at plumbers and insurance claims adjusters, credit collectors, mechanics - and then you need to be OK living as a 60th percentile household income",
            "author": "Time_Animal_",
            "id": "fgnru4y",
            "parent_id": "t3_eymq0s",
            "score": 0,
            "created_utc": 1580951507.0,
            "replies": []
        },
        {
            "body": "This is sound advice. \n\nShe has options.  She can continue doing what she is doing to survive while looking for a healthier long term Sugar relationship with someone enjoys spending time with and / or look at options like stripping that can be very rewarding for attractive women who know how to play to older men as long as you dont get too caught up in the lifestyle, party to much and start escorting on the side.  \n\nWe all have to do things for a period of time we dont enjoy, but we should have an end in mind to get us where we want to be.  Doing something long term that you truly despise will eat at your soul.",
            "author": "willfromvb",
            "id": "fgiveek",
            "parent_id": "t1_fgi4g09",
            "score": 17,
            "created_utc": 1580831747.0,
            "replies": []
        },
        {
            "body": "Your first suggestion is basically my current situation. I have a good job but have too many bills, too many dependents. So I recently was lucky enough to find a SD who isn’t much older than me, is attractive, has manners, and I don’t hate fucking him at all. It’s not awkward in public because we look like a regular couple. Sure, he doesn’t pay me as much as an old fat guy would have to but at least it’s not taking the mental toll on me that that would. \n\nFocus on the future. Focus on supporting yourself through sugaring while finding a real career path. If you have money right now that’s great, but make sure it isn’t taking too large of a mental toll and make sure you’re getting some mentoring in as well. Sounds like you’ve had it rough and deserve a stable and happy future. Take what you deserve in this life girl.",
            "author": "MetalandIron2pt0",
            "id": "fgjagas",
            "parent_id": "t1_fgi4g09",
            "score": 9,
            "created_utc": 1580840157.0,
            "replies": [
                {
                    "body": "I wanted to strongly echo this comment.  OP, never forget that the SB should be the one in charge. She picks the men she wants.  To do that, though, she needs to be able to stand on her own two feet.  I've always seen sugaring as a fun way to get some luxuries I couldn't otherwise afford.  If you need men's money, they have you trapped.  You sound like you're feeling terribly trapped and that's a horrible place to be.  Why not use some of the money you're earning from sugaring (or stripping if you switch to that) to get yourself trained for a career you like?  There's a  whole world out there.  If you're not sure what else you're good at, take one course in anything at the local community college.  That will give you access to their Career Counseling service.  They can give you some aptitude tests to figure out what good fields would be for you.  You may not make as much as a plumber or a computer specialist or any one of dozens of high-paying fields than as a SB, but you'll be a hell of a lot happier.  Once you're making enough money to be self-sufficient, then you can freely deicide if you want to do some sugaring to get the luxury goods like jewelry and trips and you can pick the men you want to provide things like that.",
                    "author": "Candi_in_a_Bikini",
                    "id": "fgjg9c8",
                    "parent_id": "t1_fgjagas",
                    "score": 7,
                    "created_utc": 1580843412.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I second being a stripper",
            "author": "KameronKae",
            "id": "fgibizl",
            "parent_id": "t1_fgi4g09",
            "score": 19,
            "created_utc": 1580815503.0,
            "replies": []
        },
        {
            "body": "🙏",
            "author": null,
            "id": "fgi92rq",
            "parent_id": "t1_fgi831s",
            "score": 3,
            "created_utc": 1580812047.0,
            "replies": []
        },
        {
            "body": "> An honest post from the rare SB who isn't trying to market herself to a reddit SD.\n\nI’m living. Finally someone said it",
            "author": null,
            "id": "fgl6ea8",
            "parent_id": "t1_fgj8exe",
            "score": 5,
            "created_utc": 1580883577.0,
            "replies": []
        },
        {
            "body": "[removed]",
            "author": null,
            "id": "fgk1mbk",
            "parent_id": "t1_fgj8exe",
            "score": 12,
            "created_utc": 1580855627.0,
            "replies": [
                {
                    "body": "The truth!",
                    "author": "sugarsenior",
                    "id": "fgl08wc",
                    "parent_id": "t1_fgk1mbk",
                    "score": 6,
                    "created_utc": 1580878105.0,
                    "replies": []
                },
                {
                    "body": "AMEN",
                    "author": null,
                    "id": "fgl5z5e",
                    "parent_id": "t1_fgk1mbk",
                    "score": 3,
                    "created_utc": 1580883156.0,
                    "replies": []
                }
            ]
        },
        {
            "body": ">Most girls aren't getting $10,000 a month with no hard strings attached.\n\nAnd those pictures on SA's website? Marketing.\n\nAnd Pretty Woman? Just a movie.",
            "author": "Throwawayacct501sd",
            "id": "fgjbxs0",
            "parent_id": "t1_fgj8exe",
            "score": 7,
            "created_utc": 1580840850.0,
            "replies": [
                {
                    "body": "Oh 5 years ago that was a very reasonable mid-to high allowance, and $5k was entry level.",
                    "author": "sugarsenior",
                    "id": "fgkzonz",
                    "parent_id": "t1_fgjbxs0",
                    "score": 3,
                    "created_utc": 1580877651.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Yes this. It’s a lot of work finding a good SD but think about how cool it would be to have the savings and fruit and cosmetics while going on dates with somebody that you like. They’re out there, but they take some time to find.",
            "author": "2fast-2curious",
            "id": "fgihwri",
            "parent_id": "t1_fgig08e",
            "score": 6,
            "created_utc": 1580822145.0,
            "replies": [
                {
                    "body": "Yes it does take time to find somebody right. That’s why you should never try sugar dating out of desperation. Because you will make unwise choices put yourself into unsafe predicaments, and most likely sleep with a lot of men that are not the right guy.",
                    "author": "ruphun",
                    "id": "fgiidcp",
                    "parent_id": "t1_fgihwri",
                    "score": 1,
                    "created_utc": 1580822549.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "OP was in a financial crisis and did what she had to do to get herself out of that situation. She’s clearly in distress and I don’t think telling her she’s not good at sugar dating, she doesn’t understand it and she’s doing everything wrong is what’s she needs right now...",
            "author": null,
            "id": "fgi8tci",
            "parent_id": "t1_fgi49jv",
            "score": 14,
            "created_utc": 1580811645.0,
            "replies": [
                {
                    "body": "So it’s better to encourage her to continue the way she is even though she has expressed the mental anguish it is causing her and that she will need therapy from it....\n\n\nPlease, tell me how being overly sensitive has any logic here?\n\nI’m telling her to educate herself on sugar dating and pursue that.",
                    "author": null,
                    "id": "fgi93o1",
                    "parent_id": "t1_fgi8tci",
                    "score": 5,
                    "created_utc": 1580812085.0,
                    "replies": [
                        {
                            "body": "Not overly sensitive, just a little bit sensitive 👍🏽",
                            "author": null,
                            "id": "fgi97nz",
                            "parent_id": "t1_fgi93o1",
                            "score": 6,
                            "created_utc": 1580812256.0,
                            "replies": [
                                {
                                    "body": "Op was asking for a way to stop, that was her desperation. \n\nI told her to stop the way she was doing it, educate herself on how to do, and be able to receive the benefits of doing it correctly. \n\nSome people need to be told directly in order to HEAR what is being said. \n\nForgive me for not make my words prettier for you. Walking on eggshells to be sensitive to a person that is clearly causing herself distress is helping no one. OP has the potential to make her situation better by making different choices in how she does sugar dating.",
                                    "author": null,
                                    "id": "fgi9jft",
                                    "parent_id": "t1_fgi97nz",
                                    "score": 5,
                                    "created_utc": 1580812747.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Out of curiosity, do you pay a substantial allowance with no immediate sexual expectations?",
            "author": "sugarsenior",
            "id": "fgj93fs",
            "parent_id": "t1_fgi49jv",
            "score": 3,
            "created_utc": 1580839409.0,
            "replies": [
                {
                    "body": "I’m an SB. I don’t pay an allowance.",
                    "author": null,
                    "id": "fgkh4qd",
                    "parent_id": "t1_fgj93fs",
                    "score": 1,
                    "created_utc": 1580865440.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "This is so correct. You need to find someone that you are happy being around in the sugar bowl. You have to build chemistry and get things to work for you. Spending time with your sugar partner should be the highlight of your week - not something you dread. One-time hookups aren’t sugar dating - that’s escorting.",
            "author": "john212223",
            "id": "fgilsf8",
            "parent_id": "t1_fgi49jv",
            "score": 2,
            "created_utc": 1580825275.0,
            "replies": []
        },
        {
            "body": ">You may think you are good at it, but you don’t sound good at it at all. You sound like you can fake interest in sex with men you hate. And if that is the case, escorting would be more suited to you and more financially rewarding.\n\nCheck out r/SexWorkersOnly. You *do not* want to be one of them one day.",
            "author": "Throwawayacct501sd",
            "id": "fgjb41n",
            "parent_id": "t1_fgi49jv",
            "score": -3,
            "created_utc": 1580840464.0,
            "replies": []
        },
        {
            "body": ">Please do not sugar with the attitude that you have. It will destroy your soul.\n\nQFT.",
            "author": "Throwawayacct501sd",
            "id": "fgjc2hx",
            "parent_id": "t1_fgimrqp",
            "score": 3,
            "created_utc": 1580840920.0,
            "replies": []
        },
        {
            "body": ">Re-read what you said. You wouldn't want that person out with you.\n\nQuoted for truth.\n\nI mean, the real reason to quit is for you. But you're not doing anyone else any favors.",
            "author": "Throwawayacct501sd",
            "id": "fgjas2o",
            "parent_id": "t1_fgj2ko8",
            "score": 0,
            "created_utc": 1580840309.0,
            "replies": []
        },
        {
            "body": "The Op posted that she doesn’t like sleeping with men twice her age, so now you’re going to tell her to sleep with even more men twice her age..?\n\nNo shade against escorts. I believe prostitution should be legal and has its place. But why is it that escorts feel the need to come on to this sugar lifestyle sub and promote prostitution..?\n\nIs it because you’re worried that sugar babies are affecting your livelihood..?\n\nSugar Babies aren’t coming onto the sex worker subs and promoting the sugar lifestyle & trying to convert escorts into sugar babies are they..?\n\nThe truth is, the majority of women that that become a sugar baby aren’t looking to sleep with a dozen or more guys on a weekly basis. Most are looking to have a relationship with 1 man, that they have an emotional connection with and get financial assistance from. Most are not doing this as a career choice. This isn’t their livelihood. It’s a stepping stone to get them through college or to help them get started when they are starting out in their new career.",
            "author": "ruphun",
            "id": "fgiig9l",
            "parent_id": "t1_fgib0vu",
            "score": 1,
            "created_utc": 1580822616.0,
            "replies": [
                {
                    "body": "I’m a sugar baby, and as are most escorts. But you guys wouldn’t know that now would you. So these young girls sleeping and spending time with older men isn’t prostitution? It’s a form of prostitution and you would be a fool to think otherwise. She talked about how she has made money from a variety of SDs and one time meetups. So it doesn’t sound like she’s one who wants a relationship with one, in fact it sounds like she doesn’t want to have a relationship with any of them. Sugar babies are sex workers, so yes they do promote the sugar lifestyle in sex worker groups. She said she doesn’t like sugaring, I have plenty of friends who didn’t like sugaring but enjoy escorting. And not all escorts sleep with a dozen men a week, and a lot of emotional connections with their customers. You obviously have preconceived ideas of what escorts are that are entirely incorrect. As most of the “SD” on this sub have incorrect ideas of what escorts do.",
                    "author": "KameronKae",
                    "id": "fgiizo5",
                    "parent_id": "t1_fgiig9l",
                    "score": 6,
                    "created_utc": 1580823064.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "The  promotion of escorting is not allowed in the sub.",
            "author": "ruphun",
            "id": "fgifs5d",
            "parent_id": "t1_fgib0vu",
            "score": -3,
            "created_utc": 1580820227.0,
            "replies": [
                {
                    "body": "It’s not promotion it’s a suggestion. And the way “sugar daddies” are built nowadays most of them want a cheap escort but try to convince these young girls it’s something else because they are new and don’t understand their worth.",
                    "author": "KameronKae",
                    "id": "fgiimto",
                    "parent_id": "t1_fgifs5d",
                    "score": 6,
                    "created_utc": 1580822769.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I see you may have posted a number which is most likely an amount in relations to an arrangement. If this is the case, you are violating Rule#4 - \"No dollar amounts that are in reference to allowance/PPM are allowed.\"\n\n\nIf you are curious about Allowances reported by SLF contributors please see the [Allowance Master Thread 2019-2020](https://www.reddit.com/r/sugarlifestyleforum/comments/dezl91/allowance_master_thread_20192020/?utm_source=reddit&utm_medium=usertext&utm_name=sugarlifestyleforum&utm_content=t3_dnk455)\n\nYour post will not be approved until you remove the amount.  Please read the sub [Rules](https://www.reddit.com/r/sugarlifestyleforum/comments/748zta/updated_and_clarified_rules_for_slf/?utm_source=reddit&utm_medium=usertext&utm_name=sugarlifestyleforum&utm_content=t3_91lpnr) prior to posting anything else. \n\nIf you simply posted a number not referencing a monetary amount, please message the MODs to approve your post.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/sugarlifestyleforum) if you have any questions or concerns.*",
            "author": "AutoModerator",
            "id": "fgigk98",
            "parent_id": "t1_fgigk87",
            "score": -6,
            "created_utc": 1580820962.0,
            "replies": []
        },
        {
            "body": ">I am not commenting on your whole issue, but only responding to your last question \\*how do i believe am worth more than this?\n\nThis may be a guy/ girl thing, idk. But, really, what you're worth and what you get are two completely different things.\n\nVan Gogh died in the gutter.\n\nKurt Cobain blew his brains out.\n\nThere are pedophiles worth millions.\n\nWhat you make may be based on what you can do, who know, or even dumb luck. But it does not have anything to do with what you're worth.",
            "author": "Throwawayacct501sd",
            "id": "fgje7nd",
            "parent_id": "t1_fgij8ol",
            "score": 3,
            "created_utc": 1580842186.0,
            "replies": []
        },
        {
            "body": "I really wish I could hold it against them - it's not their fault that I'm not attracted to any of them, by all accounts the men I've met up with have been respectful of every boundary I've set. I'm just...not into them. And it sucks.",
            "author": "esbeethrowway",
            "id": "fgi4brx",
            "parent_id": "t1_fgi3wcs",
            "score": 7,
            "created_utc": 1580804900.0,
            "replies": [
                {
                    "body": "Were all of them just plain unattractive, or do you just find older guys unattractive in general?",
                    "author": "LucidDion",
                    "id": "fgidpzu",
                    "parent_id": "t1_fgi4brx",
                    "score": 3,
                    "created_utc": 1580818130.0,
                    "replies": []
                },
                {
                    "body": "So please please stop.",
                    "author": "Throwawayacct501sd",
                    "id": "fgjch8o",
                    "parent_id": "t1_fgi4brx",
                    "score": -1,
                    "created_utc": 1580841155.0,
                    "replies": []
                }
            ]
        },
        {
            "body": ">Prostitution is easy money\n\nClearly it’s not. Nothing about OP’s post sounds “easy”. And prostitution is working, it’s stressful and it can be a career for some too - although I don’t recommend it to OP.",
            "author": null,
            "id": "fgjm9vf",
            "parent_id": "t1_fgiw4z1",
            "score": 4,
            "created_utc": 1580846954.0,
            "replies": []
        },
        {
            "body": "I wanted to strongly echo this comment.  OP, never forget that the SB should be the one in charge. She picks the men she wants.  To do that, though, she needs to be able to stand on her own two feet.  I've always seen sugaring as a fun way to get some luxuries I couldn't otherwise afford.  If you need men's money, they have you trapped.  You sound like you're feeling terribly trapped and that's a horrible place to be.  Why not use some of the money you're earning from sugaring (or stripping if you switch to that) to get yourself trained for a career you like?  There's a  whole world out there.  If you're not sure what else you're good at, take one course in anything at the local community college.  That will give you access to their Career Counseling service.  They can give you some aptitude tests to figure out what good fields would be for you.  You may not make as much as a plumber or a computer specialist or any one of dozens of high-paying fields than as a SB, but you'll be a hell of a lot happier.  Once you're making enough money to be self-sufficient, then you can freely deicide if you want to do some sugaring to get the luxury goods like jewelry and trips and you can pick the men you want to provide things like that.",
            "author": "Candi_in_a_Bikini",
            "id": "fgjg9c8",
            "parent_id": "t1_fgjagas",
            "score": 7,
            "created_utc": 1580843412.0,
            "replies": []
        },
        {
            "body": "The truth!",
            "author": "sugarsenior",
            "id": "fgl08wc",
            "parent_id": "t1_fgk1mbk",
            "score": 6,
            "created_utc": 1580878105.0,
            "replies": []
        },
        {
            "body": "AMEN",
            "author": null,
            "id": "fgl5z5e",
            "parent_id": "t1_fgk1mbk",
            "score": 3,
            "created_utc": 1580883156.0,
            "replies": []
        },
        {
            "body": "Oh 5 years ago that was a very reasonable mid-to high allowance, and $5k was entry level.",
            "author": "sugarsenior",
            "id": "fgkzonz",
            "parent_id": "t1_fgjbxs0",
            "score": 3,
            "created_utc": 1580877651.0,
            "replies": []
        },
        {
            "body": "Yes it does take time to find somebody right. That’s why you should never try sugar dating out of desperation. Because you will make unwise choices put yourself into unsafe predicaments, and most likely sleep with a lot of men that are not the right guy.",
            "author": "ruphun",
            "id": "fgiidcp",
            "parent_id": "t1_fgihwri",
            "score": 1,
            "created_utc": 1580822549.0,
            "replies": []
        },
        {
            "body": "So it’s better to encourage her to continue the way she is even though she has expressed the mental anguish it is causing her and that she will need therapy from it....\n\n\nPlease, tell me how being overly sensitive has any logic here?\n\nI’m telling her to educate herself on sugar dating and pursue that.",
            "author": null,
            "id": "fgi93o1",
            "parent_id": "t1_fgi8tci",
            "score": 5,
            "created_utc": 1580812085.0,
            "replies": [
                {
                    "body": "Not overly sensitive, just a little bit sensitive 👍🏽",
                    "author": null,
                    "id": "fgi97nz",
                    "parent_id": "t1_fgi93o1",
                    "score": 6,
                    "created_utc": 1580812256.0,
                    "replies": [
                        {
                            "body": "Op was asking for a way to stop, that was her desperation. \n\nI told her to stop the way she was doing it, educate herself on how to do, and be able to receive the benefits of doing it correctly. \n\nSome people need to be told directly in order to HEAR what is being said. \n\nForgive me for not make my words prettier for you. Walking on eggshells to be sensitive to a person that is clearly causing herself distress is helping no one. OP has the potential to make her situation better by making different choices in how she does sugar dating.",
                            "author": null,
                            "id": "fgi9jft",
                            "parent_id": "t1_fgi97nz",
                            "score": 5,
                            "created_utc": 1580812747.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I’m an SB. I don’t pay an allowance.",
            "author": null,
            "id": "fgkh4qd",
            "parent_id": "t1_fgj93fs",
            "score": 1,
            "created_utc": 1580865440.0,
            "replies": []
        },
        {
            "body": "I’m a sugar baby, and as are most escorts. But you guys wouldn’t know that now would you. So these young girls sleeping and spending time with older men isn’t prostitution? It’s a form of prostitution and you would be a fool to think otherwise. She talked about how she has made money from a variety of SDs and one time meetups. So it doesn’t sound like she’s one who wants a relationship with one, in fact it sounds like she doesn’t want to have a relationship with any of them. Sugar babies are sex workers, so yes they do promote the sugar lifestyle in sex worker groups. She said she doesn’t like sugaring, I have plenty of friends who didn’t like sugaring but enjoy escorting. And not all escorts sleep with a dozen men a week, and a lot of emotional connections with their customers. You obviously have preconceived ideas of what escorts are that are entirely incorrect. As most of the “SD” on this sub have incorrect ideas of what escorts do.",
            "author": "KameronKae",
            "id": "fgiizo5",
            "parent_id": "t1_fgiig9l",
            "score": 6,
            "created_utc": 1580823064.0,
            "replies": []
        },
        {
            "body": "It’s not promotion it’s a suggestion. And the way “sugar daddies” are built nowadays most of them want a cheap escort but try to convince these young girls it’s something else because they are new and don’t understand their worth.",
            "author": "KameronKae",
            "id": "fgiimto",
            "parent_id": "t1_fgifs5d",
            "score": 6,
            "created_utc": 1580822769.0,
            "replies": []
        },
        {
            "body": "Were all of them just plain unattractive, or do you just find older guys unattractive in general?",
            "author": "LucidDion",
            "id": "fgidpzu",
            "parent_id": "t1_fgi4brx",
            "score": 3,
            "created_utc": 1580818130.0,
            "replies": []
        },
        {
            "body": "So please please stop.",
            "author": "Throwawayacct501sd",
            "id": "fgjch8o",
            "parent_id": "t1_fgi4brx",
            "score": -1,
            "created_utc": 1580841155.0,
            "replies": []
        },
        {
            "body": "Not overly sensitive, just a little bit sensitive 👍🏽",
            "author": null,
            "id": "fgi97nz",
            "parent_id": "t1_fgi93o1",
            "score": 6,
            "created_utc": 1580812256.0,
            "replies": [
                {
                    "body": "Op was asking for a way to stop, that was her desperation. \n\nI told her to stop the way she was doing it, educate herself on how to do, and be able to receive the benefits of doing it correctly. \n\nSome people need to be told directly in order to HEAR what is being said. \n\nForgive me for not make my words prettier for you. Walking on eggshells to be sensitive to a person that is clearly causing herself distress is helping no one. OP has the potential to make her situation better by making different choices in how she does sugar dating.",
                    "author": null,
                    "id": "fgi9jft",
                    "parent_id": "t1_fgi97nz",
                    "score": 5,
                    "created_utc": 1580812747.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Op was asking for a way to stop, that was her desperation. \n\nI told her to stop the way she was doing it, educate herself on how to do, and be able to receive the benefits of doing it correctly. \n\nSome people need to be told directly in order to HEAR what is being said. \n\nForgive me for not make my words prettier for you. Walking on eggshells to be sensitive to a person that is clearly causing herself distress is helping no one. OP has the potential to make her situation better by making different choices in how she does sugar dating.",
            "author": null,
            "id": "fgi9jft",
            "parent_id": "t1_fgi97nz",
            "score": 5,
            "created_utc": 1580812747.0,
            "replies": []
        }
    ]
}