{
    "title": "HSV+ SBs - there is a place for you in the bowl. My experience on SA (and follow-up to some of the other STI posts this week)",
    "post_id": "lqdc4m",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/lqdc4m/hsv_sbs_there_is_a_place_for_you_in_the_bowl_my/",
    "author": "sunsetglow14",
    "body": "Hi everyone :) This is a long post, but it’s story time. There have been a few posts about HSV/STIs in the last few weeks. I’ve commented/messaged people separately, but I wanted to create a new post so others could see it too - for empowerment and education and continuing to reduce the stigma.\n\nI’m in my early 30s, and I have herpes. I’d like to share my initial experience on SA so far. First, I was diagnosed when I was 19. When I got that phone call, I wanted to DIE. I cried every day for 6 months and genuinely thought there wasn’t a man who would want to touch me again. \n\nI started learning about it and went to therapy. In one support group, a 50-year-old man couldn’t even say the word herpes. It made me think, oh my god - this stupid virus is literally ruining the ONE life we have for NO reason  (except b/c of stigma)! Fast forward 12 years. I’ve had lots of casual and serious relationships (of course, disclosing every time). I’ve been with really kind and caring men. No one has contracted it.\n\nSo I’m back in grad school and signed up for SA last summer. I poured over this sub and talked to a few amazing HSV+ ladies (on a different Reddit account). But I chickened out before my first M&G and took a step back.\n\nI recently made a new profile. Added a sultry photo without my face. And I disclosed in my bio: “I’m HSV-2 positive. 1 in 8 people have it, and 80% of those people don't know they have it. Research has shown there is a 99% chance it won't be passed on. Let me know if you have any questions :)” Because ladies - the risk is around 1-2% with antivirals and condoms. You have a higher risk of getting pregnant on some forms of birth control than you do passing on this virus.\n\nAnd guess what. I get messages every day. There ARE people who look at my profile and pass. But I’m blown away at the POTs who don’t care. We start talking, and I ask if they’ve read my entire profile. They say yes, and here are some of their responses:\n\n“Yeah, I actually have it too.” \n“My dad/brother are doctors, and I’m familiar with it. It doesn’t bother me”\n“I asked my doctor once why they don’t test for it, and she told me a lot about it.”\n“That was really bold and refreshing of you to share.”\n“My ex of 12 years had it, and I never contracted it.”\n“No worries - it’s so common, I’m sure I’ve been with people who have it.”\n“Thanks for letting me know :) It doesn’t bother me.”\n\nAND MORE. Some SDs even start off with how much they appreciate my transparency. I KNOW there are people on this sub who would pass. I know the stigma is real. But I’ve set up half a dozen M&Gs, and they’ve all agreed to get a full panel themselves if we decided to move forward.\n\nI’m not saying disclosing on your profile is the way to go. I don’t disclose on my other dating profiles. But the moral of this long story: HSV+ SBs. There is a place for you in the bowl. There is a place for you in vanilla dating. You are so much more than a diagnosis. Yes, there are people who will decline, but please do not let this stigma hold you back. Please feel free to message me anytime.\n\nThanks for listening to my TedTalk :)\n\nEDIT 1: Slight correction on a stat thanks to a lovely commenter below. There’s also info about asymptomatic viral shedding that I didn’t write above, but that I ALWAYS share.\n\nEDIT 2: Please know - the point of this post is to encourage folks who feel disempowered or less than because of this virus. Even if POTs decline an arrangement, people with HSV can still put themselves out there and have success (given they disclose, share accurate info, and minimize risk). Our lives do not need to be “ruined,” and there ARE partners who will be okay with it. That is the point of this supportive post <3 More detail in a comment below.\n\nEDIT 3: I honestly don’t know how to Reddit, but thank you for these awards!! 😭 And for your kind comments and messages! I would tell this story over and over if it meant helping other people. Others did that for me when I needed it too <3",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/lqdc4m/hsv_sbs_there_is_a_place_for_you_in_the_bowl_my/",
    "score": 150,
    "upvote_ratio": 0.96,
    "created_utc": 1614068739.0,
    "num_comments": 35,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "This mirrors the experience of a friend of mine. She called me crying and said her life was over and that she was no longer “a catch” and, and, and. Was hopelessly depressed for six months. A year later she was calling HSV-2, “the world’s least interesting incurable disease”, and was with a new bf who was ok with her being on anti-virals and no protection. She dated him for at least a year and he didn’t get it. She dated a lot of guys after that and I didn’t keep track of it but from what I could tell it didn’t really impact her life at all once she got over the stigma.",
            "author": "LaGriffeDuLion",
            "id": "gog57np",
            "parent_id": "t3_lqdc4m",
            "score": 22,
            "created_utc": 1614077809.0,
            "replies": []
        },
        {
            "body": "Thank you for sharing, I got hsv 2 crazy enough from a sugar daddy back in 2019 I really blamed myself after thinking if I just dated “normally” my life wouldn’t have been this way. With taking a while off from dating I’ve realized the stigma honestly is the worst part. I haven’t put myself back on SA because I’ve been scared but met another SD on positives (not great pool of people tho) your post has encouraged me to be more brave. It’s like fate you posting aha thank you 🤎\n\nP.s the real thing I’m scared of honestly is not finding true love or if I date this guy who doesn’t have hsv & if he contracts it after a while of being together he will hate me after feeling the pain of the outbreak. Little fear I always have, people say they’re cool with alotta things until actually experiencing it :( it just sucks the mental mind game of being young and getting hsv because I only lost my virginity 2 years prior to that so thoughts of shit not being fair creeps up at times, but just reminding myself that it’s not a big deal honestly a skin rash if keeping it real just gotta let the annoying voice in my head to stop punishing myself for what’s outta my control now.",
            "author": "heyaheyaluna",
            "id": "gog9v0r",
            "parent_id": "t3_lqdc4m",
            "score": 13,
            "created_utc": 1614081708.0,
            "replies": [
                {
                    "body": "Did he know he had it?",
                    "author": "Fun_Focus8159",
                    "id": "gogsg8p",
                    "parent_id": "t1_gog9v0r",
                    "score": 5,
                    "created_utc": 1614092575.0,
                    "replies": [
                        {
                            "body": "Yup he just lied to me evil man",
                            "author": "heyaheyaluna",
                            "id": "gogsj17",
                            "parent_id": "t1_gogsg8p",
                            "score": 7,
                            "created_utc": 1614092611.0,
                            "replies": [
                                {
                                    "body": "I’m so sorry :/",
                                    "author": "Fun_Focus8159",
                                    "id": "gogsn04",
                                    "parent_id": "t1_gogsj17",
                                    "score": 5,
                                    "created_utc": 1614092662.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gofvt7x",
            "parent_id": "t3_lqdc4m",
            "score": 11,
            "created_utc": 1614068928.0,
            "replies": [
                {
                    "body": "Yes agreed! My point though was that people who have not been diagnosed are still reaching out and are okay with it :)",
                    "author": "sunsetglow14",
                    "id": "gofwccr",
                    "parent_id": "t1_gofvt7x",
                    "score": 6,
                    "created_utc": 1614069419.0,
                    "replies": []
                },
                {
                    "body": "think was like 35 pct of world population when i researched.",
                    "author": "Buckeyechamp21",
                    "id": "gogt5bx",
                    "parent_id": "t1_gofvt7x",
                    "score": 2,
                    "created_utc": 1614092899.0,
                    "replies": []
                },
                {
                    "body": "A standard STD panel doesn't test for HSV, anyway. You generally need an active outbreak to test for it, due to the high false-negative rate.",
                    "author": "fakemoose",
                    "id": "goh8sqy",
                    "parent_id": "t1_gofvt7x",
                    "score": 1,
                    "created_utc": 1614099387.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "gohah5w",
                            "parent_id": "t1_goh8sqy",
                            "score": 3,
                            "created_utc": 1614099999.0,
                            "replies": [
                                {
                                    "body": "Same here. I've also seen people talk about how HSV tests are super unreliable but when I research it the reliability of IgG tests are mid 90s and better. There are definitely older less reliable tests, and the gold standard would be to test an actual lesion.",
                                    "author": "emptyoverflow",
                                    "id": "gohzxe3",
                                    "parent_id": "t1_gohah5w",
                                    "score": 2,
                                    "created_utc": 1614110481.0,
                                    "replies": []
                                },
                                {
                                    "body": "If you go into the doctor's office in the US and just get your run of the mill STD test, it won't include HSV. You'd have to specifically ask for HSV, because the reliability of the test is so low without an active break-out present. And you don't really want to be handing out potentially false negative results. \n\nSemi-related, a lot of doctors won't include HIV either without explicitly asking for it to be done. Partly due to stigma, partly due to cost. \nIt blew my mind because when I lived outside the US, HIV was always included in a standard panel.",
                                    "author": "fakemoose",
                                    "id": "gohwvna",
                                    "parent_id": "t1_gohah5w",
                                    "score": 1,
                                    "created_utc": 1614109153.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gogq3op",
            "parent_id": "t3_lqdc4m",
            "score": 11,
            "created_utc": 1614091485.0,
            "replies": [
                {
                    "body": "Did you confront him about it? Did he know he had it?",
                    "author": "Fun_Focus8159",
                    "id": "gogset6",
                    "parent_id": "t1_gogq3op",
                    "score": 2,
                    "created_utc": 1614092557.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Thank you so much for this post 💗 I recently got out of a LTR and immediately got HSV after from a SA hookup. I felt like trash. I still feel like trash on some days when I think about it too much and when I read all the comments that stigmatize the hell out of this. \nBut your post inspires me to be transparent in my diagnosis with future partners. It’s going be hard... and some people are going to reject me for it... but honesty is so important to me and I don’t want to compromise my morals. \nTaking a break from dating now and taking time to process everything. Hopefully I’ll have accepting experiences once I have the courage to disclose to someone...",
            "author": "Sugarbby101",
            "id": "gogxhp0",
            "parent_id": "t3_lqdc4m",
            "score": 9,
            "created_utc": 1614094899.0,
            "replies": []
        },
        {
            "body": "Bravo, this is a value added post. As much as we all like seeing people argue for the 110x over whether or not a M&G should be paid or not, it is great to see thoughtful well thought out post that takes a position and uses their personal experience and evidence to support that position. Great post on a stigma that should be far less prevalent!",
            "author": "patienceisavirtue5",
            "id": "gohfvbw",
            "parent_id": "t3_lqdc4m",
            "score": 9,
            "created_utc": 1614101948.0,
            "replies": [
                {
                    "body": "Thank you so much :)",
                    "author": "sunsetglow14",
                    "id": "goi5iu3",
                    "parent_id": "t1_gohfvbw",
                    "score": 1,
                    "created_utc": 1614112685.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Thank you for posting this here ❤️ this is a post I'm going to come back to when things feel harder than they should.",
            "author": "Night-Intelligent",
            "id": "gognp02",
            "parent_id": "t3_lqdc4m",
            "score": 7,
            "created_utc": 1614090302.0,
            "replies": [
                {
                    "body": "Please don’t hesitate to message me anytime! I relied on internet strangers too when things were at their darkest <3",
                    "author": "sunsetglow14",
                    "id": "goi5o3s",
                    "parent_id": "t1_gognp02",
                    "score": 2,
                    "created_utc": 1614112741.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "A ex sgf had HSV; she told me about it even before we reached an arrangement.  she was straight up how she handled it and outbreaks, etc.  I never even knew much about it before but I did my research.  If careful the transmission rate was extremely low (like only 10 pct in a yr of fulltime couples and unprotected sex).  So based on research; her honesty and us having intermittent protected sex I felt comfortable being with her.",
            "author": "Buckeyechamp21",
            "id": "gogt038",
            "parent_id": "t3_lqdc4m",
            "score": 5,
            "created_utc": 1614092831.0,
            "replies": []
        },
        {
            "body": "Thank you for posting this and doing the emotional labor of supporting others. There is so much misinformation around herpes. Honestly, I think its the responsibility of everyone who is sexually active to do their part to end stigma. People who don't have herpes really need to listen when someone with herpes educates them. And people need to take responsibility and educate themselves when someone discloses. I don't have HSV 2 but I would 100% engage sexually with someone who was honest with me about their status and safety methods. Herpes stigma needs to end, and the onus is on HSV negative people to end it. Connecting with the human in front of me is so much more important to me then the very low risk of catching a mild skin nuisance.",
            "author": "pour_the_tea",
            "id": "gohiuyy",
            "parent_id": "t3_lqdc4m",
            "score": 4,
            "created_utc": 1614103112.0,
            "replies": []
        },
        {
            "body": "Great post btw! Also would like to add that it doesn’t even have to be transmitted through genital - genital sex, kissin/ oral sex/ or someone having a cold sore outbreak doesn’t wash their hands and simply touches you on your genitals, all of this can also fall into the asymptomatic category... unfortunately. This is specifically for the freaked out guys in this post: You know how you men love bj’s without condoms. \nSo yeah it’s way more easier to catch it in other ways than just regular sex. One of the reasons why people don’t even know they’re infected because it isn’t always via sex sex. Lots of high school/college wrestlers get it via these way. Suck a chick tits when your asymptotic, then she tity f**ks you... same result. So many variables. It’s far more easy to catch than we think sadly. Probably why dr.s don’t make it a priority to test unless requested.",
            "author": "Adventurous_Survey42",
            "id": "gohlohi",
            "parent_id": "t3_lqdc4m",
            "score": 4,
            "created_utc": 1614104319.0,
            "replies": []
        },
        {
            "body": "just to mention - hsv-2 and hsv-1 though they have location preference, and are often associated with one - hsv-2 to genital herpes and hsv-1 to oral - can actually be in any place and transmitted place to place! like your eyes, any open skin really. point being, rates of genital herpes could be (and most likely are) higher than listed here but be hsv-1 as hsv-1 is quite common. just remember when getting tested, it tells the strain but not the location.\n\nedit: this is a great, informative posts and highlights the importance of transparency for all 🤗",
            "author": "searchfete",
            "id": "gohppul",
            "parent_id": "t3_lqdc4m",
            "score": 4,
            "created_utc": 1614106039.0,
            "replies": [
                {
                    "body": "Yes thank you for adding!! I wasn’t clear about strains, but SO true about genital herpes rates being higher because of HSV-1!",
                    "author": "sunsetglow14",
                    "id": "goi634v",
                    "parent_id": "t1_gohppul",
                    "score": 5,
                    "created_utc": 1614112898.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Thank you for sharing your story and experience! :) <3",
            "author": "peachy731",
            "id": "gohmdt1",
            "parent_id": "t3_lqdc4m",
            "score": 3,
            "created_utc": 1614104620.0,
            "replies": []
        },
        {
            "body": "I appreciate you sharing this. HSV is common enough, and you're right -- the odds of encountering someone who has one of the variants is high. E.g. let's say someone is on seeking (or some other dating site) and dates 6 people. Very high odds that at least one of those people has at least HSV-1.",
            "author": "emptyoverflow",
            "id": "goi0n44",
            "parent_id": "t3_lqdc4m",
            "score": 2,
            "created_utc": 1614110801.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "goglrzt",
            "parent_id": "t3_lqdc4m",
            "score": 4,
            "created_utc": 1614089287.0,
            "replies": []
        },
        {
            "body": "Thank you for sharing your story!\n\nSome information, though...\n\nHSV-2 among the 14-49 crowd is <12% according to CDC (so obviously US only data). It's approximately 8% among caucasians (non-Hispanic whites to be precise) and <4% among Asians.\n\nIn other words, it's pretty uncommon.\n\nAsymptomatic viral shedding -- the way it's transmitted -- is happening 10% of the time. In other words, 10% of the time you look and feel fine... but you're contagious. It's twice as contagious during an outbreak, with 1 in 5 days being a viral shedding day.\n\nIn short, you can get HSV-2 from someone who seems fine. \n\nI'm glad you're finding willing partners. The risk of HSV-2 transmission is fairly high such as these things go. Someone with it on antivirals is definitely a lower risk. But I'm not sure it's fair to compare the risk to pregnancy for a lot of reasons.",
            "author": "marker3000",
            "id": "gog1s5j",
            "parent_id": "t3_lqdc4m",
            "score": -1,
            "created_utc": 1614074592.0,
            "replies": [
                {
                    "body": "Hey, thanks for your comment! I know about asymptomatic viral shedding :) I share all of that and more with my partners. I just didn’t write that in my post. Valtrex cuts that transmission risk in half. A 2016 study showed that condom use cuts transmission an additional 65% from women to men (and by 96% from men to women). Several birth control methods, because they aren’t taken 100% accurately, are about 91% effective.\n\nMy intention behind this post was not to minimize the risk, say it’s not a big deal to some folks, or promote misinformation. My point was also not to say it’s common. (You’re correct on the 12% - I was familiar with a higher stat from a few years ago). \n\nI understand personally the immense psychological toll this virus can have. I had a very, very difficult time. We see posts on here discussing it. When you have HSV, you hear negative comments ALL the time. I know people who have been suicidal after being diagnosed. \n\nKnowing how hard a diagnosis can be, the point of this post was to offer empowerment and share that HSV+ folks have a right to be here too (given they disclose and minimize risk). And no matter how much people play devil’s advocate or say, “But it’s still bad!” — there ARE partners who will be okay with it. Until you’ve been diagnosed with HSV, you really don’t understand how much you need to hear AND experience that. \n\nI’m sure some responses will try to play devil’s advocate, disparage HSV, or refute what I’m saying. But this post wasn’t intended for them. It’s intended to encourage those who are feeling disempowered or less than because of this virus. And to let them know that — even though some POTs might decline — they can put themselves out there and have success, just like everyone else.",
                    "author": "sunsetglow14",
                    "id": "gog5mhu",
                    "parent_id": "t1_gog1s5j",
                    "score": 19,
                    "created_utc": 1614078179.0,
                    "replies": [
                        {
                            "body": "I again wish you nothing but the best. And same to those others with HSV. Good luck in all things.",
                            "author": "marker3000",
                            "id": "goho34m",
                            "parent_id": "t1_gog5mhu",
                            "score": 0,
                            "created_utc": 1614105349.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "[removed]",
                    "author": null,
                    "id": "gohsk0t",
                    "parent_id": "t1_gog1s5j",
                    "score": 9,
                    "created_utc": 1614107262.0,
                    "replies": [
                        {
                            "body": "I wish this comment was higher!! Thank you for typing this all out! The transmission difference with antivirals/condoms between M—>F (2.5%) and F—>M (1%) were exactly what I’ve known too, I just couldn’t write it all out this morning before work. Might edit my post and add what you’ve written so it’s up top! Thank you <3",
                            "author": "sunsetglow14",
                            "id": "goi5ctq",
                            "parent_id": "t1_gohsk0t",
                            "score": 3,
                            "created_utc": 1614112618.0,
                            "replies": []
                        },
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "goi1gn8",
                            "parent_id": "t1_gohsk0t",
                            "score": 1,
                            "created_utc": 1614111120.0,
                            "replies": [
                                {
                                    "body": "[removed]",
                                    "author": null,
                                    "id": "goi6jza",
                                    "parent_id": "t1_goi1gn8",
                                    "score": 2,
                                    "created_utc": 1614113081.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": ">~~When you combine both HSV1 and 2, that's the majority of the population who has at least one strain of the virus.~~\n\n~~The reason you don't combine these probabilities is that on average the SD might well be carrying HSV-1... but that doesn't mean he wants HSV-2.~~\n\n~~And realistically, HSV-1 has a lower transmission risk if it's oral because there is scant (no?) evidence that absent an outbreak, you're shedding discernible HSV-1 from your mouth. In fact, I'd daresay if you there was asymptomatic shedding of oral HSV-1, it would be close to 100% in people over 50. And it isn't.~~\n\n~~Anyway, more information is good. And making informed choices is good.~~  \n\n\nEDIT: I now see I got downvote cabal for my post above containing factual CDC data. I have a strict rule of not participating in any threads attacked by the downvote cabal. Good luck to all.",
                            "author": "marker3000",
                            "id": "goiwq2c",
                            "parent_id": "t1_gohsk0t",
                            "score": 1,
                            "created_utc": 1614124960.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "IMO, I would double these rates for “very attractive” people. My experience is anecdotal, of course, but all the women I’ve known with HSV-2 have been unusually good-looking. I don’t have a real theory to explain that other than perhaps the fact that very attractive women tend to sleep with very attractive men, and very attractive men tend to get around.",
                    "author": "LaGriffeDuLion",
                    "id": "gog68to",
                    "parent_id": "t1_gog1s5j",
                    "score": 6,
                    "created_utc": 1614078724.0,
                    "replies": [
                        {
                            "body": "Very interesting comment and thesis. Intuitively, it makes a lot of sense also. The number of musicians, actors, athletes that have it always seemed high to me and I always chalked it up to more partners, so taking it to the next step that hot girls also are more likely is consistent. Especially in the tinder era when research shows good looking guys are far more sexually active than less good looking guys (delta has increased with time, which researchers say is due to dating apps, women's sexual preferences and men that will sleep with anyone).",
                            "author": "patienceisavirtue5",
                            "id": "gohi0t8",
                            "parent_id": "t1_gog68to",
                            "score": 4,
                            "created_utc": 1614102755.0,
                            "replies": []
                        },
                        {
                            "body": "Think its much easier for men to transmit to a woman than other way around.  It might be twice the transmission rate?  so fact woman has it doesnt mean she necessarily slept with a lot of people?",
                            "author": "Buckeyechamp21",
                            "id": "gohp37i",
                            "parent_id": "t1_gog68to",
                            "score": 2,
                            "created_utc": 1614105769.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "actually only 10 pct chance within yr of tramsmission.  studies of couples with 1 partner HSV and other not.",
                    "author": "Buckeyechamp21",
                    "id": "gogtdvu",
                    "parent_id": "t1_gog1s5j",
                    "score": 4,
                    "created_utc": 1614093010.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "You know it would probably depend how hot the girl was.  If she was extremely hot I’d still message her but if she was good but not great I’d pass",
            "author": "pussy_impaler337",
            "id": "gog1nqx",
            "parent_id": "t3_lqdc4m",
            "score": -12,
            "created_utc": 1614074472.0,
            "replies": []
        },
        {
            "body": "Did he know he had it?",
            "author": "Fun_Focus8159",
            "id": "gogsg8p",
            "parent_id": "t1_gog9v0r",
            "score": 5,
            "created_utc": 1614092575.0,
            "replies": [
                {
                    "body": "Yup he just lied to me evil man",
                    "author": "heyaheyaluna",
                    "id": "gogsj17",
                    "parent_id": "t1_gogsg8p",
                    "score": 7,
                    "created_utc": 1614092611.0,
                    "replies": [
                        {
                            "body": "I’m so sorry :/",
                            "author": "Fun_Focus8159",
                            "id": "gogsn04",
                            "parent_id": "t1_gogsj17",
                            "score": 5,
                            "created_utc": 1614092662.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Yes agreed! My point though was that people who have not been diagnosed are still reaching out and are okay with it :)",
            "author": "sunsetglow14",
            "id": "gofwccr",
            "parent_id": "t1_gofvt7x",
            "score": 6,
            "created_utc": 1614069419.0,
            "replies": []
        },
        {
            "body": "think was like 35 pct of world population when i researched.",
            "author": "Buckeyechamp21",
            "id": "gogt5bx",
            "parent_id": "t1_gofvt7x",
            "score": 2,
            "created_utc": 1614092899.0,
            "replies": []
        },
        {
            "body": "A standard STD panel doesn't test for HSV, anyway. You generally need an active outbreak to test for it, due to the high false-negative rate.",
            "author": "fakemoose",
            "id": "goh8sqy",
            "parent_id": "t1_gofvt7x",
            "score": 1,
            "created_utc": 1614099387.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "gohah5w",
                    "parent_id": "t1_goh8sqy",
                    "score": 3,
                    "created_utc": 1614099999.0,
                    "replies": [
                        {
                            "body": "Same here. I've also seen people talk about how HSV tests are super unreliable but when I research it the reliability of IgG tests are mid 90s and better. There are definitely older less reliable tests, and the gold standard would be to test an actual lesion.",
                            "author": "emptyoverflow",
                            "id": "gohzxe3",
                            "parent_id": "t1_gohah5w",
                            "score": 2,
                            "created_utc": 1614110481.0,
                            "replies": []
                        },
                        {
                            "body": "If you go into the doctor's office in the US and just get your run of the mill STD test, it won't include HSV. You'd have to specifically ask for HSV, because the reliability of the test is so low without an active break-out present. And you don't really want to be handing out potentially false negative results. \n\nSemi-related, a lot of doctors won't include HIV either without explicitly asking for it to be done. Partly due to stigma, partly due to cost. \nIt blew my mind because when I lived outside the US, HIV was always included in a standard panel.",
                            "author": "fakemoose",
                            "id": "gohwvna",
                            "parent_id": "t1_gohah5w",
                            "score": 1,
                            "created_utc": 1614109153.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Did you confront him about it? Did he know he had it?",
            "author": "Fun_Focus8159",
            "id": "gogset6",
            "parent_id": "t1_gogq3op",
            "score": 2,
            "created_utc": 1614092557.0,
            "replies": []
        },
        {
            "body": "Thank you so much :)",
            "author": "sunsetglow14",
            "id": "goi5iu3",
            "parent_id": "t1_gohfvbw",
            "score": 1,
            "created_utc": 1614112685.0,
            "replies": []
        },
        {
            "body": "Please don’t hesitate to message me anytime! I relied on internet strangers too when things were at their darkest <3",
            "author": "sunsetglow14",
            "id": "goi5o3s",
            "parent_id": "t1_gognp02",
            "score": 2,
            "created_utc": 1614112741.0,
            "replies": []
        },
        {
            "body": "Yes thank you for adding!! I wasn’t clear about strains, but SO true about genital herpes rates being higher because of HSV-1!",
            "author": "sunsetglow14",
            "id": "goi634v",
            "parent_id": "t1_gohppul",
            "score": 5,
            "created_utc": 1614112898.0,
            "replies": []
        },
        {
            "body": "Hey, thanks for your comment! I know about asymptomatic viral shedding :) I share all of that and more with my partners. I just didn’t write that in my post. Valtrex cuts that transmission risk in half. A 2016 study showed that condom use cuts transmission an additional 65% from women to men (and by 96% from men to women). Several birth control methods, because they aren’t taken 100% accurately, are about 91% effective.\n\nMy intention behind this post was not to minimize the risk, say it’s not a big deal to some folks, or promote misinformation. My point was also not to say it’s common. (You’re correct on the 12% - I was familiar with a higher stat from a few years ago). \n\nI understand personally the immense psychological toll this virus can have. I had a very, very difficult time. We see posts on here discussing it. When you have HSV, you hear negative comments ALL the time. I know people who have been suicidal after being diagnosed. \n\nKnowing how hard a diagnosis can be, the point of this post was to offer empowerment and share that HSV+ folks have a right to be here too (given they disclose and minimize risk). And no matter how much people play devil’s advocate or say, “But it’s still bad!” — there ARE partners who will be okay with it. Until you’ve been diagnosed with HSV, you really don’t understand how much you need to hear AND experience that. \n\nI’m sure some responses will try to play devil’s advocate, disparage HSV, or refute what I’m saying. But this post wasn’t intended for them. It’s intended to encourage those who are feeling disempowered or less than because of this virus. And to let them know that — even though some POTs might decline — they can put themselves out there and have success, just like everyone else.",
            "author": "sunsetglow14",
            "id": "gog5mhu",
            "parent_id": "t1_gog1s5j",
            "score": 19,
            "created_utc": 1614078179.0,
            "replies": [
                {
                    "body": "I again wish you nothing but the best. And same to those others with HSV. Good luck in all things.",
                    "author": "marker3000",
                    "id": "goho34m",
                    "parent_id": "t1_gog5mhu",
                    "score": 0,
                    "created_utc": 1614105349.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[removed]",
            "author": null,
            "id": "gohsk0t",
            "parent_id": "t1_gog1s5j",
            "score": 9,
            "created_utc": 1614107262.0,
            "replies": [
                {
                    "body": "I wish this comment was higher!! Thank you for typing this all out! The transmission difference with antivirals/condoms between M—>F (2.5%) and F—>M (1%) were exactly what I’ve known too, I just couldn’t write it all out this morning before work. Might edit my post and add what you’ve written so it’s up top! Thank you <3",
                    "author": "sunsetglow14",
                    "id": "goi5ctq",
                    "parent_id": "t1_gohsk0t",
                    "score": 3,
                    "created_utc": 1614112618.0,
                    "replies": []
                },
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "goi1gn8",
                    "parent_id": "t1_gohsk0t",
                    "score": 1,
                    "created_utc": 1614111120.0,
                    "replies": [
                        {
                            "body": "[removed]",
                            "author": null,
                            "id": "goi6jza",
                            "parent_id": "t1_goi1gn8",
                            "score": 2,
                            "created_utc": 1614113081.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": ">~~When you combine both HSV1 and 2, that's the majority of the population who has at least one strain of the virus.~~\n\n~~The reason you don't combine these probabilities is that on average the SD might well be carrying HSV-1... but that doesn't mean he wants HSV-2.~~\n\n~~And realistically, HSV-1 has a lower transmission risk if it's oral because there is scant (no?) evidence that absent an outbreak, you're shedding discernible HSV-1 from your mouth. In fact, I'd daresay if you there was asymptomatic shedding of oral HSV-1, it would be close to 100% in people over 50. And it isn't.~~\n\n~~Anyway, more information is good. And making informed choices is good.~~  \n\n\nEDIT: I now see I got downvote cabal for my post above containing factual CDC data. I have a strict rule of not participating in any threads attacked by the downvote cabal. Good luck to all.",
                    "author": "marker3000",
                    "id": "goiwq2c",
                    "parent_id": "t1_gohsk0t",
                    "score": 1,
                    "created_utc": 1614124960.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "IMO, I would double these rates for “very attractive” people. My experience is anecdotal, of course, but all the women I’ve known with HSV-2 have been unusually good-looking. I don’t have a real theory to explain that other than perhaps the fact that very attractive women tend to sleep with very attractive men, and very attractive men tend to get around.",
            "author": "LaGriffeDuLion",
            "id": "gog68to",
            "parent_id": "t1_gog1s5j",
            "score": 6,
            "created_utc": 1614078724.0,
            "replies": [
                {
                    "body": "Very interesting comment and thesis. Intuitively, it makes a lot of sense also. The number of musicians, actors, athletes that have it always seemed high to me and I always chalked it up to more partners, so taking it to the next step that hot girls also are more likely is consistent. Especially in the tinder era when research shows good looking guys are far more sexually active than less good looking guys (delta has increased with time, which researchers say is due to dating apps, women's sexual preferences and men that will sleep with anyone).",
                    "author": "patienceisavirtue5",
                    "id": "gohi0t8",
                    "parent_id": "t1_gog68to",
                    "score": 4,
                    "created_utc": 1614102755.0,
                    "replies": []
                },
                {
                    "body": "Think its much easier for men to transmit to a woman than other way around.  It might be twice the transmission rate?  so fact woman has it doesnt mean she necessarily slept with a lot of people?",
                    "author": "Buckeyechamp21",
                    "id": "gohp37i",
                    "parent_id": "t1_gog68to",
                    "score": 2,
                    "created_utc": 1614105769.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "actually only 10 pct chance within yr of tramsmission.  studies of couples with 1 partner HSV and other not.",
            "author": "Buckeyechamp21",
            "id": "gogtdvu",
            "parent_id": "t1_gog1s5j",
            "score": 4,
            "created_utc": 1614093010.0,
            "replies": []
        },
        {
            "body": "Yup he just lied to me evil man",
            "author": "heyaheyaluna",
            "id": "gogsj17",
            "parent_id": "t1_gogsg8p",
            "score": 7,
            "created_utc": 1614092611.0,
            "replies": [
                {
                    "body": "I’m so sorry :/",
                    "author": "Fun_Focus8159",
                    "id": "gogsn04",
                    "parent_id": "t1_gogsj17",
                    "score": 5,
                    "created_utc": 1614092662.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gohah5w",
            "parent_id": "t1_goh8sqy",
            "score": 3,
            "created_utc": 1614099999.0,
            "replies": [
                {
                    "body": "Same here. I've also seen people talk about how HSV tests are super unreliable but when I research it the reliability of IgG tests are mid 90s and better. There are definitely older less reliable tests, and the gold standard would be to test an actual lesion.",
                    "author": "emptyoverflow",
                    "id": "gohzxe3",
                    "parent_id": "t1_gohah5w",
                    "score": 2,
                    "created_utc": 1614110481.0,
                    "replies": []
                },
                {
                    "body": "If you go into the doctor's office in the US and just get your run of the mill STD test, it won't include HSV. You'd have to specifically ask for HSV, because the reliability of the test is so low without an active break-out present. And you don't really want to be handing out potentially false negative results. \n\nSemi-related, a lot of doctors won't include HIV either without explicitly asking for it to be done. Partly due to stigma, partly due to cost. \nIt blew my mind because when I lived outside the US, HIV was always included in a standard panel.",
                    "author": "fakemoose",
                    "id": "gohwvna",
                    "parent_id": "t1_gohah5w",
                    "score": 1,
                    "created_utc": 1614109153.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I again wish you nothing but the best. And same to those others with HSV. Good luck in all things.",
            "author": "marker3000",
            "id": "goho34m",
            "parent_id": "t1_gog5mhu",
            "score": 0,
            "created_utc": 1614105349.0,
            "replies": []
        },
        {
            "body": "I wish this comment was higher!! Thank you for typing this all out! The transmission difference with antivirals/condoms between M—>F (2.5%) and F—>M (1%) were exactly what I’ve known too, I just couldn’t write it all out this morning before work. Might edit my post and add what you’ve written so it’s up top! Thank you <3",
            "author": "sunsetglow14",
            "id": "goi5ctq",
            "parent_id": "t1_gohsk0t",
            "score": 3,
            "created_utc": 1614112618.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "goi1gn8",
            "parent_id": "t1_gohsk0t",
            "score": 1,
            "created_utc": 1614111120.0,
            "replies": [
                {
                    "body": "[removed]",
                    "author": null,
                    "id": "goi6jza",
                    "parent_id": "t1_goi1gn8",
                    "score": 2,
                    "created_utc": 1614113081.0,
                    "replies": []
                }
            ]
        },
        {
            "body": ">~~When you combine both HSV1 and 2, that's the majority of the population who has at least one strain of the virus.~~\n\n~~The reason you don't combine these probabilities is that on average the SD might well be carrying HSV-1... but that doesn't mean he wants HSV-2.~~\n\n~~And realistically, HSV-1 has a lower transmission risk if it's oral because there is scant (no?) evidence that absent an outbreak, you're shedding discernible HSV-1 from your mouth. In fact, I'd daresay if you there was asymptomatic shedding of oral HSV-1, it would be close to 100% in people over 50. And it isn't.~~\n\n~~Anyway, more information is good. And making informed choices is good.~~  \n\n\nEDIT: I now see I got downvote cabal for my post above containing factual CDC data. I have a strict rule of not participating in any threads attacked by the downvote cabal. Good luck to all.",
            "author": "marker3000",
            "id": "goiwq2c",
            "parent_id": "t1_gohsk0t",
            "score": 1,
            "created_utc": 1614124960.0,
            "replies": []
        },
        {
            "body": "Very interesting comment and thesis. Intuitively, it makes a lot of sense also. The number of musicians, actors, athletes that have it always seemed high to me and I always chalked it up to more partners, so taking it to the next step that hot girls also are more likely is consistent. Especially in the tinder era when research shows good looking guys are far more sexually active than less good looking guys (delta has increased with time, which researchers say is due to dating apps, women's sexual preferences and men that will sleep with anyone).",
            "author": "patienceisavirtue5",
            "id": "gohi0t8",
            "parent_id": "t1_gog68to",
            "score": 4,
            "created_utc": 1614102755.0,
            "replies": []
        },
        {
            "body": "Think its much easier for men to transmit to a woman than other way around.  It might be twice the transmission rate?  so fact woman has it doesnt mean she necessarily slept with a lot of people?",
            "author": "Buckeyechamp21",
            "id": "gohp37i",
            "parent_id": "t1_gog68to",
            "score": 2,
            "created_utc": 1614105769.0,
            "replies": []
        },
        {
            "body": "I’m so sorry :/",
            "author": "Fun_Focus8159",
            "id": "gogsn04",
            "parent_id": "t1_gogsj17",
            "score": 5,
            "created_utc": 1614092662.0,
            "replies": []
        },
        {
            "body": "Same here. I've also seen people talk about how HSV tests are super unreliable but when I research it the reliability of IgG tests are mid 90s and better. There are definitely older less reliable tests, and the gold standard would be to test an actual lesion.",
            "author": "emptyoverflow",
            "id": "gohzxe3",
            "parent_id": "t1_gohah5w",
            "score": 2,
            "created_utc": 1614110481.0,
            "replies": []
        },
        {
            "body": "If you go into the doctor's office in the US and just get your run of the mill STD test, it won't include HSV. You'd have to specifically ask for HSV, because the reliability of the test is so low without an active break-out present. And you don't really want to be handing out potentially false negative results. \n\nSemi-related, a lot of doctors won't include HIV either without explicitly asking for it to be done. Partly due to stigma, partly due to cost. \nIt blew my mind because when I lived outside the US, HIV was always included in a standard panel.",
            "author": "fakemoose",
            "id": "gohwvna",
            "parent_id": "t1_gohah5w",
            "score": 1,
            "created_utc": 1614109153.0,
            "replies": []
        },
        {
            "body": "[removed]",
            "author": null,
            "id": "goi6jza",
            "parent_id": "t1_goi1gn8",
            "score": 2,
            "created_utc": 1614113081.0,
            "replies": []
        }
    ]
}