{
    "title": "I was my SD's first SB, I fell for him, and he decided the world of sugar is not for him. (update)",
    "post_id": "lxq074",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/lxq074/i_was_my_sds_first_sb_i_fell_for_him_and_he/",
    "author": "CinnamonSugar39",
    "body": "I made a [post](https://www.reddit.com/r/sugarlifestyleforum/comments/luscbt/my_sd_ended_our_sr_because_he_says_i_made_it_too/) a few days ago about my SD (53M) dumping me SB (27F) after 3 months in a SR together. He claimed he was ending it because I \"made the relationship too surface-level\" and that I \"didn't appreciate anything\" he did. You can likely tell from my post that I had significantly accommodated in attempt to make this man happy, adjust to his schedule, make him feel cherished, etc. So I (and many commenters on my previous post) were puzzled by his alleged reason to end things and guessed he wasn't being entirely truthful. Anyway, I really fell for this guy. I liked him a lot, really respected/looked up to him, felt emotionally connected to him, had similar values/interests to his, could talk to him for hours and still want more, was extremely attracted to him and very satisfied with our sexual relationship, etc... I thought I had found the near-perfect SR. However, this was his first SR ever. He had never even dabbled in the world of sugar. \n\nSince I was so confused by his abrupt ending of our SR and vague reasoning that didn't really make sense, I pressed him for more details (I know, not the best, but I was heartbroken). I finally got him to give me a little bit more, and he admitted that he had decided sugar relationships in general are not for him, due to him feeling that the \"sugar\" component is a barrier to any SR progressing on a deeper level. I understand and respect this. SRs sure as hell are not the \"norm\", and it took me quite a while to become comfortable with this world myself.\n\nThis is more of a PSA/warning about falling for new-to-the-game SDs. I swore I'd always keep my SDs at arm's length, which was easy for me to do when my all of my previous SDs were married. I knew there was no future. However, I fell *hard* for this man, and it bit me in the ass. I've thought about him endlessly since he ended it, can I can't stop crying. I know it'll get easier, but I may be wary of pursuing first-time SDs in the future.",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/lxq074/i_was_my_sds_first_sb_i_fell_for_him_and_he/",
    "score": 99,
    "upvote_ratio": 0.96,
    "created_utc": 1614878777.0,
    "num_comments": 81,
    "links": [
        [
            "https://www.reddit.com/r/sugarlifestyleforum/comments/luscbt/my_sd_ended_our_sr_because_he_says_i_made_it_too/"
        ]
    ],
    "comments": [
        {
            "body": "Breakups are not unique to SR. Nor are unrequited feelings. That said most SR don’t end up in marriage so by definition they end. Most marriages end also. Most relationships end. Some people might get jaded. Learn what you are looking for and strive for that.",
            "author": "daddoms",
            "id": "gpoc56x",
            "parent_id": "t3_lxq074",
            "score": 34,
            "created_utc": 1614879681.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gpoim2v",
            "parent_id": "t3_lxq074",
            "score": 26,
            "created_utc": 1614882406.0,
            "replies": [
                {
                    "body": "Agree!! That's why I loved our SR so much. He got freaked :(",
                    "author": "CinnamonSugar39",
                    "id": "gpp18zq",
                    "parent_id": "t1_gpoim2v",
                    "score": 8,
                    "created_utc": 1614890170.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "gppa6kf",
                            "parent_id": "t1_gpp18zq",
                            "score": 3,
                            "created_utc": 1614893974.0,
                            "replies": [
                                {
                                    "body": "He did. I was extremely emotional when he was ending it and tried multiple times to get him back, which including me describing my feelings for him.",
                                    "author": "CinnamonSugar39",
                                    "id": "gppvmms",
                                    "parent_id": "t1_gppa6kf",
                                    "score": 5,
                                    "created_utc": 1614904305.0,
                                    "replies": [
                                        {
                                            "body": "[deleted]",
                                            "author": null,
                                            "id": "gppw0kq",
                                            "parent_id": "t1_gppvmms",
                                            "score": 3,
                                            "created_utc": 1614904504.0,
                                            "replies": [
                                                {
                                                    "body": "Yes, I told him often throughout our SR how I felt about him. We often would check in with one another about those kinds of things too.",
                                                    "author": "CinnamonSugar39",
                                                    "id": "gpq88qi",
                                                    "parent_id": "t1_gppw0kq",
                                                    "score": 2,
                                                    "created_utc": 1614910866.0,
                                                    "replies": [
                                                        {
                                                            "body": "[deleted]",
                                                            "author": null,
                                                            "id": "gpqu0c0",
                                                            "parent_id": "t1_gpq88qi",
                                                            "score": 0,
                                                            "created_utc": 1614923792.0,
                                                            "replies": [
                                                                {
                                                                    "body": "I didn’t ever tell him i was “attached” to him. That just sounds dumb. I just said to you in my previous comments that I professed my feelings for him. *You* used the word “attachment,” kind sir.",
                                                                    "author": "CinnamonSugar39",
                                                                    "id": "gprkgfi",
                                                                    "parent_id": "t1_gpqu0c0",
                                                                    "score": 2,
                                                                    "created_utc": 1614946683.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "Or he‘s dismissive avoidant and thought it got too deep for him? Just a guess",
                            "author": "ok-person-at-eating",
                            "id": "gpp4np5",
                            "parent_id": "t1_gpp18zq",
                            "score": 4,
                            "created_utc": 1614891594.0,
                            "replies": [
                                {
                                    "body": "Ooooh now we’re getting psychoanalytical. I like it 😏",
                                    "author": "CinnamonSugar39",
                                    "id": "gppvj4q",
                                    "parent_id": "t1_gpp4np5",
                                    "score": 5,
                                    "created_utc": 1614904257.0,
                                    "replies": [
                                        {
                                            "body": "love it! okay so here is my more elaborate guess: he's dismissive avoidant (which likely comes with narcissistic traits). took up SR because he thought it would be distanced enough. turns out it's not as SB developed feelings and SR got quite intimate. Gaslights SB into it being \"too superficial\" (i.e. also being her fault). Comes up with excuses that \"SR is not for him\" meaning it's not for him with *her*.",
                                            "author": "ok-person-at-eating",
                                            "id": "gpr43f5",
                                            "parent_id": "t1_gppvj4q",
                                            "score": 1,
                                            "created_utc": 1614932173.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Good share.\nI do wanna add that this is a very common occurrence for SBs also. Lot of them join the world of SR by getting influenced by Internet or a friend. It sounds like a great Idea to them at the beginning but after a couple of meets, they try to doubt if this lifestyle is right for them, and then disappear. \nHs happened to me once, she was really great, we bonded well, had lunches, dinners, intimacy was great too, but she started having doubts of the whole sugaring thing, and she came clean with me about those thoughts. We still text and stay in touch but the SR ended a couple of months in...",
            "author": "chamdigiri",
            "id": "gpodlv9",
            "parent_id": "t3_lxq074",
            "score": 10,
            "created_utc": 1614880307.0,
            "replies": [
                {
                    "body": "I’m sorry that happened to you. It’s nice that you two are still able to keep in touch. 🙂 Thanks for sharing!",
                    "author": "CinnamonSugar39",
                    "id": "gpokrka",
                    "parent_id": "t1_gpodlv9",
                    "score": 5,
                    "created_utc": 1614883312.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "sorry to hear that.  It sucks I have been in same position last few months...she took multiple chunks of my heart on separate occasions.\n\nI would like to tell you just move on and dont look back; but easier said than done ;-(",
            "author": "Buckeyechamp21",
            "id": "gpolc4y",
            "parent_id": "t3_lxq074",
            "score": 6,
            "created_utc": 1614883550.0,
            "replies": [
                {
                    "body": "Thanks, dear. Hang in there!",
                    "author": "CinnamonSugar39",
                    "id": "gpp156r",
                    "parent_id": "t1_gpolc4y",
                    "score": 4,
                    "created_utc": 1614890127.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I am so so sorry. I think this is probably a pretty common thing as I had a similar experience so I think your warning post is actually probably helpful. \n\nI met an SD new to the scene who was basically perfect. He was so so smart and interesting and I found him incredibly attractive. We went on one date where we talked for 5 hours about philosophy and I was basically in heaven....then after date he texted me and said it made him realize SRs are too transactional bc he would never know if I actually liked him. He offered to take me on a vanilla date and I had to say no since I knew I wouldn’t be able to give him the time/attention he deserved because I was actively pursuing an SR. Broke my heart a bit honestly. Wishing you lots of luck love ❤️",
            "author": "kitkatklubber",
            "id": "gpp1jfj",
            "parent_id": "t3_lxq074",
            "score": 5,
            "created_utc": 1614890295.0,
            "replies": [
                {
                    "body": "I am generally pessemistic about taking an SR public because the age difference tends to be off-putting to both persons friends. However there is always a temptation to offer a Vanilla option because its easier to loan my SB a nice car and treat her to nice dinners than it is to give her a generous allowance. If only my current live in GF who is my own age range wouldnt murder me in my sleep right?",
                    "author": "squareC1999",
                    "id": "gpp6bfi",
                    "parent_id": "t1_gpp1jfj",
                    "score": 2,
                    "created_utc": 1614892290.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I am skeptical about what he is saying - that because there is money involved that something deeper cannot happen.  Plus, what would he be expecting given the age gap?   Wonder if he was hoping you would agree to keep seeing him without an allowance.  \n\nI see this theme a lot, where the SD bails for the excuse that money is polluting the relationship.   My view is that in sugar relationships with this large of an age gap, there is no real “future”.  BUT, that doesn’t mean that one cannot have a deep connection with the SB, while at the same time being happy to support her financially.   Someone that tries to paint the two as being mutually exclusive strikes me as having an ulterior motive.  \n\nGuess I am in a cynical mood today.",
            "author": "MrBuzzard",
            "id": "gppclb0",
            "parent_id": "t3_lxq074",
            "score": 7,
            "created_utc": 1614895035.0,
            "replies": [
                {
                    "body": "What’s interesting is that he seemed to think the age gap was totally normal. He even told his teenage kids about me and how old I am. I almost exclusively date much older men, even in past vanilla relationships, so I’m not really phased by age gaps either. However, he was the largest age gap I’ve had.",
                    "author": "CinnamonSugar39",
                    "id": "gppwf1z",
                    "parent_id": "t1_gppclb0",
                    "score": 3,
                    "created_utc": 1614904716.0,
                    "replies": []
                },
                {
                    "body": "I agree, he wanted it “free” 😒",
                    "author": "MedusaYHLQMDLG85",
                    "id": "gppjt7c",
                    "parent_id": "t1_gppclb0",
                    "score": 4,
                    "created_utc": 1614898381.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "gpq59e1",
                            "parent_id": "t1_gppjt7c",
                            "score": -1,
                            "created_utc": 1614909298.0,
                            "replies": [
                                {
                                    "body": "Reread her first paragraph. He is full of it, if what she said is true then he most certainly did. She dodged a bullet.",
                                    "author": "MedusaYHLQMDLG85",
                                    "id": "gpq81cv",
                                    "parent_id": "t1_gpq59e1",
                                    "score": 1,
                                    "created_utc": 1614910759.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I don’t think you can stereotype all first time SD’s like that. It’s just as likely he found another SB that he liked better. Any semi attractive SD on SA will have tons of options and women messaging him left and right. \n\nI think a better lesson is don’t get too attached to your SD or SB Because the SR is likely to end sooner than later.",
            "author": "Fun_Focus8159",
            "id": "gpodhpg",
            "parent_id": "t3_lxq074",
            "score": 5,
            "created_utc": 1614880258.0,
            "replies": [
                {
                    "body": "Oh that totally was not my intention! I just more so meant I’ll be a little more skeptical early on with first timers.",
                    "author": "CinnamonSugar39",
                    "id": "gpokg3l",
                    "parent_id": "t1_gpodhpg",
                    "score": 4,
                    "created_utc": 1614883179.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "It isn't mentioned in your post: would you vanilla date him?  Did that come up at any point?",
            "author": "Gemini-Fox",
            "id": "gpoddbf",
            "parent_id": "t3_lxq074",
            "score": 4,
            "created_utc": 1614880206.0,
            "replies": [
                {
                    "body": "I’m not in a place where I want to vanilla date anyone. But he also didn’t give me that option, so kind of irrelevant anyway.",
                    "author": "CinnamonSugar39",
                    "id": "gpokl7o",
                    "parent_id": "t1_gpoddbf",
                    "score": 5,
                    "created_utc": 1614883238.0,
                    "replies": [
                        {
                            "body": "You do not want to date this man, in any capacity. I know you’re heartbroken, but as time goes on and these raw feelings subside, you’ll see this more clearly. You said in a comment on your first post that you have a tendency to be attracted to toxic, narcissistic men. He is both of those things. You’re feeling this way because he love bombed you in the beginning and then abruptly gaslit and discarded you. He will do it again, if given the chance. I think his excuse is bologna, and he’ll find a younger and more inexperienced SB, soon. He’ll play the same games because it’s all he knows how to do. Please, stop blaming yourself. He set you up to let you down.",
                            "author": "FoxyFreckles1989",
                            "id": "gpp7js6",
                            "parent_id": "t1_gpokl7o",
                            "score": 5,
                            "created_utc": 1614892823.0,
                            "replies": []
                        },
                        {
                            "body": "You can always approach anyone at any time about vanilla dating.  Don't see why you would be so upset about losing him, yet would not consider vanilla dating him.  If you did date him in a vanilla way, it may possibly end up much like a sugar relationship.  Keep in touch with him.",
                            "author": "HappyBear1952",
                            "id": "gpomgl4",
                            "parent_id": "t1_gpokl7o",
                            "score": 6,
                            "created_utc": 1614884024.0,
                            "replies": [
                                {
                                    "body": "I'm not in a place where I can date anyone vanilla... Can't really elaborate more. But I do get what you're saying. He doesn't really want to be involved with me, though. He's pretty freaked out over the whole sugar thing in general.",
                                    "author": "CinnamonSugar39",
                                    "id": "gpp0ogx",
                                    "parent_id": "t1_gpomgl4",
                                    "score": 6,
                                    "created_utc": 1614889932.0,
                                    "replies": []
                                },
                                {
                                    "body": "Also, I would consider dating him vanilla, but I’d be simultaneously actively pursuing a SR, and he would want monogamy.",
                                    "author": "CinnamonSugar39",
                                    "id": "gppvv7f",
                                    "parent_id": "t1_gpomgl4",
                                    "score": 2,
                                    "created_utc": 1614904427.0,
                                    "replies": []
                                },
                                {
                                    "body": "This is horrible advice. You have absolutely no reason to believe that were she to date him in a vanilla way, it would end up like a sugar relationship. He was demanding, inconsiderate, controlling, selfish and unrealistic. He displayed narcissistic traits from the start. Keeping in touch with him will only extend her heartache.",
                                    "author": "FoxyFreckles1989",
                                    "id": "gpp7ox1",
                                    "parent_id": "t1_gpomgl4",
                                    "score": 5,
                                    "created_utc": 1614892885.0,
                                    "replies": [
                                        {
                                            "body": "Aren't all SDs like that?",
                                            "author": "JeaneyBowl",
                                            "id": "gppjeod",
                                            "parent_id": "t1_gpp7ox1",
                                            "score": 4,
                                            "created_utc": 1614898192.0,
                                            "replies": [
                                                {
                                                    "body": "[deleted]",
                                                    "author": null,
                                                    "id": "gpq5lpo",
                                                    "parent_id": "t1_gppjeod",
                                                    "score": 4,
                                                    "created_utc": 1614909479.0,
                                                    "replies": [
                                                        {
                                                            "body": "She’s referring to my previous post, which is linked in this post.",
                                                            "author": "CinnamonSugar39",
                                                            "id": "gpq8jab",
                                                            "parent_id": "t1_gpq5lpo",
                                                            "score": 2,
                                                            "created_utc": 1614911017.0,
                                                            "replies": [
                                                                {
                                                                    "body": "I think u/swagsoiree was responding to the user that asked me if all SDs are “like that.”",
                                                                    "author": "FoxyFreckles1989",
                                                                    "id": "gpqd0tu",
                                                                    "parent_id": "t1_gpq8jab",
                                                                    "score": 1,
                                                                    "created_utc": 1614913379.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "Yes, exactly.",
                                                                            "author": null,
                                                                            "id": "gpqf6zg",
                                                                            "parent_id": "t1_gpqd0tu",
                                                                            "score": 2,
                                                                            "created_utc": 1614914568.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "Oh, sorry!",
                                                                                    "author": "CinnamonSugar39",
                                                                                    "id": "gpqg87g",
                                                                                    "parent_id": "t1_gpqf6zg",
                                                                                    "score": 2,
                                                                                    "created_utc": 1614915146.0,
                                                                                    "replies": [
                                                                                        {
                                                                                            "body": "Was just trying to help clarify! 😊",
                                                                                            "author": "FoxyFreckles1989",
                                                                                            "id": "gpqj3ql",
                                                                                            "parent_id": "t1_gpqg87g",
                                                                                            "score": 1,
                                                                                            "created_utc": 1614916773.0,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "body": "Yes! Thank you, love. 💗",
                                                                                                    "author": "CinnamonSugar39",
                                                                                                    "id": "gpqjbj8",
                                                                                                    "parent_id": "t1_gpqj3ql",
                                                                                                    "score": 2,
                                                                                                    "created_utc": 1614916897.0,
                                                                                                    "replies": []
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "body": "No! Gosh, no. I’m so sorry that your experience has apparently led you to believe so? There are so many incredible, kind and generous SDs out there.",
                                                    "author": "FoxyFreckles1989",
                                                    "id": "gppncx2",
                                                    "parent_id": "t1_gppjeod",
                                                    "score": 1,
                                                    "created_utc": 1614900113.0,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "body": "Based on the link to other post I agree with you 💯 %",
                                            "author": "sugarbooger1988",
                                            "id": "gpqapj1",
                                            "parent_id": "t1_gpp7ox1",
                                            "score": 2,
                                            "created_utc": 1614912144.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "[deleted]",
                                            "author": null,
                                            "id": "gpq5ijy",
                                            "parent_id": "t1_gpp7ox1",
                                            "score": 1,
                                            "created_utc": 1614909433.0,
                                            "replies": [
                                                {
                                                    "body": "Read the original post that she linked.",
                                                    "author": "FoxyFreckles1989",
                                                    "id": "gpq9vgr",
                                                    "parent_id": "t1_gpq5ijy",
                                                    "score": 0,
                                                    "created_utc": 1614911714.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "This is a really good time to assess boundaries going forward with other SDs and to not seek emotional resources from people. Take as much time as you need to heal and see your own value so you'll never have to question what you contribute again.",
            "author": null,
            "id": "gppstjw",
            "parent_id": "t3_lxq074",
            "score": 2,
            "created_utc": 1614902891.0,
            "replies": []
        },
        {
            "body": "I totally got you. You really like him, but need sugar to be fine in your life.\nYou just need another SD, I suppose. This one is not willing to understand it. \n\nI am seriously wondered for some SDs thinking about going vanilla/without allowance to prove the feeling... Hey, guys.. That's a great idea for you, when you have all these money... But for a SB... She will literally have to survive somehow... She may have these feelings, but has to pay her bills somehow (and official job is mostly not enough for that... Especially, with covid impact)... Are you fine  with seeing her starving? That's how your feelings are?.... If she goes vanilla with you, she will have to get these money from somewhere (more likely somebody) else...",
            "author": "Gigi9662",
            "id": "gpr8iih",
            "parent_id": "t3_lxq074",
            "score": 2,
            "created_utc": 1614936093.0,
            "replies": [
                {
                    "body": "Yes! It’s also extremely manipulative for the SD to actively pursue a SR, knowing the woman he is pursuing is also looking for a SR, then months later try to manipulate her into vanilla after she’s already gotten used to the financial support. He told me from the start that he “doesn’t have the time and dedication that is required for traditional relationships” which is why he pursued sugar. What happened to having no time for vanilla? All the sudden you have time? I don’t buy it. I think these types of men are master manipulators/borderline sociopaths.",
                    "author": "CinnamonSugar39",
                    "id": "gprk9q1",
                    "parent_id": "t1_gpr8iih",
                    "score": 2,
                    "created_utc": 1614946542.0,
                    "replies": [
                        {
                            "body": "Yes, manipulators not willing to understand...\nFor me, if man loves/develops more feelings, he should increase his care, not to cut it off....\n\nYou will find a better one. This one doesn't worth it.",
                            "author": "Gigi9662",
                            "id": "gprks4t",
                            "parent_id": "t1_gprk9q1",
                            "score": 1,
                            "created_utc": 1614946926.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Thanks for updating us on your experience. Sorry you are going (went) through this. Take good care of yourself. There is someone else out there for you.",
            "author": "BlBl_SD",
            "id": "gpthw0n",
            "parent_id": "t3_lxq074",
            "score": 2,
            "created_utc": 1614979630.0,
            "replies": [
                {
                    "body": "Thank you! You are very kind. 🙂",
                    "author": "CinnamonSugar39",
                    "id": "gpu0h08",
                    "parent_id": "t1_gpthw0n",
                    "score": 1,
                    "created_utc": 1614989197.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "My worthless 2 cents is that he may have realized he can choose from a wide variety of girls and regrets getting so involved with his first SB. I know that is a shitty thing to suggest, but it seems to be the reality in this lifestyle.",
            "author": "squareC1999",
            "id": "gpp3ju4",
            "parent_id": "t3_lxq074",
            "score": 4,
            "created_utc": 1614891133.0,
            "replies": [
                {
                    "body": "Agree, if you’re not going to fall in love and have something committed (vanilla relationship) *and* are paying for time with a SB, it’s easy to move to the next SB who looks like the exciting new prospect.",
                    "author": null,
                    "id": "gpp6ag5",
                    "parent_id": "t1_gpp3ju4",
                    "score": 2,
                    "created_utc": 1614892278.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gpoojnh",
            "parent_id": "t3_lxq074",
            "score": 3,
            "created_utc": 1614884895.0,
            "replies": [
                {
                    "body": "Eh, but I wasn't pretending and I think I made that pretty obvious based on the attention I dedicated to him.",
                    "author": "CinnamonSugar39",
                    "id": "gpp144b",
                    "parent_id": "t1_gpoojnh",
                    "score": 4,
                    "created_utc": 1614890114.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "gpp3xk4",
                            "parent_id": "t1_gpp144b",
                            "score": -1,
                            "created_utc": 1614891292.0,
                            "replies": [
                                {
                                    "body": "I’d consider it, but I’d be simultaneously actively pursuing a SR, and he would want monogamy.",
                                    "author": "CinnamonSugar39",
                                    "id": "gppvolw",
                                    "parent_id": "t1_gpp3xk4",
                                    "score": 2,
                                    "created_utc": 1614904333.0,
                                    "replies": []
                                },
                                {
                                    "body": "You won’t pay someone to be your wife?  We all pay.  Even with a pre nuptial agreement they are still going to get paid after ten years",
                                    "author": "pussy_impaler337",
                                    "id": "gprmzgd",
                                    "parent_id": "t1_gpp3xk4",
                                    "score": 1,
                                    "created_utc": 1614948481.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "gpovxey",
                    "parent_id": "t1_gpoojnh",
                    "score": 4,
                    "created_utc": 1614887914.0,
                    "replies": [
                        {
                            "body": "Not sure I’m following. How is it easy to tell if someone loves you or your money? Are you saying you can tell based on allowance amount? \n\nTo me, the only way to know if they’re there because they love you is if they’d date you without being handed stacks of cash. If they need that to keep seeing you, they’re there for the money.",
                            "author": null,
                            "id": "gpp4myc",
                            "parent_id": "t1_gpovxey",
                            "score": 1,
                            "created_utc": 1614891585.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "gpp7wmb",
                                    "parent_id": "t1_gpp4myc",
                                    "score": 1,
                                    "created_utc": 1614892975.0,
                                    "replies": [
                                        {
                                            "body": "Oh I wouldn’t try making a sugar relationship vanilla at the start. I have paid my SBs for months or years before I’ve considered dating them vanilla (if it was even a possibility). After they have five figures or more from you, they generally know you’re not a scammer. You’re right that you want to be clear you’re not trying to “get her for free” at the beginning though",
                                            "author": null,
                                            "id": "gppc55n",
                                            "parent_id": "t1_gpp7wmb",
                                            "score": 2,
                                            "created_utc": 1614894835.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Also, when it's an older guy and a really attractive younger lady it's possible to imagine all sort of unrealistic relationship possibilities. Sometimes it just isnt practical to bring a fantasy life out into public if you know what I mean. The Movie Pretty Woman isnt a plan if you know what i mean.",
                    "author": "squareC1999",
                    "id": "gpp592u",
                    "parent_id": "t1_gpoojnh",
                    "score": 2,
                    "created_utc": 1614891837.0,
                    "replies": [
                        {
                            "body": "Exactly, this is another reason why not to catch strong feelings and try to make it a serious relationship when it’s just sugar. Obviously care for your SB, develop a bond, but for the reasons you’ve raised (and others), don’t try making her your wife,GF, etc if she is there for the money. \n\nLet sugar be sugar",
                            "author": null,
                            "id": "gpp6rvz",
                            "parent_id": "t1_gpp592u",
                            "score": 2,
                            "created_utc": 1614892486.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "This reminds me of people who say they love their job. I always ask, would you do it for free? Because if the answer is no, you don't really love your job.\n\nYou have a real connection with your SD? Would you date him if there was no sugar? If the answer is no, you didn't really have a connection.",
            "author": "wildhorses6565",
            "id": "gppxwke",
            "parent_id": "t3_lxq074",
            "score": 3,
            "created_utc": 1614905485.0,
            "replies": [
                {
                    "body": "My life isn’t in a place that would foster a healthy vanilla relationship. I’d consider it, but I would actively be pursuing a SR simultaneously, and he would want monogamy.",
                    "author": "CinnamonSugar39",
                    "id": "gpq9csi",
                    "parent_id": "t1_gppxwke",
                    "score": 1,
                    "created_utc": 1614911441.0,
                    "replies": []
                },
                {
                    "body": "Thisssss",
                    "author": "GetThatBread06",
                    "id": "gpq8aur",
                    "parent_id": "t1_gppxwke",
                    "score": 1,
                    "created_utc": 1614910895.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Sooo you dont want to give up being an SB to just be with him? I mean if you truly are into this guy and seems like in love with him.. why not just be with him?",
            "author": "BcbornLeo",
            "id": "gpqctny",
            "parent_id": "t3_lxq074",
            "score": 2,
            "created_utc": 1614913271.0,
            "replies": [
                {
                    "body": "I’m in a situation where being a SB is necessary.",
                    "author": "CinnamonSugar39",
                    "id": "gpqgbj8",
                    "parent_id": "t1_gpqctny",
                    "score": 3,
                    "created_utc": 1614915198.0,
                    "replies": [
                        {
                            "body": "Just asking if that was something that was possible, too bad it didn't work out. Im sure you will find a new match soon!",
                            "author": "BcbornLeo",
                            "id": "gpqhm2j",
                            "parent_id": "t1_gpqgbj8",
                            "score": 0,
                            "created_utc": 1614915922.0,
                            "replies": [
                                {
                                    "body": "Thank you!",
                                    "author": "CinnamonSugar39",
                                    "id": "gpqjeqs",
                                    "parent_id": "t1_gpqhm2j",
                                    "score": 2,
                                    "created_utc": 1614916948.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Not sure he's entirely wrong... would you agree to skip the sugar and become his GF?",
            "author": "JeaneyBowl",
            "id": "gpoif2l",
            "parent_id": "t3_lxq074",
            "score": 2,
            "created_utc": 1614882326.0,
            "replies": [
                {
                    "body": "Didn't say he was wrong! Feelings aren't wrong or right. Sugar relationships certainly are not for everyone, either. And no, I wouldn't date him vanilla because I'm not in a place where I want to date *anyone* vanilla. Also, he didn't give that option anyway.",
                    "author": "CinnamonSugar39",
                    "id": "gpp0y71",
                    "parent_id": "t1_gpoif2l",
                    "score": 5,
                    "created_utc": 1614890044.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "gpp5so8",
                            "parent_id": "t1_gpp0y71",
                            "score": 5,
                            "created_utc": 1614892068.0,
                            "replies": [
                                {
                                    "body": "Not sure I’m following you when you say I was driven by sugar. I stated here several times that I really enjoyed him and developed strong feelings for him.",
                                    "author": "CinnamonSugar39",
                                    "id": "gpq8t2c",
                                    "parent_id": "t1_gpp5so8",
                                    "score": 2,
                                    "created_utc": 1614911158.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Didn’t say he was wrong! Feelings aren’t wrong or right anyway. Sugar relationships certainly are not for everyone. \nAnd no, because I’m not in a place where I want to date anyone vanilla right now. And he didn’t give me that option anyway.",
                    "author": "CinnamonSugar39",
                    "id": "gpokyzw",
                    "parent_id": "t1_gpoif2l",
                    "score": 1,
                    "created_utc": 1614883399.0,
                    "replies": [
                        {
                            "body": "Meeting summary:  \n\n\n\\- \"I really fell for this guy. I liked him a lot, really respected/looked up to him, felt emotionally connected to him, had similar values/interests to his, could talk to him for hours and still want more, was extremely attracted to him and very satisfied with our sexual relationship, etc... \"  \n\n\n\\-  Maybe date him?  \n\n\n\\- \"I’m not in a place where I want to date anyone vanilla right now \"",
                            "author": "JeaneyBowl",
                            "id": "gpoycwj",
                            "parent_id": "t1_gpokyzw",
                            "score": 1,
                            "created_utc": 1614888947.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I think sugar works great as part of a well balanced meal.  Many SDs are married so the sugar is appreciated for what it is.  They have wives for deeper emotional connections and SBs for fun.  A balanced SR can last a long time.  NOTE: balance works both ways.  The SB benefits from having a deep connection as well.\n\nI had a few years I went through a period when I was single and only subsisting on sugar...no vanilla in sight.   My memories of that time are awesome and at times I regret moving on to a new marriage.  But the reality of the time was different.  I was still incredibly lonely despite hooking up several days per week.  My sex life was awesome, but my personal and social life was shit.  Romance is so much more than humping.\n\nI recall that my main SB during my sexual revolution was really hurt when I would mention the various vanilla dates I was experiencing.  I had her...why was I constantly on the prowl for the next Mrs. Philly?   Why didn't I consider her for the position?  Fair questions with few answers.  For some reason, I couldn't consider any SBs, despite true loving feelings for them.  My hang ups, not any of theirs.",
            "author": "sdphilly",
            "id": "gpohj5n",
            "parent_id": "t3_lxq074",
            "score": 2,
            "created_utc": 1614881959.0,
            "replies": [
                {
                    "body": "I, too, would be pretty upset if I heard my SD talk about vanilla dates. Do you by chance have a tinge of Madonna-whore complex? Not asking offensively, just wondering why you so strictly separate emotional connection from sex.",
                    "author": "CinnamonSugar39",
                    "id": "gpq964e",
                    "parent_id": "t1_gpohj5n",
                    "score": 2,
                    "created_utc": 1614911346.0,
                    "replies": [
                        {
                            "body": "Worth looking into.  My first marriage was a bit chilly until my wife and I began exploring my fantasies.  She pushed me to become more passionate. It worked.  We unlocked a fire storm...a 2nd honeymoon that lasted over a year. My satisfaction level was through the roof, as was hers, for a while.  At some point her energy dropped and she found 'like' with another guy.  She left me with 3 young kids.  \n\nI found the sugar world shortly thereafter.  It fit my schedule and afforded intimacy without emotional connection...which was a good thing after my 17 year marriage ended.  I was in a very bad place back then.  Sugar was safety.\n\nWhen I consider all the longer term sugar relationships I've had...there are a few that could have converted to vanilla.  Two of those ended when the SB got engaged to their own vanilla guy.  My current SB could easily go vanilla...but she is married with kids, so no bueno there, for now.  The SBs that wouldn't make my cut all had obvious trip wires...drug abuse, lesbian vanilla partners, younger than my kids, higher maintenance than I could provide....\n\nI read the wiki on that Madonna-whore complex.  There is some truth to that.  When we were having kids our lives were very hectic.  Finding time for ourselves was difficult.  Sadly, just as the domestic duties got easier, my wife left.",
                            "author": "sdphilly",
                            "id": "gps3bn4",
                            "parent_id": "t1_gpq964e",
                            "score": 1,
                            "created_utc": 1614957209.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I'm so sorry, I went through this yesterday as well. He was a first-timer genuinely looking for casual sex (was not communicated) gave me a super high PPM the first date but then realized he actually liked me and decided he couldn't pay me otherwise our connection would seem inauthentic. Then he tried to vanilla date me without much communication about not wanting an arrangement anymore and it fell apart from there. It is really disappointing but remember that the money was what probably drew you to him and that if this were to go away, maybe you wouldn't have liked him as much. It sucks to say, but that's the reality I'm seeing. I hope you're able to move on and find someone special that is interested in how SRs actually work. ❤️",
            "author": "spearmiint88",
            "id": "gpp7qz9",
            "parent_id": "t3_lxq074",
            "score": 1,
            "created_utc": 1614892910.0,
            "replies": []
        },
        {
            "body": "Are open to vanilla dating him? Is he open to it?",
            "author": null,
            "id": "gppdpor",
            "parent_id": "t3_lxq074",
            "score": 1,
            "created_utc": 1614895539.0,
            "replies": [
                {
                    "body": "I’d consider it, but I’d be simultaneously actively pursuing a SR, and he would want monogamy.",
                    "author": "CinnamonSugar39",
                    "id": "gppvbjp",
                    "parent_id": "t1_gppdpor",
                    "score": 3,
                    "created_utc": 1614904151.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Would you have been opening to evolving this into a real relationship if the sugar continued?",
            "author": "CryptoAustinSD",
            "id": "gppc7kd",
            "parent_id": "t3_lxq074",
            "score": 0,
            "created_utc": 1614894864.0,
            "replies": [
                {
                    "body": "But the sugar aspect is what he’s hung up on. It was a real relationship essentially + sugar.",
                    "author": "CinnamonSugar39",
                    "id": "gppvg7x",
                    "parent_id": "t1_gppc7kd",
                    "score": 2,
                    "created_utc": 1614904217.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[removed]",
            "author": null,
            "id": "gpoe9ks",
            "parent_id": "t3_lxq074",
            "score": -5,
            "created_utc": 1614880585.0,
            "replies": [
                {
                    "body": "Lmao",
                    "author": "chamdigiri",
                    "id": "gpognrn",
                    "parent_id": "t1_gpoe9ks",
                    "score": 2,
                    "created_utc": 1614881598.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Sugar does change the dynamic of a relationship.\nI don’t think avoiding first time SD’S will always work.\n\nI had some NSA when I started, they were mostly fun.\nNow 18 months into a very emotionally close relationship and I still have those feelings re allowance.\nShe says she would keep me as a close friend  if the allowance stopped. My concern is living in an expensive city she really needs it to get by.\n\nMy thoughts maybe more likely to be an issue with new SD’S can still happen to longer term / experienced ones.\nHey best wishes you find someone",
            "author": "sydsyd3",
            "id": "gpqsdon",
            "parent_id": "t3_lxq074",
            "score": 1,
            "created_utc": 1614922626.0,
            "replies": [
                {
                    "body": "Not strictly avoid, just be wary and extra cautious of.",
                    "author": "CinnamonSugar39",
                    "id": "gprklvr",
                    "parent_id": "t1_gpqsdon",
                    "score": 2,
                    "created_utc": 1614946799.0,
                    "replies": []
                },
                {
                    "body": "True. Rare, but true comment. She may like you even in vanilla way, but she needs allowance to make her living. If not from you, than somehow else (means another guy, more likely).",
                    "author": "Gigi9662",
                    "id": "gpr7qai",
                    "parent_id": "t1_gpqsdon",
                    "score": 1,
                    "created_utc": 1614935397.0,
                    "replies": [
                        {
                            "body": "Agree",
                            "author": "sydsyd3",
                            "id": "gpu93bk",
                            "parent_id": "t1_gpr7qai",
                            "score": 1,
                            "created_utc": 1614992629.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "The moral of your story IMO is :   \n1) date only married SDs,and   \n2) keep an emotional barrier up to avoid (too many) feelings.",
            "author": "GSSD",
            "id": "gprrl8h",
            "parent_id": "t3_lxq074",
            "score": 1,
            "created_utc": 1614951317.0,
            "replies": [
                {
                    "body": "Yeah. I’ve had a married SD, and never got attached to him. Sometimes it’s hard to align with their schedules, though.",
                    "author": "CinnamonSugar39",
                    "id": "gps92r5",
                    "parent_id": "t1_gprrl8h",
                    "score": 1,
                    "created_utc": 1614959748.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Agree!! That's why I loved our SR so much. He got freaked :(",
            "author": "CinnamonSugar39",
            "id": "gpp18zq",
            "parent_id": "t1_gpoim2v",
            "score": 8,
            "created_utc": 1614890170.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "gppa6kf",
                    "parent_id": "t1_gpp18zq",
                    "score": 3,
                    "created_utc": 1614893974.0,
                    "replies": [
                        {
                            "body": "He did. I was extremely emotional when he was ending it and tried multiple times to get him back, which including me describing my feelings for him.",
                            "author": "CinnamonSugar39",
                            "id": "gppvmms",
                            "parent_id": "t1_gppa6kf",
                            "score": 5,
                            "created_utc": 1614904305.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "gppw0kq",
                                    "parent_id": "t1_gppvmms",
                                    "score": 3,
                                    "created_utc": 1614904504.0,
                                    "replies": [
                                        {
                                            "body": "Yes, I told him often throughout our SR how I felt about him. We often would check in with one another about those kinds of things too.",
                                            "author": "CinnamonSugar39",
                                            "id": "gpq88qi",
                                            "parent_id": "t1_gppw0kq",
                                            "score": 2,
                                            "created_utc": 1614910866.0,
                                            "replies": [
                                                {
                                                    "body": "[deleted]",
                                                    "author": null,
                                                    "id": "gpqu0c0",
                                                    "parent_id": "t1_gpq88qi",
                                                    "score": 0,
                                                    "created_utc": 1614923792.0,
                                                    "replies": [
                                                        {
                                                            "body": "I didn’t ever tell him i was “attached” to him. That just sounds dumb. I just said to you in my previous comments that I professed my feelings for him. *You* used the word “attachment,” kind sir.",
                                                            "author": "CinnamonSugar39",
                                                            "id": "gprkgfi",
                                                            "parent_id": "t1_gpqu0c0",
                                                            "score": 2,
                                                            "created_utc": 1614946683.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Or he‘s dismissive avoidant and thought it got too deep for him? Just a guess",
                    "author": "ok-person-at-eating",
                    "id": "gpp4np5",
                    "parent_id": "t1_gpp18zq",
                    "score": 4,
                    "created_utc": 1614891594.0,
                    "replies": [
                        {
                            "body": "Ooooh now we’re getting psychoanalytical. I like it 😏",
                            "author": "CinnamonSugar39",
                            "id": "gppvj4q",
                            "parent_id": "t1_gpp4np5",
                            "score": 5,
                            "created_utc": 1614904257.0,
                            "replies": [
                                {
                                    "body": "love it! okay so here is my more elaborate guess: he's dismissive avoidant (which likely comes with narcissistic traits). took up SR because he thought it would be distanced enough. turns out it's not as SB developed feelings and SR got quite intimate. Gaslights SB into it being \"too superficial\" (i.e. also being her fault). Comes up with excuses that \"SR is not for him\" meaning it's not for him with *her*.",
                                    "author": "ok-person-at-eating",
                                    "id": "gpr43f5",
                                    "parent_id": "t1_gppvj4q",
                                    "score": 1,
                                    "created_utc": 1614932173.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I’m sorry that happened to you. It’s nice that you two are still able to keep in touch. 🙂 Thanks for sharing!",
            "author": "CinnamonSugar39",
            "id": "gpokrka",
            "parent_id": "t1_gpodlv9",
            "score": 5,
            "created_utc": 1614883312.0,
            "replies": []
        },
        {
            "body": "Thanks, dear. Hang in there!",
            "author": "CinnamonSugar39",
            "id": "gpp156r",
            "parent_id": "t1_gpolc4y",
            "score": 4,
            "created_utc": 1614890127.0,
            "replies": []
        },
        {
            "body": "I am generally pessemistic about taking an SR public because the age difference tends to be off-putting to both persons friends. However there is always a temptation to offer a Vanilla option because its easier to loan my SB a nice car and treat her to nice dinners than it is to give her a generous allowance. If only my current live in GF who is my own age range wouldnt murder me in my sleep right?",
            "author": "squareC1999",
            "id": "gpp6bfi",
            "parent_id": "t1_gpp1jfj",
            "score": 2,
            "created_utc": 1614892290.0,
            "replies": []
        },
        {
            "body": "What’s interesting is that he seemed to think the age gap was totally normal. He even told his teenage kids about me and how old I am. I almost exclusively date much older men, even in past vanilla relationships, so I’m not really phased by age gaps either. However, he was the largest age gap I’ve had.",
            "author": "CinnamonSugar39",
            "id": "gppwf1z",
            "parent_id": "t1_gppclb0",
            "score": 3,
            "created_utc": 1614904716.0,
            "replies": []
        },
        {
            "body": "I agree, he wanted it “free” 😒",
            "author": "MedusaYHLQMDLG85",
            "id": "gppjt7c",
            "parent_id": "t1_gppclb0",
            "score": 4,
            "created_utc": 1614898381.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "gpq59e1",
                    "parent_id": "t1_gppjt7c",
                    "score": -1,
                    "created_utc": 1614909298.0,
                    "replies": [
                        {
                            "body": "Reread her first paragraph. He is full of it, if what she said is true then he most certainly did. She dodged a bullet.",
                            "author": "MedusaYHLQMDLG85",
                            "id": "gpq81cv",
                            "parent_id": "t1_gpq59e1",
                            "score": 1,
                            "created_utc": 1614910759.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Oh that totally was not my intention! I just more so meant I’ll be a little more skeptical early on with first timers.",
            "author": "CinnamonSugar39",
            "id": "gpokg3l",
            "parent_id": "t1_gpodhpg",
            "score": 4,
            "created_utc": 1614883179.0,
            "replies": []
        },
        {
            "body": "I’m not in a place where I want to vanilla date anyone. But he also didn’t give me that option, so kind of irrelevant anyway.",
            "author": "CinnamonSugar39",
            "id": "gpokl7o",
            "parent_id": "t1_gpoddbf",
            "score": 5,
            "created_utc": 1614883238.0,
            "replies": [
                {
                    "body": "You do not want to date this man, in any capacity. I know you’re heartbroken, but as time goes on and these raw feelings subside, you’ll see this more clearly. You said in a comment on your first post that you have a tendency to be attracted to toxic, narcissistic men. He is both of those things. You’re feeling this way because he love bombed you in the beginning and then abruptly gaslit and discarded you. He will do it again, if given the chance. I think his excuse is bologna, and he’ll find a younger and more inexperienced SB, soon. He’ll play the same games because it’s all he knows how to do. Please, stop blaming yourself. He set you up to let you down.",
                    "author": "FoxyFreckles1989",
                    "id": "gpp7js6",
                    "parent_id": "t1_gpokl7o",
                    "score": 5,
                    "created_utc": 1614892823.0,
                    "replies": []
                },
                {
                    "body": "You can always approach anyone at any time about vanilla dating.  Don't see why you would be so upset about losing him, yet would not consider vanilla dating him.  If you did date him in a vanilla way, it may possibly end up much like a sugar relationship.  Keep in touch with him.",
                    "author": "HappyBear1952",
                    "id": "gpomgl4",
                    "parent_id": "t1_gpokl7o",
                    "score": 6,
                    "created_utc": 1614884024.0,
                    "replies": [
                        {
                            "body": "I'm not in a place where I can date anyone vanilla... Can't really elaborate more. But I do get what you're saying. He doesn't really want to be involved with me, though. He's pretty freaked out over the whole sugar thing in general.",
                            "author": "CinnamonSugar39",
                            "id": "gpp0ogx",
                            "parent_id": "t1_gpomgl4",
                            "score": 6,
                            "created_utc": 1614889932.0,
                            "replies": []
                        },
                        {
                            "body": "Also, I would consider dating him vanilla, but I’d be simultaneously actively pursuing a SR, and he would want monogamy.",
                            "author": "CinnamonSugar39",
                            "id": "gppvv7f",
                            "parent_id": "t1_gpomgl4",
                            "score": 2,
                            "created_utc": 1614904427.0,
                            "replies": []
                        },
                        {
                            "body": "This is horrible advice. You have absolutely no reason to believe that were she to date him in a vanilla way, it would end up like a sugar relationship. He was demanding, inconsiderate, controlling, selfish and unrealistic. He displayed narcissistic traits from the start. Keeping in touch with him will only extend her heartache.",
                            "author": "FoxyFreckles1989",
                            "id": "gpp7ox1",
                            "parent_id": "t1_gpomgl4",
                            "score": 5,
                            "created_utc": 1614892885.0,
                            "replies": [
                                {
                                    "body": "Aren't all SDs like that?",
                                    "author": "JeaneyBowl",
                                    "id": "gppjeod",
                                    "parent_id": "t1_gpp7ox1",
                                    "score": 4,
                                    "created_utc": 1614898192.0,
                                    "replies": [
                                        {
                                            "body": "[deleted]",
                                            "author": null,
                                            "id": "gpq5lpo",
                                            "parent_id": "t1_gppjeod",
                                            "score": 4,
                                            "created_utc": 1614909479.0,
                                            "replies": [
                                                {
                                                    "body": "She’s referring to my previous post, which is linked in this post.",
                                                    "author": "CinnamonSugar39",
                                                    "id": "gpq8jab",
                                                    "parent_id": "t1_gpq5lpo",
                                                    "score": 2,
                                                    "created_utc": 1614911017.0,
                                                    "replies": [
                                                        {
                                                            "body": "I think u/swagsoiree was responding to the user that asked me if all SDs are “like that.”",
                                                            "author": "FoxyFreckles1989",
                                                            "id": "gpqd0tu",
                                                            "parent_id": "t1_gpq8jab",
                                                            "score": 1,
                                                            "created_utc": 1614913379.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Yes, exactly.",
                                                                    "author": null,
                                                                    "id": "gpqf6zg",
                                                                    "parent_id": "t1_gpqd0tu",
                                                                    "score": 2,
                                                                    "created_utc": 1614914568.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "Oh, sorry!",
                                                                            "author": "CinnamonSugar39",
                                                                            "id": "gpqg87g",
                                                                            "parent_id": "t1_gpqf6zg",
                                                                            "score": 2,
                                                                            "created_utc": 1614915146.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "Was just trying to help clarify! 😊",
                                                                                    "author": "FoxyFreckles1989",
                                                                                    "id": "gpqj3ql",
                                                                                    "parent_id": "t1_gpqg87g",
                                                                                    "score": 1,
                                                                                    "created_utc": 1614916773.0,
                                                                                    "replies": [
                                                                                        {
                                                                                            "body": "Yes! Thank you, love. 💗",
                                                                                            "author": "CinnamonSugar39",
                                                                                            "id": "gpqjbj8",
                                                                                            "parent_id": "t1_gpqj3ql",
                                                                                            "score": 2,
                                                                                            "created_utc": 1614916897.0,
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "body": "No! Gosh, no. I’m so sorry that your experience has apparently led you to believe so? There are so many incredible, kind and generous SDs out there.",
                                            "author": "FoxyFreckles1989",
                                            "id": "gppncx2",
                                            "parent_id": "t1_gppjeod",
                                            "score": 1,
                                            "created_utc": 1614900113.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "Based on the link to other post I agree with you 💯 %",
                                    "author": "sugarbooger1988",
                                    "id": "gpqapj1",
                                    "parent_id": "t1_gpp7ox1",
                                    "score": 2,
                                    "created_utc": 1614912144.0,
                                    "replies": []
                                },
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "gpq5ijy",
                                    "parent_id": "t1_gpp7ox1",
                                    "score": 1,
                                    "created_utc": 1614909433.0,
                                    "replies": [
                                        {
                                            "body": "Read the original post that she linked.",
                                            "author": "FoxyFreckles1989",
                                            "id": "gpq9vgr",
                                            "parent_id": "t1_gpq5ijy",
                                            "score": 0,
                                            "created_utc": 1614911714.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Yes! It’s also extremely manipulative for the SD to actively pursue a SR, knowing the woman he is pursuing is also looking for a SR, then months later try to manipulate her into vanilla after she’s already gotten used to the financial support. He told me from the start that he “doesn’t have the time and dedication that is required for traditional relationships” which is why he pursued sugar. What happened to having no time for vanilla? All the sudden you have time? I don’t buy it. I think these types of men are master manipulators/borderline sociopaths.",
            "author": "CinnamonSugar39",
            "id": "gprk9q1",
            "parent_id": "t1_gpr8iih",
            "score": 2,
            "created_utc": 1614946542.0,
            "replies": [
                {
                    "body": "Yes, manipulators not willing to understand...\nFor me, if man loves/develops more feelings, he should increase his care, not to cut it off....\n\nYou will find a better one. This one doesn't worth it.",
                    "author": "Gigi9662",
                    "id": "gprks4t",
                    "parent_id": "t1_gprk9q1",
                    "score": 1,
                    "created_utc": 1614946926.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Thank you! You are very kind. 🙂",
            "author": "CinnamonSugar39",
            "id": "gpu0h08",
            "parent_id": "t1_gpthw0n",
            "score": 1,
            "created_utc": 1614989197.0,
            "replies": []
        },
        {
            "body": "Agree, if you’re not going to fall in love and have something committed (vanilla relationship) *and* are paying for time with a SB, it’s easy to move to the next SB who looks like the exciting new prospect.",
            "author": null,
            "id": "gpp6ag5",
            "parent_id": "t1_gpp3ju4",
            "score": 2,
            "created_utc": 1614892278.0,
            "replies": []
        },
        {
            "body": "Eh, but I wasn't pretending and I think I made that pretty obvious based on the attention I dedicated to him.",
            "author": "CinnamonSugar39",
            "id": "gpp144b",
            "parent_id": "t1_gpoojnh",
            "score": 4,
            "created_utc": 1614890114.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "gpp3xk4",
                    "parent_id": "t1_gpp144b",
                    "score": -1,
                    "created_utc": 1614891292.0,
                    "replies": [
                        {
                            "body": "I’d consider it, but I’d be simultaneously actively pursuing a SR, and he would want monogamy.",
                            "author": "CinnamonSugar39",
                            "id": "gppvolw",
                            "parent_id": "t1_gpp3xk4",
                            "score": 2,
                            "created_utc": 1614904333.0,
                            "replies": []
                        },
                        {
                            "body": "You won’t pay someone to be your wife?  We all pay.  Even with a pre nuptial agreement they are still going to get paid after ten years",
                            "author": "pussy_impaler337",
                            "id": "gprmzgd",
                            "parent_id": "t1_gpp3xk4",
                            "score": 1,
                            "created_utc": 1614948481.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gpovxey",
            "parent_id": "t1_gpoojnh",
            "score": 4,
            "created_utc": 1614887914.0,
            "replies": [
                {
                    "body": "Not sure I’m following. How is it easy to tell if someone loves you or your money? Are you saying you can tell based on allowance amount? \n\nTo me, the only way to know if they’re there because they love you is if they’d date you without being handed stacks of cash. If they need that to keep seeing you, they’re there for the money.",
                    "author": null,
                    "id": "gpp4myc",
                    "parent_id": "t1_gpovxey",
                    "score": 1,
                    "created_utc": 1614891585.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "gpp7wmb",
                            "parent_id": "t1_gpp4myc",
                            "score": 1,
                            "created_utc": 1614892975.0,
                            "replies": [
                                {
                                    "body": "Oh I wouldn’t try making a sugar relationship vanilla at the start. I have paid my SBs for months or years before I’ve considered dating them vanilla (if it was even a possibility). After they have five figures or more from you, they generally know you’re not a scammer. You’re right that you want to be clear you’re not trying to “get her for free” at the beginning though",
                                    "author": null,
                                    "id": "gppc55n",
                                    "parent_id": "t1_gpp7wmb",
                                    "score": 2,
                                    "created_utc": 1614894835.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Also, when it's an older guy and a really attractive younger lady it's possible to imagine all sort of unrealistic relationship possibilities. Sometimes it just isnt practical to bring a fantasy life out into public if you know what I mean. The Movie Pretty Woman isnt a plan if you know what i mean.",
            "author": "squareC1999",
            "id": "gpp592u",
            "parent_id": "t1_gpoojnh",
            "score": 2,
            "created_utc": 1614891837.0,
            "replies": [
                {
                    "body": "Exactly, this is another reason why not to catch strong feelings and try to make it a serious relationship when it’s just sugar. Obviously care for your SB, develop a bond, but for the reasons you’ve raised (and others), don’t try making her your wife,GF, etc if she is there for the money. \n\nLet sugar be sugar",
                    "author": null,
                    "id": "gpp6rvz",
                    "parent_id": "t1_gpp592u",
                    "score": 2,
                    "created_utc": 1614892486.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "My life isn’t in a place that would foster a healthy vanilla relationship. I’d consider it, but I would actively be pursuing a SR simultaneously, and he would want monogamy.",
            "author": "CinnamonSugar39",
            "id": "gpq9csi",
            "parent_id": "t1_gppxwke",
            "score": 1,
            "created_utc": 1614911441.0,
            "replies": []
        },
        {
            "body": "Thisssss",
            "author": "GetThatBread06",
            "id": "gpq8aur",
            "parent_id": "t1_gppxwke",
            "score": 1,
            "created_utc": 1614910895.0,
            "replies": []
        },
        {
            "body": "I’m in a situation where being a SB is necessary.",
            "author": "CinnamonSugar39",
            "id": "gpqgbj8",
            "parent_id": "t1_gpqctny",
            "score": 3,
            "created_utc": 1614915198.0,
            "replies": [
                {
                    "body": "Just asking if that was something that was possible, too bad it didn't work out. Im sure you will find a new match soon!",
                    "author": "BcbornLeo",
                    "id": "gpqhm2j",
                    "parent_id": "t1_gpqgbj8",
                    "score": 0,
                    "created_utc": 1614915922.0,
                    "replies": [
                        {
                            "body": "Thank you!",
                            "author": "CinnamonSugar39",
                            "id": "gpqjeqs",
                            "parent_id": "t1_gpqhm2j",
                            "score": 2,
                            "created_utc": 1614916948.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Didn't say he was wrong! Feelings aren't wrong or right. Sugar relationships certainly are not for everyone, either. And no, I wouldn't date him vanilla because I'm not in a place where I want to date *anyone* vanilla. Also, he didn't give that option anyway.",
            "author": "CinnamonSugar39",
            "id": "gpp0y71",
            "parent_id": "t1_gpoif2l",
            "score": 5,
            "created_utc": 1614890044.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "gpp5so8",
                    "parent_id": "t1_gpp0y71",
                    "score": 5,
                    "created_utc": 1614892068.0,
                    "replies": [
                        {
                            "body": "Not sure I’m following you when you say I was driven by sugar. I stated here several times that I really enjoyed him and developed strong feelings for him.",
                            "author": "CinnamonSugar39",
                            "id": "gpq8t2c",
                            "parent_id": "t1_gpp5so8",
                            "score": 2,
                            "created_utc": 1614911158.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Didn’t say he was wrong! Feelings aren’t wrong or right anyway. Sugar relationships certainly are not for everyone. \nAnd no, because I’m not in a place where I want to date anyone vanilla right now. And he didn’t give me that option anyway.",
            "author": "CinnamonSugar39",
            "id": "gpokyzw",
            "parent_id": "t1_gpoif2l",
            "score": 1,
            "created_utc": 1614883399.0,
            "replies": [
                {
                    "body": "Meeting summary:  \n\n\n\\- \"I really fell for this guy. I liked him a lot, really respected/looked up to him, felt emotionally connected to him, had similar values/interests to his, could talk to him for hours and still want more, was extremely attracted to him and very satisfied with our sexual relationship, etc... \"  \n\n\n\\-  Maybe date him?  \n\n\n\\- \"I’m not in a place where I want to date anyone vanilla right now \"",
                    "author": "JeaneyBowl",
                    "id": "gpoycwj",
                    "parent_id": "t1_gpokyzw",
                    "score": 1,
                    "created_utc": 1614888947.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I, too, would be pretty upset if I heard my SD talk about vanilla dates. Do you by chance have a tinge of Madonna-whore complex? Not asking offensively, just wondering why you so strictly separate emotional connection from sex.",
            "author": "CinnamonSugar39",
            "id": "gpq964e",
            "parent_id": "t1_gpohj5n",
            "score": 2,
            "created_utc": 1614911346.0,
            "replies": [
                {
                    "body": "Worth looking into.  My first marriage was a bit chilly until my wife and I began exploring my fantasies.  She pushed me to become more passionate. It worked.  We unlocked a fire storm...a 2nd honeymoon that lasted over a year. My satisfaction level was through the roof, as was hers, for a while.  At some point her energy dropped and she found 'like' with another guy.  She left me with 3 young kids.  \n\nI found the sugar world shortly thereafter.  It fit my schedule and afforded intimacy without emotional connection...which was a good thing after my 17 year marriage ended.  I was in a very bad place back then.  Sugar was safety.\n\nWhen I consider all the longer term sugar relationships I've had...there are a few that could have converted to vanilla.  Two of those ended when the SB got engaged to their own vanilla guy.  My current SB could easily go vanilla...but she is married with kids, so no bueno there, for now.  The SBs that wouldn't make my cut all had obvious trip wires...drug abuse, lesbian vanilla partners, younger than my kids, higher maintenance than I could provide....\n\nI read the wiki on that Madonna-whore complex.  There is some truth to that.  When we were having kids our lives were very hectic.  Finding time for ourselves was difficult.  Sadly, just as the domestic duties got easier, my wife left.",
                    "author": "sdphilly",
                    "id": "gps3bn4",
                    "parent_id": "t1_gpq964e",
                    "score": 1,
                    "created_utc": 1614957209.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I’d consider it, but I’d be simultaneously actively pursuing a SR, and he would want monogamy.",
            "author": "CinnamonSugar39",
            "id": "gppvbjp",
            "parent_id": "t1_gppdpor",
            "score": 3,
            "created_utc": 1614904151.0,
            "replies": []
        },
        {
            "body": "But the sugar aspect is what he’s hung up on. It was a real relationship essentially + sugar.",
            "author": "CinnamonSugar39",
            "id": "gppvg7x",
            "parent_id": "t1_gppc7kd",
            "score": 2,
            "created_utc": 1614904217.0,
            "replies": []
        },
        {
            "body": "Lmao",
            "author": "chamdigiri",
            "id": "gpognrn",
            "parent_id": "t1_gpoe9ks",
            "score": 2,
            "created_utc": 1614881598.0,
            "replies": []
        },
        {
            "body": "Not strictly avoid, just be wary and extra cautious of.",
            "author": "CinnamonSugar39",
            "id": "gprklvr",
            "parent_id": "t1_gpqsdon",
            "score": 2,
            "created_utc": 1614946799.0,
            "replies": []
        },
        {
            "body": "True. Rare, but true comment. She may like you even in vanilla way, but she needs allowance to make her living. If not from you, than somehow else (means another guy, more likely).",
            "author": "Gigi9662",
            "id": "gpr7qai",
            "parent_id": "t1_gpqsdon",
            "score": 1,
            "created_utc": 1614935397.0,
            "replies": [
                {
                    "body": "Agree",
                    "author": "sydsyd3",
                    "id": "gpu93bk",
                    "parent_id": "t1_gpr7qai",
                    "score": 1,
                    "created_utc": 1614992629.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Yeah. I’ve had a married SD, and never got attached to him. Sometimes it’s hard to align with their schedules, though.",
            "author": "CinnamonSugar39",
            "id": "gps92r5",
            "parent_id": "t1_gprrl8h",
            "score": 1,
            "created_utc": 1614959748.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gppa6kf",
            "parent_id": "t1_gpp18zq",
            "score": 3,
            "created_utc": 1614893974.0,
            "replies": [
                {
                    "body": "He did. I was extremely emotional when he was ending it and tried multiple times to get him back, which including me describing my feelings for him.",
                    "author": "CinnamonSugar39",
                    "id": "gppvmms",
                    "parent_id": "t1_gppa6kf",
                    "score": 5,
                    "created_utc": 1614904305.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "gppw0kq",
                            "parent_id": "t1_gppvmms",
                            "score": 3,
                            "created_utc": 1614904504.0,
                            "replies": [
                                {
                                    "body": "Yes, I told him often throughout our SR how I felt about him. We often would check in with one another about those kinds of things too.",
                                    "author": "CinnamonSugar39",
                                    "id": "gpq88qi",
                                    "parent_id": "t1_gppw0kq",
                                    "score": 2,
                                    "created_utc": 1614910866.0,
                                    "replies": [
                                        {
                                            "body": "[deleted]",
                                            "author": null,
                                            "id": "gpqu0c0",
                                            "parent_id": "t1_gpq88qi",
                                            "score": 0,
                                            "created_utc": 1614923792.0,
                                            "replies": [
                                                {
                                                    "body": "I didn’t ever tell him i was “attached” to him. That just sounds dumb. I just said to you in my previous comments that I professed my feelings for him. *You* used the word “attachment,” kind sir.",
                                                    "author": "CinnamonSugar39",
                                                    "id": "gprkgfi",
                                                    "parent_id": "t1_gpqu0c0",
                                                    "score": 2,
                                                    "created_utc": 1614946683.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Or he‘s dismissive avoidant and thought it got too deep for him? Just a guess",
            "author": "ok-person-at-eating",
            "id": "gpp4np5",
            "parent_id": "t1_gpp18zq",
            "score": 4,
            "created_utc": 1614891594.0,
            "replies": [
                {
                    "body": "Ooooh now we’re getting psychoanalytical. I like it 😏",
                    "author": "CinnamonSugar39",
                    "id": "gppvj4q",
                    "parent_id": "t1_gpp4np5",
                    "score": 5,
                    "created_utc": 1614904257.0,
                    "replies": [
                        {
                            "body": "love it! okay so here is my more elaborate guess: he's dismissive avoidant (which likely comes with narcissistic traits). took up SR because he thought it would be distanced enough. turns out it's not as SB developed feelings and SR got quite intimate. Gaslights SB into it being \"too superficial\" (i.e. also being her fault). Comes up with excuses that \"SR is not for him\" meaning it's not for him with *her*.",
                            "author": "ok-person-at-eating",
                            "id": "gpr43f5",
                            "parent_id": "t1_gppvj4q",
                            "score": 1,
                            "created_utc": 1614932173.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gpq59e1",
            "parent_id": "t1_gppjt7c",
            "score": -1,
            "created_utc": 1614909298.0,
            "replies": [
                {
                    "body": "Reread her first paragraph. He is full of it, if what she said is true then he most certainly did. She dodged a bullet.",
                    "author": "MedusaYHLQMDLG85",
                    "id": "gpq81cv",
                    "parent_id": "t1_gpq59e1",
                    "score": 1,
                    "created_utc": 1614910759.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "You do not want to date this man, in any capacity. I know you’re heartbroken, but as time goes on and these raw feelings subside, you’ll see this more clearly. You said in a comment on your first post that you have a tendency to be attracted to toxic, narcissistic men. He is both of those things. You’re feeling this way because he love bombed you in the beginning and then abruptly gaslit and discarded you. He will do it again, if given the chance. I think his excuse is bologna, and he’ll find a younger and more inexperienced SB, soon. He’ll play the same games because it’s all he knows how to do. Please, stop blaming yourself. He set you up to let you down.",
            "author": "FoxyFreckles1989",
            "id": "gpp7js6",
            "parent_id": "t1_gpokl7o",
            "score": 5,
            "created_utc": 1614892823.0,
            "replies": []
        },
        {
            "body": "You can always approach anyone at any time about vanilla dating.  Don't see why you would be so upset about losing him, yet would not consider vanilla dating him.  If you did date him in a vanilla way, it may possibly end up much like a sugar relationship.  Keep in touch with him.",
            "author": "HappyBear1952",
            "id": "gpomgl4",
            "parent_id": "t1_gpokl7o",
            "score": 6,
            "created_utc": 1614884024.0,
            "replies": [
                {
                    "body": "I'm not in a place where I can date anyone vanilla... Can't really elaborate more. But I do get what you're saying. He doesn't really want to be involved with me, though. He's pretty freaked out over the whole sugar thing in general.",
                    "author": "CinnamonSugar39",
                    "id": "gpp0ogx",
                    "parent_id": "t1_gpomgl4",
                    "score": 6,
                    "created_utc": 1614889932.0,
                    "replies": []
                },
                {
                    "body": "Also, I would consider dating him vanilla, but I’d be simultaneously actively pursuing a SR, and he would want monogamy.",
                    "author": "CinnamonSugar39",
                    "id": "gppvv7f",
                    "parent_id": "t1_gpomgl4",
                    "score": 2,
                    "created_utc": 1614904427.0,
                    "replies": []
                },
                {
                    "body": "This is horrible advice. You have absolutely no reason to believe that were she to date him in a vanilla way, it would end up like a sugar relationship. He was demanding, inconsiderate, controlling, selfish and unrealistic. He displayed narcissistic traits from the start. Keeping in touch with him will only extend her heartache.",
                    "author": "FoxyFreckles1989",
                    "id": "gpp7ox1",
                    "parent_id": "t1_gpomgl4",
                    "score": 5,
                    "created_utc": 1614892885.0,
                    "replies": [
                        {
                            "body": "Aren't all SDs like that?",
                            "author": "JeaneyBowl",
                            "id": "gppjeod",
                            "parent_id": "t1_gpp7ox1",
                            "score": 4,
                            "created_utc": 1614898192.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "gpq5lpo",
                                    "parent_id": "t1_gppjeod",
                                    "score": 4,
                                    "created_utc": 1614909479.0,
                                    "replies": [
                                        {
                                            "body": "She’s referring to my previous post, which is linked in this post.",
                                            "author": "CinnamonSugar39",
                                            "id": "gpq8jab",
                                            "parent_id": "t1_gpq5lpo",
                                            "score": 2,
                                            "created_utc": 1614911017.0,
                                            "replies": [
                                                {
                                                    "body": "I think u/swagsoiree was responding to the user that asked me if all SDs are “like that.”",
                                                    "author": "FoxyFreckles1989",
                                                    "id": "gpqd0tu",
                                                    "parent_id": "t1_gpq8jab",
                                                    "score": 1,
                                                    "created_utc": 1614913379.0,
                                                    "replies": [
                                                        {
                                                            "body": "Yes, exactly.",
                                                            "author": null,
                                                            "id": "gpqf6zg",
                                                            "parent_id": "t1_gpqd0tu",
                                                            "score": 2,
                                                            "created_utc": 1614914568.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Oh, sorry!",
                                                                    "author": "CinnamonSugar39",
                                                                    "id": "gpqg87g",
                                                                    "parent_id": "t1_gpqf6zg",
                                                                    "score": 2,
                                                                    "created_utc": 1614915146.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "Was just trying to help clarify! 😊",
                                                                            "author": "FoxyFreckles1989",
                                                                            "id": "gpqj3ql",
                                                                            "parent_id": "t1_gpqg87g",
                                                                            "score": 1,
                                                                            "created_utc": 1614916773.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "Yes! Thank you, love. 💗",
                                                                                    "author": "CinnamonSugar39",
                                                                                    "id": "gpqjbj8",
                                                                                    "parent_id": "t1_gpqj3ql",
                                                                                    "score": 2,
                                                                                    "created_utc": 1614916897.0,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "No! Gosh, no. I’m so sorry that your experience has apparently led you to believe so? There are so many incredible, kind and generous SDs out there.",
                                    "author": "FoxyFreckles1989",
                                    "id": "gppncx2",
                                    "parent_id": "t1_gppjeod",
                                    "score": 1,
                                    "created_utc": 1614900113.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "Based on the link to other post I agree with you 💯 %",
                            "author": "sugarbooger1988",
                            "id": "gpqapj1",
                            "parent_id": "t1_gpp7ox1",
                            "score": 2,
                            "created_utc": 1614912144.0,
                            "replies": []
                        },
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "gpq5ijy",
                            "parent_id": "t1_gpp7ox1",
                            "score": 1,
                            "created_utc": 1614909433.0,
                            "replies": [
                                {
                                    "body": "Read the original post that she linked.",
                                    "author": "FoxyFreckles1989",
                                    "id": "gpq9vgr",
                                    "parent_id": "t1_gpq5ijy",
                                    "score": 0,
                                    "created_utc": 1614911714.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Yes, manipulators not willing to understand...\nFor me, if man loves/develops more feelings, he should increase his care, not to cut it off....\n\nYou will find a better one. This one doesn't worth it.",
            "author": "Gigi9662",
            "id": "gprks4t",
            "parent_id": "t1_gprk9q1",
            "score": 1,
            "created_utc": 1614946926.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gpp3xk4",
            "parent_id": "t1_gpp144b",
            "score": -1,
            "created_utc": 1614891292.0,
            "replies": [
                {
                    "body": "I’d consider it, but I’d be simultaneously actively pursuing a SR, and he would want monogamy.",
                    "author": "CinnamonSugar39",
                    "id": "gppvolw",
                    "parent_id": "t1_gpp3xk4",
                    "score": 2,
                    "created_utc": 1614904333.0,
                    "replies": []
                },
                {
                    "body": "You won’t pay someone to be your wife?  We all pay.  Even with a pre nuptial agreement they are still going to get paid after ten years",
                    "author": "pussy_impaler337",
                    "id": "gprmzgd",
                    "parent_id": "t1_gpp3xk4",
                    "score": 1,
                    "created_utc": 1614948481.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Not sure I’m following. How is it easy to tell if someone loves you or your money? Are you saying you can tell based on allowance amount? \n\nTo me, the only way to know if they’re there because they love you is if they’d date you without being handed stacks of cash. If they need that to keep seeing you, they’re there for the money.",
            "author": null,
            "id": "gpp4myc",
            "parent_id": "t1_gpovxey",
            "score": 1,
            "created_utc": 1614891585.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "gpp7wmb",
                    "parent_id": "t1_gpp4myc",
                    "score": 1,
                    "created_utc": 1614892975.0,
                    "replies": [
                        {
                            "body": "Oh I wouldn’t try making a sugar relationship vanilla at the start. I have paid my SBs for months or years before I’ve considered dating them vanilla (if it was even a possibility). After they have five figures or more from you, they generally know you’re not a scammer. You’re right that you want to be clear you’re not trying to “get her for free” at the beginning though",
                            "author": null,
                            "id": "gppc55n",
                            "parent_id": "t1_gpp7wmb",
                            "score": 2,
                            "created_utc": 1614894835.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Exactly, this is another reason why not to catch strong feelings and try to make it a serious relationship when it’s just sugar. Obviously care for your SB, develop a bond, but for the reasons you’ve raised (and others), don’t try making her your wife,GF, etc if she is there for the money. \n\nLet sugar be sugar",
            "author": null,
            "id": "gpp6rvz",
            "parent_id": "t1_gpp592u",
            "score": 2,
            "created_utc": 1614892486.0,
            "replies": []
        },
        {
            "body": "Just asking if that was something that was possible, too bad it didn't work out. Im sure you will find a new match soon!",
            "author": "BcbornLeo",
            "id": "gpqhm2j",
            "parent_id": "t1_gpqgbj8",
            "score": 0,
            "created_utc": 1614915922.0,
            "replies": [
                {
                    "body": "Thank you!",
                    "author": "CinnamonSugar39",
                    "id": "gpqjeqs",
                    "parent_id": "t1_gpqhm2j",
                    "score": 2,
                    "created_utc": 1614916948.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gpp5so8",
            "parent_id": "t1_gpp0y71",
            "score": 5,
            "created_utc": 1614892068.0,
            "replies": [
                {
                    "body": "Not sure I’m following you when you say I was driven by sugar. I stated here several times that I really enjoyed him and developed strong feelings for him.",
                    "author": "CinnamonSugar39",
                    "id": "gpq8t2c",
                    "parent_id": "t1_gpp5so8",
                    "score": 2,
                    "created_utc": 1614911158.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Meeting summary:  \n\n\n\\- \"I really fell for this guy. I liked him a lot, really respected/looked up to him, felt emotionally connected to him, had similar values/interests to his, could talk to him for hours and still want more, was extremely attracted to him and very satisfied with our sexual relationship, etc... \"  \n\n\n\\-  Maybe date him?  \n\n\n\\- \"I’m not in a place where I want to date anyone vanilla right now \"",
            "author": "JeaneyBowl",
            "id": "gpoycwj",
            "parent_id": "t1_gpokyzw",
            "score": 1,
            "created_utc": 1614888947.0,
            "replies": []
        },
        {
            "body": "Worth looking into.  My first marriage was a bit chilly until my wife and I began exploring my fantasies.  She pushed me to become more passionate. It worked.  We unlocked a fire storm...a 2nd honeymoon that lasted over a year. My satisfaction level was through the roof, as was hers, for a while.  At some point her energy dropped and she found 'like' with another guy.  She left me with 3 young kids.  \n\nI found the sugar world shortly thereafter.  It fit my schedule and afforded intimacy without emotional connection...which was a good thing after my 17 year marriage ended.  I was in a very bad place back then.  Sugar was safety.\n\nWhen I consider all the longer term sugar relationships I've had...there are a few that could have converted to vanilla.  Two of those ended when the SB got engaged to their own vanilla guy.  My current SB could easily go vanilla...but she is married with kids, so no bueno there, for now.  The SBs that wouldn't make my cut all had obvious trip wires...drug abuse, lesbian vanilla partners, younger than my kids, higher maintenance than I could provide....\n\nI read the wiki on that Madonna-whore complex.  There is some truth to that.  When we were having kids our lives were very hectic.  Finding time for ourselves was difficult.  Sadly, just as the domestic duties got easier, my wife left.",
            "author": "sdphilly",
            "id": "gps3bn4",
            "parent_id": "t1_gpq964e",
            "score": 1,
            "created_utc": 1614957209.0,
            "replies": []
        },
        {
            "body": "Agree",
            "author": "sydsyd3",
            "id": "gpu93bk",
            "parent_id": "t1_gpr7qai",
            "score": 1,
            "created_utc": 1614992629.0,
            "replies": []
        },
        {
            "body": "He did. I was extremely emotional when he was ending it and tried multiple times to get him back, which including me describing my feelings for him.",
            "author": "CinnamonSugar39",
            "id": "gppvmms",
            "parent_id": "t1_gppa6kf",
            "score": 5,
            "created_utc": 1614904305.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "gppw0kq",
                    "parent_id": "t1_gppvmms",
                    "score": 3,
                    "created_utc": 1614904504.0,
                    "replies": [
                        {
                            "body": "Yes, I told him often throughout our SR how I felt about him. We often would check in with one another about those kinds of things too.",
                            "author": "CinnamonSugar39",
                            "id": "gpq88qi",
                            "parent_id": "t1_gppw0kq",
                            "score": 2,
                            "created_utc": 1614910866.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "gpqu0c0",
                                    "parent_id": "t1_gpq88qi",
                                    "score": 0,
                                    "created_utc": 1614923792.0,
                                    "replies": [
                                        {
                                            "body": "I didn’t ever tell him i was “attached” to him. That just sounds dumb. I just said to you in my previous comments that I professed my feelings for him. *You* used the word “attachment,” kind sir.",
                                            "author": "CinnamonSugar39",
                                            "id": "gprkgfi",
                                            "parent_id": "t1_gpqu0c0",
                                            "score": 2,
                                            "created_utc": 1614946683.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Ooooh now we’re getting psychoanalytical. I like it 😏",
            "author": "CinnamonSugar39",
            "id": "gppvj4q",
            "parent_id": "t1_gpp4np5",
            "score": 5,
            "created_utc": 1614904257.0,
            "replies": [
                {
                    "body": "love it! okay so here is my more elaborate guess: he's dismissive avoidant (which likely comes with narcissistic traits). took up SR because he thought it would be distanced enough. turns out it's not as SB developed feelings and SR got quite intimate. Gaslights SB into it being \"too superficial\" (i.e. also being her fault). Comes up with excuses that \"SR is not for him\" meaning it's not for him with *her*.",
                    "author": "ok-person-at-eating",
                    "id": "gpr43f5",
                    "parent_id": "t1_gppvj4q",
                    "score": 1,
                    "created_utc": 1614932173.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Reread her first paragraph. He is full of it, if what she said is true then he most certainly did. She dodged a bullet.",
            "author": "MedusaYHLQMDLG85",
            "id": "gpq81cv",
            "parent_id": "t1_gpq59e1",
            "score": 1,
            "created_utc": 1614910759.0,
            "replies": []
        },
        {
            "body": "I'm not in a place where I can date anyone vanilla... Can't really elaborate more. But I do get what you're saying. He doesn't really want to be involved with me, though. He's pretty freaked out over the whole sugar thing in general.",
            "author": "CinnamonSugar39",
            "id": "gpp0ogx",
            "parent_id": "t1_gpomgl4",
            "score": 6,
            "created_utc": 1614889932.0,
            "replies": []
        },
        {
            "body": "Also, I would consider dating him vanilla, but I’d be simultaneously actively pursuing a SR, and he would want monogamy.",
            "author": "CinnamonSugar39",
            "id": "gppvv7f",
            "parent_id": "t1_gpomgl4",
            "score": 2,
            "created_utc": 1614904427.0,
            "replies": []
        },
        {
            "body": "This is horrible advice. You have absolutely no reason to believe that were she to date him in a vanilla way, it would end up like a sugar relationship. He was demanding, inconsiderate, controlling, selfish and unrealistic. He displayed narcissistic traits from the start. Keeping in touch with him will only extend her heartache.",
            "author": "FoxyFreckles1989",
            "id": "gpp7ox1",
            "parent_id": "t1_gpomgl4",
            "score": 5,
            "created_utc": 1614892885.0,
            "replies": [
                {
                    "body": "Aren't all SDs like that?",
                    "author": "JeaneyBowl",
                    "id": "gppjeod",
                    "parent_id": "t1_gpp7ox1",
                    "score": 4,
                    "created_utc": 1614898192.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "gpq5lpo",
                            "parent_id": "t1_gppjeod",
                            "score": 4,
                            "created_utc": 1614909479.0,
                            "replies": [
                                {
                                    "body": "She’s referring to my previous post, which is linked in this post.",
                                    "author": "CinnamonSugar39",
                                    "id": "gpq8jab",
                                    "parent_id": "t1_gpq5lpo",
                                    "score": 2,
                                    "created_utc": 1614911017.0,
                                    "replies": [
                                        {
                                            "body": "I think u/swagsoiree was responding to the user that asked me if all SDs are “like that.”",
                                            "author": "FoxyFreckles1989",
                                            "id": "gpqd0tu",
                                            "parent_id": "t1_gpq8jab",
                                            "score": 1,
                                            "created_utc": 1614913379.0,
                                            "replies": [
                                                {
                                                    "body": "Yes, exactly.",
                                                    "author": null,
                                                    "id": "gpqf6zg",
                                                    "parent_id": "t1_gpqd0tu",
                                                    "score": 2,
                                                    "created_utc": 1614914568.0,
                                                    "replies": [
                                                        {
                                                            "body": "Oh, sorry!",
                                                            "author": "CinnamonSugar39",
                                                            "id": "gpqg87g",
                                                            "parent_id": "t1_gpqf6zg",
                                                            "score": 2,
                                                            "created_utc": 1614915146.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Was just trying to help clarify! 😊",
                                                                    "author": "FoxyFreckles1989",
                                                                    "id": "gpqj3ql",
                                                                    "parent_id": "t1_gpqg87g",
                                                                    "score": 1,
                                                                    "created_utc": 1614916773.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "Yes! Thank you, love. 💗",
                                                                            "author": "CinnamonSugar39",
                                                                            "id": "gpqjbj8",
                                                                            "parent_id": "t1_gpqj3ql",
                                                                            "score": 2,
                                                                            "created_utc": 1614916897.0,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "No! Gosh, no. I’m so sorry that your experience has apparently led you to believe so? There are so many incredible, kind and generous SDs out there.",
                            "author": "FoxyFreckles1989",
                            "id": "gppncx2",
                            "parent_id": "t1_gppjeod",
                            "score": 1,
                            "created_utc": 1614900113.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Based on the link to other post I agree with you 💯 %",
                    "author": "sugarbooger1988",
                    "id": "gpqapj1",
                    "parent_id": "t1_gpp7ox1",
                    "score": 2,
                    "created_utc": 1614912144.0,
                    "replies": []
                },
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "gpq5ijy",
                    "parent_id": "t1_gpp7ox1",
                    "score": 1,
                    "created_utc": 1614909433.0,
                    "replies": [
                        {
                            "body": "Read the original post that she linked.",
                            "author": "FoxyFreckles1989",
                            "id": "gpq9vgr",
                            "parent_id": "t1_gpq5ijy",
                            "score": 0,
                            "created_utc": 1614911714.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I’d consider it, but I’d be simultaneously actively pursuing a SR, and he would want monogamy.",
            "author": "CinnamonSugar39",
            "id": "gppvolw",
            "parent_id": "t1_gpp3xk4",
            "score": 2,
            "created_utc": 1614904333.0,
            "replies": []
        },
        {
            "body": "You won’t pay someone to be your wife?  We all pay.  Even with a pre nuptial agreement they are still going to get paid after ten years",
            "author": "pussy_impaler337",
            "id": "gprmzgd",
            "parent_id": "t1_gpp3xk4",
            "score": 1,
            "created_utc": 1614948481.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gpp7wmb",
            "parent_id": "t1_gpp4myc",
            "score": 1,
            "created_utc": 1614892975.0,
            "replies": [
                {
                    "body": "Oh I wouldn’t try making a sugar relationship vanilla at the start. I have paid my SBs for months or years before I’ve considered dating them vanilla (if it was even a possibility). After they have five figures or more from you, they generally know you’re not a scammer. You’re right that you want to be clear you’re not trying to “get her for free” at the beginning though",
                    "author": null,
                    "id": "gppc55n",
                    "parent_id": "t1_gpp7wmb",
                    "score": 2,
                    "created_utc": 1614894835.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Thank you!",
            "author": "CinnamonSugar39",
            "id": "gpqjeqs",
            "parent_id": "t1_gpqhm2j",
            "score": 2,
            "created_utc": 1614916948.0,
            "replies": []
        },
        {
            "body": "Not sure I’m following you when you say I was driven by sugar. I stated here several times that I really enjoyed him and developed strong feelings for him.",
            "author": "CinnamonSugar39",
            "id": "gpq8t2c",
            "parent_id": "t1_gpp5so8",
            "score": 2,
            "created_utc": 1614911158.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gppw0kq",
            "parent_id": "t1_gppvmms",
            "score": 3,
            "created_utc": 1614904504.0,
            "replies": [
                {
                    "body": "Yes, I told him often throughout our SR how I felt about him. We often would check in with one another about those kinds of things too.",
                    "author": "CinnamonSugar39",
                    "id": "gpq88qi",
                    "parent_id": "t1_gppw0kq",
                    "score": 2,
                    "created_utc": 1614910866.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "gpqu0c0",
                            "parent_id": "t1_gpq88qi",
                            "score": 0,
                            "created_utc": 1614923792.0,
                            "replies": [
                                {
                                    "body": "I didn’t ever tell him i was “attached” to him. That just sounds dumb. I just said to you in my previous comments that I professed my feelings for him. *You* used the word “attachment,” kind sir.",
                                    "author": "CinnamonSugar39",
                                    "id": "gprkgfi",
                                    "parent_id": "t1_gpqu0c0",
                                    "score": 2,
                                    "created_utc": 1614946683.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "love it! okay so here is my more elaborate guess: he's dismissive avoidant (which likely comes with narcissistic traits). took up SR because he thought it would be distanced enough. turns out it's not as SB developed feelings and SR got quite intimate. Gaslights SB into it being \"too superficial\" (i.e. also being her fault). Comes up with excuses that \"SR is not for him\" meaning it's not for him with *her*.",
            "author": "ok-person-at-eating",
            "id": "gpr43f5",
            "parent_id": "t1_gppvj4q",
            "score": 1,
            "created_utc": 1614932173.0,
            "replies": []
        },
        {
            "body": "Aren't all SDs like that?",
            "author": "JeaneyBowl",
            "id": "gppjeod",
            "parent_id": "t1_gpp7ox1",
            "score": 4,
            "created_utc": 1614898192.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "gpq5lpo",
                    "parent_id": "t1_gppjeod",
                    "score": 4,
                    "created_utc": 1614909479.0,
                    "replies": [
                        {
                            "body": "She’s referring to my previous post, which is linked in this post.",
                            "author": "CinnamonSugar39",
                            "id": "gpq8jab",
                            "parent_id": "t1_gpq5lpo",
                            "score": 2,
                            "created_utc": 1614911017.0,
                            "replies": [
                                {
                                    "body": "I think u/swagsoiree was responding to the user that asked me if all SDs are “like that.”",
                                    "author": "FoxyFreckles1989",
                                    "id": "gpqd0tu",
                                    "parent_id": "t1_gpq8jab",
                                    "score": 1,
                                    "created_utc": 1614913379.0,
                                    "replies": [
                                        {
                                            "body": "Yes, exactly.",
                                            "author": null,
                                            "id": "gpqf6zg",
                                            "parent_id": "t1_gpqd0tu",
                                            "score": 2,
                                            "created_utc": 1614914568.0,
                                            "replies": [
                                                {
                                                    "body": "Oh, sorry!",
                                                    "author": "CinnamonSugar39",
                                                    "id": "gpqg87g",
                                                    "parent_id": "t1_gpqf6zg",
                                                    "score": 2,
                                                    "created_utc": 1614915146.0,
                                                    "replies": [
                                                        {
                                                            "body": "Was just trying to help clarify! 😊",
                                                            "author": "FoxyFreckles1989",
                                                            "id": "gpqj3ql",
                                                            "parent_id": "t1_gpqg87g",
                                                            "score": 1,
                                                            "created_utc": 1614916773.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Yes! Thank you, love. 💗",
                                                                    "author": "CinnamonSugar39",
                                                                    "id": "gpqjbj8",
                                                                    "parent_id": "t1_gpqj3ql",
                                                                    "score": 2,
                                                                    "created_utc": 1614916897.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "No! Gosh, no. I’m so sorry that your experience has apparently led you to believe so? There are so many incredible, kind and generous SDs out there.",
                    "author": "FoxyFreckles1989",
                    "id": "gppncx2",
                    "parent_id": "t1_gppjeod",
                    "score": 1,
                    "created_utc": 1614900113.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Based on the link to other post I agree with you 💯 %",
            "author": "sugarbooger1988",
            "id": "gpqapj1",
            "parent_id": "t1_gpp7ox1",
            "score": 2,
            "created_utc": 1614912144.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gpq5ijy",
            "parent_id": "t1_gpp7ox1",
            "score": 1,
            "created_utc": 1614909433.0,
            "replies": [
                {
                    "body": "Read the original post that she linked.",
                    "author": "FoxyFreckles1989",
                    "id": "gpq9vgr",
                    "parent_id": "t1_gpq5ijy",
                    "score": 0,
                    "created_utc": 1614911714.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Oh I wouldn’t try making a sugar relationship vanilla at the start. I have paid my SBs for months or years before I’ve considered dating them vanilla (if it was even a possibility). After they have five figures or more from you, they generally know you’re not a scammer. You’re right that you want to be clear you’re not trying to “get her for free” at the beginning though",
            "author": null,
            "id": "gppc55n",
            "parent_id": "t1_gpp7wmb",
            "score": 2,
            "created_utc": 1614894835.0,
            "replies": []
        },
        {
            "body": "Yes, I told him often throughout our SR how I felt about him. We often would check in with one another about those kinds of things too.",
            "author": "CinnamonSugar39",
            "id": "gpq88qi",
            "parent_id": "t1_gppw0kq",
            "score": 2,
            "created_utc": 1614910866.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "gpqu0c0",
                    "parent_id": "t1_gpq88qi",
                    "score": 0,
                    "created_utc": 1614923792.0,
                    "replies": [
                        {
                            "body": "I didn’t ever tell him i was “attached” to him. That just sounds dumb. I just said to you in my previous comments that I professed my feelings for him. *You* used the word “attachment,” kind sir.",
                            "author": "CinnamonSugar39",
                            "id": "gprkgfi",
                            "parent_id": "t1_gpqu0c0",
                            "score": 2,
                            "created_utc": 1614946683.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gpq5lpo",
            "parent_id": "t1_gppjeod",
            "score": 4,
            "created_utc": 1614909479.0,
            "replies": [
                {
                    "body": "She’s referring to my previous post, which is linked in this post.",
                    "author": "CinnamonSugar39",
                    "id": "gpq8jab",
                    "parent_id": "t1_gpq5lpo",
                    "score": 2,
                    "created_utc": 1614911017.0,
                    "replies": [
                        {
                            "body": "I think u/swagsoiree was responding to the user that asked me if all SDs are “like that.”",
                            "author": "FoxyFreckles1989",
                            "id": "gpqd0tu",
                            "parent_id": "t1_gpq8jab",
                            "score": 1,
                            "created_utc": 1614913379.0,
                            "replies": [
                                {
                                    "body": "Yes, exactly.",
                                    "author": null,
                                    "id": "gpqf6zg",
                                    "parent_id": "t1_gpqd0tu",
                                    "score": 2,
                                    "created_utc": 1614914568.0,
                                    "replies": [
                                        {
                                            "body": "Oh, sorry!",
                                            "author": "CinnamonSugar39",
                                            "id": "gpqg87g",
                                            "parent_id": "t1_gpqf6zg",
                                            "score": 2,
                                            "created_utc": 1614915146.0,
                                            "replies": [
                                                {
                                                    "body": "Was just trying to help clarify! 😊",
                                                    "author": "FoxyFreckles1989",
                                                    "id": "gpqj3ql",
                                                    "parent_id": "t1_gpqg87g",
                                                    "score": 1,
                                                    "created_utc": 1614916773.0,
                                                    "replies": [
                                                        {
                                                            "body": "Yes! Thank you, love. 💗",
                                                            "author": "CinnamonSugar39",
                                                            "id": "gpqjbj8",
                                                            "parent_id": "t1_gpqj3ql",
                                                            "score": 2,
                                                            "created_utc": 1614916897.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "No! Gosh, no. I’m so sorry that your experience has apparently led you to believe so? There are so many incredible, kind and generous SDs out there.",
            "author": "FoxyFreckles1989",
            "id": "gppncx2",
            "parent_id": "t1_gppjeod",
            "score": 1,
            "created_utc": 1614900113.0,
            "replies": []
        },
        {
            "body": "Read the original post that she linked.",
            "author": "FoxyFreckles1989",
            "id": "gpq9vgr",
            "parent_id": "t1_gpq5ijy",
            "score": 0,
            "created_utc": 1614911714.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gpqu0c0",
            "parent_id": "t1_gpq88qi",
            "score": 0,
            "created_utc": 1614923792.0,
            "replies": [
                {
                    "body": "I didn’t ever tell him i was “attached” to him. That just sounds dumb. I just said to you in my previous comments that I professed my feelings for him. *You* used the word “attachment,” kind sir.",
                    "author": "CinnamonSugar39",
                    "id": "gprkgfi",
                    "parent_id": "t1_gpqu0c0",
                    "score": 2,
                    "created_utc": 1614946683.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "She’s referring to my previous post, which is linked in this post.",
            "author": "CinnamonSugar39",
            "id": "gpq8jab",
            "parent_id": "t1_gpq5lpo",
            "score": 2,
            "created_utc": 1614911017.0,
            "replies": [
                {
                    "body": "I think u/swagsoiree was responding to the user that asked me if all SDs are “like that.”",
                    "author": "FoxyFreckles1989",
                    "id": "gpqd0tu",
                    "parent_id": "t1_gpq8jab",
                    "score": 1,
                    "created_utc": 1614913379.0,
                    "replies": [
                        {
                            "body": "Yes, exactly.",
                            "author": null,
                            "id": "gpqf6zg",
                            "parent_id": "t1_gpqd0tu",
                            "score": 2,
                            "created_utc": 1614914568.0,
                            "replies": [
                                {
                                    "body": "Oh, sorry!",
                                    "author": "CinnamonSugar39",
                                    "id": "gpqg87g",
                                    "parent_id": "t1_gpqf6zg",
                                    "score": 2,
                                    "created_utc": 1614915146.0,
                                    "replies": [
                                        {
                                            "body": "Was just trying to help clarify! 😊",
                                            "author": "FoxyFreckles1989",
                                            "id": "gpqj3ql",
                                            "parent_id": "t1_gpqg87g",
                                            "score": 1,
                                            "created_utc": 1614916773.0,
                                            "replies": [
                                                {
                                                    "body": "Yes! Thank you, love. 💗",
                                                    "author": "CinnamonSugar39",
                                                    "id": "gpqjbj8",
                                                    "parent_id": "t1_gpqj3ql",
                                                    "score": 2,
                                                    "created_utc": 1614916897.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I didn’t ever tell him i was “attached” to him. That just sounds dumb. I just said to you in my previous comments that I professed my feelings for him. *You* used the word “attachment,” kind sir.",
            "author": "CinnamonSugar39",
            "id": "gprkgfi",
            "parent_id": "t1_gpqu0c0",
            "score": 2,
            "created_utc": 1614946683.0,
            "replies": []
        },
        {
            "body": "I think u/swagsoiree was responding to the user that asked me if all SDs are “like that.”",
            "author": "FoxyFreckles1989",
            "id": "gpqd0tu",
            "parent_id": "t1_gpq8jab",
            "score": 1,
            "created_utc": 1614913379.0,
            "replies": [
                {
                    "body": "Yes, exactly.",
                    "author": null,
                    "id": "gpqf6zg",
                    "parent_id": "t1_gpqd0tu",
                    "score": 2,
                    "created_utc": 1614914568.0,
                    "replies": [
                        {
                            "body": "Oh, sorry!",
                            "author": "CinnamonSugar39",
                            "id": "gpqg87g",
                            "parent_id": "t1_gpqf6zg",
                            "score": 2,
                            "created_utc": 1614915146.0,
                            "replies": [
                                {
                                    "body": "Was just trying to help clarify! 😊",
                                    "author": "FoxyFreckles1989",
                                    "id": "gpqj3ql",
                                    "parent_id": "t1_gpqg87g",
                                    "score": 1,
                                    "created_utc": 1614916773.0,
                                    "replies": [
                                        {
                                            "body": "Yes! Thank you, love. 💗",
                                            "author": "CinnamonSugar39",
                                            "id": "gpqjbj8",
                                            "parent_id": "t1_gpqj3ql",
                                            "score": 2,
                                            "created_utc": 1614916897.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Yes, exactly.",
            "author": null,
            "id": "gpqf6zg",
            "parent_id": "t1_gpqd0tu",
            "score": 2,
            "created_utc": 1614914568.0,
            "replies": [
                {
                    "body": "Oh, sorry!",
                    "author": "CinnamonSugar39",
                    "id": "gpqg87g",
                    "parent_id": "t1_gpqf6zg",
                    "score": 2,
                    "created_utc": 1614915146.0,
                    "replies": [
                        {
                            "body": "Was just trying to help clarify! 😊",
                            "author": "FoxyFreckles1989",
                            "id": "gpqj3ql",
                            "parent_id": "t1_gpqg87g",
                            "score": 1,
                            "created_utc": 1614916773.0,
                            "replies": [
                                {
                                    "body": "Yes! Thank you, love. 💗",
                                    "author": "CinnamonSugar39",
                                    "id": "gpqjbj8",
                                    "parent_id": "t1_gpqj3ql",
                                    "score": 2,
                                    "created_utc": 1614916897.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Oh, sorry!",
            "author": "CinnamonSugar39",
            "id": "gpqg87g",
            "parent_id": "t1_gpqf6zg",
            "score": 2,
            "created_utc": 1614915146.0,
            "replies": [
                {
                    "body": "Was just trying to help clarify! 😊",
                    "author": "FoxyFreckles1989",
                    "id": "gpqj3ql",
                    "parent_id": "t1_gpqg87g",
                    "score": 1,
                    "created_utc": 1614916773.0,
                    "replies": [
                        {
                            "body": "Yes! Thank you, love. 💗",
                            "author": "CinnamonSugar39",
                            "id": "gpqjbj8",
                            "parent_id": "t1_gpqj3ql",
                            "score": 2,
                            "created_utc": 1614916897.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Was just trying to help clarify! 😊",
            "author": "FoxyFreckles1989",
            "id": "gpqj3ql",
            "parent_id": "t1_gpqg87g",
            "score": 1,
            "created_utc": 1614916773.0,
            "replies": [
                {
                    "body": "Yes! Thank you, love. 💗",
                    "author": "CinnamonSugar39",
                    "id": "gpqjbj8",
                    "parent_id": "t1_gpqj3ql",
                    "score": 2,
                    "created_utc": 1614916897.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Yes! Thank you, love. 💗",
            "author": "CinnamonSugar39",
            "id": "gpqjbj8",
            "parent_id": "t1_gpqj3ql",
            "score": 2,
            "created_utc": 1614916897.0,
            "replies": []
        }
    ]
}