{
    "title": "Sincerely, Your Chocolate Princess",
    "post_id": "igjb80",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/igjb80/sincerely_your_chocolate_princess/",
    "author": "SugarBabyStoner",
    "body": "This thread is advice for SD's talking to or trying to attract a black or mixed SB. I'm honestly just trying to tell you what turns me/ many of us off so you can avoid it.\n\n1. Anything using the word exotic. It's always exoticization and it's always uncomfortable. I'm not exotic, I'm me. Am I to assume that means I look different than a traditionally attractive white female? Because, uh, yes. I am. I know it. You know it. Let's move on.\n2. I love black/mixed/POC girls. This is honestly just so weird. If you messaged a white woman and you just said \"I love white women\" they would be freaked the hell out, and rightly so. Treat me as me, not a cachet item. If you're looking to attract a black woman, some coded ways for her to know you might be a safe option for her are:\n\n* I'm very liberal\n* I'm open-minded\n* using the all ethnicities tag on Seeking\n* general compliments on my appearance\n\n1. Never ever (even out of curiosity) ask if they've done race play before with any SDs. This is often read as a sign that that's what you want, and that discomfort carries forward, even if it's not brought up again.\n2. Don't ask if I have a dad in my life (unless you're talking about family). I was actually born in a test tube and am baffled by the concept of fatherhood /s\n3. Don't compare my skin or hair to food. If I hear the word chocolate to describe me, I'm probably not responding because I'm in my bathroom gagging. It's contrived.\n\nBlack & mixed SBs, please feel free to add to this list in the comments.  \n\n\nEDIT: Sorry about the numbering being off. It's messing with me too, but Reddit keeps autocorrecting it to this.",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/igjb80/sincerely_your_chocolate_princess/",
    "score": 308,
    "upvote_ratio": 0.96,
    "created_utc": 1598384072.0,
    "num_comments": 99,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "Think of it this way. I'm a black sb and I like white guys but how crazy would if I start talking like\n\n-\"I love me some white chocolate men\"\n\n-\"I love your creamy white skin\"\n\n-\"My Caucasian King🤪🤪\"(I definitely made this one up 😂)",
            "author": "hiphoplarry27",
            "id": "g2u9las",
            "parent_id": "t3_igjb80",
            "score": 125,
            "created_utc": 1598388008.0,
            "replies": [
                {
                    "body": "“I love how sunburned you get” 🥵",
                    "author": "simply_unaffected",
                    "id": "g2uisqy",
                    "parent_id": "t1_g2u9las",
                    "score": 142,
                    "created_utc": 1598392665.0,
                    "replies": [
                        {
                            "body": "😂",
                            "author": "LikeHoney99",
                            "id": "g2uiz4f",
                            "parent_id": "t1_g2uisqy",
                            "score": 11,
                            "created_utc": 1598392756.0,
                            "replies": [
                                {
                                    "body": "based off “you don’t need sunscreen do you?” uh, yes i do, i might be tan but i don’t want skin cancer... \n\nand “are you just putting on sunscreen so you stay lighter?” huh?? some kinda weird colorism projection bc they don’t wanna be tan or...?",
                                    "author": "simply_unaffected",
                                    "id": "g2uk8je",
                                    "parent_id": "t1_g2uiz4f",
                                    "score": 28,
                                    "created_utc": 1598393420.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "I’m gonna start saying this😂",
                            "author": "ginnaao",
                            "id": "g2usods",
                            "parent_id": "t1_g2uisqy",
                            "score": 5,
                            "created_utc": 1598397978.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "“My Mayo Prince”😍 😂😂😂",
                    "author": "sienfiekdsa",
                    "id": "g2v4dtq",
                    "parent_id": "t1_g2u9las",
                    "score": 57,
                    "created_utc": 1598404478.0,
                    "replies": [
                        {
                            "body": "Mayo is my automatic come back lmao they hate it so much",
                            "author": "BisforBands",
                            "id": "g2wdanu",
                            "parent_id": "t1_g2v4dtq",
                            "score": 5,
                            "created_utc": 1598439904.0,
                            "replies": []
                        },
                        {
                            "body": "I almost died just now.",
                            "author": "raychelpotter",
                            "id": "g2x0edk",
                            "parent_id": "t1_g2v4dtq",
                            "score": 2,
                            "created_utc": 1598454456.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "“I love how pasty you are.”",
                    "author": "YourExoticBabe",
                    "id": "g2udvtg",
                    "parent_id": "t1_g2u9las",
                    "score": 51,
                    "created_utc": 1598390154.0,
                    "replies": [
                        {
                            "body": "Thank you for making me look crazy for laughing out loud out of the blue in a public setting.",
                            "author": "GDarn",
                            "id": "g2uhj0t",
                            "parent_id": "t1_g2udvtg",
                            "score": 10,
                            "created_utc": 1598392018.0,
                            "replies": [
                                {
                                    "body": "Anytime!",
                                    "author": "YourExoticBabe",
                                    "id": "g2uj9o3",
                                    "parent_id": "t1_g2uhj0t",
                                    "score": 10,
                                    "created_utc": 1598392910.0,
                                    "replies": [
                                        {
                                            "body": "Come to think of it, I will ask my SB if she thinks I am pasty.\n\nGod, I hope she is not on this forum so she does not see this question coming.",
                                            "author": "GDarn",
                                            "id": "g2uk2c4",
                                            "parent_id": "t1_g2uj9o3",
                                            "score": 11,
                                            "created_utc": 1598393329.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "Lmao",
                            "author": "Babywish",
                            "id": "g2v5mz1",
                            "parent_id": "t1_g2udvtg",
                            "score": 2,
                            "created_utc": 1598405171.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "“I love me some mayosapiens”",
                    "author": "LikeHoney99",
                    "id": "g2uefyy",
                    "parent_id": "t1_g2u9las",
                    "score": 48,
                    "created_utc": 1598390436.0,
                    "replies": []
                },
                {
                    "body": "I said this once. I’m Black Caribbean and I get call “exotic” so much... or worst, told that I’m not “really Black” because I have “butterscotch skin and such beautiful curls” 🤢 \n\nSo I called this man an Ivory dope (like ivory soap) and he was like wth? I said you know that cheap ass soap that nobody likes but if you’re poor you’ll deal with it? You’re an Ivory Dope. \n\nHe blocked me 😂",
                    "author": "AlinaAllure",
                    "id": "g2xp6kl",
                    "parent_id": "t1_g2u9las",
                    "score": 10,
                    "created_utc": 1598466099.0,
                    "replies": [
                        {
                            "body": "That is such a creative comeback ! 😂",
                            "author": "kirathekira",
                            "id": "g2xqapt",
                            "parent_id": "t1_g2xp6kl",
                            "score": 2,
                            "created_utc": 1598466579.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Wtf that would actually really turn me on!",
                    "author": "mrjimmyjsz",
                    "id": "g2urvwh",
                    "parent_id": "t1_g2u9las",
                    "score": 6,
                    "created_utc": 1598397555.0,
                    "replies": [
                        {
                            "body": "💀💀💀",
                            "author": "LikeHoney99",
                            "id": "g2us7h0",
                            "parent_id": "t1_g2urvwh",
                            "score": 5,
                            "created_utc": 1598397728.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "To be honest, if you said any of those lines to me, I’d instantly both fall over laughing and fall in love.  These are hilarious and I will be stealing them.",
                    "author": "ORD-inary",
                    "id": "g2vthle",
                    "parent_id": "t1_g2u9las",
                    "score": 4,
                    "created_utc": 1598420016.0,
                    "replies": []
                },
                {
                    "body": "Hilarious",
                    "author": "templewander",
                    "id": "g2w98ii",
                    "parent_id": "t1_g2u9las",
                    "score": 1,
                    "created_utc": 1598435793.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "OH BOY let me get started on this one, sorry if this is a little convoluted, I’m between classes and trying to make this quick. My parents are immigrants and I was born & raised in the US. I am American but well connected to my culture and very educated about my family traditions / religion. i’ve had SDs try and shove me into the exotic/un-American box which I’m clearly not and others that try and shove me into the “educated to erase her savage customs”/completely Americanized box and I’m not that either!\n\nPlease understand that bashing my culture by saying how American I am is not a compliment because it’s part of my identity, I can be both things at once! It’s not flattery to say wow you’re so much more like the white ideal than I thought you’d be... that’s like telling a light skin Black woman that she’s “one of the pretty ones” because of her skin tone, it’s disgusting. This whole rhetoric that you want us but not the cultural and racial identities that we come attached to, or that we have rejected them for whiteness is just so wrong and weird coming from a white person. It’s like mansplaining menstruation to a woman. \n\nThis is a recent [post ](https://www.removeddit.com/r/AmItheAsshole/comments/igd9rs/aita_for_flipping_a_drink_on_my_date/?utm_source=share&utm_medium=ios_app&utm_name=iossmf)that blew up on Reddit (edit: I see that this is removed, but you can still view it w/ removeddit now that I modified the link) that closely describes something that’s happened to me before minus the drink flipping lol. It’s pretty invalidating because the SD had never experienced my culture or grew up with it himself, so how can you make judgements on entire countries' beliefs and ways of life?\n\nIt’s also hard to speak up and correct an SD in fear that I might offend them or imply that their thought is racist (it might have come from from an ignorant/entitled place) when they hold a lot of power in the relationship. I’d love to have more open discussions about race with SDs, and if you’re in doubt if saying something is okay, just ask! I’d love to tell you how I feel about something in reference to myself and have an interesting discussion about race/culture :) The goal isn’t to make anyone uncomfortable, but if you are it’s because you’re learning comparing behaviors you know are wrong to your own actions (and this really isn’t just a generational thing, everyone should treat others with respect, I feel like labeling offended SBs as SJWs or too liberal is just another way of undermining their experiences with racists in the bowl)",
            "author": "simply_unaffected",
            "id": "g2ulpld",
            "parent_id": "t3_igjb80",
            "score": 42,
            "created_utc": 1598394201.0,
            "replies": [
                {
                    "body": "As a Nigerian you hit every point I’ve ever tried to explain but been accused of being “sensitive”",
                    "author": "ginnaao",
                    "id": "g2usvo9",
                    "parent_id": "t1_g2ulpld",
                    "score": 18,
                    "created_utc": 1598398088.0,
                    "replies": [
                        {
                            "body": "nah it might be fat money but u just gotta ask yourself until what point the disrespect is worth it. and it’s ok if your answer is yes, but be aware and be vigilant, and the second something crosses the line—whatever that might be—it’s time to say my safety and worth as an individual isn’t a priority anymore and being ignorant about your actions with ___ is a boundary for me. \n\nand it’s so much better when you find a guy that doesn’t have prejudices that they grew up with (even if it’s not always their fault, at least for me they now live in a diverse area and it’s clear they haven’t made any efforts to educate themselves to be better/more considerate to POC) because small things don’t get your mood down during the date that you have to just smile past or make a mental note of LOL. like you’re already on guard as an SB so it’s not that much of a leap but it’s a relief when you know you’re not being fetishized or subconsciously seen as less than. \n\nif you ever want to chat more feel free to send me a DM! <3",
                            "author": "simply_unaffected",
                            "id": "g2vekmu",
                            "parent_id": "t1_g2usvo9",
                            "score": 5,
                            "created_utc": 1598410062.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "I can’t speak for all SDs but I think there are some of us that would love for you to share these thoughts.  Learning the perspective of a young woman on the world is a major reason why I do this.  \n\nAn SBs view of the world is insightful, even when I disagree with it because it gives me yet another perspective/lens to view the world around me.  Quite practically, it’s been invaluable in my work to find ways to connect with younger people and motivate them. \n\nEven with the BLM movement, while I understand and agree with the reasons behind the movement, experiencing the extreme emotions it’s caused in my current SB in real time has really opened my eyes, more than I think they would have otherwise been opened, to the importance of this movement in America.",
                    "author": "ORD-inary",
                    "id": "g2vuet5",
                    "parent_id": "t1_g2ulpld",
                    "score": 12,
                    "created_utc": 1598420787.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "“ I’ve never been with a black girl before.” \n\nJUST DON’T.",
            "author": "Anotherrandomgirlsss",
            "id": "g2uqq37",
            "parent_id": "t3_igjb80",
            "score": 37,
            "created_utc": 1598396920.0,
            "replies": [
                {
                    "body": "I had to say this to a black SB before after she ASKED ME on our M&G!",
                    "author": "mrjimmyjsz",
                    "id": "g2urylu",
                    "parent_id": "t1_g2uqq37",
                    "score": 1,
                    "created_utc": 1598397594.0,
                    "replies": [
                        {
                            "body": "Being asked is way different from excitedly offering that commentary as if she's supposed to give you a gold star for dating outside your race",
                            "author": "bbsonar",
                            "id": "g2v5wrp",
                            "parent_id": "t1_g2urylu",
                            "score": 16,
                            "created_utc": 1598405323.0,
                            "replies": []
                        },
                        {
                            "body": "That’s different. Don’t just come out and say it. Especially in a message. It’s distasteful.",
                            "author": "Anotherrandomgirlsss",
                            "id": "g2v5m2a",
                            "parent_id": "t1_g2urylu",
                            "score": 7,
                            "created_utc": 1598405157.0,
                            "replies": []
                        },
                        {
                            "body": "I've always been asked this question at some point since I do tend to look outside my race in the bowl.  The one that bugs me the most is \"So do you only date (insert race here) girls?\"\n\nMy favorite (and true) response: \"I like what likes me.\" :)",
                            "author": "Patrucio71",
                            "id": "g2wmbsi",
                            "parent_id": "t1_g2urylu",
                            "score": 4,
                            "created_utc": 1598446868.0,
                            "replies": [
                                {
                                    "body": "They are most likely deciding whether or not you consider them as a fetish",
                                    "author": "Anotherrandomgirlsss",
                                    "id": "g2xg5u1",
                                    "parent_id": "t1_g2wmbsi",
                                    "score": 7,
                                    "created_utc": 1598461942.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "This is a prime sauce post for BIPOC SB. \nThanks.",
            "author": "sauce_on_sneakers",
            "id": "g2udht8",
            "parent_id": "t3_igjb80",
            "score": 25,
            "created_utc": 1598389958.0,
            "replies": []
        },
        {
            "body": ">Treat me as me\n\nThis is what it all boils down to in the end. Each individual is unique, and one of the joys in dating is in getting to know those qualities in your partner.",
            "author": "roscoe7585",
            "id": "g2udgug",
            "parent_id": "t3_igjb80",
            "score": 26,
            "created_utc": 1598389945.0,
            "replies": []
        },
        {
            "body": "Excellent post. I am so happy another woman expressed this thought. This is exactly the reason why SA is completely useless for so many of us.",
            "author": "freeppl99",
            "id": "g2ufaon",
            "parent_id": "t3_igjb80",
            "score": 10,
            "created_utc": 1598390864.0,
            "replies": []
        },
        {
            "body": "And you stated the facts. 😌💅🏽",
            "author": "Daisylil",
            "id": "g2u98xz",
            "parent_id": "t3_igjb80",
            "score": 20,
            "created_utc": 1598387839.0,
            "replies": []
        },
        {
            "body": "You should be offended if receiving messages like that. They are pandering and/or attempting to cover their own innate biases. Thank you for posting.",
            "author": "Intrepid_Seeker",
            "id": "g2ul3bt",
            "parent_id": "t3_igjb80",
            "score": 10,
            "created_utc": 1598393871.0,
            "replies": []
        },
        {
            "body": "I hate when they ask if I like white men. If I didn't I probably wouldn't be talking to you.",
            "author": "420_spice",
            "id": "g2w80f8",
            "parent_id": "t3_igjb80",
            "score": 8,
            "created_utc": 1598434506.0,
            "replies": [
                {
                    "body": "Girl!!!! So irritating. Then the select few who go on and on about the age difference, like you selected a woman half your age?!? Why do i have to now assure you that age is no problem?? Smh",
                    "author": "BisforBands",
                    "id": "g2wdl0l",
                    "parent_id": "t1_g2w80f8",
                    "score": 5,
                    "created_utc": 1598440179.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "“My *insert family member here* is racist”. Okayy, and are y’all working on that or is it just your fun fact? 🤦🏽‍♀️",
            "author": "bethanyazalea",
            "id": "g2y3y7u",
            "parent_id": "t3_igjb80",
            "score": 8,
            "created_utc": 1598472771.0,
            "replies": []
        },
        {
            "body": "Girl, *snaps in agreement*\n\nBless you.",
            "author": "bsbdfw",
            "id": "g2vdbnt",
            "parent_id": "t3_igjb80",
            "score": 6,
            "created_utc": 1598409364.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "g2u4cpu",
            "parent_id": "t3_igjb80",
            "score": 36,
            "created_utc": 1598385471.0,
            "replies": [
                {
                    "body": "Honestly I made this post mostly because of the messages I get on SA. Usually find that this stuff comes out in DMs. I doubt they're using a text search to find me, nothing except my profile pics and my mixed tag indicates my racial identity.",
                    "author": "SugarBabyStoner",
                    "id": "g2u8eyu",
                    "parent_id": "t1_g2u4cpu",
                    "score": 18,
                    "created_utc": 1598387432.0,
                    "replies": []
                },
                {
                    "body": "Somehow my attempt at saying the same thing got downvoted to oblivion.  Let's see if the same thing happens to yours.",
                    "author": "SDstartingOut",
                    "id": "g2uce4h",
                    "parent_id": "t1_g2u4cpu",
                    "score": -2,
                    "created_utc": 1598389396.0,
                    "replies": []
                },
                {
                    "body": "The use of these terms in SB's profiles is fairly prevalent... As part of their headline or username even. (ie - MochaLatteDelite427 means there are 426 \\*other\\* MochaLatteDelites)\n\n...think I'll change my username to PastyMayoSapien  with the tagline: \"Zero to lobster in 10 minutes\" and see how that goes ;) :D",
                    "author": "Patrucio71",
                    "id": "g2wm0ig",
                    "parent_id": "t1_g2u4cpu",
                    "score": 0,
                    "created_utc": 1598446664.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Solid post.  Thanks.",
            "author": "MrBuzzard",
            "id": "g2u2dcg",
            "parent_id": "t3_igjb80",
            "score": 11,
            "created_utc": 1598384533.0,
            "replies": []
        },
        {
            "body": "Just my two cents, every \"sb-of-color\" I've ever spoken with, what you've said is spot on. We just converse, I don't go out of my way to try and... relate? I guess. That's fucking disgusting. There's ALWAYS common ground without having to be super weird about it.\n\nMy joking advice for other SDs would be... when in doubt, just quote Outkast and you'll be alright.",
            "author": "peoplesmeeple",
            "id": "g2vd3ac",
            "parent_id": "t3_igjb80",
            "score": 5,
            "created_utc": 1598409236.0,
            "replies": [
                {
                    "body": "“Hey Ya!”",
                    "author": "BeautyGr8ce",
                    "id": "g2wkaae",
                    "parent_id": "t1_g2vd3ac",
                    "score": 2,
                    "created_utc": 1598445523.0,
                    "replies": [
                        {
                            "body": "That's it!! LOL",
                            "author": "peoplesmeeple",
                            "id": "g2z27pd",
                            "parent_id": "t1_g2wkaae",
                            "score": 1,
                            "created_utc": 1598489903.0,
                            "replies": [
                                {
                                    "body": "I couldn’t help myself ... 😆\n\n....\n\nYou think you've got it\n\nOh, you think you've got it\n\nBut got it just don't get it when there's nothin' at all\n\nWe get together\n\nOh, we get together\n\nBut separate's always better when there's feelings involved\n\nKnow what they say -its\n\nNothing lasts forever!\n\nThen what makes it, then what makes it\n\nThen what makes it, then what makes it\n\nThen what makes SUGAR the exception?",
                                    "author": "BeautyGr8ce",
                                    "id": "g2z2f5j",
                                    "parent_id": "t1_g2z27pd",
                                    "score": 2,
                                    "created_utc": 1598490014.0,
                                    "replies": [
                                        {
                                            "body": "😆  😆  😆  😆\n\n\"I like the waaaay you move\" - but also do the horn bast after that \"doo doooo\"",
                                            "author": "peoplesmeeple",
                                            "id": "g3lrucm",
                                            "parent_id": "t1_g2z2f5j",
                                            "score": 2,
                                            "created_utc": 1598976622.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Love the points stated and how they clearly stay on track with the “don’t objectify me” and not “don’t speak if you’re a white person.” I agree with them and think anyone trying too hard to search for excuses is being needlessly pedantic and is likely part of the problem. You can always be better. Why try so hard to maintain the status quo when being considerate is only a couple of steps in the right direction?",
            "author": "BunsGoSquish",
            "id": "g2vh59w",
            "parent_id": "t3_igjb80",
            "score": 4,
            "created_utc": 1598411495.0,
            "replies": []
        },
        {
            "body": "I wish I could give this more than one upvote!",
            "author": null,
            "id": "g2u7s29",
            "parent_id": "t3_igjb80",
            "score": 9,
            "created_utc": 1598387123.0,
            "replies": []
        },
        {
            "body": "This is a prime sauce post for BIPOC SB.\nThanks.",
            "author": "sauce_on_sneakers",
            "id": "g2udj68",
            "parent_id": "t3_igjb80",
            "score": 6,
            "created_utc": 1598389978.0,
            "replies": []
        },
        {
            "body": "Race play? Dare I ask what that is? 😳",
            "author": "testing1to3",
            "id": "g2vevd5",
            "parent_id": "t3_igjb80",
            "score": 2,
            "created_utc": 1598410223.0,
            "replies": [
                {
                    "body": "Honestly, you don't wanna know.",
                    "author": "bsbdfw",
                    "id": "g2x5lnb",
                    "parent_id": "t1_g2vevd5",
                    "score": 3,
                    "created_utc": 1598456965.0,
                    "replies": []
                },
                {
                    "body": "Def google it",
                    "author": "unlike_glossier",
                    "id": "g2x5irb",
                    "parent_id": "t1_g2vevd5",
                    "score": 1,
                    "created_utc": 1598456925.0,
                    "replies": []
                },
                {
                    "body": "Think if you got off to being called racial slurs and he got off saying things that would make a nazi blush... or vice versus",
                    "author": "AlinaAllure",
                    "id": "g2xpbbc",
                    "parent_id": "t1_g2vevd5",
                    "score": 1,
                    "created_utc": 1598466155.0,
                    "replies": [
                        {
                            "body": "Eeeks sounds like some humiliation kink.",
                            "author": "testing1to3",
                            "id": "g2y0vga",
                            "parent_id": "t1_g2xpbbc",
                            "score": 1,
                            "created_utc": 1598471366.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Actually yeah these are pretty spot on for me lol",
            "author": "EorzeanPrincess",
            "id": "g2vj9wy",
            "parent_id": "t3_igjb80",
            "score": 2,
            "created_utc": 1598412756.0,
            "replies": []
        },
        {
            "body": "YES THANK YOU FOR THIS",
            "author": "lesbabyy",
            "id": "g2vjyll",
            "parent_id": "t3_igjb80",
            "score": 2,
            "created_utc": 1598413174.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "g2wl3fg",
            "parent_id": "t3_igjb80",
            "score": 2,
            "created_utc": 1598446065.0,
            "replies": [
                {
                    "body": "💕",
                    "author": "SugarBabyStoner",
                    "id": "g2xfvrb",
                    "parent_id": "t1_g2wl3fg",
                    "score": 1,
                    "created_utc": 1598461812.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Woooooow sis, say it louder for the ones in the back 👍🏾👏🏾👏🏾👏🏾",
            "author": "AvenueLane96",
            "id": "g2wudri",
            "parent_id": "t3_igjb80",
            "score": 2,
            "created_utc": 1598451515.0,
            "replies": []
        },
        {
            "body": "It goes both ways honestly I've had guys ask me if \"I would see AA men\" like um do that many people really say no??? Jfc",
            "author": null,
            "id": "g2xkzcb",
            "parent_id": "t3_igjb80",
            "score": 2,
            "created_utc": 1598464176.0,
            "replies": [
                {
                    "body": "i had a pot SB say she wasn’t interested after a bit of chatting because “she only goes out with people who breed exclusively within their own race.” i.e. she was offended that i didn’t *only* date white girls.\n\nso yeah, people suck! lol.",
                    "author": null,
                    "id": "g2xypyy",
                    "parent_id": "t1_g2xkzcb",
                    "score": 1,
                    "created_utc": 1598470378.0,
                    "replies": [
                        {
                            "body": "Ughhhh that hurts my heart 😫😫",
                            "author": null,
                            "id": "g2y0hgu",
                            "parent_id": "t1_g2xypyy",
                            "score": 1,
                            "created_utc": 1598471188.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I’m mixed Asian and a lot of this can apply, especially those coded words definitely make me feel a lot more safe. This is a v important post ❤️",
            "author": "kirathekira",
            "id": "g2xpzme",
            "parent_id": "t3_igjb80",
            "score": 2,
            "created_utc": 1598466447.0,
            "replies": []
        },
        {
            "body": "I'm so glad you wrote this. As I white girl myself, I acted like a fool when I first started dating men of color. I grew up in a very conservative, white city and I genuinely had culture shock when I started dating outside of my race. I look back now and am so embarrassed about some of the things I did. It certainly wasn't ever ill-intended, if anything, I was trying to become more educated but I look back and just cringe at some of my ignorant comments.\n\nI'm so glad you made this post because I would have benefited greatly from reading this earlier in my life. Sometimes trying to be politically correct and open-minded still ends with us putting our foot in our mouths. The guy I've dated the longest is Colombian and often makes little comments that he likes my skin or hair and even that makes me wonder if that's my appeal to him, so I cannot imagine what it's like to deal with that every day.",
            "author": "LVSugarBebe",
            "id": "g37vyr3",
            "parent_id": "t3_igjb80",
            "score": 2,
            "created_utc": 1598683387.0,
            "replies": [
                {
                    "body": "💕",
                    "author": "SugarBabyStoner",
                    "id": "g38rns5",
                    "parent_id": "t1_g37vyr3",
                    "score": 2,
                    "created_utc": 1598711368.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "This is a prime sauce post for BIPOC SB.\n\nThank you!",
            "author": "sauce_on_sneakers",
            "id": "g2udmo7",
            "parent_id": "t3_igjb80",
            "score": 3,
            "created_utc": 1598390027.0,
            "replies": []
        },
        {
            "body": "What is \"Race play\"?",
            "author": null,
            "id": "g2uqod0",
            "parent_id": "t3_igjb80",
            "score": 2,
            "created_utc": 1598396896.0,
            "replies": [
                {
                    "body": "https://www.google.com/search?q=race+play",
                    "author": "RoseTyler38",
                    "id": "g2uvv59",
                    "parent_id": "t1_g2uqod0",
                    "score": 3,
                    "created_utc": 1598399722.0,
                    "replies": [
                        {
                            "body": "Well, bugger me, what will they think of next?!?",
                            "author": null,
                            "id": "g2v2m1b",
                            "parent_id": "t1_g2uvv59",
                            "score": 1,
                            "created_utc": 1598403494.0,
                            "replies": [
                                {
                                    "body": "I’ve done this before and it was weird at first but actually very hot...and felt like we were breaking the law.",
                                    "author": null,
                                    "id": "g2vlrty",
                                    "parent_id": "t1_g2v2m1b",
                                    "score": 1,
                                    "created_utc": 1598414295.0,
                                    "replies": [
                                        {
                                            "body": "Technically, it is part of bdsm, but a prickly fetish to openly discuss even for there. I have had several lovely women of color as SB's in the past (note that all of my SB's are for a d/s relationship) and I had one ask for it, so I complied. My genre of bdsm is normally very light on degradation, so it felt a little uncomfortable to me, but she seemed to ummm \"enjoy\" it, and that is the primary focus of my own genre, so that fulfilled me that she did.  But yes, can certainly understand the taboo feeling, it is taboo in a world that doesn't bat an eye at say, incest play(as a fantasy), so there you go. Glad you enjoyed yourself. :)",
                                            "author": "SDInLeather",
                                            "id": "g2xsgkk",
                                            "parent_id": "t1_g2vlrty",
                                            "score": 3,
                                            "created_utc": 1598467526.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "I can imagine! I mean, it is just so taboo! Honestly don't know if I could. I mean, I don't mind my SB making fun of me, old man body, grey hair on the chest, need viagra to get it up, no stamina etc etc, we just laugh and laugh, but race stuff...",
                                            "author": null,
                                            "id": "g2vmk3b",
                                            "parent_id": "t1_g2vlrty",
                                            "score": 2,
                                            "created_utc": 1598414802.0,
                                            "replies": [
                                                {
                                                    "body": "Yeah different strokes. And this wasn’t with a sugar daddy this was with a vanilla boyfriend I had.",
                                                    "author": null,
                                                    "id": "g2wdajs",
                                                    "parent_id": "t1_g2vmk3b",
                                                    "score": 1,
                                                    "created_utc": 1598439901.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Interesting you say that one piece because most white girls (women) who date black guys that is that they (black guys) always say, \"Love white girls!\" \n\nThe weird thing is that is how guys talk. Get 20 guys in a room and they will discuss, \"I have a thing for asian women, latinas, black girls, white chicks\" \n\nTake away the descriptor and nobody knows what in  hell the other guy is talking about. Slim, thick, average again all descriptors and all okay. We all have different preferences and attractions.\n\nYour reference to skin color/food 50% of AA SB profiles say, \"Your chocolate dream, like chocolate?, sweeter the berry, cocoa, caramel\" etc etc etc.",
            "author": "bookworm010101",
            "id": "g2uzhnt",
            "parent_id": "t3_igjb80",
            "score": 2,
            "created_utc": 1598401771.0,
            "replies": []
        },
        {
            "body": "Yall this thread killed me😂😂",
            "author": "aipsru",
            "id": "g2z5jod",
            "parent_id": "t3_igjb80",
            "score": 1,
            "created_utc": 1598491698.0,
            "replies": []
        },
        {
            "body": "The rather unfortunate situation here though is that at least in my neck of the woods, the number of SB's themselves that use these terms is a huge percentage. SD's are going to pick up on that and mirror it back, thinking that is what is expected and acceptable.  When I say a huge percentage, I'm talking upwards of 50% having those terms in their subject line alone, much less in the description.  \n\nNeedless to say, this isn't a \"one size fits all\" type of scenario and some of the biggest offenders are your fellow SB's making it seem normal.",
            "author": "discrete_one2",
            "id": "g2um8q4",
            "parent_id": "t3_igjb80",
            "score": 0,
            "created_utc": 1598394484.0,
            "replies": [
                {
                    "body": "SBs are skilled at making SD fantasies a reality. So if the SDs in your neck of the woods tends toward those terms, maybe those SBs have tried to play into the fantasy rather than fight it (since they know they're going to hear it anyway).\n\nWhat OP is referring to is unsolicited, fetishizing comments about race. It's objectifying to be compared to food and othering to be seen as exotic. Please don't shift the blame to SBs and say they're the biggest offenders when they're likely just anticipating what oblivious SDs are going to say anyway.",
                    "author": "bbsonar",
                    "id": "g2v5h82",
                    "parent_id": "t1_g2um8q4",
                    "score": 12,
                    "created_utc": 1598405083.0,
                    "replies": [
                        {
                            "body": "I'm well aware of what the poster is referring to, but thanks for 'splaining' it to me.  Pointing out the fact that there are a large number of voices from the SB side of things as well has nothing to do with the shifting of anything, much less blame.  We need to get away from this whole Us vs. Them mentality that serves to hinder discussion and moving things forward.    \n\n\nAs the poster herself quite eloquently pointed out, she would just as soon lose her lunch in the bathroom than to use such language, so I seriously doubt such a large population of people would willingly describe themselves in such a manner when they could simply feel out the situation and -then- tailor their responses towards whatever fantasy they feel they need to stomach for the sake of an arrangement.  Let us not forget to include the women out there that actually and truly love being compared to food or considered to be exotic.  To do otherwise would be to try and claim that their particular fetish is somehow invalid or shameful.  No one person can speak for everyone.",
                            "author": "discrete_one2",
                            "id": "g2vcdah",
                            "parent_id": "t1_g2v5h82",
                            "score": -2,
                            "created_utc": 1598408832.0,
                            "replies": [
                                {
                                    "body": "And not every conversation is about everyone. You didn't need to all sides this at all",
                                    "author": "BisforBands",
                                    "id": "g2wdo1b",
                                    "parent_id": "t1_g2vcdah",
                                    "score": 5,
                                    "created_utc": 1598440259.0,
                                    "replies": []
                                },
                                {
                                    "body": "Why even point it out though, if not to shift or share the \"blame\" onto SBs?\n\nAlso really doubt that's a \"particular fetish\" and nobody said anything about shaming it. Just that those type of comments from SDs are rude.\n\nOP is trying to do y'all a favor so I don't understand why you have to say \"but but but SBs are the even bigger offender!!\"",
                                    "author": "bbsonar",
                                    "id": "g2wqjwl",
                                    "parent_id": "t1_g2vcdah",
                                    "score": 4,
                                    "created_utc": 1598449478.0,
                                    "replies": [
                                        {
                                            "body": "OP here. Unsolicited fetishization of my body and experience is NEVER the same as women marketing themselves in a fetishized way because they've been taught that sells when alternative presentations don't. It's true that some women have internalized the exoticization of their bodies, but I really don't think this makes any point other than proving that this world is hostile to women who don't act within specific recognized and legitimized performative identities, one of those being the exoticized and sexualized Jezebel stereotype. Y'all always gonna find a way to put it back on black women and you will NOT use my voice to do it.",
                                            "author": "SugarBabyStoner",
                                            "id": "g2y89hf",
                                            "parent_id": "t1_g2wqjwl",
                                            "score": 4,
                                            "created_utc": 1598474712.0,
                                            "replies": [
                                                {
                                                    "body": "I’m black. I will say your OP is based solely upon your preference but shouldn’t be the theme for every black SB. \n\nThere are plenty of black women who enjoy being objectified, called chocolate, exotic, and will be brave enough to say fuck the status quo and taboo I wanna experience race play.  Is there anything wrong with them/us? Nope. Do we fit into your sentiment of disgust? Nope. \n\nSo although I can understand your position, like the other poster said, this this is not a one size fits all matter and you should accept the diversity in that instead of making it yet another contentious issue. \n\nOkay, you don’t like it. So what? Stick with what you like and sugar happily.",
                                                    "author": null,
                                                    "id": "g2ym2el",
                                                    "parent_id": "t1_g2y89hf",
                                                    "score": 2,
                                                    "created_utc": 1598481344.0,
                                                    "replies": [
                                                        {
                                                            "body": "I'm not averse to race play as you assume, I'm averse to not being able to consent to the (sometimes traumatic) experience of being asked. Black women can do it as they like and bring it up, but the expectation cannot be placed on us.",
                                                            "author": "SugarBabyStoner",
                                                            "id": "g2z0qfh",
                                                            "parent_id": "t1_g2ym2el",
                                                            "score": 2,
                                                            "created_utc": 1598489114.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "The endless colour-compliments. It is possible to compliment specific features without specifying that mine are dark/brown/black. You can just say my ass is nice. Doesn't have to be my 'black ass'. Y'know?\nI spent all of my teen years just becoming okay with being different than all my peers, and while that's not your fault or problem, I would just like my skin color to not feel like it's the only thing that matters, be that a good or bad thing.",
            "author": "mysecretacct4real",
            "id": "gil7cs7",
            "parent_id": "t3_igjb80",
            "score": 1,
            "created_utc": 1610143023.0,
            "replies": []
        },
        {
            "body": ">If I hear the word chocolate to describe me, I'm probably not responding because I'm in my bathroom gagging\n\nGod, I agree. Too many Black SBs do this and I'm so off put, I rarely get to even read the rest of the profile.",
            "author": "marker3000",
            "id": "g2vvqyd",
            "parent_id": "t3_igjb80",
            "score": 0,
            "created_utc": 1598421937.0,
            "replies": []
        },
        {
            "body": "Well all of you just sound like an absolute joy to hang out with. /s In a market oversaturated with poc working the sugar game you might want to be a little less persnickety.",
            "author": "imjgaltstill",
            "id": "g2xcbm0",
            "parent_id": "t3_igjb80",
            "score": 0,
            "created_utc": 1598460156.0,
            "replies": [
                {
                    "body": "Oh no,  the racist doesn't like me stating the ways I don't like to be degraded! What ever will I do now???? Ladies, quick, help me hide my stream of tears!!!",
                    "author": "SugarBabyStoner",
                    "id": "g2y6vbx",
                    "parent_id": "t1_g2xcbm0",
                    "score": 4,
                    "created_utc": 1598474082.0,
                    "replies": []
                },
                {
                    "body": "You realize you're asking someone to lower their standards about being treated like a human being?",
                    "author": "bbsonar",
                    "id": "g2yr9bp",
                    "parent_id": "t1_g2xcbm0",
                    "score": 3,
                    "created_utc": 1598484052.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "g2ukp65",
            "parent_id": "t3_igjb80",
            "score": 0,
            "created_utc": 1598393666.0,
            "replies": [
                {
                    "body": ">pussy is pussy \n\nCharming.",
                    "author": "blonde-throwaway",
                    "id": "g2upoqo",
                    "parent_id": "t1_g2ukp65",
                    "score": 3,
                    "created_utc": 1598396356.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "\\> Anything using the word exotic. It's always exoticization and it's always uncomfortable.  \n\nDo you even realize how many black women use this on their profiles? So guys are just going to use those terms because that's what we see.\n\nSame with \"african/nubian princess\", it's a cliche at this point.",
            "author": "AdAlternative6041",
            "id": "g2xfkk8",
            "parent_id": "t3_igjb80",
            "score": 0,
            "created_utc": 1598461668.0,
            "replies": [
                {
                    "body": "All I hear you saying is that women are pushed into exoticizing themselves because they know it sells and I couldn't give less of a fuck. y'all out here acting like you never heard of social pressure before this very moment and we are NOT here for it.",
                    "author": "SugarBabyStoner",
                    "id": "g2y79ub",
                    "parent_id": "t1_g2xfkk8",
                    "score": 5,
                    "created_utc": 1598474262.0,
                    "replies": [
                        {
                            "body": ">All I hear you saying is that women are pushed into exoticizing themselves because they know it sells \n\nMaybe so, but my point still stands: if they call themselves \"exotic\" why would you expect men not to call them the same? Isn't that a big part of being tolerant? Calling people the way they want to be called.\n\n&#x200B;\n\n\\>  y'all out here acting like you never heard of social pressure before this very moment and we are NOT here for it. \n\nI know what social pressure is, do you? Because your whole post reeks of it, you are trying to dictate behavior from SDs towards black women. Going further, you are assuming all black women in the bowl think like you.",
                            "author": "AdAlternative6041",
                            "id": "g2z44p0",
                            "parent_id": "t1_g2y79ub",
                            "score": 1,
                            "created_utc": 1598490933.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "g2u2o0b",
            "parent_id": "t3_igjb80",
            "score": -14,
            "created_utc": 1598384673.0,
            "replies": [
                {
                    "body": "It was sarcasm!",
                    "author": "SugarBabyStoner",
                    "id": "g2u2xn9",
                    "parent_id": "t1_g2u2o0b",
                    "score": 24,
                    "created_utc": 1598384801.0,
                    "replies": [
                        {
                            "body": "On a scale of 0 to 10, how do you score his mansplaining?\n\nEdit: grammar",
                            "author": "MyIncognitoMe",
                            "id": "g2u7gjo",
                            "parent_id": "t1_g2u2xn9",
                            "score": 19,
                            "created_utc": 1598386966.0,
                            "replies": [
                                {
                                    "body": "Lol he really just went for some stream of consciousness mansplaining, I'm dead.",
                                    "author": "kittiesntrees",
                                    "id": "g2u7uxy",
                                    "parent_id": "t1_g2u7gjo",
                                    "score": 16,
                                    "created_utc": 1598387162.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "“I love how sunburned you get” 🥵",
            "author": "simply_unaffected",
            "id": "g2uisqy",
            "parent_id": "t1_g2u9las",
            "score": 142,
            "created_utc": 1598392665.0,
            "replies": [
                {
                    "body": "😂",
                    "author": "LikeHoney99",
                    "id": "g2uiz4f",
                    "parent_id": "t1_g2uisqy",
                    "score": 11,
                    "created_utc": 1598392756.0,
                    "replies": [
                        {
                            "body": "based off “you don’t need sunscreen do you?” uh, yes i do, i might be tan but i don’t want skin cancer... \n\nand “are you just putting on sunscreen so you stay lighter?” huh?? some kinda weird colorism projection bc they don’t wanna be tan or...?",
                            "author": "simply_unaffected",
                            "id": "g2uk8je",
                            "parent_id": "t1_g2uiz4f",
                            "score": 28,
                            "created_utc": 1598393420.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "I’m gonna start saying this😂",
                    "author": "ginnaao",
                    "id": "g2usods",
                    "parent_id": "t1_g2uisqy",
                    "score": 5,
                    "created_utc": 1598397978.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "“My Mayo Prince”😍 😂😂😂",
            "author": "sienfiekdsa",
            "id": "g2v4dtq",
            "parent_id": "t1_g2u9las",
            "score": 57,
            "created_utc": 1598404478.0,
            "replies": [
                {
                    "body": "Mayo is my automatic come back lmao they hate it so much",
                    "author": "BisforBands",
                    "id": "g2wdanu",
                    "parent_id": "t1_g2v4dtq",
                    "score": 5,
                    "created_utc": 1598439904.0,
                    "replies": []
                },
                {
                    "body": "I almost died just now.",
                    "author": "raychelpotter",
                    "id": "g2x0edk",
                    "parent_id": "t1_g2v4dtq",
                    "score": 2,
                    "created_utc": 1598454456.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "“I love how pasty you are.”",
            "author": "YourExoticBabe",
            "id": "g2udvtg",
            "parent_id": "t1_g2u9las",
            "score": 51,
            "created_utc": 1598390154.0,
            "replies": [
                {
                    "body": "Thank you for making me look crazy for laughing out loud out of the blue in a public setting.",
                    "author": "GDarn",
                    "id": "g2uhj0t",
                    "parent_id": "t1_g2udvtg",
                    "score": 10,
                    "created_utc": 1598392018.0,
                    "replies": [
                        {
                            "body": "Anytime!",
                            "author": "YourExoticBabe",
                            "id": "g2uj9o3",
                            "parent_id": "t1_g2uhj0t",
                            "score": 10,
                            "created_utc": 1598392910.0,
                            "replies": [
                                {
                                    "body": "Come to think of it, I will ask my SB if she thinks I am pasty.\n\nGod, I hope she is not on this forum so she does not see this question coming.",
                                    "author": "GDarn",
                                    "id": "g2uk2c4",
                                    "parent_id": "t1_g2uj9o3",
                                    "score": 11,
                                    "created_utc": 1598393329.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Lmao",
                    "author": "Babywish",
                    "id": "g2v5mz1",
                    "parent_id": "t1_g2udvtg",
                    "score": 2,
                    "created_utc": 1598405171.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "“I love me some mayosapiens”",
            "author": "LikeHoney99",
            "id": "g2uefyy",
            "parent_id": "t1_g2u9las",
            "score": 48,
            "created_utc": 1598390436.0,
            "replies": []
        },
        {
            "body": "I said this once. I’m Black Caribbean and I get call “exotic” so much... or worst, told that I’m not “really Black” because I have “butterscotch skin and such beautiful curls” 🤢 \n\nSo I called this man an Ivory dope (like ivory soap) and he was like wth? I said you know that cheap ass soap that nobody likes but if you’re poor you’ll deal with it? You’re an Ivory Dope. \n\nHe blocked me 😂",
            "author": "AlinaAllure",
            "id": "g2xp6kl",
            "parent_id": "t1_g2u9las",
            "score": 10,
            "created_utc": 1598466099.0,
            "replies": [
                {
                    "body": "That is such a creative comeback ! 😂",
                    "author": "kirathekira",
                    "id": "g2xqapt",
                    "parent_id": "t1_g2xp6kl",
                    "score": 2,
                    "created_utc": 1598466579.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Wtf that would actually really turn me on!",
            "author": "mrjimmyjsz",
            "id": "g2urvwh",
            "parent_id": "t1_g2u9las",
            "score": 6,
            "created_utc": 1598397555.0,
            "replies": [
                {
                    "body": "💀💀💀",
                    "author": "LikeHoney99",
                    "id": "g2us7h0",
                    "parent_id": "t1_g2urvwh",
                    "score": 5,
                    "created_utc": 1598397728.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "To be honest, if you said any of those lines to me, I’d instantly both fall over laughing and fall in love.  These are hilarious and I will be stealing them.",
            "author": "ORD-inary",
            "id": "g2vthle",
            "parent_id": "t1_g2u9las",
            "score": 4,
            "created_utc": 1598420016.0,
            "replies": []
        },
        {
            "body": "Hilarious",
            "author": "templewander",
            "id": "g2w98ii",
            "parent_id": "t1_g2u9las",
            "score": 1,
            "created_utc": 1598435793.0,
            "replies": []
        },
        {
            "body": "As a Nigerian you hit every point I’ve ever tried to explain but been accused of being “sensitive”",
            "author": "ginnaao",
            "id": "g2usvo9",
            "parent_id": "t1_g2ulpld",
            "score": 18,
            "created_utc": 1598398088.0,
            "replies": [
                {
                    "body": "nah it might be fat money but u just gotta ask yourself until what point the disrespect is worth it. and it’s ok if your answer is yes, but be aware and be vigilant, and the second something crosses the line—whatever that might be—it’s time to say my safety and worth as an individual isn’t a priority anymore and being ignorant about your actions with ___ is a boundary for me. \n\nand it’s so much better when you find a guy that doesn’t have prejudices that they grew up with (even if it’s not always their fault, at least for me they now live in a diverse area and it’s clear they haven’t made any efforts to educate themselves to be better/more considerate to POC) because small things don’t get your mood down during the date that you have to just smile past or make a mental note of LOL. like you’re already on guard as an SB so it’s not that much of a leap but it’s a relief when you know you’re not being fetishized or subconsciously seen as less than. \n\nif you ever want to chat more feel free to send me a DM! <3",
                    "author": "simply_unaffected",
                    "id": "g2vekmu",
                    "parent_id": "t1_g2usvo9",
                    "score": 5,
                    "created_utc": 1598410062.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I can’t speak for all SDs but I think there are some of us that would love for you to share these thoughts.  Learning the perspective of a young woman on the world is a major reason why I do this.  \n\nAn SBs view of the world is insightful, even when I disagree with it because it gives me yet another perspective/lens to view the world around me.  Quite practically, it’s been invaluable in my work to find ways to connect with younger people and motivate them. \n\nEven with the BLM movement, while I understand and agree with the reasons behind the movement, experiencing the extreme emotions it’s caused in my current SB in real time has really opened my eyes, more than I think they would have otherwise been opened, to the importance of this movement in America.",
            "author": "ORD-inary",
            "id": "g2vuet5",
            "parent_id": "t1_g2ulpld",
            "score": 12,
            "created_utc": 1598420787.0,
            "replies": []
        },
        {
            "body": "I had to say this to a black SB before after she ASKED ME on our M&G!",
            "author": "mrjimmyjsz",
            "id": "g2urylu",
            "parent_id": "t1_g2uqq37",
            "score": 1,
            "created_utc": 1598397594.0,
            "replies": [
                {
                    "body": "Being asked is way different from excitedly offering that commentary as if she's supposed to give you a gold star for dating outside your race",
                    "author": "bbsonar",
                    "id": "g2v5wrp",
                    "parent_id": "t1_g2urylu",
                    "score": 16,
                    "created_utc": 1598405323.0,
                    "replies": []
                },
                {
                    "body": "That’s different. Don’t just come out and say it. Especially in a message. It’s distasteful.",
                    "author": "Anotherrandomgirlsss",
                    "id": "g2v5m2a",
                    "parent_id": "t1_g2urylu",
                    "score": 7,
                    "created_utc": 1598405157.0,
                    "replies": []
                },
                {
                    "body": "I've always been asked this question at some point since I do tend to look outside my race in the bowl.  The one that bugs me the most is \"So do you only date (insert race here) girls?\"\n\nMy favorite (and true) response: \"I like what likes me.\" :)",
                    "author": "Patrucio71",
                    "id": "g2wmbsi",
                    "parent_id": "t1_g2urylu",
                    "score": 4,
                    "created_utc": 1598446868.0,
                    "replies": [
                        {
                            "body": "They are most likely deciding whether or not you consider them as a fetish",
                            "author": "Anotherrandomgirlsss",
                            "id": "g2xg5u1",
                            "parent_id": "t1_g2wmbsi",
                            "score": 7,
                            "created_utc": 1598461942.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Girl!!!! So irritating. Then the select few who go on and on about the age difference, like you selected a woman half your age?!? Why do i have to now assure you that age is no problem?? Smh",
            "author": "BisforBands",
            "id": "g2wdl0l",
            "parent_id": "t1_g2w80f8",
            "score": 5,
            "created_utc": 1598440179.0,
            "replies": []
        },
        {
            "body": "Honestly I made this post mostly because of the messages I get on SA. Usually find that this stuff comes out in DMs. I doubt they're using a text search to find me, nothing except my profile pics and my mixed tag indicates my racial identity.",
            "author": "SugarBabyStoner",
            "id": "g2u8eyu",
            "parent_id": "t1_g2u4cpu",
            "score": 18,
            "created_utc": 1598387432.0,
            "replies": []
        },
        {
            "body": "Somehow my attempt at saying the same thing got downvoted to oblivion.  Let's see if the same thing happens to yours.",
            "author": "SDstartingOut",
            "id": "g2uce4h",
            "parent_id": "t1_g2u4cpu",
            "score": -2,
            "created_utc": 1598389396.0,
            "replies": []
        },
        {
            "body": "The use of these terms in SB's profiles is fairly prevalent... As part of their headline or username even. (ie - MochaLatteDelite427 means there are 426 \\*other\\* MochaLatteDelites)\n\n...think I'll change my username to PastyMayoSapien  with the tagline: \"Zero to lobster in 10 minutes\" and see how that goes ;) :D",
            "author": "Patrucio71",
            "id": "g2wm0ig",
            "parent_id": "t1_g2u4cpu",
            "score": 0,
            "created_utc": 1598446664.0,
            "replies": []
        },
        {
            "body": "“Hey Ya!”",
            "author": "BeautyGr8ce",
            "id": "g2wkaae",
            "parent_id": "t1_g2vd3ac",
            "score": 2,
            "created_utc": 1598445523.0,
            "replies": [
                {
                    "body": "That's it!! LOL",
                    "author": "peoplesmeeple",
                    "id": "g2z27pd",
                    "parent_id": "t1_g2wkaae",
                    "score": 1,
                    "created_utc": 1598489903.0,
                    "replies": [
                        {
                            "body": "I couldn’t help myself ... 😆\n\n....\n\nYou think you've got it\n\nOh, you think you've got it\n\nBut got it just don't get it when there's nothin' at all\n\nWe get together\n\nOh, we get together\n\nBut separate's always better when there's feelings involved\n\nKnow what they say -its\n\nNothing lasts forever!\n\nThen what makes it, then what makes it\n\nThen what makes it, then what makes it\n\nThen what makes SUGAR the exception?",
                            "author": "BeautyGr8ce",
                            "id": "g2z2f5j",
                            "parent_id": "t1_g2z27pd",
                            "score": 2,
                            "created_utc": 1598490014.0,
                            "replies": [
                                {
                                    "body": "😆  😆  😆  😆\n\n\"I like the waaaay you move\" - but also do the horn bast after that \"doo doooo\"",
                                    "author": "peoplesmeeple",
                                    "id": "g3lrucm",
                                    "parent_id": "t1_g2z2f5j",
                                    "score": 2,
                                    "created_utc": 1598976622.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Honestly, you don't wanna know.",
            "author": "bsbdfw",
            "id": "g2x5lnb",
            "parent_id": "t1_g2vevd5",
            "score": 3,
            "created_utc": 1598456965.0,
            "replies": []
        },
        {
            "body": "Def google it",
            "author": "unlike_glossier",
            "id": "g2x5irb",
            "parent_id": "t1_g2vevd5",
            "score": 1,
            "created_utc": 1598456925.0,
            "replies": []
        },
        {
            "body": "Think if you got off to being called racial slurs and he got off saying things that would make a nazi blush... or vice versus",
            "author": "AlinaAllure",
            "id": "g2xpbbc",
            "parent_id": "t1_g2vevd5",
            "score": 1,
            "created_utc": 1598466155.0,
            "replies": [
                {
                    "body": "Eeeks sounds like some humiliation kink.",
                    "author": "testing1to3",
                    "id": "g2y0vga",
                    "parent_id": "t1_g2xpbbc",
                    "score": 1,
                    "created_utc": 1598471366.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "💕",
            "author": "SugarBabyStoner",
            "id": "g2xfvrb",
            "parent_id": "t1_g2wl3fg",
            "score": 1,
            "created_utc": 1598461812.0,
            "replies": []
        },
        {
            "body": "i had a pot SB say she wasn’t interested after a bit of chatting because “she only goes out with people who breed exclusively within their own race.” i.e. she was offended that i didn’t *only* date white girls.\n\nso yeah, people suck! lol.",
            "author": null,
            "id": "g2xypyy",
            "parent_id": "t1_g2xkzcb",
            "score": 1,
            "created_utc": 1598470378.0,
            "replies": [
                {
                    "body": "Ughhhh that hurts my heart 😫😫",
                    "author": null,
                    "id": "g2y0hgu",
                    "parent_id": "t1_g2xypyy",
                    "score": 1,
                    "created_utc": 1598471188.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "💕",
            "author": "SugarBabyStoner",
            "id": "g38rns5",
            "parent_id": "t1_g37vyr3",
            "score": 2,
            "created_utc": 1598711368.0,
            "replies": []
        },
        {
            "body": "https://www.google.com/search?q=race+play",
            "author": "RoseTyler38",
            "id": "g2uvv59",
            "parent_id": "t1_g2uqod0",
            "score": 3,
            "created_utc": 1598399722.0,
            "replies": [
                {
                    "body": "Well, bugger me, what will they think of next?!?",
                    "author": null,
                    "id": "g2v2m1b",
                    "parent_id": "t1_g2uvv59",
                    "score": 1,
                    "created_utc": 1598403494.0,
                    "replies": [
                        {
                            "body": "I’ve done this before and it was weird at first but actually very hot...and felt like we were breaking the law.",
                            "author": null,
                            "id": "g2vlrty",
                            "parent_id": "t1_g2v2m1b",
                            "score": 1,
                            "created_utc": 1598414295.0,
                            "replies": [
                                {
                                    "body": "Technically, it is part of bdsm, but a prickly fetish to openly discuss even for there. I have had several lovely women of color as SB's in the past (note that all of my SB's are for a d/s relationship) and I had one ask for it, so I complied. My genre of bdsm is normally very light on degradation, so it felt a little uncomfortable to me, but she seemed to ummm \"enjoy\" it, and that is the primary focus of my own genre, so that fulfilled me that she did.  But yes, can certainly understand the taboo feeling, it is taboo in a world that doesn't bat an eye at say, incest play(as a fantasy), so there you go. Glad you enjoyed yourself. :)",
                                    "author": "SDInLeather",
                                    "id": "g2xsgkk",
                                    "parent_id": "t1_g2vlrty",
                                    "score": 3,
                                    "created_utc": 1598467526.0,
                                    "replies": []
                                },
                                {
                                    "body": "I can imagine! I mean, it is just so taboo! Honestly don't know if I could. I mean, I don't mind my SB making fun of me, old man body, grey hair on the chest, need viagra to get it up, no stamina etc etc, we just laugh and laugh, but race stuff...",
                                    "author": null,
                                    "id": "g2vmk3b",
                                    "parent_id": "t1_g2vlrty",
                                    "score": 2,
                                    "created_utc": 1598414802.0,
                                    "replies": [
                                        {
                                            "body": "Yeah different strokes. And this wasn’t with a sugar daddy this was with a vanilla boyfriend I had.",
                                            "author": null,
                                            "id": "g2wdajs",
                                            "parent_id": "t1_g2vmk3b",
                                            "score": 1,
                                            "created_utc": 1598439901.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "SBs are skilled at making SD fantasies a reality. So if the SDs in your neck of the woods tends toward those terms, maybe those SBs have tried to play into the fantasy rather than fight it (since they know they're going to hear it anyway).\n\nWhat OP is referring to is unsolicited, fetishizing comments about race. It's objectifying to be compared to food and othering to be seen as exotic. Please don't shift the blame to SBs and say they're the biggest offenders when they're likely just anticipating what oblivious SDs are going to say anyway.",
            "author": "bbsonar",
            "id": "g2v5h82",
            "parent_id": "t1_g2um8q4",
            "score": 12,
            "created_utc": 1598405083.0,
            "replies": [
                {
                    "body": "I'm well aware of what the poster is referring to, but thanks for 'splaining' it to me.  Pointing out the fact that there are a large number of voices from the SB side of things as well has nothing to do with the shifting of anything, much less blame.  We need to get away from this whole Us vs. Them mentality that serves to hinder discussion and moving things forward.    \n\n\nAs the poster herself quite eloquently pointed out, she would just as soon lose her lunch in the bathroom than to use such language, so I seriously doubt such a large population of people would willingly describe themselves in such a manner when they could simply feel out the situation and -then- tailor their responses towards whatever fantasy they feel they need to stomach for the sake of an arrangement.  Let us not forget to include the women out there that actually and truly love being compared to food or considered to be exotic.  To do otherwise would be to try and claim that their particular fetish is somehow invalid or shameful.  No one person can speak for everyone.",
                    "author": "discrete_one2",
                    "id": "g2vcdah",
                    "parent_id": "t1_g2v5h82",
                    "score": -2,
                    "created_utc": 1598408832.0,
                    "replies": [
                        {
                            "body": "And not every conversation is about everyone. You didn't need to all sides this at all",
                            "author": "BisforBands",
                            "id": "g2wdo1b",
                            "parent_id": "t1_g2vcdah",
                            "score": 5,
                            "created_utc": 1598440259.0,
                            "replies": []
                        },
                        {
                            "body": "Why even point it out though, if not to shift or share the \"blame\" onto SBs?\n\nAlso really doubt that's a \"particular fetish\" and nobody said anything about shaming it. Just that those type of comments from SDs are rude.\n\nOP is trying to do y'all a favor so I don't understand why you have to say \"but but but SBs are the even bigger offender!!\"",
                            "author": "bbsonar",
                            "id": "g2wqjwl",
                            "parent_id": "t1_g2vcdah",
                            "score": 4,
                            "created_utc": 1598449478.0,
                            "replies": [
                                {
                                    "body": "OP here. Unsolicited fetishization of my body and experience is NEVER the same as women marketing themselves in a fetishized way because they've been taught that sells when alternative presentations don't. It's true that some women have internalized the exoticization of their bodies, but I really don't think this makes any point other than proving that this world is hostile to women who don't act within specific recognized and legitimized performative identities, one of those being the exoticized and sexualized Jezebel stereotype. Y'all always gonna find a way to put it back on black women and you will NOT use my voice to do it.",
                                    "author": "SugarBabyStoner",
                                    "id": "g2y89hf",
                                    "parent_id": "t1_g2wqjwl",
                                    "score": 4,
                                    "created_utc": 1598474712.0,
                                    "replies": [
                                        {
                                            "body": "I’m black. I will say your OP is based solely upon your preference but shouldn’t be the theme for every black SB. \n\nThere are plenty of black women who enjoy being objectified, called chocolate, exotic, and will be brave enough to say fuck the status quo and taboo I wanna experience race play.  Is there anything wrong with them/us? Nope. Do we fit into your sentiment of disgust? Nope. \n\nSo although I can understand your position, like the other poster said, this this is not a one size fits all matter and you should accept the diversity in that instead of making it yet another contentious issue. \n\nOkay, you don’t like it. So what? Stick with what you like and sugar happily.",
                                            "author": null,
                                            "id": "g2ym2el",
                                            "parent_id": "t1_g2y89hf",
                                            "score": 2,
                                            "created_utc": 1598481344.0,
                                            "replies": [
                                                {
                                                    "body": "I'm not averse to race play as you assume, I'm averse to not being able to consent to the (sometimes traumatic) experience of being asked. Black women can do it as they like and bring it up, but the expectation cannot be placed on us.",
                                                    "author": "SugarBabyStoner",
                                                    "id": "g2z0qfh",
                                                    "parent_id": "t1_g2ym2el",
                                                    "score": 2,
                                                    "created_utc": 1598489114.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Oh no,  the racist doesn't like me stating the ways I don't like to be degraded! What ever will I do now???? Ladies, quick, help me hide my stream of tears!!!",
            "author": "SugarBabyStoner",
            "id": "g2y6vbx",
            "parent_id": "t1_g2xcbm0",
            "score": 4,
            "created_utc": 1598474082.0,
            "replies": []
        },
        {
            "body": "You realize you're asking someone to lower their standards about being treated like a human being?",
            "author": "bbsonar",
            "id": "g2yr9bp",
            "parent_id": "t1_g2xcbm0",
            "score": 3,
            "created_utc": 1598484052.0,
            "replies": []
        },
        {
            "body": ">pussy is pussy \n\nCharming.",
            "author": "blonde-throwaway",
            "id": "g2upoqo",
            "parent_id": "t1_g2ukp65",
            "score": 3,
            "created_utc": 1598396356.0,
            "replies": []
        },
        {
            "body": "All I hear you saying is that women are pushed into exoticizing themselves because they know it sells and I couldn't give less of a fuck. y'all out here acting like you never heard of social pressure before this very moment and we are NOT here for it.",
            "author": "SugarBabyStoner",
            "id": "g2y79ub",
            "parent_id": "t1_g2xfkk8",
            "score": 5,
            "created_utc": 1598474262.0,
            "replies": [
                {
                    "body": ">All I hear you saying is that women are pushed into exoticizing themselves because they know it sells \n\nMaybe so, but my point still stands: if they call themselves \"exotic\" why would you expect men not to call them the same? Isn't that a big part of being tolerant? Calling people the way they want to be called.\n\n&#x200B;\n\n\\>  y'all out here acting like you never heard of social pressure before this very moment and we are NOT here for it. \n\nI know what social pressure is, do you? Because your whole post reeks of it, you are trying to dictate behavior from SDs towards black women. Going further, you are assuming all black women in the bowl think like you.",
                    "author": "AdAlternative6041",
                    "id": "g2z44p0",
                    "parent_id": "t1_g2y79ub",
                    "score": 1,
                    "created_utc": 1598490933.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "It was sarcasm!",
            "author": "SugarBabyStoner",
            "id": "g2u2xn9",
            "parent_id": "t1_g2u2o0b",
            "score": 24,
            "created_utc": 1598384801.0,
            "replies": [
                {
                    "body": "On a scale of 0 to 10, how do you score his mansplaining?\n\nEdit: grammar",
                    "author": "MyIncognitoMe",
                    "id": "g2u7gjo",
                    "parent_id": "t1_g2u2xn9",
                    "score": 19,
                    "created_utc": 1598386966.0,
                    "replies": [
                        {
                            "body": "Lol he really just went for some stream of consciousness mansplaining, I'm dead.",
                            "author": "kittiesntrees",
                            "id": "g2u7uxy",
                            "parent_id": "t1_g2u7gjo",
                            "score": 16,
                            "created_utc": 1598387162.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "😂",
            "author": "LikeHoney99",
            "id": "g2uiz4f",
            "parent_id": "t1_g2uisqy",
            "score": 11,
            "created_utc": 1598392756.0,
            "replies": [
                {
                    "body": "based off “you don’t need sunscreen do you?” uh, yes i do, i might be tan but i don’t want skin cancer... \n\nand “are you just putting on sunscreen so you stay lighter?” huh?? some kinda weird colorism projection bc they don’t wanna be tan or...?",
                    "author": "simply_unaffected",
                    "id": "g2uk8je",
                    "parent_id": "t1_g2uiz4f",
                    "score": 28,
                    "created_utc": 1598393420.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I’m gonna start saying this😂",
            "author": "ginnaao",
            "id": "g2usods",
            "parent_id": "t1_g2uisqy",
            "score": 5,
            "created_utc": 1598397978.0,
            "replies": []
        },
        {
            "body": "Mayo is my automatic come back lmao they hate it so much",
            "author": "BisforBands",
            "id": "g2wdanu",
            "parent_id": "t1_g2v4dtq",
            "score": 5,
            "created_utc": 1598439904.0,
            "replies": []
        },
        {
            "body": "I almost died just now.",
            "author": "raychelpotter",
            "id": "g2x0edk",
            "parent_id": "t1_g2v4dtq",
            "score": 2,
            "created_utc": 1598454456.0,
            "replies": []
        },
        {
            "body": "Thank you for making me look crazy for laughing out loud out of the blue in a public setting.",
            "author": "GDarn",
            "id": "g2uhj0t",
            "parent_id": "t1_g2udvtg",
            "score": 10,
            "created_utc": 1598392018.0,
            "replies": [
                {
                    "body": "Anytime!",
                    "author": "YourExoticBabe",
                    "id": "g2uj9o3",
                    "parent_id": "t1_g2uhj0t",
                    "score": 10,
                    "created_utc": 1598392910.0,
                    "replies": [
                        {
                            "body": "Come to think of it, I will ask my SB if she thinks I am pasty.\n\nGod, I hope she is not on this forum so she does not see this question coming.",
                            "author": "GDarn",
                            "id": "g2uk2c4",
                            "parent_id": "t1_g2uj9o3",
                            "score": 11,
                            "created_utc": 1598393329.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Lmao",
            "author": "Babywish",
            "id": "g2v5mz1",
            "parent_id": "t1_g2udvtg",
            "score": 2,
            "created_utc": 1598405171.0,
            "replies": []
        },
        {
            "body": "That is such a creative comeback ! 😂",
            "author": "kirathekira",
            "id": "g2xqapt",
            "parent_id": "t1_g2xp6kl",
            "score": 2,
            "created_utc": 1598466579.0,
            "replies": []
        },
        {
            "body": "💀💀💀",
            "author": "LikeHoney99",
            "id": "g2us7h0",
            "parent_id": "t1_g2urvwh",
            "score": 5,
            "created_utc": 1598397728.0,
            "replies": []
        },
        {
            "body": "nah it might be fat money but u just gotta ask yourself until what point the disrespect is worth it. and it’s ok if your answer is yes, but be aware and be vigilant, and the second something crosses the line—whatever that might be—it’s time to say my safety and worth as an individual isn’t a priority anymore and being ignorant about your actions with ___ is a boundary for me. \n\nand it’s so much better when you find a guy that doesn’t have prejudices that they grew up with (even if it’s not always their fault, at least for me they now live in a diverse area and it’s clear they haven’t made any efforts to educate themselves to be better/more considerate to POC) because small things don’t get your mood down during the date that you have to just smile past or make a mental note of LOL. like you’re already on guard as an SB so it’s not that much of a leap but it’s a relief when you know you’re not being fetishized or subconsciously seen as less than. \n\nif you ever want to chat more feel free to send me a DM! <3",
            "author": "simply_unaffected",
            "id": "g2vekmu",
            "parent_id": "t1_g2usvo9",
            "score": 5,
            "created_utc": 1598410062.0,
            "replies": []
        },
        {
            "body": "Being asked is way different from excitedly offering that commentary as if she's supposed to give you a gold star for dating outside your race",
            "author": "bbsonar",
            "id": "g2v5wrp",
            "parent_id": "t1_g2urylu",
            "score": 16,
            "created_utc": 1598405323.0,
            "replies": []
        },
        {
            "body": "That’s different. Don’t just come out and say it. Especially in a message. It’s distasteful.",
            "author": "Anotherrandomgirlsss",
            "id": "g2v5m2a",
            "parent_id": "t1_g2urylu",
            "score": 7,
            "created_utc": 1598405157.0,
            "replies": []
        },
        {
            "body": "I've always been asked this question at some point since I do tend to look outside my race in the bowl.  The one that bugs me the most is \"So do you only date (insert race here) girls?\"\n\nMy favorite (and true) response: \"I like what likes me.\" :)",
            "author": "Patrucio71",
            "id": "g2wmbsi",
            "parent_id": "t1_g2urylu",
            "score": 4,
            "created_utc": 1598446868.0,
            "replies": [
                {
                    "body": "They are most likely deciding whether or not you consider them as a fetish",
                    "author": "Anotherrandomgirlsss",
                    "id": "g2xg5u1",
                    "parent_id": "t1_g2wmbsi",
                    "score": 7,
                    "created_utc": 1598461942.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "That's it!! LOL",
            "author": "peoplesmeeple",
            "id": "g2z27pd",
            "parent_id": "t1_g2wkaae",
            "score": 1,
            "created_utc": 1598489903.0,
            "replies": [
                {
                    "body": "I couldn’t help myself ... 😆\n\n....\n\nYou think you've got it\n\nOh, you think you've got it\n\nBut got it just don't get it when there's nothin' at all\n\nWe get together\n\nOh, we get together\n\nBut separate's always better when there's feelings involved\n\nKnow what they say -its\n\nNothing lasts forever!\n\nThen what makes it, then what makes it\n\nThen what makes it, then what makes it\n\nThen what makes SUGAR the exception?",
                    "author": "BeautyGr8ce",
                    "id": "g2z2f5j",
                    "parent_id": "t1_g2z27pd",
                    "score": 2,
                    "created_utc": 1598490014.0,
                    "replies": [
                        {
                            "body": "😆  😆  😆  😆\n\n\"I like the waaaay you move\" - but also do the horn bast after that \"doo doooo\"",
                            "author": "peoplesmeeple",
                            "id": "g3lrucm",
                            "parent_id": "t1_g2z2f5j",
                            "score": 2,
                            "created_utc": 1598976622.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Eeeks sounds like some humiliation kink.",
            "author": "testing1to3",
            "id": "g2y0vga",
            "parent_id": "t1_g2xpbbc",
            "score": 1,
            "created_utc": 1598471366.0,
            "replies": []
        },
        {
            "body": "Ughhhh that hurts my heart 😫😫",
            "author": null,
            "id": "g2y0hgu",
            "parent_id": "t1_g2xypyy",
            "score": 1,
            "created_utc": 1598471188.0,
            "replies": []
        },
        {
            "body": "Well, bugger me, what will they think of next?!?",
            "author": null,
            "id": "g2v2m1b",
            "parent_id": "t1_g2uvv59",
            "score": 1,
            "created_utc": 1598403494.0,
            "replies": [
                {
                    "body": "I’ve done this before and it was weird at first but actually very hot...and felt like we were breaking the law.",
                    "author": null,
                    "id": "g2vlrty",
                    "parent_id": "t1_g2v2m1b",
                    "score": 1,
                    "created_utc": 1598414295.0,
                    "replies": [
                        {
                            "body": "Technically, it is part of bdsm, but a prickly fetish to openly discuss even for there. I have had several lovely women of color as SB's in the past (note that all of my SB's are for a d/s relationship) and I had one ask for it, so I complied. My genre of bdsm is normally very light on degradation, so it felt a little uncomfortable to me, but she seemed to ummm \"enjoy\" it, and that is the primary focus of my own genre, so that fulfilled me that she did.  But yes, can certainly understand the taboo feeling, it is taboo in a world that doesn't bat an eye at say, incest play(as a fantasy), so there you go. Glad you enjoyed yourself. :)",
                            "author": "SDInLeather",
                            "id": "g2xsgkk",
                            "parent_id": "t1_g2vlrty",
                            "score": 3,
                            "created_utc": 1598467526.0,
                            "replies": []
                        },
                        {
                            "body": "I can imagine! I mean, it is just so taboo! Honestly don't know if I could. I mean, I don't mind my SB making fun of me, old man body, grey hair on the chest, need viagra to get it up, no stamina etc etc, we just laugh and laugh, but race stuff...",
                            "author": null,
                            "id": "g2vmk3b",
                            "parent_id": "t1_g2vlrty",
                            "score": 2,
                            "created_utc": 1598414802.0,
                            "replies": [
                                {
                                    "body": "Yeah different strokes. And this wasn’t with a sugar daddy this was with a vanilla boyfriend I had.",
                                    "author": null,
                                    "id": "g2wdajs",
                                    "parent_id": "t1_g2vmk3b",
                                    "score": 1,
                                    "created_utc": 1598439901.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I'm well aware of what the poster is referring to, but thanks for 'splaining' it to me.  Pointing out the fact that there are a large number of voices from the SB side of things as well has nothing to do with the shifting of anything, much less blame.  We need to get away from this whole Us vs. Them mentality that serves to hinder discussion and moving things forward.    \n\n\nAs the poster herself quite eloquently pointed out, she would just as soon lose her lunch in the bathroom than to use such language, so I seriously doubt such a large population of people would willingly describe themselves in such a manner when they could simply feel out the situation and -then- tailor their responses towards whatever fantasy they feel they need to stomach for the sake of an arrangement.  Let us not forget to include the women out there that actually and truly love being compared to food or considered to be exotic.  To do otherwise would be to try and claim that their particular fetish is somehow invalid or shameful.  No one person can speak for everyone.",
            "author": "discrete_one2",
            "id": "g2vcdah",
            "parent_id": "t1_g2v5h82",
            "score": -2,
            "created_utc": 1598408832.0,
            "replies": [
                {
                    "body": "And not every conversation is about everyone. You didn't need to all sides this at all",
                    "author": "BisforBands",
                    "id": "g2wdo1b",
                    "parent_id": "t1_g2vcdah",
                    "score": 5,
                    "created_utc": 1598440259.0,
                    "replies": []
                },
                {
                    "body": "Why even point it out though, if not to shift or share the \"blame\" onto SBs?\n\nAlso really doubt that's a \"particular fetish\" and nobody said anything about shaming it. Just that those type of comments from SDs are rude.\n\nOP is trying to do y'all a favor so I don't understand why you have to say \"but but but SBs are the even bigger offender!!\"",
                    "author": "bbsonar",
                    "id": "g2wqjwl",
                    "parent_id": "t1_g2vcdah",
                    "score": 4,
                    "created_utc": 1598449478.0,
                    "replies": [
                        {
                            "body": "OP here. Unsolicited fetishization of my body and experience is NEVER the same as women marketing themselves in a fetishized way because they've been taught that sells when alternative presentations don't. It's true that some women have internalized the exoticization of their bodies, but I really don't think this makes any point other than proving that this world is hostile to women who don't act within specific recognized and legitimized performative identities, one of those being the exoticized and sexualized Jezebel stereotype. Y'all always gonna find a way to put it back on black women and you will NOT use my voice to do it.",
                            "author": "SugarBabyStoner",
                            "id": "g2y89hf",
                            "parent_id": "t1_g2wqjwl",
                            "score": 4,
                            "created_utc": 1598474712.0,
                            "replies": [
                                {
                                    "body": "I’m black. I will say your OP is based solely upon your preference but shouldn’t be the theme for every black SB. \n\nThere are plenty of black women who enjoy being objectified, called chocolate, exotic, and will be brave enough to say fuck the status quo and taboo I wanna experience race play.  Is there anything wrong with them/us? Nope. Do we fit into your sentiment of disgust? Nope. \n\nSo although I can understand your position, like the other poster said, this this is not a one size fits all matter and you should accept the diversity in that instead of making it yet another contentious issue. \n\nOkay, you don’t like it. So what? Stick with what you like and sugar happily.",
                                    "author": null,
                                    "id": "g2ym2el",
                                    "parent_id": "t1_g2y89hf",
                                    "score": 2,
                                    "created_utc": 1598481344.0,
                                    "replies": [
                                        {
                                            "body": "I'm not averse to race play as you assume, I'm averse to not being able to consent to the (sometimes traumatic) experience of being asked. Black women can do it as they like and bring it up, but the expectation cannot be placed on us.",
                                            "author": "SugarBabyStoner",
                                            "id": "g2z0qfh",
                                            "parent_id": "t1_g2ym2el",
                                            "score": 2,
                                            "created_utc": 1598489114.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": ">All I hear you saying is that women are pushed into exoticizing themselves because they know it sells \n\nMaybe so, but my point still stands: if they call themselves \"exotic\" why would you expect men not to call them the same? Isn't that a big part of being tolerant? Calling people the way they want to be called.\n\n&#x200B;\n\n\\>  y'all out here acting like you never heard of social pressure before this very moment and we are NOT here for it. \n\nI know what social pressure is, do you? Because your whole post reeks of it, you are trying to dictate behavior from SDs towards black women. Going further, you are assuming all black women in the bowl think like you.",
            "author": "AdAlternative6041",
            "id": "g2z44p0",
            "parent_id": "t1_g2y79ub",
            "score": 1,
            "created_utc": 1598490933.0,
            "replies": []
        },
        {
            "body": "On a scale of 0 to 10, how do you score his mansplaining?\n\nEdit: grammar",
            "author": "MyIncognitoMe",
            "id": "g2u7gjo",
            "parent_id": "t1_g2u2xn9",
            "score": 19,
            "created_utc": 1598386966.0,
            "replies": [
                {
                    "body": "Lol he really just went for some stream of consciousness mansplaining, I'm dead.",
                    "author": "kittiesntrees",
                    "id": "g2u7uxy",
                    "parent_id": "t1_g2u7gjo",
                    "score": 16,
                    "created_utc": 1598387162.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "based off “you don’t need sunscreen do you?” uh, yes i do, i might be tan but i don’t want skin cancer... \n\nand “are you just putting on sunscreen so you stay lighter?” huh?? some kinda weird colorism projection bc they don’t wanna be tan or...?",
            "author": "simply_unaffected",
            "id": "g2uk8je",
            "parent_id": "t1_g2uiz4f",
            "score": 28,
            "created_utc": 1598393420.0,
            "replies": []
        },
        {
            "body": "Anytime!",
            "author": "YourExoticBabe",
            "id": "g2uj9o3",
            "parent_id": "t1_g2uhj0t",
            "score": 10,
            "created_utc": 1598392910.0,
            "replies": [
                {
                    "body": "Come to think of it, I will ask my SB if she thinks I am pasty.\n\nGod, I hope she is not on this forum so she does not see this question coming.",
                    "author": "GDarn",
                    "id": "g2uk2c4",
                    "parent_id": "t1_g2uj9o3",
                    "score": 11,
                    "created_utc": 1598393329.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "They are most likely deciding whether or not you consider them as a fetish",
            "author": "Anotherrandomgirlsss",
            "id": "g2xg5u1",
            "parent_id": "t1_g2wmbsi",
            "score": 7,
            "created_utc": 1598461942.0,
            "replies": []
        },
        {
            "body": "I couldn’t help myself ... 😆\n\n....\n\nYou think you've got it\n\nOh, you think you've got it\n\nBut got it just don't get it when there's nothin' at all\n\nWe get together\n\nOh, we get together\n\nBut separate's always better when there's feelings involved\n\nKnow what they say -its\n\nNothing lasts forever!\n\nThen what makes it, then what makes it\n\nThen what makes it, then what makes it\n\nThen what makes SUGAR the exception?",
            "author": "BeautyGr8ce",
            "id": "g2z2f5j",
            "parent_id": "t1_g2z27pd",
            "score": 2,
            "created_utc": 1598490014.0,
            "replies": [
                {
                    "body": "😆  😆  😆  😆\n\n\"I like the waaaay you move\" - but also do the horn bast after that \"doo doooo\"",
                    "author": "peoplesmeeple",
                    "id": "g3lrucm",
                    "parent_id": "t1_g2z2f5j",
                    "score": 2,
                    "created_utc": 1598976622.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I’ve done this before and it was weird at first but actually very hot...and felt like we were breaking the law.",
            "author": null,
            "id": "g2vlrty",
            "parent_id": "t1_g2v2m1b",
            "score": 1,
            "created_utc": 1598414295.0,
            "replies": [
                {
                    "body": "Technically, it is part of bdsm, but a prickly fetish to openly discuss even for there. I have had several lovely women of color as SB's in the past (note that all of my SB's are for a d/s relationship) and I had one ask for it, so I complied. My genre of bdsm is normally very light on degradation, so it felt a little uncomfortable to me, but she seemed to ummm \"enjoy\" it, and that is the primary focus of my own genre, so that fulfilled me that she did.  But yes, can certainly understand the taboo feeling, it is taboo in a world that doesn't bat an eye at say, incest play(as a fantasy), so there you go. Glad you enjoyed yourself. :)",
                    "author": "SDInLeather",
                    "id": "g2xsgkk",
                    "parent_id": "t1_g2vlrty",
                    "score": 3,
                    "created_utc": 1598467526.0,
                    "replies": []
                },
                {
                    "body": "I can imagine! I mean, it is just so taboo! Honestly don't know if I could. I mean, I don't mind my SB making fun of me, old man body, grey hair on the chest, need viagra to get it up, no stamina etc etc, we just laugh and laugh, but race stuff...",
                    "author": null,
                    "id": "g2vmk3b",
                    "parent_id": "t1_g2vlrty",
                    "score": 2,
                    "created_utc": 1598414802.0,
                    "replies": [
                        {
                            "body": "Yeah different strokes. And this wasn’t with a sugar daddy this was with a vanilla boyfriend I had.",
                            "author": null,
                            "id": "g2wdajs",
                            "parent_id": "t1_g2vmk3b",
                            "score": 1,
                            "created_utc": 1598439901.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "And not every conversation is about everyone. You didn't need to all sides this at all",
            "author": "BisforBands",
            "id": "g2wdo1b",
            "parent_id": "t1_g2vcdah",
            "score": 5,
            "created_utc": 1598440259.0,
            "replies": []
        },
        {
            "body": "Why even point it out though, if not to shift or share the \"blame\" onto SBs?\n\nAlso really doubt that's a \"particular fetish\" and nobody said anything about shaming it. Just that those type of comments from SDs are rude.\n\nOP is trying to do y'all a favor so I don't understand why you have to say \"but but but SBs are the even bigger offender!!\"",
            "author": "bbsonar",
            "id": "g2wqjwl",
            "parent_id": "t1_g2vcdah",
            "score": 4,
            "created_utc": 1598449478.0,
            "replies": [
                {
                    "body": "OP here. Unsolicited fetishization of my body and experience is NEVER the same as women marketing themselves in a fetishized way because they've been taught that sells when alternative presentations don't. It's true that some women have internalized the exoticization of their bodies, but I really don't think this makes any point other than proving that this world is hostile to women who don't act within specific recognized and legitimized performative identities, one of those being the exoticized and sexualized Jezebel stereotype. Y'all always gonna find a way to put it back on black women and you will NOT use my voice to do it.",
                    "author": "SugarBabyStoner",
                    "id": "g2y89hf",
                    "parent_id": "t1_g2wqjwl",
                    "score": 4,
                    "created_utc": 1598474712.0,
                    "replies": [
                        {
                            "body": "I’m black. I will say your OP is based solely upon your preference but shouldn’t be the theme for every black SB. \n\nThere are plenty of black women who enjoy being objectified, called chocolate, exotic, and will be brave enough to say fuck the status quo and taboo I wanna experience race play.  Is there anything wrong with them/us? Nope. Do we fit into your sentiment of disgust? Nope. \n\nSo although I can understand your position, like the other poster said, this this is not a one size fits all matter and you should accept the diversity in that instead of making it yet another contentious issue. \n\nOkay, you don’t like it. So what? Stick with what you like and sugar happily.",
                            "author": null,
                            "id": "g2ym2el",
                            "parent_id": "t1_g2y89hf",
                            "score": 2,
                            "created_utc": 1598481344.0,
                            "replies": [
                                {
                                    "body": "I'm not averse to race play as you assume, I'm averse to not being able to consent to the (sometimes traumatic) experience of being asked. Black women can do it as they like and bring it up, but the expectation cannot be placed on us.",
                                    "author": "SugarBabyStoner",
                                    "id": "g2z0qfh",
                                    "parent_id": "t1_g2ym2el",
                                    "score": 2,
                                    "created_utc": 1598489114.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Lol he really just went for some stream of consciousness mansplaining, I'm dead.",
            "author": "kittiesntrees",
            "id": "g2u7uxy",
            "parent_id": "t1_g2u7gjo",
            "score": 16,
            "created_utc": 1598387162.0,
            "replies": []
        },
        {
            "body": "Come to think of it, I will ask my SB if she thinks I am pasty.\n\nGod, I hope she is not on this forum so she does not see this question coming.",
            "author": "GDarn",
            "id": "g2uk2c4",
            "parent_id": "t1_g2uj9o3",
            "score": 11,
            "created_utc": 1598393329.0,
            "replies": []
        },
        {
            "body": "😆  😆  😆  😆\n\n\"I like the waaaay you move\" - but also do the horn bast after that \"doo doooo\"",
            "author": "peoplesmeeple",
            "id": "g3lrucm",
            "parent_id": "t1_g2z2f5j",
            "score": 2,
            "created_utc": 1598976622.0,
            "replies": []
        },
        {
            "body": "Technically, it is part of bdsm, but a prickly fetish to openly discuss even for there. I have had several lovely women of color as SB's in the past (note that all of my SB's are for a d/s relationship) and I had one ask for it, so I complied. My genre of bdsm is normally very light on degradation, so it felt a little uncomfortable to me, but she seemed to ummm \"enjoy\" it, and that is the primary focus of my own genre, so that fulfilled me that she did.  But yes, can certainly understand the taboo feeling, it is taboo in a world that doesn't bat an eye at say, incest play(as a fantasy), so there you go. Glad you enjoyed yourself. :)",
            "author": "SDInLeather",
            "id": "g2xsgkk",
            "parent_id": "t1_g2vlrty",
            "score": 3,
            "created_utc": 1598467526.0,
            "replies": []
        },
        {
            "body": "I can imagine! I mean, it is just so taboo! Honestly don't know if I could. I mean, I don't mind my SB making fun of me, old man body, grey hair on the chest, need viagra to get it up, no stamina etc etc, we just laugh and laugh, but race stuff...",
            "author": null,
            "id": "g2vmk3b",
            "parent_id": "t1_g2vlrty",
            "score": 2,
            "created_utc": 1598414802.0,
            "replies": [
                {
                    "body": "Yeah different strokes. And this wasn’t with a sugar daddy this was with a vanilla boyfriend I had.",
                    "author": null,
                    "id": "g2wdajs",
                    "parent_id": "t1_g2vmk3b",
                    "score": 1,
                    "created_utc": 1598439901.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "OP here. Unsolicited fetishization of my body and experience is NEVER the same as women marketing themselves in a fetishized way because they've been taught that sells when alternative presentations don't. It's true that some women have internalized the exoticization of their bodies, but I really don't think this makes any point other than proving that this world is hostile to women who don't act within specific recognized and legitimized performative identities, one of those being the exoticized and sexualized Jezebel stereotype. Y'all always gonna find a way to put it back on black women and you will NOT use my voice to do it.",
            "author": "SugarBabyStoner",
            "id": "g2y89hf",
            "parent_id": "t1_g2wqjwl",
            "score": 4,
            "created_utc": 1598474712.0,
            "replies": [
                {
                    "body": "I’m black. I will say your OP is based solely upon your preference but shouldn’t be the theme for every black SB. \n\nThere are plenty of black women who enjoy being objectified, called chocolate, exotic, and will be brave enough to say fuck the status quo and taboo I wanna experience race play.  Is there anything wrong with them/us? Nope. Do we fit into your sentiment of disgust? Nope. \n\nSo although I can understand your position, like the other poster said, this this is not a one size fits all matter and you should accept the diversity in that instead of making it yet another contentious issue. \n\nOkay, you don’t like it. So what? Stick with what you like and sugar happily.",
                    "author": null,
                    "id": "g2ym2el",
                    "parent_id": "t1_g2y89hf",
                    "score": 2,
                    "created_utc": 1598481344.0,
                    "replies": [
                        {
                            "body": "I'm not averse to race play as you assume, I'm averse to not being able to consent to the (sometimes traumatic) experience of being asked. Black women can do it as they like and bring it up, but the expectation cannot be placed on us.",
                            "author": "SugarBabyStoner",
                            "id": "g2z0qfh",
                            "parent_id": "t1_g2ym2el",
                            "score": 2,
                            "created_utc": 1598489114.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Yeah different strokes. And this wasn’t with a sugar daddy this was with a vanilla boyfriend I had.",
            "author": null,
            "id": "g2wdajs",
            "parent_id": "t1_g2vmk3b",
            "score": 1,
            "created_utc": 1598439901.0,
            "replies": []
        },
        {
            "body": "I’m black. I will say your OP is based solely upon your preference but shouldn’t be the theme for every black SB. \n\nThere are plenty of black women who enjoy being objectified, called chocolate, exotic, and will be brave enough to say fuck the status quo and taboo I wanna experience race play.  Is there anything wrong with them/us? Nope. Do we fit into your sentiment of disgust? Nope. \n\nSo although I can understand your position, like the other poster said, this this is not a one size fits all matter and you should accept the diversity in that instead of making it yet another contentious issue. \n\nOkay, you don’t like it. So what? Stick with what you like and sugar happily.",
            "author": null,
            "id": "g2ym2el",
            "parent_id": "t1_g2y89hf",
            "score": 2,
            "created_utc": 1598481344.0,
            "replies": [
                {
                    "body": "I'm not averse to race play as you assume, I'm averse to not being able to consent to the (sometimes traumatic) experience of being asked. Black women can do it as they like and bring it up, but the expectation cannot be placed on us.",
                    "author": "SugarBabyStoner",
                    "id": "g2z0qfh",
                    "parent_id": "t1_g2ym2el",
                    "score": 2,
                    "created_utc": 1598489114.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I'm not averse to race play as you assume, I'm averse to not being able to consent to the (sometimes traumatic) experience of being asked. Black women can do it as they like and bring it up, but the expectation cannot be placed on us.",
            "author": "SugarBabyStoner",
            "id": "g2z0qfh",
            "parent_id": "t1_g2ym2el",
            "score": 2,
            "created_utc": 1598489114.0,
            "replies": []
        }
    ]
}