{
    "title": "\"But my inbox is always full\"...🙄",
    "post_id": "ktvojz",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/ktvojz/but_my_inbox_is_always_full/",
    "author": "letsjusthavefunnow",
    "body": "That seems to be the now standard response by several potential SBs, after they post here and asks for a profile review, and gets constructive criticism from the group....then all of a sudden the usual \"well thanks, but my inbox is full of SDs who like (a.b.c.d.e.f.g)\"! If your inbox is so full...why do you need a profile review?! Just an observation. For the record - we dont believe you.\n\n\nEDIT: absolutely nothing is wrong with asking for a profile review - and nowhere did I state that. What I DID say is weird is the defensive response to criticism of said profiles...",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/ktvojz/but_my_inbox_is_always_full/",
    "score": 165,
    "upvote_ratio": 0.94,
    "created_utc": 1610214920.0,
    "num_comments": 69,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "I'm actually grateful for ONE of the profile reviews. It was mentioned that maybe her profile was hidden. I checked mine. . . And it was hidden!\n\nI had deactivated my account at one point, so maybe it happened then. But I had no clue until I read that comment and decided to check mine.\n\nSo, I'll not complain about profile reviews!\n\nEdit: The inbox is now my ego boost! Lol",
            "author": "B1oodSugarSexMagik",
            "id": "giofw0x",
            "parent_id": "t3_ktvojz",
            "score": 40,
            "created_utc": 1610217330.0,
            "replies": []
        },
        {
            "body": "Spot on. \n\nThere are three kinds of profile reviews here.\n\n1. Ones that are actually in need of help, to varying degrees. Usually the ones that are the worst off get thw most defensive.\n\n2. Ones that are mostly fine in many senses that are just not getting / finding exactly what they are looking for and think some advice may help. \n\n3. Clearly people wanting an ego boost and or are using that as a sort of way to fish.",
            "author": "BigBearSD",
            "id": "gioc9lp",
            "parent_id": "t3_ktvojz",
            "score": 68,
            "created_utc": 1610215553.0,
            "replies": [
                {
                    "body": ">Usually the ones that are the worst off get thw most defensive.\n\nThis ☝️👍🤣",
                    "author": "letsjusthavefunnow",
                    "id": "gioci03",
                    "parent_id": "t1_gioc9lp",
                    "score": 21,
                    "created_utc": 1610215669.0,
                    "replies": [
                        {
                            "body": "Agreed. I’ve considered posting mine in order to help other SBs by giving an example of what a successful profile looks like, because I’ve never had an issue and often get compliments on my written portion. Instead, I give the same advice repeatedly on every profile review posted, because I don’t wanna seem like a “look at meee” girl. 😂\n\nEdit: I’ve received 8 or 9 DMs now from SBs asking to see my profile. I told the first one I’d send her screens after confirming she’s a SB and not a SD, but I don’t feel comfortable mass producing images of my SA profile. Please don’t message me asking for it! I’ll share it in a post myself if I ever feel comfortable doing so. I am more than willing to give tips and advice! Just not pics of my actual profile.",
                            "author": "FoxyFreckles1989",
                            "id": "giotpfz",
                            "parent_id": "t1_gioci03",
                            "score": 13,
                            "created_utc": 1610223928.0,
                            "replies": [
                                {
                                    "body": "Can you, please? I'm still at the researching phase. I have a lot of tips/notes for a writing profile saved but  theyre mostly of what not do. I know there's  a guide on how to make a profile great, I still think seeing a few good examples would help more.",
                                    "author": "96butterrcup",
                                    "id": "gip41t7",
                                    "parent_id": "t1_giotpfz",
                                    "score": 10,
                                    "created_utc": 1610228941.0,
                                    "replies": [
                                        {
                                            "body": "Honestly the profile is overrated. SD’s mainly care about your pictures, and if your profile shows you’re ok with meeting up and being intimate. Everything else is just fluff. \n\nYou could have one sentence about seeking a mutually beneficial arrangement with a genuine connection and attraction. And I would rather message that person over someone with an essay full of paragraphs that don’t really say what she’s looking for lol.\n\nIm an SD and I have 2 sentences in my profile and I still get tons of messages.",
                                            "author": "Fun_Focus8159",
                                            "id": "gip53va",
                                            "parent_id": "t1_gip41t7",
                                            "score": 11,
                                            "created_utc": 1610229478.0,
                                            "replies": [
                                                {
                                                    "body": "This is how you feel, not “most” SDs. I’m not interested in hearing from SDs that only care about my pictures (of which I have many) and can’t be bothered to spend a minute or two reading the several paragraphs I took the time to write, and that’s fine. I did write about what I’m interested in and have to offer and am fairly detailed. The men that appreciate this are apparent when they message me, which makes things easier for everyone involved.\n\nEdit: I agree that writing several paragraphs that somehow still don’t make it clear what you’re interested in/looking for/have to offer would be ridiculous. I’ve seen a few SD profiles go on and on and still actually say absolutely nothing about them. That’s annoying and futile. Lmao",
                                                    "author": "FoxyFreckles1989",
                                                    "id": "gipdo98",
                                                    "parent_id": "t1_gip53va",
                                                    "score": 6,
                                                    "created_utc": 1610233763.0,
                                                    "replies": [
                                                        {
                                                            "body": "You’re not a SD so how do you know what most\nSD feel or are looking for? It would be like me telling you what SB’s are looking for in an SD on their profile.",
                                                            "author": "Fun_Focus8159",
                                                            "id": "girsqgs",
                                                            "parent_id": "t1_gipdo98",
                                                            "score": 2,
                                                            "created_utc": 1610294581.0,
                                                            "replies": [
                                                                {
                                                                    "body": "I pay attention. I know that this single SD cannot speak for all SDs, and neither can I. I see what is written on SLF. I see what is written in SA.",
                                                                    "author": "FoxyFreckles1989",
                                                                    "id": "girukea",
                                                                    "parent_id": "t1_girsqgs",
                                                                    "score": 1,
                                                                    "created_utc": 1610295576.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "Yes that’s true I don’t represent every SD in the world. But I would bet most SD’s agree with me.",
                                                                            "author": "Fun_Focus8159",
                                                                            "id": "girw960",
                                                                            "parent_id": "t1_girukea",
                                                                            "score": 2,
                                                                            "created_utc": 1610296480.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "Your opinion is yours, and I won’t argue with it. I’m perfectly fine with the SDs whom prefer a SB that has a profile like mine and then messages me to tell me that. I don’t need every SD on SA, let alone on SLF, to agree with me. That would be ridiculous! Lol",
                                                                                    "author": "FoxyFreckles1989",
                                                                                    "id": "girwoxz",
                                                                                    "parent_id": "t1_girw960",
                                                                                    "score": 1,
                                                                                    "created_utc": 1610296711.0,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "body": "I guess all the people that upvoted me disagree with you :)",
                                                            "author": "Fun_Focus8159",
                                                            "id": "giqve69",
                                                            "parent_id": "t1_gipdo98",
                                                            "score": -3,
                                                            "created_utc": 1610266431.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Is this supposed to be...  joke? What a petty response. I also suppose all of the people that upvoted me disagree with you, but I’d never had said as much in an attempt to make a point.",
                                                                    "author": "FoxyFreckles1989",
                                                                    "id": "gir5hma",
                                                                    "parent_id": "t1_giqve69",
                                                                    "score": 4,
                                                                    "created_utc": 1610276586.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "body": "100 hundred percent. Spot on.  She could write war and peace but if i don't find her attractive im mot messaging.  I look at her ohotos then look to see if she wants platonic.  If she sounds really high maintenance I tend to avoid.  Most of the descriptions are fake anyway like what they are studying or whether they do drugs for example.",
                                                    "author": "wb19081908",
                                                    "id": "giq68kj",
                                                    "parent_id": "t1_gip53va",
                                                    "score": 3,
                                                    "created_utc": 1610248942.0,
                                                    "replies": [
                                                        {
                                                            "body": "So, if she sounds really high maintenance based on her written profile you avoid her? This is a prime example of the written profile being beneficial to you.",
                                                            "author": "FoxyFreckles1989",
                                                            "id": "gir5l1n",
                                                            "parent_id": "t1_giq68kj",
                                                            "score": 3,
                                                            "created_utc": 1610276681.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Lol pedantic.  People can have their own views for me thr pbotos are the biggest part.  Even then loads are fske anyway.  Some girls never bother to update their descriptions leaving it n/a.  If she wants nsa and will meet then I'll message her idc",
                                                                    "author": "wb19081908",
                                                                    "id": "gir82of",
                                                                    "parent_id": "t1_gir5l1n",
                                                                    "score": 1,
                                                                    "created_utc": 1610279201.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "How do you know these things before talking to her, aside from what’s written on her profile? I’m not saying the written profile itself is more important than photos/tags, but both comments you’ve left have literally been examples of the written profile indicating whether or not you’d feel messaging a SB was worth it! Lol *pedantic.*",
                                                                            "author": "FoxyFreckles1989",
                                                                            "id": "gitf56t",
                                                                            "parent_id": "t1_gir82of",
                                                                            "score": 1,
                                                                            "created_utc": 1610323737.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "Just for me j hate spending ages messaging a girl.  After photos I look to see if she wants platonic.  Or if she sounds demanding.\n\nFrom my experience profiles dont mean much.  You have to meet and see if you connect in person.  If a girl can meet fairly soon after messaging on sa is good for me.\n\nSa In Australia has changed now anyway.  Its basically tinder for older guys to pay.  Genuine sd relationships sre rare.  Similarly loads of girls are happy for one offs or a double with a friend.  This wasn't.tje case when I  joined",
                                                                                    "author": "wb19081908",
                                                                                    "id": "giu7j4k",
                                                                                    "parent_id": "t1_gitf56t",
                                                                                    "score": 1,
                                                                                    "created_utc": 1610337887.0,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "body": "This. I try and decode her long wordy essays to see if she’s just looking for platonic only. I love the really long wordy profiles and then at the very bottom it says 100% platonic only. Like Damn you could’ve just said that at the very beginning of your profile and saved me a lot of time lol.",
                                                            "author": "Fun_Focus8159",
                                                            "id": "girsfoz",
                                                            "parent_id": "t1_giq68kj",
                                                            "score": 2,
                                                            "created_utc": 1610294415.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "body": "I’ll consider it. I’m not sure I’m ready to lose the anonymity of this profile. Lmao. \n\nI’d be happy to send you screenshots of my profile and give you tips, privately.",
                                            "author": "FoxyFreckles1989",
                                            "id": "gipem7x",
                                            "parent_id": "t1_gip41t7",
                                            "score": 1,
                                            "created_utc": 1610234246.0,
                                            "replies": [
                                                {
                                                    "body": "Really? That be great, thankyou!",
                                                    "author": "96butterrcup",
                                                    "id": "gipntzv",
                                                    "parent_id": "t1_gipem7x",
                                                    "score": 1,
                                                    "created_utc": 1610239064.0,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "body": "Please ignore the many people here who claim to speak for everyone here, like OP and the SD advising you (incorrectly) that only pictures matter. \n\nDo you really want to be in a relationship with someone who only cares how you look like and whether you are down for sex? I wouldn't. \n\nHaving a profile that repels people like that is great. Saves you the trouble if blocking them later.\n\nProfile contents matter.\n\nProfile reviews help.\n\nBut they need to be tailored to what you are looking for,  and what kind of partner or relationship you are looking for.",
                                            "author": "GDarn",
                                            "id": "gip8ui9",
                                            "parent_id": "t1_gip41t7",
                                            "score": 0,
                                            "created_utc": 1610231326.0,
                                            "replies": [
                                                {
                                                    "body": "It’s not that profiles don’t matter, it’s that you learn more about a person through actual conversation and interaction with them than from a profile. Anyone can say they have qualities A, B, and C in their profile. It’s not until you talk to them that you really find out. \n\nI can tell more about a person from a first cut profile than I can from one that’s been overly refined and perfected.",
                                                    "author": "midwesternguru",
                                                    "id": "gipcbhf",
                                                    "parent_id": "t1_gip8ui9",
                                                    "score": 5,
                                                    "created_utc": 1610233072.0,
                                                    "replies": [
                                                        {
                                                            "body": "You don’t know what profiles are first-cuts and what profiles have been tweaked and “perfected” if you’re seeing them for the first time. Some people just aren’t great at writing about themselves and asking for advice isn’t a bad thing. I’ve been told by dozens of SBs that I’ve given profile advice to that they had more fruitful interactions, leading to dates, on SA after I helped them. I’m glad!",
                                                            "author": "FoxyFreckles1989",
                                                            "id": "gipdydu",
                                                            "parent_id": "t1_gipcbhf",
                                                            "score": 2,
                                                            "created_utc": 1610233906.0,
                                                            "replies": [
                                                                {
                                                                    "body": "For example, a frequent piece of advice here is to avoid negativity in a profile, which is good advice, I am very turned off by negativity. But if you are by nature a negative person, then it’s going to come out at some point, and I’d rather not message them in the first place.",
                                                                    "author": "midwesternguru",
                                                                    "id": "gipils8",
                                                                    "parent_id": "t1_gipdydu",
                                                                    "score": 1,
                                                                    "created_utc": 1610236346.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "I agree. Advice should never include purposely misrepresenting oneself. However, I think that more often advice against “negativity” is in regards to things like referring to your own body image and perceived self worth in a negative manner, or saying things like “don’t waste my time,” or, “I’m always getting scammed on here,” along with other negative phrases. Sometimes things we write come off negatively without that intention or our own knowledge. Advice against that is good.",
                                                                            "author": "FoxyFreckles1989",
                                                                            "id": "gitfnx2",
                                                                            "parent_id": "t1_gipils8",
                                                                            "score": 1,
                                                                            "created_utc": 1610323993.0,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "body": "A profile is never enough, of course - you absolutely learn more from in person conversation.\n\nBut my experience is that if you set meet and greets with POT SBs with low effort profiles, you are going to be disappointed again and again.\n\nFor me, a well written, genuine, insightful profile tends to be highly correlated with a successful meet and greet. Low effort, platitude/catchphrase filled profiles, not so much.\n\nYour mileage may vary, of course.",
                                                            "author": "GDarn",
                                                            "id": "giraglc",
                                                            "parent_id": "t1_gipcbhf",
                                                            "score": 2,
                                                            "created_utc": 1610281568.0,
                                                            "replies": [
                                                                {
                                                                    "body": "This. I was hoping a SD would say something along these lines. No, I’m not a SD and I cannot speak for them. But in my experience (which includes mentoring dozens of first time SBs from the point of creating their profile to entering their first long term SR as well as over ten years of sugaring, myself) having a thoughtful profile that took more than minimal effort results in more legitimate options.",
                                                                    "author": "FoxyFreckles1989",
                                                                    "id": "gis4efi",
                                                                    "parent_id": "t1_giraglc",
                                                                    "score": 2,
                                                                    "created_utc": 1610300523.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Lol “my inbox is full but It’s All creepy men messaging me for sex. Ugh why aren’t there any real SD’s out there!”",
            "author": "Fun_Focus8159",
            "id": "giobozp",
            "parent_id": "t3_ktvojz",
            "score": 33,
            "created_utc": 1610215267.0,
            "replies": []
        },
        {
            "body": "With the growth of social media and sites such as Seeking and Tinder, I think it’s quite common for an attractive woman’s inbox to fill up.  And I think women may tend to be misled that the inbox validates they are doing things well.  Instead of relying on inbox size, I would instead rely on how successful you have been with relationships over the past year.",
            "author": "HappyBear1952",
            "id": "giosv0t",
            "parent_id": "t3_ktvojz",
            "score": 12,
            "created_utc": 1610223502.0,
            "replies": []
        },
        {
            "body": "Sometimes, it's really just for gathering opinions. It's good to hear some objective opinions from people in the lifestyle who aren't trying to seduce you. Just like people get their resumes reviewed.\n\nMy inbox isn't full, but my life is. I recently posted my profile for some constructive criticism and opinions.  I received some, \"try being a sugar momma,\" \"you should go older, because that's the traditional way,\" and \"you should  wife-up.\" I'm perfect aware that I'm a niche fit and happy to be so. \n\nNow, there was some really good remarks. Someone suggested I take down a disclaimer about requesting pics. It was a good idea and I did it. Another opined that I had what could be negative comments. I'm looking into that (although I expect it may be a bit of being somwhat Domme). \n\nOverall, it was interesting to gather the feedback and see where I could make improvements.",
            "author": "LadyMorgan2018",
            "id": "giofy7k",
            "parent_id": "t3_ktvojz",
            "score": 8,
            "created_utc": 1610217359.0,
            "replies": [
                {
                    "body": "Gathering opinions and feedback is smart - esp in the bowl!!! I respect potential SBs who really want to put their best foot forward. Thing is, when a profile receives a negative review of something (which from what I've seen, usually is some \"harsh truth\") - the immediate rebuttal to the comment is always \"well my inbox is full of...\" which is just so cringey! Asking for feedback then getting defensive and trying to shut it down...is just sad in my book.",
                    "author": "letsjusthavefunnow",
                    "id": "gioolhz",
                    "parent_id": "t1_giofy7k",
                    "score": 0,
                    "created_utc": 1610221444.0,
                    "replies": [
                        {
                            "body": "Yes!!! I totally agree! I'm still new here, so I haven't seen that.",
                            "author": "LadyMorgan2018",
                            "id": "giopsx8",
                            "parent_id": "t1_gioolhz",
                            "score": -1,
                            "created_utc": 1610222036.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Because most of them are looking for an ego boost or validation. The same exact reason they are on SA.\n\nProfile reviews are mostly useless. Everyone is messaging hot women unless their profile is one big red flag.",
            "author": "new_sd_acct",
            "id": "giobi8m",
            "parent_id": "t3_ktvojz",
            "score": 16,
            "created_utc": 1610215175.0,
            "replies": [
                {
                    "body": "Sure she is hot and all, but there's no way I am messaging her since she didn't use picture #3 as her profile pic.",
                    "author": "wildhorses6565",
                    "id": "giopftv",
                    "parent_id": "t1_giobi8m",
                    "score": 9,
                    "created_utc": 1610221853.0,
                    "replies": []
                },
                {
                    "body": "I disagree with them being useless. If the SB posting is actually willing to accept constructive criticism (which we do see, quite often) then it can really help. Lots of times the main issues are that the written portions are lacking in any pertinent info or the photos chosen suck. Changing both of those things goes a long way and I’ve had many SBs thank me for helping them garner much more attention from the “right” men! 😊",
                    "author": "FoxyFreckles1989",
                    "id": "giou0iu",
                    "parent_id": "t1_giobi8m",
                    "score": 3,
                    "created_utc": 1610224079.0,
                    "replies": [
                        {
                            "body": "Can you please direct me to your profile review?",
                            "author": "new_sd_acct",
                            "id": "giq7cva",
                            "parent_id": "t1_giou0iu",
                            "score": 1,
                            "created_utc": 1610249559.0,
                            "replies": [
                                {
                                    "body": "I think you might be confused. I’ve never felt the need to post my own profile review. I was referring to the many SBs I’ve given advice to (on and off SLF).",
                                    "author": "FoxyFreckles1989",
                                    "id": "giq7mwo",
                                    "parent_id": "t1_giq7cva",
                                    "score": 0,
                                    "created_utc": 1610249703.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": ">Everyone is messaging hot women unless their profile is one big red flag.\n\nYet another genius who thinks they can speak for everyone.\n\nSpeak for yourself and people of your ilk. \n\nThe rest of us can speak for ourselves just fine, eh?",
                    "author": "GDarn",
                    "id": "gip96e8",
                    "parent_id": "t1_giobi8m",
                    "score": -2,
                    "created_utc": 1610231492.0,
                    "replies": [
                        {
                            "body": "No SB wants to have sex with you",
                            "author": "new_sd_acct",
                            "id": "giq70nf",
                            "parent_id": "t1_gip96e8",
                            "score": -2,
                            "created_utc": 1610249375.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "This will be an unpopular opinion but I have sympathy for those SBs and I think that a lot of the time it could be avoided if more people on this sub realised that \"harsh\" and \"constructive\" are not synonyms. To clarify, I agree that it's annoying and unhelpful when SBs (or anyone seeking feedback for that matter) get defensive like that but I really believe that if some reviewers changed the WAY they deliver their feedback, a lot of the defensiveness could be avoided. After all the people who are posting their profiles are really putting themselves out there and just because they're SBs doesn't mean that they can't be vulnerable and react accordingly. I haven't put my profile up for review personally but seeing some of the comments on other reviews makes me think that the communication could be improved.",
            "author": "lipstick_academic",
            "id": "gir4zmh",
            "parent_id": "t3_ktvojz",
            "score": 3,
            "created_utc": 1610276087.0,
            "replies": []
        },
        {
            "body": "A lot of these may just be fishing for SD’s in here under the guise of wanting legitimate constructive criticism.",
            "author": "unclewolfy",
            "id": "giou3tq",
            "parent_id": "t3_ktvojz",
            "score": 5,
            "created_utc": 1610224122.0,
            "replies": [
                {
                    "body": "Oh I believe that - to some degree a fee may be fishing for an SD.  But I just find it funny when those same SDs tell them \"your pictures are NOT good\" or else \"your chances of find a straight SD are slim because you are (obese, unattractive, married, trans, looking for a SM, look absolutely insane in their pics, etc) - some leap right to being defensive?! I never understood that mentality - if you ask for a review, have the guts to take the feedback. Now I've seen some responses get belligerent, and those I can't cosign! Rude is rude. But those that are constructive...no prob.",
                    "author": "letsjusthavefunnow",
                    "id": "gioupwx",
                    "parent_id": "t1_giou3tq",
                    "score": 1,
                    "created_utc": 1610224424.0,
                    "replies": [
                        {
                            "body": "See, I think some of those projections are that, projections, not criticisms. Criticism to presentation and technical criticisms on layout and i fo provided etc makes sense. But targeting body types and super subjective attractiveness is crossing a different line. However, assholes *are* unfortunately everywhere, especially where a lot of people DO only see the surface. Because you never know if you’ll catch the big one or a garbage fish, people requesting reviews should know they *will* get those assholes, whether they are fishing for SD’s or SM’s or what.",
                            "author": "unclewolfy",
                            "id": "giovawj",
                            "parent_id": "t1_gioupwx",
                            "score": 4,
                            "created_utc": 1610224697.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "So torn on the profile. My last two and most successful srs were with sbs who wrote a total of one sentence in each section and had one picture. One had a pic of their face. The other had a body shot in a bikini. \n\nI do read a lot of profiles but have come to not trust most of them so I’ll send a bunch of messages. Responding promptly, willing to go back and forth for a few messages and willing to meet in a reasonable amount of time tend to be more important factors.",
            "author": null,
            "id": "gipaofl",
            "parent_id": "t3_ktvojz",
            "score": 3,
            "created_utc": 1610232243.0,
            "replies": [
                {
                    "body": "Spot on.  Ive had girls message me back months later.  Or message for weeks and not meet.  You've pointed out all the things I look for in a serious sb.  If thry don't meet with a week of messaging it's not happening.  Shes got you as plan b c of d or has no intention kf ever meeting",
                    "author": "wb19081908",
                    "id": "giq6wlb",
                    "parent_id": "t1_gipaofl",
                    "score": 1,
                    "created_utc": 1610249313.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "giobv1q",
            "parent_id": "t3_ktvojz",
            "score": 3,
            "created_utc": 1610215353.0,
            "replies": [
                {
                    "body": "Which shows how awful the SD pool is on SA....transactional, cheap  and far below escort rates on average.\n\nSDs whining over a membership fee? Really",
                    "author": "bookworm010101",
                    "id": "gioeype",
                    "parent_id": "t1_giobv1q",
                    "score": 7,
                    "created_utc": 1610216877.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "gioia2a",
                            "parent_id": "t1_gioeype",
                            "score": 3,
                            "created_utc": 1610218464.0,
                            "replies": [
                                {
                                    "body": "We just have different viewpoints of what spoiling is.\n\nGood luck to you.",
                                    "author": "bookworm010101",
                                    "id": "giondt3",
                                    "parent_id": "t1_gioia2a",
                                    "score": 0,
                                    "created_utc": 1610220858.0,
                                    "replies": []
                                },
                                {
                                    "body": "If sugaring wasn't cheaper than escorting then what would be the point? I expect a SB to be FAR cheaper",
                                    "author": "Blade4Hoover",
                                    "id": "giolkpl",
                                    "parent_id": "t1_gioia2a",
                                    "score": -3,
                                    "created_utc": 1610220019.0,
                                    "replies": [
                                        {
                                            "body": "Pffft really? You spend more time, have more sex, talk more, and demand more why would you pay less?\n\nValidate me, text me, make me think I still have it, want me, for a few benjamins a meet please.\n\nThere is real sugar and splenda most of this current realm is splenda at best.",
                                            "author": "bookworm010101",
                                            "id": "gionkff",
                                            "parent_id": "t1_giolkpl",
                                            "score": 3,
                                            "created_utc": 1610220944.0,
                                            "replies": [
                                                {
                                                    "body": "No, way LESS sex. And it's regular income for them",
                                                    "author": "Blade4Hoover",
                                                    "id": "gitm0c0",
                                                    "parent_id": "t1_gionkff",
                                                    "score": 1,
                                                    "created_utc": 1610327128.0,
                                                    "replies": [
                                                        {
                                                            "body": "Regular income for \"them\" geesh you sound like one real SD.",
                                                            "author": "bookworm010101",
                                                            "id": "gitmhry",
                                                            "parent_id": "t1_gitm0c0",
                                                            "score": 1,
                                                            "created_utc": 1610327382.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "body": "seriously? lol",
                                            "author": "fallingsd",
                                            "id": "gkszrgt",
                                            "parent_id": "t1_giolkpl",
                                            "score": 1,
                                            "created_utc": 1611649687.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "Facts fr tho",
                            "author": "NihilisticBuddhism",
                            "id": "giohir3",
                            "parent_id": "t1_gioeype",
                            "score": -1,
                            "created_utc": 1610218110.0,
                            "replies": []
                        },
                        {
                            "body": ">SDs whining over a membership fee? Really\n\nThat's because the membership bring very little value to an SD these days. Lots of scammers and time wasters, so why I'm i paying this company again?\n\nIf SA had better filters and even a membership fee for SBs then I would gladly pay a lot more.\n\nBut SA is a mess right now, just not worth it.",
                            "author": "AdAlternative6041",
                            "id": "giun96t",
                            "parent_id": "t1_gioeype",
                            "score": 1,
                            "created_utc": 1610348208.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": ">For the record - we dont believe you.\n\nWho is this \"we\" you are speaking on behalf of?",
            "author": "GDarn",
            "id": "gip1f4w",
            "parent_id": "t3_ktvojz",
            "score": 2,
            "created_utc": 1610227624.0,
            "replies": [
                {
                    "body": "Thank you.  I formally withdraw my consent to be included in OP's \"we\".  \n\nSomeone with username \"let's just have fun now\" waahing about people wanting ego boosts on social media.  Okay.",
                    "author": null,
                    "id": "gip6zu0",
                    "parent_id": "t1_gip1f4w",
                    "score": 3,
                    "created_utc": 1610230413.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Sometimes when a person asks for feedback, they're looking for validation.  If you don't validate their profile, they aren't happy.",
            "author": "hal99514",
            "id": "gipb904",
            "parent_id": "t3_ktvojz",
            "score": 2,
            "created_utc": 1610232528.0,
            "replies": [
                {
                    "body": "Kinda like when someone says \"does this dress make me look fat.\"  The best response is to fake a heart attack.",
                    "author": "hal99514",
                    "id": "gipdvbv",
                    "parent_id": "t1_gipb904",
                    "score": 6,
                    "created_utc": 1610233862.0,
                    "replies": [
                        {
                            "body": "🤣",
                            "author": "B1oodSugarSexMagik",
                            "id": "giq190b",
                            "parent_id": "t1_gipdvbv",
                            "score": 0,
                            "created_utc": 1610246178.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "A full inbox for an SB doesn’t mean that much. I made an SB profile with a generic boring photo and no significant text and had like 200 messages overnight too.",
            "author": "UseTheForceRey",
            "id": "giqcdxy",
            "parent_id": "t3_ktvojz",
            "score": 2,
            "created_utc": 1610252344.0,
            "replies": []
        },
        {
            "body": "Maybe they don't need a profile review, they'd just like one. It's useful for figuring out which type of guys not to bother with because there's no natural mutual appreciation.",
            "author": "metisviking",
            "id": "gip5rjz",
            "parent_id": "t3_ktvojz",
            "score": 1,
            "created_utc": 1610229810.0,
            "replies": []
        },
        {
            "body": "My inbox is full and I don’t even have anything written ... I thought all you needed was cute pictures lol ... but taking notes from other profile reviews, I think it would allow for better quality in my inbox",
            "author": "PsychologicalMud9673",
            "id": "giqaxbd",
            "parent_id": "t3_ktvojz",
            "score": 1,
            "created_utc": 1610251526.0,
            "replies": []
        },
        {
            "body": "Most profile reviews = free advertising \n\nPlain and simple \n\nTry to help if you can and move on if they are rude",
            "author": "KnocDown",
            "id": "giqj25k",
            "parent_id": "t3_ktvojz",
            "score": 1,
            "created_utc": 1610256465.0,
            "replies": []
        },
        {
            "body": "I think that a significant number of profile reviews are advertising attempts to get their profile seen by the better than average SDs that are on this forum. Yes, they may take & benefit from the comments. However, getting a DM from a real SD who believes all the values promoted by this forum could nullify their need even to have a profile on SA.",
            "author": "docrolling",
            "id": "giqr9l9",
            "parent_id": "t3_ktvojz",
            "score": 1,
            "created_utc": 1610262692.0,
            "replies": []
        },
        {
            "body": "[removed]",
            "author": null,
            "id": "gir1lex",
            "parent_id": "t3_ktvojz",
            "score": -1,
            "created_utc": 1610272593.0,
            "replies": [
                {
                    "body": "Reported. Cause you lost your damn mind...and have terrible grammar.",
                    "author": "letsjusthavefunnow",
                    "id": "gir1ob8",
                    "parent_id": "t1_gir1lex",
                    "score": 2,
                    "created_utc": 1610272678.0,
                    "replies": [
                        {
                            "body": "i am sorry but my english isnt that good \nam from germany",
                            "author": "Koeniginpenelope",
                            "id": "gir1vmm",
                            "parent_id": "t1_gir1ob8",
                            "score": 0,
                            "created_utc": 1610272880.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Okay wait I don’t understand how your guy’s inbox is always full?! I literally have to view read and favorite like 20 profiles to get a couple views.... send help...",
            "author": "SnooMuffins4170",
            "id": "gisa913",
            "parent_id": "t3_ktvojz",
            "score": 1,
            "created_utc": 1610303728.0,
            "replies": []
        },
        {
            "body": ">Usually the ones that are the worst off get thw most defensive.\n\nThis ☝️👍🤣",
            "author": "letsjusthavefunnow",
            "id": "gioci03",
            "parent_id": "t1_gioc9lp",
            "score": 21,
            "created_utc": 1610215669.0,
            "replies": [
                {
                    "body": "Agreed. I’ve considered posting mine in order to help other SBs by giving an example of what a successful profile looks like, because I’ve never had an issue and often get compliments on my written portion. Instead, I give the same advice repeatedly on every profile review posted, because I don’t wanna seem like a “look at meee” girl. 😂\n\nEdit: I’ve received 8 or 9 DMs now from SBs asking to see my profile. I told the first one I’d send her screens after confirming she’s a SB and not a SD, but I don’t feel comfortable mass producing images of my SA profile. Please don’t message me asking for it! I’ll share it in a post myself if I ever feel comfortable doing so. I am more than willing to give tips and advice! Just not pics of my actual profile.",
                    "author": "FoxyFreckles1989",
                    "id": "giotpfz",
                    "parent_id": "t1_gioci03",
                    "score": 13,
                    "created_utc": 1610223928.0,
                    "replies": [
                        {
                            "body": "Can you, please? I'm still at the researching phase. I have a lot of tips/notes for a writing profile saved but  theyre mostly of what not do. I know there's  a guide on how to make a profile great, I still think seeing a few good examples would help more.",
                            "author": "96butterrcup",
                            "id": "gip41t7",
                            "parent_id": "t1_giotpfz",
                            "score": 10,
                            "created_utc": 1610228941.0,
                            "replies": [
                                {
                                    "body": "Honestly the profile is overrated. SD’s mainly care about your pictures, and if your profile shows you’re ok with meeting up and being intimate. Everything else is just fluff. \n\nYou could have one sentence about seeking a mutually beneficial arrangement with a genuine connection and attraction. And I would rather message that person over someone with an essay full of paragraphs that don’t really say what she’s looking for lol.\n\nIm an SD and I have 2 sentences in my profile and I still get tons of messages.",
                                    "author": "Fun_Focus8159",
                                    "id": "gip53va",
                                    "parent_id": "t1_gip41t7",
                                    "score": 11,
                                    "created_utc": 1610229478.0,
                                    "replies": [
                                        {
                                            "body": "This is how you feel, not “most” SDs. I’m not interested in hearing from SDs that only care about my pictures (of which I have many) and can’t be bothered to spend a minute or two reading the several paragraphs I took the time to write, and that’s fine. I did write about what I’m interested in and have to offer and am fairly detailed. The men that appreciate this are apparent when they message me, which makes things easier for everyone involved.\n\nEdit: I agree that writing several paragraphs that somehow still don’t make it clear what you’re interested in/looking for/have to offer would be ridiculous. I’ve seen a few SD profiles go on and on and still actually say absolutely nothing about them. That’s annoying and futile. Lmao",
                                            "author": "FoxyFreckles1989",
                                            "id": "gipdo98",
                                            "parent_id": "t1_gip53va",
                                            "score": 6,
                                            "created_utc": 1610233763.0,
                                            "replies": [
                                                {
                                                    "body": "You’re not a SD so how do you know what most\nSD feel or are looking for? It would be like me telling you what SB’s are looking for in an SD on their profile.",
                                                    "author": "Fun_Focus8159",
                                                    "id": "girsqgs",
                                                    "parent_id": "t1_gipdo98",
                                                    "score": 2,
                                                    "created_utc": 1610294581.0,
                                                    "replies": [
                                                        {
                                                            "body": "I pay attention. I know that this single SD cannot speak for all SDs, and neither can I. I see what is written on SLF. I see what is written in SA.",
                                                            "author": "FoxyFreckles1989",
                                                            "id": "girukea",
                                                            "parent_id": "t1_girsqgs",
                                                            "score": 1,
                                                            "created_utc": 1610295576.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Yes that’s true I don’t represent every SD in the world. But I would bet most SD’s agree with me.",
                                                                    "author": "Fun_Focus8159",
                                                                    "id": "girw960",
                                                                    "parent_id": "t1_girukea",
                                                                    "score": 2,
                                                                    "created_utc": 1610296480.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "Your opinion is yours, and I won’t argue with it. I’m perfectly fine with the SDs whom prefer a SB that has a profile like mine and then messages me to tell me that. I don’t need every SD on SA, let alone on SLF, to agree with me. That would be ridiculous! Lol",
                                                                            "author": "FoxyFreckles1989",
                                                                            "id": "girwoxz",
                                                                            "parent_id": "t1_girw960",
                                                                            "score": 1,
                                                                            "created_utc": 1610296711.0,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "body": "I guess all the people that upvoted me disagree with you :)",
                                                    "author": "Fun_Focus8159",
                                                    "id": "giqve69",
                                                    "parent_id": "t1_gipdo98",
                                                    "score": -3,
                                                    "created_utc": 1610266431.0,
                                                    "replies": [
                                                        {
                                                            "body": "Is this supposed to be...  joke? What a petty response. I also suppose all of the people that upvoted me disagree with you, but I’d never had said as much in an attempt to make a point.",
                                                            "author": "FoxyFreckles1989",
                                                            "id": "gir5hma",
                                                            "parent_id": "t1_giqve69",
                                                            "score": 4,
                                                            "created_utc": 1610276586.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "body": "100 hundred percent. Spot on.  She could write war and peace but if i don't find her attractive im mot messaging.  I look at her ohotos then look to see if she wants platonic.  If she sounds really high maintenance I tend to avoid.  Most of the descriptions are fake anyway like what they are studying or whether they do drugs for example.",
                                            "author": "wb19081908",
                                            "id": "giq68kj",
                                            "parent_id": "t1_gip53va",
                                            "score": 3,
                                            "created_utc": 1610248942.0,
                                            "replies": [
                                                {
                                                    "body": "So, if she sounds really high maintenance based on her written profile you avoid her? This is a prime example of the written profile being beneficial to you.",
                                                    "author": "FoxyFreckles1989",
                                                    "id": "gir5l1n",
                                                    "parent_id": "t1_giq68kj",
                                                    "score": 3,
                                                    "created_utc": 1610276681.0,
                                                    "replies": [
                                                        {
                                                            "body": "Lol pedantic.  People can have their own views for me thr pbotos are the biggest part.  Even then loads are fske anyway.  Some girls never bother to update their descriptions leaving it n/a.  If she wants nsa and will meet then I'll message her idc",
                                                            "author": "wb19081908",
                                                            "id": "gir82of",
                                                            "parent_id": "t1_gir5l1n",
                                                            "score": 1,
                                                            "created_utc": 1610279201.0,
                                                            "replies": [
                                                                {
                                                                    "body": "How do you know these things before talking to her, aside from what’s written on her profile? I’m not saying the written profile itself is more important than photos/tags, but both comments you’ve left have literally been examples of the written profile indicating whether or not you’d feel messaging a SB was worth it! Lol *pedantic.*",
                                                                    "author": "FoxyFreckles1989",
                                                                    "id": "gitf56t",
                                                                    "parent_id": "t1_gir82of",
                                                                    "score": 1,
                                                                    "created_utc": 1610323737.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "Just for me j hate spending ages messaging a girl.  After photos I look to see if she wants platonic.  Or if she sounds demanding.\n\nFrom my experience profiles dont mean much.  You have to meet and see if you connect in person.  If a girl can meet fairly soon after messaging on sa is good for me.\n\nSa In Australia has changed now anyway.  Its basically tinder for older guys to pay.  Genuine sd relationships sre rare.  Similarly loads of girls are happy for one offs or a double with a friend.  This wasn't.tje case when I  joined",
                                                                            "author": "wb19081908",
                                                                            "id": "giu7j4k",
                                                                            "parent_id": "t1_gitf56t",
                                                                            "score": 1,
                                                                            "created_utc": 1610337887.0,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "body": "This. I try and decode her long wordy essays to see if she’s just looking for platonic only. I love the really long wordy profiles and then at the very bottom it says 100% platonic only. Like Damn you could’ve just said that at the very beginning of your profile and saved me a lot of time lol.",
                                                    "author": "Fun_Focus8159",
                                                    "id": "girsfoz",
                                                    "parent_id": "t1_giq68kj",
                                                    "score": 2,
                                                    "created_utc": 1610294415.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "I’ll consider it. I’m not sure I’m ready to lose the anonymity of this profile. Lmao. \n\nI’d be happy to send you screenshots of my profile and give you tips, privately.",
                                    "author": "FoxyFreckles1989",
                                    "id": "gipem7x",
                                    "parent_id": "t1_gip41t7",
                                    "score": 1,
                                    "created_utc": 1610234246.0,
                                    "replies": [
                                        {
                                            "body": "Really? That be great, thankyou!",
                                            "author": "96butterrcup",
                                            "id": "gipntzv",
                                            "parent_id": "t1_gipem7x",
                                            "score": 1,
                                            "created_utc": 1610239064.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "Please ignore the many people here who claim to speak for everyone here, like OP and the SD advising you (incorrectly) that only pictures matter. \n\nDo you really want to be in a relationship with someone who only cares how you look like and whether you are down for sex? I wouldn't. \n\nHaving a profile that repels people like that is great. Saves you the trouble if blocking them later.\n\nProfile contents matter.\n\nProfile reviews help.\n\nBut they need to be tailored to what you are looking for,  and what kind of partner or relationship you are looking for.",
                                    "author": "GDarn",
                                    "id": "gip8ui9",
                                    "parent_id": "t1_gip41t7",
                                    "score": 0,
                                    "created_utc": 1610231326.0,
                                    "replies": [
                                        {
                                            "body": "It’s not that profiles don’t matter, it’s that you learn more about a person through actual conversation and interaction with them than from a profile. Anyone can say they have qualities A, B, and C in their profile. It’s not until you talk to them that you really find out. \n\nI can tell more about a person from a first cut profile than I can from one that’s been overly refined and perfected.",
                                            "author": "midwesternguru",
                                            "id": "gipcbhf",
                                            "parent_id": "t1_gip8ui9",
                                            "score": 5,
                                            "created_utc": 1610233072.0,
                                            "replies": [
                                                {
                                                    "body": "You don’t know what profiles are first-cuts and what profiles have been tweaked and “perfected” if you’re seeing them for the first time. Some people just aren’t great at writing about themselves and asking for advice isn’t a bad thing. I’ve been told by dozens of SBs that I’ve given profile advice to that they had more fruitful interactions, leading to dates, on SA after I helped them. I’m glad!",
                                                    "author": "FoxyFreckles1989",
                                                    "id": "gipdydu",
                                                    "parent_id": "t1_gipcbhf",
                                                    "score": 2,
                                                    "created_utc": 1610233906.0,
                                                    "replies": [
                                                        {
                                                            "body": "For example, a frequent piece of advice here is to avoid negativity in a profile, which is good advice, I am very turned off by negativity. But if you are by nature a negative person, then it’s going to come out at some point, and I’d rather not message them in the first place.",
                                                            "author": "midwesternguru",
                                                            "id": "gipils8",
                                                            "parent_id": "t1_gipdydu",
                                                            "score": 1,
                                                            "created_utc": 1610236346.0,
                                                            "replies": [
                                                                {
                                                                    "body": "I agree. Advice should never include purposely misrepresenting oneself. However, I think that more often advice against “negativity” is in regards to things like referring to your own body image and perceived self worth in a negative manner, or saying things like “don’t waste my time,” or, “I’m always getting scammed on here,” along with other negative phrases. Sometimes things we write come off negatively without that intention or our own knowledge. Advice against that is good.",
                                                                    "author": "FoxyFreckles1989",
                                                                    "id": "gitfnx2",
                                                                    "parent_id": "t1_gipils8",
                                                                    "score": 1,
                                                                    "created_utc": 1610323993.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "body": "A profile is never enough, of course - you absolutely learn more from in person conversation.\n\nBut my experience is that if you set meet and greets with POT SBs with low effort profiles, you are going to be disappointed again and again.\n\nFor me, a well written, genuine, insightful profile tends to be highly correlated with a successful meet and greet. Low effort, platitude/catchphrase filled profiles, not so much.\n\nYour mileage may vary, of course.",
                                                    "author": "GDarn",
                                                    "id": "giraglc",
                                                    "parent_id": "t1_gipcbhf",
                                                    "score": 2,
                                                    "created_utc": 1610281568.0,
                                                    "replies": [
                                                        {
                                                            "body": "This. I was hoping a SD would say something along these lines. No, I’m not a SD and I cannot speak for them. But in my experience (which includes mentoring dozens of first time SBs from the point of creating their profile to entering their first long term SR as well as over ten years of sugaring, myself) having a thoughtful profile that took more than minimal effort results in more legitimate options.",
                                                            "author": "FoxyFreckles1989",
                                                            "id": "gis4efi",
                                                            "parent_id": "t1_giraglc",
                                                            "score": 2,
                                                            "created_utc": 1610300523.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Gathering opinions and feedback is smart - esp in the bowl!!! I respect potential SBs who really want to put their best foot forward. Thing is, when a profile receives a negative review of something (which from what I've seen, usually is some \"harsh truth\") - the immediate rebuttal to the comment is always \"well my inbox is full of...\" which is just so cringey! Asking for feedback then getting defensive and trying to shut it down...is just sad in my book.",
            "author": "letsjusthavefunnow",
            "id": "gioolhz",
            "parent_id": "t1_giofy7k",
            "score": 0,
            "created_utc": 1610221444.0,
            "replies": [
                {
                    "body": "Yes!!! I totally agree! I'm still new here, so I haven't seen that.",
                    "author": "LadyMorgan2018",
                    "id": "giopsx8",
                    "parent_id": "t1_gioolhz",
                    "score": -1,
                    "created_utc": 1610222036.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Sure she is hot and all, but there's no way I am messaging her since she didn't use picture #3 as her profile pic.",
            "author": "wildhorses6565",
            "id": "giopftv",
            "parent_id": "t1_giobi8m",
            "score": 9,
            "created_utc": 1610221853.0,
            "replies": []
        },
        {
            "body": "I disagree with them being useless. If the SB posting is actually willing to accept constructive criticism (which we do see, quite often) then it can really help. Lots of times the main issues are that the written portions are lacking in any pertinent info or the photos chosen suck. Changing both of those things goes a long way and I’ve had many SBs thank me for helping them garner much more attention from the “right” men! 😊",
            "author": "FoxyFreckles1989",
            "id": "giou0iu",
            "parent_id": "t1_giobi8m",
            "score": 3,
            "created_utc": 1610224079.0,
            "replies": [
                {
                    "body": "Can you please direct me to your profile review?",
                    "author": "new_sd_acct",
                    "id": "giq7cva",
                    "parent_id": "t1_giou0iu",
                    "score": 1,
                    "created_utc": 1610249559.0,
                    "replies": [
                        {
                            "body": "I think you might be confused. I’ve never felt the need to post my own profile review. I was referring to the many SBs I’ve given advice to (on and off SLF).",
                            "author": "FoxyFreckles1989",
                            "id": "giq7mwo",
                            "parent_id": "t1_giq7cva",
                            "score": 0,
                            "created_utc": 1610249703.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": ">Everyone is messaging hot women unless their profile is one big red flag.\n\nYet another genius who thinks they can speak for everyone.\n\nSpeak for yourself and people of your ilk. \n\nThe rest of us can speak for ourselves just fine, eh?",
            "author": "GDarn",
            "id": "gip96e8",
            "parent_id": "t1_giobi8m",
            "score": -2,
            "created_utc": 1610231492.0,
            "replies": [
                {
                    "body": "No SB wants to have sex with you",
                    "author": "new_sd_acct",
                    "id": "giq70nf",
                    "parent_id": "t1_gip96e8",
                    "score": -2,
                    "created_utc": 1610249375.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Oh I believe that - to some degree a fee may be fishing for an SD.  But I just find it funny when those same SDs tell them \"your pictures are NOT good\" or else \"your chances of find a straight SD are slim because you are (obese, unattractive, married, trans, looking for a SM, look absolutely insane in their pics, etc) - some leap right to being defensive?! I never understood that mentality - if you ask for a review, have the guts to take the feedback. Now I've seen some responses get belligerent, and those I can't cosign! Rude is rude. But those that are constructive...no prob.",
            "author": "letsjusthavefunnow",
            "id": "gioupwx",
            "parent_id": "t1_giou3tq",
            "score": 1,
            "created_utc": 1610224424.0,
            "replies": [
                {
                    "body": "See, I think some of those projections are that, projections, not criticisms. Criticism to presentation and technical criticisms on layout and i fo provided etc makes sense. But targeting body types and super subjective attractiveness is crossing a different line. However, assholes *are* unfortunately everywhere, especially where a lot of people DO only see the surface. Because you never know if you’ll catch the big one or a garbage fish, people requesting reviews should know they *will* get those assholes, whether they are fishing for SD’s or SM’s or what.",
                    "author": "unclewolfy",
                    "id": "giovawj",
                    "parent_id": "t1_gioupwx",
                    "score": 4,
                    "created_utc": 1610224697.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Spot on.  Ive had girls message me back months later.  Or message for weeks and not meet.  You've pointed out all the things I look for in a serious sb.  If thry don't meet with a week of messaging it's not happening.  Shes got you as plan b c of d or has no intention kf ever meeting",
            "author": "wb19081908",
            "id": "giq6wlb",
            "parent_id": "t1_gipaofl",
            "score": 1,
            "created_utc": 1610249313.0,
            "replies": []
        },
        {
            "body": "Which shows how awful the SD pool is on SA....transactional, cheap  and far below escort rates on average.\n\nSDs whining over a membership fee? Really",
            "author": "bookworm010101",
            "id": "gioeype",
            "parent_id": "t1_giobv1q",
            "score": 7,
            "created_utc": 1610216877.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "gioia2a",
                    "parent_id": "t1_gioeype",
                    "score": 3,
                    "created_utc": 1610218464.0,
                    "replies": [
                        {
                            "body": "We just have different viewpoints of what spoiling is.\n\nGood luck to you.",
                            "author": "bookworm010101",
                            "id": "giondt3",
                            "parent_id": "t1_gioia2a",
                            "score": 0,
                            "created_utc": 1610220858.0,
                            "replies": []
                        },
                        {
                            "body": "If sugaring wasn't cheaper than escorting then what would be the point? I expect a SB to be FAR cheaper",
                            "author": "Blade4Hoover",
                            "id": "giolkpl",
                            "parent_id": "t1_gioia2a",
                            "score": -3,
                            "created_utc": 1610220019.0,
                            "replies": [
                                {
                                    "body": "Pffft really? You spend more time, have more sex, talk more, and demand more why would you pay less?\n\nValidate me, text me, make me think I still have it, want me, for a few benjamins a meet please.\n\nThere is real sugar and splenda most of this current realm is splenda at best.",
                                    "author": "bookworm010101",
                                    "id": "gionkff",
                                    "parent_id": "t1_giolkpl",
                                    "score": 3,
                                    "created_utc": 1610220944.0,
                                    "replies": [
                                        {
                                            "body": "No, way LESS sex. And it's regular income for them",
                                            "author": "Blade4Hoover",
                                            "id": "gitm0c0",
                                            "parent_id": "t1_gionkff",
                                            "score": 1,
                                            "created_utc": 1610327128.0,
                                            "replies": [
                                                {
                                                    "body": "Regular income for \"them\" geesh you sound like one real SD.",
                                                    "author": "bookworm010101",
                                                    "id": "gitmhry",
                                                    "parent_id": "t1_gitm0c0",
                                                    "score": 1,
                                                    "created_utc": 1610327382.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "seriously? lol",
                                    "author": "fallingsd",
                                    "id": "gkszrgt",
                                    "parent_id": "t1_giolkpl",
                                    "score": 1,
                                    "created_utc": 1611649687.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Facts fr tho",
                    "author": "NihilisticBuddhism",
                    "id": "giohir3",
                    "parent_id": "t1_gioeype",
                    "score": -1,
                    "created_utc": 1610218110.0,
                    "replies": []
                },
                {
                    "body": ">SDs whining over a membership fee? Really\n\nThat's because the membership bring very little value to an SD these days. Lots of scammers and time wasters, so why I'm i paying this company again?\n\nIf SA had better filters and even a membership fee for SBs then I would gladly pay a lot more.\n\nBut SA is a mess right now, just not worth it.",
                    "author": "AdAlternative6041",
                    "id": "giun96t",
                    "parent_id": "t1_gioeype",
                    "score": 1,
                    "created_utc": 1610348208.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Thank you.  I formally withdraw my consent to be included in OP's \"we\".  \n\nSomeone with username \"let's just have fun now\" waahing about people wanting ego boosts on social media.  Okay.",
            "author": null,
            "id": "gip6zu0",
            "parent_id": "t1_gip1f4w",
            "score": 3,
            "created_utc": 1610230413.0,
            "replies": []
        },
        {
            "body": "Kinda like when someone says \"does this dress make me look fat.\"  The best response is to fake a heart attack.",
            "author": "hal99514",
            "id": "gipdvbv",
            "parent_id": "t1_gipb904",
            "score": 6,
            "created_utc": 1610233862.0,
            "replies": [
                {
                    "body": "🤣",
                    "author": "B1oodSugarSexMagik",
                    "id": "giq190b",
                    "parent_id": "t1_gipdvbv",
                    "score": 0,
                    "created_utc": 1610246178.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Reported. Cause you lost your damn mind...and have terrible grammar.",
            "author": "letsjusthavefunnow",
            "id": "gir1ob8",
            "parent_id": "t1_gir1lex",
            "score": 2,
            "created_utc": 1610272678.0,
            "replies": [
                {
                    "body": "i am sorry but my english isnt that good \nam from germany",
                    "author": "Koeniginpenelope",
                    "id": "gir1vmm",
                    "parent_id": "t1_gir1ob8",
                    "score": 0,
                    "created_utc": 1610272880.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Agreed. I’ve considered posting mine in order to help other SBs by giving an example of what a successful profile looks like, because I’ve never had an issue and often get compliments on my written portion. Instead, I give the same advice repeatedly on every profile review posted, because I don’t wanna seem like a “look at meee” girl. 😂\n\nEdit: I’ve received 8 or 9 DMs now from SBs asking to see my profile. I told the first one I’d send her screens after confirming she’s a SB and not a SD, but I don’t feel comfortable mass producing images of my SA profile. Please don’t message me asking for it! I’ll share it in a post myself if I ever feel comfortable doing so. I am more than willing to give tips and advice! Just not pics of my actual profile.",
            "author": "FoxyFreckles1989",
            "id": "giotpfz",
            "parent_id": "t1_gioci03",
            "score": 13,
            "created_utc": 1610223928.0,
            "replies": [
                {
                    "body": "Can you, please? I'm still at the researching phase. I have a lot of tips/notes for a writing profile saved but  theyre mostly of what not do. I know there's  a guide on how to make a profile great, I still think seeing a few good examples would help more.",
                    "author": "96butterrcup",
                    "id": "gip41t7",
                    "parent_id": "t1_giotpfz",
                    "score": 10,
                    "created_utc": 1610228941.0,
                    "replies": [
                        {
                            "body": "Honestly the profile is overrated. SD’s mainly care about your pictures, and if your profile shows you’re ok with meeting up and being intimate. Everything else is just fluff. \n\nYou could have one sentence about seeking a mutually beneficial arrangement with a genuine connection and attraction. And I would rather message that person over someone with an essay full of paragraphs that don’t really say what she’s looking for lol.\n\nIm an SD and I have 2 sentences in my profile and I still get tons of messages.",
                            "author": "Fun_Focus8159",
                            "id": "gip53va",
                            "parent_id": "t1_gip41t7",
                            "score": 11,
                            "created_utc": 1610229478.0,
                            "replies": [
                                {
                                    "body": "This is how you feel, not “most” SDs. I’m not interested in hearing from SDs that only care about my pictures (of which I have many) and can’t be bothered to spend a minute or two reading the several paragraphs I took the time to write, and that’s fine. I did write about what I’m interested in and have to offer and am fairly detailed. The men that appreciate this are apparent when they message me, which makes things easier for everyone involved.\n\nEdit: I agree that writing several paragraphs that somehow still don’t make it clear what you’re interested in/looking for/have to offer would be ridiculous. I’ve seen a few SD profiles go on and on and still actually say absolutely nothing about them. That’s annoying and futile. Lmao",
                                    "author": "FoxyFreckles1989",
                                    "id": "gipdo98",
                                    "parent_id": "t1_gip53va",
                                    "score": 6,
                                    "created_utc": 1610233763.0,
                                    "replies": [
                                        {
                                            "body": "You’re not a SD so how do you know what most\nSD feel or are looking for? It would be like me telling you what SB’s are looking for in an SD on their profile.",
                                            "author": "Fun_Focus8159",
                                            "id": "girsqgs",
                                            "parent_id": "t1_gipdo98",
                                            "score": 2,
                                            "created_utc": 1610294581.0,
                                            "replies": [
                                                {
                                                    "body": "I pay attention. I know that this single SD cannot speak for all SDs, and neither can I. I see what is written on SLF. I see what is written in SA.",
                                                    "author": "FoxyFreckles1989",
                                                    "id": "girukea",
                                                    "parent_id": "t1_girsqgs",
                                                    "score": 1,
                                                    "created_utc": 1610295576.0,
                                                    "replies": [
                                                        {
                                                            "body": "Yes that’s true I don’t represent every SD in the world. But I would bet most SD’s agree with me.",
                                                            "author": "Fun_Focus8159",
                                                            "id": "girw960",
                                                            "parent_id": "t1_girukea",
                                                            "score": 2,
                                                            "created_utc": 1610296480.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Your opinion is yours, and I won’t argue with it. I’m perfectly fine with the SDs whom prefer a SB that has a profile like mine and then messages me to tell me that. I don’t need every SD on SA, let alone on SLF, to agree with me. That would be ridiculous! Lol",
                                                                    "author": "FoxyFreckles1989",
                                                                    "id": "girwoxz",
                                                                    "parent_id": "t1_girw960",
                                                                    "score": 1,
                                                                    "created_utc": 1610296711.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "body": "I guess all the people that upvoted me disagree with you :)",
                                            "author": "Fun_Focus8159",
                                            "id": "giqve69",
                                            "parent_id": "t1_gipdo98",
                                            "score": -3,
                                            "created_utc": 1610266431.0,
                                            "replies": [
                                                {
                                                    "body": "Is this supposed to be...  joke? What a petty response. I also suppose all of the people that upvoted me disagree with you, but I’d never had said as much in an attempt to make a point.",
                                                    "author": "FoxyFreckles1989",
                                                    "id": "gir5hma",
                                                    "parent_id": "t1_giqve69",
                                                    "score": 4,
                                                    "created_utc": 1610276586.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "100 hundred percent. Spot on.  She could write war and peace but if i don't find her attractive im mot messaging.  I look at her ohotos then look to see if she wants platonic.  If she sounds really high maintenance I tend to avoid.  Most of the descriptions are fake anyway like what they are studying or whether they do drugs for example.",
                                    "author": "wb19081908",
                                    "id": "giq68kj",
                                    "parent_id": "t1_gip53va",
                                    "score": 3,
                                    "created_utc": 1610248942.0,
                                    "replies": [
                                        {
                                            "body": "So, if she sounds really high maintenance based on her written profile you avoid her? This is a prime example of the written profile being beneficial to you.",
                                            "author": "FoxyFreckles1989",
                                            "id": "gir5l1n",
                                            "parent_id": "t1_giq68kj",
                                            "score": 3,
                                            "created_utc": 1610276681.0,
                                            "replies": [
                                                {
                                                    "body": "Lol pedantic.  People can have their own views for me thr pbotos are the biggest part.  Even then loads are fske anyway.  Some girls never bother to update their descriptions leaving it n/a.  If she wants nsa and will meet then I'll message her idc",
                                                    "author": "wb19081908",
                                                    "id": "gir82of",
                                                    "parent_id": "t1_gir5l1n",
                                                    "score": 1,
                                                    "created_utc": 1610279201.0,
                                                    "replies": [
                                                        {
                                                            "body": "How do you know these things before talking to her, aside from what’s written on her profile? I’m not saying the written profile itself is more important than photos/tags, but both comments you’ve left have literally been examples of the written profile indicating whether or not you’d feel messaging a SB was worth it! Lol *pedantic.*",
                                                            "author": "FoxyFreckles1989",
                                                            "id": "gitf56t",
                                                            "parent_id": "t1_gir82of",
                                                            "score": 1,
                                                            "created_utc": 1610323737.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Just for me j hate spending ages messaging a girl.  After photos I look to see if she wants platonic.  Or if she sounds demanding.\n\nFrom my experience profiles dont mean much.  You have to meet and see if you connect in person.  If a girl can meet fairly soon after messaging on sa is good for me.\n\nSa In Australia has changed now anyway.  Its basically tinder for older guys to pay.  Genuine sd relationships sre rare.  Similarly loads of girls are happy for one offs or a double with a friend.  This wasn't.tje case when I  joined",
                                                                    "author": "wb19081908",
                                                                    "id": "giu7j4k",
                                                                    "parent_id": "t1_gitf56t",
                                                                    "score": 1,
                                                                    "created_utc": 1610337887.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "body": "This. I try and decode her long wordy essays to see if she’s just looking for platonic only. I love the really long wordy profiles and then at the very bottom it says 100% platonic only. Like Damn you could’ve just said that at the very beginning of your profile and saved me a lot of time lol.",
                                            "author": "Fun_Focus8159",
                                            "id": "girsfoz",
                                            "parent_id": "t1_giq68kj",
                                            "score": 2,
                                            "created_utc": 1610294415.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "I’ll consider it. I’m not sure I’m ready to lose the anonymity of this profile. Lmao. \n\nI’d be happy to send you screenshots of my profile and give you tips, privately.",
                            "author": "FoxyFreckles1989",
                            "id": "gipem7x",
                            "parent_id": "t1_gip41t7",
                            "score": 1,
                            "created_utc": 1610234246.0,
                            "replies": [
                                {
                                    "body": "Really? That be great, thankyou!",
                                    "author": "96butterrcup",
                                    "id": "gipntzv",
                                    "parent_id": "t1_gipem7x",
                                    "score": 1,
                                    "created_utc": 1610239064.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "Please ignore the many people here who claim to speak for everyone here, like OP and the SD advising you (incorrectly) that only pictures matter. \n\nDo you really want to be in a relationship with someone who only cares how you look like and whether you are down for sex? I wouldn't. \n\nHaving a profile that repels people like that is great. Saves you the trouble if blocking them later.\n\nProfile contents matter.\n\nProfile reviews help.\n\nBut they need to be tailored to what you are looking for,  and what kind of partner or relationship you are looking for.",
                            "author": "GDarn",
                            "id": "gip8ui9",
                            "parent_id": "t1_gip41t7",
                            "score": 0,
                            "created_utc": 1610231326.0,
                            "replies": [
                                {
                                    "body": "It’s not that profiles don’t matter, it’s that you learn more about a person through actual conversation and interaction with them than from a profile. Anyone can say they have qualities A, B, and C in their profile. It’s not until you talk to them that you really find out. \n\nI can tell more about a person from a first cut profile than I can from one that’s been overly refined and perfected.",
                                    "author": "midwesternguru",
                                    "id": "gipcbhf",
                                    "parent_id": "t1_gip8ui9",
                                    "score": 5,
                                    "created_utc": 1610233072.0,
                                    "replies": [
                                        {
                                            "body": "You don’t know what profiles are first-cuts and what profiles have been tweaked and “perfected” if you’re seeing them for the first time. Some people just aren’t great at writing about themselves and asking for advice isn’t a bad thing. I’ve been told by dozens of SBs that I’ve given profile advice to that they had more fruitful interactions, leading to dates, on SA after I helped them. I’m glad!",
                                            "author": "FoxyFreckles1989",
                                            "id": "gipdydu",
                                            "parent_id": "t1_gipcbhf",
                                            "score": 2,
                                            "created_utc": 1610233906.0,
                                            "replies": [
                                                {
                                                    "body": "For example, a frequent piece of advice here is to avoid negativity in a profile, which is good advice, I am very turned off by negativity. But if you are by nature a negative person, then it’s going to come out at some point, and I’d rather not message them in the first place.",
                                                    "author": "midwesternguru",
                                                    "id": "gipils8",
                                                    "parent_id": "t1_gipdydu",
                                                    "score": 1,
                                                    "created_utc": 1610236346.0,
                                                    "replies": [
                                                        {
                                                            "body": "I agree. Advice should never include purposely misrepresenting oneself. However, I think that more often advice against “negativity” is in regards to things like referring to your own body image and perceived self worth in a negative manner, or saying things like “don’t waste my time,” or, “I’m always getting scammed on here,” along with other negative phrases. Sometimes things we write come off negatively without that intention or our own knowledge. Advice against that is good.",
                                                            "author": "FoxyFreckles1989",
                                                            "id": "gitfnx2",
                                                            "parent_id": "t1_gipils8",
                                                            "score": 1,
                                                            "created_utc": 1610323993.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "body": "A profile is never enough, of course - you absolutely learn more from in person conversation.\n\nBut my experience is that if you set meet and greets with POT SBs with low effort profiles, you are going to be disappointed again and again.\n\nFor me, a well written, genuine, insightful profile tends to be highly correlated with a successful meet and greet. Low effort, platitude/catchphrase filled profiles, not so much.\n\nYour mileage may vary, of course.",
                                            "author": "GDarn",
                                            "id": "giraglc",
                                            "parent_id": "t1_gipcbhf",
                                            "score": 2,
                                            "created_utc": 1610281568.0,
                                            "replies": [
                                                {
                                                    "body": "This. I was hoping a SD would say something along these lines. No, I’m not a SD and I cannot speak for them. But in my experience (which includes mentoring dozens of first time SBs from the point of creating their profile to entering their first long term SR as well as over ten years of sugaring, myself) having a thoughtful profile that took more than minimal effort results in more legitimate options.",
                                                    "author": "FoxyFreckles1989",
                                                    "id": "gis4efi",
                                                    "parent_id": "t1_giraglc",
                                                    "score": 2,
                                                    "created_utc": 1610300523.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Yes!!! I totally agree! I'm still new here, so I haven't seen that.",
            "author": "LadyMorgan2018",
            "id": "giopsx8",
            "parent_id": "t1_gioolhz",
            "score": -1,
            "created_utc": 1610222036.0,
            "replies": []
        },
        {
            "body": "Can you please direct me to your profile review?",
            "author": "new_sd_acct",
            "id": "giq7cva",
            "parent_id": "t1_giou0iu",
            "score": 1,
            "created_utc": 1610249559.0,
            "replies": [
                {
                    "body": "I think you might be confused. I’ve never felt the need to post my own profile review. I was referring to the many SBs I’ve given advice to (on and off SLF).",
                    "author": "FoxyFreckles1989",
                    "id": "giq7mwo",
                    "parent_id": "t1_giq7cva",
                    "score": 0,
                    "created_utc": 1610249703.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "No SB wants to have sex with you",
            "author": "new_sd_acct",
            "id": "giq70nf",
            "parent_id": "t1_gip96e8",
            "score": -2,
            "created_utc": 1610249375.0,
            "replies": []
        },
        {
            "body": "See, I think some of those projections are that, projections, not criticisms. Criticism to presentation and technical criticisms on layout and i fo provided etc makes sense. But targeting body types and super subjective attractiveness is crossing a different line. However, assholes *are* unfortunately everywhere, especially where a lot of people DO only see the surface. Because you never know if you’ll catch the big one or a garbage fish, people requesting reviews should know they *will* get those assholes, whether they are fishing for SD’s or SM’s or what.",
            "author": "unclewolfy",
            "id": "giovawj",
            "parent_id": "t1_gioupwx",
            "score": 4,
            "created_utc": 1610224697.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gioia2a",
            "parent_id": "t1_gioeype",
            "score": 3,
            "created_utc": 1610218464.0,
            "replies": [
                {
                    "body": "We just have different viewpoints of what spoiling is.\n\nGood luck to you.",
                    "author": "bookworm010101",
                    "id": "giondt3",
                    "parent_id": "t1_gioia2a",
                    "score": 0,
                    "created_utc": 1610220858.0,
                    "replies": []
                },
                {
                    "body": "If sugaring wasn't cheaper than escorting then what would be the point? I expect a SB to be FAR cheaper",
                    "author": "Blade4Hoover",
                    "id": "giolkpl",
                    "parent_id": "t1_gioia2a",
                    "score": -3,
                    "created_utc": 1610220019.0,
                    "replies": [
                        {
                            "body": "Pffft really? You spend more time, have more sex, talk more, and demand more why would you pay less?\n\nValidate me, text me, make me think I still have it, want me, for a few benjamins a meet please.\n\nThere is real sugar and splenda most of this current realm is splenda at best.",
                            "author": "bookworm010101",
                            "id": "gionkff",
                            "parent_id": "t1_giolkpl",
                            "score": 3,
                            "created_utc": 1610220944.0,
                            "replies": [
                                {
                                    "body": "No, way LESS sex. And it's regular income for them",
                                    "author": "Blade4Hoover",
                                    "id": "gitm0c0",
                                    "parent_id": "t1_gionkff",
                                    "score": 1,
                                    "created_utc": 1610327128.0,
                                    "replies": [
                                        {
                                            "body": "Regular income for \"them\" geesh you sound like one real SD.",
                                            "author": "bookworm010101",
                                            "id": "gitmhry",
                                            "parent_id": "t1_gitm0c0",
                                            "score": 1,
                                            "created_utc": 1610327382.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "seriously? lol",
                            "author": "fallingsd",
                            "id": "gkszrgt",
                            "parent_id": "t1_giolkpl",
                            "score": 1,
                            "created_utc": 1611649687.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Facts fr tho",
            "author": "NihilisticBuddhism",
            "id": "giohir3",
            "parent_id": "t1_gioeype",
            "score": -1,
            "created_utc": 1610218110.0,
            "replies": []
        },
        {
            "body": ">SDs whining over a membership fee? Really\n\nThat's because the membership bring very little value to an SD these days. Lots of scammers and time wasters, so why I'm i paying this company again?\n\nIf SA had better filters and even a membership fee for SBs then I would gladly pay a lot more.\n\nBut SA is a mess right now, just not worth it.",
            "author": "AdAlternative6041",
            "id": "giun96t",
            "parent_id": "t1_gioeype",
            "score": 1,
            "created_utc": 1610348208.0,
            "replies": []
        },
        {
            "body": "🤣",
            "author": "B1oodSugarSexMagik",
            "id": "giq190b",
            "parent_id": "t1_gipdvbv",
            "score": 0,
            "created_utc": 1610246178.0,
            "replies": []
        },
        {
            "body": "i am sorry but my english isnt that good \nam from germany",
            "author": "Koeniginpenelope",
            "id": "gir1vmm",
            "parent_id": "t1_gir1ob8",
            "score": 0,
            "created_utc": 1610272880.0,
            "replies": []
        },
        {
            "body": "Can you, please? I'm still at the researching phase. I have a lot of tips/notes for a writing profile saved but  theyre mostly of what not do. I know there's  a guide on how to make a profile great, I still think seeing a few good examples would help more.",
            "author": "96butterrcup",
            "id": "gip41t7",
            "parent_id": "t1_giotpfz",
            "score": 10,
            "created_utc": 1610228941.0,
            "replies": [
                {
                    "body": "Honestly the profile is overrated. SD’s mainly care about your pictures, and if your profile shows you’re ok with meeting up and being intimate. Everything else is just fluff. \n\nYou could have one sentence about seeking a mutually beneficial arrangement with a genuine connection and attraction. And I would rather message that person over someone with an essay full of paragraphs that don’t really say what she’s looking for lol.\n\nIm an SD and I have 2 sentences in my profile and I still get tons of messages.",
                    "author": "Fun_Focus8159",
                    "id": "gip53va",
                    "parent_id": "t1_gip41t7",
                    "score": 11,
                    "created_utc": 1610229478.0,
                    "replies": [
                        {
                            "body": "This is how you feel, not “most” SDs. I’m not interested in hearing from SDs that only care about my pictures (of which I have many) and can’t be bothered to spend a minute or two reading the several paragraphs I took the time to write, and that’s fine. I did write about what I’m interested in and have to offer and am fairly detailed. The men that appreciate this are apparent when they message me, which makes things easier for everyone involved.\n\nEdit: I agree that writing several paragraphs that somehow still don’t make it clear what you’re interested in/looking for/have to offer would be ridiculous. I’ve seen a few SD profiles go on and on and still actually say absolutely nothing about them. That’s annoying and futile. Lmao",
                            "author": "FoxyFreckles1989",
                            "id": "gipdo98",
                            "parent_id": "t1_gip53va",
                            "score": 6,
                            "created_utc": 1610233763.0,
                            "replies": [
                                {
                                    "body": "You’re not a SD so how do you know what most\nSD feel or are looking for? It would be like me telling you what SB’s are looking for in an SD on their profile.",
                                    "author": "Fun_Focus8159",
                                    "id": "girsqgs",
                                    "parent_id": "t1_gipdo98",
                                    "score": 2,
                                    "created_utc": 1610294581.0,
                                    "replies": [
                                        {
                                            "body": "I pay attention. I know that this single SD cannot speak for all SDs, and neither can I. I see what is written on SLF. I see what is written in SA.",
                                            "author": "FoxyFreckles1989",
                                            "id": "girukea",
                                            "parent_id": "t1_girsqgs",
                                            "score": 1,
                                            "created_utc": 1610295576.0,
                                            "replies": [
                                                {
                                                    "body": "Yes that’s true I don’t represent every SD in the world. But I would bet most SD’s agree with me.",
                                                    "author": "Fun_Focus8159",
                                                    "id": "girw960",
                                                    "parent_id": "t1_girukea",
                                                    "score": 2,
                                                    "created_utc": 1610296480.0,
                                                    "replies": [
                                                        {
                                                            "body": "Your opinion is yours, and I won’t argue with it. I’m perfectly fine with the SDs whom prefer a SB that has a profile like mine and then messages me to tell me that. I don’t need every SD on SA, let alone on SLF, to agree with me. That would be ridiculous! Lol",
                                                            "author": "FoxyFreckles1989",
                                                            "id": "girwoxz",
                                                            "parent_id": "t1_girw960",
                                                            "score": 1,
                                                            "created_utc": 1610296711.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "I guess all the people that upvoted me disagree with you :)",
                                    "author": "Fun_Focus8159",
                                    "id": "giqve69",
                                    "parent_id": "t1_gipdo98",
                                    "score": -3,
                                    "created_utc": 1610266431.0,
                                    "replies": [
                                        {
                                            "body": "Is this supposed to be...  joke? What a petty response. I also suppose all of the people that upvoted me disagree with you, but I’d never had said as much in an attempt to make a point.",
                                            "author": "FoxyFreckles1989",
                                            "id": "gir5hma",
                                            "parent_id": "t1_giqve69",
                                            "score": 4,
                                            "created_utc": 1610276586.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "100 hundred percent. Spot on.  She could write war and peace but if i don't find her attractive im mot messaging.  I look at her ohotos then look to see if she wants platonic.  If she sounds really high maintenance I tend to avoid.  Most of the descriptions are fake anyway like what they are studying or whether they do drugs for example.",
                            "author": "wb19081908",
                            "id": "giq68kj",
                            "parent_id": "t1_gip53va",
                            "score": 3,
                            "created_utc": 1610248942.0,
                            "replies": [
                                {
                                    "body": "So, if she sounds really high maintenance based on her written profile you avoid her? This is a prime example of the written profile being beneficial to you.",
                                    "author": "FoxyFreckles1989",
                                    "id": "gir5l1n",
                                    "parent_id": "t1_giq68kj",
                                    "score": 3,
                                    "created_utc": 1610276681.0,
                                    "replies": [
                                        {
                                            "body": "Lol pedantic.  People can have their own views for me thr pbotos are the biggest part.  Even then loads are fske anyway.  Some girls never bother to update their descriptions leaving it n/a.  If she wants nsa and will meet then I'll message her idc",
                                            "author": "wb19081908",
                                            "id": "gir82of",
                                            "parent_id": "t1_gir5l1n",
                                            "score": 1,
                                            "created_utc": 1610279201.0,
                                            "replies": [
                                                {
                                                    "body": "How do you know these things before talking to her, aside from what’s written on her profile? I’m not saying the written profile itself is more important than photos/tags, but both comments you’ve left have literally been examples of the written profile indicating whether or not you’d feel messaging a SB was worth it! Lol *pedantic.*",
                                                    "author": "FoxyFreckles1989",
                                                    "id": "gitf56t",
                                                    "parent_id": "t1_gir82of",
                                                    "score": 1,
                                                    "created_utc": 1610323737.0,
                                                    "replies": [
                                                        {
                                                            "body": "Just for me j hate spending ages messaging a girl.  After photos I look to see if she wants platonic.  Or if she sounds demanding.\n\nFrom my experience profiles dont mean much.  You have to meet and see if you connect in person.  If a girl can meet fairly soon after messaging on sa is good for me.\n\nSa In Australia has changed now anyway.  Its basically tinder for older guys to pay.  Genuine sd relationships sre rare.  Similarly loads of girls are happy for one offs or a double with a friend.  This wasn't.tje case when I  joined",
                                                            "author": "wb19081908",
                                                            "id": "giu7j4k",
                                                            "parent_id": "t1_gitf56t",
                                                            "score": 1,
                                                            "created_utc": 1610337887.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "This. I try and decode her long wordy essays to see if she’s just looking for platonic only. I love the really long wordy profiles and then at the very bottom it says 100% platonic only. Like Damn you could’ve just said that at the very beginning of your profile and saved me a lot of time lol.",
                                    "author": "Fun_Focus8159",
                                    "id": "girsfoz",
                                    "parent_id": "t1_giq68kj",
                                    "score": 2,
                                    "created_utc": 1610294415.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "I’ll consider it. I’m not sure I’m ready to lose the anonymity of this profile. Lmao. \n\nI’d be happy to send you screenshots of my profile and give you tips, privately.",
                    "author": "FoxyFreckles1989",
                    "id": "gipem7x",
                    "parent_id": "t1_gip41t7",
                    "score": 1,
                    "created_utc": 1610234246.0,
                    "replies": [
                        {
                            "body": "Really? That be great, thankyou!",
                            "author": "96butterrcup",
                            "id": "gipntzv",
                            "parent_id": "t1_gipem7x",
                            "score": 1,
                            "created_utc": 1610239064.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Please ignore the many people here who claim to speak for everyone here, like OP and the SD advising you (incorrectly) that only pictures matter. \n\nDo you really want to be in a relationship with someone who only cares how you look like and whether you are down for sex? I wouldn't. \n\nHaving a profile that repels people like that is great. Saves you the trouble if blocking them later.\n\nProfile contents matter.\n\nProfile reviews help.\n\nBut they need to be tailored to what you are looking for,  and what kind of partner or relationship you are looking for.",
                    "author": "GDarn",
                    "id": "gip8ui9",
                    "parent_id": "t1_gip41t7",
                    "score": 0,
                    "created_utc": 1610231326.0,
                    "replies": [
                        {
                            "body": "It’s not that profiles don’t matter, it’s that you learn more about a person through actual conversation and interaction with them than from a profile. Anyone can say they have qualities A, B, and C in their profile. It’s not until you talk to them that you really find out. \n\nI can tell more about a person from a first cut profile than I can from one that’s been overly refined and perfected.",
                            "author": "midwesternguru",
                            "id": "gipcbhf",
                            "parent_id": "t1_gip8ui9",
                            "score": 5,
                            "created_utc": 1610233072.0,
                            "replies": [
                                {
                                    "body": "You don’t know what profiles are first-cuts and what profiles have been tweaked and “perfected” if you’re seeing them for the first time. Some people just aren’t great at writing about themselves and asking for advice isn’t a bad thing. I’ve been told by dozens of SBs that I’ve given profile advice to that they had more fruitful interactions, leading to dates, on SA after I helped them. I’m glad!",
                                    "author": "FoxyFreckles1989",
                                    "id": "gipdydu",
                                    "parent_id": "t1_gipcbhf",
                                    "score": 2,
                                    "created_utc": 1610233906.0,
                                    "replies": [
                                        {
                                            "body": "For example, a frequent piece of advice here is to avoid negativity in a profile, which is good advice, I am very turned off by negativity. But if you are by nature a negative person, then it’s going to come out at some point, and I’d rather not message them in the first place.",
                                            "author": "midwesternguru",
                                            "id": "gipils8",
                                            "parent_id": "t1_gipdydu",
                                            "score": 1,
                                            "created_utc": 1610236346.0,
                                            "replies": [
                                                {
                                                    "body": "I agree. Advice should never include purposely misrepresenting oneself. However, I think that more often advice against “negativity” is in regards to things like referring to your own body image and perceived self worth in a negative manner, or saying things like “don’t waste my time,” or, “I’m always getting scammed on here,” along with other negative phrases. Sometimes things we write come off negatively without that intention or our own knowledge. Advice against that is good.",
                                                    "author": "FoxyFreckles1989",
                                                    "id": "gitfnx2",
                                                    "parent_id": "t1_gipils8",
                                                    "score": 1,
                                                    "created_utc": 1610323993.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "A profile is never enough, of course - you absolutely learn more from in person conversation.\n\nBut my experience is that if you set meet and greets with POT SBs with low effort profiles, you are going to be disappointed again and again.\n\nFor me, a well written, genuine, insightful profile tends to be highly correlated with a successful meet and greet. Low effort, platitude/catchphrase filled profiles, not so much.\n\nYour mileage may vary, of course.",
                                    "author": "GDarn",
                                    "id": "giraglc",
                                    "parent_id": "t1_gipcbhf",
                                    "score": 2,
                                    "created_utc": 1610281568.0,
                                    "replies": [
                                        {
                                            "body": "This. I was hoping a SD would say something along these lines. No, I’m not a SD and I cannot speak for them. But in my experience (which includes mentoring dozens of first time SBs from the point of creating their profile to entering their first long term SR as well as over ten years of sugaring, myself) having a thoughtful profile that took more than minimal effort results in more legitimate options.",
                                            "author": "FoxyFreckles1989",
                                            "id": "gis4efi",
                                            "parent_id": "t1_giraglc",
                                            "score": 2,
                                            "created_utc": 1610300523.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I think you might be confused. I’ve never felt the need to post my own profile review. I was referring to the many SBs I’ve given advice to (on and off SLF).",
            "author": "FoxyFreckles1989",
            "id": "giq7mwo",
            "parent_id": "t1_giq7cva",
            "score": 0,
            "created_utc": 1610249703.0,
            "replies": []
        },
        {
            "body": "We just have different viewpoints of what spoiling is.\n\nGood luck to you.",
            "author": "bookworm010101",
            "id": "giondt3",
            "parent_id": "t1_gioia2a",
            "score": 0,
            "created_utc": 1610220858.0,
            "replies": []
        },
        {
            "body": "If sugaring wasn't cheaper than escorting then what would be the point? I expect a SB to be FAR cheaper",
            "author": "Blade4Hoover",
            "id": "giolkpl",
            "parent_id": "t1_gioia2a",
            "score": -3,
            "created_utc": 1610220019.0,
            "replies": [
                {
                    "body": "Pffft really? You spend more time, have more sex, talk more, and demand more why would you pay less?\n\nValidate me, text me, make me think I still have it, want me, for a few benjamins a meet please.\n\nThere is real sugar and splenda most of this current realm is splenda at best.",
                    "author": "bookworm010101",
                    "id": "gionkff",
                    "parent_id": "t1_giolkpl",
                    "score": 3,
                    "created_utc": 1610220944.0,
                    "replies": [
                        {
                            "body": "No, way LESS sex. And it's regular income for them",
                            "author": "Blade4Hoover",
                            "id": "gitm0c0",
                            "parent_id": "t1_gionkff",
                            "score": 1,
                            "created_utc": 1610327128.0,
                            "replies": [
                                {
                                    "body": "Regular income for \"them\" geesh you sound like one real SD.",
                                    "author": "bookworm010101",
                                    "id": "gitmhry",
                                    "parent_id": "t1_gitm0c0",
                                    "score": 1,
                                    "created_utc": 1610327382.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "seriously? lol",
                    "author": "fallingsd",
                    "id": "gkszrgt",
                    "parent_id": "t1_giolkpl",
                    "score": 1,
                    "created_utc": 1611649687.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Honestly the profile is overrated. SD’s mainly care about your pictures, and if your profile shows you’re ok with meeting up and being intimate. Everything else is just fluff. \n\nYou could have one sentence about seeking a mutually beneficial arrangement with a genuine connection and attraction. And I would rather message that person over someone with an essay full of paragraphs that don’t really say what she’s looking for lol.\n\nIm an SD and I have 2 sentences in my profile and I still get tons of messages.",
            "author": "Fun_Focus8159",
            "id": "gip53va",
            "parent_id": "t1_gip41t7",
            "score": 11,
            "created_utc": 1610229478.0,
            "replies": [
                {
                    "body": "This is how you feel, not “most” SDs. I’m not interested in hearing from SDs that only care about my pictures (of which I have many) and can’t be bothered to spend a minute or two reading the several paragraphs I took the time to write, and that’s fine. I did write about what I’m interested in and have to offer and am fairly detailed. The men that appreciate this are apparent when they message me, which makes things easier for everyone involved.\n\nEdit: I agree that writing several paragraphs that somehow still don’t make it clear what you’re interested in/looking for/have to offer would be ridiculous. I’ve seen a few SD profiles go on and on and still actually say absolutely nothing about them. That’s annoying and futile. Lmao",
                    "author": "FoxyFreckles1989",
                    "id": "gipdo98",
                    "parent_id": "t1_gip53va",
                    "score": 6,
                    "created_utc": 1610233763.0,
                    "replies": [
                        {
                            "body": "You’re not a SD so how do you know what most\nSD feel or are looking for? It would be like me telling you what SB’s are looking for in an SD on their profile.",
                            "author": "Fun_Focus8159",
                            "id": "girsqgs",
                            "parent_id": "t1_gipdo98",
                            "score": 2,
                            "created_utc": 1610294581.0,
                            "replies": [
                                {
                                    "body": "I pay attention. I know that this single SD cannot speak for all SDs, and neither can I. I see what is written on SLF. I see what is written in SA.",
                                    "author": "FoxyFreckles1989",
                                    "id": "girukea",
                                    "parent_id": "t1_girsqgs",
                                    "score": 1,
                                    "created_utc": 1610295576.0,
                                    "replies": [
                                        {
                                            "body": "Yes that’s true I don’t represent every SD in the world. But I would bet most SD’s agree with me.",
                                            "author": "Fun_Focus8159",
                                            "id": "girw960",
                                            "parent_id": "t1_girukea",
                                            "score": 2,
                                            "created_utc": 1610296480.0,
                                            "replies": [
                                                {
                                                    "body": "Your opinion is yours, and I won’t argue with it. I’m perfectly fine with the SDs whom prefer a SB that has a profile like mine and then messages me to tell me that. I don’t need every SD on SA, let alone on SLF, to agree with me. That would be ridiculous! Lol",
                                                    "author": "FoxyFreckles1989",
                                                    "id": "girwoxz",
                                                    "parent_id": "t1_girw960",
                                                    "score": 1,
                                                    "created_utc": 1610296711.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "I guess all the people that upvoted me disagree with you :)",
                            "author": "Fun_Focus8159",
                            "id": "giqve69",
                            "parent_id": "t1_gipdo98",
                            "score": -3,
                            "created_utc": 1610266431.0,
                            "replies": [
                                {
                                    "body": "Is this supposed to be...  joke? What a petty response. I also suppose all of the people that upvoted me disagree with you, but I’d never had said as much in an attempt to make a point.",
                                    "author": "FoxyFreckles1989",
                                    "id": "gir5hma",
                                    "parent_id": "t1_giqve69",
                                    "score": 4,
                                    "created_utc": 1610276586.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "100 hundred percent. Spot on.  She could write war and peace but if i don't find her attractive im mot messaging.  I look at her ohotos then look to see if she wants platonic.  If she sounds really high maintenance I tend to avoid.  Most of the descriptions are fake anyway like what they are studying or whether they do drugs for example.",
                    "author": "wb19081908",
                    "id": "giq68kj",
                    "parent_id": "t1_gip53va",
                    "score": 3,
                    "created_utc": 1610248942.0,
                    "replies": [
                        {
                            "body": "So, if she sounds really high maintenance based on her written profile you avoid her? This is a prime example of the written profile being beneficial to you.",
                            "author": "FoxyFreckles1989",
                            "id": "gir5l1n",
                            "parent_id": "t1_giq68kj",
                            "score": 3,
                            "created_utc": 1610276681.0,
                            "replies": [
                                {
                                    "body": "Lol pedantic.  People can have their own views for me thr pbotos are the biggest part.  Even then loads are fske anyway.  Some girls never bother to update their descriptions leaving it n/a.  If she wants nsa and will meet then I'll message her idc",
                                    "author": "wb19081908",
                                    "id": "gir82of",
                                    "parent_id": "t1_gir5l1n",
                                    "score": 1,
                                    "created_utc": 1610279201.0,
                                    "replies": [
                                        {
                                            "body": "How do you know these things before talking to her, aside from what’s written on her profile? I’m not saying the written profile itself is more important than photos/tags, but both comments you’ve left have literally been examples of the written profile indicating whether or not you’d feel messaging a SB was worth it! Lol *pedantic.*",
                                            "author": "FoxyFreckles1989",
                                            "id": "gitf56t",
                                            "parent_id": "t1_gir82of",
                                            "score": 1,
                                            "created_utc": 1610323737.0,
                                            "replies": [
                                                {
                                                    "body": "Just for me j hate spending ages messaging a girl.  After photos I look to see if she wants platonic.  Or if she sounds demanding.\n\nFrom my experience profiles dont mean much.  You have to meet and see if you connect in person.  If a girl can meet fairly soon after messaging on sa is good for me.\n\nSa In Australia has changed now anyway.  Its basically tinder for older guys to pay.  Genuine sd relationships sre rare.  Similarly loads of girls are happy for one offs or a double with a friend.  This wasn't.tje case when I  joined",
                                                    "author": "wb19081908",
                                                    "id": "giu7j4k",
                                                    "parent_id": "t1_gitf56t",
                                                    "score": 1,
                                                    "created_utc": 1610337887.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "This. I try and decode her long wordy essays to see if she’s just looking for platonic only. I love the really long wordy profiles and then at the very bottom it says 100% platonic only. Like Damn you could’ve just said that at the very beginning of your profile and saved me a lot of time lol.",
                            "author": "Fun_Focus8159",
                            "id": "girsfoz",
                            "parent_id": "t1_giq68kj",
                            "score": 2,
                            "created_utc": 1610294415.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I’ll consider it. I’m not sure I’m ready to lose the anonymity of this profile. Lmao. \n\nI’d be happy to send you screenshots of my profile and give you tips, privately.",
            "author": "FoxyFreckles1989",
            "id": "gipem7x",
            "parent_id": "t1_gip41t7",
            "score": 1,
            "created_utc": 1610234246.0,
            "replies": [
                {
                    "body": "Really? That be great, thankyou!",
                    "author": "96butterrcup",
                    "id": "gipntzv",
                    "parent_id": "t1_gipem7x",
                    "score": 1,
                    "created_utc": 1610239064.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Please ignore the many people here who claim to speak for everyone here, like OP and the SD advising you (incorrectly) that only pictures matter. \n\nDo you really want to be in a relationship with someone who only cares how you look like and whether you are down for sex? I wouldn't. \n\nHaving a profile that repels people like that is great. Saves you the trouble if blocking them later.\n\nProfile contents matter.\n\nProfile reviews help.\n\nBut they need to be tailored to what you are looking for,  and what kind of partner or relationship you are looking for.",
            "author": "GDarn",
            "id": "gip8ui9",
            "parent_id": "t1_gip41t7",
            "score": 0,
            "created_utc": 1610231326.0,
            "replies": [
                {
                    "body": "It’s not that profiles don’t matter, it’s that you learn more about a person through actual conversation and interaction with them than from a profile. Anyone can say they have qualities A, B, and C in their profile. It’s not until you talk to them that you really find out. \n\nI can tell more about a person from a first cut profile than I can from one that’s been overly refined and perfected.",
                    "author": "midwesternguru",
                    "id": "gipcbhf",
                    "parent_id": "t1_gip8ui9",
                    "score": 5,
                    "created_utc": 1610233072.0,
                    "replies": [
                        {
                            "body": "You don’t know what profiles are first-cuts and what profiles have been tweaked and “perfected” if you’re seeing them for the first time. Some people just aren’t great at writing about themselves and asking for advice isn’t a bad thing. I’ve been told by dozens of SBs that I’ve given profile advice to that they had more fruitful interactions, leading to dates, on SA after I helped them. I’m glad!",
                            "author": "FoxyFreckles1989",
                            "id": "gipdydu",
                            "parent_id": "t1_gipcbhf",
                            "score": 2,
                            "created_utc": 1610233906.0,
                            "replies": [
                                {
                                    "body": "For example, a frequent piece of advice here is to avoid negativity in a profile, which is good advice, I am very turned off by negativity. But if you are by nature a negative person, then it’s going to come out at some point, and I’d rather not message them in the first place.",
                                    "author": "midwesternguru",
                                    "id": "gipils8",
                                    "parent_id": "t1_gipdydu",
                                    "score": 1,
                                    "created_utc": 1610236346.0,
                                    "replies": [
                                        {
                                            "body": "I agree. Advice should never include purposely misrepresenting oneself. However, I think that more often advice against “negativity” is in regards to things like referring to your own body image and perceived self worth in a negative manner, or saying things like “don’t waste my time,” or, “I’m always getting scammed on here,” along with other negative phrases. Sometimes things we write come off negatively without that intention or our own knowledge. Advice against that is good.",
                                            "author": "FoxyFreckles1989",
                                            "id": "gitfnx2",
                                            "parent_id": "t1_gipils8",
                                            "score": 1,
                                            "created_utc": 1610323993.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "A profile is never enough, of course - you absolutely learn more from in person conversation.\n\nBut my experience is that if you set meet and greets with POT SBs with low effort profiles, you are going to be disappointed again and again.\n\nFor me, a well written, genuine, insightful profile tends to be highly correlated with a successful meet and greet. Low effort, platitude/catchphrase filled profiles, not so much.\n\nYour mileage may vary, of course.",
                            "author": "GDarn",
                            "id": "giraglc",
                            "parent_id": "t1_gipcbhf",
                            "score": 2,
                            "created_utc": 1610281568.0,
                            "replies": [
                                {
                                    "body": "This. I was hoping a SD would say something along these lines. No, I’m not a SD and I cannot speak for them. But in my experience (which includes mentoring dozens of first time SBs from the point of creating their profile to entering their first long term SR as well as over ten years of sugaring, myself) having a thoughtful profile that took more than minimal effort results in more legitimate options.",
                                    "author": "FoxyFreckles1989",
                                    "id": "gis4efi",
                                    "parent_id": "t1_giraglc",
                                    "score": 2,
                                    "created_utc": 1610300523.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Pffft really? You spend more time, have more sex, talk more, and demand more why would you pay less?\n\nValidate me, text me, make me think I still have it, want me, for a few benjamins a meet please.\n\nThere is real sugar and splenda most of this current realm is splenda at best.",
            "author": "bookworm010101",
            "id": "gionkff",
            "parent_id": "t1_giolkpl",
            "score": 3,
            "created_utc": 1610220944.0,
            "replies": [
                {
                    "body": "No, way LESS sex. And it's regular income for them",
                    "author": "Blade4Hoover",
                    "id": "gitm0c0",
                    "parent_id": "t1_gionkff",
                    "score": 1,
                    "created_utc": 1610327128.0,
                    "replies": [
                        {
                            "body": "Regular income for \"them\" geesh you sound like one real SD.",
                            "author": "bookworm010101",
                            "id": "gitmhry",
                            "parent_id": "t1_gitm0c0",
                            "score": 1,
                            "created_utc": 1610327382.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "seriously? lol",
            "author": "fallingsd",
            "id": "gkszrgt",
            "parent_id": "t1_giolkpl",
            "score": 1,
            "created_utc": 1611649687.0,
            "replies": []
        },
        {
            "body": "This is how you feel, not “most” SDs. I’m not interested in hearing from SDs that only care about my pictures (of which I have many) and can’t be bothered to spend a minute or two reading the several paragraphs I took the time to write, and that’s fine. I did write about what I’m interested in and have to offer and am fairly detailed. The men that appreciate this are apparent when they message me, which makes things easier for everyone involved.\n\nEdit: I agree that writing several paragraphs that somehow still don’t make it clear what you’re interested in/looking for/have to offer would be ridiculous. I’ve seen a few SD profiles go on and on and still actually say absolutely nothing about them. That’s annoying and futile. Lmao",
            "author": "FoxyFreckles1989",
            "id": "gipdo98",
            "parent_id": "t1_gip53va",
            "score": 6,
            "created_utc": 1610233763.0,
            "replies": [
                {
                    "body": "You’re not a SD so how do you know what most\nSD feel or are looking for? It would be like me telling you what SB’s are looking for in an SD on their profile.",
                    "author": "Fun_Focus8159",
                    "id": "girsqgs",
                    "parent_id": "t1_gipdo98",
                    "score": 2,
                    "created_utc": 1610294581.0,
                    "replies": [
                        {
                            "body": "I pay attention. I know that this single SD cannot speak for all SDs, and neither can I. I see what is written on SLF. I see what is written in SA.",
                            "author": "FoxyFreckles1989",
                            "id": "girukea",
                            "parent_id": "t1_girsqgs",
                            "score": 1,
                            "created_utc": 1610295576.0,
                            "replies": [
                                {
                                    "body": "Yes that’s true I don’t represent every SD in the world. But I would bet most SD’s agree with me.",
                                    "author": "Fun_Focus8159",
                                    "id": "girw960",
                                    "parent_id": "t1_girukea",
                                    "score": 2,
                                    "created_utc": 1610296480.0,
                                    "replies": [
                                        {
                                            "body": "Your opinion is yours, and I won’t argue with it. I’m perfectly fine with the SDs whom prefer a SB that has a profile like mine and then messages me to tell me that. I don’t need every SD on SA, let alone on SLF, to agree with me. That would be ridiculous! Lol",
                                            "author": "FoxyFreckles1989",
                                            "id": "girwoxz",
                                            "parent_id": "t1_girw960",
                                            "score": 1,
                                            "created_utc": 1610296711.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "I guess all the people that upvoted me disagree with you :)",
                    "author": "Fun_Focus8159",
                    "id": "giqve69",
                    "parent_id": "t1_gipdo98",
                    "score": -3,
                    "created_utc": 1610266431.0,
                    "replies": [
                        {
                            "body": "Is this supposed to be...  joke? What a petty response. I also suppose all of the people that upvoted me disagree with you, but I’d never had said as much in an attempt to make a point.",
                            "author": "FoxyFreckles1989",
                            "id": "gir5hma",
                            "parent_id": "t1_giqve69",
                            "score": 4,
                            "created_utc": 1610276586.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "100 hundred percent. Spot on.  She could write war and peace but if i don't find her attractive im mot messaging.  I look at her ohotos then look to see if she wants platonic.  If she sounds really high maintenance I tend to avoid.  Most of the descriptions are fake anyway like what they are studying or whether they do drugs for example.",
            "author": "wb19081908",
            "id": "giq68kj",
            "parent_id": "t1_gip53va",
            "score": 3,
            "created_utc": 1610248942.0,
            "replies": [
                {
                    "body": "So, if she sounds really high maintenance based on her written profile you avoid her? This is a prime example of the written profile being beneficial to you.",
                    "author": "FoxyFreckles1989",
                    "id": "gir5l1n",
                    "parent_id": "t1_giq68kj",
                    "score": 3,
                    "created_utc": 1610276681.0,
                    "replies": [
                        {
                            "body": "Lol pedantic.  People can have their own views for me thr pbotos are the biggest part.  Even then loads are fske anyway.  Some girls never bother to update their descriptions leaving it n/a.  If she wants nsa and will meet then I'll message her idc",
                            "author": "wb19081908",
                            "id": "gir82of",
                            "parent_id": "t1_gir5l1n",
                            "score": 1,
                            "created_utc": 1610279201.0,
                            "replies": [
                                {
                                    "body": "How do you know these things before talking to her, aside from what’s written on her profile? I’m not saying the written profile itself is more important than photos/tags, but both comments you’ve left have literally been examples of the written profile indicating whether or not you’d feel messaging a SB was worth it! Lol *pedantic.*",
                                    "author": "FoxyFreckles1989",
                                    "id": "gitf56t",
                                    "parent_id": "t1_gir82of",
                                    "score": 1,
                                    "created_utc": 1610323737.0,
                                    "replies": [
                                        {
                                            "body": "Just for me j hate spending ages messaging a girl.  After photos I look to see if she wants platonic.  Or if she sounds demanding.\n\nFrom my experience profiles dont mean much.  You have to meet and see if you connect in person.  If a girl can meet fairly soon after messaging on sa is good for me.\n\nSa In Australia has changed now anyway.  Its basically tinder for older guys to pay.  Genuine sd relationships sre rare.  Similarly loads of girls are happy for one offs or a double with a friend.  This wasn't.tje case when I  joined",
                                            "author": "wb19081908",
                                            "id": "giu7j4k",
                                            "parent_id": "t1_gitf56t",
                                            "score": 1,
                                            "created_utc": 1610337887.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "This. I try and decode her long wordy essays to see if she’s just looking for platonic only. I love the really long wordy profiles and then at the very bottom it says 100% platonic only. Like Damn you could’ve just said that at the very beginning of your profile and saved me a lot of time lol.",
                    "author": "Fun_Focus8159",
                    "id": "girsfoz",
                    "parent_id": "t1_giq68kj",
                    "score": 2,
                    "created_utc": 1610294415.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Really? That be great, thankyou!",
            "author": "96butterrcup",
            "id": "gipntzv",
            "parent_id": "t1_gipem7x",
            "score": 1,
            "created_utc": 1610239064.0,
            "replies": []
        },
        {
            "body": "It’s not that profiles don’t matter, it’s that you learn more about a person through actual conversation and interaction with them than from a profile. Anyone can say they have qualities A, B, and C in their profile. It’s not until you talk to them that you really find out. \n\nI can tell more about a person from a first cut profile than I can from one that’s been overly refined and perfected.",
            "author": "midwesternguru",
            "id": "gipcbhf",
            "parent_id": "t1_gip8ui9",
            "score": 5,
            "created_utc": 1610233072.0,
            "replies": [
                {
                    "body": "You don’t know what profiles are first-cuts and what profiles have been tweaked and “perfected” if you’re seeing them for the first time. Some people just aren’t great at writing about themselves and asking for advice isn’t a bad thing. I’ve been told by dozens of SBs that I’ve given profile advice to that they had more fruitful interactions, leading to dates, on SA after I helped them. I’m glad!",
                    "author": "FoxyFreckles1989",
                    "id": "gipdydu",
                    "parent_id": "t1_gipcbhf",
                    "score": 2,
                    "created_utc": 1610233906.0,
                    "replies": [
                        {
                            "body": "For example, a frequent piece of advice here is to avoid negativity in a profile, which is good advice, I am very turned off by negativity. But if you are by nature a negative person, then it’s going to come out at some point, and I’d rather not message them in the first place.",
                            "author": "midwesternguru",
                            "id": "gipils8",
                            "parent_id": "t1_gipdydu",
                            "score": 1,
                            "created_utc": 1610236346.0,
                            "replies": [
                                {
                                    "body": "I agree. Advice should never include purposely misrepresenting oneself. However, I think that more often advice against “negativity” is in regards to things like referring to your own body image and perceived self worth in a negative manner, or saying things like “don’t waste my time,” or, “I’m always getting scammed on here,” along with other negative phrases. Sometimes things we write come off negatively without that intention or our own knowledge. Advice against that is good.",
                                    "author": "FoxyFreckles1989",
                                    "id": "gitfnx2",
                                    "parent_id": "t1_gipils8",
                                    "score": 1,
                                    "created_utc": 1610323993.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "A profile is never enough, of course - you absolutely learn more from in person conversation.\n\nBut my experience is that if you set meet and greets with POT SBs with low effort profiles, you are going to be disappointed again and again.\n\nFor me, a well written, genuine, insightful profile tends to be highly correlated with a successful meet and greet. Low effort, platitude/catchphrase filled profiles, not so much.\n\nYour mileage may vary, of course.",
                    "author": "GDarn",
                    "id": "giraglc",
                    "parent_id": "t1_gipcbhf",
                    "score": 2,
                    "created_utc": 1610281568.0,
                    "replies": [
                        {
                            "body": "This. I was hoping a SD would say something along these lines. No, I’m not a SD and I cannot speak for them. But in my experience (which includes mentoring dozens of first time SBs from the point of creating their profile to entering their first long term SR as well as over ten years of sugaring, myself) having a thoughtful profile that took more than minimal effort results in more legitimate options.",
                            "author": "FoxyFreckles1989",
                            "id": "gis4efi",
                            "parent_id": "t1_giraglc",
                            "score": 2,
                            "created_utc": 1610300523.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "No, way LESS sex. And it's regular income for them",
            "author": "Blade4Hoover",
            "id": "gitm0c0",
            "parent_id": "t1_gionkff",
            "score": 1,
            "created_utc": 1610327128.0,
            "replies": [
                {
                    "body": "Regular income for \"them\" geesh you sound like one real SD.",
                    "author": "bookworm010101",
                    "id": "gitmhry",
                    "parent_id": "t1_gitm0c0",
                    "score": 1,
                    "created_utc": 1610327382.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "You’re not a SD so how do you know what most\nSD feel or are looking for? It would be like me telling you what SB’s are looking for in an SD on their profile.",
            "author": "Fun_Focus8159",
            "id": "girsqgs",
            "parent_id": "t1_gipdo98",
            "score": 2,
            "created_utc": 1610294581.0,
            "replies": [
                {
                    "body": "I pay attention. I know that this single SD cannot speak for all SDs, and neither can I. I see what is written on SLF. I see what is written in SA.",
                    "author": "FoxyFreckles1989",
                    "id": "girukea",
                    "parent_id": "t1_girsqgs",
                    "score": 1,
                    "created_utc": 1610295576.0,
                    "replies": [
                        {
                            "body": "Yes that’s true I don’t represent every SD in the world. But I would bet most SD’s agree with me.",
                            "author": "Fun_Focus8159",
                            "id": "girw960",
                            "parent_id": "t1_girukea",
                            "score": 2,
                            "created_utc": 1610296480.0,
                            "replies": [
                                {
                                    "body": "Your opinion is yours, and I won’t argue with it. I’m perfectly fine with the SDs whom prefer a SB that has a profile like mine and then messages me to tell me that. I don’t need every SD on SA, let alone on SLF, to agree with me. That would be ridiculous! Lol",
                                    "author": "FoxyFreckles1989",
                                    "id": "girwoxz",
                                    "parent_id": "t1_girw960",
                                    "score": 1,
                                    "created_utc": 1610296711.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I guess all the people that upvoted me disagree with you :)",
            "author": "Fun_Focus8159",
            "id": "giqve69",
            "parent_id": "t1_gipdo98",
            "score": -3,
            "created_utc": 1610266431.0,
            "replies": [
                {
                    "body": "Is this supposed to be...  joke? What a petty response. I also suppose all of the people that upvoted me disagree with you, but I’d never had said as much in an attempt to make a point.",
                    "author": "FoxyFreckles1989",
                    "id": "gir5hma",
                    "parent_id": "t1_giqve69",
                    "score": 4,
                    "created_utc": 1610276586.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "So, if she sounds really high maintenance based on her written profile you avoid her? This is a prime example of the written profile being beneficial to you.",
            "author": "FoxyFreckles1989",
            "id": "gir5l1n",
            "parent_id": "t1_giq68kj",
            "score": 3,
            "created_utc": 1610276681.0,
            "replies": [
                {
                    "body": "Lol pedantic.  People can have their own views for me thr pbotos are the biggest part.  Even then loads are fske anyway.  Some girls never bother to update their descriptions leaving it n/a.  If she wants nsa and will meet then I'll message her idc",
                    "author": "wb19081908",
                    "id": "gir82of",
                    "parent_id": "t1_gir5l1n",
                    "score": 1,
                    "created_utc": 1610279201.0,
                    "replies": [
                        {
                            "body": "How do you know these things before talking to her, aside from what’s written on her profile? I’m not saying the written profile itself is more important than photos/tags, but both comments you’ve left have literally been examples of the written profile indicating whether or not you’d feel messaging a SB was worth it! Lol *pedantic.*",
                            "author": "FoxyFreckles1989",
                            "id": "gitf56t",
                            "parent_id": "t1_gir82of",
                            "score": 1,
                            "created_utc": 1610323737.0,
                            "replies": [
                                {
                                    "body": "Just for me j hate spending ages messaging a girl.  After photos I look to see if she wants platonic.  Or if she sounds demanding.\n\nFrom my experience profiles dont mean much.  You have to meet and see if you connect in person.  If a girl can meet fairly soon after messaging on sa is good for me.\n\nSa In Australia has changed now anyway.  Its basically tinder for older guys to pay.  Genuine sd relationships sre rare.  Similarly loads of girls are happy for one offs or a double with a friend.  This wasn't.tje case when I  joined",
                                    "author": "wb19081908",
                                    "id": "giu7j4k",
                                    "parent_id": "t1_gitf56t",
                                    "score": 1,
                                    "created_utc": 1610337887.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "This. I try and decode her long wordy essays to see if she’s just looking for platonic only. I love the really long wordy profiles and then at the very bottom it says 100% platonic only. Like Damn you could’ve just said that at the very beginning of your profile and saved me a lot of time lol.",
            "author": "Fun_Focus8159",
            "id": "girsfoz",
            "parent_id": "t1_giq68kj",
            "score": 2,
            "created_utc": 1610294415.0,
            "replies": []
        },
        {
            "body": "You don’t know what profiles are first-cuts and what profiles have been tweaked and “perfected” if you’re seeing them for the first time. Some people just aren’t great at writing about themselves and asking for advice isn’t a bad thing. I’ve been told by dozens of SBs that I’ve given profile advice to that they had more fruitful interactions, leading to dates, on SA after I helped them. I’m glad!",
            "author": "FoxyFreckles1989",
            "id": "gipdydu",
            "parent_id": "t1_gipcbhf",
            "score": 2,
            "created_utc": 1610233906.0,
            "replies": [
                {
                    "body": "For example, a frequent piece of advice here is to avoid negativity in a profile, which is good advice, I am very turned off by negativity. But if you are by nature a negative person, then it’s going to come out at some point, and I’d rather not message them in the first place.",
                    "author": "midwesternguru",
                    "id": "gipils8",
                    "parent_id": "t1_gipdydu",
                    "score": 1,
                    "created_utc": 1610236346.0,
                    "replies": [
                        {
                            "body": "I agree. Advice should never include purposely misrepresenting oneself. However, I think that more often advice against “negativity” is in regards to things like referring to your own body image and perceived self worth in a negative manner, or saying things like “don’t waste my time,” or, “I’m always getting scammed on here,” along with other negative phrases. Sometimes things we write come off negatively without that intention or our own knowledge. Advice against that is good.",
                            "author": "FoxyFreckles1989",
                            "id": "gitfnx2",
                            "parent_id": "t1_gipils8",
                            "score": 1,
                            "created_utc": 1610323993.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "A profile is never enough, of course - you absolutely learn more from in person conversation.\n\nBut my experience is that if you set meet and greets with POT SBs with low effort profiles, you are going to be disappointed again and again.\n\nFor me, a well written, genuine, insightful profile tends to be highly correlated with a successful meet and greet. Low effort, platitude/catchphrase filled profiles, not so much.\n\nYour mileage may vary, of course.",
            "author": "GDarn",
            "id": "giraglc",
            "parent_id": "t1_gipcbhf",
            "score": 2,
            "created_utc": 1610281568.0,
            "replies": [
                {
                    "body": "This. I was hoping a SD would say something along these lines. No, I’m not a SD and I cannot speak for them. But in my experience (which includes mentoring dozens of first time SBs from the point of creating their profile to entering their first long term SR as well as over ten years of sugaring, myself) having a thoughtful profile that took more than minimal effort results in more legitimate options.",
                    "author": "FoxyFreckles1989",
                    "id": "gis4efi",
                    "parent_id": "t1_giraglc",
                    "score": 2,
                    "created_utc": 1610300523.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Regular income for \"them\" geesh you sound like one real SD.",
            "author": "bookworm010101",
            "id": "gitmhry",
            "parent_id": "t1_gitm0c0",
            "score": 1,
            "created_utc": 1610327382.0,
            "replies": []
        },
        {
            "body": "I pay attention. I know that this single SD cannot speak for all SDs, and neither can I. I see what is written on SLF. I see what is written in SA.",
            "author": "FoxyFreckles1989",
            "id": "girukea",
            "parent_id": "t1_girsqgs",
            "score": 1,
            "created_utc": 1610295576.0,
            "replies": [
                {
                    "body": "Yes that’s true I don’t represent every SD in the world. But I would bet most SD’s agree with me.",
                    "author": "Fun_Focus8159",
                    "id": "girw960",
                    "parent_id": "t1_girukea",
                    "score": 2,
                    "created_utc": 1610296480.0,
                    "replies": [
                        {
                            "body": "Your opinion is yours, and I won’t argue with it. I’m perfectly fine with the SDs whom prefer a SB that has a profile like mine and then messages me to tell me that. I don’t need every SD on SA, let alone on SLF, to agree with me. That would be ridiculous! Lol",
                            "author": "FoxyFreckles1989",
                            "id": "girwoxz",
                            "parent_id": "t1_girw960",
                            "score": 1,
                            "created_utc": 1610296711.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Is this supposed to be...  joke? What a petty response. I also suppose all of the people that upvoted me disagree with you, but I’d never had said as much in an attempt to make a point.",
            "author": "FoxyFreckles1989",
            "id": "gir5hma",
            "parent_id": "t1_giqve69",
            "score": 4,
            "created_utc": 1610276586.0,
            "replies": []
        },
        {
            "body": "Lol pedantic.  People can have their own views for me thr pbotos are the biggest part.  Even then loads are fske anyway.  Some girls never bother to update their descriptions leaving it n/a.  If she wants nsa and will meet then I'll message her idc",
            "author": "wb19081908",
            "id": "gir82of",
            "parent_id": "t1_gir5l1n",
            "score": 1,
            "created_utc": 1610279201.0,
            "replies": [
                {
                    "body": "How do you know these things before talking to her, aside from what’s written on her profile? I’m not saying the written profile itself is more important than photos/tags, but both comments you’ve left have literally been examples of the written profile indicating whether or not you’d feel messaging a SB was worth it! Lol *pedantic.*",
                    "author": "FoxyFreckles1989",
                    "id": "gitf56t",
                    "parent_id": "t1_gir82of",
                    "score": 1,
                    "created_utc": 1610323737.0,
                    "replies": [
                        {
                            "body": "Just for me j hate spending ages messaging a girl.  After photos I look to see if she wants platonic.  Or if she sounds demanding.\n\nFrom my experience profiles dont mean much.  You have to meet and see if you connect in person.  If a girl can meet fairly soon after messaging on sa is good for me.\n\nSa In Australia has changed now anyway.  Its basically tinder for older guys to pay.  Genuine sd relationships sre rare.  Similarly loads of girls are happy for one offs or a double with a friend.  This wasn't.tje case when I  joined",
                            "author": "wb19081908",
                            "id": "giu7j4k",
                            "parent_id": "t1_gitf56t",
                            "score": 1,
                            "created_utc": 1610337887.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "For example, a frequent piece of advice here is to avoid negativity in a profile, which is good advice, I am very turned off by negativity. But if you are by nature a negative person, then it’s going to come out at some point, and I’d rather not message them in the first place.",
            "author": "midwesternguru",
            "id": "gipils8",
            "parent_id": "t1_gipdydu",
            "score": 1,
            "created_utc": 1610236346.0,
            "replies": [
                {
                    "body": "I agree. Advice should never include purposely misrepresenting oneself. However, I think that more often advice against “negativity” is in regards to things like referring to your own body image and perceived self worth in a negative manner, or saying things like “don’t waste my time,” or, “I’m always getting scammed on here,” along with other negative phrases. Sometimes things we write come off negatively without that intention or our own knowledge. Advice against that is good.",
                    "author": "FoxyFreckles1989",
                    "id": "gitfnx2",
                    "parent_id": "t1_gipils8",
                    "score": 1,
                    "created_utc": 1610323993.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "This. I was hoping a SD would say something along these lines. No, I’m not a SD and I cannot speak for them. But in my experience (which includes mentoring dozens of first time SBs from the point of creating their profile to entering their first long term SR as well as over ten years of sugaring, myself) having a thoughtful profile that took more than minimal effort results in more legitimate options.",
            "author": "FoxyFreckles1989",
            "id": "gis4efi",
            "parent_id": "t1_giraglc",
            "score": 2,
            "created_utc": 1610300523.0,
            "replies": []
        },
        {
            "body": "Yes that’s true I don’t represent every SD in the world. But I would bet most SD’s agree with me.",
            "author": "Fun_Focus8159",
            "id": "girw960",
            "parent_id": "t1_girukea",
            "score": 2,
            "created_utc": 1610296480.0,
            "replies": [
                {
                    "body": "Your opinion is yours, and I won’t argue with it. I’m perfectly fine with the SDs whom prefer a SB that has a profile like mine and then messages me to tell me that. I don’t need every SD on SA, let alone on SLF, to agree with me. That would be ridiculous! Lol",
                    "author": "FoxyFreckles1989",
                    "id": "girwoxz",
                    "parent_id": "t1_girw960",
                    "score": 1,
                    "created_utc": 1610296711.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "How do you know these things before talking to her, aside from what’s written on her profile? I’m not saying the written profile itself is more important than photos/tags, but both comments you’ve left have literally been examples of the written profile indicating whether or not you’d feel messaging a SB was worth it! Lol *pedantic.*",
            "author": "FoxyFreckles1989",
            "id": "gitf56t",
            "parent_id": "t1_gir82of",
            "score": 1,
            "created_utc": 1610323737.0,
            "replies": [
                {
                    "body": "Just for me j hate spending ages messaging a girl.  After photos I look to see if she wants platonic.  Or if she sounds demanding.\n\nFrom my experience profiles dont mean much.  You have to meet and see if you connect in person.  If a girl can meet fairly soon after messaging on sa is good for me.\n\nSa In Australia has changed now anyway.  Its basically tinder for older guys to pay.  Genuine sd relationships sre rare.  Similarly loads of girls are happy for one offs or a double with a friend.  This wasn't.tje case when I  joined",
                    "author": "wb19081908",
                    "id": "giu7j4k",
                    "parent_id": "t1_gitf56t",
                    "score": 1,
                    "created_utc": 1610337887.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I agree. Advice should never include purposely misrepresenting oneself. However, I think that more often advice against “negativity” is in regards to things like referring to your own body image and perceived self worth in a negative manner, or saying things like “don’t waste my time,” or, “I’m always getting scammed on here,” along with other negative phrases. Sometimes things we write come off negatively without that intention or our own knowledge. Advice against that is good.",
            "author": "FoxyFreckles1989",
            "id": "gitfnx2",
            "parent_id": "t1_gipils8",
            "score": 1,
            "created_utc": 1610323993.0,
            "replies": []
        },
        {
            "body": "Your opinion is yours, and I won’t argue with it. I’m perfectly fine with the SDs whom prefer a SB that has a profile like mine and then messages me to tell me that. I don’t need every SD on SA, let alone on SLF, to agree with me. That would be ridiculous! Lol",
            "author": "FoxyFreckles1989",
            "id": "girwoxz",
            "parent_id": "t1_girw960",
            "score": 1,
            "created_utc": 1610296711.0,
            "replies": []
        },
        {
            "body": "Just for me j hate spending ages messaging a girl.  After photos I look to see if she wants platonic.  Or if she sounds demanding.\n\nFrom my experience profiles dont mean much.  You have to meet and see if you connect in person.  If a girl can meet fairly soon after messaging on sa is good for me.\n\nSa In Australia has changed now anyway.  Its basically tinder for older guys to pay.  Genuine sd relationships sre rare.  Similarly loads of girls are happy for one offs or a double with a friend.  This wasn't.tje case when I  joined",
            "author": "wb19081908",
            "id": "giu7j4k",
            "parent_id": "t1_gitf56t",
            "score": 1,
            "created_utc": 1610337887.0,
            "replies": []
        }
    ]
}