{
    "title": "Rant: another failed SR",
    "post_id": "10adwbu",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/10adwbu/rant_another_failed_sr/",
    "author": "Psychological_Sun374",
    "body": "I was posting frequently here under another account, which I ended up deleting for reasons I may talk about another post.\n\nBut for all the talk from women here who just wish there were a guy who would take care of them… somehow I don’t seem to be finding these women in the real world, or even on here.\n\nThe latest SB was 30, professional woman with a good job. I met her on SA. I actually opened up a major career opportunity for her, and I was about to open another one. Like transformational for her career from the minor leagues to the major leagues. \n\nI also bought her high end electronics, gave her a decent allowance, flew her long-haul business & first class, put her up at luxury hotels, gave her a travel allowance on top of the monthly allowance, took her to nice restaurants. She told me her dream was to get tickets to a particular exclusive event and of course I manage the score of them through my connections. If she lasted another month, I would have also paid off all of her outstanding debt. She claimed that the sex was amazing and even unexpectedly good.\n\nSo this was the whole package: mentorship career support, spoiling, financial support, relief of financial anxiety, sexual satisfaction.\n\nFor me, sex was pleasant (nice, but not mind blowing) but all I really needed from her was reliability: show up for dates, don’t disappear in the middle of a text conversation. \n\nApparently, this was too much to ask.\n\nMy dawning realization was that she liked me, but didn’t actually care about me.\n\nMy best POTs at this point just want spoiled gf-style situations. I wasn’t averse to trying an actual sugar style relationship, but none of the women I tried doing that with from SA showed a hint of gratitude or appreciation.\n\nIncluding a couple of efforts to date off of this forum, with women who claimed that they were different. \n\nI’m sure there are appreciative SB’s, but my experience has not been consistent with that. \n\nAnyway, thank you for listening to my rant. I’m trying to keep a positive attitude but I’m pretty annoyed right now because she disappeared on me right before a major trip and unwinding the tickets and housing is a huge hassle.",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/10adwbu/rant_another_failed_sr/",
    "score": 92,
    "upvote_ratio": 0.9,
    "created_utc": 1673564958.0,
    "num_comments": 184,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "I’m sorry your experiences have been less than amazing and wonderful 😔\n\nThis is definitely one of those situations where I would love to hear the other side of the story. Believe me this is coming from an SB that sided with SDs more often than not. But women don’t just walk away from such ideal and amazing arrangements for no reason. Something about it was not ideal for her and she didn’t feel comfortable voicing it to you. \n\nDo you think possibly you may have thrown it in her face just how one sided or skewed in her favor your arrangement was? Did you mayhaps lead on that the sex was not mind blowing? The self respect is strong in some women and although I would never ghost a man I was unhappy or unsatisfied with (that’s lame on her part) I would leave no matter how great if I felt disrespected in any way.",
            "author": "P0sitiveViibes777",
            "id": "j43sw2c",
            "parent_id": "t3_10adwbu",
            "score": 60,
            "created_utc": 1673566893.0,
            "replies": [
                {
                    "body": "Yeah, this is a smart take. I was astonished reading the OP as to why anyone would walk away from that, and also disappear right before a trip! You'd expect a flaky young girl to mess up something that good out of impulsivity, but not a 30 year old professional. \n\nBut, you reminded me that sometimes the relational piece of things can get really bad, and one might decide it's unfixable (generally because the other person refuses to listen or change) and that the money isn't worth it. It would also make a lot of sense to leave right before a trip, during which you'll be spending lots of time together with ample room for frustration.\n\nOP, I have no idea what happened with your SB, of course.  I remember walking away from an arrangement when I was 22, though, because of how bad I consistently felt around him. He was one of those attorneys who make arguing their whole personality and I didn't like that dynamic (esp given that I never won! Though things would have gotten even more unpleasant if I had) and didn't like how he would put me down and didn't like that he would predictably get upset with me when I was truly trying my best to make him happy. \n\nThe last straw (I'm sure you didn't do this with your SB, but I include it to illustrate how frustrating things got for me) was when I went to see him one weekend and he started talking about the fact that I am biracial in terms of my \"more dominant-acting White side, and your submissive Asian side.\" My jaw metaphorically dropped and I tried to kindly but firmly tell him that he really shouldn't equate Whiteness with dominance and Asianness with being submissive. He waved me off and insisted that his analysis was correct. \n\nI finished the weekend with him and didn't really think of it as the last weekend at the time, but once I got back home, I realized that the money just wasn't worth it for me. He could have paid me double and it still wouldn't have been worth it. So, I ghosted him. Only time I have ever done that to anyone I've dated. My idea was that talking about things with him would have just led to the mother of all arguments. I know I shouldn't have done it, I should have just sent him a brief message saying it was over and blocked him. That's what I would do now, but it is what it is. \n\nI wonder what your last series of interactions with your SB may have been like? What do you think they might have been like, from her perspective?\n\nUsually, both people contribute to things falling apart somehow. Regardless, I'm sorry that you've been having such crappy experiences in the bowl.",
                    "author": "uptiedand8",
                    "id": "j46kwck",
                    "parent_id": "t1_j43sw2c",
                    "score": 19,
                    "created_utc": 1673622017.0,
                    "replies": [
                        {
                            "body": "💗",
                            "author": "P0sitiveViibes777",
                            "id": "j46vnth",
                            "parent_id": "t1_j46kwck",
                            "score": 5,
                            "created_utc": 1673626199.0,
                            "replies": []
                        },
                        {
                            "body": "Honestly, I've had a situation where I setup a trip for us to go  on a nice skiing vacation for a few days because I know she's always wanted a trip like that. She had never been...\nThen for no good reason,  just creates a non existence issue   to make an argument out of, and just disappeared.  Only to reach out a couple weeks later. This person was also 30.\nOdd histrionic behavior...",
                            "author": "dzyadza",
                            "id": "j4fr6ay",
                            "parent_id": "t1_j46kwck",
                            "score": 3,
                            "created_utc": 1673783539.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "I can tell you exactly why someone would walk away from that. The OP expressed it ... the SB only pretended to like and care about the OP. As soon as she had other opportunities or another guy someone she was probably actually attracted to she disappeared.\n\nAnd did she walk away from it? Or did he end it after feeling disrespected.  Or  did she expect him to accept it because she is hot, and younger and he should be greatful to be with her.\n\nI have had a few great SR with SB who actually like me as a person and want to spend time with me and enjoy the time we spend together, in these sitatuations the SR tends to last much longer as in a couple of years. I have sadly run into people like the SB described by the OP. Someone who never actually liked me as a person and when the opportunity to move on came they did, or the acting was bad and I could see they didn't care about me and I dropped them. \n\nRemember for every amazing SB there are many bad/disengenous/fake people out there. Just like for every good SD there are many cheap/bad/fake people out there.",
                    "author": "midasza",
                    "id": "j475dk0",
                    "parent_id": "t1_j43sw2c",
                    "score": 9,
                    "created_utc": 1673629799.0,
                    "replies": [
                        {
                            "body": "Damn it’s hard for me to relate to disingenuous people because I work really hard to be 💯 but I believe you",
                            "author": "P0sitiveViibes777",
                            "id": "j48alak",
                            "parent_id": "t1_j475dk0",
                            "score": 3,
                            "created_utc": 1673644995.0,
                            "replies": [
                                {
                                    "body": "Honestly I would love to believe everyone has good intentions, but realistically some don't.",
                                    "author": "midasza",
                                    "id": "j48ax9y",
                                    "parent_id": "t1_j48alak",
                                    "score": 2,
                                    "created_utc": 1673645120.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "I think this is one small piece of her life. And she’s kind of disorganized enough about how she manages her life outside of her actual work that she’s not really putting the pieces together. She kept using words to say that she really liked me and she knows that she’s been flaky and she’s going to get better and blah blah blah but her actions never matched up.",
                    "author": "Psychological_Sun374",
                    "id": "j43takj",
                    "parent_id": "t1_j43sw2c",
                    "score": 3,
                    "created_utc": 1673567058.0,
                    "replies": [
                        {
                            "body": "It doesn’t matter how much opportunity one is given. If they don’t have their shit together, then the opportunity is wasted. Maybe wait til a persons true colors start to emerge prior to going all in. 💗💗💗💗 best wishes for your next great adventure!",
                            "author": "P0sitiveViibes777",
                            "id": "j43vb3b",
                            "parent_id": "t1_j43takj",
                            "score": 10,
                            "created_utc": 1673567878.0,
                            "replies": [
                                {
                                    "body": "For sure. I deleted my SA profile and I’m kind of winding through the last few conversations. Going back to the idea that maybe I can get emotional support from friends and just have a casual FWB situation for sexual relief.",
                                    "author": "Psychological_Sun374",
                                    "id": "j43wf1c",
                                    "parent_id": "t1_j43vb3b",
                                    "score": 2,
                                    "created_utc": 1673568337.0,
                                    "replies": [
                                        {
                                            "body": "Do you enjoy spoiling people? Because you could have a FWB and spoil them. Obviously not to that extent, but meals, little treats, small gifts. I've always been a FWB person more than a relationship person myself.",
                                            "author": "newbytheybe",
                                            "id": "j4b0ujh",
                                            "parent_id": "t1_j43wf1c",
                                            "score": 4,
                                            "created_utc": 1673700271.0,
                                            "replies": [
                                                {
                                                    "body": "Yeah, that might be the route I head towards",
                                                    "author": "Psychological_Sun374",
                                                    "id": "j4br8lc",
                                                    "parent_id": "t1_j4b0ujh",
                                                    "score": 2,
                                                    "created_utc": 1673712850.0,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "body": "Deleting your profile sounds drastic. But I agree you should take a step back and reassess. 🧘 Come back though, once the dust settles and you can breathe freely and optimistically 💗",
                                            "author": "P0sitiveViibes777",
                                            "id": "j467qgr",
                                            "parent_id": "t1_j43wf1c",
                                            "score": 2,
                                            "created_utc": 1673616217.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "\"Just say no\" is the ultimate measure and exercise of self-respect.\n\nIf want to be a SB then you sign up for getting things in exchange for the obvious... attention and at the very least respect of your SD.\n\nThis is not \"I'd love to hear the other side of the story\"\n\nShe got a lot and was unappreciative and he got used. \n\nThere's no nuance here.",
                    "author": "LunchBucketSandwich",
                    "id": "j47xnco",
                    "parent_id": "t1_j43sw2c",
                    "score": 3,
                    "created_utc": 1673640180.0,
                    "replies": [
                        {
                            "body": "I can see you point to a degree. But you are assuming the OP is 100% and the truth is her side his side and then the real truth.",
                            "author": "P0sitiveViibes777",
                            "id": "j48awg1",
                            "parent_id": "t1_j47xnco",
                            "score": 5,
                            "created_utc": 1673645111.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Nothing is a failure if you gained something from the experience",
            "author": "CaffineandGasoline",
            "id": "j43uuw3",
            "parent_id": "t3_10adwbu",
            "score": 35,
            "created_utc": 1673567693.0,
            "replies": [
                {
                    "body": "Fair enough. I think I’m getting a sharper lens on boundaries and what behaviors I will accept.",
                    "author": "Psychological_Sun374",
                    "id": "j43v4yy",
                    "parent_id": "t1_j43uuw3",
                    "score": 20,
                    "created_utc": 1673567809.0,
                    "replies": [
                        {
                            "body": "It’s funny how we can be successful and not understand our own value and have difficulties setting those boundaries in personal life",
                            "author": "CaffineandGasoline",
                            "id": "j43xyjy",
                            "parent_id": "t1_j43v4yy",
                            "score": 11,
                            "created_utc": 1673568971.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "My man, I am sorry you cannot find a good partner. Life would be super different if we could all skip meeting people who are not good matches, and only see perfect compatibility every time.\n\nIn my humble opinion, you do need some practice at professional skepticism.  Not for sugar dating.... for life. People are going to pretend around you.  (I have the worlds tiniest violin for us both... it's a by product of wealth and everyone on earth would happily trade that problem for theirs).\n\nDont believe words... believe actions. Specifically, sustained, consistent behavior over long periods of time.  I read your post and didnt really think your girl was winning any Oscars man.\n\nI am not trying to insult you. We all have things that we could do to be better at the things we like to do. It's just my humble opinion that if you just... be a little bit more analytical and less ready to fall to confirmation bias, you will be happier, and that is what I want for you brother.",
            "author": "TastySpermDevice",
            "id": "j43rqr2",
            "parent_id": "t3_10adwbu",
            "score": 28,
            "created_utc": 1673566427.0,
            "replies": [
                {
                    "body": "Just to add my US$0.02 on that - I'm not sure everybody would happily trade for this.\n\nI'm very well off, but not ultra wealthy. Still it gets tiring getting sized up for cash by seemingly everyone. I missed catching up with a friend before xmas when we were in the same city. Timing didn't work out, I thought it was just drinks - no worries, next time. Today I got an investment proposal.\n\nTo bring it back to the bowl - I suspect this is why some of us are touchy about the women who try to turn us into ATMs. Many of us deal with this shit all the time and are looking for a short-term escape.",
                    "author": "quietgrey1",
                    "id": "j43x8s0",
                    "parent_id": "t1_j43rqr2",
                    "score": 10,
                    "created_utc": 1673568674.0,
                    "replies": [
                        {
                            "body": "I completely feel this. I'm not rich, but your statement reminds me of this good friend I had several years back. I consistently made a lot more money than her and we both knew it. When we would go out to eat or for drinks, sometimes I would try to grab the whole check; she clocked this and would then insist on paying the whole thing herself! I learned my lesson at a certain point and just started paying for my portion of things, but she *still* insisted on paying the whole check sometimes, haha. She was an awesome person- friends like that are very valuable, and I guess if she had always let me pay the tab like I was trying to, then the friendship may have felt a bit different. \n\nI'm sure that when you're actually well off and can invest in someone's business idea, as opposed to just picking up the tab for their sushi, the schemers become thick on the ground and very underhanded in their attempts to get close to you. I've heard that this is the main reason wealthy folks tend to hang out with each other. Seems frustrating and lonely to have reason not to trust nice people who seem to like you.",
                            "author": "uptiedand8",
                            "id": "j46onkj",
                            "parent_id": "t1_j43x8s0",
                            "score": 4,
                            "created_utc": 1673623517.0,
                            "replies": [
                                {
                                    "body": "👍 there’s one more twist - 99.99999% of the business ideas are from folks who don’t know how to execute biz ideas, so it’s basically me telling friends “no” 100% of the time, while they know I do invest in startups - just not theirs. Startup friends who know what they’re doing just ask me to be an advisor, knowing that eventually turns into $$.",
                                    "author": "quietgrey1",
                                    "id": "j47ygew",
                                    "parent_id": "t1_j46onkj",
                                    "score": 2,
                                    "created_utc": 1673640480.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "I don't mean to be disrespectful, just genuinely curious to hear your perspective because I've heard it echoed from others: if you're sensitive about this, why go into such a lifestyle which places heavy focus on the amount of money you make? To me it's akin to a pot SB getting into this lifestyle and being sensitive to being objectified..",
                            "author": "rocknrollwitch",
                            "id": "j45jqtt",
                            "parent_id": "t1_j43x8s0",
                            "score": 6,
                            "created_utc": 1673599449.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Oh, you’re right. My publicist, who knows everything about my life, had to sit me down and dictate the text message I sent to tell this woman goodbye. She kept repeating that I should teach people how they should behave towards me.\n\nIn vanilla dating I am absolutely used to screening out golddiggers. I guess I foolishly believed that the construct of sugar dating would make the expectations and exchange explicit. And that someone who really wanted things to continue would make a minimal effort. \n\nAnyway, there’s a woman I met on SA who is sexually compatible, pleasant company, and really appreciates me. She doesn’t want an allowance, she’s delighted when I take her out. The main issues are that she is a grad student, half my age, and her self-confidence is so low that she doesn’t really contribute enough in conversation because she’s intimidated by me. I’ve been trying to make her comfortable and encourage her to open up but it’s going to be a lot of work. 🤷🏻",
                    "author": "Psychological_Sun374",
                    "id": "j43srm4",
                    "parent_id": "t1_j43rqr2",
                    "score": 11,
                    "created_utc": 1673566843.0,
                    "replies": [
                        {
                            "body": "That's not a match. Keep trying.",
                            "author": "quietgrey1",
                            "id": "j43v668",
                            "parent_id": "t1_j43srm4",
                            "score": 20,
                            "created_utc": 1673567823.0,
                            "replies": []
                        },
                        {
                            "body": "I agree with your therapist. You are responsible for teaching people how to treat you. Learn from this experience, or this situation will likely happen again. Keep your heart open, but learn to give the same energy that you get from people. Also, love yourself enough to know when to let people go.",
                            "author": "CartographerCold7625",
                            "id": "j4420yu",
                            "parent_id": "t1_j43srm4",
                            "score": 9,
                            "created_utc": 1673570654.0,
                            "replies": [
                                {
                                    "body": "Ha ha she’s not my therapist, she’s my publicist. Well, I guess it’s really a variation on a theme.",
                                    "author": "Psychological_Sun374",
                                    "id": "j442hlj",
                                    "parent_id": "t1_j4420yu",
                                    "score": 8,
                                    "created_utc": 1673570846.0,
                                    "replies": [
                                        {
                                            "body": "Well my therapist has been telling me the same thing. It's working for me, so your publicist may be on to something 🤷🏽‍♀️",
                                            "author": "CartographerCold7625",
                                            "id": "j442xk6",
                                            "parent_id": "t1_j442hlj",
                                            "score": 7,
                                            "created_utc": 1673571032.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Yes but since we are spending cash on women  in the amount of a decent payroll I would expect that this should not be oneof my worries right. I dontknow why sbs start an arrangement or don't cut it off immediately if thy don't plan on something long term without the hassle  . Oh I know $$$$",
                    "author": "MarzipanInevitable79",
                    "id": "j43sm2e",
                    "parent_id": "t1_j43rqr2",
                    "score": -1,
                    "created_utc": 1673566781.0,
                    "replies": [
                        {
                            "body": "My friend. Your comment does not make sense to me. I hire around 20 people every year out of college, and pay them all the same, well above the median american salary.  Every year, without fail, some of those employees are awesome, some are not. Some are long term, some are not. \n\nMoney doesn't affect performance.  Period. You could pay me a billion dollars, and I'd still be a terrible quarterback. Money allows you to be able to persuade *good performers to work for you.*  But you have to find the good performer. You cant just take a bad performer, increase their pay, and expect them to magically get better....",
                            "author": "TastySpermDevice",
                            "id": "j43tl6l",
                            "parent_id": "t1_j43sm2e",
                            "score": 39,
                            "created_utc": 1673567180.0,
                            "replies": [
                                {
                                    "body": "wise as fuck",
                                    "author": "GautiousCur",
                                    "id": "j47gzes",
                                    "parent_id": "t1_j43tl6l",
                                    "score": 4,
                                    "created_utc": 1673634025.0,
                                    "replies": []
                                },
                                {
                                    "body": "Yes but I would say sbs don't need to put a lot on \nthe table except beeing their self and beeing honest .\n\nOp is talking about basic human behavior like call when you can't show up or just be honest with me. I personally don't have the time or wants to play games. \n\n\nI hire people to be profitable for me and I provide for sbs to just be themselves.",
                                    "author": "MarzipanInevitable79",
                                    "id": "j43uhqd",
                                    "parent_id": "t1_j43tl6l",
                                    "score": 3,
                                    "created_utc": 1673567543.0,
                                    "replies": [
                                        {
                                            "body": ">I provide for sbs to just be themselves\n\nRespectfully: I know that's the fantasy and you need her to sell it, but you've got to keep in the back of your mind that she's doing a lot of work behind the scenes to be the version of herself that you are willing to pay an allowance to. I say this because when I see men argue in favor of paying less to SBs in various situations (a common one is travel allowance), they often make the point that she's not actually working for the money, but instead is getting paid to be herself and hang out with someone she likes. Even if the second part of that is true, though, the first part is not.",
                                            "author": "uptiedand8",
                                            "id": "j46viik",
                                            "parent_id": "t1_j43uhqd",
                                            "score": 3,
                                            "created_utc": 1673626143.0,
                                            "replies": [
                                                {
                                                    "body": "I agree with you regarding the travel. Even though we pay for it the sbs have to take up few days and put their life on pause. They should be compensate for that in ay way they want . Per diem is a must even by labor laws lol.\n\nI get that maintaining a look it's not cheap but honestly in my case I only commit to a sb when I see her in sweatpants and without make up. You would be surprised of the catfishing I've seen on MGs. \n\nAnd it is not a fantasy for me, I like ordinary girls which I would date vanilla as well. That my taste. Never had a thing for the bombshells 6 foot tall model. Been there done that and not my cup of tea.\n\nI know we're a moving ATM I just wish that sbs don't just see us like that because it doesn't last on the long run. Allowance in my opinion it's there to stimulate the relationship and make her life easier. Sadly lots of sbs see this as a job and that is fine plenty of men like that. There's something for everyone in he bowl it's just seems like a traditional sr it's harder to find.",
                                                    "author": "MarzipanInevitable79",
                                                    "id": "j4704kc",
                                                    "parent_id": "t1_j46viik",
                                                    "score": 2,
                                                    "created_utc": 1673627885.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "And those who *do* respond to money as a motivator to perform better are exactly the people you need to avoid.  They are the same people who will sell you out or abandon you the moment they perceive the grass is greener elsewhere.",
                                    "author": "S2USStudios",
                                    "id": "j44o8dd",
                                    "parent_id": "t1_j43tl6l",
                                    "score": 3,
                                    "created_utc": 1673580344.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Whaaaaaaat??? If I had a SD treating me like this, the rest of the world would disappear and I’d spend my time making sure he felt like a king 🤴",
            "author": "BeautyBaby247",
            "id": "j446abc",
            "parent_id": "t3_10adwbu",
            "score": 25,
            "created_utc": 1673572464.0,
            "replies": [
                {
                    "body": "😂",
                    "author": "Psychological_Sun374",
                    "id": "j449gg8",
                    "parent_id": "t1_j446abc",
                    "score": 2,
                    "created_utc": 1673573847.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "j44er56",
                            "parent_id": "t1_j449gg8",
                            "score": 6,
                            "created_utc": 1673576152.0,
                            "replies": [
                                {
                                    "body": "Ahhh, this happened to me too and still putting myself back together over a year and a half later. Sorry this happened to you.",
                                    "author": "thehottubistoohawt",
                                    "id": "j450f1i",
                                    "parent_id": "t1_j44er56",
                                    "score": 5,
                                    "created_utc": 1673586472.0,
                                    "replies": [
                                        {
                                            "body": "🤗💜💜",
                                            "author": "Efficient-Aioli417",
                                            "id": "j450mtq",
                                            "parent_id": "t1_j450f1i",
                                            "score": 1,
                                            "created_utc": 1673586588.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "Yes I don’t think she’s cruel. Just ungrateful and self centered.",
                                    "author": "Psychological_Sun374",
                                    "id": "j459oqu",
                                    "parent_id": "t1_j44er56",
                                    "score": 5,
                                    "created_utc": 1673592037.0,
                                    "replies": [
                                        {
                                            "body": "[deleted]",
                                            "author": null,
                                            "id": "j45qiv4",
                                            "parent_id": "t1_j459oqu",
                                            "score": 1,
                                            "created_utc": 1673604977.0,
                                            "replies": [
                                                {
                                                    "body": "I do think goodness is healing, and I wish you the best in rebuilding.  Seeing it, hearing it, hearing about it are tremendously restorative.  Just seeing good people in action has helped me get through rough times (and I hope pass it on).",
                                                    "author": "Sunny_Heather",
                                                    "id": "j47agad",
                                                    "parent_id": "t1_j45qiv4",
                                                    "score": 2,
                                                    "created_utc": 1673631638.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "For real! I’d be showing him how appreciative I was In any way I can! Lingerie at the door and a cocktail in my hand! How may I please you today, daddy? Haha",
                    "author": null,
                    "id": "j44gq9f",
                    "parent_id": "t1_j446abc",
                    "score": 0,
                    "created_utc": 1673576989.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Not that this will be of any comfort, but I'd venture to guess many Sds here have felt similar in some way - I know I have and it sucks - give a lot for not much in return - it's not how it's \"supposed\" to be... and yet.....\n\nTake a pause from it all.... it's what I did..... and try (as hard as it is) to not let it permanently color your view... sending positive vibes your way",
            "author": "thereadinessisall",
            "id": "j4499g0",
            "parent_id": "t3_10adwbu",
            "score": 6,
            "created_utc": 1673573763.0,
            "replies": [
                {
                    "body": "Yeah. I may end up spending time with a woman who is nice company but at a more confused stage of her life. And more spoiled gf / sub than SB.",
                    "author": "Psychological_Sun374",
                    "id": "j459eac",
                    "parent_id": "t1_j4499g0",
                    "score": 2,
                    "created_utc": 1673591842.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "j44p3yv",
            "parent_id": "t3_10adwbu",
            "score": 4,
            "created_utc": 1673580759.0,
            "replies": [
                {
                    "body": "If it’s a business transaction, she gets a one star rating. Although not my preference I would’ve been open to different situations but at base making & keeping plans and not flaking last minute is a minimum requirement",
                    "author": "Psychological_Sun374",
                    "id": "j45aapa",
                    "parent_id": "t1_j44p3yv",
                    "score": 2,
                    "created_utc": 1673592450.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "j43r07e",
            "parent_id": "t3_10adwbu",
            "score": 12,
            "created_utc": 1673566124.0,
            "replies": [
                {
                    "body": "This was over a period of five months",
                    "author": "Psychological_Sun374",
                    "id": "j43re64",
                    "parent_id": "t1_j43r07e",
                    "score": 3,
                    "created_utc": 1673566283.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "j43t1lh",
                            "parent_id": "t1_j43re64",
                            "score": 1,
                            "created_utc": 1673566957.0,
                            "replies": [
                                {
                                    "body": "Yeah, I think she’s basking in pretty privilege. And it’s been several years since she had a relationship which means her last relationship ended when she was like 25. So it’s possible she simply doesn’t know how to actually show up as a mature partner.\n\nShe claims her last sugar relationship ended because the guy liked her so much he wanted to marry her and she doesn’t want to get married. Based on my own experience with her, I have to believe that guy had low self-esteem.",
                                    "author": "Psychological_Sun374",
                                    "id": "j43tijk",
                                    "parent_id": "t1_j43t1lh",
                                    "score": 4,
                                    "created_utc": 1673567150.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I sense this is a quite common story in the sugar world.   I've also had that experience - you do great things for them, provide support which is well in excess of anything they have gotten in their lives.  However, it appears they are just not adept enough to figure out the situation, and show reciprocal gratitude. (This is not a rant about women btw, but for a large portion of people).  I find myself having to explain and educate SB about how best to treat me (which is not very easy).  If she does not, the relationship does not work well for me and I'll end it.  And, frankly her life would likely implodes in a big way.",
            "author": "HappyBear1952",
            "id": "j44mnpl",
            "parent_id": "t3_10adwbu",
            "score": 4,
            "created_utc": 1673579613.0,
            "replies": [
                {
                    "body": "I think she will continue to muddle by. I was going to set her up with a financial plan and habits, not just pay off the debt for her to run it up again. But she apparently couldn’t be arsed to simple civility",
                    "author": "Psychological_Sun374",
                    "id": "j459stl",
                    "parent_id": "t1_j44mnpl",
                    "score": 2,
                    "created_utc": 1673592113.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "\\> I’m sure there are appreciative SB’s, but my experience has not been consistent with that.\n\nYou've answered to yourself. It's you not them then. Change something in yourself, and you'll find them.",
            "author": "SeekingInSydney",
            "id": "j4hvx0l",
            "parent_id": "t3_10adwbu",
            "score": 5,
            "created_utc": 1673816686.0,
            "replies": [
                {
                    "body": "Right. It’s called “not doing this”",
                    "author": "Psychological_Sun374",
                    "id": "j4hyd21",
                    "parent_id": "t1_j4hvx0l",
                    "score": -1,
                    "created_utc": 1673817607.0,
                    "replies": [
                        {
                            "body": "Man, seriously, please stop it. There are myriads of \"impossible\" things in this World that happen. We attract what we truly want / believe in.",
                            "author": "SeekingInSydney",
                            "id": "j4hz1yk",
                            "parent_id": "t1_j4hyd21",
                            "score": 3,
                            "created_utc": 1673817864.0,
                            "replies": [
                                {
                                    "body": "I didn’t say it impossible. I am saying that the things that I would probably need to do in order to fit with the parameters of a conventional sugar relationship don’t mesh with my personality. Rather than put myself in a position that would make me unhappy, I’m just going to opt for a different path.",
                                    "author": "Psychological_Sun374",
                                    "id": "j4i1ysc",
                                    "parent_id": "t1_j4hz1yk",
                                    "score": 0,
                                    "created_utc": 1673818980.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Maybe it’s a love language thing? \n\nSome peoples love language is gifts and physical touch they would be to the moon if someone treated them like that in exchange for quality time. But if your SB was into sugaring not because it’s how she feels loved and appreciated but just because “who would say no to luxuries and career advancements” then I can see how after a while maybe the interest starts to wane… especially after she’s gotten what she wants and vice versa. Alternatively, she might have been making efforts to show appreciation in a love language you didn’t receive? \n\nIn any case, it’s pretty poor form to disappear last minute like that… actually it’s just plain disrespectful. Don’t take it personally though and keep looking!!! I’m sure you’ll find someone who can genuinely appreciate what you’re giving. \n\nThere was this social experiment there was this world renowned violinist who played in a subway station for an hour and made $xx… that same night he was performing at a sold out concert where every ticket went for $xxx. Sometimes you ain’t doing anything wrong… keeping the right boundaries and not wasting your talent on deaf ears is key imo.",
            "author": "b_n008",
            "id": "j45dvje",
            "parent_id": "t3_10adwbu",
            "score": 3,
            "created_utc": 1673594982.0,
            "replies": [
                {
                    "body": "I see you may have posted a number which is most likely an amount in relations to an arrangement. If this is the case, you are violating Rule #4 - \"No dollar amounts that are in reference to allowance/PPM are allowed.\"\n\nIf you are curious about Allowances reported by SLF contributors please see the [Allowance Master Thread 2021-2022](/r/sugarlifestyleforum/comments/pc22tk/allowance_master_thread_20212022/).\n\nYour post will not be approved until you remove the amount.  Please read the sub [Rules](/r/sugarlifestyleforum/comments/748zta/updated_and_clarified_rules_for_slf/) prior to posting anything else. \n\nIf you simply posted a number not referencing a monetary amount, please message the MODs to approve your post.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/sugarlifestyleforum) if you have any questions or concerns.*",
                    "author": "AutoModerator",
                    "id": "j45dvkf",
                    "parent_id": "t1_j45dvje",
                    "score": 0,
                    "created_utc": 1673594982.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Hey man sorry. She just wasn’t into it. There’s no way for us to know what she was really thinking but it certainly sounds like you were generous. Sometimes you can’t buy affection when it isn’t there.",
            "author": "daddoms",
            "id": "j4498op",
            "parent_id": "t3_10adwbu",
            "score": 4,
            "created_utc": 1673573754.0,
            "replies": [
                {
                    "body": "We had a discussion over the holidays. She’s had some stuff going on in her life and she said to me that she realizes that she had been flaky but normally she’s not like that, she’s very reliable, and she really wants to make it work. We had one nice trip. Then this - after I gave her January allowance, paid her phone bill, and paid for a high end beauty treatment.",
                    "author": "Psychological_Sun374",
                    "id": "j459bmw",
                    "parent_id": "t1_j4498op",
                    "score": 1,
                    "created_utc": 1673591793.0,
                    "replies": [
                        {
                            "body": "Yeah that’s par for the course. She just wasn’t into it and led you on. Probably the lesson is not to put too much mental energy in until the flakiness improves.",
                            "author": "daddoms",
                            "id": "j46emx1",
                            "parent_id": "t1_j459bmw",
                            "score": 3,
                            "created_utc": 1673619430.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "My controversial but standard advice is date multiple SBs at once and let them know you are doing this. Makes you worry less which paradoxical makes you more attractive. Also means it is not as big a deal if one happens to bail on a trip. You just change the name on the reservation:)",
            "author": "TastySugarBite",
            "id": "j43qy3c",
            "parent_id": "t3_10adwbu",
            "score": 5,
            "created_utc": 1673566099.0,
            "replies": [
                {
                    "body": "She knew I was dating other women. And changing plane tickets it turns out are not so easy. And there are very few career women who can travel internationally on 24 hours notice.",
                    "author": "Psychological_Sun374",
                    "id": "j43rif1",
                    "parent_id": "t1_j43qy3c",
                    "score": 7,
                    "created_utc": 1673566333.0,
                    "replies": []
                },
                {
                    "body": "I wish I had the time for that",
                    "author": "MarzipanInevitable79",
                    "id": "j43s4f2",
                    "parent_id": "t1_j43qy3c",
                    "score": 3,
                    "created_utc": 1673566581.0,
                    "replies": [
                        {
                            "body": "Wish I had the time - and sanity - for that.",
                            "author": "quietgrey1",
                            "id": "j43xdus",
                            "parent_id": "t1_j43s4f2",
                            "score": 3,
                            "created_utc": 1673568733.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Even in vanilla dating, the people we want, the people we say are \"our types\", disregarding the rest of the population, end up being a major disappointment...\n\nCommunicate from the beginning what you're looking for in the next pot...If they don't seem to be exactly that, let them go. Don't think they'll change. Don't hope they'll change. Move on to the next one...And we never know, it might be something you're doing as well. I would suggest you search for an Ex SB, the one that would be comfortable giving you positive & negative feedback. Coz l can't tell you to ask your publicist for an honest opinion about yourself, you might end up firing him...Most people can't handle the truth...So ask someone who has nothing to gain or lose...",
            "author": "Elixier_55555",
            "id": "j44xxt6",
            "parent_id": "t3_10adwbu",
            "score": 2,
            "created_utc": 1673585135.0,
            "replies": [
                {
                    "body": "I know what I’m doing wrong - not asserting my boundaries early enough. I tend to give people too many chances",
                    "author": "Psychological_Sun374",
                    "id": "j45aizh",
                    "parent_id": "t1_j44xxt6",
                    "score": 3,
                    "created_utc": 1673592608.0,
                    "replies": [
                        {
                            "body": "I feel that so much. It's probably one of my greatest weaknesses. Each time I tell myself, \"boundaries...\" and I put them up then they seem to melt away all too quickly and I give too many chances which, of course, they take advantage of. Probably the biggest thing about myself I continue to work on.",
                            "author": "DrivingForward10",
                            "id": "j46ui62",
                            "parent_id": "t1_j45aizh",
                            "score": 1,
                            "created_utc": 1673625759.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Not a SB or even in the community. Just curious about the lifestyle overall. \n\nI wonder if this lifestyle attracts certain kinds of people? I think if you’re someone young who only knows this type of arrangement, then maybe you assume there’s a ton of men willing to do what you did? \n\nI could be wrong. And I’m assuming you’ve had a lot of SB. But I am curious if the average woman would act the same way who has never done it before vs women who regularly engage with SD so it’s kind of a “on to the next one” kind of mindset?\n\nThat said. In vanilla relationships, women usually ghost because things have gone horribly wrong and she’s not mature or doesn’t feel safe enough to voice why. That’s a red flag for me personally, as I’ve never gotten ghosted by someone I was regularly seeing.",
            "author": null,
            "id": "j46qwdr",
            "parent_id": "t3_10adwbu",
            "score": 2,
            "created_utc": 1673624390.0,
            "replies": [
                {
                    "body": "In her case, it was more flake than ghost.",
                    "author": "Psychological_Sun374",
                    "id": "j46rgqm",
                    "parent_id": "t1_j46qwdr",
                    "score": 1,
                    "created_utc": 1673624610.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Even in a SD/SB role, for the relationship to be ongoing, there needs to be mutual attraction and interest. Just like normal dating.... If something doesn't click for the relationship, people move on or find someone else. This is more likely what happened, she either decided you weren't right for her or someone else came into the picture and she opted for them, so don't look at it from only your side, consider what she might have had going on as well.\n\nShe might have met someone her own age that was interested in marriage and kids and chose that option. Yes, she could have had the courtesy of telling you this, but maybe she really liked you and it was easier to just cut and run, instead of  trying to explain it to you. \n\nAnyway, it's probably not that she just ghosted you. My point is she found some reason the relationship wasn't working or she found someone else. Even normal relationships and marriages end like this every day, so just keep looking. Don't give up!",
            "author": "jimmysax99",
            "id": "j474j62",
            "parent_id": "t3_10adwbu",
            "score": 2,
            "created_utc": 1673629494.0,
            "replies": [
                {
                    "body": "She doesn’t want marriage, she doesn’t want kids. She flaked vs full on ghost. She wanted me to find out at the airport whether or not she would join me on the trip.",
                    "author": "Psychological_Sun374",
                    "id": "j478lnw",
                    "parent_id": "t1_j474j62",
                    "score": 0,
                    "created_utc": 1673630965.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "If you had been spending time with her and she ghosted right before a trip you had planned, it is something you are doing. From the comment about your publicist, and this post, it sounds like you enjoy emotionally dumping on others. You most likely made her feel uncomfortable and obligated, which isn’t what sugar is about. Maybe try seeking a professional therapist before continuing to date without good results. You make yourself sound perfect in this post, but nobody is, so chances are you are telling a very one-sided version of this story. Please, regale us  with the tale of why you deleted your profile. I’m sure that one is a doozy.",
            "author": "ComprehensiveCrab570",
            "id": "j45xm43",
            "parent_id": "t3_10adwbu",
            "score": 2,
            "created_utc": 1673610352.0,
            "replies": [
                {
                    "body": "If there was an award for the absolute worst first post on this sub, this would be an easy finalist.  Wow.",
                    "author": "MrBuzzard",
                    "id": "j46d9ci",
                    "parent_id": "t1_j45xm43",
                    "score": 1,
                    "created_utc": 1673618824.0,
                    "replies": []
                },
                {
                    "body": "Well, you sound nice",
                    "author": "Psychological_Sun374",
                    "id": "j45zqif",
                    "parent_id": "t1_j45xm43",
                    "score": 0,
                    "created_utc": 1673611732.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Attraction is a real thing. I’m not sure if this is the situation with OP but I have been here before. They can be great, funny, extremely generous, caring.. whatever.. but if there is zero physical attraction, you’re never going to be excited about this person let alone enough to want to text/talk all the time. At least from my experience.",
            "author": "mousey55",
            "id": "j44csx8",
            "parent_id": "t3_10adwbu",
            "score": 2,
            "created_utc": 1673575306.0,
            "replies": [
                {
                    "body": "She said she was both attracted to older men and me in particular. Physically how do I put this? Some of her responses would be difficult to fake",
                    "author": "Psychological_Sun374",
                    "id": "j459ly9",
                    "parent_id": "t1_j44csx8",
                    "score": 0,
                    "created_utc": 1673591984.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "To be fair, this is the reason I took about a year off from sugar dating. I found that I needed a cleanse to let me refresh my mind and maybe take in early warning signs. \n\nI don't know about you but for me personally not talking/stopping talking in the middle of a conversation is a massive red flag. We all know shit happens but i would expect that if the shit does happen you at least let me know what's happening. \n\nI don't expect to be THE most important thing in my SB life but I expect to be at least somewhat important as they are to me.",
            "author": "midasza",
            "id": "j457kd0",
            "parent_id": "t3_10adwbu",
            "score": 2,
            "created_utc": 1673590637.0,
            "replies": [
                {
                    "body": "Yeah lesson learned. I deleted my profile in the fall",
                    "author": "Psychological_Sun374",
                    "id": "j45b9dm",
                    "parent_id": "t1_j457kd0",
                    "score": 1,
                    "created_utc": 1673593111.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "The most common SR is an exchange of money and perks for GFE++ sex. It seems the experience you're seeking is savior Supreme aka Pretty Woman package.  You want the SB to be so grateful for the things you do that she can't believe her fortune in landing the total package who has such \"low\" expectations. You should ask your publicist/therapist how that implicit need for expressed gratitude colors your other relationships. I'd recommend seeking an arrangement in a different country where your gift of resources will garner the undying adulation of a lucky young woman and her two cousins.\n\nSarcasm aside, from one tired SD to another. We're paying for people to like us and make us feel love. But the hooter girl doesn't really like you no matter how much you tip, remember her birthday or get her favorite band to play her favorite song. \n\nIt's just business.",
            "author": "akbbgtc",
            "id": "j45ttt6",
            "parent_id": "t3_10adwbu",
            "score": 2,
            "created_utc": 1673607593.0,
            "replies": [
                {
                    "body": "Actually, I was just looking for her to show up for dates and return messages. But this apparently was too high an expectation.",
                    "author": "Psychological_Sun374",
                    "id": "j45wboa",
                    "parent_id": "t1_j45ttt6",
                    "score": 2,
                    "created_utc": 1673609455.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I’m sorry that’s super sucky. Especially right before a trip. It sounds like you really were a positive force in her life. Unfortunately some people have no ability to appreciate good things. We all have to meet some not great people on our way to great people. That will make you appreciate your good fortune even more when you do find it. \n\nIf it’s an option I would take the trip and meet some beautiful women 🤷🏼‍♀️",
            "author": "Empressofthemall",
            "id": "j43r3ob",
            "parent_id": "t3_10adwbu",
            "score": 1,
            "created_utc": 1673566163.0,
            "replies": [
                {
                    "body": "I’m making the trip anyway. It is unfortunately for me essentially a gathering of ultra wealthy, middle-aged men with a few women thrown in. So not really a great hunting ground for me dating wise, although certainly good networking",
                    "author": "Psychological_Sun374",
                    "id": "j43roiz",
                    "parent_id": "t1_j43r3ob",
                    "score": 3,
                    "created_utc": 1673566402.0,
                    "replies": [
                        {
                            "body": "I am with you brother, similar thing happened to me in August last year when I planned a Euro tour. I have been struggling to find a decent loyal and reliable match too. It seems like I needed to up my game in screening for Gold diggers. For me it seems like they found some better ways to blend in and pretend to be genuine. That is over and above trying to avoid the scammers and people thinking they are now SB's not understanding how this works, so they believe that we are just ATM machines.",
                            "author": "AnthonyEdwards_",
                            "id": "j455dsg",
                            "parent_id": "t1_j43roiz",
                            "score": 1,
                            "created_utc": 1673589273.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Where do I find you 😭 \n\nWhen you mention you didn’t feel appreciated, have you tried to mention what your love languages are and how you would like to be cared for?",
            "author": "Siren_eyes256",
            "id": "j43rnlb",
            "parent_id": "t3_10adwbu",
            "score": 2,
            "created_utc": 1673566391.0,
            "replies": [
                {
                    "body": "Absolutely. We had multiple conversations. I was not really asking for that much. Ironically, in her professional work, she has to be super reliable and responsive in order to do her job for as long as she has. Somehow she seems unable to bring that skill set to dating.",
                    "author": "Psychological_Sun374",
                    "id": "j43s4mt",
                    "parent_id": "t1_j43rnlb",
                    "score": 3,
                    "created_utc": 1673566583.0,
                    "replies": [
                        {
                            "body": "I knew something sounded familiar. You were dating my wife. 😂",
                            "author": "quietgrey1",
                            "id": "j43y3kt",
                            "parent_id": "t1_j43s4mt",
                            "score": 5,
                            "created_utc": 1673569029.0,
                            "replies": [
                                {
                                    "body": "😂",
                                    "author": "Psychological_Sun374",
                                    "id": "j442iws",
                                    "parent_id": "t1_j43y3kt",
                                    "score": 2,
                                    "created_utc": 1673570861.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "Oh :( She might be more avoidant and closed off in relationships compared to how she is at work. Regardless, that’s not a good feeling if she’s capable of being reliable and responsive but wouldn’t give you the same energy.",
                            "author": "Siren_eyes256",
                            "id": "j43tpmt",
                            "parent_id": "t1_j43s4mt",
                            "score": 2,
                            "created_utc": 1673567230.0,
                            "replies": [
                                {
                                    "body": "She actually said to me that she is able to text reliably to people that are important to her. And then she said she was going to make an effort with me. And the results were not great.",
                                    "author": "Psychological_Sun374",
                                    "id": "j43tx43",
                                    "parent_id": "t1_j43tpmt",
                                    "score": 2,
                                    "created_utc": 1673567314.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "Im very much like that as well. Work life is on point but cant retain that level of focus 24/7 😅",
                            "author": "Upper-District-50",
                            "id": "j44ay1c",
                            "parent_id": "t1_j43s4mt",
                            "score": 2,
                            "created_utc": 1673574499.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Jeez where do I find one of you?!? Even the ones that have propositioned me from this forum have been all talk",
            "author": "onethirtyone131",
            "id": "j44nyd5",
            "parent_id": "t3_10adwbu",
            "score": 2,
            "created_utc": 1673580213.0,
            "replies": [
                {
                    "body": "We’re out there. Just being reliable and making & keeping dates will make you stand out from 80% of SBs",
                    "author": "Psychological_Sun374",
                    "id": "j45a6by",
                    "parent_id": "t1_j44nyd5",
                    "score": 2,
                    "created_utc": 1673592367.0,
                    "replies": []
                },
                {
                    "body": "All talk for real. \n\n\nOr johns.",
                    "author": "chiquitabrilliant",
                    "id": "j452205",
                    "parent_id": "t1_j44nyd5",
                    "score": 3,
                    "created_utc": 1673587375.0,
                    "replies": [
                        {
                            "body": "Oh absolutely 🤣🤣",
                            "author": "onethirtyone131",
                            "id": "j452827",
                            "parent_id": "t1_j452205",
                            "score": 0,
                            "created_utc": 1673587466.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "She was not into you like that.\n\nWhat type of appreciation were you expecting? \n\nAnd why do you have to list all the things you have done for her and the money/gifts you have given her?  Was this a financial burden for you?",
            "author": "GiftcardSB",
            "id": "j44zldl",
            "parent_id": "t3_10adwbu",
            "score": 2,
            "created_utc": 1673586023.0,
            "replies": [
                {
                    "body": "Because the SBs in this forum talk about how men don’t do these things for them. I didn’t even list everything, but was just giving a sense. \n\nThe appreciation I was expecting was actually being able to make and keep plans.",
                    "author": "Psychological_Sun374",
                    "id": "j45b20a",
                    "parent_id": "t1_j44zldl",
                    "score": 4,
                    "created_utc": 1673592968.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "most of us are not a match for each other. small observations over the first handful of interactions are enough to how me if something will go the distance. it seems like she failed time and again. best of luck with your future POTs",
            "author": "ValueFuck",
            "id": "j478yzk",
            "parent_id": "t3_10adwbu",
            "score": 1,
            "created_utc": 1673631101.0,
            "replies": []
        },
        {
            "body": "Well this is kind of weird. One or two people are (seemingly arbitrarily) down voting a lot of posts in this thread. Normally I don't care much about the Reddit ~~dogma~~ ~~catma~~ karma feature, it's the pattern that caught my eye. My inexplicably ardent fans, please do NOT upvote this boring post (if you are tempted to for some reason). Also sorry if it isn't considered proper to discuss \"karma\" issues.",
            "author": "highfructoseSD",
            "id": "j698m8a",
            "parent_id": "t3_10adwbu",
            "score": 1,
            "created_utc": 1674927582.0,
            "replies": []
        },
        {
            "body": "OP - I totally understand how it happened - we sometimes have to relearn the lessons we forgot \n\nI have been accused of being too cynical but it has protected me well - from ppl who never cared for me in decades suddenly hitting me up for opportunities at high school reunions to SBs dangling the carrot in front of you but always moving the goalpost\n\nin one case it was someone I helped transition from a back office role to an investment management role using my connections and inside track coaching, and she suddenly became a lot more “unavailable” unrelated to her work schedule\n\nMy principle that I too had to relearn time and again - is simple - reciprocate generously towards those who show it with their actions. \n\nBut don’t hesitate to quickly cut off and avoid those playing stupid games even as adults - there is plenty of daylight between being tolerant every now and then and being treated like a doormat or being taken for a ride",
            "author": "OCbird22",
            "id": "j44b38p",
            "parent_id": "t3_10adwbu",
            "score": 1,
            "created_utc": 1673574563.0,
            "replies": [
                {
                    "body": "Yeah in this instance I’ve reached my tolerance",
                    "author": "Psychological_Sun374",
                    "id": "j459j8i",
                    "parent_id": "t1_j44b38p",
                    "score": 1,
                    "created_utc": 1673591934.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I think there’s a lack of chemistry she had with you. \n\nMy current SD is very kind, thoughtful, took me to a luxury trip for my birthday, bought me a shitload of stuff I wanted for Christmas. \n\nBut dear god, the chemistry I once had for this man disappeared… thus, my prioritization for him also went. I was late to our dates, my mood was never happy around him. I, too, kept telling him that I’ll get better. Granted, it was his own fault that the chemistry left.. if you knew the immature ways he would tell me he wanted sex, it made me gag and feel like an object.",
            "author": "CatLadyAmy1",
            "id": "j45f0vw",
            "parent_id": "t3_10adwbu",
            "score": 1,
            "created_utc": 1673595828.0,
            "replies": [
                {
                    "body": "I don’t think chemistry was the issue. I think her life is a mess and she can’t get out of her own way to clean it up.",
                    "author": "Psychological_Sun374",
                    "id": "j45fb5x",
                    "parent_id": "t1_j45f0vw",
                    "score": 0,
                    "created_utc": 1673596039.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Don't you have a brother or a cousin like you? 😂😂",
            "author": "Old_Control_8164",
            "id": "j45hc1c",
            "parent_id": "t3_10adwbu",
            "score": 1,
            "created_utc": 1673597565.0,
            "replies": [
                {
                    "body": "Haha brother is married. I’m the financially successful one in the family - everyone else went into public service or nonprofit.",
                    "author": "Psychological_Sun374",
                    "id": "j45hgnc",
                    "parent_id": "t1_j45hc1c",
                    "score": 2,
                    "created_utc": 1673597663.0,
                    "replies": [
                        {
                            "body": "Just joking....",
                            "author": "Old_Control_8164",
                            "id": "j45hl7c",
                            "parent_id": "t1_j45hgnc",
                            "score": 1,
                            "created_utc": 1673597762.0,
                            "replies": []
                        },
                        {
                            "body": "I'm sorry that you were not appreciated. this sucks in everyday life too, especially in sugarlife.",
                            "author": "Old_Control_8164",
                            "id": "j45htfd",
                            "parent_id": "t1_j45hgnc",
                            "score": 0,
                            "created_utc": 1673597938.0,
                            "replies": [
                                {
                                    "body": "Thanks. Yes, I’ve been under appreciated in vanilla dating too. This is definitely a “me” problem",
                                    "author": "Psychological_Sun374",
                                    "id": "j45hyag",
                                    "parent_id": "t1_j45htfd",
                                    "score": 1,
                                    "created_utc": 1673598042.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I’m sorry you feel like you need to throw in the towel. You are a rare find! It’s hard to believe an opportunity for a relationship like that would be squandered! Keep your head up :)",
            "author": "SunnyHoney_420",
            "id": "j45o8k1",
            "parent_id": "t3_10adwbu",
            "score": 1,
            "created_utc": 1673603099.0,
            "replies": [
                {
                    "body": "I think she just isn’t ready for a relationship. Or maybe not one with me 🤷🏻",
                    "author": "Psychological_Sun374",
                    "id": "j45xg6z",
                    "parent_id": "t1_j45o8k1",
                    "score": 1,
                    "created_utc": 1673610240.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I feel you here, and agree that you should look for evidence of loyalty and love over words. \n\nToday is the 2 year anniversery of my last real SB.  She was an intelligent, strong willed, kick ass woman.  I saw so much potential in her life that I would have supported her goals till I died.  Alas, the only good she did for me was in her own mind.  I never felt that good, no matter how much she told me it existed.  The last day we were together, I showed up early at her place to pick her up to go tubing. In a paniced voice, she refused to open up the door, saying that I had to leave at once.  I left, and took a walk in the woods drinking a cup of delicious coffee.  On the way home from tubing, she broke up with me complaining that I complained too much.  \n\nShe later said that she wouldnt open the door cause she didnt want me to be upset about her having bought new furniture.  Whatever 🙄.\n\nNo matter how into her I was, she had never been into me.  She lied about so very many things.  My subconscious knew this, wouldnt allow my mind to rest which was reflected in my mood and attitude.\n\nAs the final proof of the reality of our relationship, she disrespected me by stealing $2,500 out of my account, cause, \"I owed her.\"  I shit you not, at the moment that I had found out, my finger had been hovering over the send money button, because I wanted to prevent her from experiencing any discomfort.",
            "author": "GautiousCur",
            "id": "j47ke94",
            "parent_id": "t3_10adwbu",
            "score": 1,
            "created_utc": 1673635270.0,
            "replies": []
        },
        {
            "body": "Well, I have the opposite issue. I feel you, because I am really seeking someone who treat me. Like you did to her.",
            "author": null,
            "id": "j484y59",
            "parent_id": "t3_10adwbu",
            "score": 1,
            "created_utc": 1673642893.0,
            "replies": [
                {
                    "body": "Thank you!",
                    "author": "Psychological_Sun374",
                    "id": "j48r849",
                    "parent_id": "t1_j484y59",
                    "score": 0,
                    "created_utc": 1673651495.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Sorry that you had to go through this, you seem super thoughtful. It sucks that she wasn’t grateful for you going above and beyond for her. Best of luck for your future search, hope you can find someone compatible moving forward if you decide to look for another SR!",
            "author": "throwawaysugargirlx",
            "id": "j4kl7zi",
            "parent_id": "t3_10adwbu",
            "score": 1,
            "created_utc": 1673866317.0,
            "replies": [
                {
                    "body": "There’s also the evolving money thing. \n\nAfter this last experience I was feeling pretty burned about just throwing cash around, so tried suggesting to a POT a $xx,xxx three day trip, but with 80% in high end shoes (because she likes shoes) and a more modest cash allowance, plus she wouldn’t have to miss work. \n\nShe said she was ‘shocked’ at how low the allowance was, and that high x,xxx in gifts on a first setup was ‘just what she’s used to even in vanilla’ and ‘doesn’t count’ when thinking about allowance. \n\nOh well. I’m clearly not cut out for what really seems to be a money-for-sex game. I need to put my energy elsewhere.",
                    "author": "Psychological_Sun374",
                    "id": "j4la0ja",
                    "parent_id": "t1_j4kl7zi",
                    "score": -1,
                    "created_utc": 1673880966.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "As much as complaining for sbs about salt/Splenda or whatnot , whenever they get the real deal from sds it seems they never appreciate it. There's always exceptions but that's been the case with my current one.\n\nLike yeah we are providing sugar but real sugar will always be the commodity. There's lot more hot sbs than sds in a real sense of the word. \n\nYou had a bad experience and honestly I don't know what more she wants, might have found a different sd.\n\nHope this experience won't make you bitter towards sbs.",
            "author": "MarzipanInevitable79",
            "id": "j43rq1s",
            "parent_id": "t3_10adwbu",
            "score": 0,
            "created_utc": 1673566419.0,
            "replies": [
                {
                    "body": "It makes me question the fundamental equation. I’m pretty sure at the moment she doesn’t have another guy, I don’t know if it’s drugs, depression, or she’s just narcissistic, uncaring and disrespectful. At this point, it doesn’t really matter, she doesn’t treat me well.",
                    "author": "Psychological_Sun374",
                    "id": "j43ry5i",
                    "parent_id": "t1_j43rq1s",
                    "score": 3,
                    "created_utc": 1673566510.0,
                    "replies": [
                        {
                            "body": "You're right but whatever it is she should have at least text you. But another brick in the wall  I guess",
                            "author": "MarzipanInevitable79",
                            "id": "j43stip",
                            "parent_id": "t1_j43ry5i",
                            "score": 2,
                            "created_utc": 1673566864.0,
                            "replies": [
                                {
                                    "body": "She eventually texted me after 24 hours, and said she was dealing with something, she did not say what, and she would let me know about whether or not she could come. Our flight is in eight hours. So at that point I’m done. I don’t need to be sitting there at the airport wondering if she’s going to show up or not",
                                    "author": "Psychological_Sun374",
                                    "id": "j43szxb",
                                    "parent_id": "t1_j43stip",
                                    "score": 3,
                                    "created_utc": 1673566938.0,
                                    "replies": [
                                        {
                                            "body": "Well she might have a good excuse if it's the only red flag but if it adds on on previous problems then you got to next her.",
                                            "author": "MarzipanInevitable79",
                                            "id": "j43tbd1",
                                            "parent_id": "t1_j43szxb",
                                            "score": 2,
                                            "created_utc": 1673567068.0,
                                            "replies": [
                                                {
                                                    "body": "This is the straw that broke the camels back. We had a whole series of problems that I’ve talked to her about and she claimed she was going to fix and then didn’t fix.",
                                                    "author": "Psychological_Sun374",
                                                    "id": "j43tlty",
                                                    "parent_id": "t1_j43tbd1",
                                                    "score": 3,
                                                    "created_utc": 1673567187.0,
                                                    "replies": [
                                                        {
                                                            "body": "I'm sure you are on the flight already, but get it, she isn't worth your time, which frankly is more valuable to you than your money. At least that's the way I have felt about it when in this kind of situation.",
                                                            "author": "TheMistressMan",
                                                            "id": "j4572fa",
                                                            "parent_id": "t1_j43tlty",
                                                            "score": 1,
                                                            "created_utc": 1673590313.0,
                                                            "replies": [
                                                                {
                                                                    "body": "En route to airport!",
                                                                    "author": "Psychological_Sun374",
                                                                    "id": "j45b4uy",
                                                                    "parent_id": "t1_j4572fa",
                                                                    "score": 2,
                                                                    "created_utc": 1673593024.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "Bon voyage",
                                                                            "author": "AleksiaE",
                                                                            "id": "j45bpfq",
                                                                            "parent_id": "t1_j45b4uy",
                                                                            "score": 1,
                                                                            "created_utc": 1673593422.0,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "OP, good or bad, f_ck it, we're all internet strangers. \n\nDon't worry about creating alts. \n\nI agree with the other poster who said you're giving up the farm too quick. \n\nYou said you were through several women in the span of 5 months. \n\nThat means you hardly knew this woman. \n\nBe generous OP and mentor but maybe hold back a bit before you do big trips, 1000 phones, luxury hotels...",
            "author": "DarkEyes87",
            "id": "j43xk0c",
            "parent_id": "t3_10adwbu",
            "score": 0,
            "created_utc": 1673568805.0,
            "replies": [
                {
                    "body": "I see you may have posted a number which is most likely an amount in relations to an arrangement. If this is the case, you are violating Rule #4 - \"No dollar amounts that are in reference to allowance/PPM are allowed.\"\n\nIf you are curious about Allowances reported by SLF contributors please see the [Allowance Master Thread 2021-2022](/r/sugarlifestyleforum/comments/pc22tk/allowance_master_thread_20212022/).\n\nYour post will not be approved until you remove the amount.  Please read the sub [Rules](/r/sugarlifestyleforum/comments/748zta/updated_and_clarified_rules_for_slf/) prior to posting anything else. \n\nIf you simply posted a number not referencing a monetary amount, please message the MODs to approve your post.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/sugarlifestyleforum) if you have any questions or concerns.*",
                    "author": "AutoModerator",
                    "id": "j43xk1z",
                    "parent_id": "t1_j43xk0c",
                    "score": 0,
                    "created_utc": 1673568805.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Sorry this happened, man.\n\nGratitude comes from those you least expect. In the sugar world, when I have gone above and beyond expectations, I have met often underwhelming response, perhaps because those are the times we most expect a positive response.\n\nI am actually grappling with a similar l situation (smaller in scale as the relationship is semi-new). I am resigned that I lost money on various paid-up activities. I will be more careful next time.",
            "author": "NaturalNo7512",
            "id": "j447h0t",
            "parent_id": "t3_10adwbu",
            "score": 0,
            "created_utc": 1673572980.0,
            "replies": [
                {
                    "body": "Fortunately my travel status means the air tickets are largely refundable. I think I’m more annoyed with myself that I gave this woman so much headspace.",
                    "author": "Psychological_Sun374",
                    "id": "j4595xx",
                    "parent_id": "t1_j447h0t",
                    "score": 1,
                    "created_utc": 1673591690.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I’ll be your girlfriend",
            "author": null,
            "id": "j44quez",
            "parent_id": "t3_10adwbu",
            "score": 0,
            "created_utc": 1673581575.0,
            "replies": [
                {
                    "body": "😂 done",
                    "author": "Psychological_Sun374",
                    "id": "j45ad5e",
                    "parent_id": "t1_j44quez",
                    "score": 2,
                    "created_utc": 1673592496.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Wow, you sound like an amazing SD. I wish they were like you in Aus 😳",
            "author": null,
            "id": "j457o9e",
            "parent_id": "t3_10adwbu",
            "score": 0,
            "created_utc": 1673590707.0,
            "replies": [
                {
                    "body": "I’m sure they are there! I actually had a nice thing going with a wonderful Australian woman, but then she went back down under. She seem to feel that the scene there was good for her.",
                    "author": "Psychological_Sun374",
                    "id": "j45bb6h",
                    "parent_id": "t1_j457o9e",
                    "score": 1,
                    "created_utc": 1673593146.0,
                    "replies": [
                        {
                            "body": "There are people like OP in Aus. I am one of those people. I do a lot for my sb in terms of supporting her financially, emotionally and physically even in situations where she doesn't ask for it but in a lot of cases all of it has really been one way and not appreciated. I've only had one sb buy me something for my bday the whole time I've been doing this 😄",
                            "author": "WanderLustandBeyond",
                            "id": "j47unnn",
                            "parent_id": "t1_j45bb6h",
                            "score": 2,
                            "created_utc": 1673639069.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "j459u7c",
            "parent_id": "t3_10adwbu",
            "score": 0,
            "created_utc": 1673592139.0,
            "replies": [
                {
                    "body": "I figured 5 months was taking it slow",
                    "author": "Psychological_Sun374",
                    "id": "j45beiq",
                    "parent_id": "t1_j459u7c",
                    "score": 1,
                    "created_utc": 1673593210.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "j45bw77",
                            "parent_id": "t1_j45beiq",
                            "score": 1,
                            "created_utc": 1673593556.0,
                            "replies": [
                                {
                                    "body": "Extenuating circumstances, then we talked about it, and then her behavior did not match her words",
                                    "author": "Psychological_Sun374",
                                    "id": "j45cjq7",
                                    "parent_id": "t1_j45bw77",
                                    "score": 1,
                                    "created_utc": 1673594020.0,
                                    "replies": [
                                        {
                                            "body": "[deleted]",
                                            "author": null,
                                            "id": "j45d9uk",
                                            "parent_id": "t1_j45cjq7",
                                            "score": 0,
                                            "created_utc": 1673594540.0,
                                            "replies": [
                                                {
                                                    "body": "Fer sure",
                                                    "author": "Psychological_Sun374",
                                                    "id": "j45el17",
                                                    "parent_id": "t1_j45d9uk",
                                                    "score": 1,
                                                    "created_utc": 1673595504.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "You must realize most SBs these days have multiple SDs. The reliability and consistency you're wanting will be hard to find unless you get one that's truly just with you",
            "author": "Obj3ctivePerspective",
            "id": "j45wzqi",
            "parent_id": "t3_10adwbu",
            "score": 0,
            "created_utc": 1673609927.0,
            "replies": [
                {
                    "body": "Given the schedule we’ve had it would be tough for her to pull that off but possible I suppose.\n\nAnd another sign that maybe an SR isn’t what I’m looking for. I don’t mind nonexclusive, I do mind flakiness",
                    "author": "Psychological_Sun374",
                    "id": "j45xjli",
                    "parent_id": "t1_j45wzqi",
                    "score": 1,
                    "created_utc": 1673610304.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Sorry to hear, mate. Best of luck next time.",
            "author": "DaSugar2020",
            "id": "j458pb4",
            "parent_id": "t3_10adwbu",
            "score": 0,
            "created_utc": 1673591376.0,
            "replies": [
                {
                    "body": "Thanks!",
                    "author": "Psychological_Sun374",
                    "id": "j45bizx",
                    "parent_id": "t1_j458pb4",
                    "score": 1,
                    "created_utc": 1673593298.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I’m sorry you’ve been having such a hard time finding the right SR for you. I’m in a similar boat and just trying to stay positive like you said has been keeping me going. Hopefully you meet the right woman for you.",
            "author": "MaryJanneexo",
            "id": "j45l80z",
            "parent_id": "t3_10adwbu",
            "score": 0,
            "created_utc": 1673600625.0,
            "replies": []
        },
        {
            "body": "You sound like an awesome SD. And it sounds like the latest SB was not only unappreciative,but somewhat stupid since she was one month short of debt relief and couldn't even do that.\n\nThe quality of sugar partners seems to be pretty low on both sides of the aisle.",
            "author": "GSSD",
            "id": "j46364v",
            "parent_id": "t3_10adwbu",
            "score": 0,
            "created_utc": 1673613786.0,
            "replies": [
                {
                    "body": "My problem is not that she has a life aside for me. My problem is her complete inability to communicate.",
                    "author": "Psychological_Sun374",
                    "id": "j4646nr",
                    "parent_id": "t1_j46364v",
                    "score": 1,
                    "created_utc": 1673614346.0,
                    "replies": [
                        {
                            "body": ">  complete inability to communicate.\n\nJust stupid I'm afraid.",
                            "author": "GSSD",
                            "id": "j466csl",
                            "parent_id": "t1_j4646nr",
                            "score": 0,
                            "created_utc": 1673615507.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "That is my dream SR.  I would always make sure he was appreciated and thought of. I would even give gifts to my SD to show how attentive and appreciated i felt for them. If the chemistry went bust, i would be honest and break it off. It is supposed to be a mutual beneficial relationship.\n\nI wish you luck on your search.",
            "author": "MsAngeliqueLuna",
            "id": "j466wpb",
            "parent_id": "t3_10adwbu",
            "score": 0,
            "created_utc": 1673615796.0,
            "replies": []
        },
        {
            "body": "Dating a success man in any aspect SR or vanilla, much like yourself, takes a certain kind of woman. In my opinion, she has to have open availability, flexibility, the mental space to compartmentalize and see you as a priority. 80% of women with careers, in my opinion just don’t have those privileges. Career women are busy—mentally and physically. They have deadlines to meet and ladders to climb. \nI had the opportunity of an experience like this before. Being available for work trips; especially last minute international ones, are no joke. I did it for 2 years, but I had a job I had the privilege of quitting. Career women don’t always have that privilege. \nYou probably need someone in their limbo stage 23-26. They’re done with college and have an hourly job. You seem like you mesh well professionally with a career woman. But the outcome you spoke of above is the possible trade off. A 23-26 might not be super well rounded professionally but she’d be teachable, available, flexible and has the mental capacity to place you at the forefront of her mind.",
            "author": "Babydoll120",
            "id": "j46kdxx",
            "parent_id": "t3_10adwbu",
            "score": 0,
            "created_utc": 1673621817.0,
            "replies": [
                {
                    "body": "In the case of this woman, her career is Project based, and she’s between projects so she had time. We had planned this like a month in advance, it was her cancellation that was last minute.",
                    "author": "Psychological_Sun374",
                    "id": "j46o8qc",
                    "parent_id": "t1_j46kdxx",
                    "score": 0,
                    "created_utc": 1673623357.0,
                    "replies": [
                        {
                            "body": "You need someone that can place you at the forefront of their mind. Right up there with job, family and friends.",
                            "author": "Babydoll120",
                            "id": "j46p95v",
                            "parent_id": "t1_j46o8qc",
                            "score": 0,
                            "created_utc": 1673623749.0,
                            "replies": [
                                {
                                    "body": "Or just show up for plans",
                                    "author": "Psychological_Sun374",
                                    "id": "j46pfta",
                                    "parent_id": "t1_j46p95v",
                                    "score": 0,
                                    "created_utc": 1673623821.0,
                                    "replies": [
                                        {
                                            "body": "Yes, it’ll all fall right into place. After you take the time you need to heal, try it.",
                                            "author": "Babydoll120",
                                            "id": "j46q9mp",
                                            "parent_id": "t1_j46pfta",
                                            "score": 0,
                                            "created_utc": 1673624147.0,
                                            "replies": [
                                                {
                                                    "body": "thanks for your encouragement",
                                                    "author": "Psychological_Sun374",
                                                    "id": "j46qv9h",
                                                    "parent_id": "t1_j46q9mp",
                                                    "score": 0,
                                                    "created_utc": 1673624378.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": ">Like transformational for her career from the minor leagues to the major leagues.\n\nIt's very, very unlikely that a woman in sugar or vanilla will give back. I've yet to see it for myself or through discussions with other men.\n\nBe generous if you want to enjoy your time while it lasts but learn to accept that when it will be over it will be over.",
            "author": "JohnnyKemmer009",
            "id": "j4714ln",
            "parent_id": "t3_10adwbu",
            "score": 0,
            "created_utc": 1673628253.0,
            "replies": [
                {
                    "body": "It was easy for me to set up - and she’s going to miss out on it now because she can’t be bothered to demonstrate basic politeness",
                    "author": "Psychological_Sun374",
                    "id": "j474g42",
                    "parent_id": "t1_j4714ln",
                    "score": 1,
                    "created_utc": 1673629462.0,
                    "replies": [
                        {
                            "body": "Very unfortunate.\n\nPeople's basic nature comes out in the end, and I enjoy sussing it out as quickly as possible, for good or ill.\n\nIt will be tempting to enjoy the schadenfreude and keep tabs on her and follow up. But personally, I'd let it go and enjoy a new SB or time off.",
                            "author": "JohnnyKemmer009",
                            "id": "j4752mg",
                            "parent_id": "t1_j474g42",
                            "score": 0,
                            "created_utc": 1673629689.0,
                            "replies": [
                                {
                                    "body": "Not worth the brain damage",
                                    "author": "Psychological_Sun374",
                                    "id": "j4792a6",
                                    "parent_id": "t1_j4752mg",
                                    "score": 1,
                                    "created_utc": 1673631134.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "You need to be less selfless next time.",
            "author": "MGTOWManofMystery",
            "id": "j47wu9h",
            "parent_id": "t3_10adwbu",
            "score": 0,
            "created_utc": 1673639878.0,
            "replies": []
        },
        {
            "body": "I'm sorry you went through that. I hope you'll find a SB who can meet your needs 😊",
            "author": "matecitocaliente",
            "id": "j4hdr0s",
            "parent_id": "t3_10adwbu",
            "score": 0,
            "created_utc": 1673810005.0,
            "replies": [
                {
                    "body": "I don’t think I’m really cut out for it. It feels very checklist oriented, and mechanical and transactional.",
                    "author": "Psychological_Sun374",
                    "id": "j4hsq2a",
                    "parent_id": "t1_j4hdr0s",
                    "score": 0,
                    "created_utc": 1673815505.0,
                    "replies": [
                        {
                            "body": "It does. I guess it depends on what you are a looking fof and why you are doing it.\nI guess is a matter of finding the right match.",
                            "author": "matecitocaliente",
                            "id": "j4ibo5s",
                            "parent_id": "t1_j4hsq2a",
                            "score": 0,
                            "created_utc": 1673822670.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Sounds like you learned from this.  For the kind of scratch you put out there, the sex should have been on the order of you hearing the Tabernacle Choir singing from the rafters while your toes curl.  Sounds like if the sex were food, you wound up with ritz crackers instead of a five course meal.  Time to move on imho.  I have had similar hit and miss experiences in my SR’s.",
            "author": "Impossible-Heat9700",
            "id": "j44xaji",
            "parent_id": "t3_10adwbu",
            "score": -1,
            "created_utc": 1673584796.0,
            "replies": [
                {
                    "body": "I’m actually OK with B+ sex - that can improve over time - but last minute cancellations and disappearing for days at a time just don’t work for me",
                    "author": "Psychological_Sun374",
                    "id": "j45ag2l",
                    "parent_id": "t1_j44xaji",
                    "score": 3,
                    "created_utc": 1673592552.0,
                    "replies": [
                        {
                            "body": "Have you ever had B+ sex go to a solid A… long term as a permanent change?  I have not.  Short term, yes.  But not long term. I am very lucky in my current, long term SR.  My SB hits an A every time. 😎",
                            "author": "Impossible-Heat9700",
                            "id": "j4a4xc5",
                            "parent_id": "t1_j45ag2l",
                            "score": 1,
                            "created_utc": 1673675613.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "There is so much that I want to say.",
            "author": null,
            "id": "j45950h",
            "parent_id": "t3_10adwbu",
            "score": -1,
            "created_utc": 1673591673.0,
            "replies": [
                {
                    "body": "😂 let’s hear it",
                    "author": "Psychological_Sun374",
                    "id": "j45bfrm",
                    "parent_id": "t1_j45950h",
                    "score": 1,
                    "created_utc": 1673593234.0,
                    "replies": [
                        {
                            "body": "Haha let’s just sum it up to I would literally offer you my right lung to have someone like you in my life. \n\nI believe you just had bad luck or didn’t pick right but what you’re looking for is out there.",
                            "author": null,
                            "id": "j45cku3",
                            "parent_id": "t1_j45bfrm",
                            "score": 0,
                            "created_utc": 1673594042.0,
                            "replies": [
                                {
                                    "body": "Thanks! May you find your prince",
                                    "author": "Psychological_Sun374",
                                    "id": "j45dmva",
                                    "parent_id": "t1_j45cku3",
                                    "score": 2,
                                    "created_utc": 1673594804.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I have been searching for this kind of arrangement myself for a couple years now I wish I could have been as lucky as her and I hope I find something similar to this and I wish you luck as well.",
            "author": "Aggressive_Pop403",
            "id": "j45ztfs",
            "parent_id": "t3_10adwbu",
            "score": -1,
            "created_utc": 1673611782.0,
            "replies": [
                {
                    "body": "Sorry to hear and good luck. I hope you eventually find what you’re looking for.",
                    "author": "Psychological_Sun374",
                    "id": "j460b3p",
                    "parent_id": "t1_j45ztfs",
                    "score": 1,
                    "created_utc": 1673612095.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "You're expectations are too high. It's SBs we're talking about.\n\nMy advice is to invest less effort on the relationship part, it makes the SR imbalanced and disrupts the power dynamics.\n\nYou have to let them work for their rewards, if all the spoiling comes at no expense of effort, why would she work harder at satisfying you?\n\nSo be more passive, let her hit you up even. Reward good behavior, *but* punish bad ones (don't meet until the next week, be busy, stop texting, remain distant and passive). You gotta approach this from a position of power and strength, not like a little cat who wants milk. \n\nThe best way to do this is to date multiple SBs, because otherwise you'll get attached and she will exploit you and ruin the dynamics of the SR. \n\nYou're paying for this man, not the other way around.",
            "author": "sugardad123",
            "id": "j46jkim",
            "parent_id": "t3_10adwbu",
            "score": -1,
            "created_utc": 1673621494.0,
            "replies": []
        },
        {
            "body": "Me over here wishing I could find a SD that values me so I can show him I reciprocate! Too many just aren't built to care for others in the way they want to be cared for.",
            "author": "_borninathunderstorm",
            "id": "j49jgk0",
            "parent_id": "t3_10adwbu",
            "score": -1,
            "created_utc": 1673664065.0,
            "replies": [
                {
                    "body": "I think this is a problem with dating in general.",
                    "author": "Psychological_Sun374",
                    "id": "j4aedru",
                    "parent_id": "t1_j49jgk0",
                    "score": 0,
                    "created_utc": 1673682483.0,
                    "replies": [
                        {
                            "body": "Yea but I would think with an upfront arrangement it would be easier.",
                            "author": "_borninathunderstorm",
                            "id": "j4d1xji",
                            "parent_id": "t1_j4aedru",
                            "score": 3,
                            "created_utc": 1673731426.0,
                            "replies": [
                                {
                                    "body": "Good theory. Has not worked for me in practice.",
                                    "author": "Psychological_Sun374",
                                    "id": "j4d5ar4",
                                    "parent_id": "t1_j4d1xji",
                                    "score": -1,
                                    "created_utc": 1673732797.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Wow that must be demoralizing. If I was the SB I’d be super thankful, some people are just selfish no matter what 🤦🏻‍♀️",
            "author": "After_Bit8211",
            "id": "j49yl2r",
            "parent_id": "t3_10adwbu",
            "score": -1,
            "created_utc": 1673671823.0,
            "replies": [
                {
                    "body": "Thank you! I’ll get over it. I’m already over being annoyed about getting stood up on this trip.",
                    "author": "Psychological_Sun374",
                    "id": "j4aeba3",
                    "parent_id": "t1_j49yl2r",
                    "score": -1,
                    "created_utc": 1673682426.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I’ll love to be your SB. You’ll get a totally difference experience with me. Way better 😊\n\nInstagram: @glamdoll_patrika",
            "author": "BranchTimely4567",
            "id": "j4wu6yb",
            "parent_id": "t3_10adwbu",
            "score": -1,
            "created_utc": 1674073875.0,
            "replies": []
        },
        {
            "body": "there is a chad in the background and she is just using you for $$. this guy is about to marry her or they're getting serious in a relationship",
            "author": "vtec_tt",
            "id": "j454idk",
            "parent_id": "t3_10adwbu",
            "score": -2,
            "created_utc": 1673588764.0,
            "replies": [
                {
                    "body": "Could be. Or drugs, she’s in the entertainment industry",
                    "author": "Psychological_Sun374",
                    "id": "j45b2o7",
                    "parent_id": "t1_j454idk",
                    "score": 2,
                    "created_utc": 1673592982.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Try dating younger SBs. If you are 22 trying to pay your way through college you are going to be more appreciative than someone 30 with a career.",
            "author": "sirthunksalot",
            "id": "j45gwum",
            "parent_id": "t3_10adwbu",
            "score": -2,
            "created_utc": 1673597245.0,
            "replies": []
        },
        {
            "body": "Wish it were SDs like you in my area Sheesh ?",
            "author": "Euphoric-Beginning51",
            "id": "j46ws96",
            "parent_id": "t3_10adwbu",
            "score": 1,
            "created_utc": 1673626626.0,
            "replies": []
        },
        {
            "body": "Sorry bud.  It sucks when you realize you’re more into it than she is.  Dating older isn’t a guarantee either, my flakiest girl ever was in her 30s.  Not sure what learning you can gain from this, probably in the parts not written here.  Personally I don’t plan anything other than a simple weekend away with someone unless you are 100% solid.",
            "author": "RedHeavyG603",
            "id": "j46z444",
            "parent_id": "t3_10adwbu",
            "score": 1,
            "created_utc": 1673627506.0,
            "replies": []
        },
        {
            "body": "In my opinion, the great perks you were giving her as a SD should have been a reward, not an expectation. I know it sounds bad, but when people get things just for being, then they don’t appreciate it. If you have certain requirements for a SB, then that should be known from the beginning. If everything was going good, then she dipped, just charge it to the Sugar game. This modern version of sugar dating is not for the naive. Everybody wants something. If you’re giving, but not getting, that’s a huge L.",
            "author": "Quiet-Eggplant-6811",
            "id": "j47dhaj",
            "parent_id": "t3_10adwbu",
            "score": 1,
            "created_utc": 1673632737.0,
            "replies": []
        },
        {
            "body": "I read some advice once that it is best to be patient with SBs.  SBs are not as mature or established as you are and will generally be very flaky at the beginning.  If you stick with them through the flaky phase, you’ll be well rewarded with a great sugar experience.\n\nI have followed this advice and it’s really worked out well. I’ve been able to establish some really great sugar relationships.  I would focus on those who are more interested in the thrill of dating a more mature man than those who are just focusing on the $$$ bank.",
            "author": "Illustrious_Sea_4447",
            "id": "j48dpoi",
            "parent_id": "t3_10adwbu",
            "score": 1,
            "created_utc": 1673646175.0,
            "replies": [
                {
                    "body": "Yeah… after 5 months I think I’m at the end of my patience",
                    "author": "Psychological_Sun374",
                    "id": "j48qsr0",
                    "parent_id": "t1_j48dpoi",
                    "score": 1,
                    "created_utc": 1673651322.0,
                    "replies": [
                        {
                            "body": "Yes, the patience only works with the right person",
                            "author": "Illustrious_Sea_4447",
                            "id": "j495iuj",
                            "parent_id": "t1_j48qsr0",
                            "score": 0,
                            "created_utc": 1673657619.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Yeah, this is a smart take. I was astonished reading the OP as to why anyone would walk away from that, and also disappear right before a trip! You'd expect a flaky young girl to mess up something that good out of impulsivity, but not a 30 year old professional. \n\nBut, you reminded me that sometimes the relational piece of things can get really bad, and one might decide it's unfixable (generally because the other person refuses to listen or change) and that the money isn't worth it. It would also make a lot of sense to leave right before a trip, during which you'll be spending lots of time together with ample room for frustration.\n\nOP, I have no idea what happened with your SB, of course.  I remember walking away from an arrangement when I was 22, though, because of how bad I consistently felt around him. He was one of those attorneys who make arguing their whole personality and I didn't like that dynamic (esp given that I never won! Though things would have gotten even more unpleasant if I had) and didn't like how he would put me down and didn't like that he would predictably get upset with me when I was truly trying my best to make him happy. \n\nThe last straw (I'm sure you didn't do this with your SB, but I include it to illustrate how frustrating things got for me) was when I went to see him one weekend and he started talking about the fact that I am biracial in terms of my \"more dominant-acting White side, and your submissive Asian side.\" My jaw metaphorically dropped and I tried to kindly but firmly tell him that he really shouldn't equate Whiteness with dominance and Asianness with being submissive. He waved me off and insisted that his analysis was correct. \n\nI finished the weekend with him and didn't really think of it as the last weekend at the time, but once I got back home, I realized that the money just wasn't worth it for me. He could have paid me double and it still wouldn't have been worth it. So, I ghosted him. Only time I have ever done that to anyone I've dated. My idea was that talking about things with him would have just led to the mother of all arguments. I know I shouldn't have done it, I should have just sent him a brief message saying it was over and blocked him. That's what I would do now, but it is what it is. \n\nI wonder what your last series of interactions with your SB may have been like? What do you think they might have been like, from her perspective?\n\nUsually, both people contribute to things falling apart somehow. Regardless, I'm sorry that you've been having such crappy experiences in the bowl.",
            "author": "uptiedand8",
            "id": "j46kwck",
            "parent_id": "t1_j43sw2c",
            "score": 19,
            "created_utc": 1673622017.0,
            "replies": [
                {
                    "body": "💗",
                    "author": "P0sitiveViibes777",
                    "id": "j46vnth",
                    "parent_id": "t1_j46kwck",
                    "score": 5,
                    "created_utc": 1673626199.0,
                    "replies": []
                },
                {
                    "body": "Honestly, I've had a situation where I setup a trip for us to go  on a nice skiing vacation for a few days because I know she's always wanted a trip like that. She had never been...\nThen for no good reason,  just creates a non existence issue   to make an argument out of, and just disappeared.  Only to reach out a couple weeks later. This person was also 30.\nOdd histrionic behavior...",
                    "author": "dzyadza",
                    "id": "j4fr6ay",
                    "parent_id": "t1_j46kwck",
                    "score": 3,
                    "created_utc": 1673783539.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I can tell you exactly why someone would walk away from that. The OP expressed it ... the SB only pretended to like and care about the OP. As soon as she had other opportunities or another guy someone she was probably actually attracted to she disappeared.\n\nAnd did she walk away from it? Or did he end it after feeling disrespected.  Or  did she expect him to accept it because she is hot, and younger and he should be greatful to be with her.\n\nI have had a few great SR with SB who actually like me as a person and want to spend time with me and enjoy the time we spend together, in these sitatuations the SR tends to last much longer as in a couple of years. I have sadly run into people like the SB described by the OP. Someone who never actually liked me as a person and when the opportunity to move on came they did, or the acting was bad and I could see they didn't care about me and I dropped them. \n\nRemember for every amazing SB there are many bad/disengenous/fake people out there. Just like for every good SD there are many cheap/bad/fake people out there.",
            "author": "midasza",
            "id": "j475dk0",
            "parent_id": "t1_j43sw2c",
            "score": 9,
            "created_utc": 1673629799.0,
            "replies": [
                {
                    "body": "Damn it’s hard for me to relate to disingenuous people because I work really hard to be 💯 but I believe you",
                    "author": "P0sitiveViibes777",
                    "id": "j48alak",
                    "parent_id": "t1_j475dk0",
                    "score": 3,
                    "created_utc": 1673644995.0,
                    "replies": [
                        {
                            "body": "Honestly I would love to believe everyone has good intentions, but realistically some don't.",
                            "author": "midasza",
                            "id": "j48ax9y",
                            "parent_id": "t1_j48alak",
                            "score": 2,
                            "created_utc": 1673645120.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I think this is one small piece of her life. And she’s kind of disorganized enough about how she manages her life outside of her actual work that she’s not really putting the pieces together. She kept using words to say that she really liked me and she knows that she’s been flaky and she’s going to get better and blah blah blah but her actions never matched up.",
            "author": "Psychological_Sun374",
            "id": "j43takj",
            "parent_id": "t1_j43sw2c",
            "score": 3,
            "created_utc": 1673567058.0,
            "replies": [
                {
                    "body": "It doesn’t matter how much opportunity one is given. If they don’t have their shit together, then the opportunity is wasted. Maybe wait til a persons true colors start to emerge prior to going all in. 💗💗💗💗 best wishes for your next great adventure!",
                    "author": "P0sitiveViibes777",
                    "id": "j43vb3b",
                    "parent_id": "t1_j43takj",
                    "score": 10,
                    "created_utc": 1673567878.0,
                    "replies": [
                        {
                            "body": "For sure. I deleted my SA profile and I’m kind of winding through the last few conversations. Going back to the idea that maybe I can get emotional support from friends and just have a casual FWB situation for sexual relief.",
                            "author": "Psychological_Sun374",
                            "id": "j43wf1c",
                            "parent_id": "t1_j43vb3b",
                            "score": 2,
                            "created_utc": 1673568337.0,
                            "replies": [
                                {
                                    "body": "Do you enjoy spoiling people? Because you could have a FWB and spoil them. Obviously not to that extent, but meals, little treats, small gifts. I've always been a FWB person more than a relationship person myself.",
                                    "author": "newbytheybe",
                                    "id": "j4b0ujh",
                                    "parent_id": "t1_j43wf1c",
                                    "score": 4,
                                    "created_utc": 1673700271.0,
                                    "replies": [
                                        {
                                            "body": "Yeah, that might be the route I head towards",
                                            "author": "Psychological_Sun374",
                                            "id": "j4br8lc",
                                            "parent_id": "t1_j4b0ujh",
                                            "score": 2,
                                            "created_utc": 1673712850.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "Deleting your profile sounds drastic. But I agree you should take a step back and reassess. 🧘 Come back though, once the dust settles and you can breathe freely and optimistically 💗",
                                    "author": "P0sitiveViibes777",
                                    "id": "j467qgr",
                                    "parent_id": "t1_j43wf1c",
                                    "score": 2,
                                    "created_utc": 1673616217.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "\"Just say no\" is the ultimate measure and exercise of self-respect.\n\nIf want to be a SB then you sign up for getting things in exchange for the obvious... attention and at the very least respect of your SD.\n\nThis is not \"I'd love to hear the other side of the story\"\n\nShe got a lot and was unappreciative and he got used. \n\nThere's no nuance here.",
            "author": "LunchBucketSandwich",
            "id": "j47xnco",
            "parent_id": "t1_j43sw2c",
            "score": 3,
            "created_utc": 1673640180.0,
            "replies": [
                {
                    "body": "I can see you point to a degree. But you are assuming the OP is 100% and the truth is her side his side and then the real truth.",
                    "author": "P0sitiveViibes777",
                    "id": "j48awg1",
                    "parent_id": "t1_j47xnco",
                    "score": 5,
                    "created_utc": 1673645111.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Fair enough. I think I’m getting a sharper lens on boundaries and what behaviors I will accept.",
            "author": "Psychological_Sun374",
            "id": "j43v4yy",
            "parent_id": "t1_j43uuw3",
            "score": 20,
            "created_utc": 1673567809.0,
            "replies": [
                {
                    "body": "It’s funny how we can be successful and not understand our own value and have difficulties setting those boundaries in personal life",
                    "author": "CaffineandGasoline",
                    "id": "j43xyjy",
                    "parent_id": "t1_j43v4yy",
                    "score": 11,
                    "created_utc": 1673568971.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Just to add my US$0.02 on that - I'm not sure everybody would happily trade for this.\n\nI'm very well off, but not ultra wealthy. Still it gets tiring getting sized up for cash by seemingly everyone. I missed catching up with a friend before xmas when we were in the same city. Timing didn't work out, I thought it was just drinks - no worries, next time. Today I got an investment proposal.\n\nTo bring it back to the bowl - I suspect this is why some of us are touchy about the women who try to turn us into ATMs. Many of us deal with this shit all the time and are looking for a short-term escape.",
            "author": "quietgrey1",
            "id": "j43x8s0",
            "parent_id": "t1_j43rqr2",
            "score": 10,
            "created_utc": 1673568674.0,
            "replies": [
                {
                    "body": "I completely feel this. I'm not rich, but your statement reminds me of this good friend I had several years back. I consistently made a lot more money than her and we both knew it. When we would go out to eat or for drinks, sometimes I would try to grab the whole check; she clocked this and would then insist on paying the whole thing herself! I learned my lesson at a certain point and just started paying for my portion of things, but she *still* insisted on paying the whole check sometimes, haha. She was an awesome person- friends like that are very valuable, and I guess if she had always let me pay the tab like I was trying to, then the friendship may have felt a bit different. \n\nI'm sure that when you're actually well off and can invest in someone's business idea, as opposed to just picking up the tab for their sushi, the schemers become thick on the ground and very underhanded in their attempts to get close to you. I've heard that this is the main reason wealthy folks tend to hang out with each other. Seems frustrating and lonely to have reason not to trust nice people who seem to like you.",
                    "author": "uptiedand8",
                    "id": "j46onkj",
                    "parent_id": "t1_j43x8s0",
                    "score": 4,
                    "created_utc": 1673623517.0,
                    "replies": [
                        {
                            "body": "👍 there’s one more twist - 99.99999% of the business ideas are from folks who don’t know how to execute biz ideas, so it’s basically me telling friends “no” 100% of the time, while they know I do invest in startups - just not theirs. Startup friends who know what they’re doing just ask me to be an advisor, knowing that eventually turns into $$.",
                            "author": "quietgrey1",
                            "id": "j47ygew",
                            "parent_id": "t1_j46onkj",
                            "score": 2,
                            "created_utc": 1673640480.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "I don't mean to be disrespectful, just genuinely curious to hear your perspective because I've heard it echoed from others: if you're sensitive about this, why go into such a lifestyle which places heavy focus on the amount of money you make? To me it's akin to a pot SB getting into this lifestyle and being sensitive to being objectified..",
                    "author": "rocknrollwitch",
                    "id": "j45jqtt",
                    "parent_id": "t1_j43x8s0",
                    "score": 6,
                    "created_utc": 1673599449.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Oh, you’re right. My publicist, who knows everything about my life, had to sit me down and dictate the text message I sent to tell this woman goodbye. She kept repeating that I should teach people how they should behave towards me.\n\nIn vanilla dating I am absolutely used to screening out golddiggers. I guess I foolishly believed that the construct of sugar dating would make the expectations and exchange explicit. And that someone who really wanted things to continue would make a minimal effort. \n\nAnyway, there’s a woman I met on SA who is sexually compatible, pleasant company, and really appreciates me. She doesn’t want an allowance, she’s delighted when I take her out. The main issues are that she is a grad student, half my age, and her self-confidence is so low that she doesn’t really contribute enough in conversation because she’s intimidated by me. I’ve been trying to make her comfortable and encourage her to open up but it’s going to be a lot of work. 🤷🏻",
            "author": "Psychological_Sun374",
            "id": "j43srm4",
            "parent_id": "t1_j43rqr2",
            "score": 11,
            "created_utc": 1673566843.0,
            "replies": [
                {
                    "body": "That's not a match. Keep trying.",
                    "author": "quietgrey1",
                    "id": "j43v668",
                    "parent_id": "t1_j43srm4",
                    "score": 20,
                    "created_utc": 1673567823.0,
                    "replies": []
                },
                {
                    "body": "I agree with your therapist. You are responsible for teaching people how to treat you. Learn from this experience, or this situation will likely happen again. Keep your heart open, but learn to give the same energy that you get from people. Also, love yourself enough to know when to let people go.",
                    "author": "CartographerCold7625",
                    "id": "j4420yu",
                    "parent_id": "t1_j43srm4",
                    "score": 9,
                    "created_utc": 1673570654.0,
                    "replies": [
                        {
                            "body": "Ha ha she’s not my therapist, she’s my publicist. Well, I guess it’s really a variation on a theme.",
                            "author": "Psychological_Sun374",
                            "id": "j442hlj",
                            "parent_id": "t1_j4420yu",
                            "score": 8,
                            "created_utc": 1673570846.0,
                            "replies": [
                                {
                                    "body": "Well my therapist has been telling me the same thing. It's working for me, so your publicist may be on to something 🤷🏽‍♀️",
                                    "author": "CartographerCold7625",
                                    "id": "j442xk6",
                                    "parent_id": "t1_j442hlj",
                                    "score": 7,
                                    "created_utc": 1673571032.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Yes but since we are spending cash on women  in the amount of a decent payroll I would expect that this should not be oneof my worries right. I dontknow why sbs start an arrangement or don't cut it off immediately if thy don't plan on something long term without the hassle  . Oh I know $$$$",
            "author": "MarzipanInevitable79",
            "id": "j43sm2e",
            "parent_id": "t1_j43rqr2",
            "score": -1,
            "created_utc": 1673566781.0,
            "replies": [
                {
                    "body": "My friend. Your comment does not make sense to me. I hire around 20 people every year out of college, and pay them all the same, well above the median american salary.  Every year, without fail, some of those employees are awesome, some are not. Some are long term, some are not. \n\nMoney doesn't affect performance.  Period. You could pay me a billion dollars, and I'd still be a terrible quarterback. Money allows you to be able to persuade *good performers to work for you.*  But you have to find the good performer. You cant just take a bad performer, increase their pay, and expect them to magically get better....",
                    "author": "TastySpermDevice",
                    "id": "j43tl6l",
                    "parent_id": "t1_j43sm2e",
                    "score": 39,
                    "created_utc": 1673567180.0,
                    "replies": [
                        {
                            "body": "wise as fuck",
                            "author": "GautiousCur",
                            "id": "j47gzes",
                            "parent_id": "t1_j43tl6l",
                            "score": 4,
                            "created_utc": 1673634025.0,
                            "replies": []
                        },
                        {
                            "body": "Yes but I would say sbs don't need to put a lot on \nthe table except beeing their self and beeing honest .\n\nOp is talking about basic human behavior like call when you can't show up or just be honest with me. I personally don't have the time or wants to play games. \n\n\nI hire people to be profitable for me and I provide for sbs to just be themselves.",
                            "author": "MarzipanInevitable79",
                            "id": "j43uhqd",
                            "parent_id": "t1_j43tl6l",
                            "score": 3,
                            "created_utc": 1673567543.0,
                            "replies": [
                                {
                                    "body": ">I provide for sbs to just be themselves\n\nRespectfully: I know that's the fantasy and you need her to sell it, but you've got to keep in the back of your mind that she's doing a lot of work behind the scenes to be the version of herself that you are willing to pay an allowance to. I say this because when I see men argue in favor of paying less to SBs in various situations (a common one is travel allowance), they often make the point that she's not actually working for the money, but instead is getting paid to be herself and hang out with someone she likes. Even if the second part of that is true, though, the first part is not.",
                                    "author": "uptiedand8",
                                    "id": "j46viik",
                                    "parent_id": "t1_j43uhqd",
                                    "score": 3,
                                    "created_utc": 1673626143.0,
                                    "replies": [
                                        {
                                            "body": "I agree with you regarding the travel. Even though we pay for it the sbs have to take up few days and put their life on pause. They should be compensate for that in ay way they want . Per diem is a must even by labor laws lol.\n\nI get that maintaining a look it's not cheap but honestly in my case I only commit to a sb when I see her in sweatpants and without make up. You would be surprised of the catfishing I've seen on MGs. \n\nAnd it is not a fantasy for me, I like ordinary girls which I would date vanilla as well. That my taste. Never had a thing for the bombshells 6 foot tall model. Been there done that and not my cup of tea.\n\nI know we're a moving ATM I just wish that sbs don't just see us like that because it doesn't last on the long run. Allowance in my opinion it's there to stimulate the relationship and make her life easier. Sadly lots of sbs see this as a job and that is fine plenty of men like that. There's something for everyone in he bowl it's just seems like a traditional sr it's harder to find.",
                                            "author": "MarzipanInevitable79",
                                            "id": "j4704kc",
                                            "parent_id": "t1_j46viik",
                                            "score": 2,
                                            "created_utc": 1673627885.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "And those who *do* respond to money as a motivator to perform better are exactly the people you need to avoid.  They are the same people who will sell you out or abandon you the moment they perceive the grass is greener elsewhere.",
                            "author": "S2USStudios",
                            "id": "j44o8dd",
                            "parent_id": "t1_j43tl6l",
                            "score": 3,
                            "created_utc": 1673580344.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "😂",
            "author": "Psychological_Sun374",
            "id": "j449gg8",
            "parent_id": "t1_j446abc",
            "score": 2,
            "created_utc": 1673573847.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "j44er56",
                    "parent_id": "t1_j449gg8",
                    "score": 6,
                    "created_utc": 1673576152.0,
                    "replies": [
                        {
                            "body": "Ahhh, this happened to me too and still putting myself back together over a year and a half later. Sorry this happened to you.",
                            "author": "thehottubistoohawt",
                            "id": "j450f1i",
                            "parent_id": "t1_j44er56",
                            "score": 5,
                            "created_utc": 1673586472.0,
                            "replies": [
                                {
                                    "body": "🤗💜💜",
                                    "author": "Efficient-Aioli417",
                                    "id": "j450mtq",
                                    "parent_id": "t1_j450f1i",
                                    "score": 1,
                                    "created_utc": 1673586588.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "Yes I don’t think she’s cruel. Just ungrateful and self centered.",
                            "author": "Psychological_Sun374",
                            "id": "j459oqu",
                            "parent_id": "t1_j44er56",
                            "score": 5,
                            "created_utc": 1673592037.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "j45qiv4",
                                    "parent_id": "t1_j459oqu",
                                    "score": 1,
                                    "created_utc": 1673604977.0,
                                    "replies": [
                                        {
                                            "body": "I do think goodness is healing, and I wish you the best in rebuilding.  Seeing it, hearing it, hearing about it are tremendously restorative.  Just seeing good people in action has helped me get through rough times (and I hope pass it on).",
                                            "author": "Sunny_Heather",
                                            "id": "j47agad",
                                            "parent_id": "t1_j45qiv4",
                                            "score": 2,
                                            "created_utc": 1673631638.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "For real! I’d be showing him how appreciative I was In any way I can! Lingerie at the door and a cocktail in my hand! How may I please you today, daddy? Haha",
            "author": null,
            "id": "j44gq9f",
            "parent_id": "t1_j446abc",
            "score": 0,
            "created_utc": 1673576989.0,
            "replies": []
        },
        {
            "body": "Yeah. I may end up spending time with a woman who is nice company but at a more confused stage of her life. And more spoiled gf / sub than SB.",
            "author": "Psychological_Sun374",
            "id": "j459eac",
            "parent_id": "t1_j4499g0",
            "score": 2,
            "created_utc": 1673591842.0,
            "replies": []
        },
        {
            "body": "If it’s a business transaction, she gets a one star rating. Although not my preference I would’ve been open to different situations but at base making & keeping plans and not flaking last minute is a minimum requirement",
            "author": "Psychological_Sun374",
            "id": "j45aapa",
            "parent_id": "t1_j44p3yv",
            "score": 2,
            "created_utc": 1673592450.0,
            "replies": []
        },
        {
            "body": "This was over a period of five months",
            "author": "Psychological_Sun374",
            "id": "j43re64",
            "parent_id": "t1_j43r07e",
            "score": 3,
            "created_utc": 1673566283.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "j43t1lh",
                    "parent_id": "t1_j43re64",
                    "score": 1,
                    "created_utc": 1673566957.0,
                    "replies": [
                        {
                            "body": "Yeah, I think she’s basking in pretty privilege. And it’s been several years since she had a relationship which means her last relationship ended when she was like 25. So it’s possible she simply doesn’t know how to actually show up as a mature partner.\n\nShe claims her last sugar relationship ended because the guy liked her so much he wanted to marry her and she doesn’t want to get married. Based on my own experience with her, I have to believe that guy had low self-esteem.",
                            "author": "Psychological_Sun374",
                            "id": "j43tijk",
                            "parent_id": "t1_j43t1lh",
                            "score": 4,
                            "created_utc": 1673567150.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I think she will continue to muddle by. I was going to set her up with a financial plan and habits, not just pay off the debt for her to run it up again. But she apparently couldn’t be arsed to simple civility",
            "author": "Psychological_Sun374",
            "id": "j459stl",
            "parent_id": "t1_j44mnpl",
            "score": 2,
            "created_utc": 1673592113.0,
            "replies": []
        },
        {
            "body": "Right. It’s called “not doing this”",
            "author": "Psychological_Sun374",
            "id": "j4hyd21",
            "parent_id": "t1_j4hvx0l",
            "score": -1,
            "created_utc": 1673817607.0,
            "replies": [
                {
                    "body": "Man, seriously, please stop it. There are myriads of \"impossible\" things in this World that happen. We attract what we truly want / believe in.",
                    "author": "SeekingInSydney",
                    "id": "j4hz1yk",
                    "parent_id": "t1_j4hyd21",
                    "score": 3,
                    "created_utc": 1673817864.0,
                    "replies": [
                        {
                            "body": "I didn’t say it impossible. I am saying that the things that I would probably need to do in order to fit with the parameters of a conventional sugar relationship don’t mesh with my personality. Rather than put myself in a position that would make me unhappy, I’m just going to opt for a different path.",
                            "author": "Psychological_Sun374",
                            "id": "j4i1ysc",
                            "parent_id": "t1_j4hz1yk",
                            "score": 0,
                            "created_utc": 1673818980.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I see you may have posted a number which is most likely an amount in relations to an arrangement. If this is the case, you are violating Rule #4 - \"No dollar amounts that are in reference to allowance/PPM are allowed.\"\n\nIf you are curious about Allowances reported by SLF contributors please see the [Allowance Master Thread 2021-2022](/r/sugarlifestyleforum/comments/pc22tk/allowance_master_thread_20212022/).\n\nYour post will not be approved until you remove the amount.  Please read the sub [Rules](/r/sugarlifestyleforum/comments/748zta/updated_and_clarified_rules_for_slf/) prior to posting anything else. \n\nIf you simply posted a number not referencing a monetary amount, please message the MODs to approve your post.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/sugarlifestyleforum) if you have any questions or concerns.*",
            "author": "AutoModerator",
            "id": "j45dvkf",
            "parent_id": "t1_j45dvje",
            "score": 0,
            "created_utc": 1673594982.0,
            "replies": []
        },
        {
            "body": "We had a discussion over the holidays. She’s had some stuff going on in her life and she said to me that she realizes that she had been flaky but normally she’s not like that, she’s very reliable, and she really wants to make it work. We had one nice trip. Then this - after I gave her January allowance, paid her phone bill, and paid for a high end beauty treatment.",
            "author": "Psychological_Sun374",
            "id": "j459bmw",
            "parent_id": "t1_j4498op",
            "score": 1,
            "created_utc": 1673591793.0,
            "replies": [
                {
                    "body": "Yeah that’s par for the course. She just wasn’t into it and led you on. Probably the lesson is not to put too much mental energy in until the flakiness improves.",
                    "author": "daddoms",
                    "id": "j46emx1",
                    "parent_id": "t1_j459bmw",
                    "score": 3,
                    "created_utc": 1673619430.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "She knew I was dating other women. And changing plane tickets it turns out are not so easy. And there are very few career women who can travel internationally on 24 hours notice.",
            "author": "Psychological_Sun374",
            "id": "j43rif1",
            "parent_id": "t1_j43qy3c",
            "score": 7,
            "created_utc": 1673566333.0,
            "replies": []
        },
        {
            "body": "I wish I had the time for that",
            "author": "MarzipanInevitable79",
            "id": "j43s4f2",
            "parent_id": "t1_j43qy3c",
            "score": 3,
            "created_utc": 1673566581.0,
            "replies": [
                {
                    "body": "Wish I had the time - and sanity - for that.",
                    "author": "quietgrey1",
                    "id": "j43xdus",
                    "parent_id": "t1_j43s4f2",
                    "score": 3,
                    "created_utc": 1673568733.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I know what I’m doing wrong - not asserting my boundaries early enough. I tend to give people too many chances",
            "author": "Psychological_Sun374",
            "id": "j45aizh",
            "parent_id": "t1_j44xxt6",
            "score": 3,
            "created_utc": 1673592608.0,
            "replies": [
                {
                    "body": "I feel that so much. It's probably one of my greatest weaknesses. Each time I tell myself, \"boundaries...\" and I put them up then they seem to melt away all too quickly and I give too many chances which, of course, they take advantage of. Probably the biggest thing about myself I continue to work on.",
                    "author": "DrivingForward10",
                    "id": "j46ui62",
                    "parent_id": "t1_j45aizh",
                    "score": 1,
                    "created_utc": 1673625759.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "In her case, it was more flake than ghost.",
            "author": "Psychological_Sun374",
            "id": "j46rgqm",
            "parent_id": "t1_j46qwdr",
            "score": 1,
            "created_utc": 1673624610.0,
            "replies": []
        },
        {
            "body": "She doesn’t want marriage, she doesn’t want kids. She flaked vs full on ghost. She wanted me to find out at the airport whether or not she would join me on the trip.",
            "author": "Psychological_Sun374",
            "id": "j478lnw",
            "parent_id": "t1_j474j62",
            "score": 0,
            "created_utc": 1673630965.0,
            "replies": []
        },
        {
            "body": "If there was an award for the absolute worst first post on this sub, this would be an easy finalist.  Wow.",
            "author": "MrBuzzard",
            "id": "j46d9ci",
            "parent_id": "t1_j45xm43",
            "score": 1,
            "created_utc": 1673618824.0,
            "replies": []
        },
        {
            "body": "Well, you sound nice",
            "author": "Psychological_Sun374",
            "id": "j45zqif",
            "parent_id": "t1_j45xm43",
            "score": 0,
            "created_utc": 1673611732.0,
            "replies": []
        },
        {
            "body": "She said she was both attracted to older men and me in particular. Physically how do I put this? Some of her responses would be difficult to fake",
            "author": "Psychological_Sun374",
            "id": "j459ly9",
            "parent_id": "t1_j44csx8",
            "score": 0,
            "created_utc": 1673591984.0,
            "replies": []
        },
        {
            "body": "Yeah lesson learned. I deleted my profile in the fall",
            "author": "Psychological_Sun374",
            "id": "j45b9dm",
            "parent_id": "t1_j457kd0",
            "score": 1,
            "created_utc": 1673593111.0,
            "replies": []
        },
        {
            "body": "Actually, I was just looking for her to show up for dates and return messages. But this apparently was too high an expectation.",
            "author": "Psychological_Sun374",
            "id": "j45wboa",
            "parent_id": "t1_j45ttt6",
            "score": 2,
            "created_utc": 1673609455.0,
            "replies": []
        },
        {
            "body": "I’m making the trip anyway. It is unfortunately for me essentially a gathering of ultra wealthy, middle-aged men with a few women thrown in. So not really a great hunting ground for me dating wise, although certainly good networking",
            "author": "Psychological_Sun374",
            "id": "j43roiz",
            "parent_id": "t1_j43r3ob",
            "score": 3,
            "created_utc": 1673566402.0,
            "replies": [
                {
                    "body": "I am with you brother, similar thing happened to me in August last year when I planned a Euro tour. I have been struggling to find a decent loyal and reliable match too. It seems like I needed to up my game in screening for Gold diggers. For me it seems like they found some better ways to blend in and pretend to be genuine. That is over and above trying to avoid the scammers and people thinking they are now SB's not understanding how this works, so they believe that we are just ATM machines.",
                    "author": "AnthonyEdwards_",
                    "id": "j455dsg",
                    "parent_id": "t1_j43roiz",
                    "score": 1,
                    "created_utc": 1673589273.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Absolutely. We had multiple conversations. I was not really asking for that much. Ironically, in her professional work, she has to be super reliable and responsive in order to do her job for as long as she has. Somehow she seems unable to bring that skill set to dating.",
            "author": "Psychological_Sun374",
            "id": "j43s4mt",
            "parent_id": "t1_j43rnlb",
            "score": 3,
            "created_utc": 1673566583.0,
            "replies": [
                {
                    "body": "I knew something sounded familiar. You were dating my wife. 😂",
                    "author": "quietgrey1",
                    "id": "j43y3kt",
                    "parent_id": "t1_j43s4mt",
                    "score": 5,
                    "created_utc": 1673569029.0,
                    "replies": [
                        {
                            "body": "😂",
                            "author": "Psychological_Sun374",
                            "id": "j442iws",
                            "parent_id": "t1_j43y3kt",
                            "score": 2,
                            "created_utc": 1673570861.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Oh :( She might be more avoidant and closed off in relationships compared to how she is at work. Regardless, that’s not a good feeling if she’s capable of being reliable and responsive but wouldn’t give you the same energy.",
                    "author": "Siren_eyes256",
                    "id": "j43tpmt",
                    "parent_id": "t1_j43s4mt",
                    "score": 2,
                    "created_utc": 1673567230.0,
                    "replies": [
                        {
                            "body": "She actually said to me that she is able to text reliably to people that are important to her. And then she said she was going to make an effort with me. And the results were not great.",
                            "author": "Psychological_Sun374",
                            "id": "j43tx43",
                            "parent_id": "t1_j43tpmt",
                            "score": 2,
                            "created_utc": 1673567314.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Im very much like that as well. Work life is on point but cant retain that level of focus 24/7 😅",
                    "author": "Upper-District-50",
                    "id": "j44ay1c",
                    "parent_id": "t1_j43s4mt",
                    "score": 2,
                    "created_utc": 1673574499.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "We’re out there. Just being reliable and making & keeping dates will make you stand out from 80% of SBs",
            "author": "Psychological_Sun374",
            "id": "j45a6by",
            "parent_id": "t1_j44nyd5",
            "score": 2,
            "created_utc": 1673592367.0,
            "replies": []
        },
        {
            "body": "All talk for real. \n\n\nOr johns.",
            "author": "chiquitabrilliant",
            "id": "j452205",
            "parent_id": "t1_j44nyd5",
            "score": 3,
            "created_utc": 1673587375.0,
            "replies": [
                {
                    "body": "Oh absolutely 🤣🤣",
                    "author": "onethirtyone131",
                    "id": "j452827",
                    "parent_id": "t1_j452205",
                    "score": 0,
                    "created_utc": 1673587466.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Because the SBs in this forum talk about how men don’t do these things for them. I didn’t even list everything, but was just giving a sense. \n\nThe appreciation I was expecting was actually being able to make and keep plans.",
            "author": "Psychological_Sun374",
            "id": "j45b20a",
            "parent_id": "t1_j44zldl",
            "score": 4,
            "created_utc": 1673592968.0,
            "replies": []
        },
        {
            "body": "Yeah in this instance I’ve reached my tolerance",
            "author": "Psychological_Sun374",
            "id": "j459j8i",
            "parent_id": "t1_j44b38p",
            "score": 1,
            "created_utc": 1673591934.0,
            "replies": []
        },
        {
            "body": "I don’t think chemistry was the issue. I think her life is a mess and she can’t get out of her own way to clean it up.",
            "author": "Psychological_Sun374",
            "id": "j45fb5x",
            "parent_id": "t1_j45f0vw",
            "score": 0,
            "created_utc": 1673596039.0,
            "replies": []
        },
        {
            "body": "Haha brother is married. I’m the financially successful one in the family - everyone else went into public service or nonprofit.",
            "author": "Psychological_Sun374",
            "id": "j45hgnc",
            "parent_id": "t1_j45hc1c",
            "score": 2,
            "created_utc": 1673597663.0,
            "replies": [
                {
                    "body": "Just joking....",
                    "author": "Old_Control_8164",
                    "id": "j45hl7c",
                    "parent_id": "t1_j45hgnc",
                    "score": 1,
                    "created_utc": 1673597762.0,
                    "replies": []
                },
                {
                    "body": "I'm sorry that you were not appreciated. this sucks in everyday life too, especially in sugarlife.",
                    "author": "Old_Control_8164",
                    "id": "j45htfd",
                    "parent_id": "t1_j45hgnc",
                    "score": 0,
                    "created_utc": 1673597938.0,
                    "replies": [
                        {
                            "body": "Thanks. Yes, I’ve been under appreciated in vanilla dating too. This is definitely a “me” problem",
                            "author": "Psychological_Sun374",
                            "id": "j45hyag",
                            "parent_id": "t1_j45htfd",
                            "score": 1,
                            "created_utc": 1673598042.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I think she just isn’t ready for a relationship. Or maybe not one with me 🤷🏻",
            "author": "Psychological_Sun374",
            "id": "j45xg6z",
            "parent_id": "t1_j45o8k1",
            "score": 1,
            "created_utc": 1673610240.0,
            "replies": []
        },
        {
            "body": "Thank you!",
            "author": "Psychological_Sun374",
            "id": "j48r849",
            "parent_id": "t1_j484y59",
            "score": 0,
            "created_utc": 1673651495.0,
            "replies": []
        },
        {
            "body": "There’s also the evolving money thing. \n\nAfter this last experience I was feeling pretty burned about just throwing cash around, so tried suggesting to a POT a $xx,xxx three day trip, but with 80% in high end shoes (because she likes shoes) and a more modest cash allowance, plus she wouldn’t have to miss work. \n\nShe said she was ‘shocked’ at how low the allowance was, and that high x,xxx in gifts on a first setup was ‘just what she’s used to even in vanilla’ and ‘doesn’t count’ when thinking about allowance. \n\nOh well. I’m clearly not cut out for what really seems to be a money-for-sex game. I need to put my energy elsewhere.",
            "author": "Psychological_Sun374",
            "id": "j4la0ja",
            "parent_id": "t1_j4kl7zi",
            "score": -1,
            "created_utc": 1673880966.0,
            "replies": []
        },
        {
            "body": "It makes me question the fundamental equation. I’m pretty sure at the moment she doesn’t have another guy, I don’t know if it’s drugs, depression, or she’s just narcissistic, uncaring and disrespectful. At this point, it doesn’t really matter, she doesn’t treat me well.",
            "author": "Psychological_Sun374",
            "id": "j43ry5i",
            "parent_id": "t1_j43rq1s",
            "score": 3,
            "created_utc": 1673566510.0,
            "replies": [
                {
                    "body": "You're right but whatever it is she should have at least text you. But another brick in the wall  I guess",
                    "author": "MarzipanInevitable79",
                    "id": "j43stip",
                    "parent_id": "t1_j43ry5i",
                    "score": 2,
                    "created_utc": 1673566864.0,
                    "replies": [
                        {
                            "body": "She eventually texted me after 24 hours, and said she was dealing with something, she did not say what, and she would let me know about whether or not she could come. Our flight is in eight hours. So at that point I’m done. I don’t need to be sitting there at the airport wondering if she’s going to show up or not",
                            "author": "Psychological_Sun374",
                            "id": "j43szxb",
                            "parent_id": "t1_j43stip",
                            "score": 3,
                            "created_utc": 1673566938.0,
                            "replies": [
                                {
                                    "body": "Well she might have a good excuse if it's the only red flag but if it adds on on previous problems then you got to next her.",
                                    "author": "MarzipanInevitable79",
                                    "id": "j43tbd1",
                                    "parent_id": "t1_j43szxb",
                                    "score": 2,
                                    "created_utc": 1673567068.0,
                                    "replies": [
                                        {
                                            "body": "This is the straw that broke the camels back. We had a whole series of problems that I’ve talked to her about and she claimed she was going to fix and then didn’t fix.",
                                            "author": "Psychological_Sun374",
                                            "id": "j43tlty",
                                            "parent_id": "t1_j43tbd1",
                                            "score": 3,
                                            "created_utc": 1673567187.0,
                                            "replies": [
                                                {
                                                    "body": "I'm sure you are on the flight already, but get it, she isn't worth your time, which frankly is more valuable to you than your money. At least that's the way I have felt about it when in this kind of situation.",
                                                    "author": "TheMistressMan",
                                                    "id": "j4572fa",
                                                    "parent_id": "t1_j43tlty",
                                                    "score": 1,
                                                    "created_utc": 1673590313.0,
                                                    "replies": [
                                                        {
                                                            "body": "En route to airport!",
                                                            "author": "Psychological_Sun374",
                                                            "id": "j45b4uy",
                                                            "parent_id": "t1_j4572fa",
                                                            "score": 2,
                                                            "created_utc": 1673593024.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Bon voyage",
                                                                    "author": "AleksiaE",
                                                                    "id": "j45bpfq",
                                                                    "parent_id": "t1_j45b4uy",
                                                                    "score": 1,
                                                                    "created_utc": 1673593422.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I see you may have posted a number which is most likely an amount in relations to an arrangement. If this is the case, you are violating Rule #4 - \"No dollar amounts that are in reference to allowance/PPM are allowed.\"\n\nIf you are curious about Allowances reported by SLF contributors please see the [Allowance Master Thread 2021-2022](/r/sugarlifestyleforum/comments/pc22tk/allowance_master_thread_20212022/).\n\nYour post will not be approved until you remove the amount.  Please read the sub [Rules](/r/sugarlifestyleforum/comments/748zta/updated_and_clarified_rules_for_slf/) prior to posting anything else. \n\nIf you simply posted a number not referencing a monetary amount, please message the MODs to approve your post.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/sugarlifestyleforum) if you have any questions or concerns.*",
            "author": "AutoModerator",
            "id": "j43xk1z",
            "parent_id": "t1_j43xk0c",
            "score": 0,
            "created_utc": 1673568805.0,
            "replies": []
        },
        {
            "body": "Fortunately my travel status means the air tickets are largely refundable. I think I’m more annoyed with myself that I gave this woman so much headspace.",
            "author": "Psychological_Sun374",
            "id": "j4595xx",
            "parent_id": "t1_j447h0t",
            "score": 1,
            "created_utc": 1673591690.0,
            "replies": []
        },
        {
            "body": "😂 done",
            "author": "Psychological_Sun374",
            "id": "j45ad5e",
            "parent_id": "t1_j44quez",
            "score": 2,
            "created_utc": 1673592496.0,
            "replies": []
        },
        {
            "body": "I’m sure they are there! I actually had a nice thing going with a wonderful Australian woman, but then she went back down under. She seem to feel that the scene there was good for her.",
            "author": "Psychological_Sun374",
            "id": "j45bb6h",
            "parent_id": "t1_j457o9e",
            "score": 1,
            "created_utc": 1673593146.0,
            "replies": [
                {
                    "body": "There are people like OP in Aus. I am one of those people. I do a lot for my sb in terms of supporting her financially, emotionally and physically even in situations where she doesn't ask for it but in a lot of cases all of it has really been one way and not appreciated. I've only had one sb buy me something for my bday the whole time I've been doing this 😄",
                    "author": "WanderLustandBeyond",
                    "id": "j47unnn",
                    "parent_id": "t1_j45bb6h",
                    "score": 2,
                    "created_utc": 1673639069.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I figured 5 months was taking it slow",
            "author": "Psychological_Sun374",
            "id": "j45beiq",
            "parent_id": "t1_j459u7c",
            "score": 1,
            "created_utc": 1673593210.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "j45bw77",
                    "parent_id": "t1_j45beiq",
                    "score": 1,
                    "created_utc": 1673593556.0,
                    "replies": [
                        {
                            "body": "Extenuating circumstances, then we talked about it, and then her behavior did not match her words",
                            "author": "Psychological_Sun374",
                            "id": "j45cjq7",
                            "parent_id": "t1_j45bw77",
                            "score": 1,
                            "created_utc": 1673594020.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "j45d9uk",
                                    "parent_id": "t1_j45cjq7",
                                    "score": 0,
                                    "created_utc": 1673594540.0,
                                    "replies": [
                                        {
                                            "body": "Fer sure",
                                            "author": "Psychological_Sun374",
                                            "id": "j45el17",
                                            "parent_id": "t1_j45d9uk",
                                            "score": 1,
                                            "created_utc": 1673595504.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Given the schedule we’ve had it would be tough for her to pull that off but possible I suppose.\n\nAnd another sign that maybe an SR isn’t what I’m looking for. I don’t mind nonexclusive, I do mind flakiness",
            "author": "Psychological_Sun374",
            "id": "j45xjli",
            "parent_id": "t1_j45wzqi",
            "score": 1,
            "created_utc": 1673610304.0,
            "replies": []
        },
        {
            "body": "Thanks!",
            "author": "Psychological_Sun374",
            "id": "j45bizx",
            "parent_id": "t1_j458pb4",
            "score": 1,
            "created_utc": 1673593298.0,
            "replies": []
        },
        {
            "body": "My problem is not that she has a life aside for me. My problem is her complete inability to communicate.",
            "author": "Psychological_Sun374",
            "id": "j4646nr",
            "parent_id": "t1_j46364v",
            "score": 1,
            "created_utc": 1673614346.0,
            "replies": [
                {
                    "body": ">  complete inability to communicate.\n\nJust stupid I'm afraid.",
                    "author": "GSSD",
                    "id": "j466csl",
                    "parent_id": "t1_j4646nr",
                    "score": 0,
                    "created_utc": 1673615507.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "In the case of this woman, her career is Project based, and she’s between projects so she had time. We had planned this like a month in advance, it was her cancellation that was last minute.",
            "author": "Psychological_Sun374",
            "id": "j46o8qc",
            "parent_id": "t1_j46kdxx",
            "score": 0,
            "created_utc": 1673623357.0,
            "replies": [
                {
                    "body": "You need someone that can place you at the forefront of their mind. Right up there with job, family and friends.",
                    "author": "Babydoll120",
                    "id": "j46p95v",
                    "parent_id": "t1_j46o8qc",
                    "score": 0,
                    "created_utc": 1673623749.0,
                    "replies": [
                        {
                            "body": "Or just show up for plans",
                            "author": "Psychological_Sun374",
                            "id": "j46pfta",
                            "parent_id": "t1_j46p95v",
                            "score": 0,
                            "created_utc": 1673623821.0,
                            "replies": [
                                {
                                    "body": "Yes, it’ll all fall right into place. After you take the time you need to heal, try it.",
                                    "author": "Babydoll120",
                                    "id": "j46q9mp",
                                    "parent_id": "t1_j46pfta",
                                    "score": 0,
                                    "created_utc": 1673624147.0,
                                    "replies": [
                                        {
                                            "body": "thanks for your encouragement",
                                            "author": "Psychological_Sun374",
                                            "id": "j46qv9h",
                                            "parent_id": "t1_j46q9mp",
                                            "score": 0,
                                            "created_utc": 1673624378.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "It was easy for me to set up - and she’s going to miss out on it now because she can’t be bothered to demonstrate basic politeness",
            "author": "Psychological_Sun374",
            "id": "j474g42",
            "parent_id": "t1_j4714ln",
            "score": 1,
            "created_utc": 1673629462.0,
            "replies": [
                {
                    "body": "Very unfortunate.\n\nPeople's basic nature comes out in the end, and I enjoy sussing it out as quickly as possible, for good or ill.\n\nIt will be tempting to enjoy the schadenfreude and keep tabs on her and follow up. But personally, I'd let it go and enjoy a new SB or time off.",
                    "author": "JohnnyKemmer009",
                    "id": "j4752mg",
                    "parent_id": "t1_j474g42",
                    "score": 0,
                    "created_utc": 1673629689.0,
                    "replies": [
                        {
                            "body": "Not worth the brain damage",
                            "author": "Psychological_Sun374",
                            "id": "j4792a6",
                            "parent_id": "t1_j4752mg",
                            "score": 1,
                            "created_utc": 1673631134.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I don’t think I’m really cut out for it. It feels very checklist oriented, and mechanical and transactional.",
            "author": "Psychological_Sun374",
            "id": "j4hsq2a",
            "parent_id": "t1_j4hdr0s",
            "score": 0,
            "created_utc": 1673815505.0,
            "replies": [
                {
                    "body": "It does. I guess it depends on what you are a looking fof and why you are doing it.\nI guess is a matter of finding the right match.",
                    "author": "matecitocaliente",
                    "id": "j4ibo5s",
                    "parent_id": "t1_j4hsq2a",
                    "score": 0,
                    "created_utc": 1673822670.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I’m actually OK with B+ sex - that can improve over time - but last minute cancellations and disappearing for days at a time just don’t work for me",
            "author": "Psychological_Sun374",
            "id": "j45ag2l",
            "parent_id": "t1_j44xaji",
            "score": 3,
            "created_utc": 1673592552.0,
            "replies": [
                {
                    "body": "Have you ever had B+ sex go to a solid A… long term as a permanent change?  I have not.  Short term, yes.  But not long term. I am very lucky in my current, long term SR.  My SB hits an A every time. 😎",
                    "author": "Impossible-Heat9700",
                    "id": "j4a4xc5",
                    "parent_id": "t1_j45ag2l",
                    "score": 1,
                    "created_utc": 1673675613.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "😂 let’s hear it",
            "author": "Psychological_Sun374",
            "id": "j45bfrm",
            "parent_id": "t1_j45950h",
            "score": 1,
            "created_utc": 1673593234.0,
            "replies": [
                {
                    "body": "Haha let’s just sum it up to I would literally offer you my right lung to have someone like you in my life. \n\nI believe you just had bad luck or didn’t pick right but what you’re looking for is out there.",
                    "author": null,
                    "id": "j45cku3",
                    "parent_id": "t1_j45bfrm",
                    "score": 0,
                    "created_utc": 1673594042.0,
                    "replies": [
                        {
                            "body": "Thanks! May you find your prince",
                            "author": "Psychological_Sun374",
                            "id": "j45dmva",
                            "parent_id": "t1_j45cku3",
                            "score": 2,
                            "created_utc": 1673594804.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Sorry to hear and good luck. I hope you eventually find what you’re looking for.",
            "author": "Psychological_Sun374",
            "id": "j460b3p",
            "parent_id": "t1_j45ztfs",
            "score": 1,
            "created_utc": 1673612095.0,
            "replies": []
        },
        {
            "body": "I think this is a problem with dating in general.",
            "author": "Psychological_Sun374",
            "id": "j4aedru",
            "parent_id": "t1_j49jgk0",
            "score": 0,
            "created_utc": 1673682483.0,
            "replies": [
                {
                    "body": "Yea but I would think with an upfront arrangement it would be easier.",
                    "author": "_borninathunderstorm",
                    "id": "j4d1xji",
                    "parent_id": "t1_j4aedru",
                    "score": 3,
                    "created_utc": 1673731426.0,
                    "replies": [
                        {
                            "body": "Good theory. Has not worked for me in practice.",
                            "author": "Psychological_Sun374",
                            "id": "j4d5ar4",
                            "parent_id": "t1_j4d1xji",
                            "score": -1,
                            "created_utc": 1673732797.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Thank you! I’ll get over it. I’m already over being annoyed about getting stood up on this trip.",
            "author": "Psychological_Sun374",
            "id": "j4aeba3",
            "parent_id": "t1_j49yl2r",
            "score": -1,
            "created_utc": 1673682426.0,
            "replies": []
        },
        {
            "body": "Could be. Or drugs, she’s in the entertainment industry",
            "author": "Psychological_Sun374",
            "id": "j45b2o7",
            "parent_id": "t1_j454idk",
            "score": 2,
            "created_utc": 1673592982.0,
            "replies": []
        },
        {
            "body": "Yeah… after 5 months I think I’m at the end of my patience",
            "author": "Psychological_Sun374",
            "id": "j48qsr0",
            "parent_id": "t1_j48dpoi",
            "score": 1,
            "created_utc": 1673651322.0,
            "replies": [
                {
                    "body": "Yes, the patience only works with the right person",
                    "author": "Illustrious_Sea_4447",
                    "id": "j495iuj",
                    "parent_id": "t1_j48qsr0",
                    "score": 0,
                    "created_utc": 1673657619.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "💗",
            "author": "P0sitiveViibes777",
            "id": "j46vnth",
            "parent_id": "t1_j46kwck",
            "score": 5,
            "created_utc": 1673626199.0,
            "replies": []
        },
        {
            "body": "Honestly, I've had a situation where I setup a trip for us to go  on a nice skiing vacation for a few days because I know she's always wanted a trip like that. She had never been...\nThen for no good reason,  just creates a non existence issue   to make an argument out of, and just disappeared.  Only to reach out a couple weeks later. This person was also 30.\nOdd histrionic behavior...",
            "author": "dzyadza",
            "id": "j4fr6ay",
            "parent_id": "t1_j46kwck",
            "score": 3,
            "created_utc": 1673783539.0,
            "replies": []
        },
        {
            "body": "Damn it’s hard for me to relate to disingenuous people because I work really hard to be 💯 but I believe you",
            "author": "P0sitiveViibes777",
            "id": "j48alak",
            "parent_id": "t1_j475dk0",
            "score": 3,
            "created_utc": 1673644995.0,
            "replies": [
                {
                    "body": "Honestly I would love to believe everyone has good intentions, but realistically some don't.",
                    "author": "midasza",
                    "id": "j48ax9y",
                    "parent_id": "t1_j48alak",
                    "score": 2,
                    "created_utc": 1673645120.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "It doesn’t matter how much opportunity one is given. If they don’t have their shit together, then the opportunity is wasted. Maybe wait til a persons true colors start to emerge prior to going all in. 💗💗💗💗 best wishes for your next great adventure!",
            "author": "P0sitiveViibes777",
            "id": "j43vb3b",
            "parent_id": "t1_j43takj",
            "score": 10,
            "created_utc": 1673567878.0,
            "replies": [
                {
                    "body": "For sure. I deleted my SA profile and I’m kind of winding through the last few conversations. Going back to the idea that maybe I can get emotional support from friends and just have a casual FWB situation for sexual relief.",
                    "author": "Psychological_Sun374",
                    "id": "j43wf1c",
                    "parent_id": "t1_j43vb3b",
                    "score": 2,
                    "created_utc": 1673568337.0,
                    "replies": [
                        {
                            "body": "Do you enjoy spoiling people? Because you could have a FWB and spoil them. Obviously not to that extent, but meals, little treats, small gifts. I've always been a FWB person more than a relationship person myself.",
                            "author": "newbytheybe",
                            "id": "j4b0ujh",
                            "parent_id": "t1_j43wf1c",
                            "score": 4,
                            "created_utc": 1673700271.0,
                            "replies": [
                                {
                                    "body": "Yeah, that might be the route I head towards",
                                    "author": "Psychological_Sun374",
                                    "id": "j4br8lc",
                                    "parent_id": "t1_j4b0ujh",
                                    "score": 2,
                                    "created_utc": 1673712850.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "Deleting your profile sounds drastic. But I agree you should take a step back and reassess. 🧘 Come back though, once the dust settles and you can breathe freely and optimistically 💗",
                            "author": "P0sitiveViibes777",
                            "id": "j467qgr",
                            "parent_id": "t1_j43wf1c",
                            "score": 2,
                            "created_utc": 1673616217.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I can see you point to a degree. But you are assuming the OP is 100% and the truth is her side his side and then the real truth.",
            "author": "P0sitiveViibes777",
            "id": "j48awg1",
            "parent_id": "t1_j47xnco",
            "score": 5,
            "created_utc": 1673645111.0,
            "replies": []
        },
        {
            "body": "It’s funny how we can be successful and not understand our own value and have difficulties setting those boundaries in personal life",
            "author": "CaffineandGasoline",
            "id": "j43xyjy",
            "parent_id": "t1_j43v4yy",
            "score": 11,
            "created_utc": 1673568971.0,
            "replies": []
        },
        {
            "body": "I completely feel this. I'm not rich, but your statement reminds me of this good friend I had several years back. I consistently made a lot more money than her and we both knew it. When we would go out to eat or for drinks, sometimes I would try to grab the whole check; she clocked this and would then insist on paying the whole thing herself! I learned my lesson at a certain point and just started paying for my portion of things, but she *still* insisted on paying the whole check sometimes, haha. She was an awesome person- friends like that are very valuable, and I guess if she had always let me pay the tab like I was trying to, then the friendship may have felt a bit different. \n\nI'm sure that when you're actually well off and can invest in someone's business idea, as opposed to just picking up the tab for their sushi, the schemers become thick on the ground and very underhanded in their attempts to get close to you. I've heard that this is the main reason wealthy folks tend to hang out with each other. Seems frustrating and lonely to have reason not to trust nice people who seem to like you.",
            "author": "uptiedand8",
            "id": "j46onkj",
            "parent_id": "t1_j43x8s0",
            "score": 4,
            "created_utc": 1673623517.0,
            "replies": [
                {
                    "body": "👍 there’s one more twist - 99.99999% of the business ideas are from folks who don’t know how to execute biz ideas, so it’s basically me telling friends “no” 100% of the time, while they know I do invest in startups - just not theirs. Startup friends who know what they’re doing just ask me to be an advisor, knowing that eventually turns into $$.",
                    "author": "quietgrey1",
                    "id": "j47ygew",
                    "parent_id": "t1_j46onkj",
                    "score": 2,
                    "created_utc": 1673640480.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I don't mean to be disrespectful, just genuinely curious to hear your perspective because I've heard it echoed from others: if you're sensitive about this, why go into such a lifestyle which places heavy focus on the amount of money you make? To me it's akin to a pot SB getting into this lifestyle and being sensitive to being objectified..",
            "author": "rocknrollwitch",
            "id": "j45jqtt",
            "parent_id": "t1_j43x8s0",
            "score": 6,
            "created_utc": 1673599449.0,
            "replies": []
        },
        {
            "body": "That's not a match. Keep trying.",
            "author": "quietgrey1",
            "id": "j43v668",
            "parent_id": "t1_j43srm4",
            "score": 20,
            "created_utc": 1673567823.0,
            "replies": []
        },
        {
            "body": "I agree with your therapist. You are responsible for teaching people how to treat you. Learn from this experience, or this situation will likely happen again. Keep your heart open, but learn to give the same energy that you get from people. Also, love yourself enough to know when to let people go.",
            "author": "CartographerCold7625",
            "id": "j4420yu",
            "parent_id": "t1_j43srm4",
            "score": 9,
            "created_utc": 1673570654.0,
            "replies": [
                {
                    "body": "Ha ha she’s not my therapist, she’s my publicist. Well, I guess it’s really a variation on a theme.",
                    "author": "Psychological_Sun374",
                    "id": "j442hlj",
                    "parent_id": "t1_j4420yu",
                    "score": 8,
                    "created_utc": 1673570846.0,
                    "replies": [
                        {
                            "body": "Well my therapist has been telling me the same thing. It's working for me, so your publicist may be on to something 🤷🏽‍♀️",
                            "author": "CartographerCold7625",
                            "id": "j442xk6",
                            "parent_id": "t1_j442hlj",
                            "score": 7,
                            "created_utc": 1673571032.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "My friend. Your comment does not make sense to me. I hire around 20 people every year out of college, and pay them all the same, well above the median american salary.  Every year, without fail, some of those employees are awesome, some are not. Some are long term, some are not. \n\nMoney doesn't affect performance.  Period. You could pay me a billion dollars, and I'd still be a terrible quarterback. Money allows you to be able to persuade *good performers to work for you.*  But you have to find the good performer. You cant just take a bad performer, increase their pay, and expect them to magically get better....",
            "author": "TastySpermDevice",
            "id": "j43tl6l",
            "parent_id": "t1_j43sm2e",
            "score": 39,
            "created_utc": 1673567180.0,
            "replies": [
                {
                    "body": "wise as fuck",
                    "author": "GautiousCur",
                    "id": "j47gzes",
                    "parent_id": "t1_j43tl6l",
                    "score": 4,
                    "created_utc": 1673634025.0,
                    "replies": []
                },
                {
                    "body": "Yes but I would say sbs don't need to put a lot on \nthe table except beeing their self and beeing honest .\n\nOp is talking about basic human behavior like call when you can't show up or just be honest with me. I personally don't have the time or wants to play games. \n\n\nI hire people to be profitable for me and I provide for sbs to just be themselves.",
                    "author": "MarzipanInevitable79",
                    "id": "j43uhqd",
                    "parent_id": "t1_j43tl6l",
                    "score": 3,
                    "created_utc": 1673567543.0,
                    "replies": [
                        {
                            "body": ">I provide for sbs to just be themselves\n\nRespectfully: I know that's the fantasy and you need her to sell it, but you've got to keep in the back of your mind that she's doing a lot of work behind the scenes to be the version of herself that you are willing to pay an allowance to. I say this because when I see men argue in favor of paying less to SBs in various situations (a common one is travel allowance), they often make the point that she's not actually working for the money, but instead is getting paid to be herself and hang out with someone she likes. Even if the second part of that is true, though, the first part is not.",
                            "author": "uptiedand8",
                            "id": "j46viik",
                            "parent_id": "t1_j43uhqd",
                            "score": 3,
                            "created_utc": 1673626143.0,
                            "replies": [
                                {
                                    "body": "I agree with you regarding the travel. Even though we pay for it the sbs have to take up few days and put their life on pause. They should be compensate for that in ay way they want . Per diem is a must even by labor laws lol.\n\nI get that maintaining a look it's not cheap but honestly in my case I only commit to a sb when I see her in sweatpants and without make up. You would be surprised of the catfishing I've seen on MGs. \n\nAnd it is not a fantasy for me, I like ordinary girls which I would date vanilla as well. That my taste. Never had a thing for the bombshells 6 foot tall model. Been there done that and not my cup of tea.\n\nI know we're a moving ATM I just wish that sbs don't just see us like that because it doesn't last on the long run. Allowance in my opinion it's there to stimulate the relationship and make her life easier. Sadly lots of sbs see this as a job and that is fine plenty of men like that. There's something for everyone in he bowl it's just seems like a traditional sr it's harder to find.",
                                    "author": "MarzipanInevitable79",
                                    "id": "j4704kc",
                                    "parent_id": "t1_j46viik",
                                    "score": 2,
                                    "created_utc": 1673627885.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "And those who *do* respond to money as a motivator to perform better are exactly the people you need to avoid.  They are the same people who will sell you out or abandon you the moment they perceive the grass is greener elsewhere.",
                    "author": "S2USStudios",
                    "id": "j44o8dd",
                    "parent_id": "t1_j43tl6l",
                    "score": 3,
                    "created_utc": 1673580344.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "j44er56",
            "parent_id": "t1_j449gg8",
            "score": 6,
            "created_utc": 1673576152.0,
            "replies": [
                {
                    "body": "Ahhh, this happened to me too and still putting myself back together over a year and a half later. Sorry this happened to you.",
                    "author": "thehottubistoohawt",
                    "id": "j450f1i",
                    "parent_id": "t1_j44er56",
                    "score": 5,
                    "created_utc": 1673586472.0,
                    "replies": [
                        {
                            "body": "🤗💜💜",
                            "author": "Efficient-Aioli417",
                            "id": "j450mtq",
                            "parent_id": "t1_j450f1i",
                            "score": 1,
                            "created_utc": 1673586588.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Yes I don’t think she’s cruel. Just ungrateful and self centered.",
                    "author": "Psychological_Sun374",
                    "id": "j459oqu",
                    "parent_id": "t1_j44er56",
                    "score": 5,
                    "created_utc": 1673592037.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "j45qiv4",
                            "parent_id": "t1_j459oqu",
                            "score": 1,
                            "created_utc": 1673604977.0,
                            "replies": [
                                {
                                    "body": "I do think goodness is healing, and I wish you the best in rebuilding.  Seeing it, hearing it, hearing about it are tremendously restorative.  Just seeing good people in action has helped me get through rough times (and I hope pass it on).",
                                    "author": "Sunny_Heather",
                                    "id": "j47agad",
                                    "parent_id": "t1_j45qiv4",
                                    "score": 2,
                                    "created_utc": 1673631638.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "j43t1lh",
            "parent_id": "t1_j43re64",
            "score": 1,
            "created_utc": 1673566957.0,
            "replies": [
                {
                    "body": "Yeah, I think she’s basking in pretty privilege. And it’s been several years since she had a relationship which means her last relationship ended when she was like 25. So it’s possible she simply doesn’t know how to actually show up as a mature partner.\n\nShe claims her last sugar relationship ended because the guy liked her so much he wanted to marry her and she doesn’t want to get married. Based on my own experience with her, I have to believe that guy had low self-esteem.",
                    "author": "Psychological_Sun374",
                    "id": "j43tijk",
                    "parent_id": "t1_j43t1lh",
                    "score": 4,
                    "created_utc": 1673567150.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Man, seriously, please stop it. There are myriads of \"impossible\" things in this World that happen. We attract what we truly want / believe in.",
            "author": "SeekingInSydney",
            "id": "j4hz1yk",
            "parent_id": "t1_j4hyd21",
            "score": 3,
            "created_utc": 1673817864.0,
            "replies": [
                {
                    "body": "I didn’t say it impossible. I am saying that the things that I would probably need to do in order to fit with the parameters of a conventional sugar relationship don’t mesh with my personality. Rather than put myself in a position that would make me unhappy, I’m just going to opt for a different path.",
                    "author": "Psychological_Sun374",
                    "id": "j4i1ysc",
                    "parent_id": "t1_j4hz1yk",
                    "score": 0,
                    "created_utc": 1673818980.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Yeah that’s par for the course. She just wasn’t into it and led you on. Probably the lesson is not to put too much mental energy in until the flakiness improves.",
            "author": "daddoms",
            "id": "j46emx1",
            "parent_id": "t1_j459bmw",
            "score": 3,
            "created_utc": 1673619430.0,
            "replies": []
        },
        {
            "body": "Wish I had the time - and sanity - for that.",
            "author": "quietgrey1",
            "id": "j43xdus",
            "parent_id": "t1_j43s4f2",
            "score": 3,
            "created_utc": 1673568733.0,
            "replies": []
        },
        {
            "body": "I feel that so much. It's probably one of my greatest weaknesses. Each time I tell myself, \"boundaries...\" and I put them up then they seem to melt away all too quickly and I give too many chances which, of course, they take advantage of. Probably the biggest thing about myself I continue to work on.",
            "author": "DrivingForward10",
            "id": "j46ui62",
            "parent_id": "t1_j45aizh",
            "score": 1,
            "created_utc": 1673625759.0,
            "replies": []
        },
        {
            "body": "I am with you brother, similar thing happened to me in August last year when I planned a Euro tour. I have been struggling to find a decent loyal and reliable match too. It seems like I needed to up my game in screening for Gold diggers. For me it seems like they found some better ways to blend in and pretend to be genuine. That is over and above trying to avoid the scammers and people thinking they are now SB's not understanding how this works, so they believe that we are just ATM machines.",
            "author": "AnthonyEdwards_",
            "id": "j455dsg",
            "parent_id": "t1_j43roiz",
            "score": 1,
            "created_utc": 1673589273.0,
            "replies": []
        },
        {
            "body": "I knew something sounded familiar. You were dating my wife. 😂",
            "author": "quietgrey1",
            "id": "j43y3kt",
            "parent_id": "t1_j43s4mt",
            "score": 5,
            "created_utc": 1673569029.0,
            "replies": [
                {
                    "body": "😂",
                    "author": "Psychological_Sun374",
                    "id": "j442iws",
                    "parent_id": "t1_j43y3kt",
                    "score": 2,
                    "created_utc": 1673570861.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Oh :( She might be more avoidant and closed off in relationships compared to how she is at work. Regardless, that’s not a good feeling if she’s capable of being reliable and responsive but wouldn’t give you the same energy.",
            "author": "Siren_eyes256",
            "id": "j43tpmt",
            "parent_id": "t1_j43s4mt",
            "score": 2,
            "created_utc": 1673567230.0,
            "replies": [
                {
                    "body": "She actually said to me that she is able to text reliably to people that are important to her. And then she said she was going to make an effort with me. And the results were not great.",
                    "author": "Psychological_Sun374",
                    "id": "j43tx43",
                    "parent_id": "t1_j43tpmt",
                    "score": 2,
                    "created_utc": 1673567314.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Im very much like that as well. Work life is on point but cant retain that level of focus 24/7 😅",
            "author": "Upper-District-50",
            "id": "j44ay1c",
            "parent_id": "t1_j43s4mt",
            "score": 2,
            "created_utc": 1673574499.0,
            "replies": []
        },
        {
            "body": "Oh absolutely 🤣🤣",
            "author": "onethirtyone131",
            "id": "j452827",
            "parent_id": "t1_j452205",
            "score": 0,
            "created_utc": 1673587466.0,
            "replies": []
        },
        {
            "body": "Just joking....",
            "author": "Old_Control_8164",
            "id": "j45hl7c",
            "parent_id": "t1_j45hgnc",
            "score": 1,
            "created_utc": 1673597762.0,
            "replies": []
        },
        {
            "body": "I'm sorry that you were not appreciated. this sucks in everyday life too, especially in sugarlife.",
            "author": "Old_Control_8164",
            "id": "j45htfd",
            "parent_id": "t1_j45hgnc",
            "score": 0,
            "created_utc": 1673597938.0,
            "replies": [
                {
                    "body": "Thanks. Yes, I’ve been under appreciated in vanilla dating too. This is definitely a “me” problem",
                    "author": "Psychological_Sun374",
                    "id": "j45hyag",
                    "parent_id": "t1_j45htfd",
                    "score": 1,
                    "created_utc": 1673598042.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "You're right but whatever it is she should have at least text you. But another brick in the wall  I guess",
            "author": "MarzipanInevitable79",
            "id": "j43stip",
            "parent_id": "t1_j43ry5i",
            "score": 2,
            "created_utc": 1673566864.0,
            "replies": [
                {
                    "body": "She eventually texted me after 24 hours, and said she was dealing with something, she did not say what, and she would let me know about whether or not she could come. Our flight is in eight hours. So at that point I’m done. I don’t need to be sitting there at the airport wondering if she’s going to show up or not",
                    "author": "Psychological_Sun374",
                    "id": "j43szxb",
                    "parent_id": "t1_j43stip",
                    "score": 3,
                    "created_utc": 1673566938.0,
                    "replies": [
                        {
                            "body": "Well she might have a good excuse if it's the only red flag but if it adds on on previous problems then you got to next her.",
                            "author": "MarzipanInevitable79",
                            "id": "j43tbd1",
                            "parent_id": "t1_j43szxb",
                            "score": 2,
                            "created_utc": 1673567068.0,
                            "replies": [
                                {
                                    "body": "This is the straw that broke the camels back. We had a whole series of problems that I’ve talked to her about and she claimed she was going to fix and then didn’t fix.",
                                    "author": "Psychological_Sun374",
                                    "id": "j43tlty",
                                    "parent_id": "t1_j43tbd1",
                                    "score": 3,
                                    "created_utc": 1673567187.0,
                                    "replies": [
                                        {
                                            "body": "I'm sure you are on the flight already, but get it, she isn't worth your time, which frankly is more valuable to you than your money. At least that's the way I have felt about it when in this kind of situation.",
                                            "author": "TheMistressMan",
                                            "id": "j4572fa",
                                            "parent_id": "t1_j43tlty",
                                            "score": 1,
                                            "created_utc": 1673590313.0,
                                            "replies": [
                                                {
                                                    "body": "En route to airport!",
                                                    "author": "Psychological_Sun374",
                                                    "id": "j45b4uy",
                                                    "parent_id": "t1_j4572fa",
                                                    "score": 2,
                                                    "created_utc": 1673593024.0,
                                                    "replies": [
                                                        {
                                                            "body": "Bon voyage",
                                                            "author": "AleksiaE",
                                                            "id": "j45bpfq",
                                                            "parent_id": "t1_j45b4uy",
                                                            "score": 1,
                                                            "created_utc": 1673593422.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "There are people like OP in Aus. I am one of those people. I do a lot for my sb in terms of supporting her financially, emotionally and physically even in situations where she doesn't ask for it but in a lot of cases all of it has really been one way and not appreciated. I've only had one sb buy me something for my bday the whole time I've been doing this 😄",
            "author": "WanderLustandBeyond",
            "id": "j47unnn",
            "parent_id": "t1_j45bb6h",
            "score": 2,
            "created_utc": 1673639069.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "j45bw77",
            "parent_id": "t1_j45beiq",
            "score": 1,
            "created_utc": 1673593556.0,
            "replies": [
                {
                    "body": "Extenuating circumstances, then we talked about it, and then her behavior did not match her words",
                    "author": "Psychological_Sun374",
                    "id": "j45cjq7",
                    "parent_id": "t1_j45bw77",
                    "score": 1,
                    "created_utc": 1673594020.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "j45d9uk",
                            "parent_id": "t1_j45cjq7",
                            "score": 0,
                            "created_utc": 1673594540.0,
                            "replies": [
                                {
                                    "body": "Fer sure",
                                    "author": "Psychological_Sun374",
                                    "id": "j45el17",
                                    "parent_id": "t1_j45d9uk",
                                    "score": 1,
                                    "created_utc": 1673595504.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": ">  complete inability to communicate.\n\nJust stupid I'm afraid.",
            "author": "GSSD",
            "id": "j466csl",
            "parent_id": "t1_j4646nr",
            "score": 0,
            "created_utc": 1673615507.0,
            "replies": []
        },
        {
            "body": "You need someone that can place you at the forefront of their mind. Right up there with job, family and friends.",
            "author": "Babydoll120",
            "id": "j46p95v",
            "parent_id": "t1_j46o8qc",
            "score": 0,
            "created_utc": 1673623749.0,
            "replies": [
                {
                    "body": "Or just show up for plans",
                    "author": "Psychological_Sun374",
                    "id": "j46pfta",
                    "parent_id": "t1_j46p95v",
                    "score": 0,
                    "created_utc": 1673623821.0,
                    "replies": [
                        {
                            "body": "Yes, it’ll all fall right into place. After you take the time you need to heal, try it.",
                            "author": "Babydoll120",
                            "id": "j46q9mp",
                            "parent_id": "t1_j46pfta",
                            "score": 0,
                            "created_utc": 1673624147.0,
                            "replies": [
                                {
                                    "body": "thanks for your encouragement",
                                    "author": "Psychological_Sun374",
                                    "id": "j46qv9h",
                                    "parent_id": "t1_j46q9mp",
                                    "score": 0,
                                    "created_utc": 1673624378.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Very unfortunate.\n\nPeople's basic nature comes out in the end, and I enjoy sussing it out as quickly as possible, for good or ill.\n\nIt will be tempting to enjoy the schadenfreude and keep tabs on her and follow up. But personally, I'd let it go and enjoy a new SB or time off.",
            "author": "JohnnyKemmer009",
            "id": "j4752mg",
            "parent_id": "t1_j474g42",
            "score": 0,
            "created_utc": 1673629689.0,
            "replies": [
                {
                    "body": "Not worth the brain damage",
                    "author": "Psychological_Sun374",
                    "id": "j4792a6",
                    "parent_id": "t1_j4752mg",
                    "score": 1,
                    "created_utc": 1673631134.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "It does. I guess it depends on what you are a looking fof and why you are doing it.\nI guess is a matter of finding the right match.",
            "author": "matecitocaliente",
            "id": "j4ibo5s",
            "parent_id": "t1_j4hsq2a",
            "score": 0,
            "created_utc": 1673822670.0,
            "replies": []
        },
        {
            "body": "Have you ever had B+ sex go to a solid A… long term as a permanent change?  I have not.  Short term, yes.  But not long term. I am very lucky in my current, long term SR.  My SB hits an A every time. 😎",
            "author": "Impossible-Heat9700",
            "id": "j4a4xc5",
            "parent_id": "t1_j45ag2l",
            "score": 1,
            "created_utc": 1673675613.0,
            "replies": []
        },
        {
            "body": "Haha let’s just sum it up to I would literally offer you my right lung to have someone like you in my life. \n\nI believe you just had bad luck or didn’t pick right but what you’re looking for is out there.",
            "author": null,
            "id": "j45cku3",
            "parent_id": "t1_j45bfrm",
            "score": 0,
            "created_utc": 1673594042.0,
            "replies": [
                {
                    "body": "Thanks! May you find your prince",
                    "author": "Psychological_Sun374",
                    "id": "j45dmva",
                    "parent_id": "t1_j45cku3",
                    "score": 2,
                    "created_utc": 1673594804.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Yea but I would think with an upfront arrangement it would be easier.",
            "author": "_borninathunderstorm",
            "id": "j4d1xji",
            "parent_id": "t1_j4aedru",
            "score": 3,
            "created_utc": 1673731426.0,
            "replies": [
                {
                    "body": "Good theory. Has not worked for me in practice.",
                    "author": "Psychological_Sun374",
                    "id": "j4d5ar4",
                    "parent_id": "t1_j4d1xji",
                    "score": -1,
                    "created_utc": 1673732797.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Yes, the patience only works with the right person",
            "author": "Illustrious_Sea_4447",
            "id": "j495iuj",
            "parent_id": "t1_j48qsr0",
            "score": 0,
            "created_utc": 1673657619.0,
            "replies": []
        },
        {
            "body": "Honestly I would love to believe everyone has good intentions, but realistically some don't.",
            "author": "midasza",
            "id": "j48ax9y",
            "parent_id": "t1_j48alak",
            "score": 2,
            "created_utc": 1673645120.0,
            "replies": []
        },
        {
            "body": "For sure. I deleted my SA profile and I’m kind of winding through the last few conversations. Going back to the idea that maybe I can get emotional support from friends and just have a casual FWB situation for sexual relief.",
            "author": "Psychological_Sun374",
            "id": "j43wf1c",
            "parent_id": "t1_j43vb3b",
            "score": 2,
            "created_utc": 1673568337.0,
            "replies": [
                {
                    "body": "Do you enjoy spoiling people? Because you could have a FWB and spoil them. Obviously not to that extent, but meals, little treats, small gifts. I've always been a FWB person more than a relationship person myself.",
                    "author": "newbytheybe",
                    "id": "j4b0ujh",
                    "parent_id": "t1_j43wf1c",
                    "score": 4,
                    "created_utc": 1673700271.0,
                    "replies": [
                        {
                            "body": "Yeah, that might be the route I head towards",
                            "author": "Psychological_Sun374",
                            "id": "j4br8lc",
                            "parent_id": "t1_j4b0ujh",
                            "score": 2,
                            "created_utc": 1673712850.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Deleting your profile sounds drastic. But I agree you should take a step back and reassess. 🧘 Come back though, once the dust settles and you can breathe freely and optimistically 💗",
                    "author": "P0sitiveViibes777",
                    "id": "j467qgr",
                    "parent_id": "t1_j43wf1c",
                    "score": 2,
                    "created_utc": 1673616217.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "👍 there’s one more twist - 99.99999% of the business ideas are from folks who don’t know how to execute biz ideas, so it’s basically me telling friends “no” 100% of the time, while they know I do invest in startups - just not theirs. Startup friends who know what they’re doing just ask me to be an advisor, knowing that eventually turns into $$.",
            "author": "quietgrey1",
            "id": "j47ygew",
            "parent_id": "t1_j46onkj",
            "score": 2,
            "created_utc": 1673640480.0,
            "replies": []
        },
        {
            "body": "Ha ha she’s not my therapist, she’s my publicist. Well, I guess it’s really a variation on a theme.",
            "author": "Psychological_Sun374",
            "id": "j442hlj",
            "parent_id": "t1_j4420yu",
            "score": 8,
            "created_utc": 1673570846.0,
            "replies": [
                {
                    "body": "Well my therapist has been telling me the same thing. It's working for me, so your publicist may be on to something 🤷🏽‍♀️",
                    "author": "CartographerCold7625",
                    "id": "j442xk6",
                    "parent_id": "t1_j442hlj",
                    "score": 7,
                    "created_utc": 1673571032.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "wise as fuck",
            "author": "GautiousCur",
            "id": "j47gzes",
            "parent_id": "t1_j43tl6l",
            "score": 4,
            "created_utc": 1673634025.0,
            "replies": []
        },
        {
            "body": "Yes but I would say sbs don't need to put a lot on \nthe table except beeing their self and beeing honest .\n\nOp is talking about basic human behavior like call when you can't show up or just be honest with me. I personally don't have the time or wants to play games. \n\n\nI hire people to be profitable for me and I provide for sbs to just be themselves.",
            "author": "MarzipanInevitable79",
            "id": "j43uhqd",
            "parent_id": "t1_j43tl6l",
            "score": 3,
            "created_utc": 1673567543.0,
            "replies": [
                {
                    "body": ">I provide for sbs to just be themselves\n\nRespectfully: I know that's the fantasy and you need her to sell it, but you've got to keep in the back of your mind that she's doing a lot of work behind the scenes to be the version of herself that you are willing to pay an allowance to. I say this because when I see men argue in favor of paying less to SBs in various situations (a common one is travel allowance), they often make the point that she's not actually working for the money, but instead is getting paid to be herself and hang out with someone she likes. Even if the second part of that is true, though, the first part is not.",
                    "author": "uptiedand8",
                    "id": "j46viik",
                    "parent_id": "t1_j43uhqd",
                    "score": 3,
                    "created_utc": 1673626143.0,
                    "replies": [
                        {
                            "body": "I agree with you regarding the travel. Even though we pay for it the sbs have to take up few days and put their life on pause. They should be compensate for that in ay way they want . Per diem is a must even by labor laws lol.\n\nI get that maintaining a look it's not cheap but honestly in my case I only commit to a sb when I see her in sweatpants and without make up. You would be surprised of the catfishing I've seen on MGs. \n\nAnd it is not a fantasy for me, I like ordinary girls which I would date vanilla as well. That my taste. Never had a thing for the bombshells 6 foot tall model. Been there done that and not my cup of tea.\n\nI know we're a moving ATM I just wish that sbs don't just see us like that because it doesn't last on the long run. Allowance in my opinion it's there to stimulate the relationship and make her life easier. Sadly lots of sbs see this as a job and that is fine plenty of men like that. There's something for everyone in he bowl it's just seems like a traditional sr it's harder to find.",
                            "author": "MarzipanInevitable79",
                            "id": "j4704kc",
                            "parent_id": "t1_j46viik",
                            "score": 2,
                            "created_utc": 1673627885.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "And those who *do* respond to money as a motivator to perform better are exactly the people you need to avoid.  They are the same people who will sell you out or abandon you the moment they perceive the grass is greener elsewhere.",
            "author": "S2USStudios",
            "id": "j44o8dd",
            "parent_id": "t1_j43tl6l",
            "score": 3,
            "created_utc": 1673580344.0,
            "replies": []
        },
        {
            "body": "Ahhh, this happened to me too and still putting myself back together over a year and a half later. Sorry this happened to you.",
            "author": "thehottubistoohawt",
            "id": "j450f1i",
            "parent_id": "t1_j44er56",
            "score": 5,
            "created_utc": 1673586472.0,
            "replies": [
                {
                    "body": "🤗💜💜",
                    "author": "Efficient-Aioli417",
                    "id": "j450mtq",
                    "parent_id": "t1_j450f1i",
                    "score": 1,
                    "created_utc": 1673586588.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Yes I don’t think she’s cruel. Just ungrateful and self centered.",
            "author": "Psychological_Sun374",
            "id": "j459oqu",
            "parent_id": "t1_j44er56",
            "score": 5,
            "created_utc": 1673592037.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "j45qiv4",
                    "parent_id": "t1_j459oqu",
                    "score": 1,
                    "created_utc": 1673604977.0,
                    "replies": [
                        {
                            "body": "I do think goodness is healing, and I wish you the best in rebuilding.  Seeing it, hearing it, hearing about it are tremendously restorative.  Just seeing good people in action has helped me get through rough times (and I hope pass it on).",
                            "author": "Sunny_Heather",
                            "id": "j47agad",
                            "parent_id": "t1_j45qiv4",
                            "score": 2,
                            "created_utc": 1673631638.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Yeah, I think she’s basking in pretty privilege. And it’s been several years since she had a relationship which means her last relationship ended when she was like 25. So it’s possible she simply doesn’t know how to actually show up as a mature partner.\n\nShe claims her last sugar relationship ended because the guy liked her so much he wanted to marry her and she doesn’t want to get married. Based on my own experience with her, I have to believe that guy had low self-esteem.",
            "author": "Psychological_Sun374",
            "id": "j43tijk",
            "parent_id": "t1_j43t1lh",
            "score": 4,
            "created_utc": 1673567150.0,
            "replies": []
        },
        {
            "body": "I didn’t say it impossible. I am saying that the things that I would probably need to do in order to fit with the parameters of a conventional sugar relationship don’t mesh with my personality. Rather than put myself in a position that would make me unhappy, I’m just going to opt for a different path.",
            "author": "Psychological_Sun374",
            "id": "j4i1ysc",
            "parent_id": "t1_j4hz1yk",
            "score": 0,
            "created_utc": 1673818980.0,
            "replies": []
        },
        {
            "body": "😂",
            "author": "Psychological_Sun374",
            "id": "j442iws",
            "parent_id": "t1_j43y3kt",
            "score": 2,
            "created_utc": 1673570861.0,
            "replies": []
        },
        {
            "body": "She actually said to me that she is able to text reliably to people that are important to her. And then she said she was going to make an effort with me. And the results were not great.",
            "author": "Psychological_Sun374",
            "id": "j43tx43",
            "parent_id": "t1_j43tpmt",
            "score": 2,
            "created_utc": 1673567314.0,
            "replies": []
        },
        {
            "body": "Thanks. Yes, I’ve been under appreciated in vanilla dating too. This is definitely a “me” problem",
            "author": "Psychological_Sun374",
            "id": "j45hyag",
            "parent_id": "t1_j45htfd",
            "score": 1,
            "created_utc": 1673598042.0,
            "replies": []
        },
        {
            "body": "She eventually texted me after 24 hours, and said she was dealing with something, she did not say what, and she would let me know about whether or not she could come. Our flight is in eight hours. So at that point I’m done. I don’t need to be sitting there at the airport wondering if she’s going to show up or not",
            "author": "Psychological_Sun374",
            "id": "j43szxb",
            "parent_id": "t1_j43stip",
            "score": 3,
            "created_utc": 1673566938.0,
            "replies": [
                {
                    "body": "Well she might have a good excuse if it's the only red flag but if it adds on on previous problems then you got to next her.",
                    "author": "MarzipanInevitable79",
                    "id": "j43tbd1",
                    "parent_id": "t1_j43szxb",
                    "score": 2,
                    "created_utc": 1673567068.0,
                    "replies": [
                        {
                            "body": "This is the straw that broke the camels back. We had a whole series of problems that I’ve talked to her about and she claimed she was going to fix and then didn’t fix.",
                            "author": "Psychological_Sun374",
                            "id": "j43tlty",
                            "parent_id": "t1_j43tbd1",
                            "score": 3,
                            "created_utc": 1673567187.0,
                            "replies": [
                                {
                                    "body": "I'm sure you are on the flight already, but get it, she isn't worth your time, which frankly is more valuable to you than your money. At least that's the way I have felt about it when in this kind of situation.",
                                    "author": "TheMistressMan",
                                    "id": "j4572fa",
                                    "parent_id": "t1_j43tlty",
                                    "score": 1,
                                    "created_utc": 1673590313.0,
                                    "replies": [
                                        {
                                            "body": "En route to airport!",
                                            "author": "Psychological_Sun374",
                                            "id": "j45b4uy",
                                            "parent_id": "t1_j4572fa",
                                            "score": 2,
                                            "created_utc": 1673593024.0,
                                            "replies": [
                                                {
                                                    "body": "Bon voyage",
                                                    "author": "AleksiaE",
                                                    "id": "j45bpfq",
                                                    "parent_id": "t1_j45b4uy",
                                                    "score": 1,
                                                    "created_utc": 1673593422.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Extenuating circumstances, then we talked about it, and then her behavior did not match her words",
            "author": "Psychological_Sun374",
            "id": "j45cjq7",
            "parent_id": "t1_j45bw77",
            "score": 1,
            "created_utc": 1673594020.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "j45d9uk",
                    "parent_id": "t1_j45cjq7",
                    "score": 0,
                    "created_utc": 1673594540.0,
                    "replies": [
                        {
                            "body": "Fer sure",
                            "author": "Psychological_Sun374",
                            "id": "j45el17",
                            "parent_id": "t1_j45d9uk",
                            "score": 1,
                            "created_utc": 1673595504.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Or just show up for plans",
            "author": "Psychological_Sun374",
            "id": "j46pfta",
            "parent_id": "t1_j46p95v",
            "score": 0,
            "created_utc": 1673623821.0,
            "replies": [
                {
                    "body": "Yes, it’ll all fall right into place. After you take the time you need to heal, try it.",
                    "author": "Babydoll120",
                    "id": "j46q9mp",
                    "parent_id": "t1_j46pfta",
                    "score": 0,
                    "created_utc": 1673624147.0,
                    "replies": [
                        {
                            "body": "thanks for your encouragement",
                            "author": "Psychological_Sun374",
                            "id": "j46qv9h",
                            "parent_id": "t1_j46q9mp",
                            "score": 0,
                            "created_utc": 1673624378.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Not worth the brain damage",
            "author": "Psychological_Sun374",
            "id": "j4792a6",
            "parent_id": "t1_j4752mg",
            "score": 1,
            "created_utc": 1673631134.0,
            "replies": []
        },
        {
            "body": "Thanks! May you find your prince",
            "author": "Psychological_Sun374",
            "id": "j45dmva",
            "parent_id": "t1_j45cku3",
            "score": 2,
            "created_utc": 1673594804.0,
            "replies": []
        },
        {
            "body": "Good theory. Has not worked for me in practice.",
            "author": "Psychological_Sun374",
            "id": "j4d5ar4",
            "parent_id": "t1_j4d1xji",
            "score": -1,
            "created_utc": 1673732797.0,
            "replies": []
        },
        {
            "body": "Do you enjoy spoiling people? Because you could have a FWB and spoil them. Obviously not to that extent, but meals, little treats, small gifts. I've always been a FWB person more than a relationship person myself.",
            "author": "newbytheybe",
            "id": "j4b0ujh",
            "parent_id": "t1_j43wf1c",
            "score": 4,
            "created_utc": 1673700271.0,
            "replies": [
                {
                    "body": "Yeah, that might be the route I head towards",
                    "author": "Psychological_Sun374",
                    "id": "j4br8lc",
                    "parent_id": "t1_j4b0ujh",
                    "score": 2,
                    "created_utc": 1673712850.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Deleting your profile sounds drastic. But I agree you should take a step back and reassess. 🧘 Come back though, once the dust settles and you can breathe freely and optimistically 💗",
            "author": "P0sitiveViibes777",
            "id": "j467qgr",
            "parent_id": "t1_j43wf1c",
            "score": 2,
            "created_utc": 1673616217.0,
            "replies": []
        },
        {
            "body": "Well my therapist has been telling me the same thing. It's working for me, so your publicist may be on to something 🤷🏽‍♀️",
            "author": "CartographerCold7625",
            "id": "j442xk6",
            "parent_id": "t1_j442hlj",
            "score": 7,
            "created_utc": 1673571032.0,
            "replies": []
        },
        {
            "body": ">I provide for sbs to just be themselves\n\nRespectfully: I know that's the fantasy and you need her to sell it, but you've got to keep in the back of your mind that she's doing a lot of work behind the scenes to be the version of herself that you are willing to pay an allowance to. I say this because when I see men argue in favor of paying less to SBs in various situations (a common one is travel allowance), they often make the point that she's not actually working for the money, but instead is getting paid to be herself and hang out with someone she likes. Even if the second part of that is true, though, the first part is not.",
            "author": "uptiedand8",
            "id": "j46viik",
            "parent_id": "t1_j43uhqd",
            "score": 3,
            "created_utc": 1673626143.0,
            "replies": [
                {
                    "body": "I agree with you regarding the travel. Even though we pay for it the sbs have to take up few days and put their life on pause. They should be compensate for that in ay way they want . Per diem is a must even by labor laws lol.\n\nI get that maintaining a look it's not cheap but honestly in my case I only commit to a sb when I see her in sweatpants and without make up. You would be surprised of the catfishing I've seen on MGs. \n\nAnd it is not a fantasy for me, I like ordinary girls which I would date vanilla as well. That my taste. Never had a thing for the bombshells 6 foot tall model. Been there done that and not my cup of tea.\n\nI know we're a moving ATM I just wish that sbs don't just see us like that because it doesn't last on the long run. Allowance in my opinion it's there to stimulate the relationship and make her life easier. Sadly lots of sbs see this as a job and that is fine plenty of men like that. There's something for everyone in he bowl it's just seems like a traditional sr it's harder to find.",
                    "author": "MarzipanInevitable79",
                    "id": "j4704kc",
                    "parent_id": "t1_j46viik",
                    "score": 2,
                    "created_utc": 1673627885.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "🤗💜💜",
            "author": "Efficient-Aioli417",
            "id": "j450mtq",
            "parent_id": "t1_j450f1i",
            "score": 1,
            "created_utc": 1673586588.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "j45qiv4",
            "parent_id": "t1_j459oqu",
            "score": 1,
            "created_utc": 1673604977.0,
            "replies": [
                {
                    "body": "I do think goodness is healing, and I wish you the best in rebuilding.  Seeing it, hearing it, hearing about it are tremendously restorative.  Just seeing good people in action has helped me get through rough times (and I hope pass it on).",
                    "author": "Sunny_Heather",
                    "id": "j47agad",
                    "parent_id": "t1_j45qiv4",
                    "score": 2,
                    "created_utc": 1673631638.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Well she might have a good excuse if it's the only red flag but if it adds on on previous problems then you got to next her.",
            "author": "MarzipanInevitable79",
            "id": "j43tbd1",
            "parent_id": "t1_j43szxb",
            "score": 2,
            "created_utc": 1673567068.0,
            "replies": [
                {
                    "body": "This is the straw that broke the camels back. We had a whole series of problems that I’ve talked to her about and she claimed she was going to fix and then didn’t fix.",
                    "author": "Psychological_Sun374",
                    "id": "j43tlty",
                    "parent_id": "t1_j43tbd1",
                    "score": 3,
                    "created_utc": 1673567187.0,
                    "replies": [
                        {
                            "body": "I'm sure you are on the flight already, but get it, she isn't worth your time, which frankly is more valuable to you than your money. At least that's the way I have felt about it when in this kind of situation.",
                            "author": "TheMistressMan",
                            "id": "j4572fa",
                            "parent_id": "t1_j43tlty",
                            "score": 1,
                            "created_utc": 1673590313.0,
                            "replies": [
                                {
                                    "body": "En route to airport!",
                                    "author": "Psychological_Sun374",
                                    "id": "j45b4uy",
                                    "parent_id": "t1_j4572fa",
                                    "score": 2,
                                    "created_utc": 1673593024.0,
                                    "replies": [
                                        {
                                            "body": "Bon voyage",
                                            "author": "AleksiaE",
                                            "id": "j45bpfq",
                                            "parent_id": "t1_j45b4uy",
                                            "score": 1,
                                            "created_utc": 1673593422.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "j45d9uk",
            "parent_id": "t1_j45cjq7",
            "score": 0,
            "created_utc": 1673594540.0,
            "replies": [
                {
                    "body": "Fer sure",
                    "author": "Psychological_Sun374",
                    "id": "j45el17",
                    "parent_id": "t1_j45d9uk",
                    "score": 1,
                    "created_utc": 1673595504.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Yes, it’ll all fall right into place. After you take the time you need to heal, try it.",
            "author": "Babydoll120",
            "id": "j46q9mp",
            "parent_id": "t1_j46pfta",
            "score": 0,
            "created_utc": 1673624147.0,
            "replies": [
                {
                    "body": "thanks for your encouragement",
                    "author": "Psychological_Sun374",
                    "id": "j46qv9h",
                    "parent_id": "t1_j46q9mp",
                    "score": 0,
                    "created_utc": 1673624378.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Yeah, that might be the route I head towards",
            "author": "Psychological_Sun374",
            "id": "j4br8lc",
            "parent_id": "t1_j4b0ujh",
            "score": 2,
            "created_utc": 1673712850.0,
            "replies": []
        },
        {
            "body": "I agree with you regarding the travel. Even though we pay for it the sbs have to take up few days and put their life on pause. They should be compensate for that in ay way they want . Per diem is a must even by labor laws lol.\n\nI get that maintaining a look it's not cheap but honestly in my case I only commit to a sb when I see her in sweatpants and without make up. You would be surprised of the catfishing I've seen on MGs. \n\nAnd it is not a fantasy for me, I like ordinary girls which I would date vanilla as well. That my taste. Never had a thing for the bombshells 6 foot tall model. Been there done that and not my cup of tea.\n\nI know we're a moving ATM I just wish that sbs don't just see us like that because it doesn't last on the long run. Allowance in my opinion it's there to stimulate the relationship and make her life easier. Sadly lots of sbs see this as a job and that is fine plenty of men like that. There's something for everyone in he bowl it's just seems like a traditional sr it's harder to find.",
            "author": "MarzipanInevitable79",
            "id": "j4704kc",
            "parent_id": "t1_j46viik",
            "score": 2,
            "created_utc": 1673627885.0,
            "replies": []
        },
        {
            "body": "I do think goodness is healing, and I wish you the best in rebuilding.  Seeing it, hearing it, hearing about it are tremendously restorative.  Just seeing good people in action has helped me get through rough times (and I hope pass it on).",
            "author": "Sunny_Heather",
            "id": "j47agad",
            "parent_id": "t1_j45qiv4",
            "score": 2,
            "created_utc": 1673631638.0,
            "replies": []
        },
        {
            "body": "This is the straw that broke the camels back. We had a whole series of problems that I’ve talked to her about and she claimed she was going to fix and then didn’t fix.",
            "author": "Psychological_Sun374",
            "id": "j43tlty",
            "parent_id": "t1_j43tbd1",
            "score": 3,
            "created_utc": 1673567187.0,
            "replies": [
                {
                    "body": "I'm sure you are on the flight already, but get it, she isn't worth your time, which frankly is more valuable to you than your money. At least that's the way I have felt about it when in this kind of situation.",
                    "author": "TheMistressMan",
                    "id": "j4572fa",
                    "parent_id": "t1_j43tlty",
                    "score": 1,
                    "created_utc": 1673590313.0,
                    "replies": [
                        {
                            "body": "En route to airport!",
                            "author": "Psychological_Sun374",
                            "id": "j45b4uy",
                            "parent_id": "t1_j4572fa",
                            "score": 2,
                            "created_utc": 1673593024.0,
                            "replies": [
                                {
                                    "body": "Bon voyage",
                                    "author": "AleksiaE",
                                    "id": "j45bpfq",
                                    "parent_id": "t1_j45b4uy",
                                    "score": 1,
                                    "created_utc": 1673593422.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Fer sure",
            "author": "Psychological_Sun374",
            "id": "j45el17",
            "parent_id": "t1_j45d9uk",
            "score": 1,
            "created_utc": 1673595504.0,
            "replies": []
        },
        {
            "body": "thanks for your encouragement",
            "author": "Psychological_Sun374",
            "id": "j46qv9h",
            "parent_id": "t1_j46q9mp",
            "score": 0,
            "created_utc": 1673624378.0,
            "replies": []
        },
        {
            "body": "I'm sure you are on the flight already, but get it, she isn't worth your time, which frankly is more valuable to you than your money. At least that's the way I have felt about it when in this kind of situation.",
            "author": "TheMistressMan",
            "id": "j4572fa",
            "parent_id": "t1_j43tlty",
            "score": 1,
            "created_utc": 1673590313.0,
            "replies": [
                {
                    "body": "En route to airport!",
                    "author": "Psychological_Sun374",
                    "id": "j45b4uy",
                    "parent_id": "t1_j4572fa",
                    "score": 2,
                    "created_utc": 1673593024.0,
                    "replies": [
                        {
                            "body": "Bon voyage",
                            "author": "AleksiaE",
                            "id": "j45bpfq",
                            "parent_id": "t1_j45b4uy",
                            "score": 1,
                            "created_utc": 1673593422.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "En route to airport!",
            "author": "Psychological_Sun374",
            "id": "j45b4uy",
            "parent_id": "t1_j4572fa",
            "score": 2,
            "created_utc": 1673593024.0,
            "replies": [
                {
                    "body": "Bon voyage",
                    "author": "AleksiaE",
                    "id": "j45bpfq",
                    "parent_id": "t1_j45b4uy",
                    "score": 1,
                    "created_utc": 1673593422.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Bon voyage",
            "author": "AleksiaE",
            "id": "j45bpfq",
            "parent_id": "t1_j45b4uy",
            "score": 1,
            "created_utc": 1673593422.0,
            "replies": []
        }
    ]
}