{
    "title": "Vanilla (almost)boyfriend thought I was kidding when I said I sugar(ed) and now he's mad",
    "post_id": "mxgb9p",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/mxgb9p/vanilla_almostboyfriend_thought_i_was_kidding/",
    "author": "ionlyhavesexformoney",
    "body": "So my life is a joke. A weird situation roughly three months ago involving some friends and a guy that was interested in me led to my friends spilling that I sugar/sugared. Guy and me don't talk for a while but then we do and he asked me whether that was true. I said yeah because I have all those mutual friends with him who can corroborate even if I lie. \n\nHe makes tonnes of jokes about it, good-natured stuff talking about 'I got an envelope of cash fo you', and 'I'll love on you so good your whore ass will forget about the money' (I'm paraphrasing but it felt like good-natured roasting). So we see each other recently and we're talking. The subject comes to sex work and I make a comment about being in compensated relationships and he's like:\n\n\"WTF you weren't kidding about that??\"\n\nand now dude is mad. He was like \"but you lost your virginity so late(in my twnties), and you're so naive(rude) and you got so wet when i touched you (??? do you stop getting wet when you have sex for money?).\"\n\nAnyway, dude is sulking at the moment. IDK what to do. He told me to lie next time if it came up with a guy, especially if I really like him. \n\nHeh.",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/mxgb9p/vanilla_almostboyfriend_thought_i_was_kidding/",
    "score": 97,
    "upvote_ratio": 0.95,
    "created_utc": 1619255472.0,
    "num_comments": 112,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "What made me laugh the most, and what made me think you should get rid of this guy is the comment about you being wet. \n\nThis shows his mental age, which is too young for an adult relationship.",
            "author": "DecisiveB",
            "id": "gvokpbs",
            "parent_id": "t3_mxgb9p",
            "score": 93,
            "created_utc": 1619266199.0,
            "replies": [
                {
                    "body": "I was so confused when he said that. He said something like women who’ve slept with loads of guys need lube because they can’t get wet naturally. I was total confusion",
                    "author": "ionlyhavesexformoney",
                    "id": "gvouxrx",
                    "parent_id": "t1_gvokpbs",
                    "score": 28,
                    "created_utc": 1619269268.0,
                    "replies": [
                        {
                            "body": "Oh so he's someone who also thinks that women's vaginas get loose when they've been stretched out by soooooo many partners but not that a man's penis shrinks from being inside too many tight holes. \n\nHe sounds like he can't arouse a woman who's experienced and has had good sex because he's shit in bed.",
                            "author": "secretactorian",
                            "id": "gvpj12e",
                            "parent_id": "t1_gvouxrx",
                            "score": 38,
                            "created_utc": 1619275639.0,
                            "replies": [
                                {
                                    "body": "The “stretching out” myth fascinates me, I have so many questions for them! Does it just stretch with every new partner or do you need to ration your sexings with your girlfriend or wife so you don’t use it up too fast? When women give birth to baby humans who are the size of many handfuls of dicks, do they just walk around like a windsock, hoping they don’t catch sail?",
                                    "author": null,
                                    "id": "gvpvhbv",
                                    "parent_id": "t1_gvpj12e",
                                    "score": 29,
                                    "created_utc": 1619279267.0,
                                    "replies": [
                                        {
                                            "body": "Love it. You sound like a delightful lady, let's be friends.",
                                            "author": "secretactorian",
                                            "id": "gvpvww3",
                                            "parent_id": "t1_gvpvhbv",
                                            "score": 11,
                                            "created_utc": 1619279412.0,
                                            "replies": [
                                                {
                                                    "body": "I’ll bring a cheese plate, you bring the wine. 🥂",
                                                    "author": null,
                                                    "id": "gvpyzlq",
                                                    "parent_id": "t1_gvpvww3",
                                                    "score": 9,
                                                    "created_utc": 1619280395.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "I’m so tempted to air this man out properly but it wouldn’t be proper.",
                                    "author": "ionlyhavesexformoney",
                                    "id": "gvpv53i",
                                    "parent_id": "t1_gvpj12e",
                                    "score": 4,
                                    "created_utc": 1619279154.0,
                                    "replies": [
                                        {
                                            "body": "Meh. Look around you. Many would consider sugaring unproper (clearly he does) and I personally think taking the high road is overrated on some occasions. \n\nDo what makes you feel good if you no longer want him in your life, proper be damned.",
                                            "author": "secretactorian",
                                            "id": "gvpvl56",
                                            "parent_id": "t1_gvpv53i",
                                            "score": 6,
                                            "created_utc": 1619279302.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "Even Jesus called the Pharisees a \"brood of vipers\" in public. Tough love is still love.",
                                            "author": null,
                                            "id": "gvq3e0g",
                                            "parent_id": "t1_gvpv53i",
                                            "score": 2,
                                            "created_utc": 1619282143.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "r/justnoso\n\nSounds like he’d fit right in here.",
                                            "author": "Cdnsugarr",
                                            "id": "gvq6rsa",
                                            "parent_id": "t1_gvpv53i",
                                            "score": 2,
                                            "created_utc": 1619283829.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "Did you tell him how nonsensical that was? It’s a long shot but maybe he’ll see his preconceived notions are wrong? (Plus there’s no difference between someone sleeping with one man 100 times or 100 different men..) either way I don’t think you should be with him he’s clearly not going to respect you",
                            "author": null,
                            "id": "gvq3cqn",
                            "parent_id": "t1_gvouxrx",
                            "score": 3,
                            "created_utc": 1619282126.0,
                            "replies": [
                                {
                                    "body": "Maybe I met all his expectations for ‘girl who would never do that’ so when it turned out I was a girl who indeed, did that, his mental couldn’t handle it and he fled",
                                    "author": "ionlyhavesexformoney",
                                    "id": "gvq71da",
                                    "parent_id": "t1_gvq3cqn",
                                    "score": 3,
                                    "created_utc": 1619283944.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "I mean, some of us here want to know too if she gets wet when she has sex for money. /s",
                    "author": "pintodinosaur",
                    "id": "gvyx3ui",
                    "parent_id": "t1_gvokpbs",
                    "score": 2,
                    "created_utc": 1619467613.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "If he’s not your boyfriend, not your (almost) boyfriend, then he’s certainly not entitled to hold anger over you about your decisions. \n\nSecondly, if a guy that was supposedly my almost boyfriend spoke to me like that, then I’d probably punch him in the mouth. \n\nThirdly, I think you deserve better.",
            "author": "CallMeHyun",
            "id": "gvnx2su",
            "parent_id": "t3_mxgb9p",
            "score": 167,
            "created_utc": 1619256082.0,
            "replies": [
                {
                    "body": "ALL OF THIS",
                    "author": "brattysubsandwich",
                    "id": "gvnxbka",
                    "parent_id": "t1_gvnx2su",
                    "score": 34,
                    "created_utc": 1619256325.0,
                    "replies": []
                },
                {
                    "body": "ouch. tell it to me straight, doctor",
                    "author": "ionlyhavesexformoney",
                    "id": "gvnzhpg",
                    "parent_id": "t1_gvnx2su",
                    "score": 42,
                    "created_utc": 1619258297.0,
                    "replies": [
                        {
                            "body": "Yeah, we are all telling you to get away from this dude. He's literal cancer. Yuck.",
                            "author": "TrumpsCovidfefe",
                            "id": "gvonfdf",
                            "parent_id": "t1_gvnzhpg",
                            "score": 28,
                            "created_utc": 1619267020.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "I agree with your second point and third point. \n\nJust curious, how would you feel if you talked to an almost bf and find out that he is a SD.  Maybe anger isn't the right word but would you be disappointed?",
                    "author": "BeauTofu",
                    "id": "gvo3od8",
                    "parent_id": "t1_gvnx2su",
                    "score": 7,
                    "created_utc": 1619260214.0,
                    "replies": [
                        {
                            "body": "I would be disappointed but accepting of the circumstances. I wouldn’t be disappointed in him and I definitely wouldn’t feel entitled enough to try and make him feel like shit about it. \n\nThat would be extremely hypocritical of me. And even if I didn’t sugar date myself, I still wouldn’t be upset with said “almost boyfriend” lol it’s just called differences in personal choices and lifestyles. \n\n\nEither way, dudes a dick.",
                            "author": "CallMeHyun",
                            "id": "gvp2yfr",
                            "parent_id": "t1_gvo3od8",
                            "score": 16,
                            "created_utc": 1619271415.0,
                            "replies": []
                        },
                        {
                            "body": "I wouldn’t have a right to be disappointed given my past but I’d want him to stop whilst being with me. I do stop when with vanilla boyfriends if they want me to.",
                            "author": "ionlyhavesexformoney",
                            "id": "gvorz4v",
                            "parent_id": "t1_gvo3od8",
                            "score": 5,
                            "created_utc": 1619268357.0,
                            "replies": [
                                {
                                    "body": "He isn't going to stop being an ass when he is with you. The fact is clear, if he really wanted stuff to work between yall he wouldn't hold your past against you, or make jokes with calling you a whore or anything in that nature. \n\nIt's simple, if he can't respect you and your past, he doesn't deserve you. Let him sulk by himself darlin you deserve so much better.",
                                    "author": null,
                                    "id": "gvowq3h",
                                    "parent_id": "t1_gvorz4v",
                                    "score": 15,
                                    "created_utc": 1619269760.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "🥵 u/callmehyun is on da money",
                    "author": "searchfete",
                    "id": "gvqe6b8",
                    "parent_id": "t1_gvnx2su",
                    "score": 2,
                    "created_utc": 1619287346.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Sadly, this is why so many on SLF caution against sharing our sugar lives with friends, family and loved ones. Many are more judgmental and less understanding than we think or expect",
            "author": "BinghamtonSD",
            "id": "gvoa5xb",
            "parent_id": "t3_mxgb9p",
            "score": 20,
            "created_utc": 1619262763.0,
            "replies": [
                {
                    "body": "Agreed...keep your sugar life separate from your vanilla life...ALWAYS!!!",
                    "author": "chippyboy11254",
                    "id": "gvoh91v",
                    "parent_id": "t1_gvoa5xb",
                    "score": 9,
                    "created_utc": 1619265167.0,
                    "replies": []
                },
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "gvoi4pw",
                    "parent_id": "t1_gvoa5xb",
                    "score": 5,
                    "created_utc": 1619265446.0,
                    "replies": [
                        {
                            "body": "... are they different? I think it’s a branch on the prostitution tree if you will. I know there are elements or SRs that aren’t part of prostitution but at the end of the day someone is being compensated for intimacy.",
                            "author": "ionlyhavesexformoney",
                            "id": "gvos7s2",
                            "parent_id": "t1_gvoi4pw",
                            "score": 19,
                            "created_utc": 1619268435.0,
                            "replies": [
                                {
                                    "body": "Yes, they're different. If you're going to say that any time someone gives someone something of value in expectation of sex it is prostitution, then every relationship is prostitution at times. Legally and practically there is more to prostitution than I give you something of value and we have sex. It is very rare for any relationship to be based on complete financial equality, so one person is almost always getting paid.\n\nThere are escorts on SA and some sugar babies who are operating very similarly to escorts, for sure. But in my experience most sugar relationships have a lot more in common with vanilla dating than prostitution.",
                                    "author": "ziggy440",
                                    "id": "gvpyn9d",
                                    "parent_id": "t1_gvos7s2",
                                    "score": 1,
                                    "created_utc": 1619280286.0,
                                    "replies": [
                                        {
                                            "body": "It's not just expectation. Depending on the Vice code it could be \"made available for sex\" which denotes that gifts or cash exchanged for the opportunity of sex without the promise of. That literally equals sugaring. So in California for example it still can be seen as prostitution depending on if Vice want to bust you and the DA wants to follow through.\n\nBut yes based on the precinct sugaring can fall in the same box as escorting with GFE. Especially if a PPM arrangement.",
                                            "author": null,
                                            "id": "gvq4977",
                                            "parent_id": "t1_gvpyn9d",
                                            "score": 3,
                                            "created_utc": 1619282574.0,
                                            "replies": [
                                                {
                                                    "body": "First, to be clear the strength of my objection to calling sugaring prostitution is because that argument is often used to shame and manipulate sugar babies, often to refuse to pay them as agreed, etc.\n\nSecond, your argument ignores legal precedent. The letter of most prostitution laws could apply to almost all sexual relationships at some point. But the law is not applied as you suggest. The general application is that there needs to be an offer of specific sexual acts in return for payment. Sure, police can arrest any of us for anything and we can be prosecuted, but the case will be thrown out quickly if it gets to court. I am not aware of a single precedent of SB/SD being successfully prosecuted for prostitution. Are you?\n\nThird, by limiting your definition to the legal definition, you ignore all the ways in which the behavior of most SBs is very, very different from the behavior of escorts.\n\nEscorts are usually very talented and lovely performers who provide a great service. They are athletes, actors, therapists and entrepreneurs who are unfairly stigmatized by society. So being called an escort should not be shaming, but it often is. Calling something prostitution is pretty much always derogatory, unfortunately.\n\nOf course there are SBs who cross the line. I recently had a brief discussion with a POT who, while we were discussing ppm, wanted to tell me about how good she is at BJ's. As noted above, offering payment in exchange for specific sexual acts is what they prosecute as prostitution. Was she a sting, a SB/escort who didn't know better, or just very proud of her BJ's? I'll never know.",
                                                    "author": "ziggy440",
                                                    "id": "gvqinzm",
                                                    "parent_id": "t1_gvq4977",
                                                    "score": 2,
                                                    "created_utc": 1619289542.0,
                                                    "replies": [
                                                        {
                                                            "body": "The fact that some say escorting or any sex work is somehow shameful while participating in a legal equivalent (depending on vice law) says more about them than the law itself. I find it amusing some SDs and SBs try to justify the relationship as different when in court it might not be. Regardless there is still burden of proof in any case and it depends on how bored vice is.",
                                                            "author": null,
                                                            "id": "gvqjjyg",
                                                            "parent_id": "t1_gvqinzm",
                                                            "score": 3,
                                                            "created_utc": 1619289971.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "gvoshho",
                                    "parent_id": "t1_gvos7s2",
                                    "score": 0,
                                    "created_utc": 1619268554.0,
                                    "replies": [
                                        {
                                            "body": "The username was a joke lol but thanks a lot for your input",
                                            "author": "ionlyhavesexformoney",
                                            "id": "gvoupmo",
                                            "parent_id": "t1_gvoshho",
                                            "score": 5,
                                            "created_utc": 1619269205.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "I agree. If you break it down to basics, it's the same; however there are also distinct differences. Depends on your point of view/field of view.",
                                    "author": "pintodinosaur",
                                    "id": "gvyy1ke",
                                    "parent_id": "t1_gvos7s2",
                                    "score": 1,
                                    "created_utc": 1619468024.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Eww. Throw him away. He sounds insecure and probably broke too. And why were your friends spilling all your business, if you don’t mind answering?",
            "author": null,
            "id": "gvp1msy",
            "parent_id": "t3_mxgb9p",
            "score": 19,
            "created_utc": 1619271070.0,
            "replies": [
                {
                    "body": "Long story short the friend that spilled my business was mad at me at the time. We’ve since reconciled but I was shocked when the guy in question told me that he had been informed. I generally don’t bring up my sugar activities but in this case felt backed into a wall since he had other ways of confirming it.",
                    "author": "ionlyhavesexformoney",
                    "id": "gvp3lvi",
                    "parent_id": "t1_gvp1msy",
                    "score": 7,
                    "created_utc": 1619271584.0,
                    "replies": [
                        {
                            "body": "This immature, childish boy-man isn't the only relationship that needs to be booted out of your life. Dump that shitty friend too. It appalls me that she would reveal something so personal about you. \n\nOne of the benefits of age is you learn to accept that what ever happened before you came along is none of your business.",
                            "author": "Ok-Tale-8876",
                            "id": "gvpbks8",
                            "parent_id": "t1_gvp3lvi",
                            "score": 18,
                            "created_utc": 1619273730.0,
                            "replies": [
                                {
                                    "body": "I was really shocked that the information was relayed to him but instead of being mad at the time, I copped to it since he could always ask her. Thanks for the advice",
                                    "author": "ionlyhavesexformoney",
                                    "id": "gvpm9oe",
                                    "parent_id": "t1_gvpbks8",
                                    "score": 4,
                                    "created_utc": 1619276446.0,
                                    "replies": [
                                        {
                                            "body": "Ugh, I feel for you. Nothing worse than a friend's betrayal.",
                                            "author": "Ok-Tale-8876",
                                            "id": "gvpmot7",
                                            "parent_id": "t1_gvpm9oe",
                                            "score": 7,
                                            "created_utc": 1619276553.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "That’s horrible. I’m sorry that happened to you. But I’d ditch the friend too. If he/she would do it to you once, they’d do it again.",
                            "author": null,
                            "id": "gvq6j2u",
                            "parent_id": "t1_gvp3lvi",
                            "score": 4,
                            "created_utc": 1619283709.0,
                            "replies": [
                                {
                                    "body": "🥲",
                                    "author": "ionlyhavesexformoney",
                                    "id": "gvqaln8",
                                    "parent_id": "t1_gvq6j2u",
                                    "score": 2,
                                    "created_utc": 1619285608.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Those jokes don't sound good natured at all. In fact they sound pointedly demeaning and accusatory. He sounds really horrible. Go find someone nice and never mention your sugar life to anyone else.",
            "author": "Ok-Tale-8876",
            "id": "gvpl5yc",
            "parent_id": "t3_mxgb9p",
            "score": 15,
            "created_utc": 1619276168.0,
            "replies": [
                {
                    "body": "Noted. I shouldn’t have trusted that info (my sugar life) to be safe with anyone. Literally anyone.",
                    "author": "ionlyhavesexformoney",
                    "id": "gvpoim3",
                    "parent_id": "t1_gvpl5yc",
                    "score": 3,
                    "created_utc": 1619277039.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "He’s childish girl. There’s a charming, mature man out there for you. 💎",
            "author": null,
            "id": "gvoj6f7",
            "parent_id": "t3_mxgb9p",
            "score": 9,
            "created_utc": 1619265751.0,
            "replies": []
        },
        {
            "body": "Dude sounds like an idiot.  Not worth your time.",
            "author": "Samuraiguy747",
            "id": "gvp55q2",
            "parent_id": "t3_mxgb9p",
            "score": 6,
            "created_utc": 1619272057.0,
            "replies": []
        },
        {
            "body": "So he’s already judging you and trying to control your life and you aren’t even dating yet? \n\nYa, you dodged a bullet here \n\nGo “date” a guy 20 years older than him and send a picture from a vacation beach of your choosing",
            "author": "KnocDown",
            "id": "gvp702f",
            "parent_id": "t3_mxgb9p",
            "score": 4,
            "created_utc": 1619272555.0,
            "replies": []
        },
        {
            "body": "How dare you not take the needs of a hypothetical future boyfriend into consideration when you make your decisions! \n\nFind someone who respects your own agency and autonomy. I think whether or not to disclose is up to you— he does not have a right to a hearing of your entire past and it’s your call if you’d like to share that with your future partners. But this guy sucks and seems to have very little understanding or respect for women.",
            "author": null,
            "id": "gvpse4x",
            "parent_id": "t3_mxgb9p",
            "score": 4,
            "created_utc": 1619278205.0,
            "replies": []
        },
        {
            "body": "Preferably you discuss your relationship as an interesting more mature gentleman who respects and  likes to spoil you. \n\nUnder NO circumstances discuss the economic details of your sugar relationship with a girlfriend.",
            "author": "pinotandsugar",
            "id": "gvqdz3t",
            "parent_id": "t3_mxgb9p",
            "score": 3,
            "created_utc": 1619287247.0,
            "replies": [
                {
                    "body": "Seems that the discussion was the issue. How was I supposed to know she’d air my shit out when she was mad at me? Oh well. We move.",
                    "author": "ionlyhavesexformoney",
                    "id": "gvqhm5f",
                    "parent_id": "t1_gvqdz3t",
                    "score": 1,
                    "created_utc": 1619289028.0,
                    "replies": [
                        {
                            "body": "> How was I supposed to know she’d air my shit out when she was mad at me?\n\nYou don't, but EXACTLY because you don't i would not share details with \"friends\". At this point, you know who's who based on that.",
                            "author": "pintodinosaur",
                            "id": "gvyyyht",
                            "parent_id": "t1_gvqhm5f",
                            "score": 1,
                            "created_utc": 1619468430.0,
                            "replies": [
                                {
                                    "body": "Thought I was safe because she's sugared as well. Noted. Not making that mistake again.",
                                    "author": "ionlyhavesexformoney",
                                    "id": "gw292yq",
                                    "parent_id": "t1_gvyyyht",
                                    "score": 1,
                                    "created_utc": 1619538406.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I think we often have unrealistic ideas about someone in the beginning of a relationship.  As we learn more about them sometimes we find out they are a different person than we thought which can suck.  It sounds like he has this image of you as this innocent, inexperienced young woman, which may not be correct.  You don't need to live up to his expectations and if who you are isn't what he wants then he should be an adult and move on.  \n\nI often try to defuse awkward situations with humor and sometimes end up saying things that aren't appropriate or make things worse.  So I'm sympathetic to that on his part but I think a lot of what he said to you isn't appropriate.  Seems like he's implying that you'd just have sex with anyone for money and some weird assumptions about your sex life.  I'd say time to move on.",
            "author": "DefinitionStrict500",
            "id": "gvoh1cs",
            "parent_id": "t3_mxgb9p",
            "score": 3,
            "created_utc": 1619265073.0,
            "replies": [
                {
                    "body": "Inexperienced young woman and girl who sugar(Ed). These categories are not mutually exclusive if you ask me",
                    "author": "ionlyhavesexformoney",
                    "id": "gvosg23",
                    "parent_id": "t1_gvoh1cs",
                    "score": 4,
                    "created_utc": 1619268536.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "There will always be insecure little boys no matter their age. If they can't handle who you are and love you for it, they are not worth your time.",
            "author": "dontcallmechristian",
            "id": "gvoo33i",
            "parent_id": "t3_mxgb9p",
            "score": 2,
            "created_utc": 1619267226.0,
            "replies": []
        },
        {
            "body": "Wow that guy sounds like a loser. Listen I sugar and I have boyfriend and everyone is fine with the situation. Theres nothing wrong with sugaring and there's no reason he should have just assumed you were kidding. Similar things used to happen to me when I was in my early 20s and working as a stripper. I would tell potential dates and it was all fun and games until they processed that crowds of people saw me naked for money. Then they get all insecure and say rude things. Their loss.",
            "author": "pour_the_tea",
            "id": "gvoovf9",
            "parent_id": "t3_mxgb9p",
            "score": 2,
            "created_utc": 1619267459.0,
            "replies": []
        },
        {
            "body": "I hate boyfriends. Husbands are no problem, but no matter what they say, boyfriends always get jealous. Then their immaturity shows itself in shit like you just described. I advised my daughter when she was in college and going through shit with her college boyfriend, to never date a man, or woman, less than 10 year older.\n\nNow, don't let this asshole guilt you. You live your life your way. Took me a long time to learn not to give a rat's ass what other people think of me or my lifestyle. Learn that lesson now.",
            "author": "AFSMSgt",
            "id": "gvourai",
            "parent_id": "t3_mxgb9p",
            "score": 2,
            "created_utc": 1619269217.0,
            "replies": [
                {
                    "body": "LOL, I think you might have a great point there!",
                    "author": null,
                    "id": "gvpqx6c",
                    "parent_id": "t1_gvourai",
                    "score": 1,
                    "created_utc": 1619277746.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Thanks for all the input. Curious how many of you men would hold it against someone you were (vanilla) pursuing would be okay with her having a past in sugar.",
            "author": "ionlyhavesexformoney",
            "id": "gvoxp27",
            "parent_id": "t3_mxgb9p",
            "score": 2,
            "created_utc": 1619270027.0,
            "replies": [
                {
                    "body": "To be fair, you're asking the SD's here if they are ok with their date having prostituted(a branch of) in the past.\n\nIf you ask a non-sugar related subreddit, likely many would be negative towards someone who had sex with a series of the other gender in the past for money.",
                    "author": "FFF1mclauren",
                    "id": "gvp99jz",
                    "parent_id": "t1_gvoxp27",
                    "score": 1,
                    "created_utc": 1619273153.0,
                    "replies": [
                        {
                            "body": "I realise that. I also know that a lot of cognitive dissonance can exist within a person when it comes to sexuality, morality etc so yeah, I’m aware I’m talking to the ‘initiated’ :)",
                            "author": "ionlyhavesexformoney",
                            "id": "gvpuwmu",
                            "parent_id": "t1_gvp99jz",
                            "score": 1,
                            "created_utc": 1619279075.0,
                            "replies": [
                                {
                                    "body": "Yeah hope I didn't offend. Though more people know about sugar nowadays, its still quite... controversial to the mainstream to be honest.\n\nThat being said I do respect you for being up front and honest. Your guy is an asshole, and better you found out sooner rather than later. Wish you the best.",
                                    "author": "FFF1mclauren",
                                    "id": "gvpw5se",
                                    "parent_id": "t1_gvpuwmu",
                                    "score": 2,
                                    "created_utc": 1619279494.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "It’s not a branch of prostitution, it’s a branch of sex work and there’s a massive difference.",
                            "author": null,
                            "id": "gvprgwk",
                            "parent_id": "t1_gvp99jz",
                            "score": 0,
                            "created_utc": 1619277917.0,
                            "replies": [
                                {
                                    "body": "Could you explain the difference?",
                                    "author": "FFF1mclauren",
                                    "id": "gvpujwx",
                                    "parent_id": "t1_gvprgwk",
                                    "score": 1,
                                    "created_utc": 1619278955.0,
                                    "replies": [
                                        {
                                            "body": "Sex work is an umbrella term that encompasses sugaring, camming, exotic dancing, and yes, also street based prostitution. Although legislation is slow as always to adopt new language, the differentiation represents both the wholistic element of sex work as a labor entity while also recognizing that sex work is not monolithic. We don’t need to lobby for needle exchange programs and secure housing solutions for cam girls, for example. To equate sugaring, which is relatively safe and done with full agency within the context of sex work, with prostitution, which is often in tandem with homelessness and substance abuse and occurs as a survival means in which meaningful consent cannot be given, is disingenuous.",
                                            "author": null,
                                            "id": "gvpxw17",
                                            "parent_id": "t1_gvpujwx",
                                            "score": 1,
                                            "created_utc": 1619280046.0,
                                            "replies": [
                                                {
                                                    "body": "I see, thank you for the info and I'll update my vocabulary.",
                                                    "author": "FFF1mclauren",
                                                    "id": "gvpy7hd",
                                                    "parent_id": "t1_gvpxw17",
                                                    "score": 1,
                                                    "created_utc": 1619280145.0,
                                                    "replies": [
                                                        {
                                                            "body": "No problem! Thanks for asking earnestly.",
                                                            "author": null,
                                                            "id": "gvq1bhe",
                                                            "parent_id": "t1_gvpy7hd",
                                                            "score": 1,
                                                            "created_utc": 1619281201.0,
                                                            "replies": []
                                                        },
                                                        {
                                                            "body": "Eh, I wouldn’t update your vocabulary with this definition -  it’s quite classist and not really accurate either... You seem like the type to be able to do your own research and form your own opinions. Just my 2 cents. Xo",
                                                            "author": "realmodelnomij",
                                                            "id": "gvrkwzn",
                                                            "parent_id": "t1_gvpy7hd",
                                                            "score": 1,
                                                            "created_utc": 1619309399.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "People have different opinions,some people think its a branch of sex work,and other people think its a branch of dating like, trophy girlfriends/wives, housewives mistresses.",
                                    "author": "Secret_Diet7053",
                                    "id": "gvy7a72",
                                    "parent_id": "t1_gvprgwk",
                                    "score": 1,
                                    "created_utc": 1619456660.0,
                                    "replies": [
                                        {
                                            "body": "That is also a totally fair and valid perspective. My point is more that if you’re going to put it under the catch-all umbrella of sex work, it should at least be denoted correctly.",
                                            "author": null,
                                            "id": "gvybfw3",
                                            "parent_id": "t1_gvy7a72",
                                            "score": 1,
                                            "created_utc": 1619458410.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Fuck him🗣 (not in the good way), he sounds like an ass",
            "author": null,
            "id": "gvp1elv",
            "parent_id": "t3_mxgb9p",
            "score": 2,
            "created_utc": 1619271012.0,
            "replies": []
        },
        {
            "body": "Do you know about his past? \n\nI really hate when people say it’s okay for men to sleep around with so many women, but it’s not okay for women? Men would literally pay for things just to sleep with women? 🙄🙄\nLosing virginity in 20s isn’t late either. I lost mine at age 23. Who decides the best age to lose virginity?",
            "author": "zuckdemtee",
            "id": "gvr6jp2",
            "parent_id": "t3_mxgb9p",
            "score": 2,
            "created_utc": 1619301678.0,
            "replies": [
                {
                    "body": "Not that it matters but I can count all my sugar and vanilla relationships on 1 hand (without repeating any fingers) so sleeping around is pushing it. Also it’s not a competition but got you beat on the virginity too 😶 but I see what you mean.",
                    "author": "ionlyhavesexformoney",
                    "id": "gvrwc8n",
                    "parent_id": "t1_gvr6jp2",
                    "score": 1,
                    "created_utc": 1619315649.0,
                    "replies": [
                        {
                            "body": "I mean the double standards that women have to go through, I’ve seen too many men saying they don’t want a woman with more than 5 body count when their body count is 10x higher. Also ‘being virgin/losing virginity = naive’ idea makes me sick. Sure, girls may be naive but men getting off from the idea of fucking and grooming inexperienced girls... is disgusting.",
                            "author": "zuckdemtee",
                            "id": "gvryam8",
                            "parent_id": "t1_gvrwc8n",
                            "score": 1,
                            "created_utc": 1619316801.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Hahaha his little princess isn't a princess an now hes crying about it",
            "author": "squeeze_it_do_it",
            "id": "gvrai7x",
            "parent_id": "t3_mxgb9p",
            "score": 2,
            "created_utc": 1619303763.0,
            "replies": [
                {
                    "body": "👸",
                    "author": "ionlyhavesexformoney",
                    "id": "gvrwes0",
                    "parent_id": "t1_gvrai7x",
                    "score": 1,
                    "created_utc": 1619315688.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "That guy is a douche! No doubt about that . \n\nHoweverrrr, most people outside the lifestyle often view it as sex work and look down on it. Therefore, I personally wouldn’t tell someone I am pursuing a vanilla relationship with that I used to sugar. Cause I our society, that isn’t “socially acceptable “ . \nI keep my escapades to myself.",
            "author": "bumbusaucee",
            "id": "gvpuvnl",
            "parent_id": "t3_mxgb9p",
            "score": 3,
            "created_utc": 1619279066.0,
            "replies": [
                {
                    "body": "Fully agree. I didn’t tell him, someone who is close to both of us told him, which backed me into a corner because if I lied, he could always find out the truth. Thats it, I am taking my shit to the grave. Deny until I die.",
                    "author": "ionlyhavesexformoney",
                    "id": "gvpwaao",
                    "parent_id": "t1_gvpuvnl",
                    "score": 3,
                    "created_utc": 1619279535.0,
                    "replies": [
                        {
                            "body": "Whoever shared that with him really isn’t your friend. That wasn’t their truth to tell. Whether or not you were angry at each other at that point",
                            "author": "bumbusaucee",
                            "id": "gvpyjnl",
                            "parent_id": "t1_gvpwaao",
                            "score": 3,
                            "created_utc": 1619280254.0,
                            "replies": [
                                {
                                    "body": "I know. It hurt me when I found out but I figured it wasn’t worth the strife starting a fight.",
                                    "author": "ionlyhavesexformoney",
                                    "id": "gvq0wu1",
                                    "parent_id": "t1_gvpyjnl",
                                    "score": 0,
                                    "created_utc": 1619281023.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "He sounds like an insecure loser. There’s no excuse to be an asshole. You can be surprised or bothered by something and still respectfully hold your tongue. He could have. If it really bothered him, he could have just left, ended your “situationship” but he proactively demeaned you. \n\nWhy are some men like him? They think they have some magical set of fingers or a unicorn dick. What a whinger. There are, in my humble opinion, lots of red flags in what he said. His focus on virginity like it’s this important thing, calling you naive and finding value in that. And the rest is just entitled. The Madonna / Whore complex is big within this one.",
            "author": "iridescentfairy",
            "id": "gvoxtn0",
            "parent_id": "t3_mxgb9p",
            "score": 2,
            "created_utc": 1619270063.0,
            "replies": [
                {
                    "body": "I said I was a little offended at the naive comment but he seemed to think it was a positive trait. Or at least one that women who did not get compensated for relationships had. He spoke disparagingly about cam girls and girls with OF.",
                    "author": "ionlyhavesexformoney",
                    "id": "gvp33tz",
                    "parent_id": "t1_gvoxtn0",
                    "score": 2,
                    "created_utc": 1619271455.0,
                    "replies": [
                        {
                            "body": "Guys that think it’s a positive trait are the ones who probably get off on reluctant porn or noncon. Like each to their own but for me, very red flaggy. Like innocence and purity and naivety = worth.",
                            "author": "iridescentfairy",
                            "id": "gvp6k07",
                            "parent_id": "t1_gvp33tz",
                            "score": 2,
                            "created_utc": 1619272434.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Since your friends already know you sugar, I’d start making the distinction clear “I do NOT have sex for money, I do like to date rich guys who spoil me.”\n\nWhen I was in my twenties, there were four types of guys that got all the women: hot guys, funny guys, rich guys, and singers. He’s just jealous that someone else can provide for you something he can’t.",
            "author": null,
            "id": "gvpb89e",
            "parent_id": "t3_mxgb9p",
            "score": 2,
            "created_utc": 1619273645.0,
            "replies": [
                {
                    "body": "At this rate I’ll just tell them I retired 😭",
                    "author": "ionlyhavesexformoney",
                    "id": "gvpirxj",
                    "parent_id": "t1_gvpb89e",
                    "score": 2,
                    "created_utc": 1619275577.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "hes mad,  but lets be realistic...  many (vanilla) bfs would react this way.\nthey will see sugar as similar to prostitution\n\nbest to keep it private, and if they find out... explain that you just attracted to intelligent, successful men and has nothing to do with money.\n\nno judgement here, but as a guy... i can understand the perspective",
            "author": "oyxyjuon",
            "id": "gvqapl5",
            "parent_id": "t3_mxgb9p",
            "score": 1,
            "created_utc": 1619285662.0,
            "replies": [
                {
                    "body": "I get it. He never would have heard if it was up to me. Through the jokes and stuff I gave him details, stories, all kind of things indicating I was serious and he suddenly switches on me like I’d have that kind of dedication to the gag? I don’t get that but sugar being a touchy subject I understand fully.",
                    "author": "ionlyhavesexformoney",
                    "id": "gvqcbpg",
                    "parent_id": "t1_gvqapl5",
                    "score": 1,
                    "created_utc": 1619286466.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I think this is all very twisted. Sugaring is not a subject everyone gets or takes well. Most look down on it. So best not to share with anyone.",
            "author": null,
            "id": "gvp5bqo",
            "parent_id": "t3_mxgb9p",
            "score": 0,
            "created_utc": 1619272103.0,
            "replies": [
                {
                    "body": "Agreed. Never imagined the information would be shared the way it was so my mistake for sharing in the first place",
                    "author": "ionlyhavesexformoney",
                    "id": "gvpkr36",
                    "parent_id": "t1_gvp5bqo",
                    "score": 1,
                    "created_utc": 1619276066.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "In the future keep it secret.  Find a guy not in your friend circle.  Its nobodies business",
            "author": "wb19081908",
            "id": "gvpbcs7",
            "parent_id": "t3_mxgb9p",
            "score": 0,
            "created_utc": 1619273676.0,
            "replies": [
                {
                    "body": "The info was shared by someone I was temporarily on bad terms with so I guess they wanted to hit me where it hurt. I don’t generally disclose this part of my life. These were extraordinary circumstances.",
                    "author": "ionlyhavesexformoney",
                    "id": "gvpifpi",
                    "parent_id": "t1_gvpbcs7",
                    "score": 2,
                    "created_utc": 1619275490.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I mean I would never date a girl who sugared but I absolutely would sleep with one (duh).",
            "author": "HotStool",
            "id": "gvqwf5o",
            "parent_id": "t3_mxgb9p",
            "score": 0,
            "created_utc": 1619296476.0,
            "replies": []
        },
        {
            "body": "Why do you care what he thinks?",
            "author": "Mining4Gold2",
            "id": "gvor7zw",
            "parent_id": "t3_mxgb9p",
            "score": 1,
            "created_utc": 1619268135.0,
            "replies": [
                {
                    "body": "Wondering what leg he thinks he has to stand on being mad when he was told by others and me that this was in my life. Like why would I joke that I did sugar when I didn’t? What would be the point?",
                    "author": "ionlyhavesexformoney",
                    "id": "gvov9dy",
                    "parent_id": "t1_gvor7zw",
                    "score": 1,
                    "created_utc": 1619269356.0,
                    "replies": [
                        {
                            "body": "Clearly not the one between his legs considering he’s so concerned about everyone else’s sex lives! \n\nI smell projection. If he’s so worried about whether money makes you wet, ask him to throw some your way and you’ll get back to him on the results!",
                            "author": "CallMeHyun",
                            "id": "gvpuqei",
                            "parent_id": "t1_gvov9dy",
                            "score": 1,
                            "created_utc": 1619279017.0,
                            "replies": [
                                {
                                    "body": "He cracked jokes about paying me but I knew he was never good for it. Not trying to claim purity, like fine, guys have paid me but did I kill someone?? I didn’t even lie to him about it, that’s how virtuous I am (lol jk) and he’s still mad",
                                    "author": "ionlyhavesexformoney",
                                    "id": "gvpvsvo",
                                    "parent_id": "t1_gvpuqei",
                                    "score": 1,
                                    "created_utc": 1619279374.0,
                                    "replies": [
                                        {
                                            "body": "Honestly, my theory is this- obviously the sugar bowl is much more than just the exchange of sex for money but people lacking in the mental area simply won’t understand. You can’t change someone’s comprehension abilities.\n\nSO, if someone in your life wants to be an ass and give you a hard time for “getting compensated for sex,” then kindly remind them that at least you have something to show for it while they’re out here doing that shit for free 😚",
                                            "author": "CallMeHyun",
                                            "id": "gvpxncv",
                                            "parent_id": "t1_gvpvsvo",
                                            "score": 1,
                                            "created_utc": 1619279971.0,
                                            "replies": [
                                                {
                                                    "body": "Loool I really try never to get that petty but you’re right.",
                                                    "author": "ionlyhavesexformoney",
                                                    "id": "gvq0jt4",
                                                    "parent_id": "t1_gvpxncv",
                                                    "score": 1,
                                                    "created_utc": 1619280897.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Dude.. how insecure. Whatever happened in your life is YOUR life. Don’t apologize for it. It’s like a partner asking you how many people you’ve had sex with and gets mad afterwards lmao. Pathetic. Move on. He’s not adult enough.",
            "author": null,
            "id": "gvpkgfa",
            "parent_id": "t3_mxgb9p",
            "score": 1,
            "created_utc": 1619275992.0,
            "replies": []
        },
        {
            "body": "Don't cry over losing his immature situationship ass. He knew, thus the last blow up. This is to try to shame and control you. He's not paying your bills so he gets no say for that, and he's rude AH. I would move on.",
            "author": null,
            "id": "gvq2sic",
            "parent_id": "t3_mxgb9p",
            "score": 1,
            "created_utc": 1619281875.0,
            "replies": [
                {
                    "body": "No tears. And no shame either. Just wanted to complain honestly. Thanks!",
                    "author": "ionlyhavesexformoney",
                    "id": "gvq8b1i",
                    "parent_id": "t1_gvq2sic",
                    "score": 2,
                    "created_utc": 1619284480.0,
                    "replies": []
                }
            ]
        },
        {
            "body": ">but you lost your virginity so late and you're so naive\n\nNARRATOR: And????\n\n>do you stop getting wet when you have sex for money?\n\nNARRATOR: Not if you're turned on\n\n>Anyway, dude is sulking at the moment\n\nNARRATOR: Vote this guy off the island.\n\nAnd stop listening to people who shame you.",
            "author": "marker3000",
            "id": "gvq7w4g",
            "parent_id": "t3_mxgb9p",
            "score": 1,
            "created_utc": 1619284278.0,
            "replies": [
                {
                    "body": "The discussion was such a weird look into this guy’s psyche I swear.",
                    "author": "ionlyhavesexformoney",
                    "id": "gvq8nim",
                    "parent_id": "t1_gvq7w4g",
                    "score": 2,
                    "created_utc": 1619284649.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I don’t get it?  He likes you and then gets upset when you’re is honest about your past, is honest about sugaring?  It’s not like you’re hitting him up for PPM or allowance for each date.  Any man who can’t take your honesty isn’t worth your time.",
            "author": "Daddyg2019",
            "id": "gvqc1gk",
            "parent_id": "t3_mxgb9p",
            "score": 1,
            "created_utc": 1619286324.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gvqgxva",
            "parent_id": "t3_mxgb9p",
            "score": 1,
            "created_utc": 1619288693.0,
            "replies": [
                {
                    "body": "Mind you this friend was someone I thought was safe because she’s done it too. When he asked whether she has I totally covered for her tho so I’m boo boo the fool",
                    "author": "ionlyhavesexformoney",
                    "id": "gvqhta3",
                    "parent_id": "t1_gvqgxva",
                    "score": 1,
                    "created_utc": 1619289129.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Next time you see him ask him for that envelope of cash he mentioned to give you & when he says no, tell him “WTF you weren’t kidding about that??”..... \n“You got so wet when I touched you”... he sounds like an extremely immature prick who thinks he’s gods gift to Earth🙄\nI think it goes without saying but his advice to lie next time is bs, unless you want to, but any man who is truly interested in you (and might I add, worthy) would accept you for you & anything from your past & not guilt trip you about it.\nLately, your life is not a joke. You deserve better friends & a better man in your life 💛",
            "author": "AllieCat6300",
            "id": "gvqhdwy",
            "parent_id": "t3_mxgb9p",
            "score": 1,
            "created_utc": 1619288915.0,
            "replies": [
                {
                    "body": "Thanks. This is sweet. I’m more indignant than hurt tbh",
                    "author": "ionlyhavesexformoney",
                    "id": "gvqif97",
                    "parent_id": "t1_gvqhdwy",
                    "score": 1,
                    "created_utc": 1619289433.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Implied ad hominem attack in place of discussion. Okay, got it. But as I asked, if you have any cases of sugar being successfully prosecuted as prostitution I'd be happy to hear about it. It would be useful information to have.\n\nI believe I replied to your other points including my motives. See the first section of my last reply. But since that wasn't clear enough I'll add this. Sugar is sex work. Sugar is not prostitution. There is a difference. Almost all  prostitutes and sugar babies behave differently and are viewed differently under the law as currently applied in the US.\n\nI guess in your world porn stars and cam girls are prostitutes, too, since they engage in sex acts for money, meeting the same broad standard you've chosen.  There are various types of sex work and they are different. I know that makes things more complicated and conflicts with your personal narrative of being a teller of inconvenient truths to the deluded, but it's real my dear.",
            "author": "ziggy440",
            "id": "gvqqrqh",
            "parent_id": "t3_mxgb9p",
            "score": 1,
            "created_utc": 1619293645.0,
            "replies": []
        },
        {
            "body": "Oh jeez this sounds like my ex... I wasn't into sugaring back then but I couldn't take the judgemental attitude toward things. The kid flipped when he heard I took a dab ONCE lol. We broke up that night.",
            "author": "juana_eat",
            "id": "gvrwxm9",
            "parent_id": "t3_mxgb9p",
            "score": 1,
            "created_utc": 1619316001.0,
            "replies": []
        },
        {
            "body": "[Found a picture of him :)](https://images.app.goo.gl/gFCYehEdSobqi9uDA)\n\n(also he sounds like a neckbeard. run.)",
            "author": "NihilisticBuddhism",
            "id": "gvss75d",
            "parent_id": "t3_mxgb9p",
            "score": 1,
            "created_utc": 1619338805.0,
            "replies": []
        },
        {
            "body": "And he thought it was a joke... me, sugaring I in some respect see as a way to actually get something tangible out of a physical relationship when men bring tend to bring virtually nothing to the table aside from good vibes (when their in the right mood) and a sex drive 🤦🏻‍♀️🤦🏻‍♀️🤦🏻‍♀️ in comparison to all the love and personal development opportunity I bring to the table for my partner and myself.... Don't mean to sound sexist, but we live on a sexist world.\n\nBottom line, I'm sure he's lovely when he wants to be, he's also not yet experienced any depth of compassion for women and their struggles, and until that day comes remains a complete chauvinist dick.\n\nAlso your friends must have been jealous, atleast subconsciously to breach your trust like that wtf...",
            "author": "sugarnchill",
            "id": "gvtmmeu",
            "parent_id": "t3_mxgb9p",
            "score": 1,
            "created_utc": 1619362399.0,
            "replies": [
                {
                    "body": "I’d hate to think that of a friend but I reckon that the statement was said expressly to do damage 😖",
                    "author": "ionlyhavesexformoney",
                    "id": "gvw4m8s",
                    "parent_id": "t1_gvtmmeu",
                    "score": 1,
                    "created_utc": 1619408258.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I'd never date a girl who sugared. I wouldn't bring that up in a vanilla relationship",
            "author": null,
            "id": "gvv9qaj",
            "parent_id": "t3_mxgb9p",
            "score": 1,
            "created_utc": 1619390841.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gw83xs5",
            "parent_id": "t3_mxgb9p",
            "score": 1,
            "created_utc": 1619647144.0,
            "replies": [
                {
                    "body": "the username is a joke and the information was shared without my consent or knowledge. I know better than to cross those wires but someone did it on my behalf. His freakout is his business. What ticked me off was more his delayed reaction because the admission came weeks before his acceptance (and freakout) and throughout that time he asked a lot of questions, made a lot of jokes and expressed a lot of acceptance.",
                    "author": "ionlyhavesexformoney",
                    "id": "gw97o4r",
                    "parent_id": "t1_gw83xs5",
                    "score": 1,
                    "created_utc": 1619666576.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I was so confused when he said that. He said something like women who’ve slept with loads of guys need lube because they can’t get wet naturally. I was total confusion",
            "author": "ionlyhavesexformoney",
            "id": "gvouxrx",
            "parent_id": "t1_gvokpbs",
            "score": 28,
            "created_utc": 1619269268.0,
            "replies": [
                {
                    "body": "Oh so he's someone who also thinks that women's vaginas get loose when they've been stretched out by soooooo many partners but not that a man's penis shrinks from being inside too many tight holes. \n\nHe sounds like he can't arouse a woman who's experienced and has had good sex because he's shit in bed.",
                    "author": "secretactorian",
                    "id": "gvpj12e",
                    "parent_id": "t1_gvouxrx",
                    "score": 38,
                    "created_utc": 1619275639.0,
                    "replies": [
                        {
                            "body": "The “stretching out” myth fascinates me, I have so many questions for them! Does it just stretch with every new partner or do you need to ration your sexings with your girlfriend or wife so you don’t use it up too fast? When women give birth to baby humans who are the size of many handfuls of dicks, do they just walk around like a windsock, hoping they don’t catch sail?",
                            "author": null,
                            "id": "gvpvhbv",
                            "parent_id": "t1_gvpj12e",
                            "score": 29,
                            "created_utc": 1619279267.0,
                            "replies": [
                                {
                                    "body": "Love it. You sound like a delightful lady, let's be friends.",
                                    "author": "secretactorian",
                                    "id": "gvpvww3",
                                    "parent_id": "t1_gvpvhbv",
                                    "score": 11,
                                    "created_utc": 1619279412.0,
                                    "replies": [
                                        {
                                            "body": "I’ll bring a cheese plate, you bring the wine. 🥂",
                                            "author": null,
                                            "id": "gvpyzlq",
                                            "parent_id": "t1_gvpvww3",
                                            "score": 9,
                                            "created_utc": 1619280395.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "I’m so tempted to air this man out properly but it wouldn’t be proper.",
                            "author": "ionlyhavesexformoney",
                            "id": "gvpv53i",
                            "parent_id": "t1_gvpj12e",
                            "score": 4,
                            "created_utc": 1619279154.0,
                            "replies": [
                                {
                                    "body": "Meh. Look around you. Many would consider sugaring unproper (clearly he does) and I personally think taking the high road is overrated on some occasions. \n\nDo what makes you feel good if you no longer want him in your life, proper be damned.",
                                    "author": "secretactorian",
                                    "id": "gvpvl56",
                                    "parent_id": "t1_gvpv53i",
                                    "score": 6,
                                    "created_utc": 1619279302.0,
                                    "replies": []
                                },
                                {
                                    "body": "Even Jesus called the Pharisees a \"brood of vipers\" in public. Tough love is still love.",
                                    "author": null,
                                    "id": "gvq3e0g",
                                    "parent_id": "t1_gvpv53i",
                                    "score": 2,
                                    "created_utc": 1619282143.0,
                                    "replies": []
                                },
                                {
                                    "body": "r/justnoso\n\nSounds like he’d fit right in here.",
                                    "author": "Cdnsugarr",
                                    "id": "gvq6rsa",
                                    "parent_id": "t1_gvpv53i",
                                    "score": 2,
                                    "created_utc": 1619283829.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Did you tell him how nonsensical that was? It’s a long shot but maybe he’ll see his preconceived notions are wrong? (Plus there’s no difference between someone sleeping with one man 100 times or 100 different men..) either way I don’t think you should be with him he’s clearly not going to respect you",
                    "author": null,
                    "id": "gvq3cqn",
                    "parent_id": "t1_gvouxrx",
                    "score": 3,
                    "created_utc": 1619282126.0,
                    "replies": [
                        {
                            "body": "Maybe I met all his expectations for ‘girl who would never do that’ so when it turned out I was a girl who indeed, did that, his mental couldn’t handle it and he fled",
                            "author": "ionlyhavesexformoney",
                            "id": "gvq71da",
                            "parent_id": "t1_gvq3cqn",
                            "score": 3,
                            "created_utc": 1619283944.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I mean, some of us here want to know too if she gets wet when she has sex for money. /s",
            "author": "pintodinosaur",
            "id": "gvyx3ui",
            "parent_id": "t1_gvokpbs",
            "score": 2,
            "created_utc": 1619467613.0,
            "replies": []
        },
        {
            "body": "ALL OF THIS",
            "author": "brattysubsandwich",
            "id": "gvnxbka",
            "parent_id": "t1_gvnx2su",
            "score": 34,
            "created_utc": 1619256325.0,
            "replies": []
        },
        {
            "body": "ouch. tell it to me straight, doctor",
            "author": "ionlyhavesexformoney",
            "id": "gvnzhpg",
            "parent_id": "t1_gvnx2su",
            "score": 42,
            "created_utc": 1619258297.0,
            "replies": [
                {
                    "body": "Yeah, we are all telling you to get away from this dude. He's literal cancer. Yuck.",
                    "author": "TrumpsCovidfefe",
                    "id": "gvonfdf",
                    "parent_id": "t1_gvnzhpg",
                    "score": 28,
                    "created_utc": 1619267020.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I agree with your second point and third point. \n\nJust curious, how would you feel if you talked to an almost bf and find out that he is a SD.  Maybe anger isn't the right word but would you be disappointed?",
            "author": "BeauTofu",
            "id": "gvo3od8",
            "parent_id": "t1_gvnx2su",
            "score": 7,
            "created_utc": 1619260214.0,
            "replies": [
                {
                    "body": "I would be disappointed but accepting of the circumstances. I wouldn’t be disappointed in him and I definitely wouldn’t feel entitled enough to try and make him feel like shit about it. \n\nThat would be extremely hypocritical of me. And even if I didn’t sugar date myself, I still wouldn’t be upset with said “almost boyfriend” lol it’s just called differences in personal choices and lifestyles. \n\n\nEither way, dudes a dick.",
                    "author": "CallMeHyun",
                    "id": "gvp2yfr",
                    "parent_id": "t1_gvo3od8",
                    "score": 16,
                    "created_utc": 1619271415.0,
                    "replies": []
                },
                {
                    "body": "I wouldn’t have a right to be disappointed given my past but I’d want him to stop whilst being with me. I do stop when with vanilla boyfriends if they want me to.",
                    "author": "ionlyhavesexformoney",
                    "id": "gvorz4v",
                    "parent_id": "t1_gvo3od8",
                    "score": 5,
                    "created_utc": 1619268357.0,
                    "replies": [
                        {
                            "body": "He isn't going to stop being an ass when he is with you. The fact is clear, if he really wanted stuff to work between yall he wouldn't hold your past against you, or make jokes with calling you a whore or anything in that nature. \n\nIt's simple, if he can't respect you and your past, he doesn't deserve you. Let him sulk by himself darlin you deserve so much better.",
                            "author": null,
                            "id": "gvowq3h",
                            "parent_id": "t1_gvorz4v",
                            "score": 15,
                            "created_utc": 1619269760.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "🥵 u/callmehyun is on da money",
            "author": "searchfete",
            "id": "gvqe6b8",
            "parent_id": "t1_gvnx2su",
            "score": 2,
            "created_utc": 1619287346.0,
            "replies": []
        },
        {
            "body": "Agreed...keep your sugar life separate from your vanilla life...ALWAYS!!!",
            "author": "chippyboy11254",
            "id": "gvoh91v",
            "parent_id": "t1_gvoa5xb",
            "score": 9,
            "created_utc": 1619265167.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gvoi4pw",
            "parent_id": "t1_gvoa5xb",
            "score": 5,
            "created_utc": 1619265446.0,
            "replies": [
                {
                    "body": "... are they different? I think it’s a branch on the prostitution tree if you will. I know there are elements or SRs that aren’t part of prostitution but at the end of the day someone is being compensated for intimacy.",
                    "author": "ionlyhavesexformoney",
                    "id": "gvos7s2",
                    "parent_id": "t1_gvoi4pw",
                    "score": 19,
                    "created_utc": 1619268435.0,
                    "replies": [
                        {
                            "body": "Yes, they're different. If you're going to say that any time someone gives someone something of value in expectation of sex it is prostitution, then every relationship is prostitution at times. Legally and practically there is more to prostitution than I give you something of value and we have sex. It is very rare for any relationship to be based on complete financial equality, so one person is almost always getting paid.\n\nThere are escorts on SA and some sugar babies who are operating very similarly to escorts, for sure. But in my experience most sugar relationships have a lot more in common with vanilla dating than prostitution.",
                            "author": "ziggy440",
                            "id": "gvpyn9d",
                            "parent_id": "t1_gvos7s2",
                            "score": 1,
                            "created_utc": 1619280286.0,
                            "replies": [
                                {
                                    "body": "It's not just expectation. Depending on the Vice code it could be \"made available for sex\" which denotes that gifts or cash exchanged for the opportunity of sex without the promise of. That literally equals sugaring. So in California for example it still can be seen as prostitution depending on if Vice want to bust you and the DA wants to follow through.\n\nBut yes based on the precinct sugaring can fall in the same box as escorting with GFE. Especially if a PPM arrangement.",
                                    "author": null,
                                    "id": "gvq4977",
                                    "parent_id": "t1_gvpyn9d",
                                    "score": 3,
                                    "created_utc": 1619282574.0,
                                    "replies": [
                                        {
                                            "body": "First, to be clear the strength of my objection to calling sugaring prostitution is because that argument is often used to shame and manipulate sugar babies, often to refuse to pay them as agreed, etc.\n\nSecond, your argument ignores legal precedent. The letter of most prostitution laws could apply to almost all sexual relationships at some point. But the law is not applied as you suggest. The general application is that there needs to be an offer of specific sexual acts in return for payment. Sure, police can arrest any of us for anything and we can be prosecuted, but the case will be thrown out quickly if it gets to court. I am not aware of a single precedent of SB/SD being successfully prosecuted for prostitution. Are you?\n\nThird, by limiting your definition to the legal definition, you ignore all the ways in which the behavior of most SBs is very, very different from the behavior of escorts.\n\nEscorts are usually very talented and lovely performers who provide a great service. They are athletes, actors, therapists and entrepreneurs who are unfairly stigmatized by society. So being called an escort should not be shaming, but it often is. Calling something prostitution is pretty much always derogatory, unfortunately.\n\nOf course there are SBs who cross the line. I recently had a brief discussion with a POT who, while we were discussing ppm, wanted to tell me about how good she is at BJ's. As noted above, offering payment in exchange for specific sexual acts is what they prosecute as prostitution. Was she a sting, a SB/escort who didn't know better, or just very proud of her BJ's? I'll never know.",
                                            "author": "ziggy440",
                                            "id": "gvqinzm",
                                            "parent_id": "t1_gvq4977",
                                            "score": 2,
                                            "created_utc": 1619289542.0,
                                            "replies": [
                                                {
                                                    "body": "The fact that some say escorting or any sex work is somehow shameful while participating in a legal equivalent (depending on vice law) says more about them than the law itself. I find it amusing some SDs and SBs try to justify the relationship as different when in court it might not be. Regardless there is still burden of proof in any case and it depends on how bored vice is.",
                                                    "author": null,
                                                    "id": "gvqjjyg",
                                                    "parent_id": "t1_gvqinzm",
                                                    "score": 3,
                                                    "created_utc": 1619289971.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "gvoshho",
                            "parent_id": "t1_gvos7s2",
                            "score": 0,
                            "created_utc": 1619268554.0,
                            "replies": [
                                {
                                    "body": "The username was a joke lol but thanks a lot for your input",
                                    "author": "ionlyhavesexformoney",
                                    "id": "gvoupmo",
                                    "parent_id": "t1_gvoshho",
                                    "score": 5,
                                    "created_utc": 1619269205.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "I agree. If you break it down to basics, it's the same; however there are also distinct differences. Depends on your point of view/field of view.",
                            "author": "pintodinosaur",
                            "id": "gvyy1ke",
                            "parent_id": "t1_gvos7s2",
                            "score": 1,
                            "created_utc": 1619468024.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Long story short the friend that spilled my business was mad at me at the time. We’ve since reconciled but I was shocked when the guy in question told me that he had been informed. I generally don’t bring up my sugar activities but in this case felt backed into a wall since he had other ways of confirming it.",
            "author": "ionlyhavesexformoney",
            "id": "gvp3lvi",
            "parent_id": "t1_gvp1msy",
            "score": 7,
            "created_utc": 1619271584.0,
            "replies": [
                {
                    "body": "This immature, childish boy-man isn't the only relationship that needs to be booted out of your life. Dump that shitty friend too. It appalls me that she would reveal something so personal about you. \n\nOne of the benefits of age is you learn to accept that what ever happened before you came along is none of your business.",
                    "author": "Ok-Tale-8876",
                    "id": "gvpbks8",
                    "parent_id": "t1_gvp3lvi",
                    "score": 18,
                    "created_utc": 1619273730.0,
                    "replies": [
                        {
                            "body": "I was really shocked that the information was relayed to him but instead of being mad at the time, I copped to it since he could always ask her. Thanks for the advice",
                            "author": "ionlyhavesexformoney",
                            "id": "gvpm9oe",
                            "parent_id": "t1_gvpbks8",
                            "score": 4,
                            "created_utc": 1619276446.0,
                            "replies": [
                                {
                                    "body": "Ugh, I feel for you. Nothing worse than a friend's betrayal.",
                                    "author": "Ok-Tale-8876",
                                    "id": "gvpmot7",
                                    "parent_id": "t1_gvpm9oe",
                                    "score": 7,
                                    "created_utc": 1619276553.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "That’s horrible. I’m sorry that happened to you. But I’d ditch the friend too. If he/she would do it to you once, they’d do it again.",
                    "author": null,
                    "id": "gvq6j2u",
                    "parent_id": "t1_gvp3lvi",
                    "score": 4,
                    "created_utc": 1619283709.0,
                    "replies": [
                        {
                            "body": "🥲",
                            "author": "ionlyhavesexformoney",
                            "id": "gvqaln8",
                            "parent_id": "t1_gvq6j2u",
                            "score": 2,
                            "created_utc": 1619285608.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Noted. I shouldn’t have trusted that info (my sugar life) to be safe with anyone. Literally anyone.",
            "author": "ionlyhavesexformoney",
            "id": "gvpoim3",
            "parent_id": "t1_gvpl5yc",
            "score": 3,
            "created_utc": 1619277039.0,
            "replies": []
        },
        {
            "body": "Seems that the discussion was the issue. How was I supposed to know she’d air my shit out when she was mad at me? Oh well. We move.",
            "author": "ionlyhavesexformoney",
            "id": "gvqhm5f",
            "parent_id": "t1_gvqdz3t",
            "score": 1,
            "created_utc": 1619289028.0,
            "replies": [
                {
                    "body": "> How was I supposed to know she’d air my shit out when she was mad at me?\n\nYou don't, but EXACTLY because you don't i would not share details with \"friends\". At this point, you know who's who based on that.",
                    "author": "pintodinosaur",
                    "id": "gvyyyht",
                    "parent_id": "t1_gvqhm5f",
                    "score": 1,
                    "created_utc": 1619468430.0,
                    "replies": [
                        {
                            "body": "Thought I was safe because she's sugared as well. Noted. Not making that mistake again.",
                            "author": "ionlyhavesexformoney",
                            "id": "gw292yq",
                            "parent_id": "t1_gvyyyht",
                            "score": 1,
                            "created_utc": 1619538406.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Inexperienced young woman and girl who sugar(Ed). These categories are not mutually exclusive if you ask me",
            "author": "ionlyhavesexformoney",
            "id": "gvosg23",
            "parent_id": "t1_gvoh1cs",
            "score": 4,
            "created_utc": 1619268536.0,
            "replies": []
        },
        {
            "body": "LOL, I think you might have a great point there!",
            "author": null,
            "id": "gvpqx6c",
            "parent_id": "t1_gvourai",
            "score": 1,
            "created_utc": 1619277746.0,
            "replies": []
        },
        {
            "body": "To be fair, you're asking the SD's here if they are ok with their date having prostituted(a branch of) in the past.\n\nIf you ask a non-sugar related subreddit, likely many would be negative towards someone who had sex with a series of the other gender in the past for money.",
            "author": "FFF1mclauren",
            "id": "gvp99jz",
            "parent_id": "t1_gvoxp27",
            "score": 1,
            "created_utc": 1619273153.0,
            "replies": [
                {
                    "body": "I realise that. I also know that a lot of cognitive dissonance can exist within a person when it comes to sexuality, morality etc so yeah, I’m aware I’m talking to the ‘initiated’ :)",
                    "author": "ionlyhavesexformoney",
                    "id": "gvpuwmu",
                    "parent_id": "t1_gvp99jz",
                    "score": 1,
                    "created_utc": 1619279075.0,
                    "replies": [
                        {
                            "body": "Yeah hope I didn't offend. Though more people know about sugar nowadays, its still quite... controversial to the mainstream to be honest.\n\nThat being said I do respect you for being up front and honest. Your guy is an asshole, and better you found out sooner rather than later. Wish you the best.",
                            "author": "FFF1mclauren",
                            "id": "gvpw5se",
                            "parent_id": "t1_gvpuwmu",
                            "score": 2,
                            "created_utc": 1619279494.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "It’s not a branch of prostitution, it’s a branch of sex work and there’s a massive difference.",
                    "author": null,
                    "id": "gvprgwk",
                    "parent_id": "t1_gvp99jz",
                    "score": 0,
                    "created_utc": 1619277917.0,
                    "replies": [
                        {
                            "body": "Could you explain the difference?",
                            "author": "FFF1mclauren",
                            "id": "gvpujwx",
                            "parent_id": "t1_gvprgwk",
                            "score": 1,
                            "created_utc": 1619278955.0,
                            "replies": [
                                {
                                    "body": "Sex work is an umbrella term that encompasses sugaring, camming, exotic dancing, and yes, also street based prostitution. Although legislation is slow as always to adopt new language, the differentiation represents both the wholistic element of sex work as a labor entity while also recognizing that sex work is not monolithic. We don’t need to lobby for needle exchange programs and secure housing solutions for cam girls, for example. To equate sugaring, which is relatively safe and done with full agency within the context of sex work, with prostitution, which is often in tandem with homelessness and substance abuse and occurs as a survival means in which meaningful consent cannot be given, is disingenuous.",
                                    "author": null,
                                    "id": "gvpxw17",
                                    "parent_id": "t1_gvpujwx",
                                    "score": 1,
                                    "created_utc": 1619280046.0,
                                    "replies": [
                                        {
                                            "body": "I see, thank you for the info and I'll update my vocabulary.",
                                            "author": "FFF1mclauren",
                                            "id": "gvpy7hd",
                                            "parent_id": "t1_gvpxw17",
                                            "score": 1,
                                            "created_utc": 1619280145.0,
                                            "replies": [
                                                {
                                                    "body": "No problem! Thanks for asking earnestly.",
                                                    "author": null,
                                                    "id": "gvq1bhe",
                                                    "parent_id": "t1_gvpy7hd",
                                                    "score": 1,
                                                    "created_utc": 1619281201.0,
                                                    "replies": []
                                                },
                                                {
                                                    "body": "Eh, I wouldn’t update your vocabulary with this definition -  it’s quite classist and not really accurate either... You seem like the type to be able to do your own research and form your own opinions. Just my 2 cents. Xo",
                                                    "author": "realmodelnomij",
                                                    "id": "gvrkwzn",
                                                    "parent_id": "t1_gvpy7hd",
                                                    "score": 1,
                                                    "created_utc": 1619309399.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "People have different opinions,some people think its a branch of sex work,and other people think its a branch of dating like, trophy girlfriends/wives, housewives mistresses.",
                            "author": "Secret_Diet7053",
                            "id": "gvy7a72",
                            "parent_id": "t1_gvprgwk",
                            "score": 1,
                            "created_utc": 1619456660.0,
                            "replies": [
                                {
                                    "body": "That is also a totally fair and valid perspective. My point is more that if you’re going to put it under the catch-all umbrella of sex work, it should at least be denoted correctly.",
                                    "author": null,
                                    "id": "gvybfw3",
                                    "parent_id": "t1_gvy7a72",
                                    "score": 1,
                                    "created_utc": 1619458410.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Not that it matters but I can count all my sugar and vanilla relationships on 1 hand (without repeating any fingers) so sleeping around is pushing it. Also it’s not a competition but got you beat on the virginity too 😶 but I see what you mean.",
            "author": "ionlyhavesexformoney",
            "id": "gvrwc8n",
            "parent_id": "t1_gvr6jp2",
            "score": 1,
            "created_utc": 1619315649.0,
            "replies": [
                {
                    "body": "I mean the double standards that women have to go through, I’ve seen too many men saying they don’t want a woman with more than 5 body count when their body count is 10x higher. Also ‘being virgin/losing virginity = naive’ idea makes me sick. Sure, girls may be naive but men getting off from the idea of fucking and grooming inexperienced girls... is disgusting.",
                    "author": "zuckdemtee",
                    "id": "gvryam8",
                    "parent_id": "t1_gvrwc8n",
                    "score": 1,
                    "created_utc": 1619316801.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "👸",
            "author": "ionlyhavesexformoney",
            "id": "gvrwes0",
            "parent_id": "t1_gvrai7x",
            "score": 1,
            "created_utc": 1619315688.0,
            "replies": []
        },
        {
            "body": "Fully agree. I didn’t tell him, someone who is close to both of us told him, which backed me into a corner because if I lied, he could always find out the truth. Thats it, I am taking my shit to the grave. Deny until I die.",
            "author": "ionlyhavesexformoney",
            "id": "gvpwaao",
            "parent_id": "t1_gvpuvnl",
            "score": 3,
            "created_utc": 1619279535.0,
            "replies": [
                {
                    "body": "Whoever shared that with him really isn’t your friend. That wasn’t their truth to tell. Whether or not you were angry at each other at that point",
                    "author": "bumbusaucee",
                    "id": "gvpyjnl",
                    "parent_id": "t1_gvpwaao",
                    "score": 3,
                    "created_utc": 1619280254.0,
                    "replies": [
                        {
                            "body": "I know. It hurt me when I found out but I figured it wasn’t worth the strife starting a fight.",
                            "author": "ionlyhavesexformoney",
                            "id": "gvq0wu1",
                            "parent_id": "t1_gvpyjnl",
                            "score": 0,
                            "created_utc": 1619281023.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I said I was a little offended at the naive comment but he seemed to think it was a positive trait. Or at least one that women who did not get compensated for relationships had. He spoke disparagingly about cam girls and girls with OF.",
            "author": "ionlyhavesexformoney",
            "id": "gvp33tz",
            "parent_id": "t1_gvoxtn0",
            "score": 2,
            "created_utc": 1619271455.0,
            "replies": [
                {
                    "body": "Guys that think it’s a positive trait are the ones who probably get off on reluctant porn or noncon. Like each to their own but for me, very red flaggy. Like innocence and purity and naivety = worth.",
                    "author": "iridescentfairy",
                    "id": "gvp6k07",
                    "parent_id": "t1_gvp33tz",
                    "score": 2,
                    "created_utc": 1619272434.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "At this rate I’ll just tell them I retired 😭",
            "author": "ionlyhavesexformoney",
            "id": "gvpirxj",
            "parent_id": "t1_gvpb89e",
            "score": 2,
            "created_utc": 1619275577.0,
            "replies": []
        },
        {
            "body": "I get it. He never would have heard if it was up to me. Through the jokes and stuff I gave him details, stories, all kind of things indicating I was serious and he suddenly switches on me like I’d have that kind of dedication to the gag? I don’t get that but sugar being a touchy subject I understand fully.",
            "author": "ionlyhavesexformoney",
            "id": "gvqcbpg",
            "parent_id": "t1_gvqapl5",
            "score": 1,
            "created_utc": 1619286466.0,
            "replies": []
        },
        {
            "body": "Agreed. Never imagined the information would be shared the way it was so my mistake for sharing in the first place",
            "author": "ionlyhavesexformoney",
            "id": "gvpkr36",
            "parent_id": "t1_gvp5bqo",
            "score": 1,
            "created_utc": 1619276066.0,
            "replies": []
        },
        {
            "body": "The info was shared by someone I was temporarily on bad terms with so I guess they wanted to hit me where it hurt. I don’t generally disclose this part of my life. These were extraordinary circumstances.",
            "author": "ionlyhavesexformoney",
            "id": "gvpifpi",
            "parent_id": "t1_gvpbcs7",
            "score": 2,
            "created_utc": 1619275490.0,
            "replies": []
        },
        {
            "body": "Wondering what leg he thinks he has to stand on being mad when he was told by others and me that this was in my life. Like why would I joke that I did sugar when I didn’t? What would be the point?",
            "author": "ionlyhavesexformoney",
            "id": "gvov9dy",
            "parent_id": "t1_gvor7zw",
            "score": 1,
            "created_utc": 1619269356.0,
            "replies": [
                {
                    "body": "Clearly not the one between his legs considering he’s so concerned about everyone else’s sex lives! \n\nI smell projection. If he’s so worried about whether money makes you wet, ask him to throw some your way and you’ll get back to him on the results!",
                    "author": "CallMeHyun",
                    "id": "gvpuqei",
                    "parent_id": "t1_gvov9dy",
                    "score": 1,
                    "created_utc": 1619279017.0,
                    "replies": [
                        {
                            "body": "He cracked jokes about paying me but I knew he was never good for it. Not trying to claim purity, like fine, guys have paid me but did I kill someone?? I didn’t even lie to him about it, that’s how virtuous I am (lol jk) and he’s still mad",
                            "author": "ionlyhavesexformoney",
                            "id": "gvpvsvo",
                            "parent_id": "t1_gvpuqei",
                            "score": 1,
                            "created_utc": 1619279374.0,
                            "replies": [
                                {
                                    "body": "Honestly, my theory is this- obviously the sugar bowl is much more than just the exchange of sex for money but people lacking in the mental area simply won’t understand. You can’t change someone’s comprehension abilities.\n\nSO, if someone in your life wants to be an ass and give you a hard time for “getting compensated for sex,” then kindly remind them that at least you have something to show for it while they’re out here doing that shit for free 😚",
                                    "author": "CallMeHyun",
                                    "id": "gvpxncv",
                                    "parent_id": "t1_gvpvsvo",
                                    "score": 1,
                                    "created_utc": 1619279971.0,
                                    "replies": [
                                        {
                                            "body": "Loool I really try never to get that petty but you’re right.",
                                            "author": "ionlyhavesexformoney",
                                            "id": "gvq0jt4",
                                            "parent_id": "t1_gvpxncv",
                                            "score": 1,
                                            "created_utc": 1619280897.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "No tears. And no shame either. Just wanted to complain honestly. Thanks!",
            "author": "ionlyhavesexformoney",
            "id": "gvq8b1i",
            "parent_id": "t1_gvq2sic",
            "score": 2,
            "created_utc": 1619284480.0,
            "replies": []
        },
        {
            "body": "The discussion was such a weird look into this guy’s psyche I swear.",
            "author": "ionlyhavesexformoney",
            "id": "gvq8nim",
            "parent_id": "t1_gvq7w4g",
            "score": 2,
            "created_utc": 1619284649.0,
            "replies": []
        },
        {
            "body": "Mind you this friend was someone I thought was safe because she’s done it too. When he asked whether she has I totally covered for her tho so I’m boo boo the fool",
            "author": "ionlyhavesexformoney",
            "id": "gvqhta3",
            "parent_id": "t1_gvqgxva",
            "score": 1,
            "created_utc": 1619289129.0,
            "replies": []
        },
        {
            "body": "Thanks. This is sweet. I’m more indignant than hurt tbh",
            "author": "ionlyhavesexformoney",
            "id": "gvqif97",
            "parent_id": "t1_gvqhdwy",
            "score": 1,
            "created_utc": 1619289433.0,
            "replies": []
        },
        {
            "body": "I’d hate to think that of a friend but I reckon that the statement was said expressly to do damage 😖",
            "author": "ionlyhavesexformoney",
            "id": "gvw4m8s",
            "parent_id": "t1_gvtmmeu",
            "score": 1,
            "created_utc": 1619408258.0,
            "replies": []
        },
        {
            "body": "the username is a joke and the information was shared without my consent or knowledge. I know better than to cross those wires but someone did it on my behalf. His freakout is his business. What ticked me off was more his delayed reaction because the admission came weeks before his acceptance (and freakout) and throughout that time he asked a lot of questions, made a lot of jokes and expressed a lot of acceptance.",
            "author": "ionlyhavesexformoney",
            "id": "gw97o4r",
            "parent_id": "t1_gw83xs5",
            "score": 1,
            "created_utc": 1619666576.0,
            "replies": []
        },
        {
            "body": "Oh so he's someone who also thinks that women's vaginas get loose when they've been stretched out by soooooo many partners but not that a man's penis shrinks from being inside too many tight holes. \n\nHe sounds like he can't arouse a woman who's experienced and has had good sex because he's shit in bed.",
            "author": "secretactorian",
            "id": "gvpj12e",
            "parent_id": "t1_gvouxrx",
            "score": 38,
            "created_utc": 1619275639.0,
            "replies": [
                {
                    "body": "The “stretching out” myth fascinates me, I have so many questions for them! Does it just stretch with every new partner or do you need to ration your sexings with your girlfriend or wife so you don’t use it up too fast? When women give birth to baby humans who are the size of many handfuls of dicks, do they just walk around like a windsock, hoping they don’t catch sail?",
                    "author": null,
                    "id": "gvpvhbv",
                    "parent_id": "t1_gvpj12e",
                    "score": 29,
                    "created_utc": 1619279267.0,
                    "replies": [
                        {
                            "body": "Love it. You sound like a delightful lady, let's be friends.",
                            "author": "secretactorian",
                            "id": "gvpvww3",
                            "parent_id": "t1_gvpvhbv",
                            "score": 11,
                            "created_utc": 1619279412.0,
                            "replies": [
                                {
                                    "body": "I’ll bring a cheese plate, you bring the wine. 🥂",
                                    "author": null,
                                    "id": "gvpyzlq",
                                    "parent_id": "t1_gvpvww3",
                                    "score": 9,
                                    "created_utc": 1619280395.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "I’m so tempted to air this man out properly but it wouldn’t be proper.",
                    "author": "ionlyhavesexformoney",
                    "id": "gvpv53i",
                    "parent_id": "t1_gvpj12e",
                    "score": 4,
                    "created_utc": 1619279154.0,
                    "replies": [
                        {
                            "body": "Meh. Look around you. Many would consider sugaring unproper (clearly he does) and I personally think taking the high road is overrated on some occasions. \n\nDo what makes you feel good if you no longer want him in your life, proper be damned.",
                            "author": "secretactorian",
                            "id": "gvpvl56",
                            "parent_id": "t1_gvpv53i",
                            "score": 6,
                            "created_utc": 1619279302.0,
                            "replies": []
                        },
                        {
                            "body": "Even Jesus called the Pharisees a \"brood of vipers\" in public. Tough love is still love.",
                            "author": null,
                            "id": "gvq3e0g",
                            "parent_id": "t1_gvpv53i",
                            "score": 2,
                            "created_utc": 1619282143.0,
                            "replies": []
                        },
                        {
                            "body": "r/justnoso\n\nSounds like he’d fit right in here.",
                            "author": "Cdnsugarr",
                            "id": "gvq6rsa",
                            "parent_id": "t1_gvpv53i",
                            "score": 2,
                            "created_utc": 1619283829.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Did you tell him how nonsensical that was? It’s a long shot but maybe he’ll see his preconceived notions are wrong? (Plus there’s no difference between someone sleeping with one man 100 times or 100 different men..) either way I don’t think you should be with him he’s clearly not going to respect you",
            "author": null,
            "id": "gvq3cqn",
            "parent_id": "t1_gvouxrx",
            "score": 3,
            "created_utc": 1619282126.0,
            "replies": [
                {
                    "body": "Maybe I met all his expectations for ‘girl who would never do that’ so when it turned out I was a girl who indeed, did that, his mental couldn’t handle it and he fled",
                    "author": "ionlyhavesexformoney",
                    "id": "gvq71da",
                    "parent_id": "t1_gvq3cqn",
                    "score": 3,
                    "created_utc": 1619283944.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Yeah, we are all telling you to get away from this dude. He's literal cancer. Yuck.",
            "author": "TrumpsCovidfefe",
            "id": "gvonfdf",
            "parent_id": "t1_gvnzhpg",
            "score": 28,
            "created_utc": 1619267020.0,
            "replies": []
        },
        {
            "body": "I would be disappointed but accepting of the circumstances. I wouldn’t be disappointed in him and I definitely wouldn’t feel entitled enough to try and make him feel like shit about it. \n\nThat would be extremely hypocritical of me. And even if I didn’t sugar date myself, I still wouldn’t be upset with said “almost boyfriend” lol it’s just called differences in personal choices and lifestyles. \n\n\nEither way, dudes a dick.",
            "author": "CallMeHyun",
            "id": "gvp2yfr",
            "parent_id": "t1_gvo3od8",
            "score": 16,
            "created_utc": 1619271415.0,
            "replies": []
        },
        {
            "body": "I wouldn’t have a right to be disappointed given my past but I’d want him to stop whilst being with me. I do stop when with vanilla boyfriends if they want me to.",
            "author": "ionlyhavesexformoney",
            "id": "gvorz4v",
            "parent_id": "t1_gvo3od8",
            "score": 5,
            "created_utc": 1619268357.0,
            "replies": [
                {
                    "body": "He isn't going to stop being an ass when he is with you. The fact is clear, if he really wanted stuff to work between yall he wouldn't hold your past against you, or make jokes with calling you a whore or anything in that nature. \n\nIt's simple, if he can't respect you and your past, he doesn't deserve you. Let him sulk by himself darlin you deserve so much better.",
                    "author": null,
                    "id": "gvowq3h",
                    "parent_id": "t1_gvorz4v",
                    "score": 15,
                    "created_utc": 1619269760.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "... are they different? I think it’s a branch on the prostitution tree if you will. I know there are elements or SRs that aren’t part of prostitution but at the end of the day someone is being compensated for intimacy.",
            "author": "ionlyhavesexformoney",
            "id": "gvos7s2",
            "parent_id": "t1_gvoi4pw",
            "score": 19,
            "created_utc": 1619268435.0,
            "replies": [
                {
                    "body": "Yes, they're different. If you're going to say that any time someone gives someone something of value in expectation of sex it is prostitution, then every relationship is prostitution at times. Legally and practically there is more to prostitution than I give you something of value and we have sex. It is very rare for any relationship to be based on complete financial equality, so one person is almost always getting paid.\n\nThere are escorts on SA and some sugar babies who are operating very similarly to escorts, for sure. But in my experience most sugar relationships have a lot more in common with vanilla dating than prostitution.",
                    "author": "ziggy440",
                    "id": "gvpyn9d",
                    "parent_id": "t1_gvos7s2",
                    "score": 1,
                    "created_utc": 1619280286.0,
                    "replies": [
                        {
                            "body": "It's not just expectation. Depending on the Vice code it could be \"made available for sex\" which denotes that gifts or cash exchanged for the opportunity of sex without the promise of. That literally equals sugaring. So in California for example it still can be seen as prostitution depending on if Vice want to bust you and the DA wants to follow through.\n\nBut yes based on the precinct sugaring can fall in the same box as escorting with GFE. Especially if a PPM arrangement.",
                            "author": null,
                            "id": "gvq4977",
                            "parent_id": "t1_gvpyn9d",
                            "score": 3,
                            "created_utc": 1619282574.0,
                            "replies": [
                                {
                                    "body": "First, to be clear the strength of my objection to calling sugaring prostitution is because that argument is often used to shame and manipulate sugar babies, often to refuse to pay them as agreed, etc.\n\nSecond, your argument ignores legal precedent. The letter of most prostitution laws could apply to almost all sexual relationships at some point. But the law is not applied as you suggest. The general application is that there needs to be an offer of specific sexual acts in return for payment. Sure, police can arrest any of us for anything and we can be prosecuted, but the case will be thrown out quickly if it gets to court. I am not aware of a single precedent of SB/SD being successfully prosecuted for prostitution. Are you?\n\nThird, by limiting your definition to the legal definition, you ignore all the ways in which the behavior of most SBs is very, very different from the behavior of escorts.\n\nEscorts are usually very talented and lovely performers who provide a great service. They are athletes, actors, therapists and entrepreneurs who are unfairly stigmatized by society. So being called an escort should not be shaming, but it often is. Calling something prostitution is pretty much always derogatory, unfortunately.\n\nOf course there are SBs who cross the line. I recently had a brief discussion with a POT who, while we were discussing ppm, wanted to tell me about how good she is at BJ's. As noted above, offering payment in exchange for specific sexual acts is what they prosecute as prostitution. Was she a sting, a SB/escort who didn't know better, or just very proud of her BJ's? I'll never know.",
                                    "author": "ziggy440",
                                    "id": "gvqinzm",
                                    "parent_id": "t1_gvq4977",
                                    "score": 2,
                                    "created_utc": 1619289542.0,
                                    "replies": [
                                        {
                                            "body": "The fact that some say escorting or any sex work is somehow shameful while participating in a legal equivalent (depending on vice law) says more about them than the law itself. I find it amusing some SDs and SBs try to justify the relationship as different when in court it might not be. Regardless there is still burden of proof in any case and it depends on how bored vice is.",
                                            "author": null,
                                            "id": "gvqjjyg",
                                            "parent_id": "t1_gvqinzm",
                                            "score": 3,
                                            "created_utc": 1619289971.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "gvoshho",
                    "parent_id": "t1_gvos7s2",
                    "score": 0,
                    "created_utc": 1619268554.0,
                    "replies": [
                        {
                            "body": "The username was a joke lol but thanks a lot for your input",
                            "author": "ionlyhavesexformoney",
                            "id": "gvoupmo",
                            "parent_id": "t1_gvoshho",
                            "score": 5,
                            "created_utc": 1619269205.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "I agree. If you break it down to basics, it's the same; however there are also distinct differences. Depends on your point of view/field of view.",
                    "author": "pintodinosaur",
                    "id": "gvyy1ke",
                    "parent_id": "t1_gvos7s2",
                    "score": 1,
                    "created_utc": 1619468024.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "This immature, childish boy-man isn't the only relationship that needs to be booted out of your life. Dump that shitty friend too. It appalls me that she would reveal something so personal about you. \n\nOne of the benefits of age is you learn to accept that what ever happened before you came along is none of your business.",
            "author": "Ok-Tale-8876",
            "id": "gvpbks8",
            "parent_id": "t1_gvp3lvi",
            "score": 18,
            "created_utc": 1619273730.0,
            "replies": [
                {
                    "body": "I was really shocked that the information was relayed to him but instead of being mad at the time, I copped to it since he could always ask her. Thanks for the advice",
                    "author": "ionlyhavesexformoney",
                    "id": "gvpm9oe",
                    "parent_id": "t1_gvpbks8",
                    "score": 4,
                    "created_utc": 1619276446.0,
                    "replies": [
                        {
                            "body": "Ugh, I feel for you. Nothing worse than a friend's betrayal.",
                            "author": "Ok-Tale-8876",
                            "id": "gvpmot7",
                            "parent_id": "t1_gvpm9oe",
                            "score": 7,
                            "created_utc": 1619276553.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "That’s horrible. I’m sorry that happened to you. But I’d ditch the friend too. If he/she would do it to you once, they’d do it again.",
            "author": null,
            "id": "gvq6j2u",
            "parent_id": "t1_gvp3lvi",
            "score": 4,
            "created_utc": 1619283709.0,
            "replies": [
                {
                    "body": "🥲",
                    "author": "ionlyhavesexformoney",
                    "id": "gvqaln8",
                    "parent_id": "t1_gvq6j2u",
                    "score": 2,
                    "created_utc": 1619285608.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "> How was I supposed to know she’d air my shit out when she was mad at me?\n\nYou don't, but EXACTLY because you don't i would not share details with \"friends\". At this point, you know who's who based on that.",
            "author": "pintodinosaur",
            "id": "gvyyyht",
            "parent_id": "t1_gvqhm5f",
            "score": 1,
            "created_utc": 1619468430.0,
            "replies": [
                {
                    "body": "Thought I was safe because she's sugared as well. Noted. Not making that mistake again.",
                    "author": "ionlyhavesexformoney",
                    "id": "gw292yq",
                    "parent_id": "t1_gvyyyht",
                    "score": 1,
                    "created_utc": 1619538406.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I realise that. I also know that a lot of cognitive dissonance can exist within a person when it comes to sexuality, morality etc so yeah, I’m aware I’m talking to the ‘initiated’ :)",
            "author": "ionlyhavesexformoney",
            "id": "gvpuwmu",
            "parent_id": "t1_gvp99jz",
            "score": 1,
            "created_utc": 1619279075.0,
            "replies": [
                {
                    "body": "Yeah hope I didn't offend. Though more people know about sugar nowadays, its still quite... controversial to the mainstream to be honest.\n\nThat being said I do respect you for being up front and honest. Your guy is an asshole, and better you found out sooner rather than later. Wish you the best.",
                    "author": "FFF1mclauren",
                    "id": "gvpw5se",
                    "parent_id": "t1_gvpuwmu",
                    "score": 2,
                    "created_utc": 1619279494.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "It’s not a branch of prostitution, it’s a branch of sex work and there’s a massive difference.",
            "author": null,
            "id": "gvprgwk",
            "parent_id": "t1_gvp99jz",
            "score": 0,
            "created_utc": 1619277917.0,
            "replies": [
                {
                    "body": "Could you explain the difference?",
                    "author": "FFF1mclauren",
                    "id": "gvpujwx",
                    "parent_id": "t1_gvprgwk",
                    "score": 1,
                    "created_utc": 1619278955.0,
                    "replies": [
                        {
                            "body": "Sex work is an umbrella term that encompasses sugaring, camming, exotic dancing, and yes, also street based prostitution. Although legislation is slow as always to adopt new language, the differentiation represents both the wholistic element of sex work as a labor entity while also recognizing that sex work is not monolithic. We don’t need to lobby for needle exchange programs and secure housing solutions for cam girls, for example. To equate sugaring, which is relatively safe and done with full agency within the context of sex work, with prostitution, which is often in tandem with homelessness and substance abuse and occurs as a survival means in which meaningful consent cannot be given, is disingenuous.",
                            "author": null,
                            "id": "gvpxw17",
                            "parent_id": "t1_gvpujwx",
                            "score": 1,
                            "created_utc": 1619280046.0,
                            "replies": [
                                {
                                    "body": "I see, thank you for the info and I'll update my vocabulary.",
                                    "author": "FFF1mclauren",
                                    "id": "gvpy7hd",
                                    "parent_id": "t1_gvpxw17",
                                    "score": 1,
                                    "created_utc": 1619280145.0,
                                    "replies": [
                                        {
                                            "body": "No problem! Thanks for asking earnestly.",
                                            "author": null,
                                            "id": "gvq1bhe",
                                            "parent_id": "t1_gvpy7hd",
                                            "score": 1,
                                            "created_utc": 1619281201.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "Eh, I wouldn’t update your vocabulary with this definition -  it’s quite classist and not really accurate either... You seem like the type to be able to do your own research and form your own opinions. Just my 2 cents. Xo",
                                            "author": "realmodelnomij",
                                            "id": "gvrkwzn",
                                            "parent_id": "t1_gvpy7hd",
                                            "score": 1,
                                            "created_utc": 1619309399.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "People have different opinions,some people think its a branch of sex work,and other people think its a branch of dating like, trophy girlfriends/wives, housewives mistresses.",
                    "author": "Secret_Diet7053",
                    "id": "gvy7a72",
                    "parent_id": "t1_gvprgwk",
                    "score": 1,
                    "created_utc": 1619456660.0,
                    "replies": [
                        {
                            "body": "That is also a totally fair and valid perspective. My point is more that if you’re going to put it under the catch-all umbrella of sex work, it should at least be denoted correctly.",
                            "author": null,
                            "id": "gvybfw3",
                            "parent_id": "t1_gvy7a72",
                            "score": 1,
                            "created_utc": 1619458410.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I mean the double standards that women have to go through, I’ve seen too many men saying they don’t want a woman with more than 5 body count when their body count is 10x higher. Also ‘being virgin/losing virginity = naive’ idea makes me sick. Sure, girls may be naive but men getting off from the idea of fucking and grooming inexperienced girls... is disgusting.",
            "author": "zuckdemtee",
            "id": "gvryam8",
            "parent_id": "t1_gvrwc8n",
            "score": 1,
            "created_utc": 1619316801.0,
            "replies": []
        },
        {
            "body": "Whoever shared that with him really isn’t your friend. That wasn’t their truth to tell. Whether or not you were angry at each other at that point",
            "author": "bumbusaucee",
            "id": "gvpyjnl",
            "parent_id": "t1_gvpwaao",
            "score": 3,
            "created_utc": 1619280254.0,
            "replies": [
                {
                    "body": "I know. It hurt me when I found out but I figured it wasn’t worth the strife starting a fight.",
                    "author": "ionlyhavesexformoney",
                    "id": "gvq0wu1",
                    "parent_id": "t1_gvpyjnl",
                    "score": 0,
                    "created_utc": 1619281023.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Guys that think it’s a positive trait are the ones who probably get off on reluctant porn or noncon. Like each to their own but for me, very red flaggy. Like innocence and purity and naivety = worth.",
            "author": "iridescentfairy",
            "id": "gvp6k07",
            "parent_id": "t1_gvp33tz",
            "score": 2,
            "created_utc": 1619272434.0,
            "replies": []
        },
        {
            "body": "Clearly not the one between his legs considering he’s so concerned about everyone else’s sex lives! \n\nI smell projection. If he’s so worried about whether money makes you wet, ask him to throw some your way and you’ll get back to him on the results!",
            "author": "CallMeHyun",
            "id": "gvpuqei",
            "parent_id": "t1_gvov9dy",
            "score": 1,
            "created_utc": 1619279017.0,
            "replies": [
                {
                    "body": "He cracked jokes about paying me but I knew he was never good for it. Not trying to claim purity, like fine, guys have paid me but did I kill someone?? I didn’t even lie to him about it, that’s how virtuous I am (lol jk) and he’s still mad",
                    "author": "ionlyhavesexformoney",
                    "id": "gvpvsvo",
                    "parent_id": "t1_gvpuqei",
                    "score": 1,
                    "created_utc": 1619279374.0,
                    "replies": [
                        {
                            "body": "Honestly, my theory is this- obviously the sugar bowl is much more than just the exchange of sex for money but people lacking in the mental area simply won’t understand. You can’t change someone’s comprehension abilities.\n\nSO, if someone in your life wants to be an ass and give you a hard time for “getting compensated for sex,” then kindly remind them that at least you have something to show for it while they’re out here doing that shit for free 😚",
                            "author": "CallMeHyun",
                            "id": "gvpxncv",
                            "parent_id": "t1_gvpvsvo",
                            "score": 1,
                            "created_utc": 1619279971.0,
                            "replies": [
                                {
                                    "body": "Loool I really try never to get that petty but you’re right.",
                                    "author": "ionlyhavesexformoney",
                                    "id": "gvq0jt4",
                                    "parent_id": "t1_gvpxncv",
                                    "score": 1,
                                    "created_utc": 1619280897.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "The “stretching out” myth fascinates me, I have so many questions for them! Does it just stretch with every new partner or do you need to ration your sexings with your girlfriend or wife so you don’t use it up too fast? When women give birth to baby humans who are the size of many handfuls of dicks, do they just walk around like a windsock, hoping they don’t catch sail?",
            "author": null,
            "id": "gvpvhbv",
            "parent_id": "t1_gvpj12e",
            "score": 29,
            "created_utc": 1619279267.0,
            "replies": [
                {
                    "body": "Love it. You sound like a delightful lady, let's be friends.",
                    "author": "secretactorian",
                    "id": "gvpvww3",
                    "parent_id": "t1_gvpvhbv",
                    "score": 11,
                    "created_utc": 1619279412.0,
                    "replies": [
                        {
                            "body": "I’ll bring a cheese plate, you bring the wine. 🥂",
                            "author": null,
                            "id": "gvpyzlq",
                            "parent_id": "t1_gvpvww3",
                            "score": 9,
                            "created_utc": 1619280395.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I’m so tempted to air this man out properly but it wouldn’t be proper.",
            "author": "ionlyhavesexformoney",
            "id": "gvpv53i",
            "parent_id": "t1_gvpj12e",
            "score": 4,
            "created_utc": 1619279154.0,
            "replies": [
                {
                    "body": "Meh. Look around you. Many would consider sugaring unproper (clearly he does) and I personally think taking the high road is overrated on some occasions. \n\nDo what makes you feel good if you no longer want him in your life, proper be damned.",
                    "author": "secretactorian",
                    "id": "gvpvl56",
                    "parent_id": "t1_gvpv53i",
                    "score": 6,
                    "created_utc": 1619279302.0,
                    "replies": []
                },
                {
                    "body": "Even Jesus called the Pharisees a \"brood of vipers\" in public. Tough love is still love.",
                    "author": null,
                    "id": "gvq3e0g",
                    "parent_id": "t1_gvpv53i",
                    "score": 2,
                    "created_utc": 1619282143.0,
                    "replies": []
                },
                {
                    "body": "r/justnoso\n\nSounds like he’d fit right in here.",
                    "author": "Cdnsugarr",
                    "id": "gvq6rsa",
                    "parent_id": "t1_gvpv53i",
                    "score": 2,
                    "created_utc": 1619283829.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Maybe I met all his expectations for ‘girl who would never do that’ so when it turned out I was a girl who indeed, did that, his mental couldn’t handle it and he fled",
            "author": "ionlyhavesexformoney",
            "id": "gvq71da",
            "parent_id": "t1_gvq3cqn",
            "score": 3,
            "created_utc": 1619283944.0,
            "replies": []
        },
        {
            "body": "He isn't going to stop being an ass when he is with you. The fact is clear, if he really wanted stuff to work between yall he wouldn't hold your past against you, or make jokes with calling you a whore or anything in that nature. \n\nIt's simple, if he can't respect you and your past, he doesn't deserve you. Let him sulk by himself darlin you deserve so much better.",
            "author": null,
            "id": "gvowq3h",
            "parent_id": "t1_gvorz4v",
            "score": 15,
            "created_utc": 1619269760.0,
            "replies": []
        },
        {
            "body": "Yes, they're different. If you're going to say that any time someone gives someone something of value in expectation of sex it is prostitution, then every relationship is prostitution at times. Legally and practically there is more to prostitution than I give you something of value and we have sex. It is very rare for any relationship to be based on complete financial equality, so one person is almost always getting paid.\n\nThere are escorts on SA and some sugar babies who are operating very similarly to escorts, for sure. But in my experience most sugar relationships have a lot more in common with vanilla dating than prostitution.",
            "author": "ziggy440",
            "id": "gvpyn9d",
            "parent_id": "t1_gvos7s2",
            "score": 1,
            "created_utc": 1619280286.0,
            "replies": [
                {
                    "body": "It's not just expectation. Depending on the Vice code it could be \"made available for sex\" which denotes that gifts or cash exchanged for the opportunity of sex without the promise of. That literally equals sugaring. So in California for example it still can be seen as prostitution depending on if Vice want to bust you and the DA wants to follow through.\n\nBut yes based on the precinct sugaring can fall in the same box as escorting with GFE. Especially if a PPM arrangement.",
                    "author": null,
                    "id": "gvq4977",
                    "parent_id": "t1_gvpyn9d",
                    "score": 3,
                    "created_utc": 1619282574.0,
                    "replies": [
                        {
                            "body": "First, to be clear the strength of my objection to calling sugaring prostitution is because that argument is often used to shame and manipulate sugar babies, often to refuse to pay them as agreed, etc.\n\nSecond, your argument ignores legal precedent. The letter of most prostitution laws could apply to almost all sexual relationships at some point. But the law is not applied as you suggest. The general application is that there needs to be an offer of specific sexual acts in return for payment. Sure, police can arrest any of us for anything and we can be prosecuted, but the case will be thrown out quickly if it gets to court. I am not aware of a single precedent of SB/SD being successfully prosecuted for prostitution. Are you?\n\nThird, by limiting your definition to the legal definition, you ignore all the ways in which the behavior of most SBs is very, very different from the behavior of escorts.\n\nEscorts are usually very talented and lovely performers who provide a great service. They are athletes, actors, therapists and entrepreneurs who are unfairly stigmatized by society. So being called an escort should not be shaming, but it often is. Calling something prostitution is pretty much always derogatory, unfortunately.\n\nOf course there are SBs who cross the line. I recently had a brief discussion with a POT who, while we were discussing ppm, wanted to tell me about how good she is at BJ's. As noted above, offering payment in exchange for specific sexual acts is what they prosecute as prostitution. Was she a sting, a SB/escort who didn't know better, or just very proud of her BJ's? I'll never know.",
                            "author": "ziggy440",
                            "id": "gvqinzm",
                            "parent_id": "t1_gvq4977",
                            "score": 2,
                            "created_utc": 1619289542.0,
                            "replies": [
                                {
                                    "body": "The fact that some say escorting or any sex work is somehow shameful while participating in a legal equivalent (depending on vice law) says more about them than the law itself. I find it amusing some SDs and SBs try to justify the relationship as different when in court it might not be. Regardless there is still burden of proof in any case and it depends on how bored vice is.",
                                    "author": null,
                                    "id": "gvqjjyg",
                                    "parent_id": "t1_gvqinzm",
                                    "score": 3,
                                    "created_utc": 1619289971.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gvoshho",
            "parent_id": "t1_gvos7s2",
            "score": 0,
            "created_utc": 1619268554.0,
            "replies": [
                {
                    "body": "The username was a joke lol but thanks a lot for your input",
                    "author": "ionlyhavesexformoney",
                    "id": "gvoupmo",
                    "parent_id": "t1_gvoshho",
                    "score": 5,
                    "created_utc": 1619269205.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I agree. If you break it down to basics, it's the same; however there are also distinct differences. Depends on your point of view/field of view.",
            "author": "pintodinosaur",
            "id": "gvyy1ke",
            "parent_id": "t1_gvos7s2",
            "score": 1,
            "created_utc": 1619468024.0,
            "replies": []
        },
        {
            "body": "I was really shocked that the information was relayed to him but instead of being mad at the time, I copped to it since he could always ask her. Thanks for the advice",
            "author": "ionlyhavesexformoney",
            "id": "gvpm9oe",
            "parent_id": "t1_gvpbks8",
            "score": 4,
            "created_utc": 1619276446.0,
            "replies": [
                {
                    "body": "Ugh, I feel for you. Nothing worse than a friend's betrayal.",
                    "author": "Ok-Tale-8876",
                    "id": "gvpmot7",
                    "parent_id": "t1_gvpm9oe",
                    "score": 7,
                    "created_utc": 1619276553.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "🥲",
            "author": "ionlyhavesexformoney",
            "id": "gvqaln8",
            "parent_id": "t1_gvq6j2u",
            "score": 2,
            "created_utc": 1619285608.0,
            "replies": []
        },
        {
            "body": "Thought I was safe because she's sugared as well. Noted. Not making that mistake again.",
            "author": "ionlyhavesexformoney",
            "id": "gw292yq",
            "parent_id": "t1_gvyyyht",
            "score": 1,
            "created_utc": 1619538406.0,
            "replies": []
        },
        {
            "body": "Yeah hope I didn't offend. Though more people know about sugar nowadays, its still quite... controversial to the mainstream to be honest.\n\nThat being said I do respect you for being up front and honest. Your guy is an asshole, and better you found out sooner rather than later. Wish you the best.",
            "author": "FFF1mclauren",
            "id": "gvpw5se",
            "parent_id": "t1_gvpuwmu",
            "score": 2,
            "created_utc": 1619279494.0,
            "replies": []
        },
        {
            "body": "Could you explain the difference?",
            "author": "FFF1mclauren",
            "id": "gvpujwx",
            "parent_id": "t1_gvprgwk",
            "score": 1,
            "created_utc": 1619278955.0,
            "replies": [
                {
                    "body": "Sex work is an umbrella term that encompasses sugaring, camming, exotic dancing, and yes, also street based prostitution. Although legislation is slow as always to adopt new language, the differentiation represents both the wholistic element of sex work as a labor entity while also recognizing that sex work is not monolithic. We don’t need to lobby for needle exchange programs and secure housing solutions for cam girls, for example. To equate sugaring, which is relatively safe and done with full agency within the context of sex work, with prostitution, which is often in tandem with homelessness and substance abuse and occurs as a survival means in which meaningful consent cannot be given, is disingenuous.",
                    "author": null,
                    "id": "gvpxw17",
                    "parent_id": "t1_gvpujwx",
                    "score": 1,
                    "created_utc": 1619280046.0,
                    "replies": [
                        {
                            "body": "I see, thank you for the info and I'll update my vocabulary.",
                            "author": "FFF1mclauren",
                            "id": "gvpy7hd",
                            "parent_id": "t1_gvpxw17",
                            "score": 1,
                            "created_utc": 1619280145.0,
                            "replies": [
                                {
                                    "body": "No problem! Thanks for asking earnestly.",
                                    "author": null,
                                    "id": "gvq1bhe",
                                    "parent_id": "t1_gvpy7hd",
                                    "score": 1,
                                    "created_utc": 1619281201.0,
                                    "replies": []
                                },
                                {
                                    "body": "Eh, I wouldn’t update your vocabulary with this definition -  it’s quite classist and not really accurate either... You seem like the type to be able to do your own research and form your own opinions. Just my 2 cents. Xo",
                                    "author": "realmodelnomij",
                                    "id": "gvrkwzn",
                                    "parent_id": "t1_gvpy7hd",
                                    "score": 1,
                                    "created_utc": 1619309399.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "People have different opinions,some people think its a branch of sex work,and other people think its a branch of dating like, trophy girlfriends/wives, housewives mistresses.",
            "author": "Secret_Diet7053",
            "id": "gvy7a72",
            "parent_id": "t1_gvprgwk",
            "score": 1,
            "created_utc": 1619456660.0,
            "replies": [
                {
                    "body": "That is also a totally fair and valid perspective. My point is more that if you’re going to put it under the catch-all umbrella of sex work, it should at least be denoted correctly.",
                    "author": null,
                    "id": "gvybfw3",
                    "parent_id": "t1_gvy7a72",
                    "score": 1,
                    "created_utc": 1619458410.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I know. It hurt me when I found out but I figured it wasn’t worth the strife starting a fight.",
            "author": "ionlyhavesexformoney",
            "id": "gvq0wu1",
            "parent_id": "t1_gvpyjnl",
            "score": 0,
            "created_utc": 1619281023.0,
            "replies": []
        },
        {
            "body": "He cracked jokes about paying me but I knew he was never good for it. Not trying to claim purity, like fine, guys have paid me but did I kill someone?? I didn’t even lie to him about it, that’s how virtuous I am (lol jk) and he’s still mad",
            "author": "ionlyhavesexformoney",
            "id": "gvpvsvo",
            "parent_id": "t1_gvpuqei",
            "score": 1,
            "created_utc": 1619279374.0,
            "replies": [
                {
                    "body": "Honestly, my theory is this- obviously the sugar bowl is much more than just the exchange of sex for money but people lacking in the mental area simply won’t understand. You can’t change someone’s comprehension abilities.\n\nSO, if someone in your life wants to be an ass and give you a hard time for “getting compensated for sex,” then kindly remind them that at least you have something to show for it while they’re out here doing that shit for free 😚",
                    "author": "CallMeHyun",
                    "id": "gvpxncv",
                    "parent_id": "t1_gvpvsvo",
                    "score": 1,
                    "created_utc": 1619279971.0,
                    "replies": [
                        {
                            "body": "Loool I really try never to get that petty but you’re right.",
                            "author": "ionlyhavesexformoney",
                            "id": "gvq0jt4",
                            "parent_id": "t1_gvpxncv",
                            "score": 1,
                            "created_utc": 1619280897.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Love it. You sound like a delightful lady, let's be friends.",
            "author": "secretactorian",
            "id": "gvpvww3",
            "parent_id": "t1_gvpvhbv",
            "score": 11,
            "created_utc": 1619279412.0,
            "replies": [
                {
                    "body": "I’ll bring a cheese plate, you bring the wine. 🥂",
                    "author": null,
                    "id": "gvpyzlq",
                    "parent_id": "t1_gvpvww3",
                    "score": 9,
                    "created_utc": 1619280395.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Meh. Look around you. Many would consider sugaring unproper (clearly he does) and I personally think taking the high road is overrated on some occasions. \n\nDo what makes you feel good if you no longer want him in your life, proper be damned.",
            "author": "secretactorian",
            "id": "gvpvl56",
            "parent_id": "t1_gvpv53i",
            "score": 6,
            "created_utc": 1619279302.0,
            "replies": []
        },
        {
            "body": "Even Jesus called the Pharisees a \"brood of vipers\" in public. Tough love is still love.",
            "author": null,
            "id": "gvq3e0g",
            "parent_id": "t1_gvpv53i",
            "score": 2,
            "created_utc": 1619282143.0,
            "replies": []
        },
        {
            "body": "r/justnoso\n\nSounds like he’d fit right in here.",
            "author": "Cdnsugarr",
            "id": "gvq6rsa",
            "parent_id": "t1_gvpv53i",
            "score": 2,
            "created_utc": 1619283829.0,
            "replies": []
        },
        {
            "body": "It's not just expectation. Depending on the Vice code it could be \"made available for sex\" which denotes that gifts or cash exchanged for the opportunity of sex without the promise of. That literally equals sugaring. So in California for example it still can be seen as prostitution depending on if Vice want to bust you and the DA wants to follow through.\n\nBut yes based on the precinct sugaring can fall in the same box as escorting with GFE. Especially if a PPM arrangement.",
            "author": null,
            "id": "gvq4977",
            "parent_id": "t1_gvpyn9d",
            "score": 3,
            "created_utc": 1619282574.0,
            "replies": [
                {
                    "body": "First, to be clear the strength of my objection to calling sugaring prostitution is because that argument is often used to shame and manipulate sugar babies, often to refuse to pay them as agreed, etc.\n\nSecond, your argument ignores legal precedent. The letter of most prostitution laws could apply to almost all sexual relationships at some point. But the law is not applied as you suggest. The general application is that there needs to be an offer of specific sexual acts in return for payment. Sure, police can arrest any of us for anything and we can be prosecuted, but the case will be thrown out quickly if it gets to court. I am not aware of a single precedent of SB/SD being successfully prosecuted for prostitution. Are you?\n\nThird, by limiting your definition to the legal definition, you ignore all the ways in which the behavior of most SBs is very, very different from the behavior of escorts.\n\nEscorts are usually very talented and lovely performers who provide a great service. They are athletes, actors, therapists and entrepreneurs who are unfairly stigmatized by society. So being called an escort should not be shaming, but it often is. Calling something prostitution is pretty much always derogatory, unfortunately.\n\nOf course there are SBs who cross the line. I recently had a brief discussion with a POT who, while we were discussing ppm, wanted to tell me about how good she is at BJ's. As noted above, offering payment in exchange for specific sexual acts is what they prosecute as prostitution. Was she a sting, a SB/escort who didn't know better, or just very proud of her BJ's? I'll never know.",
                    "author": "ziggy440",
                    "id": "gvqinzm",
                    "parent_id": "t1_gvq4977",
                    "score": 2,
                    "created_utc": 1619289542.0,
                    "replies": [
                        {
                            "body": "The fact that some say escorting or any sex work is somehow shameful while participating in a legal equivalent (depending on vice law) says more about them than the law itself. I find it amusing some SDs and SBs try to justify the relationship as different when in court it might not be. Regardless there is still burden of proof in any case and it depends on how bored vice is.",
                            "author": null,
                            "id": "gvqjjyg",
                            "parent_id": "t1_gvqinzm",
                            "score": 3,
                            "created_utc": 1619289971.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "The username was a joke lol but thanks a lot for your input",
            "author": "ionlyhavesexformoney",
            "id": "gvoupmo",
            "parent_id": "t1_gvoshho",
            "score": 5,
            "created_utc": 1619269205.0,
            "replies": []
        },
        {
            "body": "Ugh, I feel for you. Nothing worse than a friend's betrayal.",
            "author": "Ok-Tale-8876",
            "id": "gvpmot7",
            "parent_id": "t1_gvpm9oe",
            "score": 7,
            "created_utc": 1619276553.0,
            "replies": []
        },
        {
            "body": "Sex work is an umbrella term that encompasses sugaring, camming, exotic dancing, and yes, also street based prostitution. Although legislation is slow as always to adopt new language, the differentiation represents both the wholistic element of sex work as a labor entity while also recognizing that sex work is not monolithic. We don’t need to lobby for needle exchange programs and secure housing solutions for cam girls, for example. To equate sugaring, which is relatively safe and done with full agency within the context of sex work, with prostitution, which is often in tandem with homelessness and substance abuse and occurs as a survival means in which meaningful consent cannot be given, is disingenuous.",
            "author": null,
            "id": "gvpxw17",
            "parent_id": "t1_gvpujwx",
            "score": 1,
            "created_utc": 1619280046.0,
            "replies": [
                {
                    "body": "I see, thank you for the info and I'll update my vocabulary.",
                    "author": "FFF1mclauren",
                    "id": "gvpy7hd",
                    "parent_id": "t1_gvpxw17",
                    "score": 1,
                    "created_utc": 1619280145.0,
                    "replies": [
                        {
                            "body": "No problem! Thanks for asking earnestly.",
                            "author": null,
                            "id": "gvq1bhe",
                            "parent_id": "t1_gvpy7hd",
                            "score": 1,
                            "created_utc": 1619281201.0,
                            "replies": []
                        },
                        {
                            "body": "Eh, I wouldn’t update your vocabulary with this definition -  it’s quite classist and not really accurate either... You seem like the type to be able to do your own research and form your own opinions. Just my 2 cents. Xo",
                            "author": "realmodelnomij",
                            "id": "gvrkwzn",
                            "parent_id": "t1_gvpy7hd",
                            "score": 1,
                            "created_utc": 1619309399.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "That is also a totally fair and valid perspective. My point is more that if you’re going to put it under the catch-all umbrella of sex work, it should at least be denoted correctly.",
            "author": null,
            "id": "gvybfw3",
            "parent_id": "t1_gvy7a72",
            "score": 1,
            "created_utc": 1619458410.0,
            "replies": []
        },
        {
            "body": "Honestly, my theory is this- obviously the sugar bowl is much more than just the exchange of sex for money but people lacking in the mental area simply won’t understand. You can’t change someone’s comprehension abilities.\n\nSO, if someone in your life wants to be an ass and give you a hard time for “getting compensated for sex,” then kindly remind them that at least you have something to show for it while they’re out here doing that shit for free 😚",
            "author": "CallMeHyun",
            "id": "gvpxncv",
            "parent_id": "t1_gvpvsvo",
            "score": 1,
            "created_utc": 1619279971.0,
            "replies": [
                {
                    "body": "Loool I really try never to get that petty but you’re right.",
                    "author": "ionlyhavesexformoney",
                    "id": "gvq0jt4",
                    "parent_id": "t1_gvpxncv",
                    "score": 1,
                    "created_utc": 1619280897.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I’ll bring a cheese plate, you bring the wine. 🥂",
            "author": null,
            "id": "gvpyzlq",
            "parent_id": "t1_gvpvww3",
            "score": 9,
            "created_utc": 1619280395.0,
            "replies": []
        },
        {
            "body": "First, to be clear the strength of my objection to calling sugaring prostitution is because that argument is often used to shame and manipulate sugar babies, often to refuse to pay them as agreed, etc.\n\nSecond, your argument ignores legal precedent. The letter of most prostitution laws could apply to almost all sexual relationships at some point. But the law is not applied as you suggest. The general application is that there needs to be an offer of specific sexual acts in return for payment. Sure, police can arrest any of us for anything and we can be prosecuted, but the case will be thrown out quickly if it gets to court. I am not aware of a single precedent of SB/SD being successfully prosecuted for prostitution. Are you?\n\nThird, by limiting your definition to the legal definition, you ignore all the ways in which the behavior of most SBs is very, very different from the behavior of escorts.\n\nEscorts are usually very talented and lovely performers who provide a great service. They are athletes, actors, therapists and entrepreneurs who are unfairly stigmatized by society. So being called an escort should not be shaming, but it often is. Calling something prostitution is pretty much always derogatory, unfortunately.\n\nOf course there are SBs who cross the line. I recently had a brief discussion with a POT who, while we were discussing ppm, wanted to tell me about how good she is at BJ's. As noted above, offering payment in exchange for specific sexual acts is what they prosecute as prostitution. Was she a sting, a SB/escort who didn't know better, or just very proud of her BJ's? I'll never know.",
            "author": "ziggy440",
            "id": "gvqinzm",
            "parent_id": "t1_gvq4977",
            "score": 2,
            "created_utc": 1619289542.0,
            "replies": [
                {
                    "body": "The fact that some say escorting or any sex work is somehow shameful while participating in a legal equivalent (depending on vice law) says more about them than the law itself. I find it amusing some SDs and SBs try to justify the relationship as different when in court it might not be. Regardless there is still burden of proof in any case and it depends on how bored vice is.",
                    "author": null,
                    "id": "gvqjjyg",
                    "parent_id": "t1_gvqinzm",
                    "score": 3,
                    "created_utc": 1619289971.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I see, thank you for the info and I'll update my vocabulary.",
            "author": "FFF1mclauren",
            "id": "gvpy7hd",
            "parent_id": "t1_gvpxw17",
            "score": 1,
            "created_utc": 1619280145.0,
            "replies": [
                {
                    "body": "No problem! Thanks for asking earnestly.",
                    "author": null,
                    "id": "gvq1bhe",
                    "parent_id": "t1_gvpy7hd",
                    "score": 1,
                    "created_utc": 1619281201.0,
                    "replies": []
                },
                {
                    "body": "Eh, I wouldn’t update your vocabulary with this definition -  it’s quite classist and not really accurate either... You seem like the type to be able to do your own research and form your own opinions. Just my 2 cents. Xo",
                    "author": "realmodelnomij",
                    "id": "gvrkwzn",
                    "parent_id": "t1_gvpy7hd",
                    "score": 1,
                    "created_utc": 1619309399.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Loool I really try never to get that petty but you’re right.",
            "author": "ionlyhavesexformoney",
            "id": "gvq0jt4",
            "parent_id": "t1_gvpxncv",
            "score": 1,
            "created_utc": 1619280897.0,
            "replies": []
        },
        {
            "body": "The fact that some say escorting or any sex work is somehow shameful while participating in a legal equivalent (depending on vice law) says more about them than the law itself. I find it amusing some SDs and SBs try to justify the relationship as different when in court it might not be. Regardless there is still burden of proof in any case and it depends on how bored vice is.",
            "author": null,
            "id": "gvqjjyg",
            "parent_id": "t1_gvqinzm",
            "score": 3,
            "created_utc": 1619289971.0,
            "replies": []
        },
        {
            "body": "No problem! Thanks for asking earnestly.",
            "author": null,
            "id": "gvq1bhe",
            "parent_id": "t1_gvpy7hd",
            "score": 1,
            "created_utc": 1619281201.0,
            "replies": []
        },
        {
            "body": "Eh, I wouldn’t update your vocabulary with this definition -  it’s quite classist and not really accurate either... You seem like the type to be able to do your own research and form your own opinions. Just my 2 cents. Xo",
            "author": "realmodelnomij",
            "id": "gvrkwzn",
            "parent_id": "t1_gvpy7hd",
            "score": 1,
            "created_utc": 1619309399.0,
            "replies": []
        }
    ]
}