{
    "title": "Goddamn Gaara's dad got no chill",
    "post_id": "p4n3fw",
    "post_url": "https://www.reddit.com/r/dankruto/comments/p4n3fw/goddamn_gaaras_dad_got_no_chill/",
    "author": null,
    "body": "",
    "url": "https://i.redd.it/pqu40g1mbgh71.jpg",
    "score": 3739,
    "upvote_ratio": 0.99,
    "created_utc": 1629002632.0,
    "num_comments": 78,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "Still can’t get over the fact that Gaara’s dad dresses like he’s recovering from a hangover",
            "author": "Formerly_Anonymous",
            "id": "h907gr0",
            "parent_id": "t3_p4n3fw",
            "score": 407,
            "created_utc": 1629011113.0,
            "replies": [
                {
                    "body": "Perhaps his eyeliner is just his baggy eyes from all the sleep he misses",
                    "author": "dev1lm4n",
                    "id": "h90iwow",
                    "parent_id": "t1_h907gr0",
                    "score": 130,
                    "created_utc": 1629021009.0,
                    "replies": [
                        {
                            "body": "You’re probably being facetious but I’m like 99% sure that the weird dark eyes are actually a physical characteristic, probably because Shukaku is a giant demonic raccoon dog so he’s got them raccoon eyes",
                            "author": "Agorbs",
                            "id": "h90w76x",
                            "parent_id": "t1_h90iwow",
                            "score": 51,
                            "created_utc": 1629031130.0,
                            "replies": [
                                {
                                    "body": "I think it was actually stated somewhere that the black circles around his eyes are traces of years of sleep deprivation because of Shukaku",
                                    "author": "Maria_Shinkareva",
                                    "id": "h90x7pw",
                                    "parent_id": "t1_h90w76x",
                                    "score": 65,
                                    "created_utc": 1629031745.0,
                                    "replies": [
                                        {
                                            "body": "Nah, look up a picture of baby Gaara, even as an infant he had them",
                                            "author": "Agorbs",
                                            "id": "h90xfm4",
                                            "parent_id": "t1_h90x7pw",
                                            "score": 27,
                                            "created_utc": 1629031877.0,
                                            "replies": [
                                                {
                                                    "body": "Gamabunta did state it was from sleep deprivation when Naruto and Gaara fought after the chunin exams, but he could've been wrong or they/Kishimoto could have forgotten about it when drawing him as an infant.\n\nHim being like that as an infant doesn't really give us much though. He could've already had the Shukaku sealed in him by then, in fact, it's likely a parallel to Naruto (Who btw already had his \"whiskers\" when he was born, not because he was already the jinchuriki, but because he was born to Kushina who was).\n\nWe know his mother died when he was born, and when we see him as an infant, his mother is already clearly dying next to him.\n\nThe power she gave him is also ridiculously powerful for a regular ninja to do. It's not at all unrealistic to assume that his mother was the previous Jinchuriki.\n\nRasa (Gaara's dad) only has those eyes when he's using his gold dust / magnet release abilities. Gaara has them 24/7 likely because the autonomous ultimate protection his mother gave him is constantly activated, which is of course also a magnet release ability, and is an ability exactly like the Shukaku's abilities. It would be pretty weird to assume she WASN'T the previous Jinchuriki.\n\nWe know Rasa wasn't because he literally used his abilities to fight the Shukaku and keep him at bay, and was the only person who could keep the village safe if the Shukaku attacked.\n\n\"This is the third child and the first compatible one.\" That's what was said when Gaara was born. Chances are he already had the Shukaku sealed inside him even in the earliest picture we have of him as an infant, with his mother dying at his side likely because she was the previous Jinchuriki and had to transfer it to his son, imparting her final power/wishes to keep him safe, just like Kushina did.\n\nWhether she was the previous Jinchuriki or not, we can't know for certain, but we do know Gaara's eyes are most likely from the power she gave him, which is constantly activated, or from the Shukaku, who's powers also revolve around magnet release. The way Rasa's eyes only get that black eyeliner when he's using his magnet release abilities should be a good hint for this.",
                                                    "author": "PassdatAss91",
                                                    "id": "h911968",
                                                    "parent_id": "t1_h90xfm4",
                                                    "score": 28,
                                                    "created_utc": 1629034057.0,
                                                    "replies": [
                                                        {
                                                            "body": "Correct me if I'm wrong, but Garra had shukaku sealed in him when he was in the womb.",
                                                            "author": "barry3672",
                                                            "id": "h91vgy2",
                                                            "parent_id": "t1_h911968",
                                                            "score": 9,
                                                            "created_utc": 1629047521.0,
                                                            "replies": [
                                                                {
                                                                    "body": "yeah Chiyo did the sealing, the old monk was the last jinchuriki before Gaara",
                                                                    "author": "amir_a1001",
                                                                    "id": "h91xmym",
                                                                    "parent_id": "t1_h91vgy2",
                                                                    "score": 4,
                                                                    "created_utc": 1629048397.0,
                                                                    "replies": []
                                                                },
                                                                {
                                                                    "body": "Well shit, that alone explains it. Wish I knew that before I wasted my time typing all that shit >.<\n\nStill at least I clarified why Rasa had the same eyes (while using his abilities).",
                                                                    "author": "PassdatAss91",
                                                                    "id": "h92bdt0",
                                                                    "parent_id": "t1_h91vgy2",
                                                                    "score": 2,
                                                                    "created_utc": 1629054266.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "body": "You're right. He did. Then maybe it is just a part of Gaara's design, like the lack of eyebrows 😆",
                                                    "author": "Maria_Shinkareva",
                                                    "id": "h90xxe0",
                                                    "parent_id": "t1_h90xfm4",
                                                    "score": 11,
                                                    "created_utc": 1629032171.0,
                                                    "replies": [
                                                        {
                                                            "body": ">Gaara's \n\nit is stated though that gaara became shukakus jinchuriki even BEFORE he was born (how thats possible i dont know) so yeah, its probably because gaara hasnt slept since his birth or something like that",
                                                            "author": "Vahn1857",
                                                            "id": "h90zwko",
                                                            "parent_id": "t1_h90xxe0",
                                                            "score": 5,
                                                            "created_utc": 1629033307.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "Rasa wasn't a Shukaku jinchuriki",
                                    "author": "MandelAomine",
                                    "id": "h9319ue",
                                    "parent_id": "t1_h90w76x",
                                    "score": 2,
                                    "created_utc": 1629065506.0,
                                    "replies": [
                                        {
                                            "body": "Rasa didn’t have the dark eyes, so…",
                                            "author": "Agorbs",
                                            "id": "h933bkq",
                                            "parent_id": "t1_h9319ue",
                                            "score": 0,
                                            "created_utc": 1629066460.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "It's a bit odd how normal he looks compared to the other Kage we see in the series.\n\nLike I remember watching Gaara's flashback in Part 1 where Gaara walks past his dad and I had to rewatch that part because I wasn't sure that was the Kazekage because he looked so damn normal.",
                    "author": "sonfoa",
                    "id": "h90wffi",
                    "parent_id": "t1_h907gr0",
                    "score": 14,
                    "created_utc": 1629031271.0,
                    "replies": []
                },
                {
                    "body": "sometimes i keep forgetting he was the kazekage",
                    "author": "nicsnts",
                    "id": "h91047o",
                    "parent_id": "t1_h907gr0",
                    "score": 6,
                    "created_utc": 1629033427.0,
                    "replies": []
                },
                {
                    "body": "I mean. His armor does look realistic for a Ninja. \n\nChainmail vest, and a simple sweat shirt/pants combo. Practical.",
                    "author": null,
                    "id": "hynyxz6",
                    "parent_id": "t1_h907gr0",
                    "score": 1,
                    "created_utc": 1645982247.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Gaara had imo one of the saddest childhood if not the saddest . Sasuke,Naruto,Kakashi all had it tough but Gaara imo had the worst . I would say Nagato had the second worst cause atleast Sasuke and Naruto were not dying of hunger daily and were not experiencing nukes around them each fucking day .",
            "author": "Tarkik_Vatsa",
            "id": "h90firi",
            "parent_id": "t3_p4n3fw",
            "score": 120,
            "created_utc": 1629017936.0,
            "replies": [
                {
                    "body": "Tbh, Gaara's childhood was like Naruto's on steroids. People always say they'd rather have an absent father than an abusive father",
                    "author": "FullMoon_Escapade",
                    "id": "h90krhw",
                    "parent_id": "t1_h90firi",
                    "score": 103,
                    "created_utc": 1629022601.0,
                    "replies": [
                        {
                            "body": "Yea, Naruto was shunned by the village but at least he had the Hokage's protection and was provided with enough food and money and wasn't a target for killing. Good thing Gaara was saved, otherwise he'd end up kinda like Sasori but worse.",
                            "author": null,
                            "id": "h90p7au",
                            "parent_id": "t1_h90krhw",
                            "score": 45,
                            "created_utc": 1629026286.0,
                            "replies": [
                                {
                                    "body": "Who would've taken a kid gaara first? the akatsuki or orochimaru?",
                                    "author": "blackwolfgoogol",
                                    "id": "h90z4xo",
                                    "parent_id": "t1_h90p7au",
                                    "score": 9,
                                    "created_utc": 1629032872.0,
                                    "replies": [
                                        {
                                            "body": "Idk, probably akatsuki cos they need tail beasts and having a jinchuriki on their side would give them a huge advantage. Orochimaru on the other hand would've had no interest in him at that time cos he wasn't of any use to him in achieving immortality.",
                                            "author": null,
                                            "id": "h9103ep",
                                            "parent_id": "t1_h90z4xo",
                                            "score": 18,
                                            "created_utc": 1629033415.0,
                                            "replies": [
                                                {
                                                    "body": "i think the akatsuki wouldnt even bother convincing gaara and wouldve just killed him \n\nif OROCHIMARU took him he'd be using the chance to expirement on a jinchuriki, specifically their regenerative abilities and power",
                                                    "author": "blackwolfgoogol",
                                                    "id": "h910x1j",
                                                    "parent_id": "t1_h9103ep",
                                                    "score": 4,
                                                    "created_utc": 1629033869.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "Naruto was a target though, that's the reason his last name was Uzumaki and not Namikaze, Minato fucked a lot of people up during his time in the third war, those people were looking for revenge and probably would have come after Naruto if they knew about him. Also,  this is purely my own headcanon, I'd always assumed the reason Naruto was raised as an orphan instead of within the hokage household was so that it would be much harder for people,  namely the Akatsuki, to find out he was a jinchuriki, but I guess Danzo spoiled those plans.\n\nEDIT: Now that I think about it, my Akatsuki theory makes no sense since Jiraiya was the one who found out about the Akatsuki kidnapping jinchuriki around the time of the chuunin exams",
                                    "author": "uglynerdishere",
                                    "id": "h91x6cz",
                                    "parent_id": "t1_h90p7au",
                                    "score": 3,
                                    "created_utc": 1629048216.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": ">People always say they'd rather have an absent father than an abusive father\n\nVery true . I find it funny when people say Sasuke had it worse than Naruto and Gaara . Sasuke had a horrible childhood without any doubt but in no way was it worse than Naruto or Gaara . Sasuke lost his family and his brother basically mindfucked him 2 times but I would say he still had atleast people who treated him like any other normal kid unlike Naruto who was despised by everyone .",
                            "author": "Tarkik_Vatsa",
                            "id": "h90z0h3",
                            "parent_id": "t1_h90krhw",
                            "score": 9,
                            "created_utc": 1629032799.0,
                            "replies": [
                                {
                                    "body": "I disagree. I would argue Sasuke had a worse childhood than Naruto, but not Gaara. Sasuke brings up good points that he had a bond with his family, and a tie to his entire clan, and that was severed by one person, while Naruto simply had nothing.\n\nI do see what you mean though",
                                    "author": "FullMoon_Escapade",
                                    "id": "h90zkr8",
                                    "parent_id": "t1_h90z0h3",
                                    "score": 12,
                                    "created_utc": 1629033123.0,
                                    "replies": [
                                        {
                                            "body": "I mean its not easy to compare . You can argue about who had a worse childhood between Sasuke and Naruto but I dont think there should be an argument regarding Gaara's childhood being worse than Sasuke . I find Naruto's childhood worse than Sasuke but that can be debated . As a 5 year old if you treated like shit by everyone around you and you dont even know what you did to deserve that treatment it will be depressing . Add to that the fact that you have no one to hear you or to give you a hug or to wipe off your tears . All you can do is cry on your own and get used to be treated like shit each fucking day .",
                                            "author": "Tarkik_Vatsa",
                                            "id": "h910ayv",
                                            "parent_id": "t1_h90zkr8",
                                            "score": 4,
                                            "created_utc": 1629033532.0,
                                            "replies": [
                                                {
                                                    "body": "Yeah. If you think about it, Gaara had the worst of both of their worlds.",
                                                    "author": "FullMoon_Escapade",
                                                    "id": "h912l4j",
                                                    "parent_id": "t1_h910ayv",
                                                    "score": 8,
                                                    "created_utc": 1629034781.0,
                                                    "replies": [
                                                        {
                                                            "body": "Exactly .",
                                                            "author": "Tarkik_Vatsa",
                                                            "id": "h912owp",
                                                            "parent_id": "t1_h912l4j",
                                                            "score": 2,
                                                            "created_utc": 1629034837.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Shit bro, that's tough. Dude was born weak asf and his mom died during birth, causing his father to resent him and abuse him, then got a bijuu stuck in him who didn't only reside in him, but literally torment him to the point of sleepless nights, while also having the entire village ostracise him. The only person he ever trusted then turns out to be an opp and commits sepuku right in front of him.\n\nAn assassination attempt in an 8 year old's life? Damn.",
                                                                    "author": "FullMoon_Escapade",
                                                                    "id": "h912zj2",
                                                                    "parent_id": "t1_h912owp",
                                                                    "score": 10,
                                                                    "created_utc": 1629034990.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "speaking facts",
                    "author": "Dark_Blade77",
                    "id": "h90hjz7",
                    "parent_id": "t1_h90firi",
                    "score": 8,
                    "created_utc": 1629019791.0,
                    "replies": []
                },
                {
                    "body": "I still say Sasuke just because of the Tsukuyomi. You can argue that Gaara's backstory was more depressing but only Sasuke had to relive it hundreds of times.",
                    "author": "sonfoa",
                    "id": "h90wstf",
                    "parent_id": "t1_h90firi",
                    "score": 5,
                    "created_utc": 1629031495.0,
                    "replies": [
                        {
                            "body": "It must have been painful but I dont think Sasuke had it worst . Gaara wasnt even able to sleep man . Had no friends , no bonds . Sasuke had terrible things done to him by Itachi but atleast there were some people who cared for him and looked out for him . Similar to Sasuke , Gaara also saw the person he loved the most try to kill him . He had it worse than Sasuke without a doubt .",
                            "author": "Tarkik_Vatsa",
                            "id": "h90zhsy",
                            "parent_id": "t1_h90wstf",
                            "score": 4,
                            "created_utc": 1629033076.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "How r u gonna say a kid who was starving and was at risk of dying daily and who had to watch a war and live in a war zone watch his parents get murdered right in front of him also had to live with the guilt of accidentally killing someone had it less worse than gaara?",
                    "author": "Fetial",
                    "id": "h91cjk2",
                    "parent_id": "t1_h90firi",
                    "score": 1,
                    "created_utc": 1629039526.0,
                    "replies": [
                        {
                            "body": "He had a mother and father who loved him . His parents never tried to get rid of him . He wasnt treated like nuisance ever since his birth . Nagato had a very bad childhood but I dont think it was worse than Gaara . I mentioned in a comment earlier that Nagato had the 2nd worst childhood imo .",
                            "author": "Tarkik_Vatsa",
                            "id": "h91dxol",
                            "parent_id": "t1_h91cjk2",
                            "score": 4,
                            "created_utc": 1629040146.0,
                            "replies": [
                                {
                                    "body": "Oh my ur dumb asf",
                                    "author": "Fetial",
                                    "id": "h91e2qs",
                                    "parent_id": "t1_h91dxol",
                                    "score": -6,
                                    "created_utc": 1629040209.0,
                                    "replies": [
                                        {
                                            "body": "You are calling me dumb just because I have a different opinion than you ? Thats funny man :)",
                                            "author": "Tarkik_Vatsa",
                                            "id": "h91e72o",
                                            "parent_id": "t1_h91e2qs",
                                            "score": 2,
                                            "created_utc": 1629040263.0,
                                            "replies": [
                                                {
                                                    "body": "When ur opinion is a dumb one you can’t expect to not be called dumb",
                                                    "author": "Fetial",
                                                    "id": "h91e97y",
                                                    "parent_id": "t1_h91e72o",
                                                    "score": -6,
                                                    "created_utc": 1629040289.0,
                                                    "replies": [
                                                        {
                                                            "body": "You should present your arguments as to why Nagato had it worse than Gaara instead of calling me dumb again and again .",
                                                            "author": "Tarkik_Vatsa",
                                                            "id": "h91efgx",
                                                            "parent_id": "t1_h91e97y",
                                                            "score": 2,
                                                            "created_utc": 1629040367.0,
                                                            "replies": [
                                                                {
                                                                    "body": "There isn’t any point nothing I say will change ur mind nor will anything u say change my mind",
                                                                    "author": "Fetial",
                                                                    "id": "h91ei22",
                                                                    "parent_id": "t1_h91efgx",
                                                                    "score": -6,
                                                                    "created_utc": 1629040399.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": ">There isn’t any point nothing I say will change ur mind\n\nHow can you assume so ?",
                                                                            "author": "Tarkik_Vatsa",
                                                                            "id": "h91enw3",
                                                                            "parent_id": "t1_h91ei22",
                                                                            "score": 2,
                                                                            "created_utc": 1629040471.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "Because if ur that weak minded that people online change ur beliefs it’s pretty sad",
                                                                                    "author": "Fetial",
                                                                                    "id": "h91esqd",
                                                                                    "parent_id": "t1_h91enw3",
                                                                                    "score": 0,
                                                                                    "created_utc": 1629040530.0,
                                                                                    "replies": [
                                                                                        {
                                                                                            "body": "Lol you are making it sound like you will change my religion if I hear your opinion . You have got a serious problem buddy . I wish you better mental health .",
                                                                                            "author": "Tarkik_Vatsa",
                                                                                            "id": "h91i3rb",
                                                                                            "parent_id": "t1_h91esqd",
                                                                                            "score": 3,
                                                                                            "created_utc": 1629041955.0,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "body": "This guy a weirdo fr",
                                                                                                    "author": "FullMoon_Escapade",
                                                                                                    "id": "h91nnfc",
                                                                                                    "parent_id": "t1_h91i3rb",
                                                                                                    "score": 4,
                                                                                                    "created_utc": 1629044270.0,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "body": "Yeah . I was trying to have a genuine conversation with him but I think its better to ignore him .",
                                                                                                            "author": "Tarkik_Vatsa",
                                                                                                            "id": "h91xxpr",
                                                                                                            "parent_id": "t1_h91nnfc",
                                                                                                            "score": 3,
                                                                                                            "created_utc": 1629048517.0,
                                                                                                            "replies": []
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Gaara’s dad was a surprised as the rest us of. After his initial appearance I think everyone thought Gaara was just gonna die an evil, fucked up, psychopath.",
            "author": "Xaynr",
            "id": "h90inuc",
            "parent_id": "t3_p4n3fw",
            "score": 47,
            "created_utc": 1629020798.0,
            "replies": []
        },
        {
            "body": "Blew my mind when 3 Kazekages died because of Akatsuki\n\nSasori turn Kazekaze III into a puppet\n\nKazekage IV killed by Orochimaru, ex Akatsuki\n\nAnd Gaara just got his Shukaku sucked out by Akatsuki",
            "author": "xGiven",
            "id": "h90rphj",
            "parent_id": "t3_p4n3fw",
            "score": 46,
            "created_utc": 1629028148.0,
            "replies": [
                {
                    "body": "Gaara is the Kazekage though, not Shukaku. Does it really count as a death?",
                    "author": "bhavbhav",
                    "id": "h91whnq",
                    "parent_id": "t1_h90rphj",
                    "score": 0,
                    "created_utc": 1629047940.0,
                    "replies": [
                        {
                            "body": "He literally died when Shukaku got sucked out",
                            "author": "xGiven",
                            "id": "h922urj",
                            "parent_id": "t1_h91whnq",
                            "score": 14,
                            "created_utc": 1629050603.0,
                            "replies": [
                                {
                                    "body": "That's fair.",
                                    "author": "bhavbhav",
                                    "id": "h925c5v",
                                    "parent_id": "t1_h922urj",
                                    "score": 1,
                                    "created_utc": 1629051664.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "He really was a shit dad. He’s the one who put the demon inside his unborn son then treated him like crap because of it.\nOh, also, he was probably abusive towards his wife.",
            "author": null,
            "id": "h907jec",
            "parent_id": "t3_p4n3fw",
            "score": 118,
            "created_utc": 1629011171.0,
            "replies": [
                {
                    "body": "He also got his ass kicked by orichimaru and his corpse left rotting in the desert lol",
                    "author": "cheese4352",
                    "id": "h90r63d",
                    "parent_id": "t1_h907jec",
                    "score": 83,
                    "created_utc": 1629027766.0,
                    "replies": [
                        {
                            "body": "Satisfying!",
                            "author": null,
                            "id": "h90yvxr",
                            "parent_id": "t1_h90r63d",
                            "score": 28,
                            "created_utc": 1629032729.0,
                            "replies": []
                        },
                        {
                            "body": "They definitely should’ve made a dope fight out of that!",
                            "author": null,
                            "id": "h91ff6c",
                            "parent_id": "t1_h90r63d",
                            "score": 10,
                            "created_utc": 1629040802.0,
                            "replies": []
                        },
                        {
                            "body": "I will say with how strong he was, orochimaru had to have sneak attacked him. He wouldn’t have been able to fight him and escape completely unscathed if it was a fair fight",
                            "author": "Raiden2324",
                            "id": "h91ir75",
                            "parent_id": "t1_h90r63d",
                            "score": 12,
                            "created_utc": 1629042230.0,
                            "replies": []
                        },
                        {
                            "body": "I imagine he didn’t put up much of a fight, knowing Orochimaru he probably assassinated him stealthily",
                            "author": "Available-Abrocoma-4",
                            "id": "h91r4um",
                            "parent_id": "t1_h90r63d",
                            "score": 6,
                            "created_utc": 1629045736.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": ">he was probably abusive towards his wife.\n\nI dont think so . He looked quite a good husband in the flashback that was shown in this episode .",
                    "author": "Tarkik_Vatsa",
                    "id": "h90fkro",
                    "parent_id": "t1_h907jec",
                    "score": 42,
                    "created_utc": 1629017988.0,
                    "replies": [
                        {
                            "body": "Well he kinda hated gaara cuz his wife died giving birth to him.....(i think)...",
                            "author": "NotSoGoodguyScorp",
                            "id": "h90vwsg",
                            "parent_id": "t1_h90fkro",
                            "score": 25,
                            "created_utc": 1629030951.0,
                            "replies": [
                                {
                                    "body": "Yeah I also think this was the case . He was a good husband imo and might have even been a good father to Kankuro and Temari before Gaara's birth .",
                                    "author": "Tarkik_Vatsa",
                                    "id": "h90z6px",
                                    "parent_id": "t1_h90vwsg",
                                    "score": 14,
                                    "created_utc": 1629032899.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "He cared about his wife but he also wanted a kid who was to be a perfect jinchuricki so he forced pregnancies on her.\n\nSimilar to Sanji's dad.",
                            "author": "sonfoa",
                            "id": "h90wl9c",
                            "parent_id": "t1_h90fkro",
                            "score": 19,
                            "created_utc": 1629031369.0,
                            "replies": [
                                {
                                    "body": "Who's Sanji ?",
                                    "author": "Tarkik_Vatsa",
                                    "id": "h90z9r2",
                                    "parent_id": "t1_h90wl9c",
                                    "score": 3,
                                    "created_utc": 1629032949.0,
                                    "replies": [
                                        {
                                            "body": "One Piece character whose dad was pretty big into eugenics.",
                                            "author": "sonfoa",
                                            "id": "h910wwd",
                                            "parent_id": "t1_h90z9r2",
                                            "score": 10,
                                            "created_utc": 1629033866.0,
                                            "replies": [
                                                {
                                                    "body": "Oh I havent watched One Piece yet so I dont know anything about him .",
                                                    "author": "Tarkik_Vatsa",
                                                    "id": "h912nry",
                                                    "parent_id": "t1_h910wwd",
                                                    "score": 6,
                                                    "created_utc": 1629034821.0,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "body": "**This word/phrase(sanji) has a few different meanings.**\n\nMore details here: <https://en.wikipedia.org/wiki/Sanji> \n\n\n\n*This comment was left automatically (by a bot). If I don't get this right, don't get mad at me, I'm still learning!*\n\n[^(opt out)](https://www.reddit.com/r/wikipedia_answer_bot/comments/ozztfy/post_for_opting_out/) ^(|) [^(report/suggest)](https://www.reddit.com/r/wikipedia_answer_bot)",
                                            "author": "wikipedia_answer_bot",
                                            "id": "h90zamw",
                                            "parent_id": "t1_h90z9r2",
                                            "score": 0,
                                            "created_utc": 1629032962.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "Idk, the judge is worse",
                                    "author": "ZORO_Shusui",
                                    "id": "h91dspm",
                                    "parent_id": "t1_h90wl9c",
                                    "score": 4,
                                    "created_utc": 1629040084.0,
                                    "replies": [
                                        {
                                            "body": "Yeah, Judge is worse now that I think about it. We don't really see him ever show love to his wife and his love for his children is contingent on how they impact his legacy. Hopefully, he changed after the events of WCI.\n\nAt least Rasa showed concern for Karura when she died. Judge was angry that Sanji was crying at his mother's grave.",
                                            "author": "sonfoa",
                                            "id": "h91eqez",
                                            "parent_id": "t1_h91dspm",
                                            "score": 3,
                                            "created_utc": 1629040502.0,
                                            "replies": [
                                                {
                                                    "body": "Well judge was angry because he tried to genetically engineer his children to not have emotions like that. All the children save ichiji have shown concern for each other so I’m sure they weren’t happy their mom died but they just can’t cry",
                                                    "author": "Raiden2324",
                                                    "id": "h91k2fj",
                                                    "parent_id": "t1_h91eqez",
                                                    "score": 1,
                                                    "created_utc": 1629042775.0,
                                                    "replies": [
                                                        {
                                                            "body": "They beat up Sanji for crying. They can't feel any vulnerability and thus can't bond. Even when they save each other it's because of their status not out of love. When they save Judge from Big Mom, it's not because he's their dad but because he's the captain of Germa.",
                                                            "author": "sonfoa",
                                                            "id": "h91pccv",
                                                            "parent_id": "t1_h91k2fj",
                                                            "score": 3,
                                                            "created_utc": 1629044979.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Yeah his siblings are bad but think about it, they just followed whatever judge was saying + they already bullied him. It’s not like yonji was ever bullied ever though he’s weaker than everyone else. It’s because judge said sanji is a failure. You could see that yonji and Niji cared for reiju and judge when they got in trouble at the tea party. Only ichiji has a complete inability for compassion.",
                                                                    "author": "Raiden2324",
                                                                    "id": "h91qhun",
                                                                    "parent_id": "t1_h91pccv",
                                                                    "score": 0,
                                                                    "created_utc": 1629045468.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "fuck anime. \n\nits relatable irl too.",
            "author": "tlb7781",
            "id": "h90iewk",
            "parent_id": "t3_p4n3fw",
            "score": 13,
            "created_utc": 1629020572.0,
            "replies": []
        },
        {
            "body": "Put it on r/me_irl",
            "author": "OPgang",
            "id": "h90pmlc",
            "parent_id": "t3_p4n3fw",
            "score": 6,
            "created_utc": 1629026612.0,
            "replies": []
        },
        {
            "body": "I think it’s because he thought gaara would be seen as the most hated person in the village because he’s a jinchuriki but he eventually made friends and became the kazekage",
            "author": "ARandomUser1233",
            "id": "h913a23",
            "parent_id": "t3_p4n3fw",
            "score": 4,
            "created_utc": 1629035142.0,
            "replies": []
        },
        {
            "body": "This kinda reminds me of Ozai-",
            "author": "Senju19_02",
            "id": "h913gvh",
            "parent_id": "t3_p4n3fw",
            "score": 3,
            "created_utc": 1629035239.0,
            "replies": []
        },
        {
            "body": "Gaara: \"I forgive you, father\"\n\nRasa: \"now listen here, you little shit!\"",
            "author": "Cloakbot",
            "id": "h92lqkl",
            "parent_id": "t3_p4n3fw",
            "score": 3,
            "created_utc": 1629058767.0,
            "replies": []
        },
        {
            "body": "All asian parent are\n\nbut it for u own good, so you not grow up weak like a bitch\n\nhayyaaaa",
            "author": null,
            "id": "h90rhrn",
            "parent_id": "t3_p4n3fw",
            "score": 3,
            "created_utc": 1629027997.0,
            "replies": []
        },
        {
            "body": "Dude really got revived from the dead in the middle of war to roast his son",
            "author": "TechSupportScammer",
            "id": "h91o8v5",
            "parent_id": "t3_p4n3fw",
            "score": 2,
            "created_utc": 1629044515.0,
            "replies": []
        },
        {
            "body": "Twitter screenshots aren't memes, cropped or not",
            "author": "DerReudenboy",
            "id": "h90v8lh",
            "parent_id": "t3_p4n3fw",
            "score": -3,
            "created_utc": 1629030531.0,
            "replies": []
        },
        {
            "body": "This scene is the tiny sip of water we get half way through the desert that is the war arc, on the way to Guy vs Madara.",
            "author": "jelly_cake",
            "id": "h9145rb",
            "parent_id": "t3_p4n3fw",
            "score": 1,
            "created_utc": 1629035591.0,
            "replies": []
        },
        {
            "body": "Hey repost this tomorrow. Gowan, do it",
            "author": "irishsaltytuna",
            "id": "h936j4n",
            "parent_id": "t3_p4n3fw",
            "score": 1,
            "created_utc": 1629067949.0,
            "replies": []
        },
        {
            "body": "Perhaps his eyeliner is just his baggy eyes from all the sleep he misses",
            "author": "dev1lm4n",
            "id": "h90iwow",
            "parent_id": "t1_h907gr0",
            "score": 130,
            "created_utc": 1629021009.0,
            "replies": [
                {
                    "body": "You’re probably being facetious but I’m like 99% sure that the weird dark eyes are actually a physical characteristic, probably because Shukaku is a giant demonic raccoon dog so he’s got them raccoon eyes",
                    "author": "Agorbs",
                    "id": "h90w76x",
                    "parent_id": "t1_h90iwow",
                    "score": 51,
                    "created_utc": 1629031130.0,
                    "replies": [
                        {
                            "body": "I think it was actually stated somewhere that the black circles around his eyes are traces of years of sleep deprivation because of Shukaku",
                            "author": "Maria_Shinkareva",
                            "id": "h90x7pw",
                            "parent_id": "t1_h90w76x",
                            "score": 65,
                            "created_utc": 1629031745.0,
                            "replies": [
                                {
                                    "body": "Nah, look up a picture of baby Gaara, even as an infant he had them",
                                    "author": "Agorbs",
                                    "id": "h90xfm4",
                                    "parent_id": "t1_h90x7pw",
                                    "score": 27,
                                    "created_utc": 1629031877.0,
                                    "replies": [
                                        {
                                            "body": "Gamabunta did state it was from sleep deprivation when Naruto and Gaara fought after the chunin exams, but he could've been wrong or they/Kishimoto could have forgotten about it when drawing him as an infant.\n\nHim being like that as an infant doesn't really give us much though. He could've already had the Shukaku sealed in him by then, in fact, it's likely a parallel to Naruto (Who btw already had his \"whiskers\" when he was born, not because he was already the jinchuriki, but because he was born to Kushina who was).\n\nWe know his mother died when he was born, and when we see him as an infant, his mother is already clearly dying next to him.\n\nThe power she gave him is also ridiculously powerful for a regular ninja to do. It's not at all unrealistic to assume that his mother was the previous Jinchuriki.\n\nRasa (Gaara's dad) only has those eyes when he's using his gold dust / magnet release abilities. Gaara has them 24/7 likely because the autonomous ultimate protection his mother gave him is constantly activated, which is of course also a magnet release ability, and is an ability exactly like the Shukaku's abilities. It would be pretty weird to assume she WASN'T the previous Jinchuriki.\n\nWe know Rasa wasn't because he literally used his abilities to fight the Shukaku and keep him at bay, and was the only person who could keep the village safe if the Shukaku attacked.\n\n\"This is the third child and the first compatible one.\" That's what was said when Gaara was born. Chances are he already had the Shukaku sealed inside him even in the earliest picture we have of him as an infant, with his mother dying at his side likely because she was the previous Jinchuriki and had to transfer it to his son, imparting her final power/wishes to keep him safe, just like Kushina did.\n\nWhether she was the previous Jinchuriki or not, we can't know for certain, but we do know Gaara's eyes are most likely from the power she gave him, which is constantly activated, or from the Shukaku, who's powers also revolve around magnet release. The way Rasa's eyes only get that black eyeliner when he's using his magnet release abilities should be a good hint for this.",
                                            "author": "PassdatAss91",
                                            "id": "h911968",
                                            "parent_id": "t1_h90xfm4",
                                            "score": 28,
                                            "created_utc": 1629034057.0,
                                            "replies": [
                                                {
                                                    "body": "Correct me if I'm wrong, but Garra had shukaku sealed in him when he was in the womb.",
                                                    "author": "barry3672",
                                                    "id": "h91vgy2",
                                                    "parent_id": "t1_h911968",
                                                    "score": 9,
                                                    "created_utc": 1629047521.0,
                                                    "replies": [
                                                        {
                                                            "body": "yeah Chiyo did the sealing, the old monk was the last jinchuriki before Gaara",
                                                            "author": "amir_a1001",
                                                            "id": "h91xmym",
                                                            "parent_id": "t1_h91vgy2",
                                                            "score": 4,
                                                            "created_utc": 1629048397.0,
                                                            "replies": []
                                                        },
                                                        {
                                                            "body": "Well shit, that alone explains it. Wish I knew that before I wasted my time typing all that shit >.<\n\nStill at least I clarified why Rasa had the same eyes (while using his abilities).",
                                                            "author": "PassdatAss91",
                                                            "id": "h92bdt0",
                                                            "parent_id": "t1_h91vgy2",
                                                            "score": 2,
                                                            "created_utc": 1629054266.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "body": "You're right. He did. Then maybe it is just a part of Gaara's design, like the lack of eyebrows 😆",
                                            "author": "Maria_Shinkareva",
                                            "id": "h90xxe0",
                                            "parent_id": "t1_h90xfm4",
                                            "score": 11,
                                            "created_utc": 1629032171.0,
                                            "replies": [
                                                {
                                                    "body": ">Gaara's \n\nit is stated though that gaara became shukakus jinchuriki even BEFORE he was born (how thats possible i dont know) so yeah, its probably because gaara hasnt slept since his birth or something like that",
                                                    "author": "Vahn1857",
                                                    "id": "h90zwko",
                                                    "parent_id": "t1_h90xxe0",
                                                    "score": 5,
                                                    "created_utc": 1629033307.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "Rasa wasn't a Shukaku jinchuriki",
                            "author": "MandelAomine",
                            "id": "h9319ue",
                            "parent_id": "t1_h90w76x",
                            "score": 2,
                            "created_utc": 1629065506.0,
                            "replies": [
                                {
                                    "body": "Rasa didn’t have the dark eyes, so…",
                                    "author": "Agorbs",
                                    "id": "h933bkq",
                                    "parent_id": "t1_h9319ue",
                                    "score": 0,
                                    "created_utc": 1629066460.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "It's a bit odd how normal he looks compared to the other Kage we see in the series.\n\nLike I remember watching Gaara's flashback in Part 1 where Gaara walks past his dad and I had to rewatch that part because I wasn't sure that was the Kazekage because he looked so damn normal.",
            "author": "sonfoa",
            "id": "h90wffi",
            "parent_id": "t1_h907gr0",
            "score": 14,
            "created_utc": 1629031271.0,
            "replies": []
        },
        {
            "body": "sometimes i keep forgetting he was the kazekage",
            "author": "nicsnts",
            "id": "h91047o",
            "parent_id": "t1_h907gr0",
            "score": 6,
            "created_utc": 1629033427.0,
            "replies": []
        },
        {
            "body": "I mean. His armor does look realistic for a Ninja. \n\nChainmail vest, and a simple sweat shirt/pants combo. Practical.",
            "author": null,
            "id": "hynyxz6",
            "parent_id": "t1_h907gr0",
            "score": 1,
            "created_utc": 1645982247.0,
            "replies": []
        },
        {
            "body": "Tbh, Gaara's childhood was like Naruto's on steroids. People always say they'd rather have an absent father than an abusive father",
            "author": "FullMoon_Escapade",
            "id": "h90krhw",
            "parent_id": "t1_h90firi",
            "score": 103,
            "created_utc": 1629022601.0,
            "replies": [
                {
                    "body": "Yea, Naruto was shunned by the village but at least he had the Hokage's protection and was provided with enough food and money and wasn't a target for killing. Good thing Gaara was saved, otherwise he'd end up kinda like Sasori but worse.",
                    "author": null,
                    "id": "h90p7au",
                    "parent_id": "t1_h90krhw",
                    "score": 45,
                    "created_utc": 1629026286.0,
                    "replies": [
                        {
                            "body": "Who would've taken a kid gaara first? the akatsuki or orochimaru?",
                            "author": "blackwolfgoogol",
                            "id": "h90z4xo",
                            "parent_id": "t1_h90p7au",
                            "score": 9,
                            "created_utc": 1629032872.0,
                            "replies": [
                                {
                                    "body": "Idk, probably akatsuki cos they need tail beasts and having a jinchuriki on their side would give them a huge advantage. Orochimaru on the other hand would've had no interest in him at that time cos he wasn't of any use to him in achieving immortality.",
                                    "author": null,
                                    "id": "h9103ep",
                                    "parent_id": "t1_h90z4xo",
                                    "score": 18,
                                    "created_utc": 1629033415.0,
                                    "replies": [
                                        {
                                            "body": "i think the akatsuki wouldnt even bother convincing gaara and wouldve just killed him \n\nif OROCHIMARU took him he'd be using the chance to expirement on a jinchuriki, specifically their regenerative abilities and power",
                                            "author": "blackwolfgoogol",
                                            "id": "h910x1j",
                                            "parent_id": "t1_h9103ep",
                                            "score": 4,
                                            "created_utc": 1629033869.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "Naruto was a target though, that's the reason his last name was Uzumaki and not Namikaze, Minato fucked a lot of people up during his time in the third war, those people were looking for revenge and probably would have come after Naruto if they knew about him. Also,  this is purely my own headcanon, I'd always assumed the reason Naruto was raised as an orphan instead of within the hokage household was so that it would be much harder for people,  namely the Akatsuki, to find out he was a jinchuriki, but I guess Danzo spoiled those plans.\n\nEDIT: Now that I think about it, my Akatsuki theory makes no sense since Jiraiya was the one who found out about the Akatsuki kidnapping jinchuriki around the time of the chuunin exams",
                            "author": "uglynerdishere",
                            "id": "h91x6cz",
                            "parent_id": "t1_h90p7au",
                            "score": 3,
                            "created_utc": 1629048216.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": ">People always say they'd rather have an absent father than an abusive father\n\nVery true . I find it funny when people say Sasuke had it worse than Naruto and Gaara . Sasuke had a horrible childhood without any doubt but in no way was it worse than Naruto or Gaara . Sasuke lost his family and his brother basically mindfucked him 2 times but I would say he still had atleast people who treated him like any other normal kid unlike Naruto who was despised by everyone .",
                    "author": "Tarkik_Vatsa",
                    "id": "h90z0h3",
                    "parent_id": "t1_h90krhw",
                    "score": 9,
                    "created_utc": 1629032799.0,
                    "replies": [
                        {
                            "body": "I disagree. I would argue Sasuke had a worse childhood than Naruto, but not Gaara. Sasuke brings up good points that he had a bond with his family, and a tie to his entire clan, and that was severed by one person, while Naruto simply had nothing.\n\nI do see what you mean though",
                            "author": "FullMoon_Escapade",
                            "id": "h90zkr8",
                            "parent_id": "t1_h90z0h3",
                            "score": 12,
                            "created_utc": 1629033123.0,
                            "replies": [
                                {
                                    "body": "I mean its not easy to compare . You can argue about who had a worse childhood between Sasuke and Naruto but I dont think there should be an argument regarding Gaara's childhood being worse than Sasuke . I find Naruto's childhood worse than Sasuke but that can be debated . As a 5 year old if you treated like shit by everyone around you and you dont even know what you did to deserve that treatment it will be depressing . Add to that the fact that you have no one to hear you or to give you a hug or to wipe off your tears . All you can do is cry on your own and get used to be treated like shit each fucking day .",
                                    "author": "Tarkik_Vatsa",
                                    "id": "h910ayv",
                                    "parent_id": "t1_h90zkr8",
                                    "score": 4,
                                    "created_utc": 1629033532.0,
                                    "replies": [
                                        {
                                            "body": "Yeah. If you think about it, Gaara had the worst of both of their worlds.",
                                            "author": "FullMoon_Escapade",
                                            "id": "h912l4j",
                                            "parent_id": "t1_h910ayv",
                                            "score": 8,
                                            "created_utc": 1629034781.0,
                                            "replies": [
                                                {
                                                    "body": "Exactly .",
                                                    "author": "Tarkik_Vatsa",
                                                    "id": "h912owp",
                                                    "parent_id": "t1_h912l4j",
                                                    "score": 2,
                                                    "created_utc": 1629034837.0,
                                                    "replies": [
                                                        {
                                                            "body": "Shit bro, that's tough. Dude was born weak asf and his mom died during birth, causing his father to resent him and abuse him, then got a bijuu stuck in him who didn't only reside in him, but literally torment him to the point of sleepless nights, while also having the entire village ostracise him. The only person he ever trusted then turns out to be an opp and commits sepuku right in front of him.\n\nAn assassination attempt in an 8 year old's life? Damn.",
                                                            "author": "FullMoon_Escapade",
                                                            "id": "h912zj2",
                                                            "parent_id": "t1_h912owp",
                                                            "score": 10,
                                                            "created_utc": 1629034990.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "speaking facts",
            "author": "Dark_Blade77",
            "id": "h90hjz7",
            "parent_id": "t1_h90firi",
            "score": 8,
            "created_utc": 1629019791.0,
            "replies": []
        },
        {
            "body": "I still say Sasuke just because of the Tsukuyomi. You can argue that Gaara's backstory was more depressing but only Sasuke had to relive it hundreds of times.",
            "author": "sonfoa",
            "id": "h90wstf",
            "parent_id": "t1_h90firi",
            "score": 5,
            "created_utc": 1629031495.0,
            "replies": [
                {
                    "body": "It must have been painful but I dont think Sasuke had it worst . Gaara wasnt even able to sleep man . Had no friends , no bonds . Sasuke had terrible things done to him by Itachi but atleast there were some people who cared for him and looked out for him . Similar to Sasuke , Gaara also saw the person he loved the most try to kill him . He had it worse than Sasuke without a doubt .",
                    "author": "Tarkik_Vatsa",
                    "id": "h90zhsy",
                    "parent_id": "t1_h90wstf",
                    "score": 4,
                    "created_utc": 1629033076.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "How r u gonna say a kid who was starving and was at risk of dying daily and who had to watch a war and live in a war zone watch his parents get murdered right in front of him also had to live with the guilt of accidentally killing someone had it less worse than gaara?",
            "author": "Fetial",
            "id": "h91cjk2",
            "parent_id": "t1_h90firi",
            "score": 1,
            "created_utc": 1629039526.0,
            "replies": [
                {
                    "body": "He had a mother and father who loved him . His parents never tried to get rid of him . He wasnt treated like nuisance ever since his birth . Nagato had a very bad childhood but I dont think it was worse than Gaara . I mentioned in a comment earlier that Nagato had the 2nd worst childhood imo .",
                    "author": "Tarkik_Vatsa",
                    "id": "h91dxol",
                    "parent_id": "t1_h91cjk2",
                    "score": 4,
                    "created_utc": 1629040146.0,
                    "replies": [
                        {
                            "body": "Oh my ur dumb asf",
                            "author": "Fetial",
                            "id": "h91e2qs",
                            "parent_id": "t1_h91dxol",
                            "score": -6,
                            "created_utc": 1629040209.0,
                            "replies": [
                                {
                                    "body": "You are calling me dumb just because I have a different opinion than you ? Thats funny man :)",
                                    "author": "Tarkik_Vatsa",
                                    "id": "h91e72o",
                                    "parent_id": "t1_h91e2qs",
                                    "score": 2,
                                    "created_utc": 1629040263.0,
                                    "replies": [
                                        {
                                            "body": "When ur opinion is a dumb one you can’t expect to not be called dumb",
                                            "author": "Fetial",
                                            "id": "h91e97y",
                                            "parent_id": "t1_h91e72o",
                                            "score": -6,
                                            "created_utc": 1629040289.0,
                                            "replies": [
                                                {
                                                    "body": "You should present your arguments as to why Nagato had it worse than Gaara instead of calling me dumb again and again .",
                                                    "author": "Tarkik_Vatsa",
                                                    "id": "h91efgx",
                                                    "parent_id": "t1_h91e97y",
                                                    "score": 2,
                                                    "created_utc": 1629040367.0,
                                                    "replies": [
                                                        {
                                                            "body": "There isn’t any point nothing I say will change ur mind nor will anything u say change my mind",
                                                            "author": "Fetial",
                                                            "id": "h91ei22",
                                                            "parent_id": "t1_h91efgx",
                                                            "score": -6,
                                                            "created_utc": 1629040399.0,
                                                            "replies": [
                                                                {
                                                                    "body": ">There isn’t any point nothing I say will change ur mind\n\nHow can you assume so ?",
                                                                    "author": "Tarkik_Vatsa",
                                                                    "id": "h91enw3",
                                                                    "parent_id": "t1_h91ei22",
                                                                    "score": 2,
                                                                    "created_utc": 1629040471.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "Because if ur that weak minded that people online change ur beliefs it’s pretty sad",
                                                                            "author": "Fetial",
                                                                            "id": "h91esqd",
                                                                            "parent_id": "t1_h91enw3",
                                                                            "score": 0,
                                                                            "created_utc": 1629040530.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "Lol you are making it sound like you will change my religion if I hear your opinion . You have got a serious problem buddy . I wish you better mental health .",
                                                                                    "author": "Tarkik_Vatsa",
                                                                                    "id": "h91i3rb",
                                                                                    "parent_id": "t1_h91esqd",
                                                                                    "score": 3,
                                                                                    "created_utc": 1629041955.0,
                                                                                    "replies": [
                                                                                        {
                                                                                            "body": "This guy a weirdo fr",
                                                                                            "author": "FullMoon_Escapade",
                                                                                            "id": "h91nnfc",
                                                                                            "parent_id": "t1_h91i3rb",
                                                                                            "score": 4,
                                                                                            "created_utc": 1629044270.0,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "body": "Yeah . I was trying to have a genuine conversation with him but I think its better to ignore him .",
                                                                                                    "author": "Tarkik_Vatsa",
                                                                                                    "id": "h91xxpr",
                                                                                                    "parent_id": "t1_h91nnfc",
                                                                                                    "score": 3,
                                                                                                    "created_utc": 1629048517.0,
                                                                                                    "replies": []
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Gaara is the Kazekage though, not Shukaku. Does it really count as a death?",
            "author": "bhavbhav",
            "id": "h91whnq",
            "parent_id": "t1_h90rphj",
            "score": 0,
            "created_utc": 1629047940.0,
            "replies": [
                {
                    "body": "He literally died when Shukaku got sucked out",
                    "author": "xGiven",
                    "id": "h922urj",
                    "parent_id": "t1_h91whnq",
                    "score": 14,
                    "created_utc": 1629050603.0,
                    "replies": [
                        {
                            "body": "That's fair.",
                            "author": "bhavbhav",
                            "id": "h925c5v",
                            "parent_id": "t1_h922urj",
                            "score": 1,
                            "created_utc": 1629051664.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "He also got his ass kicked by orichimaru and his corpse left rotting in the desert lol",
            "author": "cheese4352",
            "id": "h90r63d",
            "parent_id": "t1_h907jec",
            "score": 83,
            "created_utc": 1629027766.0,
            "replies": [
                {
                    "body": "Satisfying!",
                    "author": null,
                    "id": "h90yvxr",
                    "parent_id": "t1_h90r63d",
                    "score": 28,
                    "created_utc": 1629032729.0,
                    "replies": []
                },
                {
                    "body": "They definitely should’ve made a dope fight out of that!",
                    "author": null,
                    "id": "h91ff6c",
                    "parent_id": "t1_h90r63d",
                    "score": 10,
                    "created_utc": 1629040802.0,
                    "replies": []
                },
                {
                    "body": "I will say with how strong he was, orochimaru had to have sneak attacked him. He wouldn’t have been able to fight him and escape completely unscathed if it was a fair fight",
                    "author": "Raiden2324",
                    "id": "h91ir75",
                    "parent_id": "t1_h90r63d",
                    "score": 12,
                    "created_utc": 1629042230.0,
                    "replies": []
                },
                {
                    "body": "I imagine he didn’t put up much of a fight, knowing Orochimaru he probably assassinated him stealthily",
                    "author": "Available-Abrocoma-4",
                    "id": "h91r4um",
                    "parent_id": "t1_h90r63d",
                    "score": 6,
                    "created_utc": 1629045736.0,
                    "replies": []
                }
            ]
        },
        {
            "body": ">he was probably abusive towards his wife.\n\nI dont think so . He looked quite a good husband in the flashback that was shown in this episode .",
            "author": "Tarkik_Vatsa",
            "id": "h90fkro",
            "parent_id": "t1_h907jec",
            "score": 42,
            "created_utc": 1629017988.0,
            "replies": [
                {
                    "body": "Well he kinda hated gaara cuz his wife died giving birth to him.....(i think)...",
                    "author": "NotSoGoodguyScorp",
                    "id": "h90vwsg",
                    "parent_id": "t1_h90fkro",
                    "score": 25,
                    "created_utc": 1629030951.0,
                    "replies": [
                        {
                            "body": "Yeah I also think this was the case . He was a good husband imo and might have even been a good father to Kankuro and Temari before Gaara's birth .",
                            "author": "Tarkik_Vatsa",
                            "id": "h90z6px",
                            "parent_id": "t1_h90vwsg",
                            "score": 14,
                            "created_utc": 1629032899.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "He cared about his wife but he also wanted a kid who was to be a perfect jinchuricki so he forced pregnancies on her.\n\nSimilar to Sanji's dad.",
                    "author": "sonfoa",
                    "id": "h90wl9c",
                    "parent_id": "t1_h90fkro",
                    "score": 19,
                    "created_utc": 1629031369.0,
                    "replies": [
                        {
                            "body": "Who's Sanji ?",
                            "author": "Tarkik_Vatsa",
                            "id": "h90z9r2",
                            "parent_id": "t1_h90wl9c",
                            "score": 3,
                            "created_utc": 1629032949.0,
                            "replies": [
                                {
                                    "body": "One Piece character whose dad was pretty big into eugenics.",
                                    "author": "sonfoa",
                                    "id": "h910wwd",
                                    "parent_id": "t1_h90z9r2",
                                    "score": 10,
                                    "created_utc": 1629033866.0,
                                    "replies": [
                                        {
                                            "body": "Oh I havent watched One Piece yet so I dont know anything about him .",
                                            "author": "Tarkik_Vatsa",
                                            "id": "h912nry",
                                            "parent_id": "t1_h910wwd",
                                            "score": 6,
                                            "created_utc": 1629034821.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "**This word/phrase(sanji) has a few different meanings.**\n\nMore details here: <https://en.wikipedia.org/wiki/Sanji> \n\n\n\n*This comment was left automatically (by a bot). If I don't get this right, don't get mad at me, I'm still learning!*\n\n[^(opt out)](https://www.reddit.com/r/wikipedia_answer_bot/comments/ozztfy/post_for_opting_out/) ^(|) [^(report/suggest)](https://www.reddit.com/r/wikipedia_answer_bot)",
                                    "author": "wikipedia_answer_bot",
                                    "id": "h90zamw",
                                    "parent_id": "t1_h90z9r2",
                                    "score": 0,
                                    "created_utc": 1629032962.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "Idk, the judge is worse",
                            "author": "ZORO_Shusui",
                            "id": "h91dspm",
                            "parent_id": "t1_h90wl9c",
                            "score": 4,
                            "created_utc": 1629040084.0,
                            "replies": [
                                {
                                    "body": "Yeah, Judge is worse now that I think about it. We don't really see him ever show love to his wife and his love for his children is contingent on how they impact his legacy. Hopefully, he changed after the events of WCI.\n\nAt least Rasa showed concern for Karura when she died. Judge was angry that Sanji was crying at his mother's grave.",
                                    "author": "sonfoa",
                                    "id": "h91eqez",
                                    "parent_id": "t1_h91dspm",
                                    "score": 3,
                                    "created_utc": 1629040502.0,
                                    "replies": [
                                        {
                                            "body": "Well judge was angry because he tried to genetically engineer his children to not have emotions like that. All the children save ichiji have shown concern for each other so I’m sure they weren’t happy their mom died but they just can’t cry",
                                            "author": "Raiden2324",
                                            "id": "h91k2fj",
                                            "parent_id": "t1_h91eqez",
                                            "score": 1,
                                            "created_utc": 1629042775.0,
                                            "replies": [
                                                {
                                                    "body": "They beat up Sanji for crying. They can't feel any vulnerability and thus can't bond. Even when they save each other it's because of their status not out of love. When they save Judge from Big Mom, it's not because he's their dad but because he's the captain of Germa.",
                                                    "author": "sonfoa",
                                                    "id": "h91pccv",
                                                    "parent_id": "t1_h91k2fj",
                                                    "score": 3,
                                                    "created_utc": 1629044979.0,
                                                    "replies": [
                                                        {
                                                            "body": "Yeah his siblings are bad but think about it, they just followed whatever judge was saying + they already bullied him. It’s not like yonji was ever bullied ever though he’s weaker than everyone else. It’s because judge said sanji is a failure. You could see that yonji and Niji cared for reiju and judge when they got in trouble at the tea party. Only ichiji has a complete inability for compassion.",
                                                            "author": "Raiden2324",
                                                            "id": "h91qhun",
                                                            "parent_id": "t1_h91pccv",
                                                            "score": 0,
                                                            "created_utc": 1629045468.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "You’re probably being facetious but I’m like 99% sure that the weird dark eyes are actually a physical characteristic, probably because Shukaku is a giant demonic raccoon dog so he’s got them raccoon eyes",
            "author": "Agorbs",
            "id": "h90w76x",
            "parent_id": "t1_h90iwow",
            "score": 51,
            "created_utc": 1629031130.0,
            "replies": [
                {
                    "body": "I think it was actually stated somewhere that the black circles around his eyes are traces of years of sleep deprivation because of Shukaku",
                    "author": "Maria_Shinkareva",
                    "id": "h90x7pw",
                    "parent_id": "t1_h90w76x",
                    "score": 65,
                    "created_utc": 1629031745.0,
                    "replies": [
                        {
                            "body": "Nah, look up a picture of baby Gaara, even as an infant he had them",
                            "author": "Agorbs",
                            "id": "h90xfm4",
                            "parent_id": "t1_h90x7pw",
                            "score": 27,
                            "created_utc": 1629031877.0,
                            "replies": [
                                {
                                    "body": "Gamabunta did state it was from sleep deprivation when Naruto and Gaara fought after the chunin exams, but he could've been wrong or they/Kishimoto could have forgotten about it when drawing him as an infant.\n\nHim being like that as an infant doesn't really give us much though. He could've already had the Shukaku sealed in him by then, in fact, it's likely a parallel to Naruto (Who btw already had his \"whiskers\" when he was born, not because he was already the jinchuriki, but because he was born to Kushina who was).\n\nWe know his mother died when he was born, and when we see him as an infant, his mother is already clearly dying next to him.\n\nThe power she gave him is also ridiculously powerful for a regular ninja to do. It's not at all unrealistic to assume that his mother was the previous Jinchuriki.\n\nRasa (Gaara's dad) only has those eyes when he's using his gold dust / magnet release abilities. Gaara has them 24/7 likely because the autonomous ultimate protection his mother gave him is constantly activated, which is of course also a magnet release ability, and is an ability exactly like the Shukaku's abilities. It would be pretty weird to assume she WASN'T the previous Jinchuriki.\n\nWe know Rasa wasn't because he literally used his abilities to fight the Shukaku and keep him at bay, and was the only person who could keep the village safe if the Shukaku attacked.\n\n\"This is the third child and the first compatible one.\" That's what was said when Gaara was born. Chances are he already had the Shukaku sealed inside him even in the earliest picture we have of him as an infant, with his mother dying at his side likely because she was the previous Jinchuriki and had to transfer it to his son, imparting her final power/wishes to keep him safe, just like Kushina did.\n\nWhether she was the previous Jinchuriki or not, we can't know for certain, but we do know Gaara's eyes are most likely from the power she gave him, which is constantly activated, or from the Shukaku, who's powers also revolve around magnet release. The way Rasa's eyes only get that black eyeliner when he's using his magnet release abilities should be a good hint for this.",
                                    "author": "PassdatAss91",
                                    "id": "h911968",
                                    "parent_id": "t1_h90xfm4",
                                    "score": 28,
                                    "created_utc": 1629034057.0,
                                    "replies": [
                                        {
                                            "body": "Correct me if I'm wrong, but Garra had shukaku sealed in him when he was in the womb.",
                                            "author": "barry3672",
                                            "id": "h91vgy2",
                                            "parent_id": "t1_h911968",
                                            "score": 9,
                                            "created_utc": 1629047521.0,
                                            "replies": [
                                                {
                                                    "body": "yeah Chiyo did the sealing, the old monk was the last jinchuriki before Gaara",
                                                    "author": "amir_a1001",
                                                    "id": "h91xmym",
                                                    "parent_id": "t1_h91vgy2",
                                                    "score": 4,
                                                    "created_utc": 1629048397.0,
                                                    "replies": []
                                                },
                                                {
                                                    "body": "Well shit, that alone explains it. Wish I knew that before I wasted my time typing all that shit >.<\n\nStill at least I clarified why Rasa had the same eyes (while using his abilities).",
                                                    "author": "PassdatAss91",
                                                    "id": "h92bdt0",
                                                    "parent_id": "t1_h91vgy2",
                                                    "score": 2,
                                                    "created_utc": 1629054266.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "You're right. He did. Then maybe it is just a part of Gaara's design, like the lack of eyebrows 😆",
                                    "author": "Maria_Shinkareva",
                                    "id": "h90xxe0",
                                    "parent_id": "t1_h90xfm4",
                                    "score": 11,
                                    "created_utc": 1629032171.0,
                                    "replies": [
                                        {
                                            "body": ">Gaara's \n\nit is stated though that gaara became shukakus jinchuriki even BEFORE he was born (how thats possible i dont know) so yeah, its probably because gaara hasnt slept since his birth or something like that",
                                            "author": "Vahn1857",
                                            "id": "h90zwko",
                                            "parent_id": "t1_h90xxe0",
                                            "score": 5,
                                            "created_utc": 1629033307.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Rasa wasn't a Shukaku jinchuriki",
                    "author": "MandelAomine",
                    "id": "h9319ue",
                    "parent_id": "t1_h90w76x",
                    "score": 2,
                    "created_utc": 1629065506.0,
                    "replies": [
                        {
                            "body": "Rasa didn’t have the dark eyes, so…",
                            "author": "Agorbs",
                            "id": "h933bkq",
                            "parent_id": "t1_h9319ue",
                            "score": 0,
                            "created_utc": 1629066460.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Yea, Naruto was shunned by the village but at least he had the Hokage's protection and was provided with enough food and money and wasn't a target for killing. Good thing Gaara was saved, otherwise he'd end up kinda like Sasori but worse.",
            "author": null,
            "id": "h90p7au",
            "parent_id": "t1_h90krhw",
            "score": 45,
            "created_utc": 1629026286.0,
            "replies": [
                {
                    "body": "Who would've taken a kid gaara first? the akatsuki or orochimaru?",
                    "author": "blackwolfgoogol",
                    "id": "h90z4xo",
                    "parent_id": "t1_h90p7au",
                    "score": 9,
                    "created_utc": 1629032872.0,
                    "replies": [
                        {
                            "body": "Idk, probably akatsuki cos they need tail beasts and having a jinchuriki on their side would give them a huge advantage. Orochimaru on the other hand would've had no interest in him at that time cos he wasn't of any use to him in achieving immortality.",
                            "author": null,
                            "id": "h9103ep",
                            "parent_id": "t1_h90z4xo",
                            "score": 18,
                            "created_utc": 1629033415.0,
                            "replies": [
                                {
                                    "body": "i think the akatsuki wouldnt even bother convincing gaara and wouldve just killed him \n\nif OROCHIMARU took him he'd be using the chance to expirement on a jinchuriki, specifically their regenerative abilities and power",
                                    "author": "blackwolfgoogol",
                                    "id": "h910x1j",
                                    "parent_id": "t1_h9103ep",
                                    "score": 4,
                                    "created_utc": 1629033869.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Naruto was a target though, that's the reason his last name was Uzumaki and not Namikaze, Minato fucked a lot of people up during his time in the third war, those people were looking for revenge and probably would have come after Naruto if they knew about him. Also,  this is purely my own headcanon, I'd always assumed the reason Naruto was raised as an orphan instead of within the hokage household was so that it would be much harder for people,  namely the Akatsuki, to find out he was a jinchuriki, but I guess Danzo spoiled those plans.\n\nEDIT: Now that I think about it, my Akatsuki theory makes no sense since Jiraiya was the one who found out about the Akatsuki kidnapping jinchuriki around the time of the chuunin exams",
                    "author": "uglynerdishere",
                    "id": "h91x6cz",
                    "parent_id": "t1_h90p7au",
                    "score": 3,
                    "created_utc": 1629048216.0,
                    "replies": []
                }
            ]
        },
        {
            "body": ">People always say they'd rather have an absent father than an abusive father\n\nVery true . I find it funny when people say Sasuke had it worse than Naruto and Gaara . Sasuke had a horrible childhood without any doubt but in no way was it worse than Naruto or Gaara . Sasuke lost his family and his brother basically mindfucked him 2 times but I would say he still had atleast people who treated him like any other normal kid unlike Naruto who was despised by everyone .",
            "author": "Tarkik_Vatsa",
            "id": "h90z0h3",
            "parent_id": "t1_h90krhw",
            "score": 9,
            "created_utc": 1629032799.0,
            "replies": [
                {
                    "body": "I disagree. I would argue Sasuke had a worse childhood than Naruto, but not Gaara. Sasuke brings up good points that he had a bond with his family, and a tie to his entire clan, and that was severed by one person, while Naruto simply had nothing.\n\nI do see what you mean though",
                    "author": "FullMoon_Escapade",
                    "id": "h90zkr8",
                    "parent_id": "t1_h90z0h3",
                    "score": 12,
                    "created_utc": 1629033123.0,
                    "replies": [
                        {
                            "body": "I mean its not easy to compare . You can argue about who had a worse childhood between Sasuke and Naruto but I dont think there should be an argument regarding Gaara's childhood being worse than Sasuke . I find Naruto's childhood worse than Sasuke but that can be debated . As a 5 year old if you treated like shit by everyone around you and you dont even know what you did to deserve that treatment it will be depressing . Add to that the fact that you have no one to hear you or to give you a hug or to wipe off your tears . All you can do is cry on your own and get used to be treated like shit each fucking day .",
                            "author": "Tarkik_Vatsa",
                            "id": "h910ayv",
                            "parent_id": "t1_h90zkr8",
                            "score": 4,
                            "created_utc": 1629033532.0,
                            "replies": [
                                {
                                    "body": "Yeah. If you think about it, Gaara had the worst of both of their worlds.",
                                    "author": "FullMoon_Escapade",
                                    "id": "h912l4j",
                                    "parent_id": "t1_h910ayv",
                                    "score": 8,
                                    "created_utc": 1629034781.0,
                                    "replies": [
                                        {
                                            "body": "Exactly .",
                                            "author": "Tarkik_Vatsa",
                                            "id": "h912owp",
                                            "parent_id": "t1_h912l4j",
                                            "score": 2,
                                            "created_utc": 1629034837.0,
                                            "replies": [
                                                {
                                                    "body": "Shit bro, that's tough. Dude was born weak asf and his mom died during birth, causing his father to resent him and abuse him, then got a bijuu stuck in him who didn't only reside in him, but literally torment him to the point of sleepless nights, while also having the entire village ostracise him. The only person he ever trusted then turns out to be an opp and commits sepuku right in front of him.\n\nAn assassination attempt in an 8 year old's life? Damn.",
                                                    "author": "FullMoon_Escapade",
                                                    "id": "h912zj2",
                                                    "parent_id": "t1_h912owp",
                                                    "score": 10,
                                                    "created_utc": 1629034990.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "It must have been painful but I dont think Sasuke had it worst . Gaara wasnt even able to sleep man . Had no friends , no bonds . Sasuke had terrible things done to him by Itachi but atleast there were some people who cared for him and looked out for him . Similar to Sasuke , Gaara also saw the person he loved the most try to kill him . He had it worse than Sasuke without a doubt .",
            "author": "Tarkik_Vatsa",
            "id": "h90zhsy",
            "parent_id": "t1_h90wstf",
            "score": 4,
            "created_utc": 1629033076.0,
            "replies": []
        },
        {
            "body": "He had a mother and father who loved him . His parents never tried to get rid of him . He wasnt treated like nuisance ever since his birth . Nagato had a very bad childhood but I dont think it was worse than Gaara . I mentioned in a comment earlier that Nagato had the 2nd worst childhood imo .",
            "author": "Tarkik_Vatsa",
            "id": "h91dxol",
            "parent_id": "t1_h91cjk2",
            "score": 4,
            "created_utc": 1629040146.0,
            "replies": [
                {
                    "body": "Oh my ur dumb asf",
                    "author": "Fetial",
                    "id": "h91e2qs",
                    "parent_id": "t1_h91dxol",
                    "score": -6,
                    "created_utc": 1629040209.0,
                    "replies": [
                        {
                            "body": "You are calling me dumb just because I have a different opinion than you ? Thats funny man :)",
                            "author": "Tarkik_Vatsa",
                            "id": "h91e72o",
                            "parent_id": "t1_h91e2qs",
                            "score": 2,
                            "created_utc": 1629040263.0,
                            "replies": [
                                {
                                    "body": "When ur opinion is a dumb one you can’t expect to not be called dumb",
                                    "author": "Fetial",
                                    "id": "h91e97y",
                                    "parent_id": "t1_h91e72o",
                                    "score": -6,
                                    "created_utc": 1629040289.0,
                                    "replies": [
                                        {
                                            "body": "You should present your arguments as to why Nagato had it worse than Gaara instead of calling me dumb again and again .",
                                            "author": "Tarkik_Vatsa",
                                            "id": "h91efgx",
                                            "parent_id": "t1_h91e97y",
                                            "score": 2,
                                            "created_utc": 1629040367.0,
                                            "replies": [
                                                {
                                                    "body": "There isn’t any point nothing I say will change ur mind nor will anything u say change my mind",
                                                    "author": "Fetial",
                                                    "id": "h91ei22",
                                                    "parent_id": "t1_h91efgx",
                                                    "score": -6,
                                                    "created_utc": 1629040399.0,
                                                    "replies": [
                                                        {
                                                            "body": ">There isn’t any point nothing I say will change ur mind\n\nHow can you assume so ?",
                                                            "author": "Tarkik_Vatsa",
                                                            "id": "h91enw3",
                                                            "parent_id": "t1_h91ei22",
                                                            "score": 2,
                                                            "created_utc": 1629040471.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Because if ur that weak minded that people online change ur beliefs it’s pretty sad",
                                                                    "author": "Fetial",
                                                                    "id": "h91esqd",
                                                                    "parent_id": "t1_h91enw3",
                                                                    "score": 0,
                                                                    "created_utc": 1629040530.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "Lol you are making it sound like you will change my religion if I hear your opinion . You have got a serious problem buddy . I wish you better mental health .",
                                                                            "author": "Tarkik_Vatsa",
                                                                            "id": "h91i3rb",
                                                                            "parent_id": "t1_h91esqd",
                                                                            "score": 3,
                                                                            "created_utc": 1629041955.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "This guy a weirdo fr",
                                                                                    "author": "FullMoon_Escapade",
                                                                                    "id": "h91nnfc",
                                                                                    "parent_id": "t1_h91i3rb",
                                                                                    "score": 4,
                                                                                    "created_utc": 1629044270.0,
                                                                                    "replies": [
                                                                                        {
                                                                                            "body": "Yeah . I was trying to have a genuine conversation with him but I think its better to ignore him .",
                                                                                            "author": "Tarkik_Vatsa",
                                                                                            "id": "h91xxpr",
                                                                                            "parent_id": "t1_h91nnfc",
                                                                                            "score": 3,
                                                                                            "created_utc": 1629048517.0,
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "He literally died when Shukaku got sucked out",
            "author": "xGiven",
            "id": "h922urj",
            "parent_id": "t1_h91whnq",
            "score": 14,
            "created_utc": 1629050603.0,
            "replies": [
                {
                    "body": "That's fair.",
                    "author": "bhavbhav",
                    "id": "h925c5v",
                    "parent_id": "t1_h922urj",
                    "score": 1,
                    "created_utc": 1629051664.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Satisfying!",
            "author": null,
            "id": "h90yvxr",
            "parent_id": "t1_h90r63d",
            "score": 28,
            "created_utc": 1629032729.0,
            "replies": []
        },
        {
            "body": "They definitely should’ve made a dope fight out of that!",
            "author": null,
            "id": "h91ff6c",
            "parent_id": "t1_h90r63d",
            "score": 10,
            "created_utc": 1629040802.0,
            "replies": []
        },
        {
            "body": "I will say with how strong he was, orochimaru had to have sneak attacked him. He wouldn’t have been able to fight him and escape completely unscathed if it was a fair fight",
            "author": "Raiden2324",
            "id": "h91ir75",
            "parent_id": "t1_h90r63d",
            "score": 12,
            "created_utc": 1629042230.0,
            "replies": []
        },
        {
            "body": "I imagine he didn’t put up much of a fight, knowing Orochimaru he probably assassinated him stealthily",
            "author": "Available-Abrocoma-4",
            "id": "h91r4um",
            "parent_id": "t1_h90r63d",
            "score": 6,
            "created_utc": 1629045736.0,
            "replies": []
        },
        {
            "body": "Well he kinda hated gaara cuz his wife died giving birth to him.....(i think)...",
            "author": "NotSoGoodguyScorp",
            "id": "h90vwsg",
            "parent_id": "t1_h90fkro",
            "score": 25,
            "created_utc": 1629030951.0,
            "replies": [
                {
                    "body": "Yeah I also think this was the case . He was a good husband imo and might have even been a good father to Kankuro and Temari before Gaara's birth .",
                    "author": "Tarkik_Vatsa",
                    "id": "h90z6px",
                    "parent_id": "t1_h90vwsg",
                    "score": 14,
                    "created_utc": 1629032899.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "He cared about his wife but he also wanted a kid who was to be a perfect jinchuricki so he forced pregnancies on her.\n\nSimilar to Sanji's dad.",
            "author": "sonfoa",
            "id": "h90wl9c",
            "parent_id": "t1_h90fkro",
            "score": 19,
            "created_utc": 1629031369.0,
            "replies": [
                {
                    "body": "Who's Sanji ?",
                    "author": "Tarkik_Vatsa",
                    "id": "h90z9r2",
                    "parent_id": "t1_h90wl9c",
                    "score": 3,
                    "created_utc": 1629032949.0,
                    "replies": [
                        {
                            "body": "One Piece character whose dad was pretty big into eugenics.",
                            "author": "sonfoa",
                            "id": "h910wwd",
                            "parent_id": "t1_h90z9r2",
                            "score": 10,
                            "created_utc": 1629033866.0,
                            "replies": [
                                {
                                    "body": "Oh I havent watched One Piece yet so I dont know anything about him .",
                                    "author": "Tarkik_Vatsa",
                                    "id": "h912nry",
                                    "parent_id": "t1_h910wwd",
                                    "score": 6,
                                    "created_utc": 1629034821.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "**This word/phrase(sanji) has a few different meanings.**\n\nMore details here: <https://en.wikipedia.org/wiki/Sanji> \n\n\n\n*This comment was left automatically (by a bot). If I don't get this right, don't get mad at me, I'm still learning!*\n\n[^(opt out)](https://www.reddit.com/r/wikipedia_answer_bot/comments/ozztfy/post_for_opting_out/) ^(|) [^(report/suggest)](https://www.reddit.com/r/wikipedia_answer_bot)",
                            "author": "wikipedia_answer_bot",
                            "id": "h90zamw",
                            "parent_id": "t1_h90z9r2",
                            "score": 0,
                            "created_utc": 1629032962.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Idk, the judge is worse",
                    "author": "ZORO_Shusui",
                    "id": "h91dspm",
                    "parent_id": "t1_h90wl9c",
                    "score": 4,
                    "created_utc": 1629040084.0,
                    "replies": [
                        {
                            "body": "Yeah, Judge is worse now that I think about it. We don't really see him ever show love to his wife and his love for his children is contingent on how they impact his legacy. Hopefully, he changed after the events of WCI.\n\nAt least Rasa showed concern for Karura when she died. Judge was angry that Sanji was crying at his mother's grave.",
                            "author": "sonfoa",
                            "id": "h91eqez",
                            "parent_id": "t1_h91dspm",
                            "score": 3,
                            "created_utc": 1629040502.0,
                            "replies": [
                                {
                                    "body": "Well judge was angry because he tried to genetically engineer his children to not have emotions like that. All the children save ichiji have shown concern for each other so I’m sure they weren’t happy their mom died but they just can’t cry",
                                    "author": "Raiden2324",
                                    "id": "h91k2fj",
                                    "parent_id": "t1_h91eqez",
                                    "score": 1,
                                    "created_utc": 1629042775.0,
                                    "replies": [
                                        {
                                            "body": "They beat up Sanji for crying. They can't feel any vulnerability and thus can't bond. Even when they save each other it's because of their status not out of love. When they save Judge from Big Mom, it's not because he's their dad but because he's the captain of Germa.",
                                            "author": "sonfoa",
                                            "id": "h91pccv",
                                            "parent_id": "t1_h91k2fj",
                                            "score": 3,
                                            "created_utc": 1629044979.0,
                                            "replies": [
                                                {
                                                    "body": "Yeah his siblings are bad but think about it, they just followed whatever judge was saying + they already bullied him. It’s not like yonji was ever bullied ever though he’s weaker than everyone else. It’s because judge said sanji is a failure. You could see that yonji and Niji cared for reiju and judge when they got in trouble at the tea party. Only ichiji has a complete inability for compassion.",
                                                    "author": "Raiden2324",
                                                    "id": "h91qhun",
                                                    "parent_id": "t1_h91pccv",
                                                    "score": 0,
                                                    "created_utc": 1629045468.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I think it was actually stated somewhere that the black circles around his eyes are traces of years of sleep deprivation because of Shukaku",
            "author": "Maria_Shinkareva",
            "id": "h90x7pw",
            "parent_id": "t1_h90w76x",
            "score": 65,
            "created_utc": 1629031745.0,
            "replies": [
                {
                    "body": "Nah, look up a picture of baby Gaara, even as an infant he had them",
                    "author": "Agorbs",
                    "id": "h90xfm4",
                    "parent_id": "t1_h90x7pw",
                    "score": 27,
                    "created_utc": 1629031877.0,
                    "replies": [
                        {
                            "body": "Gamabunta did state it was from sleep deprivation when Naruto and Gaara fought after the chunin exams, but he could've been wrong or they/Kishimoto could have forgotten about it when drawing him as an infant.\n\nHim being like that as an infant doesn't really give us much though. He could've already had the Shukaku sealed in him by then, in fact, it's likely a parallel to Naruto (Who btw already had his \"whiskers\" when he was born, not because he was already the jinchuriki, but because he was born to Kushina who was).\n\nWe know his mother died when he was born, and when we see him as an infant, his mother is already clearly dying next to him.\n\nThe power she gave him is also ridiculously powerful for a regular ninja to do. It's not at all unrealistic to assume that his mother was the previous Jinchuriki.\n\nRasa (Gaara's dad) only has those eyes when he's using his gold dust / magnet release abilities. Gaara has them 24/7 likely because the autonomous ultimate protection his mother gave him is constantly activated, which is of course also a magnet release ability, and is an ability exactly like the Shukaku's abilities. It would be pretty weird to assume she WASN'T the previous Jinchuriki.\n\nWe know Rasa wasn't because he literally used his abilities to fight the Shukaku and keep him at bay, and was the only person who could keep the village safe if the Shukaku attacked.\n\n\"This is the third child and the first compatible one.\" That's what was said when Gaara was born. Chances are he already had the Shukaku sealed inside him even in the earliest picture we have of him as an infant, with his mother dying at his side likely because she was the previous Jinchuriki and had to transfer it to his son, imparting her final power/wishes to keep him safe, just like Kushina did.\n\nWhether she was the previous Jinchuriki or not, we can't know for certain, but we do know Gaara's eyes are most likely from the power she gave him, which is constantly activated, or from the Shukaku, who's powers also revolve around magnet release. The way Rasa's eyes only get that black eyeliner when he's using his magnet release abilities should be a good hint for this.",
                            "author": "PassdatAss91",
                            "id": "h911968",
                            "parent_id": "t1_h90xfm4",
                            "score": 28,
                            "created_utc": 1629034057.0,
                            "replies": [
                                {
                                    "body": "Correct me if I'm wrong, but Garra had shukaku sealed in him when he was in the womb.",
                                    "author": "barry3672",
                                    "id": "h91vgy2",
                                    "parent_id": "t1_h911968",
                                    "score": 9,
                                    "created_utc": 1629047521.0,
                                    "replies": [
                                        {
                                            "body": "yeah Chiyo did the sealing, the old monk was the last jinchuriki before Gaara",
                                            "author": "amir_a1001",
                                            "id": "h91xmym",
                                            "parent_id": "t1_h91vgy2",
                                            "score": 4,
                                            "created_utc": 1629048397.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "Well shit, that alone explains it. Wish I knew that before I wasted my time typing all that shit >.<\n\nStill at least I clarified why Rasa had the same eyes (while using his abilities).",
                                            "author": "PassdatAss91",
                                            "id": "h92bdt0",
                                            "parent_id": "t1_h91vgy2",
                                            "score": 2,
                                            "created_utc": 1629054266.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "You're right. He did. Then maybe it is just a part of Gaara's design, like the lack of eyebrows 😆",
                            "author": "Maria_Shinkareva",
                            "id": "h90xxe0",
                            "parent_id": "t1_h90xfm4",
                            "score": 11,
                            "created_utc": 1629032171.0,
                            "replies": [
                                {
                                    "body": ">Gaara's \n\nit is stated though that gaara became shukakus jinchuriki even BEFORE he was born (how thats possible i dont know) so yeah, its probably because gaara hasnt slept since his birth or something like that",
                                    "author": "Vahn1857",
                                    "id": "h90zwko",
                                    "parent_id": "t1_h90xxe0",
                                    "score": 5,
                                    "created_utc": 1629033307.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Rasa wasn't a Shukaku jinchuriki",
            "author": "MandelAomine",
            "id": "h9319ue",
            "parent_id": "t1_h90w76x",
            "score": 2,
            "created_utc": 1629065506.0,
            "replies": [
                {
                    "body": "Rasa didn’t have the dark eyes, so…",
                    "author": "Agorbs",
                    "id": "h933bkq",
                    "parent_id": "t1_h9319ue",
                    "score": 0,
                    "created_utc": 1629066460.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Who would've taken a kid gaara first? the akatsuki or orochimaru?",
            "author": "blackwolfgoogol",
            "id": "h90z4xo",
            "parent_id": "t1_h90p7au",
            "score": 9,
            "created_utc": 1629032872.0,
            "replies": [
                {
                    "body": "Idk, probably akatsuki cos they need tail beasts and having a jinchuriki on their side would give them a huge advantage. Orochimaru on the other hand would've had no interest in him at that time cos he wasn't of any use to him in achieving immortality.",
                    "author": null,
                    "id": "h9103ep",
                    "parent_id": "t1_h90z4xo",
                    "score": 18,
                    "created_utc": 1629033415.0,
                    "replies": [
                        {
                            "body": "i think the akatsuki wouldnt even bother convincing gaara and wouldve just killed him \n\nif OROCHIMARU took him he'd be using the chance to expirement on a jinchuriki, specifically their regenerative abilities and power",
                            "author": "blackwolfgoogol",
                            "id": "h910x1j",
                            "parent_id": "t1_h9103ep",
                            "score": 4,
                            "created_utc": 1629033869.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Naruto was a target though, that's the reason his last name was Uzumaki and not Namikaze, Minato fucked a lot of people up during his time in the third war, those people were looking for revenge and probably would have come after Naruto if they knew about him. Also,  this is purely my own headcanon, I'd always assumed the reason Naruto was raised as an orphan instead of within the hokage household was so that it would be much harder for people,  namely the Akatsuki, to find out he was a jinchuriki, but I guess Danzo spoiled those plans.\n\nEDIT: Now that I think about it, my Akatsuki theory makes no sense since Jiraiya was the one who found out about the Akatsuki kidnapping jinchuriki around the time of the chuunin exams",
            "author": "uglynerdishere",
            "id": "h91x6cz",
            "parent_id": "t1_h90p7au",
            "score": 3,
            "created_utc": 1629048216.0,
            "replies": []
        },
        {
            "body": "I disagree. I would argue Sasuke had a worse childhood than Naruto, but not Gaara. Sasuke brings up good points that he had a bond with his family, and a tie to his entire clan, and that was severed by one person, while Naruto simply had nothing.\n\nI do see what you mean though",
            "author": "FullMoon_Escapade",
            "id": "h90zkr8",
            "parent_id": "t1_h90z0h3",
            "score": 12,
            "created_utc": 1629033123.0,
            "replies": [
                {
                    "body": "I mean its not easy to compare . You can argue about who had a worse childhood between Sasuke and Naruto but I dont think there should be an argument regarding Gaara's childhood being worse than Sasuke . I find Naruto's childhood worse than Sasuke but that can be debated . As a 5 year old if you treated like shit by everyone around you and you dont even know what you did to deserve that treatment it will be depressing . Add to that the fact that you have no one to hear you or to give you a hug or to wipe off your tears . All you can do is cry on your own and get used to be treated like shit each fucking day .",
                    "author": "Tarkik_Vatsa",
                    "id": "h910ayv",
                    "parent_id": "t1_h90zkr8",
                    "score": 4,
                    "created_utc": 1629033532.0,
                    "replies": [
                        {
                            "body": "Yeah. If you think about it, Gaara had the worst of both of their worlds.",
                            "author": "FullMoon_Escapade",
                            "id": "h912l4j",
                            "parent_id": "t1_h910ayv",
                            "score": 8,
                            "created_utc": 1629034781.0,
                            "replies": [
                                {
                                    "body": "Exactly .",
                                    "author": "Tarkik_Vatsa",
                                    "id": "h912owp",
                                    "parent_id": "t1_h912l4j",
                                    "score": 2,
                                    "created_utc": 1629034837.0,
                                    "replies": [
                                        {
                                            "body": "Shit bro, that's tough. Dude was born weak asf and his mom died during birth, causing his father to resent him and abuse him, then got a bijuu stuck in him who didn't only reside in him, but literally torment him to the point of sleepless nights, while also having the entire village ostracise him. The only person he ever trusted then turns out to be an opp and commits sepuku right in front of him.\n\nAn assassination attempt in an 8 year old's life? Damn.",
                                            "author": "FullMoon_Escapade",
                                            "id": "h912zj2",
                                            "parent_id": "t1_h912owp",
                                            "score": 10,
                                            "created_utc": 1629034990.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Oh my ur dumb asf",
            "author": "Fetial",
            "id": "h91e2qs",
            "parent_id": "t1_h91dxol",
            "score": -6,
            "created_utc": 1629040209.0,
            "replies": [
                {
                    "body": "You are calling me dumb just because I have a different opinion than you ? Thats funny man :)",
                    "author": "Tarkik_Vatsa",
                    "id": "h91e72o",
                    "parent_id": "t1_h91e2qs",
                    "score": 2,
                    "created_utc": 1629040263.0,
                    "replies": [
                        {
                            "body": "When ur opinion is a dumb one you can’t expect to not be called dumb",
                            "author": "Fetial",
                            "id": "h91e97y",
                            "parent_id": "t1_h91e72o",
                            "score": -6,
                            "created_utc": 1629040289.0,
                            "replies": [
                                {
                                    "body": "You should present your arguments as to why Nagato had it worse than Gaara instead of calling me dumb again and again .",
                                    "author": "Tarkik_Vatsa",
                                    "id": "h91efgx",
                                    "parent_id": "t1_h91e97y",
                                    "score": 2,
                                    "created_utc": 1629040367.0,
                                    "replies": [
                                        {
                                            "body": "There isn’t any point nothing I say will change ur mind nor will anything u say change my mind",
                                            "author": "Fetial",
                                            "id": "h91ei22",
                                            "parent_id": "t1_h91efgx",
                                            "score": -6,
                                            "created_utc": 1629040399.0,
                                            "replies": [
                                                {
                                                    "body": ">There isn’t any point nothing I say will change ur mind\n\nHow can you assume so ?",
                                                    "author": "Tarkik_Vatsa",
                                                    "id": "h91enw3",
                                                    "parent_id": "t1_h91ei22",
                                                    "score": 2,
                                                    "created_utc": 1629040471.0,
                                                    "replies": [
                                                        {
                                                            "body": "Because if ur that weak minded that people online change ur beliefs it’s pretty sad",
                                                            "author": "Fetial",
                                                            "id": "h91esqd",
                                                            "parent_id": "t1_h91enw3",
                                                            "score": 0,
                                                            "created_utc": 1629040530.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Lol you are making it sound like you will change my religion if I hear your opinion . You have got a serious problem buddy . I wish you better mental health .",
                                                                    "author": "Tarkik_Vatsa",
                                                                    "id": "h91i3rb",
                                                                    "parent_id": "t1_h91esqd",
                                                                    "score": 3,
                                                                    "created_utc": 1629041955.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "This guy a weirdo fr",
                                                                            "author": "FullMoon_Escapade",
                                                                            "id": "h91nnfc",
                                                                            "parent_id": "t1_h91i3rb",
                                                                            "score": 4,
                                                                            "created_utc": 1629044270.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "Yeah . I was trying to have a genuine conversation with him but I think its better to ignore him .",
                                                                                    "author": "Tarkik_Vatsa",
                                                                                    "id": "h91xxpr",
                                                                                    "parent_id": "t1_h91nnfc",
                                                                                    "score": 3,
                                                                                    "created_utc": 1629048517.0,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "That's fair.",
            "author": "bhavbhav",
            "id": "h925c5v",
            "parent_id": "t1_h922urj",
            "score": 1,
            "created_utc": 1629051664.0,
            "replies": []
        },
        {
            "body": "Yeah I also think this was the case . He was a good husband imo and might have even been a good father to Kankuro and Temari before Gaara's birth .",
            "author": "Tarkik_Vatsa",
            "id": "h90z6px",
            "parent_id": "t1_h90vwsg",
            "score": 14,
            "created_utc": 1629032899.0,
            "replies": []
        },
        {
            "body": "Who's Sanji ?",
            "author": "Tarkik_Vatsa",
            "id": "h90z9r2",
            "parent_id": "t1_h90wl9c",
            "score": 3,
            "created_utc": 1629032949.0,
            "replies": [
                {
                    "body": "One Piece character whose dad was pretty big into eugenics.",
                    "author": "sonfoa",
                    "id": "h910wwd",
                    "parent_id": "t1_h90z9r2",
                    "score": 10,
                    "created_utc": 1629033866.0,
                    "replies": [
                        {
                            "body": "Oh I havent watched One Piece yet so I dont know anything about him .",
                            "author": "Tarkik_Vatsa",
                            "id": "h912nry",
                            "parent_id": "t1_h910wwd",
                            "score": 6,
                            "created_utc": 1629034821.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "**This word/phrase(sanji) has a few different meanings.**\n\nMore details here: <https://en.wikipedia.org/wiki/Sanji> \n\n\n\n*This comment was left automatically (by a bot). If I don't get this right, don't get mad at me, I'm still learning!*\n\n[^(opt out)](https://www.reddit.com/r/wikipedia_answer_bot/comments/ozztfy/post_for_opting_out/) ^(|) [^(report/suggest)](https://www.reddit.com/r/wikipedia_answer_bot)",
                    "author": "wikipedia_answer_bot",
                    "id": "h90zamw",
                    "parent_id": "t1_h90z9r2",
                    "score": 0,
                    "created_utc": 1629032962.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Idk, the judge is worse",
            "author": "ZORO_Shusui",
            "id": "h91dspm",
            "parent_id": "t1_h90wl9c",
            "score": 4,
            "created_utc": 1629040084.0,
            "replies": [
                {
                    "body": "Yeah, Judge is worse now that I think about it. We don't really see him ever show love to his wife and his love for his children is contingent on how they impact his legacy. Hopefully, he changed after the events of WCI.\n\nAt least Rasa showed concern for Karura when she died. Judge was angry that Sanji was crying at his mother's grave.",
                    "author": "sonfoa",
                    "id": "h91eqez",
                    "parent_id": "t1_h91dspm",
                    "score": 3,
                    "created_utc": 1629040502.0,
                    "replies": [
                        {
                            "body": "Well judge was angry because he tried to genetically engineer his children to not have emotions like that. All the children save ichiji have shown concern for each other so I’m sure they weren’t happy their mom died but they just can’t cry",
                            "author": "Raiden2324",
                            "id": "h91k2fj",
                            "parent_id": "t1_h91eqez",
                            "score": 1,
                            "created_utc": 1629042775.0,
                            "replies": [
                                {
                                    "body": "They beat up Sanji for crying. They can't feel any vulnerability and thus can't bond. Even when they save each other it's because of their status not out of love. When they save Judge from Big Mom, it's not because he's their dad but because he's the captain of Germa.",
                                    "author": "sonfoa",
                                    "id": "h91pccv",
                                    "parent_id": "t1_h91k2fj",
                                    "score": 3,
                                    "created_utc": 1629044979.0,
                                    "replies": [
                                        {
                                            "body": "Yeah his siblings are bad but think about it, they just followed whatever judge was saying + they already bullied him. It’s not like yonji was ever bullied ever though he’s weaker than everyone else. It’s because judge said sanji is a failure. You could see that yonji and Niji cared for reiju and judge when they got in trouble at the tea party. Only ichiji has a complete inability for compassion.",
                                            "author": "Raiden2324",
                                            "id": "h91qhun",
                                            "parent_id": "t1_h91pccv",
                                            "score": 0,
                                            "created_utc": 1629045468.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Nah, look up a picture of baby Gaara, even as an infant he had them",
            "author": "Agorbs",
            "id": "h90xfm4",
            "parent_id": "t1_h90x7pw",
            "score": 27,
            "created_utc": 1629031877.0,
            "replies": [
                {
                    "body": "Gamabunta did state it was from sleep deprivation when Naruto and Gaara fought after the chunin exams, but he could've been wrong or they/Kishimoto could have forgotten about it when drawing him as an infant.\n\nHim being like that as an infant doesn't really give us much though. He could've already had the Shukaku sealed in him by then, in fact, it's likely a parallel to Naruto (Who btw already had his \"whiskers\" when he was born, not because he was already the jinchuriki, but because he was born to Kushina who was).\n\nWe know his mother died when he was born, and when we see him as an infant, his mother is already clearly dying next to him.\n\nThe power she gave him is also ridiculously powerful for a regular ninja to do. It's not at all unrealistic to assume that his mother was the previous Jinchuriki.\n\nRasa (Gaara's dad) only has those eyes when he's using his gold dust / magnet release abilities. Gaara has them 24/7 likely because the autonomous ultimate protection his mother gave him is constantly activated, which is of course also a magnet release ability, and is an ability exactly like the Shukaku's abilities. It would be pretty weird to assume she WASN'T the previous Jinchuriki.\n\nWe know Rasa wasn't because he literally used his abilities to fight the Shukaku and keep him at bay, and was the only person who could keep the village safe if the Shukaku attacked.\n\n\"This is the third child and the first compatible one.\" That's what was said when Gaara was born. Chances are he already had the Shukaku sealed inside him even in the earliest picture we have of him as an infant, with his mother dying at his side likely because she was the previous Jinchuriki and had to transfer it to his son, imparting her final power/wishes to keep him safe, just like Kushina did.\n\nWhether she was the previous Jinchuriki or not, we can't know for certain, but we do know Gaara's eyes are most likely from the power she gave him, which is constantly activated, or from the Shukaku, who's powers also revolve around magnet release. The way Rasa's eyes only get that black eyeliner when he's using his magnet release abilities should be a good hint for this.",
                    "author": "PassdatAss91",
                    "id": "h911968",
                    "parent_id": "t1_h90xfm4",
                    "score": 28,
                    "created_utc": 1629034057.0,
                    "replies": [
                        {
                            "body": "Correct me if I'm wrong, but Garra had shukaku sealed in him when he was in the womb.",
                            "author": "barry3672",
                            "id": "h91vgy2",
                            "parent_id": "t1_h911968",
                            "score": 9,
                            "created_utc": 1629047521.0,
                            "replies": [
                                {
                                    "body": "yeah Chiyo did the sealing, the old monk was the last jinchuriki before Gaara",
                                    "author": "amir_a1001",
                                    "id": "h91xmym",
                                    "parent_id": "t1_h91vgy2",
                                    "score": 4,
                                    "created_utc": 1629048397.0,
                                    "replies": []
                                },
                                {
                                    "body": "Well shit, that alone explains it. Wish I knew that before I wasted my time typing all that shit >.<\n\nStill at least I clarified why Rasa had the same eyes (while using his abilities).",
                                    "author": "PassdatAss91",
                                    "id": "h92bdt0",
                                    "parent_id": "t1_h91vgy2",
                                    "score": 2,
                                    "created_utc": 1629054266.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "You're right. He did. Then maybe it is just a part of Gaara's design, like the lack of eyebrows 😆",
                    "author": "Maria_Shinkareva",
                    "id": "h90xxe0",
                    "parent_id": "t1_h90xfm4",
                    "score": 11,
                    "created_utc": 1629032171.0,
                    "replies": [
                        {
                            "body": ">Gaara's \n\nit is stated though that gaara became shukakus jinchuriki even BEFORE he was born (how thats possible i dont know) so yeah, its probably because gaara hasnt slept since his birth or something like that",
                            "author": "Vahn1857",
                            "id": "h90zwko",
                            "parent_id": "t1_h90xxe0",
                            "score": 5,
                            "created_utc": 1629033307.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Rasa didn’t have the dark eyes, so…",
            "author": "Agorbs",
            "id": "h933bkq",
            "parent_id": "t1_h9319ue",
            "score": 0,
            "created_utc": 1629066460.0,
            "replies": []
        },
        {
            "body": "Idk, probably akatsuki cos they need tail beasts and having a jinchuriki on their side would give them a huge advantage. Orochimaru on the other hand would've had no interest in him at that time cos he wasn't of any use to him in achieving immortality.",
            "author": null,
            "id": "h9103ep",
            "parent_id": "t1_h90z4xo",
            "score": 18,
            "created_utc": 1629033415.0,
            "replies": [
                {
                    "body": "i think the akatsuki wouldnt even bother convincing gaara and wouldve just killed him \n\nif OROCHIMARU took him he'd be using the chance to expirement on a jinchuriki, specifically their regenerative abilities and power",
                    "author": "blackwolfgoogol",
                    "id": "h910x1j",
                    "parent_id": "t1_h9103ep",
                    "score": 4,
                    "created_utc": 1629033869.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I mean its not easy to compare . You can argue about who had a worse childhood between Sasuke and Naruto but I dont think there should be an argument regarding Gaara's childhood being worse than Sasuke . I find Naruto's childhood worse than Sasuke but that can be debated . As a 5 year old if you treated like shit by everyone around you and you dont even know what you did to deserve that treatment it will be depressing . Add to that the fact that you have no one to hear you or to give you a hug or to wipe off your tears . All you can do is cry on your own and get used to be treated like shit each fucking day .",
            "author": "Tarkik_Vatsa",
            "id": "h910ayv",
            "parent_id": "t1_h90zkr8",
            "score": 4,
            "created_utc": 1629033532.0,
            "replies": [
                {
                    "body": "Yeah. If you think about it, Gaara had the worst of both of their worlds.",
                    "author": "FullMoon_Escapade",
                    "id": "h912l4j",
                    "parent_id": "t1_h910ayv",
                    "score": 8,
                    "created_utc": 1629034781.0,
                    "replies": [
                        {
                            "body": "Exactly .",
                            "author": "Tarkik_Vatsa",
                            "id": "h912owp",
                            "parent_id": "t1_h912l4j",
                            "score": 2,
                            "created_utc": 1629034837.0,
                            "replies": [
                                {
                                    "body": "Shit bro, that's tough. Dude was born weak asf and his mom died during birth, causing his father to resent him and abuse him, then got a bijuu stuck in him who didn't only reside in him, but literally torment him to the point of sleepless nights, while also having the entire village ostracise him. The only person he ever trusted then turns out to be an opp and commits sepuku right in front of him.\n\nAn assassination attempt in an 8 year old's life? Damn.",
                                    "author": "FullMoon_Escapade",
                                    "id": "h912zj2",
                                    "parent_id": "t1_h912owp",
                                    "score": 10,
                                    "created_utc": 1629034990.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "You are calling me dumb just because I have a different opinion than you ? Thats funny man :)",
            "author": "Tarkik_Vatsa",
            "id": "h91e72o",
            "parent_id": "t1_h91e2qs",
            "score": 2,
            "created_utc": 1629040263.0,
            "replies": [
                {
                    "body": "When ur opinion is a dumb one you can’t expect to not be called dumb",
                    "author": "Fetial",
                    "id": "h91e97y",
                    "parent_id": "t1_h91e72o",
                    "score": -6,
                    "created_utc": 1629040289.0,
                    "replies": [
                        {
                            "body": "You should present your arguments as to why Nagato had it worse than Gaara instead of calling me dumb again and again .",
                            "author": "Tarkik_Vatsa",
                            "id": "h91efgx",
                            "parent_id": "t1_h91e97y",
                            "score": 2,
                            "created_utc": 1629040367.0,
                            "replies": [
                                {
                                    "body": "There isn’t any point nothing I say will change ur mind nor will anything u say change my mind",
                                    "author": "Fetial",
                                    "id": "h91ei22",
                                    "parent_id": "t1_h91efgx",
                                    "score": -6,
                                    "created_utc": 1629040399.0,
                                    "replies": [
                                        {
                                            "body": ">There isn’t any point nothing I say will change ur mind\n\nHow can you assume so ?",
                                            "author": "Tarkik_Vatsa",
                                            "id": "h91enw3",
                                            "parent_id": "t1_h91ei22",
                                            "score": 2,
                                            "created_utc": 1629040471.0,
                                            "replies": [
                                                {
                                                    "body": "Because if ur that weak minded that people online change ur beliefs it’s pretty sad",
                                                    "author": "Fetial",
                                                    "id": "h91esqd",
                                                    "parent_id": "t1_h91enw3",
                                                    "score": 0,
                                                    "created_utc": 1629040530.0,
                                                    "replies": [
                                                        {
                                                            "body": "Lol you are making it sound like you will change my religion if I hear your opinion . You have got a serious problem buddy . I wish you better mental health .",
                                                            "author": "Tarkik_Vatsa",
                                                            "id": "h91i3rb",
                                                            "parent_id": "t1_h91esqd",
                                                            "score": 3,
                                                            "created_utc": 1629041955.0,
                                                            "replies": [
                                                                {
                                                                    "body": "This guy a weirdo fr",
                                                                    "author": "FullMoon_Escapade",
                                                                    "id": "h91nnfc",
                                                                    "parent_id": "t1_h91i3rb",
                                                                    "score": 4,
                                                                    "created_utc": 1629044270.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "Yeah . I was trying to have a genuine conversation with him but I think its better to ignore him .",
                                                                            "author": "Tarkik_Vatsa",
                                                                            "id": "h91xxpr",
                                                                            "parent_id": "t1_h91nnfc",
                                                                            "score": 3,
                                                                            "created_utc": 1629048517.0,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "One Piece character whose dad was pretty big into eugenics.",
            "author": "sonfoa",
            "id": "h910wwd",
            "parent_id": "t1_h90z9r2",
            "score": 10,
            "created_utc": 1629033866.0,
            "replies": [
                {
                    "body": "Oh I havent watched One Piece yet so I dont know anything about him .",
                    "author": "Tarkik_Vatsa",
                    "id": "h912nry",
                    "parent_id": "t1_h910wwd",
                    "score": 6,
                    "created_utc": 1629034821.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "**This word/phrase(sanji) has a few different meanings.**\n\nMore details here: <https://en.wikipedia.org/wiki/Sanji> \n\n\n\n*This comment was left automatically (by a bot). If I don't get this right, don't get mad at me, I'm still learning!*\n\n[^(opt out)](https://www.reddit.com/r/wikipedia_answer_bot/comments/ozztfy/post_for_opting_out/) ^(|) [^(report/suggest)](https://www.reddit.com/r/wikipedia_answer_bot)",
            "author": "wikipedia_answer_bot",
            "id": "h90zamw",
            "parent_id": "t1_h90z9r2",
            "score": 0,
            "created_utc": 1629032962.0,
            "replies": []
        },
        {
            "body": "Yeah, Judge is worse now that I think about it. We don't really see him ever show love to his wife and his love for his children is contingent on how they impact his legacy. Hopefully, he changed after the events of WCI.\n\nAt least Rasa showed concern for Karura when she died. Judge was angry that Sanji was crying at his mother's grave.",
            "author": "sonfoa",
            "id": "h91eqez",
            "parent_id": "t1_h91dspm",
            "score": 3,
            "created_utc": 1629040502.0,
            "replies": [
                {
                    "body": "Well judge was angry because he tried to genetically engineer his children to not have emotions like that. All the children save ichiji have shown concern for each other so I’m sure they weren’t happy their mom died but they just can’t cry",
                    "author": "Raiden2324",
                    "id": "h91k2fj",
                    "parent_id": "t1_h91eqez",
                    "score": 1,
                    "created_utc": 1629042775.0,
                    "replies": [
                        {
                            "body": "They beat up Sanji for crying. They can't feel any vulnerability and thus can't bond. Even when they save each other it's because of their status not out of love. When they save Judge from Big Mom, it's not because he's their dad but because he's the captain of Germa.",
                            "author": "sonfoa",
                            "id": "h91pccv",
                            "parent_id": "t1_h91k2fj",
                            "score": 3,
                            "created_utc": 1629044979.0,
                            "replies": [
                                {
                                    "body": "Yeah his siblings are bad but think about it, they just followed whatever judge was saying + they already bullied him. It’s not like yonji was ever bullied ever though he’s weaker than everyone else. It’s because judge said sanji is a failure. You could see that yonji and Niji cared for reiju and judge when they got in trouble at the tea party. Only ichiji has a complete inability for compassion.",
                                    "author": "Raiden2324",
                                    "id": "h91qhun",
                                    "parent_id": "t1_h91pccv",
                                    "score": 0,
                                    "created_utc": 1629045468.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Gamabunta did state it was from sleep deprivation when Naruto and Gaara fought after the chunin exams, but he could've been wrong or they/Kishimoto could have forgotten about it when drawing him as an infant.\n\nHim being like that as an infant doesn't really give us much though. He could've already had the Shukaku sealed in him by then, in fact, it's likely a parallel to Naruto (Who btw already had his \"whiskers\" when he was born, not because he was already the jinchuriki, but because he was born to Kushina who was).\n\nWe know his mother died when he was born, and when we see him as an infant, his mother is already clearly dying next to him.\n\nThe power she gave him is also ridiculously powerful for a regular ninja to do. It's not at all unrealistic to assume that his mother was the previous Jinchuriki.\n\nRasa (Gaara's dad) only has those eyes when he's using his gold dust / magnet release abilities. Gaara has them 24/7 likely because the autonomous ultimate protection his mother gave him is constantly activated, which is of course also a magnet release ability, and is an ability exactly like the Shukaku's abilities. It would be pretty weird to assume she WASN'T the previous Jinchuriki.\n\nWe know Rasa wasn't because he literally used his abilities to fight the Shukaku and keep him at bay, and was the only person who could keep the village safe if the Shukaku attacked.\n\n\"This is the third child and the first compatible one.\" That's what was said when Gaara was born. Chances are he already had the Shukaku sealed inside him even in the earliest picture we have of him as an infant, with his mother dying at his side likely because she was the previous Jinchuriki and had to transfer it to his son, imparting her final power/wishes to keep him safe, just like Kushina did.\n\nWhether she was the previous Jinchuriki or not, we can't know for certain, but we do know Gaara's eyes are most likely from the power she gave him, which is constantly activated, or from the Shukaku, who's powers also revolve around magnet release. The way Rasa's eyes only get that black eyeliner when he's using his magnet release abilities should be a good hint for this.",
            "author": "PassdatAss91",
            "id": "h911968",
            "parent_id": "t1_h90xfm4",
            "score": 28,
            "created_utc": 1629034057.0,
            "replies": [
                {
                    "body": "Correct me if I'm wrong, but Garra had shukaku sealed in him when he was in the womb.",
                    "author": "barry3672",
                    "id": "h91vgy2",
                    "parent_id": "t1_h911968",
                    "score": 9,
                    "created_utc": 1629047521.0,
                    "replies": [
                        {
                            "body": "yeah Chiyo did the sealing, the old monk was the last jinchuriki before Gaara",
                            "author": "amir_a1001",
                            "id": "h91xmym",
                            "parent_id": "t1_h91vgy2",
                            "score": 4,
                            "created_utc": 1629048397.0,
                            "replies": []
                        },
                        {
                            "body": "Well shit, that alone explains it. Wish I knew that before I wasted my time typing all that shit >.<\n\nStill at least I clarified why Rasa had the same eyes (while using his abilities).",
                            "author": "PassdatAss91",
                            "id": "h92bdt0",
                            "parent_id": "t1_h91vgy2",
                            "score": 2,
                            "created_utc": 1629054266.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "You're right. He did. Then maybe it is just a part of Gaara's design, like the lack of eyebrows 😆",
            "author": "Maria_Shinkareva",
            "id": "h90xxe0",
            "parent_id": "t1_h90xfm4",
            "score": 11,
            "created_utc": 1629032171.0,
            "replies": [
                {
                    "body": ">Gaara's \n\nit is stated though that gaara became shukakus jinchuriki even BEFORE he was born (how thats possible i dont know) so yeah, its probably because gaara hasnt slept since his birth or something like that",
                    "author": "Vahn1857",
                    "id": "h90zwko",
                    "parent_id": "t1_h90xxe0",
                    "score": 5,
                    "created_utc": 1629033307.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "i think the akatsuki wouldnt even bother convincing gaara and wouldve just killed him \n\nif OROCHIMARU took him he'd be using the chance to expirement on a jinchuriki, specifically their regenerative abilities and power",
            "author": "blackwolfgoogol",
            "id": "h910x1j",
            "parent_id": "t1_h9103ep",
            "score": 4,
            "created_utc": 1629033869.0,
            "replies": []
        },
        {
            "body": "Yeah. If you think about it, Gaara had the worst of both of their worlds.",
            "author": "FullMoon_Escapade",
            "id": "h912l4j",
            "parent_id": "t1_h910ayv",
            "score": 8,
            "created_utc": 1629034781.0,
            "replies": [
                {
                    "body": "Exactly .",
                    "author": "Tarkik_Vatsa",
                    "id": "h912owp",
                    "parent_id": "t1_h912l4j",
                    "score": 2,
                    "created_utc": 1629034837.0,
                    "replies": [
                        {
                            "body": "Shit bro, that's tough. Dude was born weak asf and his mom died during birth, causing his father to resent him and abuse him, then got a bijuu stuck in him who didn't only reside in him, but literally torment him to the point of sleepless nights, while also having the entire village ostracise him. The only person he ever trusted then turns out to be an opp and commits sepuku right in front of him.\n\nAn assassination attempt in an 8 year old's life? Damn.",
                            "author": "FullMoon_Escapade",
                            "id": "h912zj2",
                            "parent_id": "t1_h912owp",
                            "score": 10,
                            "created_utc": 1629034990.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "When ur opinion is a dumb one you can’t expect to not be called dumb",
            "author": "Fetial",
            "id": "h91e97y",
            "parent_id": "t1_h91e72o",
            "score": -6,
            "created_utc": 1629040289.0,
            "replies": [
                {
                    "body": "You should present your arguments as to why Nagato had it worse than Gaara instead of calling me dumb again and again .",
                    "author": "Tarkik_Vatsa",
                    "id": "h91efgx",
                    "parent_id": "t1_h91e97y",
                    "score": 2,
                    "created_utc": 1629040367.0,
                    "replies": [
                        {
                            "body": "There isn’t any point nothing I say will change ur mind nor will anything u say change my mind",
                            "author": "Fetial",
                            "id": "h91ei22",
                            "parent_id": "t1_h91efgx",
                            "score": -6,
                            "created_utc": 1629040399.0,
                            "replies": [
                                {
                                    "body": ">There isn’t any point nothing I say will change ur mind\n\nHow can you assume so ?",
                                    "author": "Tarkik_Vatsa",
                                    "id": "h91enw3",
                                    "parent_id": "t1_h91ei22",
                                    "score": 2,
                                    "created_utc": 1629040471.0,
                                    "replies": [
                                        {
                                            "body": "Because if ur that weak minded that people online change ur beliefs it’s pretty sad",
                                            "author": "Fetial",
                                            "id": "h91esqd",
                                            "parent_id": "t1_h91enw3",
                                            "score": 0,
                                            "created_utc": 1629040530.0,
                                            "replies": [
                                                {
                                                    "body": "Lol you are making it sound like you will change my religion if I hear your opinion . You have got a serious problem buddy . I wish you better mental health .",
                                                    "author": "Tarkik_Vatsa",
                                                    "id": "h91i3rb",
                                                    "parent_id": "t1_h91esqd",
                                                    "score": 3,
                                                    "created_utc": 1629041955.0,
                                                    "replies": [
                                                        {
                                                            "body": "This guy a weirdo fr",
                                                            "author": "FullMoon_Escapade",
                                                            "id": "h91nnfc",
                                                            "parent_id": "t1_h91i3rb",
                                                            "score": 4,
                                                            "created_utc": 1629044270.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Yeah . I was trying to have a genuine conversation with him but I think its better to ignore him .",
                                                                    "author": "Tarkik_Vatsa",
                                                                    "id": "h91xxpr",
                                                                    "parent_id": "t1_h91nnfc",
                                                                    "score": 3,
                                                                    "created_utc": 1629048517.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Oh I havent watched One Piece yet so I dont know anything about him .",
            "author": "Tarkik_Vatsa",
            "id": "h912nry",
            "parent_id": "t1_h910wwd",
            "score": 6,
            "created_utc": 1629034821.0,
            "replies": []
        },
        {
            "body": "Well judge was angry because he tried to genetically engineer his children to not have emotions like that. All the children save ichiji have shown concern for each other so I’m sure they weren’t happy their mom died but they just can’t cry",
            "author": "Raiden2324",
            "id": "h91k2fj",
            "parent_id": "t1_h91eqez",
            "score": 1,
            "created_utc": 1629042775.0,
            "replies": [
                {
                    "body": "They beat up Sanji for crying. They can't feel any vulnerability and thus can't bond. Even when they save each other it's because of their status not out of love. When they save Judge from Big Mom, it's not because he's their dad but because he's the captain of Germa.",
                    "author": "sonfoa",
                    "id": "h91pccv",
                    "parent_id": "t1_h91k2fj",
                    "score": 3,
                    "created_utc": 1629044979.0,
                    "replies": [
                        {
                            "body": "Yeah his siblings are bad but think about it, they just followed whatever judge was saying + they already bullied him. It’s not like yonji was ever bullied ever though he’s weaker than everyone else. It’s because judge said sanji is a failure. You could see that yonji and Niji cared for reiju and judge when they got in trouble at the tea party. Only ichiji has a complete inability for compassion.",
                            "author": "Raiden2324",
                            "id": "h91qhun",
                            "parent_id": "t1_h91pccv",
                            "score": 0,
                            "created_utc": 1629045468.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Correct me if I'm wrong, but Garra had shukaku sealed in him when he was in the womb.",
            "author": "barry3672",
            "id": "h91vgy2",
            "parent_id": "t1_h911968",
            "score": 9,
            "created_utc": 1629047521.0,
            "replies": [
                {
                    "body": "yeah Chiyo did the sealing, the old monk was the last jinchuriki before Gaara",
                    "author": "amir_a1001",
                    "id": "h91xmym",
                    "parent_id": "t1_h91vgy2",
                    "score": 4,
                    "created_utc": 1629048397.0,
                    "replies": []
                },
                {
                    "body": "Well shit, that alone explains it. Wish I knew that before I wasted my time typing all that shit >.<\n\nStill at least I clarified why Rasa had the same eyes (while using his abilities).",
                    "author": "PassdatAss91",
                    "id": "h92bdt0",
                    "parent_id": "t1_h91vgy2",
                    "score": 2,
                    "created_utc": 1629054266.0,
                    "replies": []
                }
            ]
        },
        {
            "body": ">Gaara's \n\nit is stated though that gaara became shukakus jinchuriki even BEFORE he was born (how thats possible i dont know) so yeah, its probably because gaara hasnt slept since his birth or something like that",
            "author": "Vahn1857",
            "id": "h90zwko",
            "parent_id": "t1_h90xxe0",
            "score": 5,
            "created_utc": 1629033307.0,
            "replies": []
        },
        {
            "body": "Exactly .",
            "author": "Tarkik_Vatsa",
            "id": "h912owp",
            "parent_id": "t1_h912l4j",
            "score": 2,
            "created_utc": 1629034837.0,
            "replies": [
                {
                    "body": "Shit bro, that's tough. Dude was born weak asf and his mom died during birth, causing his father to resent him and abuse him, then got a bijuu stuck in him who didn't only reside in him, but literally torment him to the point of sleepless nights, while also having the entire village ostracise him. The only person he ever trusted then turns out to be an opp and commits sepuku right in front of him.\n\nAn assassination attempt in an 8 year old's life? Damn.",
                    "author": "FullMoon_Escapade",
                    "id": "h912zj2",
                    "parent_id": "t1_h912owp",
                    "score": 10,
                    "created_utc": 1629034990.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "You should present your arguments as to why Nagato had it worse than Gaara instead of calling me dumb again and again .",
            "author": "Tarkik_Vatsa",
            "id": "h91efgx",
            "parent_id": "t1_h91e97y",
            "score": 2,
            "created_utc": 1629040367.0,
            "replies": [
                {
                    "body": "There isn’t any point nothing I say will change ur mind nor will anything u say change my mind",
                    "author": "Fetial",
                    "id": "h91ei22",
                    "parent_id": "t1_h91efgx",
                    "score": -6,
                    "created_utc": 1629040399.0,
                    "replies": [
                        {
                            "body": ">There isn’t any point nothing I say will change ur mind\n\nHow can you assume so ?",
                            "author": "Tarkik_Vatsa",
                            "id": "h91enw3",
                            "parent_id": "t1_h91ei22",
                            "score": 2,
                            "created_utc": 1629040471.0,
                            "replies": [
                                {
                                    "body": "Because if ur that weak minded that people online change ur beliefs it’s pretty sad",
                                    "author": "Fetial",
                                    "id": "h91esqd",
                                    "parent_id": "t1_h91enw3",
                                    "score": 0,
                                    "created_utc": 1629040530.0,
                                    "replies": [
                                        {
                                            "body": "Lol you are making it sound like you will change my religion if I hear your opinion . You have got a serious problem buddy . I wish you better mental health .",
                                            "author": "Tarkik_Vatsa",
                                            "id": "h91i3rb",
                                            "parent_id": "t1_h91esqd",
                                            "score": 3,
                                            "created_utc": 1629041955.0,
                                            "replies": [
                                                {
                                                    "body": "This guy a weirdo fr",
                                                    "author": "FullMoon_Escapade",
                                                    "id": "h91nnfc",
                                                    "parent_id": "t1_h91i3rb",
                                                    "score": 4,
                                                    "created_utc": 1629044270.0,
                                                    "replies": [
                                                        {
                                                            "body": "Yeah . I was trying to have a genuine conversation with him but I think its better to ignore him .",
                                                            "author": "Tarkik_Vatsa",
                                                            "id": "h91xxpr",
                                                            "parent_id": "t1_h91nnfc",
                                                            "score": 3,
                                                            "created_utc": 1629048517.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "They beat up Sanji for crying. They can't feel any vulnerability and thus can't bond. Even when they save each other it's because of their status not out of love. When they save Judge from Big Mom, it's not because he's their dad but because he's the captain of Germa.",
            "author": "sonfoa",
            "id": "h91pccv",
            "parent_id": "t1_h91k2fj",
            "score": 3,
            "created_utc": 1629044979.0,
            "replies": [
                {
                    "body": "Yeah his siblings are bad but think about it, they just followed whatever judge was saying + they already bullied him. It’s not like yonji was ever bullied ever though he’s weaker than everyone else. It’s because judge said sanji is a failure. You could see that yonji and Niji cared for reiju and judge when they got in trouble at the tea party. Only ichiji has a complete inability for compassion.",
                    "author": "Raiden2324",
                    "id": "h91qhun",
                    "parent_id": "t1_h91pccv",
                    "score": 0,
                    "created_utc": 1629045468.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "yeah Chiyo did the sealing, the old monk was the last jinchuriki before Gaara",
            "author": "amir_a1001",
            "id": "h91xmym",
            "parent_id": "t1_h91vgy2",
            "score": 4,
            "created_utc": 1629048397.0,
            "replies": []
        },
        {
            "body": "Well shit, that alone explains it. Wish I knew that before I wasted my time typing all that shit >.<\n\nStill at least I clarified why Rasa had the same eyes (while using his abilities).",
            "author": "PassdatAss91",
            "id": "h92bdt0",
            "parent_id": "t1_h91vgy2",
            "score": 2,
            "created_utc": 1629054266.0,
            "replies": []
        },
        {
            "body": "Shit bro, that's tough. Dude was born weak asf and his mom died during birth, causing his father to resent him and abuse him, then got a bijuu stuck in him who didn't only reside in him, but literally torment him to the point of sleepless nights, while also having the entire village ostracise him. The only person he ever trusted then turns out to be an opp and commits sepuku right in front of him.\n\nAn assassination attempt in an 8 year old's life? Damn.",
            "author": "FullMoon_Escapade",
            "id": "h912zj2",
            "parent_id": "t1_h912owp",
            "score": 10,
            "created_utc": 1629034990.0,
            "replies": []
        },
        {
            "body": "There isn’t any point nothing I say will change ur mind nor will anything u say change my mind",
            "author": "Fetial",
            "id": "h91ei22",
            "parent_id": "t1_h91efgx",
            "score": -6,
            "created_utc": 1629040399.0,
            "replies": [
                {
                    "body": ">There isn’t any point nothing I say will change ur mind\n\nHow can you assume so ?",
                    "author": "Tarkik_Vatsa",
                    "id": "h91enw3",
                    "parent_id": "t1_h91ei22",
                    "score": 2,
                    "created_utc": 1629040471.0,
                    "replies": [
                        {
                            "body": "Because if ur that weak minded that people online change ur beliefs it’s pretty sad",
                            "author": "Fetial",
                            "id": "h91esqd",
                            "parent_id": "t1_h91enw3",
                            "score": 0,
                            "created_utc": 1629040530.0,
                            "replies": [
                                {
                                    "body": "Lol you are making it sound like you will change my religion if I hear your opinion . You have got a serious problem buddy . I wish you better mental health .",
                                    "author": "Tarkik_Vatsa",
                                    "id": "h91i3rb",
                                    "parent_id": "t1_h91esqd",
                                    "score": 3,
                                    "created_utc": 1629041955.0,
                                    "replies": [
                                        {
                                            "body": "This guy a weirdo fr",
                                            "author": "FullMoon_Escapade",
                                            "id": "h91nnfc",
                                            "parent_id": "t1_h91i3rb",
                                            "score": 4,
                                            "created_utc": 1629044270.0,
                                            "replies": [
                                                {
                                                    "body": "Yeah . I was trying to have a genuine conversation with him but I think its better to ignore him .",
                                                    "author": "Tarkik_Vatsa",
                                                    "id": "h91xxpr",
                                                    "parent_id": "t1_h91nnfc",
                                                    "score": 3,
                                                    "created_utc": 1629048517.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Yeah his siblings are bad but think about it, they just followed whatever judge was saying + they already bullied him. It’s not like yonji was ever bullied ever though he’s weaker than everyone else. It’s because judge said sanji is a failure. You could see that yonji and Niji cared for reiju and judge when they got in trouble at the tea party. Only ichiji has a complete inability for compassion.",
            "author": "Raiden2324",
            "id": "h91qhun",
            "parent_id": "t1_h91pccv",
            "score": 0,
            "created_utc": 1629045468.0,
            "replies": []
        },
        {
            "body": ">There isn’t any point nothing I say will change ur mind\n\nHow can you assume so ?",
            "author": "Tarkik_Vatsa",
            "id": "h91enw3",
            "parent_id": "t1_h91ei22",
            "score": 2,
            "created_utc": 1629040471.0,
            "replies": [
                {
                    "body": "Because if ur that weak minded that people online change ur beliefs it’s pretty sad",
                    "author": "Fetial",
                    "id": "h91esqd",
                    "parent_id": "t1_h91enw3",
                    "score": 0,
                    "created_utc": 1629040530.0,
                    "replies": [
                        {
                            "body": "Lol you are making it sound like you will change my religion if I hear your opinion . You have got a serious problem buddy . I wish you better mental health .",
                            "author": "Tarkik_Vatsa",
                            "id": "h91i3rb",
                            "parent_id": "t1_h91esqd",
                            "score": 3,
                            "created_utc": 1629041955.0,
                            "replies": [
                                {
                                    "body": "This guy a weirdo fr",
                                    "author": "FullMoon_Escapade",
                                    "id": "h91nnfc",
                                    "parent_id": "t1_h91i3rb",
                                    "score": 4,
                                    "created_utc": 1629044270.0,
                                    "replies": [
                                        {
                                            "body": "Yeah . I was trying to have a genuine conversation with him but I think its better to ignore him .",
                                            "author": "Tarkik_Vatsa",
                                            "id": "h91xxpr",
                                            "parent_id": "t1_h91nnfc",
                                            "score": 3,
                                            "created_utc": 1629048517.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Because if ur that weak minded that people online change ur beliefs it’s pretty sad",
            "author": "Fetial",
            "id": "h91esqd",
            "parent_id": "t1_h91enw3",
            "score": 0,
            "created_utc": 1629040530.0,
            "replies": [
                {
                    "body": "Lol you are making it sound like you will change my religion if I hear your opinion . You have got a serious problem buddy . I wish you better mental health .",
                    "author": "Tarkik_Vatsa",
                    "id": "h91i3rb",
                    "parent_id": "t1_h91esqd",
                    "score": 3,
                    "created_utc": 1629041955.0,
                    "replies": [
                        {
                            "body": "This guy a weirdo fr",
                            "author": "FullMoon_Escapade",
                            "id": "h91nnfc",
                            "parent_id": "t1_h91i3rb",
                            "score": 4,
                            "created_utc": 1629044270.0,
                            "replies": [
                                {
                                    "body": "Yeah . I was trying to have a genuine conversation with him but I think its better to ignore him .",
                                    "author": "Tarkik_Vatsa",
                                    "id": "h91xxpr",
                                    "parent_id": "t1_h91nnfc",
                                    "score": 3,
                                    "created_utc": 1629048517.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Lol you are making it sound like you will change my religion if I hear your opinion . You have got a serious problem buddy . I wish you better mental health .",
            "author": "Tarkik_Vatsa",
            "id": "h91i3rb",
            "parent_id": "t1_h91esqd",
            "score": 3,
            "created_utc": 1629041955.0,
            "replies": [
                {
                    "body": "This guy a weirdo fr",
                    "author": "FullMoon_Escapade",
                    "id": "h91nnfc",
                    "parent_id": "t1_h91i3rb",
                    "score": 4,
                    "created_utc": 1629044270.0,
                    "replies": [
                        {
                            "body": "Yeah . I was trying to have a genuine conversation with him but I think its better to ignore him .",
                            "author": "Tarkik_Vatsa",
                            "id": "h91xxpr",
                            "parent_id": "t1_h91nnfc",
                            "score": 3,
                            "created_utc": 1629048517.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "This guy a weirdo fr",
            "author": "FullMoon_Escapade",
            "id": "h91nnfc",
            "parent_id": "t1_h91i3rb",
            "score": 4,
            "created_utc": 1629044270.0,
            "replies": [
                {
                    "body": "Yeah . I was trying to have a genuine conversation with him but I think its better to ignore him .",
                    "author": "Tarkik_Vatsa",
                    "id": "h91xxpr",
                    "parent_id": "t1_h91nnfc",
                    "score": 3,
                    "created_utc": 1629048517.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Yeah . I was trying to have a genuine conversation with him but I think its better to ignore him .",
            "author": "Tarkik_Vatsa",
            "id": "h91xxpr",
            "parent_id": "t1_h91nnfc",
            "score": 3,
            "created_utc": 1629048517.0,
            "replies": []
        }
    ]
}