{
    "title": "My barber used a new product today - I think some of you will like it! (Info in comments)",
    "post_id": "8p5v0k",
    "post_url": "https://www.reddit.com/r/malehairadvice/comments/8p5v0k/my_barber_used_a_new_product_today_i_think_some/",
    "author": "iAtty",
    "body": "",
    "url": "https://i.redd.it/dx4isrh24h211.jpg",
    "score": 502,
    "upvote_ratio": 0.97,
    "created_utc": 1528331290.0,
    "num_comments": 63,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "I’ve had roughly the same haircut for 4 years now. I’ve tested all the major product lines and methods but today I think I find a new holy grail. \n\nGot my usual cut (it changes a bit with the season, top length and side length, the beard is a constant WIP). \n\nSteps: \nBlow dry with concentrator - use a small round brush to curl the hair around the brush while pulling back and away from the part. \n\nOnce dry use dry shampoo. We (my barber in the shop and me at home) use the “beach body” texturizing dry shampoo available at target (forget the brand, super common and in a white and blue bottle). This adds texture and helps give it shape. \n\nMain styling product - slick gorilla styling powder. This stuff is amazing. He sprinkled it in and I was confused at first. He styled it as usual, light finger tips through the hair - the shape is already there from the blow drying and dry shampoo. \n\nQuick spray of hair spray (usually a matte spray that is $30 a bottle at Ulta, today was store brand common crap). \n\nThe photo doesn’t do the matte finish justice - it’s still a bit “wet” from the hair spray. 8.5 hours later, two huge rain storms (used an umbrella but still), 2.5 hours in the gym, and 3 changes of my shirt and I still have a wonderful malleable matte finish to my hair that wouldn’t require much, if any, work to head out somewhere with. \n\nHope this helps some people in search of the perfect hair style! Feel free to ask anything - I’ve been working on my hair for YEARS and it’s always a WIP. \n\nIf you’re in the Central FL area shoot me a PM for info on my barber. He’s cut my hair for over a decade and kills it every time!",
            "author": "iAtty",
            "id": "e08ocdl",
            "parent_id": "t3_8p5v0k",
            "score": 84,
            "created_utc": 1528331673.0,
            "replies": [
                {
                    "body": "What's the feel of the finish? Is it sorta crisp and hard so that it retains its shape or is it loose and constantly being restyled? Just curious as to how it feels with the powder.",
                    "author": "a10kendall",
                    "id": "e090q0b",
                    "parent_id": "t1_e08ocdl",
                    "score": 15,
                    "created_utc": 1528343965.0,
                    "replies": [
                        {
                            "body": "Not crisp or hard at all. More like a dry powder feeling, similar to corn starch maybe? It doesn’t feel weird and is still malleable. After 12 hours and a bunch of BS it still looks clean and natural with a strong re-stylable hold despite not looking like it would have that. ",
                            "author": "iAtty",
                            "id": "e090v5m",
                            "parent_id": "t1_e090q0b",
                            "score": 13,
                            "created_utc": 1528344128.0,
                            "replies": [
                                {
                                    "body": "Wow, I'll have to check that out, thanks. Looks great!",
                                    "author": "a10kendall",
                                    "id": "e090x9t",
                                    "parent_id": "t1_e090v5m",
                                    "score": 7,
                                    "created_utc": 1528344197.0,
                                    "replies": [
                                        {
                                            "body": "Thanks! Definitely worth it. I usually use Dirty by LUSH but I’m tempted to use this full time. It’s a bit expensive so I might use it for special occasions. ",
                                            "author": "iAtty",
                                            "id": "e090yhz",
                                            "parent_id": "t1_e090x9t",
                                            "score": 6,
                                            "created_utc": 1528344238.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "you still using the powder? i bought it was wondering does it damage the hair long term?",
                    "author": "99RedBalloon",
                    "id": "j52o8ou",
                    "parent_id": "t1_e08ocdl",
                    "score": 2,
                    "created_utc": 1674171933.0,
                    "replies": [
                        {
                            "body": "Switched to a sea salt spray, blow dry, and then a new styler from Victory Crown. It’s a spray. Accomplished the same but holds better and washes out better. As for damage, no -  it too much because a problem. I think the powered was worse for my hair overall than the victory spray I use now.",
                            "author": "iAtty",
                            "id": "j52or68",
                            "parent_id": "t1_j52o8ou",
                            "score": 1,
                            "created_utc": 1674172145.0,
                            "replies": [
                                {
                                    "body": ">  As for damage, no - it too much because a problem.\n\nim not sure i follow lol\n\n> I think the powered was worse for my hair overall than the victory spray I use now.\n\nworse how so? and can you link the spray",
                                    "author": "99RedBalloon",
                                    "id": "j52p21u",
                                    "parent_id": "t1_j52or68",
                                    "score": 2,
                                    "created_utc": 1674172269.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Cool, will try to use this technique, seems very fast and easy",
                    "author": "hullmar",
                    "id": "e09azd4",
                    "parent_id": "t1_e08ocdl",
                    "score": 1,
                    "created_utc": 1528360851.0,
                    "replies": []
                },
                {
                    "body": "Anyone know how to make hair clump up like that in bundles? Mine doesn't want to stay together and ends up lacking texture",
                    "author": "STIPULATE",
                    "id": "e09n8a3",
                    "parent_id": "t1_e08ocdl",
                    "score": 1,
                    "created_utc": 1528379827.0,
                    "replies": [
                        {
                            "body": "Blow dry it in the shape you want it and then dry shampoo to give it texture. Make sure you use a product with a good hold. Add some hair spray if you live somewhere with a lot of humidity. ",
                            "author": "iAtty",
                            "id": "e09ou07",
                            "parent_id": "t1_e09n8a3",
                            "score": 1,
                            "created_utc": 1528381375.0,
                            "replies": [
                                {
                                    "body": "Never tried dry shampoo. What's it like vs just a normal one?",
                                    "author": "STIPULATE",
                                    "id": "e09p3vm",
                                    "parent_id": "t1_e09ou07",
                                    "score": 1,
                                    "created_utc": 1528381631.0,
                                    "replies": [
                                        {
                                            "body": "Dry shampoo is a spray that absorbs oil. There are texturizing dry shampoos that you can get. I wash my hair regularly (sometimes with shampoo and sometime just water rinse and conditioner) and then when I'm done blow drying my hair I spray in the dry shampoo for texture. ",
                                            "author": "iAtty",
                                            "id": "e09pr2m",
                                            "parent_id": "t1_e09p3vm",
                                            "score": 1,
                                            "created_utc": 1528382236.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "I don't have dry shampoo and have never used a blow dryer.  I am looking for something that will hold my hair but provide a natural finish.  Do you think the Gorilla powder will work for me if I am putting it directly into my towel\\-dried hair?",
                    "author": "amnowhere",
                    "id": "e09pmbd",
                    "parent_id": "t1_e08ocdl",
                    "score": 1,
                    "created_utc": 1528382112.0,
                    "replies": [
                        {
                            "body": "Not as well. If your hair style is something like mine where its going back, I don't think you'll have much success without a blow dryer. Drying it into this shape is what gives it a lot of its hold, the product reinforces that. Without shaping it first you may struggle. \n\nI like Dirty by LUSH for a nice natural look but a strong hold, may work better for you if you aren't blow drying. ",
                            "author": "iAtty",
                            "id": "e09px9y",
                            "parent_id": "t1_e09pmbd",
                            "score": 1,
                            "created_utc": 1528382395.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": ">We (my barber in the shop and me at home) use the “beach body” texturizing dry shampoo available at target (forget the brand, super common and in a white and blue bottle)\n\nIs it [this one](https://www.amazon.com/Not-Your-Mothers-Texturizing-Shampoo/dp/B01LZDQN9N)? I was using that one for a while but recently switched to [this one](https://www.amazon.com/Batiste-Shampoo-Original-Fragrance-Count/dp/B01CYDXMSW/) and I'm liking it a lot more personally. ",
                    "author": "4InchesOfury",
                    "id": "e0gevjk",
                    "parent_id": "t1_e08ocdl",
                    "score": 1,
                    "created_utc": 1528671161.0,
                    "replies": [
                        {
                            "body": "Yup! And I’ve also got the other one, I’ve found the beach one to be better for me between the two. Most the time I go for whichever is cheaper tho. ",
                            "author": "iAtty",
                            "id": "e0gf01k",
                            "parent_id": "t1_e0gevjk",
                            "score": 1,
                            "created_utc": 1528671295.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "What do you tell your barber to make the sides like that. Thanks!",
                    "author": "Dymo342",
                    "id": "e0grmtb",
                    "parent_id": "t1_e08ocdl",
                    "score": 1,
                    "created_utc": 1528685669.0,
                    "replies": [
                        {
                            "body": "Fade from a .5 or 1 up to the hair. Depends on what my beard length is. ",
                            "author": "iAtty",
                            "id": "e0gs4dr",
                            "parent_id": "t1_e0grmtb",
                            "score": 1,
                            "created_utc": 1528686140.0,
                            "replies": [
                                {
                                    "body": "Awesome. What about the top part of the sides? ",
                                    "author": "Dymo342",
                                    "id": "e0gsqwq",
                                    "parent_id": "t1_e0gs4dr",
                                    "score": 1,
                                    "created_utc": 1528686763.0,
                                    "replies": [
                                        {
                                            "body": "Uh no clue haha, he just does what he does! If you show your barber this picture he can likely identify and copy it if you’re looking for that. ",
                                            "author": "iAtty",
                                            "id": "e0gss13",
                                            "parent_id": "t1_e0gsqwq",
                                            "score": 1,
                                            "created_utc": 1528686797.0,
                                            "replies": [
                                                {
                                                    "body": "Ah ok. But he does cut them right?",
                                                    "author": "Dymo342",
                                                    "id": "e0gswm6",
                                                    "parent_id": "t1_e0gss13",
                                                    "score": 1,
                                                    "created_utc": 1528686927.0,
                                                    "replies": [
                                                        {
                                                            "body": "I think he uses scissors on that area? He usually pins my hair back over in sort of the style I have it in the picture and uses the clippers. Then anything that isn’t short like the side he goes and hits with the scissors. \n\nHe may pin the hair away from that area and hit the underneath bit with clippers but I don’t know. We are usually BSing about whatever and I don’t always see haha. ",
                                                            "author": "iAtty",
                                                            "id": "e0gt3fd",
                                                            "parent_id": "t1_e0gswm6",
                                                            "score": 1,
                                                            "created_utc": 1528687128.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Ah ok so he does scissor over comb. I need to find a new barber. I usually got a latin barber and I have no idea how to say that in Spanish lol",
                                                                    "author": "Dymo342",
                                                                    "id": "e0gtain",
                                                                    "parent_id": "t1_e0gt3fd",
                                                                    "score": 1,
                                                                    "created_utc": 1528687340.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "Hahha. Yeah man, communication is key for a good haircut. I’m sure those guys do good work but you’ve got to be able to talk them through what you want as they are going. ",
                                                                            "author": "iAtty",
                                                                            "id": "e0gupwq",
                                                                            "parent_id": "t1_e0gtain",
                                                                            "score": 1,
                                                                            "created_utc": 1528688921.0,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Your hair looks flawless!!  Love the cut!",
            "author": "Longislandtea12",
            "id": "e08s2k5",
            "parent_id": "t3_8p5v0k",
            "score": 27,
            "created_utc": 1528335470.0,
            "replies": [
                {
                    "body": "Thank you! Always looks best when my barber styles it haha. Hopefully I can continue to recreate his magic!",
                    "author": "iAtty",
                    "id": "e08yupk",
                    "parent_id": "t1_e08s2k5",
                    "score": 4,
                    "created_utc": 1528342106.0,
                    "replies": [
                        {
                            "body": "Do you have a pic of the other side you wouldn't mind sharing.  I am interested in how you have it faded up to your part.",
                            "author": "Longislandtea12",
                            "id": "e09dewg",
                            "parent_id": "t1_e08yupk",
                            "score": 2,
                            "created_utc": 1528366376.0,
                            "replies": [
                                {
                                    "body": "[Here is an album!](https://imgur.com/a/N3YDXG9)\n\nTaking pictures of all the angles of my head was more difficult than I imagined. I could have mounted my GoPro to my mirror and done it better but I was running out of time. This was a really rough style with just a quick rinse under the shower head \\- I can take some more pictures another time and share them but I think this came out rather well for a quick and easy style.\n\nI also included a few photos from post haircuts and one with my hair after a day out in the sun / wind showing how it looks as it settles throughout the day. Figure I'd share any good ones to give people ideas when going to their barber!\n\nIf you have any questions feel free to ask! Hope this helps!\n\nEdit: Top length is between 5 and 5.5 inches in the areas I measured. ",
                                    "author": "iAtty",
                                    "id": "e09wxh8",
                                    "parent_id": "t1_e09dewg",
                                    "score": 8,
                                    "created_utc": 1528388460.0,
                                    "replies": []
                                },
                                {
                                    "body": "Yup! I’ll take some pics today and post them. ",
                                    "author": "iAtty",
                                    "id": "e09ow45",
                                    "parent_id": "t1_e09dewg",
                                    "score": 2,
                                    "created_utc": 1528381430.0,
                                    "replies": [
                                        {
                                            "body": "Thank you!",
                                            "author": "Longislandtea12",
                                            "id": "e09rq8a",
                                            "parent_id": "t1_e09ow45",
                                            "score": 1,
                                            "created_utc": 1528383995.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I'm currently trying to grow my hair out to look like this but was having trouble finding a picture i liked to show my stylist, can you share a pic of yourself from the front and the other sude so I can see how it's cut? I really like this ",
            "author": "effingfractals",
            "id": "e08v75p",
            "parent_id": "t3_8p5v0k",
            "score": 12,
            "created_utc": 1528338480.0,
            "replies": [
                {
                    "body": "For sure! It’ll have to be tomorrow tho, it’s not in a great place at this time of night haha. I’ll try and measure the top too to give you an idea of what length you need. ",
                    "author": "iAtty",
                    "id": "e08vl4m",
                    "parent_id": "t1_e08v75p",
                    "score": 8,
                    "created_utc": 1528338859.0,
                    "replies": [
                        {
                            "body": "Looks amazing man. I'm struggling to find my style. Do you think you can hook me up with the pic and measurements as well? It'd mean a lot!",
                            "author": null,
                            "id": "e08ye73",
                            "parent_id": "t1_e08vl4m",
                            "score": 3,
                            "created_utc": 1528341695.0,
                            "replies": [
                                {
                                    "body": "For sure! I’ll try and just reply to these posts for it.",
                                    "author": "iAtty",
                                    "id": "e08yfuk",
                                    "parent_id": "t1_e08ye73",
                                    "score": 1,
                                    "created_utc": 1528341741.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "Thanks!!",
                            "author": "effingfractals",
                            "id": "e08vnsp",
                            "parent_id": "t1_e08vl4m",
                            "score": 1,
                            "created_utc": 1528338931.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "[Here is an album!](https://imgur.com/a/N3YDXG9)\n\nTaking pictures of all the angles of my head was more difficult than I imagined. I could have mounted my GoPro to my mirror and done it better but I was running out of time. This was a really rough style with just a quick rinse under the shower head \\- I can take some more pictures another time and share them but I think this came out rather well for a quick and easy style.\n\nI also included a few photos from post haircuts and one with my hair after a day out in the sun / wind showing how it looks as it settles throughout the day. Figure I'd share any good ones to give people ideas when going to their barber!\n\nIf you have any questions feel free to ask! Hope this helps!\n\nEdit: Top length is between 5 and 5.5 inches in the areas I measured",
                    "author": "iAtty",
                    "id": "e09wyao",
                    "parent_id": "t1_e08v75p",
                    "score": 5,
                    "created_utc": 1528388479.0,
                    "replies": [
                        {
                            "body": "Thanks for going through all the extra effort! I really appreciate it, I'll save this for when I go get mine cut again. I probably have about three inches on top now so I'm getting there ",
                            "author": "effingfractals",
                            "id": "e0sowm7",
                            "parent_id": "t1_e09wyao",
                            "score": 1,
                            "created_utc": 1529194843.0,
                            "replies": [
                                {
                                    "body": "Absolutely! Happy to. Keep it going, The in between stages from short to longer styles are always tough to make it through but so worth it in the end. Let me know if you have any questions along the way!-",
                                    "author": "iAtty",
                                    "id": "e0t1sxu",
                                    "parent_id": "t1_e0sowm7",
                                    "score": 1,
                                    "created_utc": 1529212009.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Can you link to the products used?",
            "author": "helloitsmeu",
            "id": "e08stxi",
            "parent_id": "t3_8p5v0k",
            "score": 9,
            "created_utc": 1528336206.0,
            "replies": [
                {
                    "body": "Slick Gorilla Hair Styling Texturizing Powder 0.70 Ounce (20g) https://www.amazon.com/dp/B06XZNJWZL/ref=cm_sw_r_cp_api_i_ZejgBbZ63427J\n\nHere you go!",
                    "author": "iAtty",
                    "id": "e08td1s",
                    "parent_id": "t1_e08stxi",
                    "score": 10,
                    "created_utc": 1528336725.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Can you post other angles? I have the same color/texture hair and beard as you.",
            "author": "Breakr007",
            "id": "e0921pw",
            "parent_id": "t3_8p5v0k",
            "score": 5,
            "created_utc": 1528345547.0,
            "replies": [
                {
                    "body": "[Here is an album!](https://imgur.com/a/N3YDXG9)\n\nTaking pictures of all the angles of my head was more difficult than I imagined. I could have mounted my GoPro to my mirror and done it better but I was running out of time. This was a really rough style with just a quick rinse under the shower head \\- I can take some more pictures another time and share them but I think this came out rather well for a quick and easy style.\n\nI also included a few photos from post haircuts and one with my hair after a day out in the sun / wind showing how it looks as it settles throughout the day. Figure I'd share any good ones to give people ideas when going to their barber!\n\nIf you have any questions feel free to ask! Hope this helps!",
                    "author": "iAtty",
                    "id": "e09wynx",
                    "parent_id": "t1_e0921pw",
                    "score": 3,
                    "created_utc": 1528388486.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "e09z59g",
                            "parent_id": "t1_e09wynx",
                            "score": 1,
                            "created_utc": 1528390305.0,
                            "replies": [
                                {
                                    "body": "Crap! Forgot to post it - top length was around 5 to 5.5 inches in the areas I could measure. ",
                                    "author": "iAtty",
                                    "id": "e09z86b",
                                    "parent_id": "t1_e09z59g",
                                    "score": 2,
                                    "created_utc": 1528390373.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Yup! I’ll post them up tomorrow. ",
                    "author": "iAtty",
                    "id": "e092mu9",
                    "parent_id": "t1_e0921pw",
                    "score": 2,
                    "created_utc": 1528346309.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Slick Gorilla is the real deal. I use it at my shop. ",
            "author": "taintitsweet",
            "id": "e092pmo",
            "parent_id": "t3_8p5v0k",
            "score": 3,
            "created_utc": 1528346411.0,
            "replies": []
        },
        {
            "body": "I'll need to try this out.  Thanks op",
            "author": "cmiller999",
            "id": "e091uzt",
            "parent_id": "t3_8p5v0k",
            "score": 2,
            "created_utc": 1528345314.0,
            "replies": []
        },
        {
            "body": "Powder is crazy, I used to use one while I still had hair and the hold you get is awesome.",
            "author": "t-visADL",
            "id": "e09cd7g",
            "parent_id": "t3_8p5v0k",
            "score": 1,
            "created_utc": 1528364023.0,
            "replies": []
        },
        {
            "body": "Great post! Happy cakeday :)",
            "author": "ButtNakedNasty",
            "id": "e09fvg4",
            "parent_id": "t3_8p5v0k",
            "score": 1,
            "created_utc": 1528370914.0,
            "replies": [
                {
                    "body": "Thank you! :D",
                    "author": "iAtty",
                    "id": "e09ovhz",
                    "parent_id": "t1_e09fvg4",
                    "score": 2,
                    "created_utc": 1528381413.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "For your fade, what's the fade range? Looks like a high 3 tapered to a 1. Is that correct? Looks awesome. ",
            "author": "K1NGKHAN",
            "id": "e09q5dy",
            "parent_id": "t3_8p5v0k",
            "score": 1,
            "created_utc": 1528382594.0,
            "replies": [
                {
                    "body": "Think he used a 1.5 as the shortest length. My side length is always changing depending on where the beard is and how ouch length I keep on top. I’ll rock this hair out for 4-5 weeks before cutting it again so the styling changes as it grows a bit. ",
                    "author": "iAtty",
                    "id": "e09r6jw",
                    "parent_id": "t1_e09q5dy",
                    "score": 1,
                    "created_utc": 1528383511.0,
                    "replies": [
                        {
                            "body": "When getting a fade is that how often you will wait before going back for a cut ? I have a very similar cut but I also have very straight thick hair and it sticks out when it's short and starting to grow. Not sure how straight yours is and if you encounter that problem ",
                            "author": "tehlolredditor",
                            "id": "e0a8h94",
                            "parent_id": "t1_e09r6jw",
                            "score": 1,
                            "created_utc": 1528398125.0,
                            "replies": [
                                {
                                    "body": "Mine sticks straight out. It’s awful. I have to work hard to get it to lay flat. \n\nI wait a few weeks because of availability to see my barber and because as it grows I adjust my style on the sides. I use a beard brush to brush down the hair, hit it with the blow dryer to help keep it down, and apply product on top of that. I’m fortunate my hair grows evenly on the sides and doesn’t look out of shape until the 5-6 week mark.\n\nMy hair without product is light as air, sticks straight out, and is as straight as it can be. It’s unmanageable lol. ",
                                    "author": "iAtty",
                                    "id": "e0a8njh",
                                    "parent_id": "t1_e0a8h94",
                                    "score": 1,
                                    "created_utc": 1528398278.0,
                                    "replies": [
                                        {
                                            "body": "Hmm beard brush? I'll check that out. Sides are always hard to manage . It feels like if I don't get it short enough it's gonna look ugly unless I can sit it down ( but without applying a ton of product making it look gross). Thanks!",
                                            "author": "tehlolredditor",
                                            "id": "e0abc65",
                                            "parent_id": "t1_e0a8njh",
                                            "score": 1,
                                            "created_utc": 1528400563.0,
                                            "replies": [
                                                {
                                                    "body": "I had the same struggle. Beard brush and blow dryer made it much easier! Good luck!",
                                                    "author": "iAtty",
                                                    "id": "e0abe5n",
                                                    "parent_id": "t1_e0abc65",
                                                    "score": 1,
                                                    "created_utc": 1528400611.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Thanks.  Your barber really did an awesome job.  I really appreciate your time and effort! ",
            "author": "Longislandtea12",
            "id": "e0a279q",
            "parent_id": "t3_8p5v0k",
            "score": 1,
            "created_utc": 1528392865.0,
            "replies": []
        },
        {
            "body": "Volumising powder or styling powder is my go to for so many styles. We regularly stock the Kevin Murphy variant, which is incredible. \n\nNot sure if you can get 'Got 2 B' products in the states, but it is about 1/4 of the price of slick gorilla, and better. Slick gorilla is good, but it is way overpriced and it gets tacky. \n\nHair looks good, too 👌🏻",
            "author": "Dyslexic-Dwarf",
            "id": "e0abvc8",
            "parent_id": "t3_8p5v0k",
            "score": 1,
            "created_utc": 1528401022.0,
            "replies": [
                {
                    "body": "Thanks! Great tip - the Got 2 B is available on Amazon. I'll see if I can pick it up locally and give it a shot. ",
                    "author": "iAtty",
                    "id": "e0acwof",
                    "parent_id": "t1_e0abvc8",
                    "score": 2,
                    "created_utc": 1528401909.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "This is offficialt the pic I'm gonna use at the barber now. How long is the top? ",
            "author": "bryanisbored",
            "id": "e0x31b2",
            "parent_id": "t3_8p5v0k",
            "score": 1,
            "created_utc": 1529397525.0,
            "replies": [
                {
                    "body": "I was at 5 to 5.5 inches when I measured it in a few different places. ",
                    "author": "iAtty",
                    "id": "e0xcg55",
                    "parent_id": "t1_e0x31b2",
                    "score": 1,
                    "created_utc": 1529413482.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Same haircut as 99% sub ",
            "author": "TrillBarton",
            "id": "e09lysm",
            "parent_id": "t3_8p5v0k",
            "score": -3,
            "created_utc": 1528378565.0,
            "replies": []
        },
        {
            "body": "What's the feel of the finish? Is it sorta crisp and hard so that it retains its shape or is it loose and constantly being restyled? Just curious as to how it feels with the powder.",
            "author": "a10kendall",
            "id": "e090q0b",
            "parent_id": "t1_e08ocdl",
            "score": 15,
            "created_utc": 1528343965.0,
            "replies": [
                {
                    "body": "Not crisp or hard at all. More like a dry powder feeling, similar to corn starch maybe? It doesn’t feel weird and is still malleable. After 12 hours and a bunch of BS it still looks clean and natural with a strong re-stylable hold despite not looking like it would have that. ",
                    "author": "iAtty",
                    "id": "e090v5m",
                    "parent_id": "t1_e090q0b",
                    "score": 13,
                    "created_utc": 1528344128.0,
                    "replies": [
                        {
                            "body": "Wow, I'll have to check that out, thanks. Looks great!",
                            "author": "a10kendall",
                            "id": "e090x9t",
                            "parent_id": "t1_e090v5m",
                            "score": 7,
                            "created_utc": 1528344197.0,
                            "replies": [
                                {
                                    "body": "Thanks! Definitely worth it. I usually use Dirty by LUSH but I’m tempted to use this full time. It’s a bit expensive so I might use it for special occasions. ",
                                    "author": "iAtty",
                                    "id": "e090yhz",
                                    "parent_id": "t1_e090x9t",
                                    "score": 6,
                                    "created_utc": 1528344238.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "you still using the powder? i bought it was wondering does it damage the hair long term?",
            "author": "99RedBalloon",
            "id": "j52o8ou",
            "parent_id": "t1_e08ocdl",
            "score": 2,
            "created_utc": 1674171933.0,
            "replies": [
                {
                    "body": "Switched to a sea salt spray, blow dry, and then a new styler from Victory Crown. It’s a spray. Accomplished the same but holds better and washes out better. As for damage, no -  it too much because a problem. I think the powered was worse for my hair overall than the victory spray I use now.",
                    "author": "iAtty",
                    "id": "j52or68",
                    "parent_id": "t1_j52o8ou",
                    "score": 1,
                    "created_utc": 1674172145.0,
                    "replies": [
                        {
                            "body": ">  As for damage, no - it too much because a problem.\n\nim not sure i follow lol\n\n> I think the powered was worse for my hair overall than the victory spray I use now.\n\nworse how so? and can you link the spray",
                            "author": "99RedBalloon",
                            "id": "j52p21u",
                            "parent_id": "t1_j52or68",
                            "score": 2,
                            "created_utc": 1674172269.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Cool, will try to use this technique, seems very fast and easy",
            "author": "hullmar",
            "id": "e09azd4",
            "parent_id": "t1_e08ocdl",
            "score": 1,
            "created_utc": 1528360851.0,
            "replies": []
        },
        {
            "body": "Anyone know how to make hair clump up like that in bundles? Mine doesn't want to stay together and ends up lacking texture",
            "author": "STIPULATE",
            "id": "e09n8a3",
            "parent_id": "t1_e08ocdl",
            "score": 1,
            "created_utc": 1528379827.0,
            "replies": [
                {
                    "body": "Blow dry it in the shape you want it and then dry shampoo to give it texture. Make sure you use a product with a good hold. Add some hair spray if you live somewhere with a lot of humidity. ",
                    "author": "iAtty",
                    "id": "e09ou07",
                    "parent_id": "t1_e09n8a3",
                    "score": 1,
                    "created_utc": 1528381375.0,
                    "replies": [
                        {
                            "body": "Never tried dry shampoo. What's it like vs just a normal one?",
                            "author": "STIPULATE",
                            "id": "e09p3vm",
                            "parent_id": "t1_e09ou07",
                            "score": 1,
                            "created_utc": 1528381631.0,
                            "replies": [
                                {
                                    "body": "Dry shampoo is a spray that absorbs oil. There are texturizing dry shampoos that you can get. I wash my hair regularly (sometimes with shampoo and sometime just water rinse and conditioner) and then when I'm done blow drying my hair I spray in the dry shampoo for texture. ",
                                    "author": "iAtty",
                                    "id": "e09pr2m",
                                    "parent_id": "t1_e09p3vm",
                                    "score": 1,
                                    "created_utc": 1528382236.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I don't have dry shampoo and have never used a blow dryer.  I am looking for something that will hold my hair but provide a natural finish.  Do you think the Gorilla powder will work for me if I am putting it directly into my towel\\-dried hair?",
            "author": "amnowhere",
            "id": "e09pmbd",
            "parent_id": "t1_e08ocdl",
            "score": 1,
            "created_utc": 1528382112.0,
            "replies": [
                {
                    "body": "Not as well. If your hair style is something like mine where its going back, I don't think you'll have much success without a blow dryer. Drying it into this shape is what gives it a lot of its hold, the product reinforces that. Without shaping it first you may struggle. \n\nI like Dirty by LUSH for a nice natural look but a strong hold, may work better for you if you aren't blow drying. ",
                    "author": "iAtty",
                    "id": "e09px9y",
                    "parent_id": "t1_e09pmbd",
                    "score": 1,
                    "created_utc": 1528382395.0,
                    "replies": []
                }
            ]
        },
        {
            "body": ">We (my barber in the shop and me at home) use the “beach body” texturizing dry shampoo available at target (forget the brand, super common and in a white and blue bottle)\n\nIs it [this one](https://www.amazon.com/Not-Your-Mothers-Texturizing-Shampoo/dp/B01LZDQN9N)? I was using that one for a while but recently switched to [this one](https://www.amazon.com/Batiste-Shampoo-Original-Fragrance-Count/dp/B01CYDXMSW/) and I'm liking it a lot more personally. ",
            "author": "4InchesOfury",
            "id": "e0gevjk",
            "parent_id": "t1_e08ocdl",
            "score": 1,
            "created_utc": 1528671161.0,
            "replies": [
                {
                    "body": "Yup! And I’ve also got the other one, I’ve found the beach one to be better for me between the two. Most the time I go for whichever is cheaper tho. ",
                    "author": "iAtty",
                    "id": "e0gf01k",
                    "parent_id": "t1_e0gevjk",
                    "score": 1,
                    "created_utc": 1528671295.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "What do you tell your barber to make the sides like that. Thanks!",
            "author": "Dymo342",
            "id": "e0grmtb",
            "parent_id": "t1_e08ocdl",
            "score": 1,
            "created_utc": 1528685669.0,
            "replies": [
                {
                    "body": "Fade from a .5 or 1 up to the hair. Depends on what my beard length is. ",
                    "author": "iAtty",
                    "id": "e0gs4dr",
                    "parent_id": "t1_e0grmtb",
                    "score": 1,
                    "created_utc": 1528686140.0,
                    "replies": [
                        {
                            "body": "Awesome. What about the top part of the sides? ",
                            "author": "Dymo342",
                            "id": "e0gsqwq",
                            "parent_id": "t1_e0gs4dr",
                            "score": 1,
                            "created_utc": 1528686763.0,
                            "replies": [
                                {
                                    "body": "Uh no clue haha, he just does what he does! If you show your barber this picture he can likely identify and copy it if you’re looking for that. ",
                                    "author": "iAtty",
                                    "id": "e0gss13",
                                    "parent_id": "t1_e0gsqwq",
                                    "score": 1,
                                    "created_utc": 1528686797.0,
                                    "replies": [
                                        {
                                            "body": "Ah ok. But he does cut them right?",
                                            "author": "Dymo342",
                                            "id": "e0gswm6",
                                            "parent_id": "t1_e0gss13",
                                            "score": 1,
                                            "created_utc": 1528686927.0,
                                            "replies": [
                                                {
                                                    "body": "I think he uses scissors on that area? He usually pins my hair back over in sort of the style I have it in the picture and uses the clippers. Then anything that isn’t short like the side he goes and hits with the scissors. \n\nHe may pin the hair away from that area and hit the underneath bit with clippers but I don’t know. We are usually BSing about whatever and I don’t always see haha. ",
                                                    "author": "iAtty",
                                                    "id": "e0gt3fd",
                                                    "parent_id": "t1_e0gswm6",
                                                    "score": 1,
                                                    "created_utc": 1528687128.0,
                                                    "replies": [
                                                        {
                                                            "body": "Ah ok so he does scissor over comb. I need to find a new barber. I usually got a latin barber and I have no idea how to say that in Spanish lol",
                                                            "author": "Dymo342",
                                                            "id": "e0gtain",
                                                            "parent_id": "t1_e0gt3fd",
                                                            "score": 1,
                                                            "created_utc": 1528687340.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Hahha. Yeah man, communication is key for a good haircut. I’m sure those guys do good work but you’ve got to be able to talk them through what you want as they are going. ",
                                                                    "author": "iAtty",
                                                                    "id": "e0gupwq",
                                                                    "parent_id": "t1_e0gtain",
                                                                    "score": 1,
                                                                    "created_utc": 1528688921.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Thank you! Always looks best when my barber styles it haha. Hopefully I can continue to recreate his magic!",
            "author": "iAtty",
            "id": "e08yupk",
            "parent_id": "t1_e08s2k5",
            "score": 4,
            "created_utc": 1528342106.0,
            "replies": [
                {
                    "body": "Do you have a pic of the other side you wouldn't mind sharing.  I am interested in how you have it faded up to your part.",
                    "author": "Longislandtea12",
                    "id": "e09dewg",
                    "parent_id": "t1_e08yupk",
                    "score": 2,
                    "created_utc": 1528366376.0,
                    "replies": [
                        {
                            "body": "[Here is an album!](https://imgur.com/a/N3YDXG9)\n\nTaking pictures of all the angles of my head was more difficult than I imagined. I could have mounted my GoPro to my mirror and done it better but I was running out of time. This was a really rough style with just a quick rinse under the shower head \\- I can take some more pictures another time and share them but I think this came out rather well for a quick and easy style.\n\nI also included a few photos from post haircuts and one with my hair after a day out in the sun / wind showing how it looks as it settles throughout the day. Figure I'd share any good ones to give people ideas when going to their barber!\n\nIf you have any questions feel free to ask! Hope this helps!\n\nEdit: Top length is between 5 and 5.5 inches in the areas I measured. ",
                            "author": "iAtty",
                            "id": "e09wxh8",
                            "parent_id": "t1_e09dewg",
                            "score": 8,
                            "created_utc": 1528388460.0,
                            "replies": []
                        },
                        {
                            "body": "Yup! I’ll take some pics today and post them. ",
                            "author": "iAtty",
                            "id": "e09ow45",
                            "parent_id": "t1_e09dewg",
                            "score": 2,
                            "created_utc": 1528381430.0,
                            "replies": [
                                {
                                    "body": "Thank you!",
                                    "author": "Longislandtea12",
                                    "id": "e09rq8a",
                                    "parent_id": "t1_e09ow45",
                                    "score": 1,
                                    "created_utc": 1528383995.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "For sure! It’ll have to be tomorrow tho, it’s not in a great place at this time of night haha. I’ll try and measure the top too to give you an idea of what length you need. ",
            "author": "iAtty",
            "id": "e08vl4m",
            "parent_id": "t1_e08v75p",
            "score": 8,
            "created_utc": 1528338859.0,
            "replies": [
                {
                    "body": "Looks amazing man. I'm struggling to find my style. Do you think you can hook me up with the pic and measurements as well? It'd mean a lot!",
                    "author": null,
                    "id": "e08ye73",
                    "parent_id": "t1_e08vl4m",
                    "score": 3,
                    "created_utc": 1528341695.0,
                    "replies": [
                        {
                            "body": "For sure! I’ll try and just reply to these posts for it.",
                            "author": "iAtty",
                            "id": "e08yfuk",
                            "parent_id": "t1_e08ye73",
                            "score": 1,
                            "created_utc": 1528341741.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Thanks!!",
                    "author": "effingfractals",
                    "id": "e08vnsp",
                    "parent_id": "t1_e08vl4m",
                    "score": 1,
                    "created_utc": 1528338931.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[Here is an album!](https://imgur.com/a/N3YDXG9)\n\nTaking pictures of all the angles of my head was more difficult than I imagined. I could have mounted my GoPro to my mirror and done it better but I was running out of time. This was a really rough style with just a quick rinse under the shower head \\- I can take some more pictures another time and share them but I think this came out rather well for a quick and easy style.\n\nI also included a few photos from post haircuts and one with my hair after a day out in the sun / wind showing how it looks as it settles throughout the day. Figure I'd share any good ones to give people ideas when going to their barber!\n\nIf you have any questions feel free to ask! Hope this helps!\n\nEdit: Top length is between 5 and 5.5 inches in the areas I measured",
            "author": "iAtty",
            "id": "e09wyao",
            "parent_id": "t1_e08v75p",
            "score": 5,
            "created_utc": 1528388479.0,
            "replies": [
                {
                    "body": "Thanks for going through all the extra effort! I really appreciate it, I'll save this for when I go get mine cut again. I probably have about three inches on top now so I'm getting there ",
                    "author": "effingfractals",
                    "id": "e0sowm7",
                    "parent_id": "t1_e09wyao",
                    "score": 1,
                    "created_utc": 1529194843.0,
                    "replies": [
                        {
                            "body": "Absolutely! Happy to. Keep it going, The in between stages from short to longer styles are always tough to make it through but so worth it in the end. Let me know if you have any questions along the way!-",
                            "author": "iAtty",
                            "id": "e0t1sxu",
                            "parent_id": "t1_e0sowm7",
                            "score": 1,
                            "created_utc": 1529212009.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Slick Gorilla Hair Styling Texturizing Powder 0.70 Ounce (20g) https://www.amazon.com/dp/B06XZNJWZL/ref=cm_sw_r_cp_api_i_ZejgBbZ63427J\n\nHere you go!",
            "author": "iAtty",
            "id": "e08td1s",
            "parent_id": "t1_e08stxi",
            "score": 10,
            "created_utc": 1528336725.0,
            "replies": []
        },
        {
            "body": "[Here is an album!](https://imgur.com/a/N3YDXG9)\n\nTaking pictures of all the angles of my head was more difficult than I imagined. I could have mounted my GoPro to my mirror and done it better but I was running out of time. This was a really rough style with just a quick rinse under the shower head \\- I can take some more pictures another time and share them but I think this came out rather well for a quick and easy style.\n\nI also included a few photos from post haircuts and one with my hair after a day out in the sun / wind showing how it looks as it settles throughout the day. Figure I'd share any good ones to give people ideas when going to their barber!\n\nIf you have any questions feel free to ask! Hope this helps!",
            "author": "iAtty",
            "id": "e09wynx",
            "parent_id": "t1_e0921pw",
            "score": 3,
            "created_utc": 1528388486.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "e09z59g",
                    "parent_id": "t1_e09wynx",
                    "score": 1,
                    "created_utc": 1528390305.0,
                    "replies": [
                        {
                            "body": "Crap! Forgot to post it - top length was around 5 to 5.5 inches in the areas I could measure. ",
                            "author": "iAtty",
                            "id": "e09z86b",
                            "parent_id": "t1_e09z59g",
                            "score": 2,
                            "created_utc": 1528390373.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Yup! I’ll post them up tomorrow. ",
            "author": "iAtty",
            "id": "e092mu9",
            "parent_id": "t1_e0921pw",
            "score": 2,
            "created_utc": 1528346309.0,
            "replies": []
        },
        {
            "body": "Thank you! :D",
            "author": "iAtty",
            "id": "e09ovhz",
            "parent_id": "t1_e09fvg4",
            "score": 2,
            "created_utc": 1528381413.0,
            "replies": []
        },
        {
            "body": "Think he used a 1.5 as the shortest length. My side length is always changing depending on where the beard is and how ouch length I keep on top. I’ll rock this hair out for 4-5 weeks before cutting it again so the styling changes as it grows a bit. ",
            "author": "iAtty",
            "id": "e09r6jw",
            "parent_id": "t1_e09q5dy",
            "score": 1,
            "created_utc": 1528383511.0,
            "replies": [
                {
                    "body": "When getting a fade is that how often you will wait before going back for a cut ? I have a very similar cut but I also have very straight thick hair and it sticks out when it's short and starting to grow. Not sure how straight yours is and if you encounter that problem ",
                    "author": "tehlolredditor",
                    "id": "e0a8h94",
                    "parent_id": "t1_e09r6jw",
                    "score": 1,
                    "created_utc": 1528398125.0,
                    "replies": [
                        {
                            "body": "Mine sticks straight out. It’s awful. I have to work hard to get it to lay flat. \n\nI wait a few weeks because of availability to see my barber and because as it grows I adjust my style on the sides. I use a beard brush to brush down the hair, hit it with the blow dryer to help keep it down, and apply product on top of that. I’m fortunate my hair grows evenly on the sides and doesn’t look out of shape until the 5-6 week mark.\n\nMy hair without product is light as air, sticks straight out, and is as straight as it can be. It’s unmanageable lol. ",
                            "author": "iAtty",
                            "id": "e0a8njh",
                            "parent_id": "t1_e0a8h94",
                            "score": 1,
                            "created_utc": 1528398278.0,
                            "replies": [
                                {
                                    "body": "Hmm beard brush? I'll check that out. Sides are always hard to manage . It feels like if I don't get it short enough it's gonna look ugly unless I can sit it down ( but without applying a ton of product making it look gross). Thanks!",
                                    "author": "tehlolredditor",
                                    "id": "e0abc65",
                                    "parent_id": "t1_e0a8njh",
                                    "score": 1,
                                    "created_utc": 1528400563.0,
                                    "replies": [
                                        {
                                            "body": "I had the same struggle. Beard brush and blow dryer made it much easier! Good luck!",
                                            "author": "iAtty",
                                            "id": "e0abe5n",
                                            "parent_id": "t1_e0abc65",
                                            "score": 1,
                                            "created_utc": 1528400611.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Thanks! Great tip - the Got 2 B is available on Amazon. I'll see if I can pick it up locally and give it a shot. ",
            "author": "iAtty",
            "id": "e0acwof",
            "parent_id": "t1_e0abvc8",
            "score": 2,
            "created_utc": 1528401909.0,
            "replies": []
        },
        {
            "body": "I was at 5 to 5.5 inches when I measured it in a few different places. ",
            "author": "iAtty",
            "id": "e0xcg55",
            "parent_id": "t1_e0x31b2",
            "score": 1,
            "created_utc": 1529413482.0,
            "replies": []
        },
        {
            "body": "Not crisp or hard at all. More like a dry powder feeling, similar to corn starch maybe? It doesn’t feel weird and is still malleable. After 12 hours and a bunch of BS it still looks clean and natural with a strong re-stylable hold despite not looking like it would have that. ",
            "author": "iAtty",
            "id": "e090v5m",
            "parent_id": "t1_e090q0b",
            "score": 13,
            "created_utc": 1528344128.0,
            "replies": [
                {
                    "body": "Wow, I'll have to check that out, thanks. Looks great!",
                    "author": "a10kendall",
                    "id": "e090x9t",
                    "parent_id": "t1_e090v5m",
                    "score": 7,
                    "created_utc": 1528344197.0,
                    "replies": [
                        {
                            "body": "Thanks! Definitely worth it. I usually use Dirty by LUSH but I’m tempted to use this full time. It’s a bit expensive so I might use it for special occasions. ",
                            "author": "iAtty",
                            "id": "e090yhz",
                            "parent_id": "t1_e090x9t",
                            "score": 6,
                            "created_utc": 1528344238.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Switched to a sea salt spray, blow dry, and then a new styler from Victory Crown. It’s a spray. Accomplished the same but holds better and washes out better. As for damage, no -  it too much because a problem. I think the powered was worse for my hair overall than the victory spray I use now.",
            "author": "iAtty",
            "id": "j52or68",
            "parent_id": "t1_j52o8ou",
            "score": 1,
            "created_utc": 1674172145.0,
            "replies": [
                {
                    "body": ">  As for damage, no - it too much because a problem.\n\nim not sure i follow lol\n\n> I think the powered was worse for my hair overall than the victory spray I use now.\n\nworse how so? and can you link the spray",
                    "author": "99RedBalloon",
                    "id": "j52p21u",
                    "parent_id": "t1_j52or68",
                    "score": 2,
                    "created_utc": 1674172269.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Blow dry it in the shape you want it and then dry shampoo to give it texture. Make sure you use a product with a good hold. Add some hair spray if you live somewhere with a lot of humidity. ",
            "author": "iAtty",
            "id": "e09ou07",
            "parent_id": "t1_e09n8a3",
            "score": 1,
            "created_utc": 1528381375.0,
            "replies": [
                {
                    "body": "Never tried dry shampoo. What's it like vs just a normal one?",
                    "author": "STIPULATE",
                    "id": "e09p3vm",
                    "parent_id": "t1_e09ou07",
                    "score": 1,
                    "created_utc": 1528381631.0,
                    "replies": [
                        {
                            "body": "Dry shampoo is a spray that absorbs oil. There are texturizing dry shampoos that you can get. I wash my hair regularly (sometimes with shampoo and sometime just water rinse and conditioner) and then when I'm done blow drying my hair I spray in the dry shampoo for texture. ",
                            "author": "iAtty",
                            "id": "e09pr2m",
                            "parent_id": "t1_e09p3vm",
                            "score": 1,
                            "created_utc": 1528382236.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Not as well. If your hair style is something like mine where its going back, I don't think you'll have much success without a blow dryer. Drying it into this shape is what gives it a lot of its hold, the product reinforces that. Without shaping it first you may struggle. \n\nI like Dirty by LUSH for a nice natural look but a strong hold, may work better for you if you aren't blow drying. ",
            "author": "iAtty",
            "id": "e09px9y",
            "parent_id": "t1_e09pmbd",
            "score": 1,
            "created_utc": 1528382395.0,
            "replies": []
        },
        {
            "body": "Yup! And I’ve also got the other one, I’ve found the beach one to be better for me between the two. Most the time I go for whichever is cheaper tho. ",
            "author": "iAtty",
            "id": "e0gf01k",
            "parent_id": "t1_e0gevjk",
            "score": 1,
            "created_utc": 1528671295.0,
            "replies": []
        },
        {
            "body": "Fade from a .5 or 1 up to the hair. Depends on what my beard length is. ",
            "author": "iAtty",
            "id": "e0gs4dr",
            "parent_id": "t1_e0grmtb",
            "score": 1,
            "created_utc": 1528686140.0,
            "replies": [
                {
                    "body": "Awesome. What about the top part of the sides? ",
                    "author": "Dymo342",
                    "id": "e0gsqwq",
                    "parent_id": "t1_e0gs4dr",
                    "score": 1,
                    "created_utc": 1528686763.0,
                    "replies": [
                        {
                            "body": "Uh no clue haha, he just does what he does! If you show your barber this picture he can likely identify and copy it if you’re looking for that. ",
                            "author": "iAtty",
                            "id": "e0gss13",
                            "parent_id": "t1_e0gsqwq",
                            "score": 1,
                            "created_utc": 1528686797.0,
                            "replies": [
                                {
                                    "body": "Ah ok. But he does cut them right?",
                                    "author": "Dymo342",
                                    "id": "e0gswm6",
                                    "parent_id": "t1_e0gss13",
                                    "score": 1,
                                    "created_utc": 1528686927.0,
                                    "replies": [
                                        {
                                            "body": "I think he uses scissors on that area? He usually pins my hair back over in sort of the style I have it in the picture and uses the clippers. Then anything that isn’t short like the side he goes and hits with the scissors. \n\nHe may pin the hair away from that area and hit the underneath bit with clippers but I don’t know. We are usually BSing about whatever and I don’t always see haha. ",
                                            "author": "iAtty",
                                            "id": "e0gt3fd",
                                            "parent_id": "t1_e0gswm6",
                                            "score": 1,
                                            "created_utc": 1528687128.0,
                                            "replies": [
                                                {
                                                    "body": "Ah ok so he does scissor over comb. I need to find a new barber. I usually got a latin barber and I have no idea how to say that in Spanish lol",
                                                    "author": "Dymo342",
                                                    "id": "e0gtain",
                                                    "parent_id": "t1_e0gt3fd",
                                                    "score": 1,
                                                    "created_utc": 1528687340.0,
                                                    "replies": [
                                                        {
                                                            "body": "Hahha. Yeah man, communication is key for a good haircut. I’m sure those guys do good work but you’ve got to be able to talk them through what you want as they are going. ",
                                                            "author": "iAtty",
                                                            "id": "e0gupwq",
                                                            "parent_id": "t1_e0gtain",
                                                            "score": 1,
                                                            "created_utc": 1528688921.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Do you have a pic of the other side you wouldn't mind sharing.  I am interested in how you have it faded up to your part.",
            "author": "Longislandtea12",
            "id": "e09dewg",
            "parent_id": "t1_e08yupk",
            "score": 2,
            "created_utc": 1528366376.0,
            "replies": [
                {
                    "body": "[Here is an album!](https://imgur.com/a/N3YDXG9)\n\nTaking pictures of all the angles of my head was more difficult than I imagined. I could have mounted my GoPro to my mirror and done it better but I was running out of time. This was a really rough style with just a quick rinse under the shower head \\- I can take some more pictures another time and share them but I think this came out rather well for a quick and easy style.\n\nI also included a few photos from post haircuts and one with my hair after a day out in the sun / wind showing how it looks as it settles throughout the day. Figure I'd share any good ones to give people ideas when going to their barber!\n\nIf you have any questions feel free to ask! Hope this helps!\n\nEdit: Top length is between 5 and 5.5 inches in the areas I measured. ",
                    "author": "iAtty",
                    "id": "e09wxh8",
                    "parent_id": "t1_e09dewg",
                    "score": 8,
                    "created_utc": 1528388460.0,
                    "replies": []
                },
                {
                    "body": "Yup! I’ll take some pics today and post them. ",
                    "author": "iAtty",
                    "id": "e09ow45",
                    "parent_id": "t1_e09dewg",
                    "score": 2,
                    "created_utc": 1528381430.0,
                    "replies": [
                        {
                            "body": "Thank you!",
                            "author": "Longislandtea12",
                            "id": "e09rq8a",
                            "parent_id": "t1_e09ow45",
                            "score": 1,
                            "created_utc": 1528383995.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Looks amazing man. I'm struggling to find my style. Do you think you can hook me up with the pic and measurements as well? It'd mean a lot!",
            "author": null,
            "id": "e08ye73",
            "parent_id": "t1_e08vl4m",
            "score": 3,
            "created_utc": 1528341695.0,
            "replies": [
                {
                    "body": "For sure! I’ll try and just reply to these posts for it.",
                    "author": "iAtty",
                    "id": "e08yfuk",
                    "parent_id": "t1_e08ye73",
                    "score": 1,
                    "created_utc": 1528341741.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Thanks!!",
            "author": "effingfractals",
            "id": "e08vnsp",
            "parent_id": "t1_e08vl4m",
            "score": 1,
            "created_utc": 1528338931.0,
            "replies": []
        },
        {
            "body": "Thanks for going through all the extra effort! I really appreciate it, I'll save this for when I go get mine cut again. I probably have about three inches on top now so I'm getting there ",
            "author": "effingfractals",
            "id": "e0sowm7",
            "parent_id": "t1_e09wyao",
            "score": 1,
            "created_utc": 1529194843.0,
            "replies": [
                {
                    "body": "Absolutely! Happy to. Keep it going, The in between stages from short to longer styles are always tough to make it through but so worth it in the end. Let me know if you have any questions along the way!-",
                    "author": "iAtty",
                    "id": "e0t1sxu",
                    "parent_id": "t1_e0sowm7",
                    "score": 1,
                    "created_utc": 1529212009.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "e09z59g",
            "parent_id": "t1_e09wynx",
            "score": 1,
            "created_utc": 1528390305.0,
            "replies": [
                {
                    "body": "Crap! Forgot to post it - top length was around 5 to 5.5 inches in the areas I could measure. ",
                    "author": "iAtty",
                    "id": "e09z86b",
                    "parent_id": "t1_e09z59g",
                    "score": 2,
                    "created_utc": 1528390373.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "When getting a fade is that how often you will wait before going back for a cut ? I have a very similar cut but I also have very straight thick hair and it sticks out when it's short and starting to grow. Not sure how straight yours is and if you encounter that problem ",
            "author": "tehlolredditor",
            "id": "e0a8h94",
            "parent_id": "t1_e09r6jw",
            "score": 1,
            "created_utc": 1528398125.0,
            "replies": [
                {
                    "body": "Mine sticks straight out. It’s awful. I have to work hard to get it to lay flat. \n\nI wait a few weeks because of availability to see my barber and because as it grows I adjust my style on the sides. I use a beard brush to brush down the hair, hit it with the blow dryer to help keep it down, and apply product on top of that. I’m fortunate my hair grows evenly on the sides and doesn’t look out of shape until the 5-6 week mark.\n\nMy hair without product is light as air, sticks straight out, and is as straight as it can be. It’s unmanageable lol. ",
                    "author": "iAtty",
                    "id": "e0a8njh",
                    "parent_id": "t1_e0a8h94",
                    "score": 1,
                    "created_utc": 1528398278.0,
                    "replies": [
                        {
                            "body": "Hmm beard brush? I'll check that out. Sides are always hard to manage . It feels like if I don't get it short enough it's gonna look ugly unless I can sit it down ( but without applying a ton of product making it look gross). Thanks!",
                            "author": "tehlolredditor",
                            "id": "e0abc65",
                            "parent_id": "t1_e0a8njh",
                            "score": 1,
                            "created_utc": 1528400563.0,
                            "replies": [
                                {
                                    "body": "I had the same struggle. Beard brush and blow dryer made it much easier! Good luck!",
                                    "author": "iAtty",
                                    "id": "e0abe5n",
                                    "parent_id": "t1_e0abc65",
                                    "score": 1,
                                    "created_utc": 1528400611.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Wow, I'll have to check that out, thanks. Looks great!",
            "author": "a10kendall",
            "id": "e090x9t",
            "parent_id": "t1_e090v5m",
            "score": 7,
            "created_utc": 1528344197.0,
            "replies": [
                {
                    "body": "Thanks! Definitely worth it. I usually use Dirty by LUSH but I’m tempted to use this full time. It’s a bit expensive so I might use it for special occasions. ",
                    "author": "iAtty",
                    "id": "e090yhz",
                    "parent_id": "t1_e090x9t",
                    "score": 6,
                    "created_utc": 1528344238.0,
                    "replies": []
                }
            ]
        },
        {
            "body": ">  As for damage, no - it too much because a problem.\n\nim not sure i follow lol\n\n> I think the powered was worse for my hair overall than the victory spray I use now.\n\nworse how so? and can you link the spray",
            "author": "99RedBalloon",
            "id": "j52p21u",
            "parent_id": "t1_j52or68",
            "score": 2,
            "created_utc": 1674172269.0,
            "replies": []
        },
        {
            "body": "Never tried dry shampoo. What's it like vs just a normal one?",
            "author": "STIPULATE",
            "id": "e09p3vm",
            "parent_id": "t1_e09ou07",
            "score": 1,
            "created_utc": 1528381631.0,
            "replies": [
                {
                    "body": "Dry shampoo is a spray that absorbs oil. There are texturizing dry shampoos that you can get. I wash my hair regularly (sometimes with shampoo and sometime just water rinse and conditioner) and then when I'm done blow drying my hair I spray in the dry shampoo for texture. ",
                    "author": "iAtty",
                    "id": "e09pr2m",
                    "parent_id": "t1_e09p3vm",
                    "score": 1,
                    "created_utc": 1528382236.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Awesome. What about the top part of the sides? ",
            "author": "Dymo342",
            "id": "e0gsqwq",
            "parent_id": "t1_e0gs4dr",
            "score": 1,
            "created_utc": 1528686763.0,
            "replies": [
                {
                    "body": "Uh no clue haha, he just does what he does! If you show your barber this picture he can likely identify and copy it if you’re looking for that. ",
                    "author": "iAtty",
                    "id": "e0gss13",
                    "parent_id": "t1_e0gsqwq",
                    "score": 1,
                    "created_utc": 1528686797.0,
                    "replies": [
                        {
                            "body": "Ah ok. But he does cut them right?",
                            "author": "Dymo342",
                            "id": "e0gswm6",
                            "parent_id": "t1_e0gss13",
                            "score": 1,
                            "created_utc": 1528686927.0,
                            "replies": [
                                {
                                    "body": "I think he uses scissors on that area? He usually pins my hair back over in sort of the style I have it in the picture and uses the clippers. Then anything that isn’t short like the side he goes and hits with the scissors. \n\nHe may pin the hair away from that area and hit the underneath bit with clippers but I don’t know. We are usually BSing about whatever and I don’t always see haha. ",
                                    "author": "iAtty",
                                    "id": "e0gt3fd",
                                    "parent_id": "t1_e0gswm6",
                                    "score": 1,
                                    "created_utc": 1528687128.0,
                                    "replies": [
                                        {
                                            "body": "Ah ok so he does scissor over comb. I need to find a new barber. I usually got a latin barber and I have no idea how to say that in Spanish lol",
                                            "author": "Dymo342",
                                            "id": "e0gtain",
                                            "parent_id": "t1_e0gt3fd",
                                            "score": 1,
                                            "created_utc": 1528687340.0,
                                            "replies": [
                                                {
                                                    "body": "Hahha. Yeah man, communication is key for a good haircut. I’m sure those guys do good work but you’ve got to be able to talk them through what you want as they are going. ",
                                                    "author": "iAtty",
                                                    "id": "e0gupwq",
                                                    "parent_id": "t1_e0gtain",
                                                    "score": 1,
                                                    "created_utc": 1528688921.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "[Here is an album!](https://imgur.com/a/N3YDXG9)\n\nTaking pictures of all the angles of my head was more difficult than I imagined. I could have mounted my GoPro to my mirror and done it better but I was running out of time. This was a really rough style with just a quick rinse under the shower head \\- I can take some more pictures another time and share them but I think this came out rather well for a quick and easy style.\n\nI also included a few photos from post haircuts and one with my hair after a day out in the sun / wind showing how it looks as it settles throughout the day. Figure I'd share any good ones to give people ideas when going to their barber!\n\nIf you have any questions feel free to ask! Hope this helps!\n\nEdit: Top length is between 5 and 5.5 inches in the areas I measured. ",
            "author": "iAtty",
            "id": "e09wxh8",
            "parent_id": "t1_e09dewg",
            "score": 8,
            "created_utc": 1528388460.0,
            "replies": []
        },
        {
            "body": "Yup! I’ll take some pics today and post them. ",
            "author": "iAtty",
            "id": "e09ow45",
            "parent_id": "t1_e09dewg",
            "score": 2,
            "created_utc": 1528381430.0,
            "replies": [
                {
                    "body": "Thank you!",
                    "author": "Longislandtea12",
                    "id": "e09rq8a",
                    "parent_id": "t1_e09ow45",
                    "score": 1,
                    "created_utc": 1528383995.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "For sure! I’ll try and just reply to these posts for it.",
            "author": "iAtty",
            "id": "e08yfuk",
            "parent_id": "t1_e08ye73",
            "score": 1,
            "created_utc": 1528341741.0,
            "replies": []
        },
        {
            "body": "Absolutely! Happy to. Keep it going, The in between stages from short to longer styles are always tough to make it through but so worth it in the end. Let me know if you have any questions along the way!-",
            "author": "iAtty",
            "id": "e0t1sxu",
            "parent_id": "t1_e0sowm7",
            "score": 1,
            "created_utc": 1529212009.0,
            "replies": []
        },
        {
            "body": "Crap! Forgot to post it - top length was around 5 to 5.5 inches in the areas I could measure. ",
            "author": "iAtty",
            "id": "e09z86b",
            "parent_id": "t1_e09z59g",
            "score": 2,
            "created_utc": 1528390373.0,
            "replies": []
        },
        {
            "body": "Mine sticks straight out. It’s awful. I have to work hard to get it to lay flat. \n\nI wait a few weeks because of availability to see my barber and because as it grows I adjust my style on the sides. I use a beard brush to brush down the hair, hit it with the blow dryer to help keep it down, and apply product on top of that. I’m fortunate my hair grows evenly on the sides and doesn’t look out of shape until the 5-6 week mark.\n\nMy hair without product is light as air, sticks straight out, and is as straight as it can be. It’s unmanageable lol. ",
            "author": "iAtty",
            "id": "e0a8njh",
            "parent_id": "t1_e0a8h94",
            "score": 1,
            "created_utc": 1528398278.0,
            "replies": [
                {
                    "body": "Hmm beard brush? I'll check that out. Sides are always hard to manage . It feels like if I don't get it short enough it's gonna look ugly unless I can sit it down ( but without applying a ton of product making it look gross). Thanks!",
                    "author": "tehlolredditor",
                    "id": "e0abc65",
                    "parent_id": "t1_e0a8njh",
                    "score": 1,
                    "created_utc": 1528400563.0,
                    "replies": [
                        {
                            "body": "I had the same struggle. Beard brush and blow dryer made it much easier! Good luck!",
                            "author": "iAtty",
                            "id": "e0abe5n",
                            "parent_id": "t1_e0abc65",
                            "score": 1,
                            "created_utc": 1528400611.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Thanks! Definitely worth it. I usually use Dirty by LUSH but I’m tempted to use this full time. It’s a bit expensive so I might use it for special occasions. ",
            "author": "iAtty",
            "id": "e090yhz",
            "parent_id": "t1_e090x9t",
            "score": 6,
            "created_utc": 1528344238.0,
            "replies": []
        },
        {
            "body": "Dry shampoo is a spray that absorbs oil. There are texturizing dry shampoos that you can get. I wash my hair regularly (sometimes with shampoo and sometime just water rinse and conditioner) and then when I'm done blow drying my hair I spray in the dry shampoo for texture. ",
            "author": "iAtty",
            "id": "e09pr2m",
            "parent_id": "t1_e09p3vm",
            "score": 1,
            "created_utc": 1528382236.0,
            "replies": []
        },
        {
            "body": "Uh no clue haha, he just does what he does! If you show your barber this picture he can likely identify and copy it if you’re looking for that. ",
            "author": "iAtty",
            "id": "e0gss13",
            "parent_id": "t1_e0gsqwq",
            "score": 1,
            "created_utc": 1528686797.0,
            "replies": [
                {
                    "body": "Ah ok. But he does cut them right?",
                    "author": "Dymo342",
                    "id": "e0gswm6",
                    "parent_id": "t1_e0gss13",
                    "score": 1,
                    "created_utc": 1528686927.0,
                    "replies": [
                        {
                            "body": "I think he uses scissors on that area? He usually pins my hair back over in sort of the style I have it in the picture and uses the clippers. Then anything that isn’t short like the side he goes and hits with the scissors. \n\nHe may pin the hair away from that area and hit the underneath bit with clippers but I don’t know. We are usually BSing about whatever and I don’t always see haha. ",
                            "author": "iAtty",
                            "id": "e0gt3fd",
                            "parent_id": "t1_e0gswm6",
                            "score": 1,
                            "created_utc": 1528687128.0,
                            "replies": [
                                {
                                    "body": "Ah ok so he does scissor over comb. I need to find a new barber. I usually got a latin barber and I have no idea how to say that in Spanish lol",
                                    "author": "Dymo342",
                                    "id": "e0gtain",
                                    "parent_id": "t1_e0gt3fd",
                                    "score": 1,
                                    "created_utc": 1528687340.0,
                                    "replies": [
                                        {
                                            "body": "Hahha. Yeah man, communication is key for a good haircut. I’m sure those guys do good work but you’ve got to be able to talk them through what you want as they are going. ",
                                            "author": "iAtty",
                                            "id": "e0gupwq",
                                            "parent_id": "t1_e0gtain",
                                            "score": 1,
                                            "created_utc": 1528688921.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Thank you!",
            "author": "Longislandtea12",
            "id": "e09rq8a",
            "parent_id": "t1_e09ow45",
            "score": 1,
            "created_utc": 1528383995.0,
            "replies": []
        },
        {
            "body": "Hmm beard brush? I'll check that out. Sides are always hard to manage . It feels like if I don't get it short enough it's gonna look ugly unless I can sit it down ( but without applying a ton of product making it look gross). Thanks!",
            "author": "tehlolredditor",
            "id": "e0abc65",
            "parent_id": "t1_e0a8njh",
            "score": 1,
            "created_utc": 1528400563.0,
            "replies": [
                {
                    "body": "I had the same struggle. Beard brush and blow dryer made it much easier! Good luck!",
                    "author": "iAtty",
                    "id": "e0abe5n",
                    "parent_id": "t1_e0abc65",
                    "score": 1,
                    "created_utc": 1528400611.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Ah ok. But he does cut them right?",
            "author": "Dymo342",
            "id": "e0gswm6",
            "parent_id": "t1_e0gss13",
            "score": 1,
            "created_utc": 1528686927.0,
            "replies": [
                {
                    "body": "I think he uses scissors on that area? He usually pins my hair back over in sort of the style I have it in the picture and uses the clippers. Then anything that isn’t short like the side he goes and hits with the scissors. \n\nHe may pin the hair away from that area and hit the underneath bit with clippers but I don’t know. We are usually BSing about whatever and I don’t always see haha. ",
                    "author": "iAtty",
                    "id": "e0gt3fd",
                    "parent_id": "t1_e0gswm6",
                    "score": 1,
                    "created_utc": 1528687128.0,
                    "replies": [
                        {
                            "body": "Ah ok so he does scissor over comb. I need to find a new barber. I usually got a latin barber and I have no idea how to say that in Spanish lol",
                            "author": "Dymo342",
                            "id": "e0gtain",
                            "parent_id": "t1_e0gt3fd",
                            "score": 1,
                            "created_utc": 1528687340.0,
                            "replies": [
                                {
                                    "body": "Hahha. Yeah man, communication is key for a good haircut. I’m sure those guys do good work but you’ve got to be able to talk them through what you want as they are going. ",
                                    "author": "iAtty",
                                    "id": "e0gupwq",
                                    "parent_id": "t1_e0gtain",
                                    "score": 1,
                                    "created_utc": 1528688921.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I had the same struggle. Beard brush and blow dryer made it much easier! Good luck!",
            "author": "iAtty",
            "id": "e0abe5n",
            "parent_id": "t1_e0abc65",
            "score": 1,
            "created_utc": 1528400611.0,
            "replies": []
        },
        {
            "body": "I think he uses scissors on that area? He usually pins my hair back over in sort of the style I have it in the picture and uses the clippers. Then anything that isn’t short like the side he goes and hits with the scissors. \n\nHe may pin the hair away from that area and hit the underneath bit with clippers but I don’t know. We are usually BSing about whatever and I don’t always see haha. ",
            "author": "iAtty",
            "id": "e0gt3fd",
            "parent_id": "t1_e0gswm6",
            "score": 1,
            "created_utc": 1528687128.0,
            "replies": [
                {
                    "body": "Ah ok so he does scissor over comb. I need to find a new barber. I usually got a latin barber and I have no idea how to say that in Spanish lol",
                    "author": "Dymo342",
                    "id": "e0gtain",
                    "parent_id": "t1_e0gt3fd",
                    "score": 1,
                    "created_utc": 1528687340.0,
                    "replies": [
                        {
                            "body": "Hahha. Yeah man, communication is key for a good haircut. I’m sure those guys do good work but you’ve got to be able to talk them through what you want as they are going. ",
                            "author": "iAtty",
                            "id": "e0gupwq",
                            "parent_id": "t1_e0gtain",
                            "score": 1,
                            "created_utc": 1528688921.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Ah ok so he does scissor over comb. I need to find a new barber. I usually got a latin barber and I have no idea how to say that in Spanish lol",
            "author": "Dymo342",
            "id": "e0gtain",
            "parent_id": "t1_e0gt3fd",
            "score": 1,
            "created_utc": 1528687340.0,
            "replies": [
                {
                    "body": "Hahha. Yeah man, communication is key for a good haircut. I’m sure those guys do good work but you’ve got to be able to talk them through what you want as they are going. ",
                    "author": "iAtty",
                    "id": "e0gupwq",
                    "parent_id": "t1_e0gtain",
                    "score": 1,
                    "created_utc": 1528688921.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Hahha. Yeah man, communication is key for a good haircut. I’m sure those guys do good work but you’ve got to be able to talk them through what you want as they are going. ",
            "author": "iAtty",
            "id": "e0gupwq",
            "parent_id": "t1_e0gtain",
            "score": 1,
            "created_utc": 1528688921.0,
            "replies": []
        }
    ]
}