{
    "title": "Jeon So Min IG Update !! A sneak-peek into the wonderful life of So Min 😃",
    "post_id": "vtmjdd",
    "post_url": "https://www.reddit.com/r/runningman/comments/vtmjdd/jeon_so_min_ig_update_a_sneakpeek_into_the/",
    "author": "Nightblitzjc",
    "body": "",
    "url": "https://v.redd.it/3gxhlwrb76a91",
    "score": 245,
    "upvote_ratio": 0.97,
    "created_utc": 1657211043.0,
    "num_comments": 32,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "I've been reporting the hate comments on Somin's IG, sigh.. they all blatantly saying they're from Myanmar, blaming her for pinning, comparing her to SJH, and all... other stuff. My perception of Myanmar is getting skewed. \n\nCan't Starship sue them or something? Is it possible for an oversea legal action?",
            "author": "KarmaKid250",
            "id": "ifcg8z6",
            "parent_id": "t3_vtmjdd",
            "score": 23,
            "created_utc": 1657289297.0,
            "replies": []
        },
        {
            "body": "her comment section going crazy again ..myanmar haters start to be crazy again..after she post this video, i dont know why i feel sad for her. hope she will always be strong and hope she know she have a lot of people who always support and loving her..maybe some of her fans like me dont active so much in ig and cannot show our support all the time but i hope she know..love running man so much❤️",
            "author": "Next_Topic3790",
            "id": "if88dmm",
            "parent_id": "t3_vtmjdd",
            "score": 42,
            "created_utc": 1657213096.0,
            "replies": [
                {
                    "body": "I suspect they might have been riled up because So Min exposed their malicious comments and basically the story got covered by various news organizations. Normally I will not comment much about this kind of stuff, but I hope So min does not take it to heart. However, I guess pinning those malicious comments clearly shows that she is offended by them. To end this on a good note, enjoy the short clip about her daily life 😀",
                    "author": "Nightblitzjc",
                    "id": "if8fz83",
                    "parent_id": "t1_if88dmm",
                    "score": 27,
                    "created_utc": 1657216015.0,
                    "replies": [
                        {
                            "body": "oo..tq for updates😊",
                            "author": "Next_Topic3790",
                            "id": "if8kx2w",
                            "parent_id": "t1_if8fz83",
                            "score": 5,
                            "created_utc": 1657217909.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Love the video. It shows what a ball of sunshine she is. I wish Somin every happiness. \nSad to see what those 'fans' are doing to Somin again. They have no integrity or conscience.",
            "author": "Mission-Loquat9290",
            "id": "if8h4hb",
            "parent_id": "t3_vtmjdd",
            "score": 34,
            "created_utc": 1657216453.0,
            "replies": []
        },
        {
            "body": "I hope she is doing okay.\n\nIn a way, I'm glad she pinned that hate comment so she could expose that stupid IG page. I also love that a ton of fans came to her defense. \n\nI encourage those who follow the cast to leave positive comments whenever you scroll through your SNS. No one deserves to be bullied, period.",
            "author": "kbx24",
            "id": "if9qb3u",
            "parent_id": "t3_vtmjdd",
            "score": 29,
            "created_utc": 1657234326.0,
            "replies": [
                {
                    "body": "I’m OOTL please explain",
                    "author": "Cousin_Carl",
                    "id": "ifacthh",
                    "parent_id": "t1_if9qb3u",
                    "score": 2,
                    "created_utc": 1657244159.0,
                    "replies": [
                        {
                            "body": "Here's an article:\n\nhttps://www.koreaboo.com/news/netizens-defend-running-mans-jeon-so-min-hate-comments/\n\nHave to scroll about half way down. She pinned a hate comment on the video of her in the water park with HaHa.",
                            "author": "kbx24",
                            "id": "ifaejrt",
                            "parent_id": "t1_ifacthh",
                            "score": 7,
                            "created_utc": 1657244943.0,
                            "replies": [
                                {
                                    "body": "Shit is sad. She pinned another one on a different post the other day. I really hope the people close to her let her know how much she means to them.",
                                    "author": "cbizzle14",
                                    "id": "ifb6h2r",
                                    "parent_id": "t1_ifaejrt",
                                    "score": 12,
                                    "created_utc": 1657259373.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "&#x200B;\n\nEdit: word. If people feel what I'm saying is that easily misinterpreted then I guess it's only right I remove it.",
                    "author": "BoneToBeWild",
                    "id": "ifbbi4z",
                    "parent_id": "t1_if9qb3u",
                    "score": -17,
                    "created_utc": 1657262835.0,
                    "replies": [
                        {
                            "body": "I'm sorry but she chose to mind her business and act like nothing happened for these past 5 years, but did it works? the answer is obviously no! We don't have a say in how she deals with the hate comments because we're not in her shoes.We don't know what she felt, waking up in the morning to find out someone left hurtful words again and again. I would LITERALLY lost my mind if I were tortured like that for years",
                            "author": "wowerzzzzzl",
                            "id": "ifc8fm4",
                            "parent_id": "t1_ifbbi4z",
                            "score": 23,
                            "created_utc": 1657285766.0,
                            "replies": [
                                {
                                    "body": "I added \"IMO\" (means \"**I**n **M**y **O**pinion\") to mark that it was my opinion. In no way am I trying to dictate she must do this or that. I'm pointing out *I believe* there are better ways. I know I have no say in it, so please don't try to frame it as if that's what I'm saying.",
                                    "author": "BoneToBeWild",
                                    "id": "ifcf9o9",
                                    "parent_id": "t1_ifc8fm4",
                                    "score": -14,
                                    "created_utc": 1657288875.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "Fans from Myanmar have already been sending her hateful dms and bragging about telling her to kill herself as well as harassing her in the comments non stop since 2020. They were already emboldened a long time ago just because you didn’t notice or care doesn’t mean things were calm before this. Somin can deal with the hate she has personally experienced for 5 years however she wants to deal with it. Trying to shame her for how she’s handling it while blaming her for their reaction is weird stance to take.\n\nThe only thing that works is attention. It doesn’t stop them but it bothers them. It happened with Vietnamese fans after they got exposed. Did they stop hating her? Nope but they eventually stopped leaving hate comments directly on her page and sbs Instagram for fear of their reputation. Fans from Myanmar have gone unchecked for a while. Now that Somin pinned a comment from them several people are complaining about her pinning comments from their country to the point even her hate page is telling people to stop commenting when they usually send people to her with detailed instructions. Now again this won’t stop them but at the very least it bothers them while highlighting exactly who continues to harass her. So people can’t just keep claiming the hate towards Somin is over and her fans are just trying to paint her as a victim 24/7.",
                            "author": "RumblesFish",
                            "id": "ifc5obj",
                            "parent_id": "t1_ifbbi4z",
                            "score": 22,
                            "created_utc": 1657284402.0,
                            "replies": [
                                {
                                    "body": "Please go ahead and read my comment to u/it-s-luminescent above about the straw man fallacy and apply it to your own comment. It's ridiculous that people are so careless when the topic is so serious.\n\nI haven't shamed her nor blamed her for their reactions. You're peddling delusions.",
                                    "author": "BoneToBeWild",
                                    "id": "ifceap3",
                                    "parent_id": "t1_ifc5obj",
                                    "score": -7,
                                    "created_utc": 1657288451.0,
                                    "replies": [
                                        {
                                            "body": "The majority of your comment is based around you criticising how Somin is choosing to handle something that directly effects her. You then go on to claim her response risks emboldening people who attack her. Which part of my response is peddling delusions exactly? I didn’t magically create a narrative out of thin air. I paraphrased 2 of the main parts of your comment that I disagreed with. That’s not a strawman fallacy a strawman fallacy would be me reading your entire comment then claiming you think Somin deserves to be hated or that you think the people who hate her don’t deserve to be reprimanded.",
                                            "author": "RumblesFish",
                                            "id": "ifcnndx",
                                            "parent_id": "t1_ifceap3",
                                            "score": 22,
                                            "created_utc": 1657292345.0,
                                            "replies": [
                                                {
                                                    "body": "I'm glad you called the moderator out. I interpreted her comments exactly like you did. She shouldn't have replied to you to defend herself but just learned to find other ways to deal with the criticism. 😏",
                                                    "author": "Mission-Loquat9290",
                                                    "id": "ifcrs01",
                                                    "parent_id": "t1_ifcnndx",
                                                    "score": 17,
                                                    "created_utc": 1657293979.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "She's been dealing with it since 2017. Five years. During the bulk of which, she ignored them. Completely.\n\nAsking her to continue with the same strategy of *oh just ignore the haters,* as if she hadn't been doing that for years already is less helpful than saying nothing at all.\n\nIn fact, it arguably adds to the harm being perpetrated against her, since the hate cult around her makes the same arguments you do: she shouldn't pin the comments; she should just ignore them. It's another reason for them to \"hate\" on her. And you validate it for them here, even when cloaked with a veneer of care.\n\nJSM gets no institutional support from SBS or Running Man on this front. They send her to international fan meets with inadequate security when death threats are made against her.\n\nThe show keeps feeding the Spartace trolls, even when it's the extreme elements of certain fandoms like that one that's responsible for the worst of the abuse JSM endures. The show even incites more hate against JSM with their \"storyline\" of JSM coming between KJK and SJH. On air, they acknowledge the mess that kind of maneuver will lead to. But they do it anyway.\n\nThe only time that there was a successful pushback against the JSM hate cultists was when her brother Jeon Wookmin posted about it on instagram, sharing some of the foul, ugly comments he gets from those creeps.\n\nYes, Wookmin putting those hateful words in the spotlight brought awareness to the issue, and garnered enough public pushback that the even the haters had to recede somewhat - at least temporarily.\n\nSunlight is a disinfectant, u/BoneToBeWild.\n\nYou are urging people who suffer from bullying and harassment to suffer in silence. Don't speak publicly about it. Shrug it off. Pretend you don't hurt, and if you do hurt, then it's your fault for taking them to heart. Best do some emotional work on yourself.\n\nI'm sorry, but that's nonsense.\n\nIf published words mean so little, why disallow  or moderate anything on this sub? Anyone who's offended or disagrees with something - no matter how egregious - should bear the burden of that all by themselves, and understand that the issue is they haven't taken emotional inventory of how \"little\" those comments should mean to them.\n\nAs for going to Meta/Facebook/Instagram - a big social media giant - and requesting more refined, improved moderation? Um right, the same company that lets their users plot \"social\" movements like the genocide against Rohingya in Myanmar, or the Jan. 6 insurrection against the U.S. Capitol trying to overturn U.S. elections... yeah that company. It's like asking a starving person: why not wish for more food to magically appear in your bowl? As if that were a perfectly feasible request.",
                            "author": "it-s-luminescent",
                            "id": "ifbw45s",
                            "parent_id": "t1_ifbbi4z",
                            "score": 29,
                            "created_utc": 1657278895.0,
                            "replies": [
                                {
                                    "body": ">JSM gets no institutional support\n\nThat's what bothers me the most. They were quick to defend SJH about her haircut but won't say anything about not harassing JSM. You're not gonna stop everyone but it would do and mean a whole lot for them and especially SJH to say cut it out, it's just a show",
                                    "author": "cbizzle14",
                                    "id": "ifc39ru",
                                    "parent_id": "t1_ifbw45s",
                                    "score": 26,
                                    "created_utc": 1657283146.0,
                                    "replies": [
                                        {
                                            "body": "The only thing I remember was when the members talked about hate comments in their intro during, I think, Se Chan and Somin's second or third episode as official members.\n\nThey said something like, please send them some love and help them feel welcomed coming into the show.",
                                            "author": "failure_mcgee",
                                            "id": "ig3yj55",
                                            "parent_id": "t1_ifc39ru",
                                            "score": 2,
                                            "created_utc": 1657793930.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "You know, I'm not even going to go into detail of rebutting every argument you've carelessly made here, because it all falls in the first sentences to begin with and with the general approach to my comment that you've had:\n\nIt's so full of straw man fallacy and potentially malicious misinterpretations that I'm not even sure where to begin. It appears that you're imagining points I haven't even made and are instead arguing these delusions as if speaking to yourself. Then you go ahead and suggest I'm validating the hate and that my apparent care is but a veneer - all of this based on your own fallacious argumentation. Do better.\n\nI'll give you an example to illuminate how ridiculous your arguments based off of mine (not actually) are. You say:\n\n>Asking her to continue with the same strategy of *oh just ignore the haters*, as if she hadn't been doing that for years already is less helpful than saying nothing at all.\n\nPlease point out to me, where I explicitly and absolutely state that she should \"*continue with the same strategy of oh just ignore the haters*\" and that that's all that I mean with my comment. Please point out where I don't leave room for any other interpretation, because this is seemingly the premise you argue. I've made no such assertions that you're putting on me. I've left plenty of room for interpretation, but you've gone ahead with your own and misunderstood me completely.\n\nIf you want to talk actuals facts, here is one: I suggested two possible alternatives that she could go about approaching the hate. I didn't say these were the only ones nor the best ones, just that I believe they're better than the one in question; I didn't even elaborate very much on them. Definitely not to the point you seem to think I have.\n\nThere are some unfortunate implications about the way you're replying to me, but I actually try to leave room for explanation before misunderstandings happen, so go ahead and please explain what intention you had with making this kind of nonsensical response and what it means?",
                                    "author": "BoneToBeWild",
                                    "id": "ifcdfmf",
                                    "parent_id": "t1_ifbw45s",
                                    "score": -5,
                                    "created_utc": 1657288075.0,
                                    "replies": [
                                        {
                                            "body": "I didn't put quote marks around my paraphrase of you advocating that JSM continue to ignore the haters, but **that's substantively what you called for**.\n\nThe absence of quote marks means it's not a direct quote.\n\nSo you asking me to point out where you explicitly and absolutely stated that paraphrase, and then demanding that I point out how no other interpretation might be possible, when I never said nor implied that no other interpretation was possible.... that, my dear moderator, is setting up a straw man fallacy.\n\nPeople can interpret your comment any way they want. That was my interpretation of your comment. I never said no other interpretations were possible. *Show me explicitly and absolutely where I said no other interpretation was possible \\[not really. this is an illustrative joke\\]*\n\n&#x200B;\n\nAnyway, this is one of the things you wrote:\n\n>She's paying too much attention to the haters and in an unfortunate manner IMO.\n\nThis is substantively asking her to ignore the haters.\n\nAll she did was pin a comment that some troll voluntarily left on her post. And that was your take.\n\nPreviously, for years, she hasn't acknowledged them at all. Hasn't blinked at them. She HAS IGNORED THEM. So, by not pinning that comment - which is the non-action you advocate for - your comment pushes for continued non-acknowledgement. A continunace of let's pretend it's not happening. A continuation of just keep ignoring it.\n\nIf I ask you to \"keep your sneakers unlaced\" and then you say \"luminescent said I shouldn't tie my shoelaces,\" it would be weak of me to retort: \"SHOW ME WHERE I SAID YOU SHOULDNT TIE YOUR SHOELACES,\" when in fact, I did ask you to keep them unlaced, which is substantively the same, exact thing.\n\n&#x200B;\n\nAlso:\n\n>It's the reason I removed the post that was made about it recently\n\nYour overall stance on this JSM hate problem is to ignore the matter publicly - suppress mention of it - even when an instance is newsworthy - when it makes Naver which then gets translated to the usual Korean-English translation blogs.\n\nEven on this subreddit, your stated preference is for this matter to be ignored, and you enforce it via moderation. So, your moderating stance adds to the main takeaway of your advice to JSM being: just ignore them, sweetie. If it bothers you, just mind control yourself into thinking words don't matter.\n\nAnd:\n\n>The hatred and toxicity really needs to be addressed, but there arebetter ways. One would be for her to work on herself to realise howlittle these comments should mean to her.\n\nI stand by my opinion that this is horrible, harmful advice. By saying she should \"work on herself\" is peak victim-blaming. She did nothing wrong here.\n\nJust look at how you reacted to my reply to you in this post. I think it's better that you replied to me, but I would've been impressed if you'd been able to take your advice and \"realize how little\" my \"comment should mean to\" you. And I'm not even hating on you -- not even a little bit. It's a critique of your comment that's all.\n\nRegardless of your intentions, your original comment in this post is gonna be inevitably cited by some JSM hate-troll as support for why JSM pinning that comment was so-so-so wrong and bad bad bad. *Look, even the RM reddit mod agrees with us!* These trolls copy paste youtube comments as \"support\" for their hate campaign. A reddit mod echoing their argument is a big win for them :eyeroll:\n\nI'm not saying you intended to validate their hate. Not at all. Whether you're clued in or not, your comment is going to be exploited that way. Used as ammunition against their creepy war against JSM: an unintended consequence.\n\n&#x200B;\n\nedited: to try to fix formatting but failed - comment spacing is a mess",
                                            "author": "it-s-luminescent",
                                            "id": "ifcj625",
                                            "parent_id": "t1_ifcdfmf",
                                            "score": 16,
                                            "created_utc": 1657290529.0,
                                            "replies": [
                                                {
                                                    "body": "The solution is so simple yet you seemingly refuse to reach for it. Why don't you simply ask me what I meant with what I wrote? About where you're mistaken? Instead of continuing to assume and argue meanings that you think I stated in what I wrote or what my intentions were - when I'm telling you you've misunderstood? Isn't it normal to ask what part one is mistaken about when someone is saying you are?\n\nThis has derailed too much and I'm inclined to think you're not arguing in good faith. It was my mistake to think someone wouldn't jump to wrong conclusions and start arguing off of it with all kinds of wild speculations.",
                                                    "author": "BoneToBeWild",
                                                    "id": "ifeeyka",
                                                    "parent_id": "t1_ifcj625",
                                                    "score": -3,
                                                    "created_utc": 1657317531.0,
                                                    "replies": [
                                                        {
                                                            "body": ">I'm inclined to think you're not arguing in good faith.\n\nI am discussing this with sincerity and in complete good faith.\n\n&#x200B;\n\n>It was my mistake to think someone wouldn't jump to wrong conclusionsand start arguing off of it with all kinds of wild speculations.\n\nI was not the only person in this post who read the plain meaning of your words and understood them this way. If multiple people receive your words in a similar way that I did, then maybe the blame shouldn't be weighed more significantly on the readers who all come to the same reasonable consensus.\n\n&#x200B;\n\n>Why don't you simply ask me what I meant with what I wrote? About where you're mistaken?\n\nWhy on earth is the onus on me to pry it out of you?\n\nIf you want to clarify your deleted comment to anyone who read what we read, then what's stopping you?\n\nYou talk about \"simple\" solutions? Reach for them yourself. Why do you need me to hold your hand to explain yourself?\n\nMe interviewing you wouldn't even work, because you and I are coming very different places when even identifying the \"problem.\" I bet we have very different ideas of what the actual \"problem\" is.\n\nI get the sense that you feel you were deeply misunderstood, and feel wronged about that. I can freely accept that your true intentions might've been different.\n\nBut I'm not here to read minds. I'm judging and responding to the text of the comment, not what's in your own thoughts.\n\nAnd your comment said what it said, and that's what I responded to and am responding to. I wanted to push back on the points I disagreed with as well as the points that I thought did harm. And since multiple people read your comment in the same way, I feel the pushback you received from me and others in this post was necessary in order to balance the moral temperature around the issue.",
                                                            "author": "it-s-luminescent",
                                                            "id": "ifek3ay",
                                                            "parent_id": "t1_ifeeyka",
                                                            "score": 11,
                                                            "created_utc": 1657319762.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "I know you removed your reply to my comment because everyone is up in arms about it - but you do have a point as well. Unfortunately, it's a double-edged sword.\n\nShe's a celebrity and every celebrity has their haters - I get that. But there's a point where even celebrities draw a line in the sand. People will sit there and talk their trash but when the celebrity actually replies and gives them the attention they wanted - they're up in arms about it? They're offended because JSM gave them what they wanted? How is that fair for JSM to be put in a lose-lose situation?\n\nI totally understood where you were coming from though. You believe she should ignore the haters and not give any attention to them which is a valid response. I think when you said 'she should work on herself' is when your comment rubbed people the wrong way as she's been dealing with this for years. It made it seem like she should be the one that should change when we all know it's the toxic behavior that should change and not ignored.\n\nAnyway, I just came back to this post to let you know that you have a valid point - there more ways than one to handle the situation.\n\nI personally believe that JSM should do what she wants but we can't sit here and act surprised when she finally does something about those comments after ignoring them all these years.",
                            "author": "kbx24",
                            "id": "ifcybzj",
                            "parent_id": "t1_ifbbi4z",
                            "score": 12,
                            "created_utc": 1657296476.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "<3 Somin",
            "author": "working-acct",
            "id": "if867mb",
            "parent_id": "t3_vtmjdd",
            "score": 20,
            "created_utc": 1657212262.0,
            "replies": []
        },
        {
            "body": "Her and her Crocs. Never change, Somin. \n\n\"Isn't the fact that we still a live itself means we've already won the fate in life\" - [translation](https://www.instagram.com/p/B9Egl-5h-fs/?igshid=MDJmNzVkMjY=) of excerpt from Jeon Somin <You can call me after me a drink>\n\nIt's a wonderful world. A wonderful world, indeed.",
            "author": "Arktoscircle",
            "id": "ifadlq1",
            "parent_id": "t3_vtmjdd",
            "score": 17,
            "created_utc": 1657244515.0,
            "replies": []
        },
        {
            "body": "She’s adorable 😍",
            "author": "zaichii",
            "id": "ifbe8yp",
            "parent_id": "t3_vtmjdd",
            "score": 13,
            "created_utc": 1657264868.0,
            "replies": []
        },
        {
            "body": "I don’t hate Jeon So Min and she sure is a ball of sunshine! But the character that she created on Running Man doesn’t fit with the rest of the cast and the concept of the show. I think she would do better elsewhere. If we can replace Somin with Lee Sang Yeob, or Woo Jae, it would make a better show.",
            "author": "StringImpressive3306",
            "id": "inpjk01",
            "parent_id": "t3_vtmjdd",
            "score": 1,
            "created_utc": 1662719340.0,
            "replies": []
        },
        {
            "body": "I suspect they might have been riled up because So Min exposed their malicious comments and basically the story got covered by various news organizations. Normally I will not comment much about this kind of stuff, but I hope So min does not take it to heart. However, I guess pinning those malicious comments clearly shows that she is offended by them. To end this on a good note, enjoy the short clip about her daily life 😀",
            "author": "Nightblitzjc",
            "id": "if8fz83",
            "parent_id": "t1_if88dmm",
            "score": 27,
            "created_utc": 1657216015.0,
            "replies": [
                {
                    "body": "oo..tq for updates😊",
                    "author": "Next_Topic3790",
                    "id": "if8kx2w",
                    "parent_id": "t1_if8fz83",
                    "score": 5,
                    "created_utc": 1657217909.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I’m OOTL please explain",
            "author": "Cousin_Carl",
            "id": "ifacthh",
            "parent_id": "t1_if9qb3u",
            "score": 2,
            "created_utc": 1657244159.0,
            "replies": [
                {
                    "body": "Here's an article:\n\nhttps://www.koreaboo.com/news/netizens-defend-running-mans-jeon-so-min-hate-comments/\n\nHave to scroll about half way down. She pinned a hate comment on the video of her in the water park with HaHa.",
                    "author": "kbx24",
                    "id": "ifaejrt",
                    "parent_id": "t1_ifacthh",
                    "score": 7,
                    "created_utc": 1657244943.0,
                    "replies": [
                        {
                            "body": "Shit is sad. She pinned another one on a different post the other day. I really hope the people close to her let her know how much she means to them.",
                            "author": "cbizzle14",
                            "id": "ifb6h2r",
                            "parent_id": "t1_ifaejrt",
                            "score": 12,
                            "created_utc": 1657259373.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "&#x200B;\n\nEdit: word. If people feel what I'm saying is that easily misinterpreted then I guess it's only right I remove it.",
            "author": "BoneToBeWild",
            "id": "ifbbi4z",
            "parent_id": "t1_if9qb3u",
            "score": -17,
            "created_utc": 1657262835.0,
            "replies": [
                {
                    "body": "I'm sorry but she chose to mind her business and act like nothing happened for these past 5 years, but did it works? the answer is obviously no! We don't have a say in how she deals with the hate comments because we're not in her shoes.We don't know what she felt, waking up in the morning to find out someone left hurtful words again and again. I would LITERALLY lost my mind if I were tortured like that for years",
                    "author": "wowerzzzzzl",
                    "id": "ifc8fm4",
                    "parent_id": "t1_ifbbi4z",
                    "score": 23,
                    "created_utc": 1657285766.0,
                    "replies": [
                        {
                            "body": "I added \"IMO\" (means \"**I**n **M**y **O**pinion\") to mark that it was my opinion. In no way am I trying to dictate she must do this or that. I'm pointing out *I believe* there are better ways. I know I have no say in it, so please don't try to frame it as if that's what I'm saying.",
                            "author": "BoneToBeWild",
                            "id": "ifcf9o9",
                            "parent_id": "t1_ifc8fm4",
                            "score": -14,
                            "created_utc": 1657288875.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Fans from Myanmar have already been sending her hateful dms and bragging about telling her to kill herself as well as harassing her in the comments non stop since 2020. They were already emboldened a long time ago just because you didn’t notice or care doesn’t mean things were calm before this. Somin can deal with the hate she has personally experienced for 5 years however she wants to deal with it. Trying to shame her for how she’s handling it while blaming her for their reaction is weird stance to take.\n\nThe only thing that works is attention. It doesn’t stop them but it bothers them. It happened with Vietnamese fans after they got exposed. Did they stop hating her? Nope but they eventually stopped leaving hate comments directly on her page and sbs Instagram for fear of their reputation. Fans from Myanmar have gone unchecked for a while. Now that Somin pinned a comment from them several people are complaining about her pinning comments from their country to the point even her hate page is telling people to stop commenting when they usually send people to her with detailed instructions. Now again this won’t stop them but at the very least it bothers them while highlighting exactly who continues to harass her. So people can’t just keep claiming the hate towards Somin is over and her fans are just trying to paint her as a victim 24/7.",
                    "author": "RumblesFish",
                    "id": "ifc5obj",
                    "parent_id": "t1_ifbbi4z",
                    "score": 22,
                    "created_utc": 1657284402.0,
                    "replies": [
                        {
                            "body": "Please go ahead and read my comment to u/it-s-luminescent above about the straw man fallacy and apply it to your own comment. It's ridiculous that people are so careless when the topic is so serious.\n\nI haven't shamed her nor blamed her for their reactions. You're peddling delusions.",
                            "author": "BoneToBeWild",
                            "id": "ifceap3",
                            "parent_id": "t1_ifc5obj",
                            "score": -7,
                            "created_utc": 1657288451.0,
                            "replies": [
                                {
                                    "body": "The majority of your comment is based around you criticising how Somin is choosing to handle something that directly effects her. You then go on to claim her response risks emboldening people who attack her. Which part of my response is peddling delusions exactly? I didn’t magically create a narrative out of thin air. I paraphrased 2 of the main parts of your comment that I disagreed with. That’s not a strawman fallacy a strawman fallacy would be me reading your entire comment then claiming you think Somin deserves to be hated or that you think the people who hate her don’t deserve to be reprimanded.",
                                    "author": "RumblesFish",
                                    "id": "ifcnndx",
                                    "parent_id": "t1_ifceap3",
                                    "score": 22,
                                    "created_utc": 1657292345.0,
                                    "replies": [
                                        {
                                            "body": "I'm glad you called the moderator out. I interpreted her comments exactly like you did. She shouldn't have replied to you to defend herself but just learned to find other ways to deal with the criticism. 😏",
                                            "author": "Mission-Loquat9290",
                                            "id": "ifcrs01",
                                            "parent_id": "t1_ifcnndx",
                                            "score": 17,
                                            "created_utc": 1657293979.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "She's been dealing with it since 2017. Five years. During the bulk of which, she ignored them. Completely.\n\nAsking her to continue with the same strategy of *oh just ignore the haters,* as if she hadn't been doing that for years already is less helpful than saying nothing at all.\n\nIn fact, it arguably adds to the harm being perpetrated against her, since the hate cult around her makes the same arguments you do: she shouldn't pin the comments; she should just ignore them. It's another reason for them to \"hate\" on her. And you validate it for them here, even when cloaked with a veneer of care.\n\nJSM gets no institutional support from SBS or Running Man on this front. They send her to international fan meets with inadequate security when death threats are made against her.\n\nThe show keeps feeding the Spartace trolls, even when it's the extreme elements of certain fandoms like that one that's responsible for the worst of the abuse JSM endures. The show even incites more hate against JSM with their \"storyline\" of JSM coming between KJK and SJH. On air, they acknowledge the mess that kind of maneuver will lead to. But they do it anyway.\n\nThe only time that there was a successful pushback against the JSM hate cultists was when her brother Jeon Wookmin posted about it on instagram, sharing some of the foul, ugly comments he gets from those creeps.\n\nYes, Wookmin putting those hateful words in the spotlight brought awareness to the issue, and garnered enough public pushback that the even the haters had to recede somewhat - at least temporarily.\n\nSunlight is a disinfectant, u/BoneToBeWild.\n\nYou are urging people who suffer from bullying and harassment to suffer in silence. Don't speak publicly about it. Shrug it off. Pretend you don't hurt, and if you do hurt, then it's your fault for taking them to heart. Best do some emotional work on yourself.\n\nI'm sorry, but that's nonsense.\n\nIf published words mean so little, why disallow  or moderate anything on this sub? Anyone who's offended or disagrees with something - no matter how egregious - should bear the burden of that all by themselves, and understand that the issue is they haven't taken emotional inventory of how \"little\" those comments should mean to them.\n\nAs for going to Meta/Facebook/Instagram - a big social media giant - and requesting more refined, improved moderation? Um right, the same company that lets their users plot \"social\" movements like the genocide against Rohingya in Myanmar, or the Jan. 6 insurrection against the U.S. Capitol trying to overturn U.S. elections... yeah that company. It's like asking a starving person: why not wish for more food to magically appear in your bowl? As if that were a perfectly feasible request.",
                    "author": "it-s-luminescent",
                    "id": "ifbw45s",
                    "parent_id": "t1_ifbbi4z",
                    "score": 29,
                    "created_utc": 1657278895.0,
                    "replies": [
                        {
                            "body": ">JSM gets no institutional support\n\nThat's what bothers me the most. They were quick to defend SJH about her haircut but won't say anything about not harassing JSM. You're not gonna stop everyone but it would do and mean a whole lot for them and especially SJH to say cut it out, it's just a show",
                            "author": "cbizzle14",
                            "id": "ifc39ru",
                            "parent_id": "t1_ifbw45s",
                            "score": 26,
                            "created_utc": 1657283146.0,
                            "replies": [
                                {
                                    "body": "The only thing I remember was when the members talked about hate comments in their intro during, I think, Se Chan and Somin's second or third episode as official members.\n\nThey said something like, please send them some love and help them feel welcomed coming into the show.",
                                    "author": "failure_mcgee",
                                    "id": "ig3yj55",
                                    "parent_id": "t1_ifc39ru",
                                    "score": 2,
                                    "created_utc": 1657793930.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "You know, I'm not even going to go into detail of rebutting every argument you've carelessly made here, because it all falls in the first sentences to begin with and with the general approach to my comment that you've had:\n\nIt's so full of straw man fallacy and potentially malicious misinterpretations that I'm not even sure where to begin. It appears that you're imagining points I haven't even made and are instead arguing these delusions as if speaking to yourself. Then you go ahead and suggest I'm validating the hate and that my apparent care is but a veneer - all of this based on your own fallacious argumentation. Do better.\n\nI'll give you an example to illuminate how ridiculous your arguments based off of mine (not actually) are. You say:\n\n>Asking her to continue with the same strategy of *oh just ignore the haters*, as if she hadn't been doing that for years already is less helpful than saying nothing at all.\n\nPlease point out to me, where I explicitly and absolutely state that she should \"*continue with the same strategy of oh just ignore the haters*\" and that that's all that I mean with my comment. Please point out where I don't leave room for any other interpretation, because this is seemingly the premise you argue. I've made no such assertions that you're putting on me. I've left plenty of room for interpretation, but you've gone ahead with your own and misunderstood me completely.\n\nIf you want to talk actuals facts, here is one: I suggested two possible alternatives that she could go about approaching the hate. I didn't say these were the only ones nor the best ones, just that I believe they're better than the one in question; I didn't even elaborate very much on them. Definitely not to the point you seem to think I have.\n\nThere are some unfortunate implications about the way you're replying to me, but I actually try to leave room for explanation before misunderstandings happen, so go ahead and please explain what intention you had with making this kind of nonsensical response and what it means?",
                            "author": "BoneToBeWild",
                            "id": "ifcdfmf",
                            "parent_id": "t1_ifbw45s",
                            "score": -5,
                            "created_utc": 1657288075.0,
                            "replies": [
                                {
                                    "body": "I didn't put quote marks around my paraphrase of you advocating that JSM continue to ignore the haters, but **that's substantively what you called for**.\n\nThe absence of quote marks means it's not a direct quote.\n\nSo you asking me to point out where you explicitly and absolutely stated that paraphrase, and then demanding that I point out how no other interpretation might be possible, when I never said nor implied that no other interpretation was possible.... that, my dear moderator, is setting up a straw man fallacy.\n\nPeople can interpret your comment any way they want. That was my interpretation of your comment. I never said no other interpretations were possible. *Show me explicitly and absolutely where I said no other interpretation was possible \\[not really. this is an illustrative joke\\]*\n\n&#x200B;\n\nAnyway, this is one of the things you wrote:\n\n>She's paying too much attention to the haters and in an unfortunate manner IMO.\n\nThis is substantively asking her to ignore the haters.\n\nAll she did was pin a comment that some troll voluntarily left on her post. And that was your take.\n\nPreviously, for years, she hasn't acknowledged them at all. Hasn't blinked at them. She HAS IGNORED THEM. So, by not pinning that comment - which is the non-action you advocate for - your comment pushes for continued non-acknowledgement. A continunace of let's pretend it's not happening. A continuation of just keep ignoring it.\n\nIf I ask you to \"keep your sneakers unlaced\" and then you say \"luminescent said I shouldn't tie my shoelaces,\" it would be weak of me to retort: \"SHOW ME WHERE I SAID YOU SHOULDNT TIE YOUR SHOELACES,\" when in fact, I did ask you to keep them unlaced, which is substantively the same, exact thing.\n\n&#x200B;\n\nAlso:\n\n>It's the reason I removed the post that was made about it recently\n\nYour overall stance on this JSM hate problem is to ignore the matter publicly - suppress mention of it - even when an instance is newsworthy - when it makes Naver which then gets translated to the usual Korean-English translation blogs.\n\nEven on this subreddit, your stated preference is for this matter to be ignored, and you enforce it via moderation. So, your moderating stance adds to the main takeaway of your advice to JSM being: just ignore them, sweetie. If it bothers you, just mind control yourself into thinking words don't matter.\n\nAnd:\n\n>The hatred and toxicity really needs to be addressed, but there arebetter ways. One would be for her to work on herself to realise howlittle these comments should mean to her.\n\nI stand by my opinion that this is horrible, harmful advice. By saying she should \"work on herself\" is peak victim-blaming. She did nothing wrong here.\n\nJust look at how you reacted to my reply to you in this post. I think it's better that you replied to me, but I would've been impressed if you'd been able to take your advice and \"realize how little\" my \"comment should mean to\" you. And I'm not even hating on you -- not even a little bit. It's a critique of your comment that's all.\n\nRegardless of your intentions, your original comment in this post is gonna be inevitably cited by some JSM hate-troll as support for why JSM pinning that comment was so-so-so wrong and bad bad bad. *Look, even the RM reddit mod agrees with us!* These trolls copy paste youtube comments as \"support\" for their hate campaign. A reddit mod echoing their argument is a big win for them :eyeroll:\n\nI'm not saying you intended to validate their hate. Not at all. Whether you're clued in or not, your comment is going to be exploited that way. Used as ammunition against their creepy war against JSM: an unintended consequence.\n\n&#x200B;\n\nedited: to try to fix formatting but failed - comment spacing is a mess",
                                    "author": "it-s-luminescent",
                                    "id": "ifcj625",
                                    "parent_id": "t1_ifcdfmf",
                                    "score": 16,
                                    "created_utc": 1657290529.0,
                                    "replies": [
                                        {
                                            "body": "The solution is so simple yet you seemingly refuse to reach for it. Why don't you simply ask me what I meant with what I wrote? About where you're mistaken? Instead of continuing to assume and argue meanings that you think I stated in what I wrote or what my intentions were - when I'm telling you you've misunderstood? Isn't it normal to ask what part one is mistaken about when someone is saying you are?\n\nThis has derailed too much and I'm inclined to think you're not arguing in good faith. It was my mistake to think someone wouldn't jump to wrong conclusions and start arguing off of it with all kinds of wild speculations.",
                                            "author": "BoneToBeWild",
                                            "id": "ifeeyka",
                                            "parent_id": "t1_ifcj625",
                                            "score": -3,
                                            "created_utc": 1657317531.0,
                                            "replies": [
                                                {
                                                    "body": ">I'm inclined to think you're not arguing in good faith.\n\nI am discussing this with sincerity and in complete good faith.\n\n&#x200B;\n\n>It was my mistake to think someone wouldn't jump to wrong conclusionsand start arguing off of it with all kinds of wild speculations.\n\nI was not the only person in this post who read the plain meaning of your words and understood them this way. If multiple people receive your words in a similar way that I did, then maybe the blame shouldn't be weighed more significantly on the readers who all come to the same reasonable consensus.\n\n&#x200B;\n\n>Why don't you simply ask me what I meant with what I wrote? About where you're mistaken?\n\nWhy on earth is the onus on me to pry it out of you?\n\nIf you want to clarify your deleted comment to anyone who read what we read, then what's stopping you?\n\nYou talk about \"simple\" solutions? Reach for them yourself. Why do you need me to hold your hand to explain yourself?\n\nMe interviewing you wouldn't even work, because you and I are coming very different places when even identifying the \"problem.\" I bet we have very different ideas of what the actual \"problem\" is.\n\nI get the sense that you feel you were deeply misunderstood, and feel wronged about that. I can freely accept that your true intentions might've been different.\n\nBut I'm not here to read minds. I'm judging and responding to the text of the comment, not what's in your own thoughts.\n\nAnd your comment said what it said, and that's what I responded to and am responding to. I wanted to push back on the points I disagreed with as well as the points that I thought did harm. And since multiple people read your comment in the same way, I feel the pushback you received from me and others in this post was necessary in order to balance the moral temperature around the issue.",
                                                    "author": "it-s-luminescent",
                                                    "id": "ifek3ay",
                                                    "parent_id": "t1_ifeeyka",
                                                    "score": 11,
                                                    "created_utc": 1657319762.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "I know you removed your reply to my comment because everyone is up in arms about it - but you do have a point as well. Unfortunately, it's a double-edged sword.\n\nShe's a celebrity and every celebrity has their haters - I get that. But there's a point where even celebrities draw a line in the sand. People will sit there and talk their trash but when the celebrity actually replies and gives them the attention they wanted - they're up in arms about it? They're offended because JSM gave them what they wanted? How is that fair for JSM to be put in a lose-lose situation?\n\nI totally understood where you were coming from though. You believe she should ignore the haters and not give any attention to them which is a valid response. I think when you said 'she should work on herself' is when your comment rubbed people the wrong way as she's been dealing with this for years. It made it seem like she should be the one that should change when we all know it's the toxic behavior that should change and not ignored.\n\nAnyway, I just came back to this post to let you know that you have a valid point - there more ways than one to handle the situation.\n\nI personally believe that JSM should do what she wants but we can't sit here and act surprised when she finally does something about those comments after ignoring them all these years.",
                    "author": "kbx24",
                    "id": "ifcybzj",
                    "parent_id": "t1_ifbbi4z",
                    "score": 12,
                    "created_utc": 1657296476.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "oo..tq for updates😊",
            "author": "Next_Topic3790",
            "id": "if8kx2w",
            "parent_id": "t1_if8fz83",
            "score": 5,
            "created_utc": 1657217909.0,
            "replies": []
        },
        {
            "body": "Here's an article:\n\nhttps://www.koreaboo.com/news/netizens-defend-running-mans-jeon-so-min-hate-comments/\n\nHave to scroll about half way down. She pinned a hate comment on the video of her in the water park with HaHa.",
            "author": "kbx24",
            "id": "ifaejrt",
            "parent_id": "t1_ifacthh",
            "score": 7,
            "created_utc": 1657244943.0,
            "replies": [
                {
                    "body": "Shit is sad. She pinned another one on a different post the other day. I really hope the people close to her let her know how much she means to them.",
                    "author": "cbizzle14",
                    "id": "ifb6h2r",
                    "parent_id": "t1_ifaejrt",
                    "score": 12,
                    "created_utc": 1657259373.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I'm sorry but she chose to mind her business and act like nothing happened for these past 5 years, but did it works? the answer is obviously no! We don't have a say in how she deals with the hate comments because we're not in her shoes.We don't know what she felt, waking up in the morning to find out someone left hurtful words again and again. I would LITERALLY lost my mind if I were tortured like that for years",
            "author": "wowerzzzzzl",
            "id": "ifc8fm4",
            "parent_id": "t1_ifbbi4z",
            "score": 23,
            "created_utc": 1657285766.0,
            "replies": [
                {
                    "body": "I added \"IMO\" (means \"**I**n **M**y **O**pinion\") to mark that it was my opinion. In no way am I trying to dictate she must do this or that. I'm pointing out *I believe* there are better ways. I know I have no say in it, so please don't try to frame it as if that's what I'm saying.",
                    "author": "BoneToBeWild",
                    "id": "ifcf9o9",
                    "parent_id": "t1_ifc8fm4",
                    "score": -14,
                    "created_utc": 1657288875.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Fans from Myanmar have already been sending her hateful dms and bragging about telling her to kill herself as well as harassing her in the comments non stop since 2020. They were already emboldened a long time ago just because you didn’t notice or care doesn’t mean things were calm before this. Somin can deal with the hate she has personally experienced for 5 years however she wants to deal with it. Trying to shame her for how she’s handling it while blaming her for their reaction is weird stance to take.\n\nThe only thing that works is attention. It doesn’t stop them but it bothers them. It happened with Vietnamese fans after they got exposed. Did they stop hating her? Nope but they eventually stopped leaving hate comments directly on her page and sbs Instagram for fear of their reputation. Fans from Myanmar have gone unchecked for a while. Now that Somin pinned a comment from them several people are complaining about her pinning comments from their country to the point even her hate page is telling people to stop commenting when they usually send people to her with detailed instructions. Now again this won’t stop them but at the very least it bothers them while highlighting exactly who continues to harass her. So people can’t just keep claiming the hate towards Somin is over and her fans are just trying to paint her as a victim 24/7.",
            "author": "RumblesFish",
            "id": "ifc5obj",
            "parent_id": "t1_ifbbi4z",
            "score": 22,
            "created_utc": 1657284402.0,
            "replies": [
                {
                    "body": "Please go ahead and read my comment to u/it-s-luminescent above about the straw man fallacy and apply it to your own comment. It's ridiculous that people are so careless when the topic is so serious.\n\nI haven't shamed her nor blamed her for their reactions. You're peddling delusions.",
                    "author": "BoneToBeWild",
                    "id": "ifceap3",
                    "parent_id": "t1_ifc5obj",
                    "score": -7,
                    "created_utc": 1657288451.0,
                    "replies": [
                        {
                            "body": "The majority of your comment is based around you criticising how Somin is choosing to handle something that directly effects her. You then go on to claim her response risks emboldening people who attack her. Which part of my response is peddling delusions exactly? I didn’t magically create a narrative out of thin air. I paraphrased 2 of the main parts of your comment that I disagreed with. That’s not a strawman fallacy a strawman fallacy would be me reading your entire comment then claiming you think Somin deserves to be hated or that you think the people who hate her don’t deserve to be reprimanded.",
                            "author": "RumblesFish",
                            "id": "ifcnndx",
                            "parent_id": "t1_ifceap3",
                            "score": 22,
                            "created_utc": 1657292345.0,
                            "replies": [
                                {
                                    "body": "I'm glad you called the moderator out. I interpreted her comments exactly like you did. She shouldn't have replied to you to defend herself but just learned to find other ways to deal with the criticism. 😏",
                                    "author": "Mission-Loquat9290",
                                    "id": "ifcrs01",
                                    "parent_id": "t1_ifcnndx",
                                    "score": 17,
                                    "created_utc": 1657293979.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "She's been dealing with it since 2017. Five years. During the bulk of which, she ignored them. Completely.\n\nAsking her to continue with the same strategy of *oh just ignore the haters,* as if she hadn't been doing that for years already is less helpful than saying nothing at all.\n\nIn fact, it arguably adds to the harm being perpetrated against her, since the hate cult around her makes the same arguments you do: she shouldn't pin the comments; she should just ignore them. It's another reason for them to \"hate\" on her. And you validate it for them here, even when cloaked with a veneer of care.\n\nJSM gets no institutional support from SBS or Running Man on this front. They send her to international fan meets with inadequate security when death threats are made against her.\n\nThe show keeps feeding the Spartace trolls, even when it's the extreme elements of certain fandoms like that one that's responsible for the worst of the abuse JSM endures. The show even incites more hate against JSM with their \"storyline\" of JSM coming between KJK and SJH. On air, they acknowledge the mess that kind of maneuver will lead to. But they do it anyway.\n\nThe only time that there was a successful pushback against the JSM hate cultists was when her brother Jeon Wookmin posted about it on instagram, sharing some of the foul, ugly comments he gets from those creeps.\n\nYes, Wookmin putting those hateful words in the spotlight brought awareness to the issue, and garnered enough public pushback that the even the haters had to recede somewhat - at least temporarily.\n\nSunlight is a disinfectant, u/BoneToBeWild.\n\nYou are urging people who suffer from bullying and harassment to suffer in silence. Don't speak publicly about it. Shrug it off. Pretend you don't hurt, and if you do hurt, then it's your fault for taking them to heart. Best do some emotional work on yourself.\n\nI'm sorry, but that's nonsense.\n\nIf published words mean so little, why disallow  or moderate anything on this sub? Anyone who's offended or disagrees with something - no matter how egregious - should bear the burden of that all by themselves, and understand that the issue is they haven't taken emotional inventory of how \"little\" those comments should mean to them.\n\nAs for going to Meta/Facebook/Instagram - a big social media giant - and requesting more refined, improved moderation? Um right, the same company that lets their users plot \"social\" movements like the genocide against Rohingya in Myanmar, or the Jan. 6 insurrection against the U.S. Capitol trying to overturn U.S. elections... yeah that company. It's like asking a starving person: why not wish for more food to magically appear in your bowl? As if that were a perfectly feasible request.",
            "author": "it-s-luminescent",
            "id": "ifbw45s",
            "parent_id": "t1_ifbbi4z",
            "score": 29,
            "created_utc": 1657278895.0,
            "replies": [
                {
                    "body": ">JSM gets no institutional support\n\nThat's what bothers me the most. They were quick to defend SJH about her haircut but won't say anything about not harassing JSM. You're not gonna stop everyone but it would do and mean a whole lot for them and especially SJH to say cut it out, it's just a show",
                    "author": "cbizzle14",
                    "id": "ifc39ru",
                    "parent_id": "t1_ifbw45s",
                    "score": 26,
                    "created_utc": 1657283146.0,
                    "replies": [
                        {
                            "body": "The only thing I remember was when the members talked about hate comments in their intro during, I think, Se Chan and Somin's second or third episode as official members.\n\nThey said something like, please send them some love and help them feel welcomed coming into the show.",
                            "author": "failure_mcgee",
                            "id": "ig3yj55",
                            "parent_id": "t1_ifc39ru",
                            "score": 2,
                            "created_utc": 1657793930.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "You know, I'm not even going to go into detail of rebutting every argument you've carelessly made here, because it all falls in the first sentences to begin with and with the general approach to my comment that you've had:\n\nIt's so full of straw man fallacy and potentially malicious misinterpretations that I'm not even sure where to begin. It appears that you're imagining points I haven't even made and are instead arguing these delusions as if speaking to yourself. Then you go ahead and suggest I'm validating the hate and that my apparent care is but a veneer - all of this based on your own fallacious argumentation. Do better.\n\nI'll give you an example to illuminate how ridiculous your arguments based off of mine (not actually) are. You say:\n\n>Asking her to continue with the same strategy of *oh just ignore the haters*, as if she hadn't been doing that for years already is less helpful than saying nothing at all.\n\nPlease point out to me, where I explicitly and absolutely state that she should \"*continue with the same strategy of oh just ignore the haters*\" and that that's all that I mean with my comment. Please point out where I don't leave room for any other interpretation, because this is seemingly the premise you argue. I've made no such assertions that you're putting on me. I've left plenty of room for interpretation, but you've gone ahead with your own and misunderstood me completely.\n\nIf you want to talk actuals facts, here is one: I suggested two possible alternatives that she could go about approaching the hate. I didn't say these were the only ones nor the best ones, just that I believe they're better than the one in question; I didn't even elaborate very much on them. Definitely not to the point you seem to think I have.\n\nThere are some unfortunate implications about the way you're replying to me, but I actually try to leave room for explanation before misunderstandings happen, so go ahead and please explain what intention you had with making this kind of nonsensical response and what it means?",
                    "author": "BoneToBeWild",
                    "id": "ifcdfmf",
                    "parent_id": "t1_ifbw45s",
                    "score": -5,
                    "created_utc": 1657288075.0,
                    "replies": [
                        {
                            "body": "I didn't put quote marks around my paraphrase of you advocating that JSM continue to ignore the haters, but **that's substantively what you called for**.\n\nThe absence of quote marks means it's not a direct quote.\n\nSo you asking me to point out where you explicitly and absolutely stated that paraphrase, and then demanding that I point out how no other interpretation might be possible, when I never said nor implied that no other interpretation was possible.... that, my dear moderator, is setting up a straw man fallacy.\n\nPeople can interpret your comment any way they want. That was my interpretation of your comment. I never said no other interpretations were possible. *Show me explicitly and absolutely where I said no other interpretation was possible \\[not really. this is an illustrative joke\\]*\n\n&#x200B;\n\nAnyway, this is one of the things you wrote:\n\n>She's paying too much attention to the haters and in an unfortunate manner IMO.\n\nThis is substantively asking her to ignore the haters.\n\nAll she did was pin a comment that some troll voluntarily left on her post. And that was your take.\n\nPreviously, for years, she hasn't acknowledged them at all. Hasn't blinked at them. She HAS IGNORED THEM. So, by not pinning that comment - which is the non-action you advocate for - your comment pushes for continued non-acknowledgement. A continunace of let's pretend it's not happening. A continuation of just keep ignoring it.\n\nIf I ask you to \"keep your sneakers unlaced\" and then you say \"luminescent said I shouldn't tie my shoelaces,\" it would be weak of me to retort: \"SHOW ME WHERE I SAID YOU SHOULDNT TIE YOUR SHOELACES,\" when in fact, I did ask you to keep them unlaced, which is substantively the same, exact thing.\n\n&#x200B;\n\nAlso:\n\n>It's the reason I removed the post that was made about it recently\n\nYour overall stance on this JSM hate problem is to ignore the matter publicly - suppress mention of it - even when an instance is newsworthy - when it makes Naver which then gets translated to the usual Korean-English translation blogs.\n\nEven on this subreddit, your stated preference is for this matter to be ignored, and you enforce it via moderation. So, your moderating stance adds to the main takeaway of your advice to JSM being: just ignore them, sweetie. If it bothers you, just mind control yourself into thinking words don't matter.\n\nAnd:\n\n>The hatred and toxicity really needs to be addressed, but there arebetter ways. One would be for her to work on herself to realise howlittle these comments should mean to her.\n\nI stand by my opinion that this is horrible, harmful advice. By saying she should \"work on herself\" is peak victim-blaming. She did nothing wrong here.\n\nJust look at how you reacted to my reply to you in this post. I think it's better that you replied to me, but I would've been impressed if you'd been able to take your advice and \"realize how little\" my \"comment should mean to\" you. And I'm not even hating on you -- not even a little bit. It's a critique of your comment that's all.\n\nRegardless of your intentions, your original comment in this post is gonna be inevitably cited by some JSM hate-troll as support for why JSM pinning that comment was so-so-so wrong and bad bad bad. *Look, even the RM reddit mod agrees with us!* These trolls copy paste youtube comments as \"support\" for their hate campaign. A reddit mod echoing their argument is a big win for them :eyeroll:\n\nI'm not saying you intended to validate their hate. Not at all. Whether you're clued in or not, your comment is going to be exploited that way. Used as ammunition against their creepy war against JSM: an unintended consequence.\n\n&#x200B;\n\nedited: to try to fix formatting but failed - comment spacing is a mess",
                            "author": "it-s-luminescent",
                            "id": "ifcj625",
                            "parent_id": "t1_ifcdfmf",
                            "score": 16,
                            "created_utc": 1657290529.0,
                            "replies": [
                                {
                                    "body": "The solution is so simple yet you seemingly refuse to reach for it. Why don't you simply ask me what I meant with what I wrote? About where you're mistaken? Instead of continuing to assume and argue meanings that you think I stated in what I wrote or what my intentions were - when I'm telling you you've misunderstood? Isn't it normal to ask what part one is mistaken about when someone is saying you are?\n\nThis has derailed too much and I'm inclined to think you're not arguing in good faith. It was my mistake to think someone wouldn't jump to wrong conclusions and start arguing off of it with all kinds of wild speculations.",
                                    "author": "BoneToBeWild",
                                    "id": "ifeeyka",
                                    "parent_id": "t1_ifcj625",
                                    "score": -3,
                                    "created_utc": 1657317531.0,
                                    "replies": [
                                        {
                                            "body": ">I'm inclined to think you're not arguing in good faith.\n\nI am discussing this with sincerity and in complete good faith.\n\n&#x200B;\n\n>It was my mistake to think someone wouldn't jump to wrong conclusionsand start arguing off of it with all kinds of wild speculations.\n\nI was not the only person in this post who read the plain meaning of your words and understood them this way. If multiple people receive your words in a similar way that I did, then maybe the blame shouldn't be weighed more significantly on the readers who all come to the same reasonable consensus.\n\n&#x200B;\n\n>Why don't you simply ask me what I meant with what I wrote? About where you're mistaken?\n\nWhy on earth is the onus on me to pry it out of you?\n\nIf you want to clarify your deleted comment to anyone who read what we read, then what's stopping you?\n\nYou talk about \"simple\" solutions? Reach for them yourself. Why do you need me to hold your hand to explain yourself?\n\nMe interviewing you wouldn't even work, because you and I are coming very different places when even identifying the \"problem.\" I bet we have very different ideas of what the actual \"problem\" is.\n\nI get the sense that you feel you were deeply misunderstood, and feel wronged about that. I can freely accept that your true intentions might've been different.\n\nBut I'm not here to read minds. I'm judging and responding to the text of the comment, not what's in your own thoughts.\n\nAnd your comment said what it said, and that's what I responded to and am responding to. I wanted to push back on the points I disagreed with as well as the points that I thought did harm. And since multiple people read your comment in the same way, I feel the pushback you received from me and others in this post was necessary in order to balance the moral temperature around the issue.",
                                            "author": "it-s-luminescent",
                                            "id": "ifek3ay",
                                            "parent_id": "t1_ifeeyka",
                                            "score": 11,
                                            "created_utc": 1657319762.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I know you removed your reply to my comment because everyone is up in arms about it - but you do have a point as well. Unfortunately, it's a double-edged sword.\n\nShe's a celebrity and every celebrity has their haters - I get that. But there's a point where even celebrities draw a line in the sand. People will sit there and talk their trash but when the celebrity actually replies and gives them the attention they wanted - they're up in arms about it? They're offended because JSM gave them what they wanted? How is that fair for JSM to be put in a lose-lose situation?\n\nI totally understood where you were coming from though. You believe she should ignore the haters and not give any attention to them which is a valid response. I think when you said 'she should work on herself' is when your comment rubbed people the wrong way as she's been dealing with this for years. It made it seem like she should be the one that should change when we all know it's the toxic behavior that should change and not ignored.\n\nAnyway, I just came back to this post to let you know that you have a valid point - there more ways than one to handle the situation.\n\nI personally believe that JSM should do what she wants but we can't sit here and act surprised when she finally does something about those comments after ignoring them all these years.",
            "author": "kbx24",
            "id": "ifcybzj",
            "parent_id": "t1_ifbbi4z",
            "score": 12,
            "created_utc": 1657296476.0,
            "replies": []
        },
        {
            "body": "Shit is sad. She pinned another one on a different post the other day. I really hope the people close to her let her know how much she means to them.",
            "author": "cbizzle14",
            "id": "ifb6h2r",
            "parent_id": "t1_ifaejrt",
            "score": 12,
            "created_utc": 1657259373.0,
            "replies": []
        },
        {
            "body": "I added \"IMO\" (means \"**I**n **M**y **O**pinion\") to mark that it was my opinion. In no way am I trying to dictate she must do this or that. I'm pointing out *I believe* there are better ways. I know I have no say in it, so please don't try to frame it as if that's what I'm saying.",
            "author": "BoneToBeWild",
            "id": "ifcf9o9",
            "parent_id": "t1_ifc8fm4",
            "score": -14,
            "created_utc": 1657288875.0,
            "replies": []
        },
        {
            "body": "Please go ahead and read my comment to u/it-s-luminescent above about the straw man fallacy and apply it to your own comment. It's ridiculous that people are so careless when the topic is so serious.\n\nI haven't shamed her nor blamed her for their reactions. You're peddling delusions.",
            "author": "BoneToBeWild",
            "id": "ifceap3",
            "parent_id": "t1_ifc5obj",
            "score": -7,
            "created_utc": 1657288451.0,
            "replies": [
                {
                    "body": "The majority of your comment is based around you criticising how Somin is choosing to handle something that directly effects her. You then go on to claim her response risks emboldening people who attack her. Which part of my response is peddling delusions exactly? I didn’t magically create a narrative out of thin air. I paraphrased 2 of the main parts of your comment that I disagreed with. That’s not a strawman fallacy a strawman fallacy would be me reading your entire comment then claiming you think Somin deserves to be hated or that you think the people who hate her don’t deserve to be reprimanded.",
                    "author": "RumblesFish",
                    "id": "ifcnndx",
                    "parent_id": "t1_ifceap3",
                    "score": 22,
                    "created_utc": 1657292345.0,
                    "replies": [
                        {
                            "body": "I'm glad you called the moderator out. I interpreted her comments exactly like you did. She shouldn't have replied to you to defend herself but just learned to find other ways to deal with the criticism. 😏",
                            "author": "Mission-Loquat9290",
                            "id": "ifcrs01",
                            "parent_id": "t1_ifcnndx",
                            "score": 17,
                            "created_utc": 1657293979.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": ">JSM gets no institutional support\n\nThat's what bothers me the most. They were quick to defend SJH about her haircut but won't say anything about not harassing JSM. You're not gonna stop everyone but it would do and mean a whole lot for them and especially SJH to say cut it out, it's just a show",
            "author": "cbizzle14",
            "id": "ifc39ru",
            "parent_id": "t1_ifbw45s",
            "score": 26,
            "created_utc": 1657283146.0,
            "replies": [
                {
                    "body": "The only thing I remember was when the members talked about hate comments in their intro during, I think, Se Chan and Somin's second or third episode as official members.\n\nThey said something like, please send them some love and help them feel welcomed coming into the show.",
                    "author": "failure_mcgee",
                    "id": "ig3yj55",
                    "parent_id": "t1_ifc39ru",
                    "score": 2,
                    "created_utc": 1657793930.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "You know, I'm not even going to go into detail of rebutting every argument you've carelessly made here, because it all falls in the first sentences to begin with and with the general approach to my comment that you've had:\n\nIt's so full of straw man fallacy and potentially malicious misinterpretations that I'm not even sure where to begin. It appears that you're imagining points I haven't even made and are instead arguing these delusions as if speaking to yourself. Then you go ahead and suggest I'm validating the hate and that my apparent care is but a veneer - all of this based on your own fallacious argumentation. Do better.\n\nI'll give you an example to illuminate how ridiculous your arguments based off of mine (not actually) are. You say:\n\n>Asking her to continue with the same strategy of *oh just ignore the haters*, as if she hadn't been doing that for years already is less helpful than saying nothing at all.\n\nPlease point out to me, where I explicitly and absolutely state that she should \"*continue with the same strategy of oh just ignore the haters*\" and that that's all that I mean with my comment. Please point out where I don't leave room for any other interpretation, because this is seemingly the premise you argue. I've made no such assertions that you're putting on me. I've left plenty of room for interpretation, but you've gone ahead with your own and misunderstood me completely.\n\nIf you want to talk actuals facts, here is one: I suggested two possible alternatives that she could go about approaching the hate. I didn't say these were the only ones nor the best ones, just that I believe they're better than the one in question; I didn't even elaborate very much on them. Definitely not to the point you seem to think I have.\n\nThere are some unfortunate implications about the way you're replying to me, but I actually try to leave room for explanation before misunderstandings happen, so go ahead and please explain what intention you had with making this kind of nonsensical response and what it means?",
            "author": "BoneToBeWild",
            "id": "ifcdfmf",
            "parent_id": "t1_ifbw45s",
            "score": -5,
            "created_utc": 1657288075.0,
            "replies": [
                {
                    "body": "I didn't put quote marks around my paraphrase of you advocating that JSM continue to ignore the haters, but **that's substantively what you called for**.\n\nThe absence of quote marks means it's not a direct quote.\n\nSo you asking me to point out where you explicitly and absolutely stated that paraphrase, and then demanding that I point out how no other interpretation might be possible, when I never said nor implied that no other interpretation was possible.... that, my dear moderator, is setting up a straw man fallacy.\n\nPeople can interpret your comment any way they want. That was my interpretation of your comment. I never said no other interpretations were possible. *Show me explicitly and absolutely where I said no other interpretation was possible \\[not really. this is an illustrative joke\\]*\n\n&#x200B;\n\nAnyway, this is one of the things you wrote:\n\n>She's paying too much attention to the haters and in an unfortunate manner IMO.\n\nThis is substantively asking her to ignore the haters.\n\nAll she did was pin a comment that some troll voluntarily left on her post. And that was your take.\n\nPreviously, for years, she hasn't acknowledged them at all. Hasn't blinked at them. She HAS IGNORED THEM. So, by not pinning that comment - which is the non-action you advocate for - your comment pushes for continued non-acknowledgement. A continunace of let's pretend it's not happening. A continuation of just keep ignoring it.\n\nIf I ask you to \"keep your sneakers unlaced\" and then you say \"luminescent said I shouldn't tie my shoelaces,\" it would be weak of me to retort: \"SHOW ME WHERE I SAID YOU SHOULDNT TIE YOUR SHOELACES,\" when in fact, I did ask you to keep them unlaced, which is substantively the same, exact thing.\n\n&#x200B;\n\nAlso:\n\n>It's the reason I removed the post that was made about it recently\n\nYour overall stance on this JSM hate problem is to ignore the matter publicly - suppress mention of it - even when an instance is newsworthy - when it makes Naver which then gets translated to the usual Korean-English translation blogs.\n\nEven on this subreddit, your stated preference is for this matter to be ignored, and you enforce it via moderation. So, your moderating stance adds to the main takeaway of your advice to JSM being: just ignore them, sweetie. If it bothers you, just mind control yourself into thinking words don't matter.\n\nAnd:\n\n>The hatred and toxicity really needs to be addressed, but there arebetter ways. One would be for her to work on herself to realise howlittle these comments should mean to her.\n\nI stand by my opinion that this is horrible, harmful advice. By saying she should \"work on herself\" is peak victim-blaming. She did nothing wrong here.\n\nJust look at how you reacted to my reply to you in this post. I think it's better that you replied to me, but I would've been impressed if you'd been able to take your advice and \"realize how little\" my \"comment should mean to\" you. And I'm not even hating on you -- not even a little bit. It's a critique of your comment that's all.\n\nRegardless of your intentions, your original comment in this post is gonna be inevitably cited by some JSM hate-troll as support for why JSM pinning that comment was so-so-so wrong and bad bad bad. *Look, even the RM reddit mod agrees with us!* These trolls copy paste youtube comments as \"support\" for their hate campaign. A reddit mod echoing their argument is a big win for them :eyeroll:\n\nI'm not saying you intended to validate their hate. Not at all. Whether you're clued in or not, your comment is going to be exploited that way. Used as ammunition against their creepy war against JSM: an unintended consequence.\n\n&#x200B;\n\nedited: to try to fix formatting but failed - comment spacing is a mess",
                    "author": "it-s-luminescent",
                    "id": "ifcj625",
                    "parent_id": "t1_ifcdfmf",
                    "score": 16,
                    "created_utc": 1657290529.0,
                    "replies": [
                        {
                            "body": "The solution is so simple yet you seemingly refuse to reach for it. Why don't you simply ask me what I meant with what I wrote? About where you're mistaken? Instead of continuing to assume and argue meanings that you think I stated in what I wrote or what my intentions were - when I'm telling you you've misunderstood? Isn't it normal to ask what part one is mistaken about when someone is saying you are?\n\nThis has derailed too much and I'm inclined to think you're not arguing in good faith. It was my mistake to think someone wouldn't jump to wrong conclusions and start arguing off of it with all kinds of wild speculations.",
                            "author": "BoneToBeWild",
                            "id": "ifeeyka",
                            "parent_id": "t1_ifcj625",
                            "score": -3,
                            "created_utc": 1657317531.0,
                            "replies": [
                                {
                                    "body": ">I'm inclined to think you're not arguing in good faith.\n\nI am discussing this with sincerity and in complete good faith.\n\n&#x200B;\n\n>It was my mistake to think someone wouldn't jump to wrong conclusionsand start arguing off of it with all kinds of wild speculations.\n\nI was not the only person in this post who read the plain meaning of your words and understood them this way. If multiple people receive your words in a similar way that I did, then maybe the blame shouldn't be weighed more significantly on the readers who all come to the same reasonable consensus.\n\n&#x200B;\n\n>Why don't you simply ask me what I meant with what I wrote? About where you're mistaken?\n\nWhy on earth is the onus on me to pry it out of you?\n\nIf you want to clarify your deleted comment to anyone who read what we read, then what's stopping you?\n\nYou talk about \"simple\" solutions? Reach for them yourself. Why do you need me to hold your hand to explain yourself?\n\nMe interviewing you wouldn't even work, because you and I are coming very different places when even identifying the \"problem.\" I bet we have very different ideas of what the actual \"problem\" is.\n\nI get the sense that you feel you were deeply misunderstood, and feel wronged about that. I can freely accept that your true intentions might've been different.\n\nBut I'm not here to read minds. I'm judging and responding to the text of the comment, not what's in your own thoughts.\n\nAnd your comment said what it said, and that's what I responded to and am responding to. I wanted to push back on the points I disagreed with as well as the points that I thought did harm. And since multiple people read your comment in the same way, I feel the pushback you received from me and others in this post was necessary in order to balance the moral temperature around the issue.",
                                    "author": "it-s-luminescent",
                                    "id": "ifek3ay",
                                    "parent_id": "t1_ifeeyka",
                                    "score": 11,
                                    "created_utc": 1657319762.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "The majority of your comment is based around you criticising how Somin is choosing to handle something that directly effects her. You then go on to claim her response risks emboldening people who attack her. Which part of my response is peddling delusions exactly? I didn’t magically create a narrative out of thin air. I paraphrased 2 of the main parts of your comment that I disagreed with. That’s not a strawman fallacy a strawman fallacy would be me reading your entire comment then claiming you think Somin deserves to be hated or that you think the people who hate her don’t deserve to be reprimanded.",
            "author": "RumblesFish",
            "id": "ifcnndx",
            "parent_id": "t1_ifceap3",
            "score": 22,
            "created_utc": 1657292345.0,
            "replies": [
                {
                    "body": "I'm glad you called the moderator out. I interpreted her comments exactly like you did. She shouldn't have replied to you to defend herself but just learned to find other ways to deal with the criticism. 😏",
                    "author": "Mission-Loquat9290",
                    "id": "ifcrs01",
                    "parent_id": "t1_ifcnndx",
                    "score": 17,
                    "created_utc": 1657293979.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "The only thing I remember was when the members talked about hate comments in their intro during, I think, Se Chan and Somin's second or third episode as official members.\n\nThey said something like, please send them some love and help them feel welcomed coming into the show.",
            "author": "failure_mcgee",
            "id": "ig3yj55",
            "parent_id": "t1_ifc39ru",
            "score": 2,
            "created_utc": 1657793930.0,
            "replies": []
        },
        {
            "body": "I didn't put quote marks around my paraphrase of you advocating that JSM continue to ignore the haters, but **that's substantively what you called for**.\n\nThe absence of quote marks means it's not a direct quote.\n\nSo you asking me to point out where you explicitly and absolutely stated that paraphrase, and then demanding that I point out how no other interpretation might be possible, when I never said nor implied that no other interpretation was possible.... that, my dear moderator, is setting up a straw man fallacy.\n\nPeople can interpret your comment any way they want. That was my interpretation of your comment. I never said no other interpretations were possible. *Show me explicitly and absolutely where I said no other interpretation was possible \\[not really. this is an illustrative joke\\]*\n\n&#x200B;\n\nAnyway, this is one of the things you wrote:\n\n>She's paying too much attention to the haters and in an unfortunate manner IMO.\n\nThis is substantively asking her to ignore the haters.\n\nAll she did was pin a comment that some troll voluntarily left on her post. And that was your take.\n\nPreviously, for years, she hasn't acknowledged them at all. Hasn't blinked at them. She HAS IGNORED THEM. So, by not pinning that comment - which is the non-action you advocate for - your comment pushes for continued non-acknowledgement. A continunace of let's pretend it's not happening. A continuation of just keep ignoring it.\n\nIf I ask you to \"keep your sneakers unlaced\" and then you say \"luminescent said I shouldn't tie my shoelaces,\" it would be weak of me to retort: \"SHOW ME WHERE I SAID YOU SHOULDNT TIE YOUR SHOELACES,\" when in fact, I did ask you to keep them unlaced, which is substantively the same, exact thing.\n\n&#x200B;\n\nAlso:\n\n>It's the reason I removed the post that was made about it recently\n\nYour overall stance on this JSM hate problem is to ignore the matter publicly - suppress mention of it - even when an instance is newsworthy - when it makes Naver which then gets translated to the usual Korean-English translation blogs.\n\nEven on this subreddit, your stated preference is for this matter to be ignored, and you enforce it via moderation. So, your moderating stance adds to the main takeaway of your advice to JSM being: just ignore them, sweetie. If it bothers you, just mind control yourself into thinking words don't matter.\n\nAnd:\n\n>The hatred and toxicity really needs to be addressed, but there arebetter ways. One would be for her to work on herself to realise howlittle these comments should mean to her.\n\nI stand by my opinion that this is horrible, harmful advice. By saying she should \"work on herself\" is peak victim-blaming. She did nothing wrong here.\n\nJust look at how you reacted to my reply to you in this post. I think it's better that you replied to me, but I would've been impressed if you'd been able to take your advice and \"realize how little\" my \"comment should mean to\" you. And I'm not even hating on you -- not even a little bit. It's a critique of your comment that's all.\n\nRegardless of your intentions, your original comment in this post is gonna be inevitably cited by some JSM hate-troll as support for why JSM pinning that comment was so-so-so wrong and bad bad bad. *Look, even the RM reddit mod agrees with us!* These trolls copy paste youtube comments as \"support\" for their hate campaign. A reddit mod echoing their argument is a big win for them :eyeroll:\n\nI'm not saying you intended to validate their hate. Not at all. Whether you're clued in or not, your comment is going to be exploited that way. Used as ammunition against their creepy war against JSM: an unintended consequence.\n\n&#x200B;\n\nedited: to try to fix formatting but failed - comment spacing is a mess",
            "author": "it-s-luminescent",
            "id": "ifcj625",
            "parent_id": "t1_ifcdfmf",
            "score": 16,
            "created_utc": 1657290529.0,
            "replies": [
                {
                    "body": "The solution is so simple yet you seemingly refuse to reach for it. Why don't you simply ask me what I meant with what I wrote? About where you're mistaken? Instead of continuing to assume and argue meanings that you think I stated in what I wrote or what my intentions were - when I'm telling you you've misunderstood? Isn't it normal to ask what part one is mistaken about when someone is saying you are?\n\nThis has derailed too much and I'm inclined to think you're not arguing in good faith. It was my mistake to think someone wouldn't jump to wrong conclusions and start arguing off of it with all kinds of wild speculations.",
                    "author": "BoneToBeWild",
                    "id": "ifeeyka",
                    "parent_id": "t1_ifcj625",
                    "score": -3,
                    "created_utc": 1657317531.0,
                    "replies": [
                        {
                            "body": ">I'm inclined to think you're not arguing in good faith.\n\nI am discussing this with sincerity and in complete good faith.\n\n&#x200B;\n\n>It was my mistake to think someone wouldn't jump to wrong conclusionsand start arguing off of it with all kinds of wild speculations.\n\nI was not the only person in this post who read the plain meaning of your words and understood them this way. If multiple people receive your words in a similar way that I did, then maybe the blame shouldn't be weighed more significantly on the readers who all come to the same reasonable consensus.\n\n&#x200B;\n\n>Why don't you simply ask me what I meant with what I wrote? About where you're mistaken?\n\nWhy on earth is the onus on me to pry it out of you?\n\nIf you want to clarify your deleted comment to anyone who read what we read, then what's stopping you?\n\nYou talk about \"simple\" solutions? Reach for them yourself. Why do you need me to hold your hand to explain yourself?\n\nMe interviewing you wouldn't even work, because you and I are coming very different places when even identifying the \"problem.\" I bet we have very different ideas of what the actual \"problem\" is.\n\nI get the sense that you feel you were deeply misunderstood, and feel wronged about that. I can freely accept that your true intentions might've been different.\n\nBut I'm not here to read minds. I'm judging and responding to the text of the comment, not what's in your own thoughts.\n\nAnd your comment said what it said, and that's what I responded to and am responding to. I wanted to push back on the points I disagreed with as well as the points that I thought did harm. And since multiple people read your comment in the same way, I feel the pushback you received from me and others in this post was necessary in order to balance the moral temperature around the issue.",
                            "author": "it-s-luminescent",
                            "id": "ifek3ay",
                            "parent_id": "t1_ifeeyka",
                            "score": 11,
                            "created_utc": 1657319762.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I'm glad you called the moderator out. I interpreted her comments exactly like you did. She shouldn't have replied to you to defend herself but just learned to find other ways to deal with the criticism. 😏",
            "author": "Mission-Loquat9290",
            "id": "ifcrs01",
            "parent_id": "t1_ifcnndx",
            "score": 17,
            "created_utc": 1657293979.0,
            "replies": []
        },
        {
            "body": "The solution is so simple yet you seemingly refuse to reach for it. Why don't you simply ask me what I meant with what I wrote? About where you're mistaken? Instead of continuing to assume and argue meanings that you think I stated in what I wrote or what my intentions were - when I'm telling you you've misunderstood? Isn't it normal to ask what part one is mistaken about when someone is saying you are?\n\nThis has derailed too much and I'm inclined to think you're not arguing in good faith. It was my mistake to think someone wouldn't jump to wrong conclusions and start arguing off of it with all kinds of wild speculations.",
            "author": "BoneToBeWild",
            "id": "ifeeyka",
            "parent_id": "t1_ifcj625",
            "score": -3,
            "created_utc": 1657317531.0,
            "replies": [
                {
                    "body": ">I'm inclined to think you're not arguing in good faith.\n\nI am discussing this with sincerity and in complete good faith.\n\n&#x200B;\n\n>It was my mistake to think someone wouldn't jump to wrong conclusionsand start arguing off of it with all kinds of wild speculations.\n\nI was not the only person in this post who read the plain meaning of your words and understood them this way. If multiple people receive your words in a similar way that I did, then maybe the blame shouldn't be weighed more significantly on the readers who all come to the same reasonable consensus.\n\n&#x200B;\n\n>Why don't you simply ask me what I meant with what I wrote? About where you're mistaken?\n\nWhy on earth is the onus on me to pry it out of you?\n\nIf you want to clarify your deleted comment to anyone who read what we read, then what's stopping you?\n\nYou talk about \"simple\" solutions? Reach for them yourself. Why do you need me to hold your hand to explain yourself?\n\nMe interviewing you wouldn't even work, because you and I are coming very different places when even identifying the \"problem.\" I bet we have very different ideas of what the actual \"problem\" is.\n\nI get the sense that you feel you were deeply misunderstood, and feel wronged about that. I can freely accept that your true intentions might've been different.\n\nBut I'm not here to read minds. I'm judging and responding to the text of the comment, not what's in your own thoughts.\n\nAnd your comment said what it said, and that's what I responded to and am responding to. I wanted to push back on the points I disagreed with as well as the points that I thought did harm. And since multiple people read your comment in the same way, I feel the pushback you received from me and others in this post was necessary in order to balance the moral temperature around the issue.",
                    "author": "it-s-luminescent",
                    "id": "ifek3ay",
                    "parent_id": "t1_ifeeyka",
                    "score": 11,
                    "created_utc": 1657319762.0,
                    "replies": []
                }
            ]
        },
        {
            "body": ">I'm inclined to think you're not arguing in good faith.\n\nI am discussing this with sincerity and in complete good faith.\n\n&#x200B;\n\n>It was my mistake to think someone wouldn't jump to wrong conclusionsand start arguing off of it with all kinds of wild speculations.\n\nI was not the only person in this post who read the plain meaning of your words and understood them this way. If multiple people receive your words in a similar way that I did, then maybe the blame shouldn't be weighed more significantly on the readers who all come to the same reasonable consensus.\n\n&#x200B;\n\n>Why don't you simply ask me what I meant with what I wrote? About where you're mistaken?\n\nWhy on earth is the onus on me to pry it out of you?\n\nIf you want to clarify your deleted comment to anyone who read what we read, then what's stopping you?\n\nYou talk about \"simple\" solutions? Reach for them yourself. Why do you need me to hold your hand to explain yourself?\n\nMe interviewing you wouldn't even work, because you and I are coming very different places when even identifying the \"problem.\" I bet we have very different ideas of what the actual \"problem\" is.\n\nI get the sense that you feel you were deeply misunderstood, and feel wronged about that. I can freely accept that your true intentions might've been different.\n\nBut I'm not here to read minds. I'm judging and responding to the text of the comment, not what's in your own thoughts.\n\nAnd your comment said what it said, and that's what I responded to and am responding to. I wanted to push back on the points I disagreed with as well as the points that I thought did harm. And since multiple people read your comment in the same way, I feel the pushback you received from me and others in this post was necessary in order to balance the moral temperature around the issue.",
            "author": "it-s-luminescent",
            "id": "ifek3ay",
            "parent_id": "t1_ifeeyka",
            "score": 11,
            "created_utc": 1657319762.0,
            "replies": []
        }
    ]
}