{
    "title": "My SD died",
    "post_id": "s3r7bx",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/s3r7bx/my_sd_died/",
    "author": "Delicious_Yam7323",
    "body": "He died in a car wreck this past weekend. He was only 56. I’m  absolutely broken and have no one to talk to about it because no one knows I was doing this. I don’t even feel comfortable attending his funeral because he has a wife and kids. I don’t know what to do aside from cry by myself and try my very hardest to seem okay. This is the hardest thing that’s ever happened to me and I can’t tell anyone. On top of all that, our arrangement was my only source of income, I have no real skills and I’m definitely not ready to have another SD for a long time. I don’t know what to do or how to cope.",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/s3r7bx/my_sd_died/",
    "score": 188,
    "upvote_ratio": 0.96,
    "created_utc": 1642163251.0,
    "num_comments": 97,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "Thats so sad.  \n\nI have often wondered, if I passed suddenly, how things would work out.  My situation  is a bit easier than your SD's, not being married and all.  I had an SB of mine die in a car accident a couple years ago, her and her roommate  hit an 18 wheeler head on.  I so wanted to go to the memorial and funeral, but damn, how do I explain who I am and why I was missing her so bad.... Settled for a visit to her grave a few weeks after her headstone was erected.  Maybe something like that can help you, it was OK for me to sit and talk in my mind to her, sitting on the grass next to the stone.",
            "author": "YourBadDecision",
            "id": "hsmd4b5",
            "parent_id": "t3_s3r7bx",
            "score": 111,
            "created_utc": 1642163678.0,
            "replies": [
                {
                    "body": "I’m really sorry that happened to you. I hate cars. Thank you for that advice, I hadn’t thought to do that even though it seems obvious.",
                    "author": "Delicious_Yam7323",
                    "id": "hsmdxde",
                    "parent_id": "t1_hsmd4b5",
                    "score": 40,
                    "created_utc": 1642164146.0,
                    "replies": []
                },
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "hsme87b",
                    "parent_id": "t1_hsmd4b5",
                    "score": 13,
                    "created_utc": 1642164321.0,
                    "replies": [
                        {
                            "body": "It was a complete shock.  The girl that introduced us a few months before, was always jealous that her and I had hit it off so well.  She stayed friends with the SB, and was the one to call and tell me.  I had just talked to SB the night before, after midnite, coming back from a business dinner, she wanted me to come get her.  I knew she was leaving early next morning for a trip, we decided, to wait until she returned.\n\nI blamed myself a bit, thinking at the time, if I had went to get her, it might have changed things.  Later, I came to accept, that when it is your day/time to go, there is nothing a mortal being can do to change it, its simply your time.  I think about her often, and am glad for the few months we had.\n\nOP, I am sad for you too, I'll share one more tidbit that I hope can help you.  I went into a bit of a funk after SB passed.  A few weeks later, I met the best SB I ever had.  I would probably not have met her and had the two years with her I did, if I was spending it with the deceased SB.  I hope you find another special someone somewhere soon.  Life closes one door, and opens others.  We have to lift our heads up though, to see the paths and make the choices.",
                            "author": "YourBadDecision",
                            "id": "hsmflrm",
                            "parent_id": "t1_hsme87b",
                            "score": 21,
                            "created_utc": 1642165092.0,
                            "replies": [
                                {
                                    "body": "Yeah. I’m sure I will eventually, it’s just hard to consider meeting someone even in the far future right now. Thank you.",
                                    "author": "Delicious_Yam7323",
                                    "id": "hsmj6kc",
                                    "parent_id": "t1_hsmflrm",
                                    "score": 7,
                                    "created_utc": 1642166928.0,
                                    "replies": []
                                },
                                {
                                    "body": ">OP, I am sad for you too, I'll share one more tidbit that I hope can help you.  I went into a bit of a funk after SB passed.  A few weeks later, I met the best SB I ever had.  I would probably not have met her and had the two years with her I did, if I was spending it with the deceased SB.\n\nSir, I am very sorry for the obvious pain that you went through. I know this “tidbit” you are sharing has a positive intention, but that is the harshest “things have a way of working out” anecdote I have ever heard. \n\nWoof.",
                                    "author": "ThrowawayUserID1501",
                                    "id": "hsp351u",
                                    "parent_id": "t1_hsmflrm",
                                    "score": 8,
                                    "created_utc": 1642203504.0,
                                    "replies": [
                                        {
                                            "body": "So much this. My SB who meant the world to me died. So I grieved for a week and went on with my life. I’ve had meals that lasted longer than his grief",
                                            "author": "kb1323",
                                            "id": "hspckum",
                                            "parent_id": "t1_hsp351u",
                                            "score": 5,
                                            "created_utc": 1642207668.0,
                                            "replies": [
                                                {
                                                    "body": "Just remember that everyone grieves differently and grief should not take over the rest of your life.",
                                                    "author": "Sendatsu69",
                                                    "id": "ht1ifus",
                                                    "parent_id": "t1_hspckum",
                                                    "score": 2,
                                                    "created_utc": 1642430222.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "Odd question but usually people are pretty close in SR. Like, have keys to the apartment, love their dog (pets) In these situations do you not go back over and collect items or check on the pets due to friends / family? (Like for example if you know her mom hates the dog, she passes, and you have a key why wouldn’t you just go check on the apartment & get the dog? Or is that not okay? What about all the photos together? Mementos? 😬😅 asking for a friend)",
                                    "author": null,
                                    "id": "hsohkto",
                                    "parent_id": "t1_hsmflrm",
                                    "score": 3,
                                    "created_utc": 1642194779.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Sorry, this is a bit insensitive but I'm amused by imagining:\n\n\"Sorry for your loss Mr. and Mrs. Jones, I'm your daughter's john.\"",
                    "author": "Anoonnyymmoous",
                    "id": "hsne9za",
                    "parent_id": "t1_hsmd4b5",
                    "score": -3,
                    "created_utc": 1642179662.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I’m so sorry this happened to you. My only advice is NOT to go to the funeral. You risk his wife and/or children finding out about you if they don’t already know and that will only cause more heartache for his family and for you. I would visit his headstone after it has been erected and have your own memorial for him. My sincere condolences.",
            "author": "lbur4554",
            "id": "hsnq5to",
            "parent_id": "t3_s3r7bx",
            "score": 25,
            "created_utc": 1642184165.0,
            "replies": [
                {
                    "body": "I’m definitely not going to go. His wife seems super sweet from what I know about her and I know they loved each other a lot. Not risking it.",
                    "author": "Delicious_Yam7323",
                    "id": "hso4ini",
                    "parent_id": "t1_hsnq5to",
                    "score": 11,
                    "created_utc": 1642189765.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I am sorry for your loss.\n\nDo you have anyone at all you can lean on? I've gone through some catastrophic grief and hopeless times and not been able to talk to rl social circle or family, but friends I knew online through various communities were able to provide me with some emotional support at my worst times. It was honestly a lifesaver having an outlet like that, even if it isn't quite the same as having support from those closer. In fact in some ways it was better as there was no other baggage there. Of course general safety still applies ESPECIALLY as you are so vulnerable (Yes, I mostly mean watch out for skeezy men), but there are decent people who don't like to see people suffer alone.",
            "author": "OneCanToucanThreeCan",
            "id": "hsmet3f",
            "parent_id": "t3_s3r7bx",
            "score": 11,
            "created_utc": 1642164648.0,
            "replies": [
                {
                    "body": "I quit my therapist like 2 weeks ago because I didn’t feel like we were gelling.. I also felt the happiest I’ve ever felt. May consider getting a new therapist, I just hate the initial meeting and talking about my childhood etc. As of right now, this subreddit is my emotional support.",
                    "author": "Delicious_Yam7323",
                    "id": "hsmkeh9",
                    "parent_id": "t1_hsmet3f",
                    "score": 7,
                    "created_utc": 1642167507.0,
                    "replies": [
                        {
                            "body": "An online forum of strangers, as good as it can be, is in no way sufficient as a source of emotional support in crisis. Right now you need to see a counselor/therapist in person, you can skip the childhood stuff and talk about your situation as it's your therapy. Do that first.\n\nHow is your support system in LA and further afield? I know you haven't discussed your situation but do you have close bonds with people you could rely on to bring it up?\n\nBecause your job right now is processing and getting through the next 1-2 weeks. I get that you have other things to deal with and figure out but if it's at all possible I'd try to reduce the cognitive load on yourself and just make it through, walk your dogs, talk to people, cry. I and probably many other people will be happy to help you figure out your next steps later, but I very much doubt you're in a good place to make good decisions right now.",
                            "author": "SBerryTrifle",
                            "id": "hsnwo3l",
                            "parent_id": "t1_hsmkeh9",
                            "score": 3,
                            "created_utc": 1642186729.0,
                            "replies": [
                                {
                                    "body": "That’s what I’m saying. I don’t even know if I could make it through a job interview right now. It’s just stressful. I don’t have a ton of friends in LA. But I’m debating telling my roommate. I’m just dreading it.. telling her I’ve been SBing and then that my SD he died seems like a lot. But she’s also not dumb and will figure out I’m not doing well so I’ll probably tell her",
                                    "author": "Delicious_Yam7323",
                                    "id": "hso4bqj",
                                    "parent_id": "t1_hsnwo3l",
                                    "score": 2,
                                    "created_utc": 1642189691.0,
                                    "replies": [
                                        {
                                            "body": "You could say that he was a mentor and that he died, and that you had come to care about him. You don't have to say that he was giving you allowances or that there was a romantic element to your relationshp.",
                                            "author": "emptyoverflow",
                                            "id": "hso59ut",
                                            "parent_id": "t1_hso4bqj",
                                            "score": 7,
                                            "created_utc": 1642190047.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "Please see a therapist today and talk to someone you know and trust. If you're pretty confident your roommate is trustworthy then go for it. Put the rest of it out of your mind for the next week or two as worrying about it right now won't help.",
                                            "author": "SBerryTrifle",
                                            "id": "hsohlf2",
                                            "parent_id": "t1_hso4bqj",
                                            "score": 2,
                                            "created_utc": 1642194785.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "hsn3gco",
            "parent_id": "t3_s3r7bx",
            "score": 16,
            "created_utc": 1642175496.0,
            "replies": [
                {
                    "body": "I’m definitely not going.",
                    "author": "Delicious_Yam7323",
                    "id": "hso3v7c",
                    "parent_id": "t1_hsn3gco",
                    "score": 5,
                    "created_utc": 1642189516.0,
                    "replies": []
                },
                {
                    "body": "Sorry funerals weren’t great for you but e1 handles grief different. It may be just right for her.",
                    "author": "gvsulaker82",
                    "id": "hsn6off",
                    "parent_id": "t1_hsn3gco",
                    "score": 4,
                    "created_utc": 1642176747.0,
                    "replies": [
                        {
                            "body": "Something Ive done in the past to avoid people, and just me, what I did: i called the funeral home and requested a private few minutes the night prior to say my goodbyes.  That was done to avoid family.\n\nMy condolences and prayers to you and I wish you all the best. :/",
                            "author": null,
                            "id": "hsndb5i",
                            "parent_id": "t1_hsn6off",
                            "score": 7,
                            "created_utc": 1642179290.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "And I’m sorry that all happened to you. Funerals suck",
                    "author": "Delicious_Yam7323",
                    "id": "hso3wwh",
                    "parent_id": "t1_hsn3gco",
                    "score": 1,
                    "created_utc": 1642189533.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "hsmehcc",
            "parent_id": "t3_s3r7bx",
            "score": 4,
            "created_utc": 1642164467.0,
            "replies": [
                {
                    "body": "Thank you. I feel like he would’ve had a plan in place if he was unhealthy or older but this was so unexpected. The financial stress of it all/looking for a job on top of it is horrible. Do you know anywhere in particular? I’m in Los Angeles. I don’t have a degree and I despise cafe work/restaurants etc. I also have 2 dogs that I hate being away from so was hoping to find a work from home job, but don’t know if that’s my best bet seeing as I have no experience. I’m capable and I’m smart but I really feel liked I’ve fucked myself over and didn’t realize it until now.",
                    "author": "Delicious_Yam7323",
                    "id": "hsmlf1r",
                    "parent_id": "t1_hsmehcc",
                    "score": 3,
                    "created_utc": 1642167977.0,
                    "replies": [
                        {
                            "body": "So sorry for your loss, \n\nYou didn't screw yourself per se, we all get comfortable with life at different points and lift sends us gut punches.\n\nYes you could have been investing in yourself which is what most SD want to see and do but no judgements when you dont.\n\nWork at home can work for some customer service roles ,  Lucky for you no one wants to work right now, so the world is your oyster.  Even gas stations are paying $15 an hour.  No benefits though usually, a therapist is usually expensive so you may want to put that on hold if you can manage.\n\nThe job hunt and job will take your mind off the loss. So hop to it. \n\nI would still go to funeral you can sit and back and sneak out you dont have to say anything more than I work with him once or white lie how you met but thst he helped you in some way and you are forever grateful like you are.\n\nNever have sugar be you only source of income, it changes the dynamics and your independence, \n\nAnd you should make a emergency fund your first goal with job, ie 6 ,,months of expenses, its hard but you will appreciate the sence of security once achieved.\n\nWhat I can tell you from experience, time heals the hurt. And distraction is American passtime cause it works.\n\nVirtual hugs",
                            "author": "Momopllc",
                            "id": "hsncyvn",
                            "parent_id": "t1_hsmlf1r",
                            "score": 1,
                            "created_utc": 1642179159.0,
                            "replies": [
                                {
                                    "body": "Yeah. Definitely learning from this experience. I just didn’t have to work and I didn’t want to. Regretting it now. Thank you",
                                    "author": "Delicious_Yam7323",
                                    "id": "hso5z6e",
                                    "parent_id": "t1_hsncyvn",
                                    "score": 1,
                                    "created_utc": 1642190314.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "How about dog walking/sitting?",
                            "author": "Letmehearyourhaikus",
                            "id": "hsnq56u",
                            "parent_id": "t1_hsmlf1r",
                            "score": 1,
                            "created_utc": 1642184158.0,
                            "replies": [
                                {
                                    "body": "Yeah, I’m trying to find house sitting jobs through a friend.",
                                    "author": "Delicious_Yam7323",
                                    "id": "hso612n",
                                    "parent_id": "t1_hsnq56u",
                                    "score": 1,
                                    "created_utc": 1642190335.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I’m so sorry.",
            "author": "cherryribs",
            "id": "hsmv775",
            "parent_id": "t3_s3r7bx",
            "score": 4,
            "created_utc": 1642172206.0,
            "replies": [
                {
                    "body": "Thank you",
                    "author": "Delicious_Yam7323",
                    "id": "hso4dsl",
                    "parent_id": "t1_hsmv775",
                    "score": 1,
                    "created_utc": 1642189713.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "So sorry to hear this. No reason not to go to the funeral. Just sit in the back and leave right afterwards. No one will ask you anything. And if they do? Perhaps you were working in a store and helped him, or a restaurant and waited on him. Anything like that, and then just walk away. In a grief-laden situation like a funeral, people are almost never terribly pushy.",
            "author": null,
            "id": "hsmh38r",
            "parent_id": "t3_s3r7bx",
            "score": 9,
            "created_utc": 1642165880.0,
            "replies": [
                {
                    "body": "I understand this but I’m a big crier and I feel like people would find it odd that a girl as young as I am is hurt over a man I “helped at men’s warehouse” or something. I don’t want people who are already hurt to hurt more if they did suspect something strange. He and his wife had a really wonderful relationship, it was just sexless and she wasn’t up for more adventure but I know they really loved each other.",
                    "author": "Delicious_Yam7323",
                    "id": "hsmlu8d",
                    "parent_id": "t1_hsmh38r",
                    "score": 17,
                    "created_utc": 1642168172.0,
                    "replies": [
                        {
                            "body": "Or maybe go and just sit in your car in the lot. Just being nearby may help a little",
                            "author": "mraspencer",
                            "id": "hsmsrsl",
                            "parent_id": "t1_hsmlu8d",
                            "score": 5,
                            "created_utc": 1642171215.0,
                            "replies": []
                        },
                        {
                            "body": "Don't worry about it. Really. If you sit in the back, you'll probably be out the door before anyone turns around and notices you. And if you're crying anyway, no one's going to push you with questions.",
                            "author": null,
                            "id": "hsmnzp3",
                            "parent_id": "t1_hsmlu8d",
                            "score": -1,
                            "created_utc": 1642169142.0,
                            "replies": [
                                {
                                    "body": "Why do you think that? If my dad or husband passed away and there was some young girl there crying I would definitely want to know who she was and why she was there.",
                                    "author": "WestCoastCompanion",
                                    "id": "hsp32g5",
                                    "parent_id": "t1_hsmnzp3",
                                    "score": 4,
                                    "created_utc": 1642203473.0,
                                    "replies": [
                                        {
                                            "body": "You might want to know who she was, but to what extent would you pursue and harass someone who left immediately after the funeral service and was crying, while you had your own family around you?",
                                            "author": null,
                                            "id": "hspg8dq",
                                            "parent_id": "t1_hsp32g5",
                                            "score": -1,
                                            "created_utc": 1642209330.0,
                                            "replies": [
                                                {
                                                    "body": "Pursue and harass? Are you suggesting she run away? And add drama and more confusion and emotional burden to an already bereft family? And yes, for my mothers sake/childrens sake/own sake yes I would want to know who they were and what they were doing there. You’re not going to just release this huge mystery on my family that we’ll have to wonder about forever, especially durring a funeral. Advising this young lady that people won’t be inclined to demand an explanation is foolish. To do that to a grieving family would be really selfish. I understand she would like to be there, but she just can’t. These are the sacrifices we make when we engage in these types of arrangements.",
                                                    "author": "WestCoastCompanion",
                                                    "id": "hsrytb7",
                                                    "parent_id": "t1_hspg8dq",
                                                    "score": 2,
                                                    "created_utc": 1642261673.0,
                                                    "replies": [
                                                        {
                                                            "body": ">Are you suggesting she run away?\n\nNo. I'm suggesting that she sit at the back of the church and leave as soon as the service is concluded. Are you going to spot her and sprint to the back of the church just as the service concludes because you don't recognize her?",
                                                            "author": null,
                                                            "id": "hss3wdc",
                                                            "parent_id": "t1_hsrytb7",
                                                            "score": 0,
                                                            "created_utc": 1642263741.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Well she says she’s “a big cryer” so if that’s the case she would be creating a scene and drawing attention to herself, so yes. \nAlso, if you read the OP’s comments, you see he had a very good relationship with his wife. There’s no need to selfishly disrespect her and their relationship like this. I feel like you’re just arguing for arguments sake because there’s no way any sane person would think this is a good idea. I’m sure she also loved and respected him too much to risk exposing him after he’s passed.",
                                                                    "author": "WestCoastCompanion",
                                                                    "id": "hstp453",
                                                                    "parent_id": "t1_hss3wdc",
                                                                    "score": 2,
                                                                    "created_utc": 1642286408.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "You've ignored my question:\n\n>Are you going to spot her and sprint to the back of the church just as the service concludes because you don't recognize her?\n\nI knew fewer than half of the people at my father's funeral, and made no effort to identify the ones I didn't know. I was grateful for the support.\n\nMoving on:\n\n>I feel like you’re just arguing for arguments sake because there’s no way any sane person would think this is a good idea.\n\nApparently, then, judging from other comments, I'm not the only person here who's not sane. Not very tolerant of opinions that are different from yours, are you . . . .\n\nFeel free to take the last word, if you like; I won't respond to you again.",
                                                                            "author": null,
                                                                            "id": "hstu84c",
                                                                            "parent_id": "t1_hstp453",
                                                                            "score": 0,
                                                                            "created_utc": 1642288509.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "I didn’t ignore your question, it literally says yes in the first sentence if you’d bothered to read it. I’m sure you wouldn’t, but as you must be aware, women and men react very differently to the same situations. I’m sure most men couldn’t care less or would already assume. However, if the wife noticed her, and especially if she has a daughter or sister, I can assure you the daughter or sister will absolutely get to the bottom of it for her sake, not just say “oh well, just ignore the random 20 year old girl sobbing at the back of your late husbands funeral. I’m sure it’s nothing” \nIt’s almost like you know absolutely nothing about women at all.",
                                                                                    "author": "WestCoastCompanion",
                                                                                    "id": "hsu11ka",
                                                                                    "parent_id": "t1_hstu84c",
                                                                                    "score": 1,
                                                                                    "created_utc": 1642291337.0,
                                                                                    "replies": [
                                                                                        {
                                                                                            "body": ">I didn’t ignore your question, it literally says yes in the first sentence if you’d bothered to read it.\n\nYou are correct. You gave a very qualified answer, but, true, you didn't ignore my question. I was wrong on that point.",
                                                                                            "author": null,
                                                                                            "id": "hsu1iv9",
                                                                                            "parent_id": "t1_hsu11ka",
                                                                                            "score": 1,
                                                                                            "created_utc": 1642291535.0,
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "Good girl. I know it’s hard, but these are the sacrifices we make. Hang in there. Msg me anytime if you need someone to talk to.",
                            "author": "WestCoastCompanion",
                            "id": "hsrz0bo",
                            "parent_id": "t1_hsmlu8d",
                            "score": 1,
                            "created_utc": 1642261755.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "I also encourage you to go to the funeral or visit his grave. These rites play a role in closure and, in my experience, no one will question it if you sit in the back. With COVID, entry may be more of an issue, so keep that in mind I guess. \n\nSomeone very close to me widowed very young. It's been a few years and she still has good days and bad days about it. Give yourself time to grieve but remember your SD would want you to keep living and loving. \n\nFinally, best of luck finding a new source of income. In most of the US at least, there's a high demand for workers. You could take on something temporary while you mourn and until you find your next SD.",
                    "author": "ValarHTX",
                    "id": "hsmjjxx",
                    "parent_id": "t1_hsmh38r",
                    "score": 6,
                    "created_utc": 1642167106.0,
                    "replies": []
                },
                {
                    "body": "Totally agree. I don't know why people are so weird about attending funerals. Unless you're making a big scene or TRYING to get noticed, its extremely unlikely anyone would notice or care. I've attended funerals of people I hardly knew. If someone asks just say you knew him from work. Just don't act weird and things go fine. No one is going to push to know bunches of details....they are too busy w their grief to care.",
                    "author": "clair-cummings",
                    "id": "hsmiwvl",
                    "parent_id": "t1_hsmh38r",
                    "score": 0,
                    "created_utc": 1642166797.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "That's awful. Let yourself be sad, feel what you feel. It would be good to find someone you can talk to, as well. Note to all - you should have someone to talk to, open up with about your sugar life for your mental health, even if it's just a Reddit pen pal. Maybe reach out to someone here and they will listen \n\nBut you need to pull yourself together, get a job or a new SD. Don't let one tragedy become a series if disasters, too. I know it can be very hard and you have to get to a point where you are ready, but getting busy, moving in a positive direction, will help you heal",
            "author": "ziggy440",
            "id": "hsmjrsy",
            "parent_id": "t3_s3r7bx",
            "score": 3,
            "created_utc": 1642167209.0,
            "replies": [
                {
                    "body": "Thanks",
                    "author": "Delicious_Yam7323",
                    "id": "hso4d5z",
                    "parent_id": "t1_hsmjrsy",
                    "score": 1,
                    "created_utc": 1642189706.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "You are young. Your first life-changing experience (and that is exactly what this is) is the hardest, but there will be more, not many if you are lucky, but you will be shattered again, and again.\n\nCry. Remember. Appreciate all he meant to you. Then get up. Wipe your tears. Get a job.",
            "author": "AFSMSgt",
            "id": "hsn9b5p",
            "parent_id": "t3_s3r7bx",
            "score": 3,
            "created_utc": 1642177757.0,
            "replies": [
                {
                    "body": "Thanks, I appreciate it.",
                    "author": "Delicious_Yam7323",
                    "id": "hso4fml",
                    "parent_id": "t1_hsn9b5p",
                    "score": 1,
                    "created_utc": 1642189732.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "If you are able, please seek a community counselor. There are many free options out there. You need to be able to discuss your pain and your loss.",
            "author": "AARCEntertainment",
            "id": "hsnfk3p",
            "parent_id": "t3_s3r7bx",
            "score": 3,
            "created_utc": 1642180152.0,
            "replies": []
        },
        {
            "body": "My deepest condolences. He's sadly gone from this world but you can carry him in you heart always, and it will hurt less with time. Go out and live your life in a positive way, I'm sure that's what he would want for you.",
            "author": "roscoe7585",
            "id": "hsmml3x",
            "parent_id": "t3_s3r7bx",
            "score": 2,
            "created_utc": 1642168508.0,
            "replies": [
                {
                    "body": "Thank you",
                    "author": "Delicious_Yam7323",
                    "id": "hso4s6f",
                    "parent_id": "t1_hsmml3x",
                    "score": 2,
                    "created_utc": 1642189864.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "That sucks.  I have two thoughts.  \n\n\n1) It sounds like he was lucky to have you. There are so many SBs on r/slf that only value their SDs money.  I get that, it's ok. But the truly lucky have one that actually likes them.  \n\n\n2) There are no rules on grieving.  If you find yourself laughing and happy tomorrow. Don't feel bad for about it, it's ok.  If you want to stay inside and do nothing all weekend, that's ok too. Don't judge yourself for how to deal with your loss.",
            "author": "Shot_Huckleberry_332",
            "id": "hsmvsp4",
            "parent_id": "t3_s3r7bx",
            "score": 2,
            "created_utc": 1642172449.0,
            "replies": [
                {
                    "body": "Thank you so much",
                    "author": "Delicious_Yam7323",
                    "id": "hso4vax",
                    "parent_id": "t1_hsmvsp4",
                    "score": 1,
                    "created_utc": 1642189896.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I’m so sorry for your loss. I understand this must be extremely rough for you feeling like you’re not able to confide in anyone about what you’re going through. I personally think if I experienced your situation, I would research different therapists, and psychologists that are SW friendly. I understand not feeling comfortable opening up about this to friends or family. I could only imagine the weight you’re carrying on your shoulders though.. you deserve to feel safe expressing how this has affected you while having someone who is trained and skilled to help you make a plan that works best for for you, and your healing journey. \n\nYou have a plethora of skills and amazing qualities. Maybe a good start would be to think about some things you’re passionate about that you’d be interested in turning into a form of monetization \n^~^ \n\nYou will overcome this, and you have so many supportive kindreds here to remind you of your strength!",
            "author": "No-Bass3542",
            "id": "hsn6qh2",
            "parent_id": "t3_s3r7bx",
            "score": 2,
            "created_utc": 1642176769.0,
            "replies": [
                {
                    "body": "Thanks a lot. I’m debating trying to make greeting cards. I’ve always made them for my family and friends but I feel like they could do well. Who knows.",
                    "author": "Delicious_Yam7323",
                    "id": "hso5295",
                    "parent_id": "t1_hsn6qh2",
                    "score": 2,
                    "created_utc": 1642189968.0,
                    "replies": [
                        {
                            "body": "You’re welcome. That sounds like something that could help uplift your spirits! I hope it goes well, maybe put on some of your favorite music too. Sending hugs and love 💓",
                            "author": "No-Bass3542",
                            "id": "hsoh9uj",
                            "parent_id": "t1_hso5295",
                            "score": 1,
                            "created_utc": 1642194661.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "hsnc4lq",
            "parent_id": "t3_s3r7bx",
            "score": 2,
            "created_utc": 1642178839.0,
            "replies": [
                {
                    "body": "Not overstepping. Thanks for taking the time to write this out.",
                    "author": "Delicious_Yam7323",
                    "id": "hso5bdr",
                    "parent_id": "t1_hsnc4lq",
                    "score": 2,
                    "created_utc": 1642190063.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "hsnq5jk",
            "parent_id": "t3_s3r7bx",
            "score": 2,
            "created_utc": 1642184162.0,
            "replies": [
                {
                    "body": "Didn’t even think about that but yeah, I plan not to go. Thank you",
                    "author": "Delicious_Yam7323",
                    "id": "hso4r4h",
                    "parent_id": "t1_hsnq5jk",
                    "score": 1,
                    "created_utc": 1642189853.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Sorry to hear this...Personally I would not go to the funeral. It really isn't your place. The funeral is literally for his friends and family to get some closure, it's arranged by them. If anyone connects the dots, all it does is tarnish the memory of him for his family and then cause the family a whole boatload of anguish. These relationships are secret and so you will need to grieve in secret IMO. Visiting the grave when his family aren't there is what I'd do.",
            "author": "AvenueLane96",
            "id": "hsntczx",
            "parent_id": "t3_s3r7bx",
            "score": 2,
            "created_utc": 1642185406.0,
            "replies": [
                {
                    "body": "I completely agree and that is the plan. Thank you",
                    "author": "Delicious_Yam7323",
                    "id": "hso5grb",
                    "parent_id": "t1_hsntczx",
                    "score": 2,
                    "created_utc": 1642190120.0,
                    "replies": []
                },
                {
                    "body": "I could not agree more.",
                    "author": "iwishyouwo0d",
                    "id": "hsojjxd",
                    "parent_id": "t1_hsntczx",
                    "score": 1,
                    "created_utc": 1642195541.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "hso1sc3",
            "parent_id": "t3_s3r7bx",
            "score": 2,
            "created_utc": 1642188720.0,
            "replies": [
                {
                    "body": "Thank you",
                    "author": "Delicious_Yam7323",
                    "id": "hspiipj",
                    "parent_id": "t1_hso1sc3",
                    "score": 2,
                    "created_utc": 1642210359.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Oh hunny I'm sorry, please feel free to message if you need to talk.",
            "author": "ModdedDoll",
            "id": "hsohwoq",
            "parent_id": "t3_s3r7bx",
            "score": 2,
            "created_utc": 1642194906.0,
            "replies": [
                {
                    "body": "Thank you",
                    "author": "Delicious_Yam7323",
                    "id": "hspifyb",
                    "parent_id": "t1_hsohwoq",
                    "score": 2,
                    "created_utc": 1642210325.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "hsp615f",
            "parent_id": "t3_s3r7bx",
            "score": 2,
            "created_utc": 1642204746.0,
            "replies": [
                {
                    "body": "Thank you ❤️",
                    "author": "Delicious_Yam7323",
                    "id": "hspir61",
                    "parent_id": "t1_hsp615f",
                    "score": 2,
                    "created_utc": 1642210464.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "So very sorry to hear about your sd. If it helps you, you should still go to his services. No one needs to know who you were to him and naturally nobody's going to really think about it either unless there's someone mutual that would've known the relationship between the two of you. For your finances you may need to get a job for now. Many companies are hiring. It may not be at the level you're used to but at least it's something till you can recover and try sr again. Good luck to you!",
            "author": "orlandoanglada",
            "id": "hsp933o",
            "parent_id": "t3_s3r7bx",
            "score": 2,
            "created_utc": 1642206104.0,
            "replies": [
                {
                    "body": "Thank you",
                    "author": "Delicious_Yam7323",
                    "id": "hspiszi",
                    "parent_id": "t1_hsp933o",
                    "score": 1,
                    "created_utc": 1642210487.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I’m so sorry for your loss…\n\nCurious, how did you find out? Did you do a google search after not hearing from him for a few days? Or was it on the news?\n\nI’ve thought about something like this happening to my sd ands it’s terrifying. Mine has been my only source of income for the last 5 years. My situation is obviously much different than yours, but he’s moving to Florida next month with his wife and I have NO clue what I’m going to do at that point. It’s hard to even consider going back to a normal job. Why would I work for 15/hour when I’ve been making hundreds an hour for the last 5 years?  I’ve adapted to this lifestyle and I don’t want things to change, but I don’t really have a choice. \n\nHave you considered meeting new potential sds? I mean, it’s your body and you don’t have to be intimate with them right away, but making friends could bring you happiness and help you cope with your loss. And Later on, you might be able to make an income off of them. \n\nI agree with others about not going to the funeral. As much as you want to pay him your respects, going there will do the complete opposite if his family ends up approaching you. You’re doing the right thing by not going.",
            "author": "Gymbunnyyy",
            "id": "hspn9k4",
            "parent_id": "t3_s3r7bx",
            "score": 2,
            "created_utc": 1642212534.0,
            "replies": [
                {
                    "body": "I thought he was ghosting me which would be so unlike him so I was really hurt. Then after 2 days I looked on his Facebook and found out there. It was horrible. I wanted to talk to him and turn to HIM to mourn & get some sort of comfort over HIS death. Such a weird feeling which I’m sure is common when you lose someone close to you. \n\nI couldn’t agree more about the job thing. I’ve gotten a lot of flack for not having another source of income but if I could not work, enjoy my life and spend it with him and my dogs- why would I work a cafe job that I dread? I do regret not having something though. I’m sorry you’re dealing with that, it sucks. \n\nI have considered a new SD, but I wouldn’t feel comfortable being sexual right now and I feel most expect sex sooner than later. I could use a platonic sugar daddy, but it doesn’t seem realistic and I feel insensitive and it feels wrong if I seek one out at this time. \n\nCompletely agree about the funeral.\nThanks for replying ❤️",
                    "author": "Delicious_Yam7323",
                    "id": "hspugot",
                    "parent_id": "t1_hspn9k4",
                    "score": 2,
                    "created_utc": 1642215907.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Take small comfort in knowing you have the sincere condolences of many.  That's just heart breaking and especially difficult knowing you must remain an outside observer, when grieving is eased by company.  There's no solution to your heartbreak except for time and your cherished memories of a good time in your life when a harder time is likely coming.  At least you had the joy you experienced.  Take a little comfort in that.",
            "author": "Devastavit",
            "id": "hsrumiy",
            "parent_id": "t3_s3r7bx",
            "score": 2,
            "created_utc": 1642259903.0,
            "replies": []
        },
        {
            "body": "I don’t really know what to say, I just want to wish you all the best. I’m so so sorry this has happened to you 💕",
            "author": "misssandyshores",
            "id": "hssih2u",
            "parent_id": "t3_s3r7bx",
            "score": 2,
            "created_utc": 1642269420.0,
            "replies": []
        },
        {
            "body": "Mine was 70 when it happened. Then the gov't locked us out of work for 18 months. I went from top 1% taxpayer in my county to homeless. You need a network of guys who will support you through thick and thin. One is not enough.",
            "author": "KitehDotNet",
            "id": "hsntcbb",
            "parent_id": "t3_s3r7bx",
            "score": 1,
            "created_utc": 1642185398.0,
            "replies": [
                {
                    "body": "I guess I’m finding that out. But I enjoyed him a lot and didn’t want to seek anything else. But that’s rough, I hope you’re doing better now",
                    "author": "Delicious_Yam7323",
                    "id": "hso5lmh",
                    "parent_id": "t1_hsntcbb",
                    "score": 2,
                    "created_utc": 1642190171.0,
                    "replies": []
                },
                {
                    "body": "And you saved none of that income? Sds need to reach you sbs to invest and you sbs need to listen.",
                    "author": "deffekt22",
                    "id": "hsp2byj",
                    "parent_id": "t1_hsntcbb",
                    "score": 2,
                    "created_utc": 1642203163.0,
                    "replies": [
                        {
                            "body": "None of your business. Have a nice day.",
                            "author": "KitehDotNet",
                            "id": "hspmpwf",
                            "parent_id": "t1_hsp2byj",
                            "score": 2,
                            "created_utc": 1642212282.0,
                            "replies": [
                                {
                                    "body": "Ya figured as much.",
                                    "author": "deffekt22",
                                    "id": "hspq2uk",
                                    "parent_id": "t1_hspmpwf",
                                    "score": 0,
                                    "created_utc": 1642213829.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I'm really sorry to hear this... and sorry for what you're going through. It's very, very tough. Unfortunately, I can relate; I went through the exact same thing, though of course, the other way around.\n\nBut I did go to the memorial service, and I'm very very glad I did. In fact, I wrote about it:\n\n[https://www.reddit.com/r/sugarlifestyleforum/comments/d5bt5n/not\\_your\\_typical\\_sdsb\\_story/](https://www.reddit.com/r/sugarlifestyleforum/comments/d5bt5n/not_your_typical_sdsb_story/)\n\nDo exactly what feels right to you. If it's part of your journey and your healing process, you're entitled to it.\n\nHollow words for the moment, but trust me... time heals all wounds. It feels like complete despair today, but it'll get better.",
            "author": "SD_throwaway222",
            "id": "hsnuoel",
            "parent_id": "t3_s3r7bx",
            "score": 1,
            "created_utc": 1642185924.0,
            "replies": [
                {
                    "body": "Wow. Thank you so much and I’m sorry for your loss as well",
                    "author": "Delicious_Yam7323",
                    "id": "hso5pk0",
                    "parent_id": "t1_hsnuoel",
                    "score": 1,
                    "created_utc": 1642190212.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Do you know what he did? Like if he was a teacher/professor of some kind maybe you could say you were a student he was close with or something... or maybe say you worked with him idk.",
            "author": "panda_person666",
            "id": "hsmy1hq",
            "parent_id": "t3_s3r7bx",
            "score": -3,
            "created_utc": 1642173351.0,
            "replies": []
        },
        {
            "body": "Just curious how did you find out? I know if I were to pass my SB would probably think I ghosted her because no one knows about her",
            "author": "saltgrindr",
            "id": "hsnqkyg",
            "parent_id": "t3_s3r7bx",
            "score": 1,
            "created_utc": 1642184324.0,
            "replies": [
                {
                    "body": "I did think he was ghosting me & I was starting to get really hurt. I looked at his Facebook. Horrible.",
                    "author": "Delicious_Yam7323",
                    "id": "hso5ea1",
                    "parent_id": "t1_hsnqkyg",
                    "score": 2,
                    "created_utc": 1642190093.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I'm so sorry for your loss. But please attend his viewing at least for your own closure. No one needs to know who you are. If anyone asks and depending what business he was in, just say he was doing something pertaining to his business. Or just walk away, regardless of what you do or say, just go. He would want you to be there.",
            "author": "Automatic_Joke_4414",
            "id": "hsnv6t6",
            "parent_id": "t3_s3r7bx",
            "score": 1,
            "created_utc": 1642186137.0,
            "replies": []
        },
        {
            "body": "I'm sorry for your loss. Being brought up with part of the family in the Funeral Business, I would most definitely go to the wake. While customary to pay respects to the family, you can just sit and reflect. You won't be bothered. The choice lies with you.",
            "author": "FoolishTimes",
            "id": "hsoaxnr",
            "parent_id": "t3_s3r7bx",
            "score": 1,
            "created_utc": 1642192223.0,
            "replies": []
        },
        {
            "body": "I’m sorry you’re going through this.\n\nSince he was your sole source of income, my question is what were you doing before he came along?",
            "author": "iwishyouwo0d",
            "id": "hsojxm5",
            "parent_id": "t3_s3r7bx",
            "score": 1,
            "created_utc": 1642195687.0,
            "replies": [
                {
                    "body": "College. And my parents never made me work in high school which I’m beginning to resent them for. But, not helpful at this point. I got to LA with the help of my step father who also passed away last year but from covid. He helped with expenses and rent too until he passed.",
                    "author": "Delicious_Yam7323",
                    "id": "hsp6rse",
                    "parent_id": "t1_hsojxm5",
                    "score": 1,
                    "created_utc": 1642205072.0,
                    "replies": [
                        {
                            "body": "I wouldn’t make my child work in high school unless they wanted to - they will literally have a lifetime full of work. Let them enjoy their freedom from adult responsibilities, because once those begin they don’t end.\n\nSorry to hear about all the loss you have suffered in the recent times of those close to you. \n\nJust remember there is a solution to every problem. Focus only on finding those solutions and navigating your new normal rather than sulking in what you cannot change which is the past/what’s already happened. I’m not telling you not to grieve, but life & bills do not stop regardless of what we are experiencing and you have to be a fighter. It will honestly get better, depending on what/how much you put into it - it can either be something that happens rather quickly or take a long time - it’s all dependent upon your dedication to changing your circumstances.",
                            "author": "iwishyouwo0d",
                            "id": "hspayx0",
                            "parent_id": "t1_hsp6rse",
                            "score": 2,
                            "created_utc": 1642206944.0,
                            "replies": [
                                {
                                    "body": "Yeah totally. Thank you",
                                    "author": "Delicious_Yam7323",
                                    "id": "hspioi9",
                                    "parent_id": "t1_hspayx0",
                                    "score": 1,
                                    "created_utc": 1642210431.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I’m so sorry for your loss. 🥺❤️",
            "author": "Lil_fireball_420",
            "id": "hsp0jwp",
            "parent_id": "t3_s3r7bx",
            "score": 1,
            "created_utc": 1642202410.0,
            "replies": [
                {
                    "body": "Thank you",
                    "author": "Delicious_Yam7323",
                    "id": "hsp6sfl",
                    "parent_id": "t1_hsp0jwp",
                    "score": 1,
                    "created_utc": 1642205079.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I’m so sorry for your loss. Restaurants are currently hiring and would be a good place to start.",
            "author": null,
            "id": "hsp7ui4",
            "parent_id": "t3_s3r7bx",
            "score": 1,
            "created_utc": 1642205549.0,
            "replies": [
                {
                    "body": "Thanks",
                    "author": "Delicious_Yam7323",
                    "id": "hspirva",
                    "parent_id": "t1_hsp7ui4",
                    "score": 1,
                    "created_utc": 1642210473.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Terribly sorry for your loss.  Dealing with death is difficult.  I can’t say we get any better at it as we get older but we just get some experience with it.  It can be comforting to go to his grave site and talk to him.  I’ve done that with parents and friends I’ve lost.  Don’t worry about crying, screaming or yelling there lots of people do that you’ll likely blend right in.  I cried for hours when visiting my dads grave the first time.  The important thing is for you to acknowledge and experience the grief in whatever form that works for you.  You’ve lost an intimate partner, that is never easy.",
            "author": "RedHeavyG603",
            "id": "hspcn9b",
            "parent_id": "t3_s3r7bx",
            "score": 1,
            "created_utc": 1642207698.0,
            "replies": [
                {
                    "body": "Yeah, I will at some point once everything doesn’t feel so overwhelming. It is incredibly hard and I wasn’t prepared at all, not that I ever possibly could have been. Thank you",
                    "author": "Delicious_Yam7323",
                    "id": "hspizus",
                    "parent_id": "t1_hspcn9b",
                    "score": 2,
                    "created_utc": 1642210575.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I just had a really close sd of mine pass away from cancer. He found out and passed away within 2 months, it was pancreatic cancer. He’d just sent me a photo of him not even 2 weeks before and he looked fine.. I messaged him one morning like normal, and I didn’t get a reply which wasn’t really typical of him. Got a text the next afternoon from his SIL, that he’d passed away unexpectedly in his sleep and that she was deleting my messages so his sons wouldn’t see it. His wife passed away of the same type of cancer a few years before. I ended up getting a call from his son as well telling me the news. Turns out that he’d requested in his letter to his son, that I be notified. It gave me a bit of closure. But it definitely hit like a ton of bricks bc he was just genuinely a really nice guy. Only ever wanted private  ‘dances’, (we met at the club) and helped me out so much so I understand how you feel in that aspect as well, bc he my main income at the time. I was also welcome to the funeral but it was out of town and it just wasn’t possible, I know he would understand so I didn’t feel to much guilt about that. I also felt it was the respectful thing not to go anyways. I never have had anyone really close to me pass away other than a uncle when I was in middle school & my great grandpa recently. So it definitely wasn’t an easy pill to swallow. I hope you’ve been doing okay, and that you find some peace.",
            "author": "Desperate_timess",
            "id": "hwhrflu",
            "parent_id": "t3_s3r7bx",
            "score": 1,
            "created_utc": 1644579599.0,
            "replies": []
        },
        {
            "body": "I’m really sorry that happened to you. I hate cars. Thank you for that advice, I hadn’t thought to do that even though it seems obvious.",
            "author": "Delicious_Yam7323",
            "id": "hsmdxde",
            "parent_id": "t1_hsmd4b5",
            "score": 40,
            "created_utc": 1642164146.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "hsme87b",
            "parent_id": "t1_hsmd4b5",
            "score": 13,
            "created_utc": 1642164321.0,
            "replies": [
                {
                    "body": "It was a complete shock.  The girl that introduced us a few months before, was always jealous that her and I had hit it off so well.  She stayed friends with the SB, and was the one to call and tell me.  I had just talked to SB the night before, after midnite, coming back from a business dinner, she wanted me to come get her.  I knew she was leaving early next morning for a trip, we decided, to wait until she returned.\n\nI blamed myself a bit, thinking at the time, if I had went to get her, it might have changed things.  Later, I came to accept, that when it is your day/time to go, there is nothing a mortal being can do to change it, its simply your time.  I think about her often, and am glad for the few months we had.\n\nOP, I am sad for you too, I'll share one more tidbit that I hope can help you.  I went into a bit of a funk after SB passed.  A few weeks later, I met the best SB I ever had.  I would probably not have met her and had the two years with her I did, if I was spending it with the deceased SB.  I hope you find another special someone somewhere soon.  Life closes one door, and opens others.  We have to lift our heads up though, to see the paths and make the choices.",
                    "author": "YourBadDecision",
                    "id": "hsmflrm",
                    "parent_id": "t1_hsme87b",
                    "score": 21,
                    "created_utc": 1642165092.0,
                    "replies": [
                        {
                            "body": "Yeah. I’m sure I will eventually, it’s just hard to consider meeting someone even in the far future right now. Thank you.",
                            "author": "Delicious_Yam7323",
                            "id": "hsmj6kc",
                            "parent_id": "t1_hsmflrm",
                            "score": 7,
                            "created_utc": 1642166928.0,
                            "replies": []
                        },
                        {
                            "body": ">OP, I am sad for you too, I'll share one more tidbit that I hope can help you.  I went into a bit of a funk after SB passed.  A few weeks later, I met the best SB I ever had.  I would probably not have met her and had the two years with her I did, if I was spending it with the deceased SB.\n\nSir, I am very sorry for the obvious pain that you went through. I know this “tidbit” you are sharing has a positive intention, but that is the harshest “things have a way of working out” anecdote I have ever heard. \n\nWoof.",
                            "author": "ThrowawayUserID1501",
                            "id": "hsp351u",
                            "parent_id": "t1_hsmflrm",
                            "score": 8,
                            "created_utc": 1642203504.0,
                            "replies": [
                                {
                                    "body": "So much this. My SB who meant the world to me died. So I grieved for a week and went on with my life. I’ve had meals that lasted longer than his grief",
                                    "author": "kb1323",
                                    "id": "hspckum",
                                    "parent_id": "t1_hsp351u",
                                    "score": 5,
                                    "created_utc": 1642207668.0,
                                    "replies": [
                                        {
                                            "body": "Just remember that everyone grieves differently and grief should not take over the rest of your life.",
                                            "author": "Sendatsu69",
                                            "id": "ht1ifus",
                                            "parent_id": "t1_hspckum",
                                            "score": 2,
                                            "created_utc": 1642430222.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "Odd question but usually people are pretty close in SR. Like, have keys to the apartment, love their dog (pets) In these situations do you not go back over and collect items or check on the pets due to friends / family? (Like for example if you know her mom hates the dog, she passes, and you have a key why wouldn’t you just go check on the apartment & get the dog? Or is that not okay? What about all the photos together? Mementos? 😬😅 asking for a friend)",
                            "author": null,
                            "id": "hsohkto",
                            "parent_id": "t1_hsmflrm",
                            "score": 3,
                            "created_utc": 1642194779.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Sorry, this is a bit insensitive but I'm amused by imagining:\n\n\"Sorry for your loss Mr. and Mrs. Jones, I'm your daughter's john.\"",
            "author": "Anoonnyymmoous",
            "id": "hsne9za",
            "parent_id": "t1_hsmd4b5",
            "score": -3,
            "created_utc": 1642179662.0,
            "replies": []
        },
        {
            "body": "I’m definitely not going to go. His wife seems super sweet from what I know about her and I know they loved each other a lot. Not risking it.",
            "author": "Delicious_Yam7323",
            "id": "hso4ini",
            "parent_id": "t1_hsnq5to",
            "score": 11,
            "created_utc": 1642189765.0,
            "replies": []
        },
        {
            "body": "I quit my therapist like 2 weeks ago because I didn’t feel like we were gelling.. I also felt the happiest I’ve ever felt. May consider getting a new therapist, I just hate the initial meeting and talking about my childhood etc. As of right now, this subreddit is my emotional support.",
            "author": "Delicious_Yam7323",
            "id": "hsmkeh9",
            "parent_id": "t1_hsmet3f",
            "score": 7,
            "created_utc": 1642167507.0,
            "replies": [
                {
                    "body": "An online forum of strangers, as good as it can be, is in no way sufficient as a source of emotional support in crisis. Right now you need to see a counselor/therapist in person, you can skip the childhood stuff and talk about your situation as it's your therapy. Do that first.\n\nHow is your support system in LA and further afield? I know you haven't discussed your situation but do you have close bonds with people you could rely on to bring it up?\n\nBecause your job right now is processing and getting through the next 1-2 weeks. I get that you have other things to deal with and figure out but if it's at all possible I'd try to reduce the cognitive load on yourself and just make it through, walk your dogs, talk to people, cry. I and probably many other people will be happy to help you figure out your next steps later, but I very much doubt you're in a good place to make good decisions right now.",
                    "author": "SBerryTrifle",
                    "id": "hsnwo3l",
                    "parent_id": "t1_hsmkeh9",
                    "score": 3,
                    "created_utc": 1642186729.0,
                    "replies": [
                        {
                            "body": "That’s what I’m saying. I don’t even know if I could make it through a job interview right now. It’s just stressful. I don’t have a ton of friends in LA. But I’m debating telling my roommate. I’m just dreading it.. telling her I’ve been SBing and then that my SD he died seems like a lot. But she’s also not dumb and will figure out I’m not doing well so I’ll probably tell her",
                            "author": "Delicious_Yam7323",
                            "id": "hso4bqj",
                            "parent_id": "t1_hsnwo3l",
                            "score": 2,
                            "created_utc": 1642189691.0,
                            "replies": [
                                {
                                    "body": "You could say that he was a mentor and that he died, and that you had come to care about him. You don't have to say that he was giving you allowances or that there was a romantic element to your relationshp.",
                                    "author": "emptyoverflow",
                                    "id": "hso59ut",
                                    "parent_id": "t1_hso4bqj",
                                    "score": 7,
                                    "created_utc": 1642190047.0,
                                    "replies": []
                                },
                                {
                                    "body": "Please see a therapist today and talk to someone you know and trust. If you're pretty confident your roommate is trustworthy then go for it. Put the rest of it out of your mind for the next week or two as worrying about it right now won't help.",
                                    "author": "SBerryTrifle",
                                    "id": "hsohlf2",
                                    "parent_id": "t1_hso4bqj",
                                    "score": 2,
                                    "created_utc": 1642194785.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I’m definitely not going.",
            "author": "Delicious_Yam7323",
            "id": "hso3v7c",
            "parent_id": "t1_hsn3gco",
            "score": 5,
            "created_utc": 1642189516.0,
            "replies": []
        },
        {
            "body": "Sorry funerals weren’t great for you but e1 handles grief different. It may be just right for her.",
            "author": "gvsulaker82",
            "id": "hsn6off",
            "parent_id": "t1_hsn3gco",
            "score": 4,
            "created_utc": 1642176747.0,
            "replies": [
                {
                    "body": "Something Ive done in the past to avoid people, and just me, what I did: i called the funeral home and requested a private few minutes the night prior to say my goodbyes.  That was done to avoid family.\n\nMy condolences and prayers to you and I wish you all the best. :/",
                    "author": null,
                    "id": "hsndb5i",
                    "parent_id": "t1_hsn6off",
                    "score": 7,
                    "created_utc": 1642179290.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "And I’m sorry that all happened to you. Funerals suck",
            "author": "Delicious_Yam7323",
            "id": "hso3wwh",
            "parent_id": "t1_hsn3gco",
            "score": 1,
            "created_utc": 1642189533.0,
            "replies": []
        },
        {
            "body": "Thank you. I feel like he would’ve had a plan in place if he was unhealthy or older but this was so unexpected. The financial stress of it all/looking for a job on top of it is horrible. Do you know anywhere in particular? I’m in Los Angeles. I don’t have a degree and I despise cafe work/restaurants etc. I also have 2 dogs that I hate being away from so was hoping to find a work from home job, but don’t know if that’s my best bet seeing as I have no experience. I’m capable and I’m smart but I really feel liked I’ve fucked myself over and didn’t realize it until now.",
            "author": "Delicious_Yam7323",
            "id": "hsmlf1r",
            "parent_id": "t1_hsmehcc",
            "score": 3,
            "created_utc": 1642167977.0,
            "replies": [
                {
                    "body": "So sorry for your loss, \n\nYou didn't screw yourself per se, we all get comfortable with life at different points and lift sends us gut punches.\n\nYes you could have been investing in yourself which is what most SD want to see and do but no judgements when you dont.\n\nWork at home can work for some customer service roles ,  Lucky for you no one wants to work right now, so the world is your oyster.  Even gas stations are paying $15 an hour.  No benefits though usually, a therapist is usually expensive so you may want to put that on hold if you can manage.\n\nThe job hunt and job will take your mind off the loss. So hop to it. \n\nI would still go to funeral you can sit and back and sneak out you dont have to say anything more than I work with him once or white lie how you met but thst he helped you in some way and you are forever grateful like you are.\n\nNever have sugar be you only source of income, it changes the dynamics and your independence, \n\nAnd you should make a emergency fund your first goal with job, ie 6 ,,months of expenses, its hard but you will appreciate the sence of security once achieved.\n\nWhat I can tell you from experience, time heals the hurt. And distraction is American passtime cause it works.\n\nVirtual hugs",
                    "author": "Momopllc",
                    "id": "hsncyvn",
                    "parent_id": "t1_hsmlf1r",
                    "score": 1,
                    "created_utc": 1642179159.0,
                    "replies": [
                        {
                            "body": "Yeah. Definitely learning from this experience. I just didn’t have to work and I didn’t want to. Regretting it now. Thank you",
                            "author": "Delicious_Yam7323",
                            "id": "hso5z6e",
                            "parent_id": "t1_hsncyvn",
                            "score": 1,
                            "created_utc": 1642190314.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "How about dog walking/sitting?",
                    "author": "Letmehearyourhaikus",
                    "id": "hsnq56u",
                    "parent_id": "t1_hsmlf1r",
                    "score": 1,
                    "created_utc": 1642184158.0,
                    "replies": [
                        {
                            "body": "Yeah, I’m trying to find house sitting jobs through a friend.",
                            "author": "Delicious_Yam7323",
                            "id": "hso612n",
                            "parent_id": "t1_hsnq56u",
                            "score": 1,
                            "created_utc": 1642190335.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Thank you",
            "author": "Delicious_Yam7323",
            "id": "hso4dsl",
            "parent_id": "t1_hsmv775",
            "score": 1,
            "created_utc": 1642189713.0,
            "replies": []
        },
        {
            "body": "I understand this but I’m a big crier and I feel like people would find it odd that a girl as young as I am is hurt over a man I “helped at men’s warehouse” or something. I don’t want people who are already hurt to hurt more if they did suspect something strange. He and his wife had a really wonderful relationship, it was just sexless and she wasn’t up for more adventure but I know they really loved each other.",
            "author": "Delicious_Yam7323",
            "id": "hsmlu8d",
            "parent_id": "t1_hsmh38r",
            "score": 17,
            "created_utc": 1642168172.0,
            "replies": [
                {
                    "body": "Or maybe go and just sit in your car in the lot. Just being nearby may help a little",
                    "author": "mraspencer",
                    "id": "hsmsrsl",
                    "parent_id": "t1_hsmlu8d",
                    "score": 5,
                    "created_utc": 1642171215.0,
                    "replies": []
                },
                {
                    "body": "Don't worry about it. Really. If you sit in the back, you'll probably be out the door before anyone turns around and notices you. And if you're crying anyway, no one's going to push you with questions.",
                    "author": null,
                    "id": "hsmnzp3",
                    "parent_id": "t1_hsmlu8d",
                    "score": -1,
                    "created_utc": 1642169142.0,
                    "replies": [
                        {
                            "body": "Why do you think that? If my dad or husband passed away and there was some young girl there crying I would definitely want to know who she was and why she was there.",
                            "author": "WestCoastCompanion",
                            "id": "hsp32g5",
                            "parent_id": "t1_hsmnzp3",
                            "score": 4,
                            "created_utc": 1642203473.0,
                            "replies": [
                                {
                                    "body": "You might want to know who she was, but to what extent would you pursue and harass someone who left immediately after the funeral service and was crying, while you had your own family around you?",
                                    "author": null,
                                    "id": "hspg8dq",
                                    "parent_id": "t1_hsp32g5",
                                    "score": -1,
                                    "created_utc": 1642209330.0,
                                    "replies": [
                                        {
                                            "body": "Pursue and harass? Are you suggesting she run away? And add drama and more confusion and emotional burden to an already bereft family? And yes, for my mothers sake/childrens sake/own sake yes I would want to know who they were and what they were doing there. You’re not going to just release this huge mystery on my family that we’ll have to wonder about forever, especially durring a funeral. Advising this young lady that people won’t be inclined to demand an explanation is foolish. To do that to a grieving family would be really selfish. I understand she would like to be there, but she just can’t. These are the sacrifices we make when we engage in these types of arrangements.",
                                            "author": "WestCoastCompanion",
                                            "id": "hsrytb7",
                                            "parent_id": "t1_hspg8dq",
                                            "score": 2,
                                            "created_utc": 1642261673.0,
                                            "replies": [
                                                {
                                                    "body": ">Are you suggesting she run away?\n\nNo. I'm suggesting that she sit at the back of the church and leave as soon as the service is concluded. Are you going to spot her and sprint to the back of the church just as the service concludes because you don't recognize her?",
                                                    "author": null,
                                                    "id": "hss3wdc",
                                                    "parent_id": "t1_hsrytb7",
                                                    "score": 0,
                                                    "created_utc": 1642263741.0,
                                                    "replies": [
                                                        {
                                                            "body": "Well she says she’s “a big cryer” so if that’s the case she would be creating a scene and drawing attention to herself, so yes. \nAlso, if you read the OP’s comments, you see he had a very good relationship with his wife. There’s no need to selfishly disrespect her and their relationship like this. I feel like you’re just arguing for arguments sake because there’s no way any sane person would think this is a good idea. I’m sure she also loved and respected him too much to risk exposing him after he’s passed.",
                                                            "author": "WestCoastCompanion",
                                                            "id": "hstp453",
                                                            "parent_id": "t1_hss3wdc",
                                                            "score": 2,
                                                            "created_utc": 1642286408.0,
                                                            "replies": [
                                                                {
                                                                    "body": "You've ignored my question:\n\n>Are you going to spot her and sprint to the back of the church just as the service concludes because you don't recognize her?\n\nI knew fewer than half of the people at my father's funeral, and made no effort to identify the ones I didn't know. I was grateful for the support.\n\nMoving on:\n\n>I feel like you’re just arguing for arguments sake because there’s no way any sane person would think this is a good idea.\n\nApparently, then, judging from other comments, I'm not the only person here who's not sane. Not very tolerant of opinions that are different from yours, are you . . . .\n\nFeel free to take the last word, if you like; I won't respond to you again.",
                                                                    "author": null,
                                                                    "id": "hstu84c",
                                                                    "parent_id": "t1_hstp453",
                                                                    "score": 0,
                                                                    "created_utc": 1642288509.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "I didn’t ignore your question, it literally says yes in the first sentence if you’d bothered to read it. I’m sure you wouldn’t, but as you must be aware, women and men react very differently to the same situations. I’m sure most men couldn’t care less or would already assume. However, if the wife noticed her, and especially if she has a daughter or sister, I can assure you the daughter or sister will absolutely get to the bottom of it for her sake, not just say “oh well, just ignore the random 20 year old girl sobbing at the back of your late husbands funeral. I’m sure it’s nothing” \nIt’s almost like you know absolutely nothing about women at all.",
                                                                            "author": "WestCoastCompanion",
                                                                            "id": "hsu11ka",
                                                                            "parent_id": "t1_hstu84c",
                                                                            "score": 1,
                                                                            "created_utc": 1642291337.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": ">I didn’t ignore your question, it literally says yes in the first sentence if you’d bothered to read it.\n\nYou are correct. You gave a very qualified answer, but, true, you didn't ignore my question. I was wrong on that point.",
                                                                                    "author": null,
                                                                                    "id": "hsu1iv9",
                                                                                    "parent_id": "t1_hsu11ka",
                                                                                    "score": 1,
                                                                                    "created_utc": 1642291535.0,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Good girl. I know it’s hard, but these are the sacrifices we make. Hang in there. Msg me anytime if you need someone to talk to.",
                    "author": "WestCoastCompanion",
                    "id": "hsrz0bo",
                    "parent_id": "t1_hsmlu8d",
                    "score": 1,
                    "created_utc": 1642261755.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I also encourage you to go to the funeral or visit his grave. These rites play a role in closure and, in my experience, no one will question it if you sit in the back. With COVID, entry may be more of an issue, so keep that in mind I guess. \n\nSomeone very close to me widowed very young. It's been a few years and she still has good days and bad days about it. Give yourself time to grieve but remember your SD would want you to keep living and loving. \n\nFinally, best of luck finding a new source of income. In most of the US at least, there's a high demand for workers. You could take on something temporary while you mourn and until you find your next SD.",
            "author": "ValarHTX",
            "id": "hsmjjxx",
            "parent_id": "t1_hsmh38r",
            "score": 6,
            "created_utc": 1642167106.0,
            "replies": []
        },
        {
            "body": "Totally agree. I don't know why people are so weird about attending funerals. Unless you're making a big scene or TRYING to get noticed, its extremely unlikely anyone would notice or care. I've attended funerals of people I hardly knew. If someone asks just say you knew him from work. Just don't act weird and things go fine. No one is going to push to know bunches of details....they are too busy w their grief to care.",
            "author": "clair-cummings",
            "id": "hsmiwvl",
            "parent_id": "t1_hsmh38r",
            "score": 0,
            "created_utc": 1642166797.0,
            "replies": []
        },
        {
            "body": "Thanks",
            "author": "Delicious_Yam7323",
            "id": "hso4d5z",
            "parent_id": "t1_hsmjrsy",
            "score": 1,
            "created_utc": 1642189706.0,
            "replies": []
        },
        {
            "body": "Thanks, I appreciate it.",
            "author": "Delicious_Yam7323",
            "id": "hso4fml",
            "parent_id": "t1_hsn9b5p",
            "score": 1,
            "created_utc": 1642189732.0,
            "replies": []
        },
        {
            "body": "Thank you",
            "author": "Delicious_Yam7323",
            "id": "hso4s6f",
            "parent_id": "t1_hsmml3x",
            "score": 2,
            "created_utc": 1642189864.0,
            "replies": []
        },
        {
            "body": "Thank you so much",
            "author": "Delicious_Yam7323",
            "id": "hso4vax",
            "parent_id": "t1_hsmvsp4",
            "score": 1,
            "created_utc": 1642189896.0,
            "replies": []
        },
        {
            "body": "Thanks a lot. I’m debating trying to make greeting cards. I’ve always made them for my family and friends but I feel like they could do well. Who knows.",
            "author": "Delicious_Yam7323",
            "id": "hso5295",
            "parent_id": "t1_hsn6qh2",
            "score": 2,
            "created_utc": 1642189968.0,
            "replies": [
                {
                    "body": "You’re welcome. That sounds like something that could help uplift your spirits! I hope it goes well, maybe put on some of your favorite music too. Sending hugs and love 💓",
                    "author": "No-Bass3542",
                    "id": "hsoh9uj",
                    "parent_id": "t1_hso5295",
                    "score": 1,
                    "created_utc": 1642194661.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Not overstepping. Thanks for taking the time to write this out.",
            "author": "Delicious_Yam7323",
            "id": "hso5bdr",
            "parent_id": "t1_hsnc4lq",
            "score": 2,
            "created_utc": 1642190063.0,
            "replies": []
        },
        {
            "body": "Didn’t even think about that but yeah, I plan not to go. Thank you",
            "author": "Delicious_Yam7323",
            "id": "hso4r4h",
            "parent_id": "t1_hsnq5jk",
            "score": 1,
            "created_utc": 1642189853.0,
            "replies": []
        },
        {
            "body": "I completely agree and that is the plan. Thank you",
            "author": "Delicious_Yam7323",
            "id": "hso5grb",
            "parent_id": "t1_hsntczx",
            "score": 2,
            "created_utc": 1642190120.0,
            "replies": []
        },
        {
            "body": "I could not agree more.",
            "author": "iwishyouwo0d",
            "id": "hsojjxd",
            "parent_id": "t1_hsntczx",
            "score": 1,
            "created_utc": 1642195541.0,
            "replies": []
        },
        {
            "body": "Thank you",
            "author": "Delicious_Yam7323",
            "id": "hspiipj",
            "parent_id": "t1_hso1sc3",
            "score": 2,
            "created_utc": 1642210359.0,
            "replies": []
        },
        {
            "body": "Thank you",
            "author": "Delicious_Yam7323",
            "id": "hspifyb",
            "parent_id": "t1_hsohwoq",
            "score": 2,
            "created_utc": 1642210325.0,
            "replies": []
        },
        {
            "body": "Thank you ❤️",
            "author": "Delicious_Yam7323",
            "id": "hspir61",
            "parent_id": "t1_hsp615f",
            "score": 2,
            "created_utc": 1642210464.0,
            "replies": []
        },
        {
            "body": "Thank you",
            "author": "Delicious_Yam7323",
            "id": "hspiszi",
            "parent_id": "t1_hsp933o",
            "score": 1,
            "created_utc": 1642210487.0,
            "replies": []
        },
        {
            "body": "I thought he was ghosting me which would be so unlike him so I was really hurt. Then after 2 days I looked on his Facebook and found out there. It was horrible. I wanted to talk to him and turn to HIM to mourn & get some sort of comfort over HIS death. Such a weird feeling which I’m sure is common when you lose someone close to you. \n\nI couldn’t agree more about the job thing. I’ve gotten a lot of flack for not having another source of income but if I could not work, enjoy my life and spend it with him and my dogs- why would I work a cafe job that I dread? I do regret not having something though. I’m sorry you’re dealing with that, it sucks. \n\nI have considered a new SD, but I wouldn’t feel comfortable being sexual right now and I feel most expect sex sooner than later. I could use a platonic sugar daddy, but it doesn’t seem realistic and I feel insensitive and it feels wrong if I seek one out at this time. \n\nCompletely agree about the funeral.\nThanks for replying ❤️",
            "author": "Delicious_Yam7323",
            "id": "hspugot",
            "parent_id": "t1_hspn9k4",
            "score": 2,
            "created_utc": 1642215907.0,
            "replies": []
        },
        {
            "body": "I guess I’m finding that out. But I enjoyed him a lot and didn’t want to seek anything else. But that’s rough, I hope you’re doing better now",
            "author": "Delicious_Yam7323",
            "id": "hso5lmh",
            "parent_id": "t1_hsntcbb",
            "score": 2,
            "created_utc": 1642190171.0,
            "replies": []
        },
        {
            "body": "And you saved none of that income? Sds need to reach you sbs to invest and you sbs need to listen.",
            "author": "deffekt22",
            "id": "hsp2byj",
            "parent_id": "t1_hsntcbb",
            "score": 2,
            "created_utc": 1642203163.0,
            "replies": [
                {
                    "body": "None of your business. Have a nice day.",
                    "author": "KitehDotNet",
                    "id": "hspmpwf",
                    "parent_id": "t1_hsp2byj",
                    "score": 2,
                    "created_utc": 1642212282.0,
                    "replies": [
                        {
                            "body": "Ya figured as much.",
                            "author": "deffekt22",
                            "id": "hspq2uk",
                            "parent_id": "t1_hspmpwf",
                            "score": 0,
                            "created_utc": 1642213829.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Wow. Thank you so much and I’m sorry for your loss as well",
            "author": "Delicious_Yam7323",
            "id": "hso5pk0",
            "parent_id": "t1_hsnuoel",
            "score": 1,
            "created_utc": 1642190212.0,
            "replies": []
        },
        {
            "body": "I did think he was ghosting me & I was starting to get really hurt. I looked at his Facebook. Horrible.",
            "author": "Delicious_Yam7323",
            "id": "hso5ea1",
            "parent_id": "t1_hsnqkyg",
            "score": 2,
            "created_utc": 1642190093.0,
            "replies": []
        },
        {
            "body": "College. And my parents never made me work in high school which I’m beginning to resent them for. But, not helpful at this point. I got to LA with the help of my step father who also passed away last year but from covid. He helped with expenses and rent too until he passed.",
            "author": "Delicious_Yam7323",
            "id": "hsp6rse",
            "parent_id": "t1_hsojxm5",
            "score": 1,
            "created_utc": 1642205072.0,
            "replies": [
                {
                    "body": "I wouldn’t make my child work in high school unless they wanted to - they will literally have a lifetime full of work. Let them enjoy their freedom from adult responsibilities, because once those begin they don’t end.\n\nSorry to hear about all the loss you have suffered in the recent times of those close to you. \n\nJust remember there is a solution to every problem. Focus only on finding those solutions and navigating your new normal rather than sulking in what you cannot change which is the past/what’s already happened. I’m not telling you not to grieve, but life & bills do not stop regardless of what we are experiencing and you have to be a fighter. It will honestly get better, depending on what/how much you put into it - it can either be something that happens rather quickly or take a long time - it’s all dependent upon your dedication to changing your circumstances.",
                    "author": "iwishyouwo0d",
                    "id": "hspayx0",
                    "parent_id": "t1_hsp6rse",
                    "score": 2,
                    "created_utc": 1642206944.0,
                    "replies": [
                        {
                            "body": "Yeah totally. Thank you",
                            "author": "Delicious_Yam7323",
                            "id": "hspioi9",
                            "parent_id": "t1_hspayx0",
                            "score": 1,
                            "created_utc": 1642210431.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Thank you",
            "author": "Delicious_Yam7323",
            "id": "hsp6sfl",
            "parent_id": "t1_hsp0jwp",
            "score": 1,
            "created_utc": 1642205079.0,
            "replies": []
        },
        {
            "body": "Thanks",
            "author": "Delicious_Yam7323",
            "id": "hspirva",
            "parent_id": "t1_hsp7ui4",
            "score": 1,
            "created_utc": 1642210473.0,
            "replies": []
        },
        {
            "body": "Yeah, I will at some point once everything doesn’t feel so overwhelming. It is incredibly hard and I wasn’t prepared at all, not that I ever possibly could have been. Thank you",
            "author": "Delicious_Yam7323",
            "id": "hspizus",
            "parent_id": "t1_hspcn9b",
            "score": 2,
            "created_utc": 1642210575.0,
            "replies": []
        },
        {
            "body": "It was a complete shock.  The girl that introduced us a few months before, was always jealous that her and I had hit it off so well.  She stayed friends with the SB, and was the one to call and tell me.  I had just talked to SB the night before, after midnite, coming back from a business dinner, she wanted me to come get her.  I knew she was leaving early next morning for a trip, we decided, to wait until she returned.\n\nI blamed myself a bit, thinking at the time, if I had went to get her, it might have changed things.  Later, I came to accept, that when it is your day/time to go, there is nothing a mortal being can do to change it, its simply your time.  I think about her often, and am glad for the few months we had.\n\nOP, I am sad for you too, I'll share one more tidbit that I hope can help you.  I went into a bit of a funk after SB passed.  A few weeks later, I met the best SB I ever had.  I would probably not have met her and had the two years with her I did, if I was spending it with the deceased SB.  I hope you find another special someone somewhere soon.  Life closes one door, and opens others.  We have to lift our heads up though, to see the paths and make the choices.",
            "author": "YourBadDecision",
            "id": "hsmflrm",
            "parent_id": "t1_hsme87b",
            "score": 21,
            "created_utc": 1642165092.0,
            "replies": [
                {
                    "body": "Yeah. I’m sure I will eventually, it’s just hard to consider meeting someone even in the far future right now. Thank you.",
                    "author": "Delicious_Yam7323",
                    "id": "hsmj6kc",
                    "parent_id": "t1_hsmflrm",
                    "score": 7,
                    "created_utc": 1642166928.0,
                    "replies": []
                },
                {
                    "body": ">OP, I am sad for you too, I'll share one more tidbit that I hope can help you.  I went into a bit of a funk after SB passed.  A few weeks later, I met the best SB I ever had.  I would probably not have met her and had the two years with her I did, if I was spending it with the deceased SB.\n\nSir, I am very sorry for the obvious pain that you went through. I know this “tidbit” you are sharing has a positive intention, but that is the harshest “things have a way of working out” anecdote I have ever heard. \n\nWoof.",
                    "author": "ThrowawayUserID1501",
                    "id": "hsp351u",
                    "parent_id": "t1_hsmflrm",
                    "score": 8,
                    "created_utc": 1642203504.0,
                    "replies": [
                        {
                            "body": "So much this. My SB who meant the world to me died. So I grieved for a week and went on with my life. I’ve had meals that lasted longer than his grief",
                            "author": "kb1323",
                            "id": "hspckum",
                            "parent_id": "t1_hsp351u",
                            "score": 5,
                            "created_utc": 1642207668.0,
                            "replies": [
                                {
                                    "body": "Just remember that everyone grieves differently and grief should not take over the rest of your life.",
                                    "author": "Sendatsu69",
                                    "id": "ht1ifus",
                                    "parent_id": "t1_hspckum",
                                    "score": 2,
                                    "created_utc": 1642430222.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Odd question but usually people are pretty close in SR. Like, have keys to the apartment, love their dog (pets) In these situations do you not go back over and collect items or check on the pets due to friends / family? (Like for example if you know her mom hates the dog, she passes, and you have a key why wouldn’t you just go check on the apartment & get the dog? Or is that not okay? What about all the photos together? Mementos? 😬😅 asking for a friend)",
                    "author": null,
                    "id": "hsohkto",
                    "parent_id": "t1_hsmflrm",
                    "score": 3,
                    "created_utc": 1642194779.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "An online forum of strangers, as good as it can be, is in no way sufficient as a source of emotional support in crisis. Right now you need to see a counselor/therapist in person, you can skip the childhood stuff and talk about your situation as it's your therapy. Do that first.\n\nHow is your support system in LA and further afield? I know you haven't discussed your situation but do you have close bonds with people you could rely on to bring it up?\n\nBecause your job right now is processing and getting through the next 1-2 weeks. I get that you have other things to deal with and figure out but if it's at all possible I'd try to reduce the cognitive load on yourself and just make it through, walk your dogs, talk to people, cry. I and probably many other people will be happy to help you figure out your next steps later, but I very much doubt you're in a good place to make good decisions right now.",
            "author": "SBerryTrifle",
            "id": "hsnwo3l",
            "parent_id": "t1_hsmkeh9",
            "score": 3,
            "created_utc": 1642186729.0,
            "replies": [
                {
                    "body": "That’s what I’m saying. I don’t even know if I could make it through a job interview right now. It’s just stressful. I don’t have a ton of friends in LA. But I’m debating telling my roommate. I’m just dreading it.. telling her I’ve been SBing and then that my SD he died seems like a lot. But she’s also not dumb and will figure out I’m not doing well so I’ll probably tell her",
                    "author": "Delicious_Yam7323",
                    "id": "hso4bqj",
                    "parent_id": "t1_hsnwo3l",
                    "score": 2,
                    "created_utc": 1642189691.0,
                    "replies": [
                        {
                            "body": "You could say that he was a mentor and that he died, and that you had come to care about him. You don't have to say that he was giving you allowances or that there was a romantic element to your relationshp.",
                            "author": "emptyoverflow",
                            "id": "hso59ut",
                            "parent_id": "t1_hso4bqj",
                            "score": 7,
                            "created_utc": 1642190047.0,
                            "replies": []
                        },
                        {
                            "body": "Please see a therapist today and talk to someone you know and trust. If you're pretty confident your roommate is trustworthy then go for it. Put the rest of it out of your mind for the next week or two as worrying about it right now won't help.",
                            "author": "SBerryTrifle",
                            "id": "hsohlf2",
                            "parent_id": "t1_hso4bqj",
                            "score": 2,
                            "created_utc": 1642194785.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Something Ive done in the past to avoid people, and just me, what I did: i called the funeral home and requested a private few minutes the night prior to say my goodbyes.  That was done to avoid family.\n\nMy condolences and prayers to you and I wish you all the best. :/",
            "author": null,
            "id": "hsndb5i",
            "parent_id": "t1_hsn6off",
            "score": 7,
            "created_utc": 1642179290.0,
            "replies": []
        },
        {
            "body": "So sorry for your loss, \n\nYou didn't screw yourself per se, we all get comfortable with life at different points and lift sends us gut punches.\n\nYes you could have been investing in yourself which is what most SD want to see and do but no judgements when you dont.\n\nWork at home can work for some customer service roles ,  Lucky for you no one wants to work right now, so the world is your oyster.  Even gas stations are paying $15 an hour.  No benefits though usually, a therapist is usually expensive so you may want to put that on hold if you can manage.\n\nThe job hunt and job will take your mind off the loss. So hop to it. \n\nI would still go to funeral you can sit and back and sneak out you dont have to say anything more than I work with him once or white lie how you met but thst he helped you in some way and you are forever grateful like you are.\n\nNever have sugar be you only source of income, it changes the dynamics and your independence, \n\nAnd you should make a emergency fund your first goal with job, ie 6 ,,months of expenses, its hard but you will appreciate the sence of security once achieved.\n\nWhat I can tell you from experience, time heals the hurt. And distraction is American passtime cause it works.\n\nVirtual hugs",
            "author": "Momopllc",
            "id": "hsncyvn",
            "parent_id": "t1_hsmlf1r",
            "score": 1,
            "created_utc": 1642179159.0,
            "replies": [
                {
                    "body": "Yeah. Definitely learning from this experience. I just didn’t have to work and I didn’t want to. Regretting it now. Thank you",
                    "author": "Delicious_Yam7323",
                    "id": "hso5z6e",
                    "parent_id": "t1_hsncyvn",
                    "score": 1,
                    "created_utc": 1642190314.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "How about dog walking/sitting?",
            "author": "Letmehearyourhaikus",
            "id": "hsnq56u",
            "parent_id": "t1_hsmlf1r",
            "score": 1,
            "created_utc": 1642184158.0,
            "replies": [
                {
                    "body": "Yeah, I’m trying to find house sitting jobs through a friend.",
                    "author": "Delicious_Yam7323",
                    "id": "hso612n",
                    "parent_id": "t1_hsnq56u",
                    "score": 1,
                    "created_utc": 1642190335.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Or maybe go and just sit in your car in the lot. Just being nearby may help a little",
            "author": "mraspencer",
            "id": "hsmsrsl",
            "parent_id": "t1_hsmlu8d",
            "score": 5,
            "created_utc": 1642171215.0,
            "replies": []
        },
        {
            "body": "Don't worry about it. Really. If you sit in the back, you'll probably be out the door before anyone turns around and notices you. And if you're crying anyway, no one's going to push you with questions.",
            "author": null,
            "id": "hsmnzp3",
            "parent_id": "t1_hsmlu8d",
            "score": -1,
            "created_utc": 1642169142.0,
            "replies": [
                {
                    "body": "Why do you think that? If my dad or husband passed away and there was some young girl there crying I would definitely want to know who she was and why she was there.",
                    "author": "WestCoastCompanion",
                    "id": "hsp32g5",
                    "parent_id": "t1_hsmnzp3",
                    "score": 4,
                    "created_utc": 1642203473.0,
                    "replies": [
                        {
                            "body": "You might want to know who she was, but to what extent would you pursue and harass someone who left immediately after the funeral service and was crying, while you had your own family around you?",
                            "author": null,
                            "id": "hspg8dq",
                            "parent_id": "t1_hsp32g5",
                            "score": -1,
                            "created_utc": 1642209330.0,
                            "replies": [
                                {
                                    "body": "Pursue and harass? Are you suggesting she run away? And add drama and more confusion and emotional burden to an already bereft family? And yes, for my mothers sake/childrens sake/own sake yes I would want to know who they were and what they were doing there. You’re not going to just release this huge mystery on my family that we’ll have to wonder about forever, especially durring a funeral. Advising this young lady that people won’t be inclined to demand an explanation is foolish. To do that to a grieving family would be really selfish. I understand she would like to be there, but she just can’t. These are the sacrifices we make when we engage in these types of arrangements.",
                                    "author": "WestCoastCompanion",
                                    "id": "hsrytb7",
                                    "parent_id": "t1_hspg8dq",
                                    "score": 2,
                                    "created_utc": 1642261673.0,
                                    "replies": [
                                        {
                                            "body": ">Are you suggesting she run away?\n\nNo. I'm suggesting that she sit at the back of the church and leave as soon as the service is concluded. Are you going to spot her and sprint to the back of the church just as the service concludes because you don't recognize her?",
                                            "author": null,
                                            "id": "hss3wdc",
                                            "parent_id": "t1_hsrytb7",
                                            "score": 0,
                                            "created_utc": 1642263741.0,
                                            "replies": [
                                                {
                                                    "body": "Well she says she’s “a big cryer” so if that’s the case she would be creating a scene and drawing attention to herself, so yes. \nAlso, if you read the OP’s comments, you see he had a very good relationship with his wife. There’s no need to selfishly disrespect her and their relationship like this. I feel like you’re just arguing for arguments sake because there’s no way any sane person would think this is a good idea. I’m sure she also loved and respected him too much to risk exposing him after he’s passed.",
                                                    "author": "WestCoastCompanion",
                                                    "id": "hstp453",
                                                    "parent_id": "t1_hss3wdc",
                                                    "score": 2,
                                                    "created_utc": 1642286408.0,
                                                    "replies": [
                                                        {
                                                            "body": "You've ignored my question:\n\n>Are you going to spot her and sprint to the back of the church just as the service concludes because you don't recognize her?\n\nI knew fewer than half of the people at my father's funeral, and made no effort to identify the ones I didn't know. I was grateful for the support.\n\nMoving on:\n\n>I feel like you’re just arguing for arguments sake because there’s no way any sane person would think this is a good idea.\n\nApparently, then, judging from other comments, I'm not the only person here who's not sane. Not very tolerant of opinions that are different from yours, are you . . . .\n\nFeel free to take the last word, if you like; I won't respond to you again.",
                                                            "author": null,
                                                            "id": "hstu84c",
                                                            "parent_id": "t1_hstp453",
                                                            "score": 0,
                                                            "created_utc": 1642288509.0,
                                                            "replies": [
                                                                {
                                                                    "body": "I didn’t ignore your question, it literally says yes in the first sentence if you’d bothered to read it. I’m sure you wouldn’t, but as you must be aware, women and men react very differently to the same situations. I’m sure most men couldn’t care less or would already assume. However, if the wife noticed her, and especially if she has a daughter or sister, I can assure you the daughter or sister will absolutely get to the bottom of it for her sake, not just say “oh well, just ignore the random 20 year old girl sobbing at the back of your late husbands funeral. I’m sure it’s nothing” \nIt’s almost like you know absolutely nothing about women at all.",
                                                                    "author": "WestCoastCompanion",
                                                                    "id": "hsu11ka",
                                                                    "parent_id": "t1_hstu84c",
                                                                    "score": 1,
                                                                    "created_utc": 1642291337.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": ">I didn’t ignore your question, it literally says yes in the first sentence if you’d bothered to read it.\n\nYou are correct. You gave a very qualified answer, but, true, you didn't ignore my question. I was wrong on that point.",
                                                                            "author": null,
                                                                            "id": "hsu1iv9",
                                                                            "parent_id": "t1_hsu11ka",
                                                                            "score": 1,
                                                                            "created_utc": 1642291535.0,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Good girl. I know it’s hard, but these are the sacrifices we make. Hang in there. Msg me anytime if you need someone to talk to.",
            "author": "WestCoastCompanion",
            "id": "hsrz0bo",
            "parent_id": "t1_hsmlu8d",
            "score": 1,
            "created_utc": 1642261755.0,
            "replies": []
        },
        {
            "body": "You’re welcome. That sounds like something that could help uplift your spirits! I hope it goes well, maybe put on some of your favorite music too. Sending hugs and love 💓",
            "author": "No-Bass3542",
            "id": "hsoh9uj",
            "parent_id": "t1_hso5295",
            "score": 1,
            "created_utc": 1642194661.0,
            "replies": []
        },
        {
            "body": "None of your business. Have a nice day.",
            "author": "KitehDotNet",
            "id": "hspmpwf",
            "parent_id": "t1_hsp2byj",
            "score": 2,
            "created_utc": 1642212282.0,
            "replies": [
                {
                    "body": "Ya figured as much.",
                    "author": "deffekt22",
                    "id": "hspq2uk",
                    "parent_id": "t1_hspmpwf",
                    "score": 0,
                    "created_utc": 1642213829.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I wouldn’t make my child work in high school unless they wanted to - they will literally have a lifetime full of work. Let them enjoy their freedom from adult responsibilities, because once those begin they don’t end.\n\nSorry to hear about all the loss you have suffered in the recent times of those close to you. \n\nJust remember there is a solution to every problem. Focus only on finding those solutions and navigating your new normal rather than sulking in what you cannot change which is the past/what’s already happened. I’m not telling you not to grieve, but life & bills do not stop regardless of what we are experiencing and you have to be a fighter. It will honestly get better, depending on what/how much you put into it - it can either be something that happens rather quickly or take a long time - it’s all dependent upon your dedication to changing your circumstances.",
            "author": "iwishyouwo0d",
            "id": "hspayx0",
            "parent_id": "t1_hsp6rse",
            "score": 2,
            "created_utc": 1642206944.0,
            "replies": [
                {
                    "body": "Yeah totally. Thank you",
                    "author": "Delicious_Yam7323",
                    "id": "hspioi9",
                    "parent_id": "t1_hspayx0",
                    "score": 1,
                    "created_utc": 1642210431.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Yeah. I’m sure I will eventually, it’s just hard to consider meeting someone even in the far future right now. Thank you.",
            "author": "Delicious_Yam7323",
            "id": "hsmj6kc",
            "parent_id": "t1_hsmflrm",
            "score": 7,
            "created_utc": 1642166928.0,
            "replies": []
        },
        {
            "body": ">OP, I am sad for you too, I'll share one more tidbit that I hope can help you.  I went into a bit of a funk after SB passed.  A few weeks later, I met the best SB I ever had.  I would probably not have met her and had the two years with her I did, if I was spending it with the deceased SB.\n\nSir, I am very sorry for the obvious pain that you went through. I know this “tidbit” you are sharing has a positive intention, but that is the harshest “things have a way of working out” anecdote I have ever heard. \n\nWoof.",
            "author": "ThrowawayUserID1501",
            "id": "hsp351u",
            "parent_id": "t1_hsmflrm",
            "score": 8,
            "created_utc": 1642203504.0,
            "replies": [
                {
                    "body": "So much this. My SB who meant the world to me died. So I grieved for a week and went on with my life. I’ve had meals that lasted longer than his grief",
                    "author": "kb1323",
                    "id": "hspckum",
                    "parent_id": "t1_hsp351u",
                    "score": 5,
                    "created_utc": 1642207668.0,
                    "replies": [
                        {
                            "body": "Just remember that everyone grieves differently and grief should not take over the rest of your life.",
                            "author": "Sendatsu69",
                            "id": "ht1ifus",
                            "parent_id": "t1_hspckum",
                            "score": 2,
                            "created_utc": 1642430222.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Odd question but usually people are pretty close in SR. Like, have keys to the apartment, love their dog (pets) In these situations do you not go back over and collect items or check on the pets due to friends / family? (Like for example if you know her mom hates the dog, she passes, and you have a key why wouldn’t you just go check on the apartment & get the dog? Or is that not okay? What about all the photos together? Mementos? 😬😅 asking for a friend)",
            "author": null,
            "id": "hsohkto",
            "parent_id": "t1_hsmflrm",
            "score": 3,
            "created_utc": 1642194779.0,
            "replies": []
        },
        {
            "body": "That’s what I’m saying. I don’t even know if I could make it through a job interview right now. It’s just stressful. I don’t have a ton of friends in LA. But I’m debating telling my roommate. I’m just dreading it.. telling her I’ve been SBing and then that my SD he died seems like a lot. But she’s also not dumb and will figure out I’m not doing well so I’ll probably tell her",
            "author": "Delicious_Yam7323",
            "id": "hso4bqj",
            "parent_id": "t1_hsnwo3l",
            "score": 2,
            "created_utc": 1642189691.0,
            "replies": [
                {
                    "body": "You could say that he was a mentor and that he died, and that you had come to care about him. You don't have to say that he was giving you allowances or that there was a romantic element to your relationshp.",
                    "author": "emptyoverflow",
                    "id": "hso59ut",
                    "parent_id": "t1_hso4bqj",
                    "score": 7,
                    "created_utc": 1642190047.0,
                    "replies": []
                },
                {
                    "body": "Please see a therapist today and talk to someone you know and trust. If you're pretty confident your roommate is trustworthy then go for it. Put the rest of it out of your mind for the next week or two as worrying about it right now won't help.",
                    "author": "SBerryTrifle",
                    "id": "hsohlf2",
                    "parent_id": "t1_hso4bqj",
                    "score": 2,
                    "created_utc": 1642194785.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Yeah. Definitely learning from this experience. I just didn’t have to work and I didn’t want to. Regretting it now. Thank you",
            "author": "Delicious_Yam7323",
            "id": "hso5z6e",
            "parent_id": "t1_hsncyvn",
            "score": 1,
            "created_utc": 1642190314.0,
            "replies": []
        },
        {
            "body": "Yeah, I’m trying to find house sitting jobs through a friend.",
            "author": "Delicious_Yam7323",
            "id": "hso612n",
            "parent_id": "t1_hsnq56u",
            "score": 1,
            "created_utc": 1642190335.0,
            "replies": []
        },
        {
            "body": "Why do you think that? If my dad or husband passed away and there was some young girl there crying I would definitely want to know who she was and why she was there.",
            "author": "WestCoastCompanion",
            "id": "hsp32g5",
            "parent_id": "t1_hsmnzp3",
            "score": 4,
            "created_utc": 1642203473.0,
            "replies": [
                {
                    "body": "You might want to know who she was, but to what extent would you pursue and harass someone who left immediately after the funeral service and was crying, while you had your own family around you?",
                    "author": null,
                    "id": "hspg8dq",
                    "parent_id": "t1_hsp32g5",
                    "score": -1,
                    "created_utc": 1642209330.0,
                    "replies": [
                        {
                            "body": "Pursue and harass? Are you suggesting she run away? And add drama and more confusion and emotional burden to an already bereft family? And yes, for my mothers sake/childrens sake/own sake yes I would want to know who they were and what they were doing there. You’re not going to just release this huge mystery on my family that we’ll have to wonder about forever, especially durring a funeral. Advising this young lady that people won’t be inclined to demand an explanation is foolish. To do that to a grieving family would be really selfish. I understand she would like to be there, but she just can’t. These are the sacrifices we make when we engage in these types of arrangements.",
                            "author": "WestCoastCompanion",
                            "id": "hsrytb7",
                            "parent_id": "t1_hspg8dq",
                            "score": 2,
                            "created_utc": 1642261673.0,
                            "replies": [
                                {
                                    "body": ">Are you suggesting she run away?\n\nNo. I'm suggesting that she sit at the back of the church and leave as soon as the service is concluded. Are you going to spot her and sprint to the back of the church just as the service concludes because you don't recognize her?",
                                    "author": null,
                                    "id": "hss3wdc",
                                    "parent_id": "t1_hsrytb7",
                                    "score": 0,
                                    "created_utc": 1642263741.0,
                                    "replies": [
                                        {
                                            "body": "Well she says she’s “a big cryer” so if that’s the case she would be creating a scene and drawing attention to herself, so yes. \nAlso, if you read the OP’s comments, you see he had a very good relationship with his wife. There’s no need to selfishly disrespect her and their relationship like this. I feel like you’re just arguing for arguments sake because there’s no way any sane person would think this is a good idea. I’m sure she also loved and respected him too much to risk exposing him after he’s passed.",
                                            "author": "WestCoastCompanion",
                                            "id": "hstp453",
                                            "parent_id": "t1_hss3wdc",
                                            "score": 2,
                                            "created_utc": 1642286408.0,
                                            "replies": [
                                                {
                                                    "body": "You've ignored my question:\n\n>Are you going to spot her and sprint to the back of the church just as the service concludes because you don't recognize her?\n\nI knew fewer than half of the people at my father's funeral, and made no effort to identify the ones I didn't know. I was grateful for the support.\n\nMoving on:\n\n>I feel like you’re just arguing for arguments sake because there’s no way any sane person would think this is a good idea.\n\nApparently, then, judging from other comments, I'm not the only person here who's not sane. Not very tolerant of opinions that are different from yours, are you . . . .\n\nFeel free to take the last word, if you like; I won't respond to you again.",
                                                    "author": null,
                                                    "id": "hstu84c",
                                                    "parent_id": "t1_hstp453",
                                                    "score": 0,
                                                    "created_utc": 1642288509.0,
                                                    "replies": [
                                                        {
                                                            "body": "I didn’t ignore your question, it literally says yes in the first sentence if you’d bothered to read it. I’m sure you wouldn’t, but as you must be aware, women and men react very differently to the same situations. I’m sure most men couldn’t care less or would already assume. However, if the wife noticed her, and especially if she has a daughter or sister, I can assure you the daughter or sister will absolutely get to the bottom of it for her sake, not just say “oh well, just ignore the random 20 year old girl sobbing at the back of your late husbands funeral. I’m sure it’s nothing” \nIt’s almost like you know absolutely nothing about women at all.",
                                                            "author": "WestCoastCompanion",
                                                            "id": "hsu11ka",
                                                            "parent_id": "t1_hstu84c",
                                                            "score": 1,
                                                            "created_utc": 1642291337.0,
                                                            "replies": [
                                                                {
                                                                    "body": ">I didn’t ignore your question, it literally says yes in the first sentence if you’d bothered to read it.\n\nYou are correct. You gave a very qualified answer, but, true, you didn't ignore my question. I was wrong on that point.",
                                                                    "author": null,
                                                                    "id": "hsu1iv9",
                                                                    "parent_id": "t1_hsu11ka",
                                                                    "score": 1,
                                                                    "created_utc": 1642291535.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Ya figured as much.",
            "author": "deffekt22",
            "id": "hspq2uk",
            "parent_id": "t1_hspmpwf",
            "score": 0,
            "created_utc": 1642213829.0,
            "replies": []
        },
        {
            "body": "Yeah totally. Thank you",
            "author": "Delicious_Yam7323",
            "id": "hspioi9",
            "parent_id": "t1_hspayx0",
            "score": 1,
            "created_utc": 1642210431.0,
            "replies": []
        },
        {
            "body": "So much this. My SB who meant the world to me died. So I grieved for a week and went on with my life. I’ve had meals that lasted longer than his grief",
            "author": "kb1323",
            "id": "hspckum",
            "parent_id": "t1_hsp351u",
            "score": 5,
            "created_utc": 1642207668.0,
            "replies": [
                {
                    "body": "Just remember that everyone grieves differently and grief should not take over the rest of your life.",
                    "author": "Sendatsu69",
                    "id": "ht1ifus",
                    "parent_id": "t1_hspckum",
                    "score": 2,
                    "created_utc": 1642430222.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "You could say that he was a mentor and that he died, and that you had come to care about him. You don't have to say that he was giving you allowances or that there was a romantic element to your relationshp.",
            "author": "emptyoverflow",
            "id": "hso59ut",
            "parent_id": "t1_hso4bqj",
            "score": 7,
            "created_utc": 1642190047.0,
            "replies": []
        },
        {
            "body": "Please see a therapist today and talk to someone you know and trust. If you're pretty confident your roommate is trustworthy then go for it. Put the rest of it out of your mind for the next week or two as worrying about it right now won't help.",
            "author": "SBerryTrifle",
            "id": "hsohlf2",
            "parent_id": "t1_hso4bqj",
            "score": 2,
            "created_utc": 1642194785.0,
            "replies": []
        },
        {
            "body": "You might want to know who she was, but to what extent would you pursue and harass someone who left immediately after the funeral service and was crying, while you had your own family around you?",
            "author": null,
            "id": "hspg8dq",
            "parent_id": "t1_hsp32g5",
            "score": -1,
            "created_utc": 1642209330.0,
            "replies": [
                {
                    "body": "Pursue and harass? Are you suggesting she run away? And add drama and more confusion and emotional burden to an already bereft family? And yes, for my mothers sake/childrens sake/own sake yes I would want to know who they were and what they were doing there. You’re not going to just release this huge mystery on my family that we’ll have to wonder about forever, especially durring a funeral. Advising this young lady that people won’t be inclined to demand an explanation is foolish. To do that to a grieving family would be really selfish. I understand she would like to be there, but she just can’t. These are the sacrifices we make when we engage in these types of arrangements.",
                    "author": "WestCoastCompanion",
                    "id": "hsrytb7",
                    "parent_id": "t1_hspg8dq",
                    "score": 2,
                    "created_utc": 1642261673.0,
                    "replies": [
                        {
                            "body": ">Are you suggesting she run away?\n\nNo. I'm suggesting that she sit at the back of the church and leave as soon as the service is concluded. Are you going to spot her and sprint to the back of the church just as the service concludes because you don't recognize her?",
                            "author": null,
                            "id": "hss3wdc",
                            "parent_id": "t1_hsrytb7",
                            "score": 0,
                            "created_utc": 1642263741.0,
                            "replies": [
                                {
                                    "body": "Well she says she’s “a big cryer” so if that’s the case she would be creating a scene and drawing attention to herself, so yes. \nAlso, if you read the OP’s comments, you see he had a very good relationship with his wife. There’s no need to selfishly disrespect her and their relationship like this. I feel like you’re just arguing for arguments sake because there’s no way any sane person would think this is a good idea. I’m sure she also loved and respected him too much to risk exposing him after he’s passed.",
                                    "author": "WestCoastCompanion",
                                    "id": "hstp453",
                                    "parent_id": "t1_hss3wdc",
                                    "score": 2,
                                    "created_utc": 1642286408.0,
                                    "replies": [
                                        {
                                            "body": "You've ignored my question:\n\n>Are you going to spot her and sprint to the back of the church just as the service concludes because you don't recognize her?\n\nI knew fewer than half of the people at my father's funeral, and made no effort to identify the ones I didn't know. I was grateful for the support.\n\nMoving on:\n\n>I feel like you’re just arguing for arguments sake because there’s no way any sane person would think this is a good idea.\n\nApparently, then, judging from other comments, I'm not the only person here who's not sane. Not very tolerant of opinions that are different from yours, are you . . . .\n\nFeel free to take the last word, if you like; I won't respond to you again.",
                                            "author": null,
                                            "id": "hstu84c",
                                            "parent_id": "t1_hstp453",
                                            "score": 0,
                                            "created_utc": 1642288509.0,
                                            "replies": [
                                                {
                                                    "body": "I didn’t ignore your question, it literally says yes in the first sentence if you’d bothered to read it. I’m sure you wouldn’t, but as you must be aware, women and men react very differently to the same situations. I’m sure most men couldn’t care less or would already assume. However, if the wife noticed her, and especially if she has a daughter or sister, I can assure you the daughter or sister will absolutely get to the bottom of it for her sake, not just say “oh well, just ignore the random 20 year old girl sobbing at the back of your late husbands funeral. I’m sure it’s nothing” \nIt’s almost like you know absolutely nothing about women at all.",
                                                    "author": "WestCoastCompanion",
                                                    "id": "hsu11ka",
                                                    "parent_id": "t1_hstu84c",
                                                    "score": 1,
                                                    "created_utc": 1642291337.0,
                                                    "replies": [
                                                        {
                                                            "body": ">I didn’t ignore your question, it literally says yes in the first sentence if you’d bothered to read it.\n\nYou are correct. You gave a very qualified answer, but, true, you didn't ignore my question. I was wrong on that point.",
                                                            "author": null,
                                                            "id": "hsu1iv9",
                                                            "parent_id": "t1_hsu11ka",
                                                            "score": 1,
                                                            "created_utc": 1642291535.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Just remember that everyone grieves differently and grief should not take over the rest of your life.",
            "author": "Sendatsu69",
            "id": "ht1ifus",
            "parent_id": "t1_hspckum",
            "score": 2,
            "created_utc": 1642430222.0,
            "replies": []
        },
        {
            "body": "Pursue and harass? Are you suggesting she run away? And add drama and more confusion and emotional burden to an already bereft family? And yes, for my mothers sake/childrens sake/own sake yes I would want to know who they were and what they were doing there. You’re not going to just release this huge mystery on my family that we’ll have to wonder about forever, especially durring a funeral. Advising this young lady that people won’t be inclined to demand an explanation is foolish. To do that to a grieving family would be really selfish. I understand she would like to be there, but she just can’t. These are the sacrifices we make when we engage in these types of arrangements.",
            "author": "WestCoastCompanion",
            "id": "hsrytb7",
            "parent_id": "t1_hspg8dq",
            "score": 2,
            "created_utc": 1642261673.0,
            "replies": [
                {
                    "body": ">Are you suggesting she run away?\n\nNo. I'm suggesting that she sit at the back of the church and leave as soon as the service is concluded. Are you going to spot her and sprint to the back of the church just as the service concludes because you don't recognize her?",
                    "author": null,
                    "id": "hss3wdc",
                    "parent_id": "t1_hsrytb7",
                    "score": 0,
                    "created_utc": 1642263741.0,
                    "replies": [
                        {
                            "body": "Well she says she’s “a big cryer” so if that’s the case she would be creating a scene and drawing attention to herself, so yes. \nAlso, if you read the OP’s comments, you see he had a very good relationship with his wife. There’s no need to selfishly disrespect her and their relationship like this. I feel like you’re just arguing for arguments sake because there’s no way any sane person would think this is a good idea. I’m sure she also loved and respected him too much to risk exposing him after he’s passed.",
                            "author": "WestCoastCompanion",
                            "id": "hstp453",
                            "parent_id": "t1_hss3wdc",
                            "score": 2,
                            "created_utc": 1642286408.0,
                            "replies": [
                                {
                                    "body": "You've ignored my question:\n\n>Are you going to spot her and sprint to the back of the church just as the service concludes because you don't recognize her?\n\nI knew fewer than half of the people at my father's funeral, and made no effort to identify the ones I didn't know. I was grateful for the support.\n\nMoving on:\n\n>I feel like you’re just arguing for arguments sake because there’s no way any sane person would think this is a good idea.\n\nApparently, then, judging from other comments, I'm not the only person here who's not sane. Not very tolerant of opinions that are different from yours, are you . . . .\n\nFeel free to take the last word, if you like; I won't respond to you again.",
                                    "author": null,
                                    "id": "hstu84c",
                                    "parent_id": "t1_hstp453",
                                    "score": 0,
                                    "created_utc": 1642288509.0,
                                    "replies": [
                                        {
                                            "body": "I didn’t ignore your question, it literally says yes in the first sentence if you’d bothered to read it. I’m sure you wouldn’t, but as you must be aware, women and men react very differently to the same situations. I’m sure most men couldn’t care less or would already assume. However, if the wife noticed her, and especially if she has a daughter or sister, I can assure you the daughter or sister will absolutely get to the bottom of it for her sake, not just say “oh well, just ignore the random 20 year old girl sobbing at the back of your late husbands funeral. I’m sure it’s nothing” \nIt’s almost like you know absolutely nothing about women at all.",
                                            "author": "WestCoastCompanion",
                                            "id": "hsu11ka",
                                            "parent_id": "t1_hstu84c",
                                            "score": 1,
                                            "created_utc": 1642291337.0,
                                            "replies": [
                                                {
                                                    "body": ">I didn’t ignore your question, it literally says yes in the first sentence if you’d bothered to read it.\n\nYou are correct. You gave a very qualified answer, but, true, you didn't ignore my question. I was wrong on that point.",
                                                    "author": null,
                                                    "id": "hsu1iv9",
                                                    "parent_id": "t1_hsu11ka",
                                                    "score": 1,
                                                    "created_utc": 1642291535.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": ">Are you suggesting she run away?\n\nNo. I'm suggesting that she sit at the back of the church and leave as soon as the service is concluded. Are you going to spot her and sprint to the back of the church just as the service concludes because you don't recognize her?",
            "author": null,
            "id": "hss3wdc",
            "parent_id": "t1_hsrytb7",
            "score": 0,
            "created_utc": 1642263741.0,
            "replies": [
                {
                    "body": "Well she says she’s “a big cryer” so if that’s the case she would be creating a scene and drawing attention to herself, so yes. \nAlso, if you read the OP’s comments, you see he had a very good relationship with his wife. There’s no need to selfishly disrespect her and their relationship like this. I feel like you’re just arguing for arguments sake because there’s no way any sane person would think this is a good idea. I’m sure she also loved and respected him too much to risk exposing him after he’s passed.",
                    "author": "WestCoastCompanion",
                    "id": "hstp453",
                    "parent_id": "t1_hss3wdc",
                    "score": 2,
                    "created_utc": 1642286408.0,
                    "replies": [
                        {
                            "body": "You've ignored my question:\n\n>Are you going to spot her and sprint to the back of the church just as the service concludes because you don't recognize her?\n\nI knew fewer than half of the people at my father's funeral, and made no effort to identify the ones I didn't know. I was grateful for the support.\n\nMoving on:\n\n>I feel like you’re just arguing for arguments sake because there’s no way any sane person would think this is a good idea.\n\nApparently, then, judging from other comments, I'm not the only person here who's not sane. Not very tolerant of opinions that are different from yours, are you . . . .\n\nFeel free to take the last word, if you like; I won't respond to you again.",
                            "author": null,
                            "id": "hstu84c",
                            "parent_id": "t1_hstp453",
                            "score": 0,
                            "created_utc": 1642288509.0,
                            "replies": [
                                {
                                    "body": "I didn’t ignore your question, it literally says yes in the first sentence if you’d bothered to read it. I’m sure you wouldn’t, but as you must be aware, women and men react very differently to the same situations. I’m sure most men couldn’t care less or would already assume. However, if the wife noticed her, and especially if she has a daughter or sister, I can assure you the daughter or sister will absolutely get to the bottom of it for her sake, not just say “oh well, just ignore the random 20 year old girl sobbing at the back of your late husbands funeral. I’m sure it’s nothing” \nIt’s almost like you know absolutely nothing about women at all.",
                                    "author": "WestCoastCompanion",
                                    "id": "hsu11ka",
                                    "parent_id": "t1_hstu84c",
                                    "score": 1,
                                    "created_utc": 1642291337.0,
                                    "replies": [
                                        {
                                            "body": ">I didn’t ignore your question, it literally says yes in the first sentence if you’d bothered to read it.\n\nYou are correct. You gave a very qualified answer, but, true, you didn't ignore my question. I was wrong on that point.",
                                            "author": null,
                                            "id": "hsu1iv9",
                                            "parent_id": "t1_hsu11ka",
                                            "score": 1,
                                            "created_utc": 1642291535.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Well she says she’s “a big cryer” so if that’s the case she would be creating a scene and drawing attention to herself, so yes. \nAlso, if you read the OP’s comments, you see he had a very good relationship with his wife. There’s no need to selfishly disrespect her and their relationship like this. I feel like you’re just arguing for arguments sake because there’s no way any sane person would think this is a good idea. I’m sure she also loved and respected him too much to risk exposing him after he’s passed.",
            "author": "WestCoastCompanion",
            "id": "hstp453",
            "parent_id": "t1_hss3wdc",
            "score": 2,
            "created_utc": 1642286408.0,
            "replies": [
                {
                    "body": "You've ignored my question:\n\n>Are you going to spot her and sprint to the back of the church just as the service concludes because you don't recognize her?\n\nI knew fewer than half of the people at my father's funeral, and made no effort to identify the ones I didn't know. I was grateful for the support.\n\nMoving on:\n\n>I feel like you’re just arguing for arguments sake because there’s no way any sane person would think this is a good idea.\n\nApparently, then, judging from other comments, I'm not the only person here who's not sane. Not very tolerant of opinions that are different from yours, are you . . . .\n\nFeel free to take the last word, if you like; I won't respond to you again.",
                    "author": null,
                    "id": "hstu84c",
                    "parent_id": "t1_hstp453",
                    "score": 0,
                    "created_utc": 1642288509.0,
                    "replies": [
                        {
                            "body": "I didn’t ignore your question, it literally says yes in the first sentence if you’d bothered to read it. I’m sure you wouldn’t, but as you must be aware, women and men react very differently to the same situations. I’m sure most men couldn’t care less or would already assume. However, if the wife noticed her, and especially if she has a daughter or sister, I can assure you the daughter or sister will absolutely get to the bottom of it for her sake, not just say “oh well, just ignore the random 20 year old girl sobbing at the back of your late husbands funeral. I’m sure it’s nothing” \nIt’s almost like you know absolutely nothing about women at all.",
                            "author": "WestCoastCompanion",
                            "id": "hsu11ka",
                            "parent_id": "t1_hstu84c",
                            "score": 1,
                            "created_utc": 1642291337.0,
                            "replies": [
                                {
                                    "body": ">I didn’t ignore your question, it literally says yes in the first sentence if you’d bothered to read it.\n\nYou are correct. You gave a very qualified answer, but, true, you didn't ignore my question. I was wrong on that point.",
                                    "author": null,
                                    "id": "hsu1iv9",
                                    "parent_id": "t1_hsu11ka",
                                    "score": 1,
                                    "created_utc": 1642291535.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "You've ignored my question:\n\n>Are you going to spot her and sprint to the back of the church just as the service concludes because you don't recognize her?\n\nI knew fewer than half of the people at my father's funeral, and made no effort to identify the ones I didn't know. I was grateful for the support.\n\nMoving on:\n\n>I feel like you’re just arguing for arguments sake because there’s no way any sane person would think this is a good idea.\n\nApparently, then, judging from other comments, I'm not the only person here who's not sane. Not very tolerant of opinions that are different from yours, are you . . . .\n\nFeel free to take the last word, if you like; I won't respond to you again.",
            "author": null,
            "id": "hstu84c",
            "parent_id": "t1_hstp453",
            "score": 0,
            "created_utc": 1642288509.0,
            "replies": [
                {
                    "body": "I didn’t ignore your question, it literally says yes in the first sentence if you’d bothered to read it. I’m sure you wouldn’t, but as you must be aware, women and men react very differently to the same situations. I’m sure most men couldn’t care less or would already assume. However, if the wife noticed her, and especially if she has a daughter or sister, I can assure you the daughter or sister will absolutely get to the bottom of it for her sake, not just say “oh well, just ignore the random 20 year old girl sobbing at the back of your late husbands funeral. I’m sure it’s nothing” \nIt’s almost like you know absolutely nothing about women at all.",
                    "author": "WestCoastCompanion",
                    "id": "hsu11ka",
                    "parent_id": "t1_hstu84c",
                    "score": 1,
                    "created_utc": 1642291337.0,
                    "replies": [
                        {
                            "body": ">I didn’t ignore your question, it literally says yes in the first sentence if you’d bothered to read it.\n\nYou are correct. You gave a very qualified answer, but, true, you didn't ignore my question. I was wrong on that point.",
                            "author": null,
                            "id": "hsu1iv9",
                            "parent_id": "t1_hsu11ka",
                            "score": 1,
                            "created_utc": 1642291535.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I didn’t ignore your question, it literally says yes in the first sentence if you’d bothered to read it. I’m sure you wouldn’t, but as you must be aware, women and men react very differently to the same situations. I’m sure most men couldn’t care less or would already assume. However, if the wife noticed her, and especially if she has a daughter or sister, I can assure you the daughter or sister will absolutely get to the bottom of it for her sake, not just say “oh well, just ignore the random 20 year old girl sobbing at the back of your late husbands funeral. I’m sure it’s nothing” \nIt’s almost like you know absolutely nothing about women at all.",
            "author": "WestCoastCompanion",
            "id": "hsu11ka",
            "parent_id": "t1_hstu84c",
            "score": 1,
            "created_utc": 1642291337.0,
            "replies": [
                {
                    "body": ">I didn’t ignore your question, it literally says yes in the first sentence if you’d bothered to read it.\n\nYou are correct. You gave a very qualified answer, but, true, you didn't ignore my question. I was wrong on that point.",
                    "author": null,
                    "id": "hsu1iv9",
                    "parent_id": "t1_hsu11ka",
                    "score": 1,
                    "created_utc": 1642291535.0,
                    "replies": []
                }
            ]
        },
        {
            "body": ">I didn’t ignore your question, it literally says yes in the first sentence if you’d bothered to read it.\n\nYou are correct. You gave a very qualified answer, but, true, you didn't ignore my question. I was wrong on that point.",
            "author": null,
            "id": "hsu1iv9",
            "parent_id": "t1_hsu11ka",
            "score": 1,
            "created_utc": 1642291535.0,
            "replies": []
        }
    ]
}