{
    "title": "Runningman ranked #1 on wavve weekly rankings this week. Do not get discouraged by the 4.6% ratings cz most ppl watch online these days.",
    "post_id": "oioy9j",
    "post_url": "https://www.reddit.com/r/runningman/comments/oioy9j/runningman_ranked_1_on_wavve_weekly_rankings_this/",
    "author": "Purpleviens",
    "body": "",
    "url": "https://i.redd.it/vmvk2otqjra71.jpg",
    "score": 328,
    "upvote_ratio": 0.99,
    "created_utc": 1626087590.0,
    "num_comments": 31,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "the top 2 shows are both yjs’ what a goat",
            "author": "looooolmonster",
            "id": "h4x02nv",
            "parent_id": "t3_oioy9j",
            "score": 38,
            "created_utc": 1626095418.0,
            "replies": [
                {
                    "body": "\\#4 is also a YJS show, Infinity Challenge which has been off the air since 2018 but still on the most viewed list.",
                    "author": "jhdnhc",
                    "id": "h4xw4iw",
                    "parent_id": "t1_h4x02nv",
                    "score": 16,
                    "created_utc": 1626110085.0,
                    "replies": []
                },
                {
                    "body": "well he has always been a goat =)",
                    "author": "hashtagperky",
                    "id": "h4xg3m7",
                    "parent_id": "t1_h4x02nv",
                    "score": 12,
                    "created_utc": 1626103346.0,
                    "replies": []
                },
                {
                    "body": "\\#2 is Ji Suk Jin on the most-right, as a singer!!!!! :)",
                    "author": "BoxStrange3765",
                    "id": "h5vyp10",
                    "parent_id": "t1_h4x02nv",
                    "score": 1,
                    "created_utc": 1626796339.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "also that day on another show (the masked singer) which airs on the same time as running man, some really famous band called ph1 appeared.. I think it can be another reason for the ratings to decrease....\n\nI hope they dont get discouraged by these ratings.. they have overcome 11 years of difficulties and am sure they will continue to do so... \n\n(also bo pil pd if u are reading this please know a lot of intl viewers really loved this episode)",
            "author": "substantial_protein",
            "id": "h4wr92n",
            "parent_id": "t3_oioy9j",
            "score": 34,
            "created_utc": 1626089788.0,
            "replies": [
                {
                    "body": "Lmao ph1 is a rapper not a band xd",
                    "author": "Aye2004",
                    "id": "h4wwwb1",
                    "parent_id": "t1_h4wr92n",
                    "score": 12,
                    "created_utc": 1626093565.0,
                    "replies": [
                        {
                            "body": "They probably confused PH-1 the rapper with P1H the boy band. Understandable really",
                            "author": "Mozart-Luna-Echo",
                            "id": "h4wxz1z",
                            "parent_id": "t1_h4wwwb1",
                            "score": 6,
                            "created_utc": 1626094209.0,
                            "replies": [
                                {
                                    "body": "yeah this.. am dumb sorry T-T",
                                    "author": "substantial_protein",
                                    "id": "h4y6jm3",
                                    "parent_id": "t1_h4wxz1z",
                                    "score": 3,
                                    "created_utc": 1626114728.0,
                                    "replies": [
                                        {
                                            "body": "Nah, it can happen to anyone! I made that mistake for months so don't feel bad",
                                            "author": "Mozart-Luna-Echo",
                                            "id": "h4y6os0",
                                            "parent_id": "t1_h4y6jm3",
                                            "score": 3,
                                            "created_utc": 1626114792.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "RM airs at 5, Masked Singer airs at 6, so RM's last 30 minutes is in competition with them, while Boss Ears starts at the same time as RM.",
                    "author": "jhdnhc",
                    "id": "h4ybvvo",
                    "parent_id": "t1_h4wr92n",
                    "score": 3,
                    "created_utc": 1626117207.0,
                    "replies": []
                },
                {
                    "body": "Ph1 is a rapper and He's not that popular in Korea. He's more popular outside. So no it's not the reason why.",
                    "author": "pake19",
                    "id": "h4x8nrx",
                    "parent_id": "t1_h4wr92n",
                    "score": 4,
                    "created_utc": 1626099804.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "What is Wavve ?",
            "author": "charles1er",
            "id": "h4x6c3d",
            "parent_id": "t3_oioy9j",
            "score": 10,
            "created_utc": 1626098646.0,
            "replies": [
                {
                    "body": "a korean online streaming platform like netflix and tving ...",
                    "author": "Purpleviens",
                    "id": "h4xbyc4",
                    "parent_id": "t1_h4x6c3d",
                    "score": 20,
                    "created_utc": 1626101394.0,
                    "replies": [
                        {
                            "body": "Thank you. Does it offer english subs ? Im new to Running man and variety show. Im only at episode 14.",
                            "author": "charles1er",
                            "id": "h4xrsk6",
                            "parent_id": "t1_h4xbyc4",
                            "score": 5,
                            "created_utc": 1626108154.0,
                            "replies": [
                                {
                                    "body": "I think it's only korean. You can find eng subs legally on viu and viki and kocowa if theyre available in your country",
                                    "author": "Purpleviens",
                                    "id": "h4y1e5f",
                                    "parent_id": "t1_h4xrsk6",
                                    "score": 5,
                                    "created_utc": 1626112426.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I've learn a long time ago(when Gary left) not to follow rating. It was just giving me unnecessary stress and I can't do anything to improve the rating myself anyway.\n\nI found it was even hampering my enjoyment of watching the show coz in the back of my mind I was thinking how they could make it better instead of just enjoying it and letting the cards fall wherever they will.",
            "author": "JADlloyd",
            "id": "h4xrpdm",
            "parent_id": "t3_oioy9j",
            "score": 11,
            "created_utc": 1626108114.0,
            "replies": []
        },
        {
            "body": "Every TV ratings are going down except sports cause lesser and lesser people are watching TV shows.",
            "author": "lelelele98",
            "id": "h4xa3xv",
            "parent_id": "t3_oioy9j",
            "score": 4,
            "created_utc": 1626100508.0,
            "replies": []
        },
        {
            "body": "If some of y’all are really concerned about ratings, there’s nothing anyone can really do but to encourage each other to keep watching.\n\nIf you feel official views are low, don’t forget the views from illegal channels, that’s not trackable and should count for a good amount afaik",
            "author": "KikoMaching",
            "id": "h4zi2gk",
            "parent_id": "t3_oioy9j",
            "score": 2,
            "created_utc": 1626137971.0,
            "replies": []
        },
        {
            "body": "What are the name of the other shoes from #3 to #11",
            "author": "Tokyo_Addition-",
            "id": "h5087t9",
            "parent_id": "t3_oioy9j",
            "score": 2,
            "created_utc": 1626153369.0,
            "replies": [
                {
                    "body": "I only know nb 4 is infinite challege",
                    "author": "Purpleviens",
                    "id": "h509d5y",
                    "parent_id": "t1_h5087t9",
                    "score": 1,
                    "created_utc": 1626154220.0,
                    "replies": []
                },
                {
                    "body": "1. Running Man 2. How do you play. 3 I live alone 4. Infinity challenge 5. Ugly duckling …. 9. Radio star 10. Baek-Jong won’s Back Alley Restaurant \n\nThe only ones I know, maybe it helps a bit lol",
                    "author": "Sabbathehut1",
                    "id": "h5lt7dp",
                    "parent_id": "t1_h5087t9",
                    "score": 1,
                    "created_utc": 1626592323.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "While true, it's not a coincidence that 2 out of the 4 post-LKS episodes are 2 of the lowest rated episodes in RM history. It also hasn't helped that the 4 episodes have also been extremely low key (even for COVID episode standards) with only one with guests (who have been out of the limelight for awhile). \n\nWhile I loved the chatting episode last week. I was afraid many casual watchers would be turned off by an episode of talking, especially when RM used to be all about the spectacle. \n\nI also wonder if there have been budget cuts recently. To have an \"anniversary\" episode that featured a photographer, a game on 7 laptops, a homemade game of Taboo, and then some costumes felt a little cheap and a little sad.",
            "author": "xander_yi",
            "id": "h4xw1qo",
            "parent_id": "t3_oioy9j",
            "score": -2,
            "created_utc": 1626110050.0,
            "replies": [
                {
                    "body": "I don’t think it’s a budget cut, i think it’s more of a health concern now that RM has become more “tame” by variety-activity standards.\n\nI think even the members mentioned that they know RM changed from physically demanding activities to more leisurely activities throughout the years and they’re all for it. Not just because that’s the way variety trend has been heading towards but as well as their own limitations.\n\nThis recent episode with their anniversary being simple is ok by me. The preview for next weeks is even more physically intensive than the previous weeks combined. They’re getting old, the audience is getting old with them. Not every thing needs to be action packed",
                    "author": "KikoMaching",
                    "id": "h4zhl9p",
                    "parent_id": "t1_h4xw1qo",
                    "score": 3,
                    "created_utc": 1626137716.0,
                    "replies": [
                        {
                            "body": "RM used to have elaborate sets and props even for inactive episodes, such as the semi-recent quiz show episode where SJH, LKS and a guest knew the answers beforehand.\n\nThis is episode, the sets and props amounted to: a flower backdrop, folding tables, chairs, laptops, and paper for the Taboo game. That has nothing to do with members' health, it's money.",
                            "author": "xander_yi",
                            "id": "h4zv9sd",
                            "parent_id": "t1_h4zhl9p",
                            "score": 1,
                            "created_utc": 1626145047.0,
                            "replies": [
                                {
                                    "body": "I’d give both of us the benefit of the doubt on whether it is or isn’t about money. Until an official article says it they’re low on funds cause of these low ratings then I’ll believe it’s that. It’s one episode (yes it may be an anniversary episode) where it’s not crazily themed, I wouldn’t go as to show they’re low on overall budget. Maybe unforeseen circumstances are happening on that side that is fans/viewers don’t know! So who knows really",
                                    "author": "KikoMaching",
                                    "id": "h4zxz1e",
                                    "parent_id": "t1_h4zv9sd",
                                    "score": 2,
                                    "created_utc": 1626146612.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "So do they make profit from 4.6%? Pretty sure online viewer doest contribute anything.",
            "author": "NobleArch",
            "id": "h4wph0c",
            "parent_id": "t3_oioy9j",
            "score": -8,
            "created_utc": 1626088448.0,
            "replies": [
                {
                    "body": "That 4.6% TV rating is from AGB Nielsen. There are some who think these ratings are a be all end all but they are in fact far from it, maybe a decade ago sure, not these days though. It helps stations and advertisers gauge the popularity of the show but ever since the shift to online and VODs this hasn't been the focus.\n\nThe way it works is a select few households are chosen by AGB Nielsen to become part of what is called a \"Nielsen Family\" this is where the ratings come from. If there are only 1000 nilsen households nationwide then that would mean only 46 of those were watching the show primetime. It doesn't take into account the actual number of households watching said show. It doesn't matter if 90% of the country's population was watching the show at primetime if only 46 of the 1000 Nielsen households were watching, it would still reflect as 4.6%.\n\nIf your target audience are those advanced of age who primarily watch TVs and have difficulty navigating a computer or smartphone, then these ratings will matter a lot, however if your target audience are young, be it teens or young adults, maybe even middle-aged, online engagement is now the major driving force for advertisers.",
                    "author": "Mootwafel",
                    "id": "h4x4pzd",
                    "parent_id": "t1_h4wph0c",
                    "score": 15,
                    "created_utc": 1626097841.0,
                    "replies": []
                },
                {
                    "body": "I'm not an expert on online platforms so Idk but I think that online platforms have to buy the rights to the shows and according to the contract they must share a certain amount of the profits from streams. Runningman rights I think is sold to several online platforms so they must be making money that way too. \n\nOn tv they make money from commercials and they did add commercials in the recent eps and runningman has also product placements to back them up every ep, like the car two eps ago, and the nice place with green land last week and this week the chips. \n\nI also read somewhere that the ratings law changed from two part rating to the whole ep ratings so all the shows has a tv ratings dip. \n\nRunningman also have a youtube channel which always has clips trending and it gets millions of views so they also make money that way.",
                    "author": "Purpleviens",
                    "id": "h4wqb7i",
                    "parent_id": "t1_h4wph0c",
                    "score": 19,
                    "created_utc": 1626089088.0,
                    "replies": []
                },
                {
                    "body": "They do get profit from online views, but of course from sites which has rights to show. EX. Viu, Viki, Hotstar.. etc etc.",
                    "author": "Seiralacroix",
                    "id": "h4wu8fc",
                    "parent_id": "t1_h4wph0c",
                    "score": 5,
                    "created_utc": 1626091874.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "\\#2 is Ji Suk Jin on the most-right, as a singer!!!!! :)",
            "author": "BoxStrange3765",
            "id": "h5vyhe2",
            "parent_id": "t3_oioy9j",
            "score": 1,
            "created_utc": 1626796252.0,
            "replies": []
        },
        {
            "body": "\\#4 is also a YJS show, Infinity Challenge which has been off the air since 2018 but still on the most viewed list.",
            "author": "jhdnhc",
            "id": "h4xw4iw",
            "parent_id": "t1_h4x02nv",
            "score": 16,
            "created_utc": 1626110085.0,
            "replies": []
        },
        {
            "body": "well he has always been a goat =)",
            "author": "hashtagperky",
            "id": "h4xg3m7",
            "parent_id": "t1_h4x02nv",
            "score": 12,
            "created_utc": 1626103346.0,
            "replies": []
        },
        {
            "body": "\\#2 is Ji Suk Jin on the most-right, as a singer!!!!! :)",
            "author": "BoxStrange3765",
            "id": "h5vyp10",
            "parent_id": "t1_h4x02nv",
            "score": 1,
            "created_utc": 1626796339.0,
            "replies": []
        },
        {
            "body": "Lmao ph1 is a rapper not a band xd",
            "author": "Aye2004",
            "id": "h4wwwb1",
            "parent_id": "t1_h4wr92n",
            "score": 12,
            "created_utc": 1626093565.0,
            "replies": [
                {
                    "body": "They probably confused PH-1 the rapper with P1H the boy band. Understandable really",
                    "author": "Mozart-Luna-Echo",
                    "id": "h4wxz1z",
                    "parent_id": "t1_h4wwwb1",
                    "score": 6,
                    "created_utc": 1626094209.0,
                    "replies": [
                        {
                            "body": "yeah this.. am dumb sorry T-T",
                            "author": "substantial_protein",
                            "id": "h4y6jm3",
                            "parent_id": "t1_h4wxz1z",
                            "score": 3,
                            "created_utc": 1626114728.0,
                            "replies": [
                                {
                                    "body": "Nah, it can happen to anyone! I made that mistake for months so don't feel bad",
                                    "author": "Mozart-Luna-Echo",
                                    "id": "h4y6os0",
                                    "parent_id": "t1_h4y6jm3",
                                    "score": 3,
                                    "created_utc": 1626114792.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "RM airs at 5, Masked Singer airs at 6, so RM's last 30 minutes is in competition with them, while Boss Ears starts at the same time as RM.",
            "author": "jhdnhc",
            "id": "h4ybvvo",
            "parent_id": "t1_h4wr92n",
            "score": 3,
            "created_utc": 1626117207.0,
            "replies": []
        },
        {
            "body": "Ph1 is a rapper and He's not that popular in Korea. He's more popular outside. So no it's not the reason why.",
            "author": "pake19",
            "id": "h4x8nrx",
            "parent_id": "t1_h4wr92n",
            "score": 4,
            "created_utc": 1626099804.0,
            "replies": []
        },
        {
            "body": "a korean online streaming platform like netflix and tving ...",
            "author": "Purpleviens",
            "id": "h4xbyc4",
            "parent_id": "t1_h4x6c3d",
            "score": 20,
            "created_utc": 1626101394.0,
            "replies": [
                {
                    "body": "Thank you. Does it offer english subs ? Im new to Running man and variety show. Im only at episode 14.",
                    "author": "charles1er",
                    "id": "h4xrsk6",
                    "parent_id": "t1_h4xbyc4",
                    "score": 5,
                    "created_utc": 1626108154.0,
                    "replies": [
                        {
                            "body": "I think it's only korean. You can find eng subs legally on viu and viki and kocowa if theyre available in your country",
                            "author": "Purpleviens",
                            "id": "h4y1e5f",
                            "parent_id": "t1_h4xrsk6",
                            "score": 5,
                            "created_utc": 1626112426.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I only know nb 4 is infinite challege",
            "author": "Purpleviens",
            "id": "h509d5y",
            "parent_id": "t1_h5087t9",
            "score": 1,
            "created_utc": 1626154220.0,
            "replies": []
        },
        {
            "body": "1. Running Man 2. How do you play. 3 I live alone 4. Infinity challenge 5. Ugly duckling …. 9. Radio star 10. Baek-Jong won’s Back Alley Restaurant \n\nThe only ones I know, maybe it helps a bit lol",
            "author": "Sabbathehut1",
            "id": "h5lt7dp",
            "parent_id": "t1_h5087t9",
            "score": 1,
            "created_utc": 1626592323.0,
            "replies": []
        },
        {
            "body": "I don’t think it’s a budget cut, i think it’s more of a health concern now that RM has become more “tame” by variety-activity standards.\n\nI think even the members mentioned that they know RM changed from physically demanding activities to more leisurely activities throughout the years and they’re all for it. Not just because that’s the way variety trend has been heading towards but as well as their own limitations.\n\nThis recent episode with their anniversary being simple is ok by me. The preview for next weeks is even more physically intensive than the previous weeks combined. They’re getting old, the audience is getting old with them. Not every thing needs to be action packed",
            "author": "KikoMaching",
            "id": "h4zhl9p",
            "parent_id": "t1_h4xw1qo",
            "score": 3,
            "created_utc": 1626137716.0,
            "replies": [
                {
                    "body": "RM used to have elaborate sets and props even for inactive episodes, such as the semi-recent quiz show episode where SJH, LKS and a guest knew the answers beforehand.\n\nThis is episode, the sets and props amounted to: a flower backdrop, folding tables, chairs, laptops, and paper for the Taboo game. That has nothing to do with members' health, it's money.",
                    "author": "xander_yi",
                    "id": "h4zv9sd",
                    "parent_id": "t1_h4zhl9p",
                    "score": 1,
                    "created_utc": 1626145047.0,
                    "replies": [
                        {
                            "body": "I’d give both of us the benefit of the doubt on whether it is or isn’t about money. Until an official article says it they’re low on funds cause of these low ratings then I’ll believe it’s that. It’s one episode (yes it may be an anniversary episode) where it’s not crazily themed, I wouldn’t go as to show they’re low on overall budget. Maybe unforeseen circumstances are happening on that side that is fans/viewers don’t know! So who knows really",
                            "author": "KikoMaching",
                            "id": "h4zxz1e",
                            "parent_id": "t1_h4zv9sd",
                            "score": 2,
                            "created_utc": 1626146612.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "That 4.6% TV rating is from AGB Nielsen. There are some who think these ratings are a be all end all but they are in fact far from it, maybe a decade ago sure, not these days though. It helps stations and advertisers gauge the popularity of the show but ever since the shift to online and VODs this hasn't been the focus.\n\nThe way it works is a select few households are chosen by AGB Nielsen to become part of what is called a \"Nielsen Family\" this is where the ratings come from. If there are only 1000 nilsen households nationwide then that would mean only 46 of those were watching the show primetime. It doesn't take into account the actual number of households watching said show. It doesn't matter if 90% of the country's population was watching the show at primetime if only 46 of the 1000 Nielsen households were watching, it would still reflect as 4.6%.\n\nIf your target audience are those advanced of age who primarily watch TVs and have difficulty navigating a computer or smartphone, then these ratings will matter a lot, however if your target audience are young, be it teens or young adults, maybe even middle-aged, online engagement is now the major driving force for advertisers.",
            "author": "Mootwafel",
            "id": "h4x4pzd",
            "parent_id": "t1_h4wph0c",
            "score": 15,
            "created_utc": 1626097841.0,
            "replies": []
        },
        {
            "body": "I'm not an expert on online platforms so Idk but I think that online platforms have to buy the rights to the shows and according to the contract they must share a certain amount of the profits from streams. Runningman rights I think is sold to several online platforms so they must be making money that way too. \n\nOn tv they make money from commercials and they did add commercials in the recent eps and runningman has also product placements to back them up every ep, like the car two eps ago, and the nice place with green land last week and this week the chips. \n\nI also read somewhere that the ratings law changed from two part rating to the whole ep ratings so all the shows has a tv ratings dip. \n\nRunningman also have a youtube channel which always has clips trending and it gets millions of views so they also make money that way.",
            "author": "Purpleviens",
            "id": "h4wqb7i",
            "parent_id": "t1_h4wph0c",
            "score": 19,
            "created_utc": 1626089088.0,
            "replies": []
        },
        {
            "body": "They do get profit from online views, but of course from sites which has rights to show. EX. Viu, Viki, Hotstar.. etc etc.",
            "author": "Seiralacroix",
            "id": "h4wu8fc",
            "parent_id": "t1_h4wph0c",
            "score": 5,
            "created_utc": 1626091874.0,
            "replies": []
        },
        {
            "body": "They probably confused PH-1 the rapper with P1H the boy band. Understandable really",
            "author": "Mozart-Luna-Echo",
            "id": "h4wxz1z",
            "parent_id": "t1_h4wwwb1",
            "score": 6,
            "created_utc": 1626094209.0,
            "replies": [
                {
                    "body": "yeah this.. am dumb sorry T-T",
                    "author": "substantial_protein",
                    "id": "h4y6jm3",
                    "parent_id": "t1_h4wxz1z",
                    "score": 3,
                    "created_utc": 1626114728.0,
                    "replies": [
                        {
                            "body": "Nah, it can happen to anyone! I made that mistake for months so don't feel bad",
                            "author": "Mozart-Luna-Echo",
                            "id": "h4y6os0",
                            "parent_id": "t1_h4y6jm3",
                            "score": 3,
                            "created_utc": 1626114792.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Thank you. Does it offer english subs ? Im new to Running man and variety show. Im only at episode 14.",
            "author": "charles1er",
            "id": "h4xrsk6",
            "parent_id": "t1_h4xbyc4",
            "score": 5,
            "created_utc": 1626108154.0,
            "replies": [
                {
                    "body": "I think it's only korean. You can find eng subs legally on viu and viki and kocowa if theyre available in your country",
                    "author": "Purpleviens",
                    "id": "h4y1e5f",
                    "parent_id": "t1_h4xrsk6",
                    "score": 5,
                    "created_utc": 1626112426.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "RM used to have elaborate sets and props even for inactive episodes, such as the semi-recent quiz show episode where SJH, LKS and a guest knew the answers beforehand.\n\nThis is episode, the sets and props amounted to: a flower backdrop, folding tables, chairs, laptops, and paper for the Taboo game. That has nothing to do with members' health, it's money.",
            "author": "xander_yi",
            "id": "h4zv9sd",
            "parent_id": "t1_h4zhl9p",
            "score": 1,
            "created_utc": 1626145047.0,
            "replies": [
                {
                    "body": "I’d give both of us the benefit of the doubt on whether it is or isn’t about money. Until an official article says it they’re low on funds cause of these low ratings then I’ll believe it’s that. It’s one episode (yes it may be an anniversary episode) where it’s not crazily themed, I wouldn’t go as to show they’re low on overall budget. Maybe unforeseen circumstances are happening on that side that is fans/viewers don’t know! So who knows really",
                    "author": "KikoMaching",
                    "id": "h4zxz1e",
                    "parent_id": "t1_h4zv9sd",
                    "score": 2,
                    "created_utc": 1626146612.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "yeah this.. am dumb sorry T-T",
            "author": "substantial_protein",
            "id": "h4y6jm3",
            "parent_id": "t1_h4wxz1z",
            "score": 3,
            "created_utc": 1626114728.0,
            "replies": [
                {
                    "body": "Nah, it can happen to anyone! I made that mistake for months so don't feel bad",
                    "author": "Mozart-Luna-Echo",
                    "id": "h4y6os0",
                    "parent_id": "t1_h4y6jm3",
                    "score": 3,
                    "created_utc": 1626114792.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I think it's only korean. You can find eng subs legally on viu and viki and kocowa if theyre available in your country",
            "author": "Purpleviens",
            "id": "h4y1e5f",
            "parent_id": "t1_h4xrsk6",
            "score": 5,
            "created_utc": 1626112426.0,
            "replies": []
        },
        {
            "body": "I’d give both of us the benefit of the doubt on whether it is or isn’t about money. Until an official article says it they’re low on funds cause of these low ratings then I’ll believe it’s that. It’s one episode (yes it may be an anniversary episode) where it’s not crazily themed, I wouldn’t go as to show they’re low on overall budget. Maybe unforeseen circumstances are happening on that side that is fans/viewers don’t know! So who knows really",
            "author": "KikoMaching",
            "id": "h4zxz1e",
            "parent_id": "t1_h4zv9sd",
            "score": 2,
            "created_utc": 1626146612.0,
            "replies": []
        },
        {
            "body": "Nah, it can happen to anyone! I made that mistake for months so don't feel bad",
            "author": "Mozart-Luna-Echo",
            "id": "h4y6os0",
            "parent_id": "t1_h4y6jm3",
            "score": 3,
            "created_utc": 1626114792.0,
            "replies": []
        }
    ]
}