{
    "title": "A Sugar Success Story. Update from a year ago.",
    "post_id": "zwjors",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/zwjors/a_sugar_success_story_update_from_a_year_ago/",
    "author": "NC-Chat",
    "body": "Back In January I created this post: [My SB only wants to have sex. Is this weird or did I hit the jackpot?](https://www.reddit.com/r/sugarlifestyleforum/comments/sh2sv5/my_sb_only_wants_to_have_sex_is_this_weird_or_did/)\n\nI got some really great advice before and after I had met her (Let's call her E). I really appreciated the great feedback from the community, it was extremely helpful.\n\nBack when I had made the original post I was engaged, miserable, and going through the worst depression since my college years. I was dedicated on ending my 9 year relationship and decided to look at sugaring to keep my sanity as I took time to get my affairs in order. Honestly, I should have just waited but I didn't. I just wanted to go on a few nice dates, have sex and feel **normal.** I messaged E on seeking and we had instant chemistry. I was so surprised! We have a 12 year age gap so we are able to relate on a lot of things while still having that younger woman, older man type relationship. But with the holidays we weren't going to be able to meet for another month. So I broke a SLF rule. I sent her money without meeting to keep her interested. I offered a meager weekly allowance so I could have her attention. I never asked for nudes. I barely asked anything sexually related. I just wanted to talk and get to know her. It was great. We spoke on the phone everyday and the chemistry was apparent. I found out later that this approach was the main reason she took me seriously.\n\nWe finally met in January and as I had seen on the phone, the chemistry was immediate. We had a M&G lunch date that lasted 5 hours before the waiter kicked us out. Two weeks later we were able to have a real meeting. Our chemistry was even more intense in the bedroom and we spent the entire day having sex. We hadn't talked about sex too much before, but E and I are both very sexual people. She made it clear to me that she was perfectly fine just spending 4 to 5 hours having sex. No date or activity necessary. I was so confused and made my original post. Within the next few months we were both having the best sex of our lives. Meanwhile I finally ended my relationship in February, moved out, got my own place, and E was coming over consistently. Things were getting better and better **yet I was getting more and more frustrated**. The sex was nonstop. Over summer I had more sex than I had in the last decade. Still, I couldn't help but feel drawn to her romantically. She's so warm, so loving, so sweet. She makes me laugh so often and makes me feel like no one else has. It was breaking my heart because I knew she didn't want a real relationship. I remember taking a hot shower and wanting to cry because I felt like I found the woman I've been looking for my whole life, but she didn't want the same thing. She wouldn't love me back. She would leave as soon as the allowance went away. I put my guards back up and tried to put some emotional distance between us as I thought about ending the arrangement.\n\nBy August E was basically living at my place. I didn't change her allowance, I didn't change her gifts, my attitude. No, she just wanted to spend time with me. I'd come home and she had dinner ready, she cleaned my house, and took care of me. All with a happy smile on her face. I started noticing that maybe I'm not the only one with feelings. We were having more real dates, she started meeting my friends. We were still having filthy, amazing sex but I couldn't help but notice the way she would look at me.\n\nSo I told her I was falling for her, and to my surprise she smiled back and said the same thing. We continued having the best time together. She went back to school. We saw each other less, but she always made time for me. In fact, she always made more time for me than what we had agreed on. I was happy but still, I was missing what I actually wanted.\n\nI sat her down and told her how I felt, how I wanted the real thing, how I wanted to be her boyfriend and work towards a serious relationship. I was so nervous but I could see her in eyes that she had been waiting for me to ask this. She said yes :) A month later we were in bed and she was staring at me awkwardly with her big blue eyes. She nervously said I Love You. my hearted melted, we both shed little tears, embraced, and had the best sex of my life - at the time ;)\n\nOver a year later since my original message to her I can say I have found the love of my life. I found what true love feels like, what the relationship I've always wanted feels like, what the embrace of someone who's so affectionate and loving feels like. We may have a terrible origin story, but I wouldn't change a thing. I'll be asking her to move in with me when she finishes school this spring and I surprised her with a Caribbean cruise for spring break.\n\nSo one last time, thank you SLF. This board changed my life in the best way and I'm incredibly grateful for everyone here. I hope all of you can find true life as I have.",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/zwjors/a_sugar_success_story_update_from_a_year_ago/",
    "score": 149,
    "upvote_ratio": 0.95,
    "created_utc": 1672158898.0,
    "num_comments": 39,
    "links": [
        [
            "https://www.reddit.com/r/sugarlifestyleforum/comments/sh2sv5/my_sb_only_wants_to_have_sex_is_this_weird_or_did/"
        ]
    ],
    "comments": [
        {
            "body": "What a great story:\n\n1) you supported her\n2) you respected her boundaries\n3) you let things develop naturally\n4) you matched each other’s energy",
            "author": "daddoms",
            "id": "j1v3jbc",
            "parent_id": "t3_zwjors",
            "score": 67,
            "created_utc": 1672160512.0,
            "replies": [
                {
                    "body": "I like this response and list…💗💗💗",
                    "author": "nerdyinkedcurvi",
                    "id": "j1xaas3",
                    "parent_id": "t1_j1v3jbc",
                    "score": 4,
                    "created_utc": 1672193216.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I remember your original post and thinking you were overthinking it.\n\nYou don’t have a “terrible” origin story in any way. \n\nLife is messy and unpredictable and you two navigated unknown, murky waters with grace and kind regard. I do think the sugar path lets us be more honest with our intentions earlier on, allowing for greater trust and ultimately stronger connections.\n\nSo happy for you!",
            "author": "JemimaQuackers",
            "id": "j1v89iv",
            "parent_id": "t3_zwjors",
            "score": 14,
            "created_utc": 1672162375.0,
            "replies": []
        },
        {
            "body": "This is very sweet. Happy you guys found each other 💕",
            "author": "Empressofthemall",
            "id": "j1v0bno",
            "parent_id": "t3_zwjors",
            "score": 7,
            "created_utc": 1672159220.0,
            "replies": []
        },
        {
            "body": "This is a Christmas movie of sorts 😁.. But so good to hear how things worked out for you two. Congratulations.",
            "author": "chazthomas",
            "id": "j1y7nvm",
            "parent_id": "t3_zwjors",
            "score": 2,
            "created_utc": 1672211722.0,
            "replies": []
        },
        {
            "body": "This should totally be a movie. I love this so much!",
            "author": "xxemberraexx",
            "id": "j1yd5sg",
            "parent_id": "t3_zwjors",
            "score": 2,
            "created_utc": 1672216125.0,
            "replies": []
        },
        {
            "body": "She still on PPM? 😅",
            "author": "sugardad123",
            "id": "j1z44c6",
            "parent_id": "t3_zwjors",
            "score": 2,
            "created_utc": 1672235966.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "j1v7u9k",
            "parent_id": "t3_zwjors",
            "score": 3,
            "created_utc": 1672162212.0,
            "replies": [
                {
                    "body": "This makes me so sad! :( feel free to message if you’d like advice or to vent?",
                    "author": "SassyBabe6939",
                    "id": "j219an2",
                    "parent_id": "t1_j1v7u9k",
                    "score": 1,
                    "created_utc": 1672267683.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "That is great for both of you. Life is what happens to you while you're busy making other plans.",
            "author": "FutureSD617",
            "id": "j1v2tqh",
            "parent_id": "t3_zwjors",
            "score": 3,
            "created_utc": 1672160227.0,
            "replies": []
        },
        {
            "body": "I love this story so much. I have a similar story! It’s funny how things work out.",
            "author": "snowsugarsiren",
            "id": "j1whqaf",
            "parent_id": "t3_zwjors",
            "score": 2,
            "created_utc": 1672180587.0,
            "replies": []
        },
        {
            "body": "Awwww!!! I love this story. I’m so happy for you guys. 🤍",
            "author": "Unlikely_Garbage_861",
            "id": "j1v5gcp",
            "parent_id": "t3_zwjors",
            "score": 1,
            "created_utc": 1672161277.0,
            "replies": []
        },
        {
            "body": "living the dream. congrats to both of you. and may y'all have an amazing and fruitful life together.",
            "author": "xa3D",
            "id": "j1v8to7",
            "parent_id": "t3_zwjors",
            "score": 1,
            "created_utc": 1672162592.0,
            "replies": [
                {
                    "body": "Living the dream is right!! 😭🙃",
                    "author": "SassyBabe6939",
                    "id": "j219e8h",
                    "parent_id": "t1_j1v8to7",
                    "score": 1,
                    "created_utc": 1672267724.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "This is such a beautiful love story! It's made my day. Wishing you both a lifetime of love and happiness. Congratulations!!",
            "author": "live-and-you-learn",
            "id": "j1vbplg",
            "parent_id": "t3_zwjors",
            "score": 1,
            "created_utc": 1672163711.0,
            "replies": []
        },
        {
            "body": "Absolutely stoked for you and E - wishing you much joy and happiness together",
            "author": "Jonconnerysd",
            "id": "j1vdhio",
            "parent_id": "t3_zwjors",
            "score": 1,
            "created_utc": 1672164402.0,
            "replies": []
        },
        {
            "body": "Congratulations, success stories like this give us all hope.",
            "author": "halmone",
            "id": "j1vfvq3",
            "parent_id": "t3_zwjors",
            "score": 1,
            "created_utc": 1672165332.0,
            "replies": []
        },
        {
            "body": "❤️ congratulations, you earned it\n\nI love that you kept your emotions and actions in check, didn’t overwhelm or smother her with your inner turmoil, and let the relationship develop organically.",
            "author": "P0sitiveViibes777",
            "id": "j1vjezm",
            "parent_id": "t3_zwjors",
            "score": 1,
            "created_utc": 1672166719.0,
            "replies": []
        },
        {
            "body": "Please feel free to save some of that happiness for the rest of us. :)",
            "author": "Garuda_Darkblack",
            "id": "j1vlypo",
            "parent_id": "t3_zwjors",
            "score": 1,
            "created_utc": 1672167721.0,
            "replies": [
                {
                    "body": "Exactly right!",
                    "author": "LearnedHand1972",
                    "id": "j5j8d7v",
                    "parent_id": "t1_j1vlypo",
                    "score": 1,
                    "created_utc": 1674474363.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Aww this is goals 🥹❤️ I like how you didn’t rush the relationship and let it naturally develop at its own pace.",
            "author": "National-Dig1823",
            "id": "j1vu85n",
            "parent_id": "t3_zwjors",
            "score": 1,
            "created_utc": 1672171043.0,
            "replies": []
        },
        {
            "body": "Awesome story",
            "author": "thedoctor321",
            "id": "j1vzqhy",
            "parent_id": "t3_zwjors",
            "score": 1,
            "created_utc": 1672173270.0,
            "replies": []
        },
        {
            "body": "YAY!!",
            "author": "atxdaddio44",
            "id": "j1w034l",
            "parent_id": "t3_zwjors",
            "score": 1,
            "created_utc": 1672173408.0,
            "replies": []
        },
        {
            "body": "amazing story! Love this ❤️",
            "author": "mmilton716",
            "id": "j1w2zbl",
            "parent_id": "t3_zwjors",
            "score": 1,
            "created_utc": 1672174568.0,
            "replies": []
        },
        {
            "body": "What a sweet story.  Congrats to both of you",
            "author": null,
            "id": "j1w6fhr",
            "parent_id": "t3_zwjors",
            "score": 1,
            "created_utc": 1672175960.0,
            "replies": []
        },
        {
            "body": "Congratulations to you both!",
            "author": "NVOkie9018",
            "id": "j1wk2fz",
            "parent_id": "t3_zwjors",
            "score": 1,
            "created_utc": 1672181568.0,
            "replies": []
        },
        {
            "body": "This is so beautiful!😭thank you for sharing the update; i hope you both stay together till the end of time💕",
            "author": "lunarooma",
            "id": "j1wpzk9",
            "parent_id": "t3_zwjors",
            "score": 1,
            "created_utc": 1672184078.0,
            "replies": []
        },
        {
            "body": "Awww y’all are living the dream, congratulations! 🥰",
            "author": "starrrgirll",
            "id": "j1wvyqm",
            "parent_id": "t3_zwjors",
            "score": 1,
            "created_utc": 1672186701.0,
            "replies": []
        },
        {
            "body": "This is great, good for both of you! It goes to show that patience goes a long way in these types of relationships. Sometimes they fail and there’s nothing you can do about it, other times they grow even stronger and become more serious even though that’s not a starting intent",
            "author": "dapperswaggered",
            "id": "j1wzrjj",
            "parent_id": "t3_zwjors",
            "score": 1,
            "created_utc": 1672188384.0,
            "replies": [
                {
                    "body": "Well said! I truly believe that timing can be everything, too",
                    "author": "SassyBabe6939",
                    "id": "j219jp1",
                    "parent_id": "t1_j1wzrjj",
                    "score": 2,
                    "created_utc": 1672267787.0,
                    "replies": [
                        {
                            "body": "Indeed! Definitely life events, different phases, shifting wants/needs, or involvements with outside relationships can have a huge impact that chances over time for the makings of a stronger or weaker sugar relationship.",
                            "author": "dapperswaggered",
                            "id": "j21c7y0",
                            "parent_id": "t1_j219jp1",
                            "score": 2,
                            "created_utc": 1672268900.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "This made me smile",
            "author": "Keyblad3master",
            "id": "j1xskwp",
            "parent_id": "t3_zwjors",
            "score": 1,
            "created_utc": 1672202131.0,
            "replies": []
        },
        {
            "body": "Happy for u. I both hope the same thing can happen between my ex sd and me since we both quit sugaring and both single lolll. I see your post as a sign from universe telling me my wish is possible hahaha.",
            "author": "reborn912021",
            "id": "j1xv4vs",
            "parent_id": "t3_zwjors",
            "score": 1,
            "created_utc": 1672203530.0,
            "replies": []
        },
        {
            "body": "Might be the best story I’ve ever heard from the Bowl.  Congrats to you and E for showing us what is possible.",
            "author": "PracticePositive69",
            "id": "j1y0bd6",
            "parent_id": "t3_zwjors",
            "score": 1,
            "created_utc": 1672206600.0,
            "replies": []
        },
        {
            "body": "🥹",
            "author": "Aphrodisiatic922",
            "id": "j1y61jj",
            "parent_id": "t3_zwjors",
            "score": 1,
            "created_utc": 1672210498.0,
            "replies": []
        },
        {
            "body": "Congratulations, this is so sweet !",
            "author": "Sugarintheorange",
            "id": "j1y9dw9",
            "parent_id": "t3_zwjors",
            "score": 1,
            "created_utc": 1672213064.0,
            "replies": []
        },
        {
            "body": "This is so great!! \n\nGives me hope that there ARE decent guys- never mind SDs- still out there 🤞🏻🥰",
            "author": "SassyBabe6939",
            "id": "j2194v3",
            "parent_id": "t3_zwjors",
            "score": 1,
            "created_utc": 1672267615.0,
            "replies": []
        },
        {
            "body": "I'm not crying, you're crying. Great share.❤️🙂",
            "author": "niceissexy",
            "id": "j221ku1",
            "parent_id": "t3_zwjors",
            "score": 1,
            "created_utc": 1672279903.0,
            "replies": []
        },
        {
            "body": "Beautiful, this is just so... beautiful!",
            "author": "NaturalNo7512",
            "id": "j2510aa",
            "parent_id": "t3_zwjors",
            "score": 1,
            "created_utc": 1672338895.0,
            "replies": []
        },
        {
            "body": " I’m very happy for you both.",
            "author": "stocks-mostly-lower",
            "id": "j3bbldt",
            "parent_id": "t3_zwjors",
            "score": 1,
            "created_utc": 1673082185.0,
            "replies": []
        },
        {
            "body": "I like this response and list…💗💗💗",
            "author": "nerdyinkedcurvi",
            "id": "j1xaas3",
            "parent_id": "t1_j1v3jbc",
            "score": 4,
            "created_utc": 1672193216.0,
            "replies": []
        },
        {
            "body": "This makes me so sad! :( feel free to message if you’d like advice or to vent?",
            "author": "SassyBabe6939",
            "id": "j219an2",
            "parent_id": "t1_j1v7u9k",
            "score": 1,
            "created_utc": 1672267683.0,
            "replies": []
        },
        {
            "body": "Living the dream is right!! 😭🙃",
            "author": "SassyBabe6939",
            "id": "j219e8h",
            "parent_id": "t1_j1v8to7",
            "score": 1,
            "created_utc": 1672267724.0,
            "replies": []
        },
        {
            "body": "Exactly right!",
            "author": "LearnedHand1972",
            "id": "j5j8d7v",
            "parent_id": "t1_j1vlypo",
            "score": 1,
            "created_utc": 1674474363.0,
            "replies": []
        },
        {
            "body": "Well said! I truly believe that timing can be everything, too",
            "author": "SassyBabe6939",
            "id": "j219jp1",
            "parent_id": "t1_j1wzrjj",
            "score": 2,
            "created_utc": 1672267787.0,
            "replies": [
                {
                    "body": "Indeed! Definitely life events, different phases, shifting wants/needs, or involvements with outside relationships can have a huge impact that chances over time for the makings of a stronger or weaker sugar relationship.",
                    "author": "dapperswaggered",
                    "id": "j21c7y0",
                    "parent_id": "t1_j219jp1",
                    "score": 2,
                    "created_utc": 1672268900.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Indeed! Definitely life events, different phases, shifting wants/needs, or involvements with outside relationships can have a huge impact that chances over time for the makings of a stronger or weaker sugar relationship.",
            "author": "dapperswaggered",
            "id": "j21c7y0",
            "parent_id": "t1_j219jp1",
            "score": 2,
            "created_utc": 1672268900.0,
            "replies": []
        }
    ]
}