{
    "title": "2 SDs, 1 Wife...is it a trap?!",
    "post_id": "kqy410",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/kqy410/2_sds_1_wifeis_it_a_trap/",
    "author": "al3x400",
    "body": "Update: Thanks to the advice of the denizens of SLF, I messaged SD2 and asked him about Wife (ridiculous that I hadn't thought of it). He confirmed that she was not his partner, but was married to someone else. He had known her for years, and they met up if they had free nights in the same city. She asked him for my number, she knows about the nature of our relationship. The threesome we had was spontaneous, i.e. he was planning to see me, but she happened to be in London too. He figured she'd be up for it from past experience. He doesn't know who the third party is, and said it could simply be her husband. I did register a little surprise at this, but as he said \"She is not a woman to be unhappy in a marriage\". \n\nSo...I've agreed to the meet. But I'm not expecting anything till mid February...\n\nOriginal\nI am just about in the middle of a a couple of apparently overlapping affairs, and not too sure how to tread without affecting the sugar-stream in these strained times.\n\nI have limited my Sugar dating to people I have already met, which is best I can do since my rent and living needs to be paid for.  I have a SD (SD1) who I have seen on and off for a couple years, he is a part of a power couple. His wife is quite impressive ( I actually shared an elevator with them) and is also quite a strong personality by all accounts. He enjoys being more dominant and that's where I come in. I have been seeing him when he is in London. He has been quite helpful through the lockdown. \n\nSD2 is London based, and I met him early in 2020, and we did get along well. While I don't like doing much 'online', he has been more than generous and hasn't been physically available, so we have had a lot of online interaction with a few meets over 2020. He requested that I join him for a threesome ( we have done this previously). When I turned up at his flat, I saw SD1's wife...she did not recognize me obviously. I've learned to not let these kinds of things faze me too much thanks to some strange SR situations, or at least to compartmentalise potential awkwardness, and I must confess to have a fantastic time with them. I am quite sure they felt the same.\n\nShe has been in touch since (before this new lockdown) around arranging another meet with someone different...I am assuming that it is her husband...\n\nNow I don't know whether this is some complex game she is playing to expose her partner, or whether they have an open relationship...or whether she is in fact having an affair (same as him) and wants to have a threesome with her husband. It could be with someone completely different of course...\n\nThe lockdown has bought me some time I think, although they are not particularly law-abiding in that regard. Should I talk to SD1? Or SD2? Or should I just go with it and hope that SD1 acta surprised...?? What if it's going to be a major confrontation? I don't want to walk away from what could be a a great sugar source/s and some very good sexual experiences...",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/kqy410/2_sds_1_wifeis_it_a_trap/",
    "score": 129,
    "upvote_ratio": 0.95,
    "created_utc": 1609851898.0,
    "num_comments": 56,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "I would sell this script to a Hollywood producer. That’s where it belongs.",
            "author": null,
            "id": "gi6fu2h",
            "parent_id": "t3_kqy410",
            "score": 169,
            "created_utc": 1609854402.0,
            "replies": [
                {
                    "body": "Seriously, I would watch the hell out of this movie.  😂",
                    "author": "kamagone",
                    "id": "gi743f0",
                    "parent_id": "t1_gi6fu2h",
                    "score": 27,
                    "created_utc": 1609866739.0,
                    "replies": []
                },
                {
                    "body": "First thing I thought. When can I see this on my Netflix",
                    "author": "RockyLeal",
                    "id": "gi8yv6r",
                    "parent_id": "t1_gi6fu2h",
                    "score": 3,
                    "created_utc": 1609894010.0,
                    "replies": []
                },
                {
                    "body": "Chloe with Julianne Moore and Amanda Seyfried.",
                    "author": "BlBl_SD",
                    "id": "gibcv6k",
                    "parent_id": "t1_gi6fu2h",
                    "score": 1,
                    "created_utc": 1609949571.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "You're going to keep us updated, right?",
            "author": "mysecretacct4real",
            "id": "gi6gmrn",
            "parent_id": "t3_kqy410",
            "score": 88,
            "created_utc": 1609854896.0,
            "replies": []
        },
        {
            "body": "Take her up on her offer but request a pic of the “third” in the threesome before the meet happens. You can play it off as wanting to get the fantasy started before you meet up for the threesome. If it turns out to be SD1 then you can warn him to act surprised. This could become a good honey pot if your handle it well. If all goes well you could then have a threesome with SD1 and SD2",
            "author": "zztop1999",
            "id": "gi6eye5",
            "parent_id": "t3_kqy410",
            "score": 92,
            "created_utc": 1609853837.0,
            "replies": [
                {
                    "body": "This is a good option; could ask in case it's someone I know already etc.... I have considered messaging SD1 just to say that his wife has contacted me in order to arrange a threesome...but that may be messy.",
                    "author": "al3x400",
                    "id": "gi6fsmz",
                    "parent_id": "t1_gi6eye5",
                    "score": 30,
                    "created_utc": 1609854377.0,
                    "replies": [
                        {
                            "body": "Don’t involve SD1 until you know more about who she is bringing. Is she even bringing a male? Could be another female. If another guy keep this detail to yourself and consider you have a new $ source with the SD1’s wife now. Be safe and remember lube is your friend.",
                            "author": "zztop1999",
                            "id": "gi6gh0l",
                            "parent_id": "t1_gi6fsmz",
                            "score": 39,
                            "created_utc": 1609854797.0,
                            "replies": [
                                {
                                    "body": "I agree w the above. Talk to SD2 and inquire about the woman. How did they meet. Find out if it's a sugar thing or affair. He may not even know she's married. \n\nAsk her for pic of the new partner. Don't involve SD1 just yet.  Maybe SD1 doesn't know his wife is having sex w other men ? Maybe this is her bringing another female into the mix at his request ?  Maybe they all know and are just enjoying your company?",
                                    "author": "inafishbowl17",
                                    "id": "gi6s0x2",
                                    "parent_id": "t1_gi6gh0l",
                                    "score": 18,
                                    "created_utc": 1609861106.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "We NEED an update when this goes down 😂",
            "author": "foxygapher",
            "id": "gi6wf20",
            "parent_id": "t3_kqy410",
            "score": 16,
            "created_utc": 1609863180.0,
            "replies": []
        },
        {
            "body": "The odds that you would get invited to a threesome with the wife of your other SD by coincidence are pretty ludicrous. My money would definitely be on one or more of the parties have more information than you think they do. If you want to continue the relationship with SD1 and If you have been seeing him for such a long time and the trust is there then I would talk to him about it. Honestly though telling SD1 is a bit of a breach of trust with SD2 and wifey, but it seems pretty obvious to me that you are getting played here.\n\nIt's possible that you are heading for a confrontation, but there is also the possibility that you are being included in some consensual marital shenanigans. Remember though that your consent is just as important so don't do anything that you are uncomfortable with. Good luck.",
            "author": "LookingForTrueStuff",
            "id": "gi6ljf1",
            "parent_id": "t3_kqy410",
            "score": 32,
            "created_utc": 1609857745.0,
            "replies": [
                {
                    "body": "This is what a part of me thinks/hopes for. Maybe I am a pawn in a sex game amongst people with resources; I'm okay with that under the circumstances.",
                    "author": "al3x400",
                    "id": "gi6qv4v",
                    "parent_id": "t1_gi6ljf1",
                    "score": 20,
                    "created_utc": 1609860529.0,
                    "replies": [
                        {
                            "body": "Love the way you put that! Hope you have fun and don’t have to deal with any crazy conflict",
                            "author": "kash62",
                            "id": "gi7l18v",
                            "parent_id": "t1_gi6qv4v",
                            "score": 1,
                            "created_utc": 1609874304.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "How does meeting up with the wife and her ‘third’ play into your sugar? Is she offering anything other than a good time? I would decline and just stick with the two SDs and be open to seeing her WITH SD2 as part of your arrangement with him",
            "author": "crystalxx32",
            "id": "gi6h34m",
            "parent_id": "t3_kqy410",
            "score": 14,
            "created_utc": 1609855178.0,
            "replies": [
                {
                    "body": "She has mentioned compensation for my time, I am assuming that it will the same as SD2 since she got my contact from him.",
                    "author": "al3x400",
                    "id": "gi6p8m4",
                    "parent_id": "t1_gi6h34m",
                    "score": 10,
                    "created_utc": 1609859708.0,
                    "replies": [
                        {
                            "body": "I agree with who you replied to. Tell her you’re happy to see her with SD2 again but not with someone new.",
                            "author": "Cdnsugarr",
                            "id": "gi713o0",
                            "parent_id": "t1_gi6p8m4",
                            "score": 8,
                            "created_utc": 1609865363.0,
                            "replies": []
                        },
                        {
                            "body": "So one potential payout that will likely blow up or not lead to anything long term-versus two consistent SRs that you are happy in.... especially if you are relying on these funds during covid- I think you know what to do here..",
                            "author": "crystalxx32",
                            "id": "gi8vvn2",
                            "parent_id": "t1_gi6p8m4",
                            "score": 2,
                            "created_utc": 1609892503.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I don’t see any scenario this can end welll",
            "author": null,
            "id": "gi6cu6s",
            "parent_id": "t3_kqy410",
            "score": 25,
            "created_utc": 1609852378.0,
            "replies": []
        },
        {
            "body": "There are a lot of potential pitfalls and traps in this situation.  \n\n - You don't want to walk away, because you need the sugar now. \n - You don't know if SD1 and his wife are in an open marriage\n - You don't know if the wife suggested 3sum is with her husband or someone else\n - You don't know how SD2 knows the wife and if SD2 knows SD1\n - You don't know if SD1 and SD2 may know each other and run in the same circles\n - You suspect they are not particularly law abiding citizens already\n\nThere are kegs of dynamite around you waiting for you to light a match.  Your best bet is to walk away, but if you can't walk away and enjoy the thrill of the situation, you can try to unwind it slowly.  \n\nIt seems SD1 is your primary and longest connection in this situation.   I would would start with him and find out if his marriage is open.  If they are open, how much detail do they share with each other?  Maybe he knows his wife had the 3sum, but didn't know it was with you. How open are you with SD1 in your arrangement? Does he know you are not exclusive and have you discussed other partners?  Does he know you know who his wife is?",
            "author": "willfromvb",
            "id": "gi6lv17",
            "parent_id": "t3_kqy410",
            "score": 13,
            "created_utc": 1609857921.0,
            "replies": [
                {
                    "body": "He has other SRs, as do I. He talks about his SRs, I do not. He has not mentioned an open relationship, but then I have never asked. He volunteered his marital status himself. And yes, he does since I have seen them together.",
                    "author": "al3x400",
                    "id": "gi6qdao",
                    "parent_id": "t1_gi6lv17",
                    "score": 8,
                    "created_utc": 1609860282.0,
                    "replies": [
                        {
                            "body": "I think you could unwind the situation one question at a time, with a \"go/no go\" decisions with each question. \n\n - Is he in an open marriage?  Yes, proceed.\n - If open, do they share details? Yes, proceed.\n - Is he okay if you had another SR? Yes, proceed.\n - Has he and his wife ever had a 3sum together? Yes, proceed.\n - Is he open to another 3sum with his wife?  Yes, proceed. \n - Would he be open to a 3sum with you and his wife?  Yes, proceed.  \n - Ask his wife if she is in an open marriage?  Yes, proceed.\n - Aks her if they share details with each other?  If yes, proceed.\n - Ask her if her husband knows about the 3sum you had?  Yes, proceed.\n - Ask her if her suggested 3sum is with her husband?  Yes, proceed.\n - Ask SD1 if he would be okay that you have already been intimate his his wife?  Yes, proceed.\n - Ask SD1 if he would be okay if his wife suggested a 3sum with all 3 of you?  Yes, proceed.\n - Ask SD1 if he is comfortable discussing the 3sum with all 3 of you with her?  Yes, proceed.\n\nAt any point along the way, if you get a negative answer, stop and don't proceed.",
                            "author": "willfromvb",
                            "id": "gi6sxvm",
                            "parent_id": "t1_gi6qdao",
                            "score": 11,
                            "created_utc": 1609861553.0,
                            "replies": [
                                {
                                    "body": "We're getting pretty far out on the limb of this decision tree and assuming at each point the \"information\" we are getting is solid......  Like limbs of an old tree, the bark can cover the rot and then we become a student pilot without wings.",
                                    "author": "pinotandsugar",
                                    "id": "gi7nm61",
                                    "parent_id": "t1_gi6sxvm",
                                    "score": 3,
                                    "created_utc": 1609875351.0,
                                    "replies": [
                                        {
                                            "body": "I like the analogy, but just like climbing a tree, you make sure each branch can hold your weight before trusting it.  By cross referencing the wife's answer with SD1, she can verify if the story holds without outing either one or herself.  The safest answer is not to climb the tree, but some people like to climb trees.  🤗",
                                            "author": "willfromvb",
                                            "id": "gi7prmr",
                                            "parent_id": "t1_gi7nm61",
                                            "score": 4,
                                            "created_utc": 1609876076.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "If you go through with this, you can either hit the jackpot or the shit hits the fan.\n\nThe only way out is not to take her up on her offer",
            "author": "dontcallmechristian",
            "id": "gi6dha8",
            "parent_id": "t3_kqy410",
            "score": 8,
            "created_utc": 1609852834.0,
            "replies": []
        },
        {
            "body": "I think it is highly likely at least one of them has more information than they are giving you. \n\nI think the safest bet to move forward is to probe SD1 about his relationship. You've known him the longest. Ask about threesomes, ask if he has ever had one with his wife. Open marriage or not, this might give you an idea if the man she is including or not is her husband or someone new.",
            "author": "SugarDandy212",
            "id": "gi6ss8a",
            "parent_id": "t3_kqy410",
            "score": 7,
            "created_utc": 1609861475.0,
            "replies": [
                {
                    "body": "Additionally, if she is including her husband in this potential threesome, she'd have to explain how she met you. If she is lying about it, she'd want to get her story straight with you.",
                    "author": "SugarDandy212",
                    "id": "gi6wgf4",
                    "parent_id": "t1_gi6ss8a",
                    "score": 1,
                    "created_utc": 1609863198.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I mean I want you to go just bc I’m curious how this ends...",
            "author": "SarahBellum404",
            "id": "gi6jedl",
            "parent_id": "t3_kqy410",
            "score": 7,
            "created_utc": 1609856555.0,
            "replies": [
                {
                    "body": "Ditto. I would be less unsure in more... financially secure times. It's not so much a matter of sugar as it is sustenance these days though...",
                    "author": "al3x400",
                    "id": "gi6qive",
                    "parent_id": "t1_gi6jedl",
                    "score": 4,
                    "created_utc": 1609860360.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "If SD2 is sleeping with SD1's wife, he probably knows all and can answer all your questions.\n\nInvite him over for lunch and pillow talk.",
            "author": "sdphilly",
            "id": "gi6ogia",
            "parent_id": "t3_kqy410",
            "score": 7,
            "created_utc": 1609859306.0,
            "replies": [
                {
                    "body": "I think this is a good option. But then I would.be revealing SD1's affair to his Wife's other guy...I am trying to get through this without fucking things up for anyone. Especially myself!",
                    "author": "al3x400",
                    "id": "gi6qpg6",
                    "parent_id": "t1_gi6ogia",
                    "score": 9,
                    "created_utc": 1609860451.0,
                    "replies": [
                        {
                            "body": "You don't need to reveal your relationship with SD1.  You have already had fun with SD2 and SD1wife.  SD1wife reaches out for another play date.  SD2 either knows that she wanted you again, or not. If he is aware, you can ask follow ups on her situation.  If he is in the dark, beg his discretion...but i would assume he will add background on his own.",
                            "author": "sdphilly",
                            "id": "gi75veq",
                            "parent_id": "t1_gi6qpg6",
                            "score": 6,
                            "created_utc": 1609867538.0,
                            "replies": [
                                {
                                    "body": "Yup...that's actually an obvious thing to do! I'll message him!",
                                    "author": "al3x400",
                                    "id": "gi78621",
                                    "parent_id": "t1_gi75veq",
                                    "score": 3,
                                    "created_utc": 1609868565.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Definitely reasonable to screen the random guy she wants you to have threesome with so if you want more insight going into it that's totally reasonable and not weird. But I also see what everyone is saying about it being hypothetically messy or not a coincidence. I don't think it would be in a bad way though if this intentional it's probably in a sexual fantasy type way. There is a risk but id say fuck it and go for it and stay in contact with SD2 so you have that option regardless.",
            "author": null,
            "id": "gi6ykyg",
            "parent_id": "t3_kqy410",
            "score": 5,
            "created_utc": 1609864195.0,
            "replies": []
        },
        {
            "body": "Perhaps call the woman, ask her if she wants to be your SM, so you'd have two SDs, a SM, and spend your life juggling chainsaws. Once you have succeeded at this, please polish your crown, because you would be officially queen of the Sugar Babies.",
            "author": "lisamac90210",
            "id": "gi744gs",
            "parent_id": "t3_kqy410",
            "score": 6,
            "created_utc": 1609866753.0,
            "replies": [
                {
                    "body": "Lol...I don't think she'd be a great SM. She isn't that interested in getting to know me, or at least she wasn't. She was very much about doing the business. But who knows, I'm not the type to make the proposal, but maybe she will.",
                    "author": "al3x400",
                    "id": "gi77u29",
                    "parent_id": "t1_gi744gs",
                    "score": 2,
                    "created_utc": 1609868417.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Sounds like another episode of the Kartrashians.  Wife is giving Hubby a little taste of his own medicine. It is a little too contrived to be coincidental. Walk carefully through this minefield.",
            "author": "GSSD",
            "id": "gi6d4kc",
            "parent_id": "t3_kqy410",
            "score": 14,
            "created_utc": 1609852586.0,
            "replies": [
                {
                    "body": "You’re giving the kardashians way too much credit . This is more real housewives drama lol",
                    "author": "Disastrous_Author638",
                    "id": "gi6p7ij",
                    "parent_id": "t1_gi6d4kc",
                    "score": 9,
                    "created_utc": 1609859693.0,
                    "replies": [
                        {
                            "body": "Good point!",
                            "author": "GSSD",
                            "id": "gi6q65z",
                            "parent_id": "t1_gi6p7ij",
                            "score": 4,
                            "created_utc": 1609860181.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "This sounds like a trap. I dont see how this could end well.",
            "author": "restingbitchface8",
            "id": "gi6zw8l",
            "parent_id": "t3_kqy410",
            "score": 4,
            "created_utc": 1609864802.0,
            "replies": []
        },
        {
            "body": "You should have your own reality show lmao I would definitely watch that 🤣",
            "author": "creepygirl420",
            "id": "gi70k3b",
            "parent_id": "t3_kqy410",
            "score": 4,
            "created_utc": 1609865112.0,
            "replies": []
        },
        {
            "body": "Worst case scenario the 3sum is with her husband, she knows about your relationship/is angry and she is banking on one of you freaking out when you show up in order to catch him. In which case you could get wrapped in something really messy that you don't deserve the backlash of. Somehow, the sb and other woman are always shamed and blamed even in this forum. I agree with asking her for a picture of the third person and if it is indeed her husband then I would talk to him about it beforehand. If it's not her husband then you can just continue to play dumb and continue both relationships with the SDS but maybe keep the wife at arm's length.",
            "author": "nuitbelle",
            "id": "gi7qgra",
            "parent_id": "t3_kqy410",
            "score": 4,
            "created_utc": 1609876299.0,
            "replies": []
        },
        {
            "body": "I wonder if you could ask for ID of the third.... for “security” reasons before you follow through. Damn this is spicy!",
            "author": "Spacerangerbabe",
            "id": "gi6fw81",
            "parent_id": "t3_kqy410",
            "score": 3,
            "created_utc": 1609854441.0,
            "replies": []
        },
        {
            "body": "You in danger !!!",
            "author": "Disastrous_Author638",
            "id": "gi6p4i3",
            "parent_id": "t3_kqy410",
            "score": 3,
            "created_utc": 1609859650.0,
            "replies": []
        },
        {
            "body": "is it possible that SD2 got in touch with you based on a referral from SD1's wife? so, it wasn't a coincidence at all",
            "author": "joc13",
            "id": "gi79ia2",
            "parent_id": "t3_kqy410",
            "score": 3,
            "created_utc": 1609869162.0,
            "replies": []
        },
        {
            "body": "This sounds like a crazy short story in the making. Could turn into a great thing. Just be cautious.",
            "author": "thereadinessisall",
            "id": "gi6gve1",
            "parent_id": "t3_kqy410",
            "score": 2,
            "created_utc": 1609855044.0,
            "replies": []
        },
        {
            "body": "Sounds really fun! What a great scenario!\n\nAsk his wife what she will say about how the two of you met. That way you keep her secrets. \n\nSD1 will love this. The three of you will actually each have a relationship with eachother.",
            "author": "daddoms",
            "id": "gi6qtmr",
            "parent_id": "t3_kqy410",
            "score": 2,
            "created_utc": 1609860509.0,
            "replies": []
        },
        {
            "body": "Personally I think you have a good thing going with SD1 and SD2 and I think the wife is playing some sort of game.  \n\nWhilst you could try and play this out to your benefit, you need to consider the possibility that this could all blow up and you could lose the financial support of at least SD1.  Is this a risk you can afford to take? If it is then tread carefully and, as someone mentioned above, ask the wife for a pic of the guy first before you agree.",
            "author": "lithany1066",
            "id": "gi7xjqk",
            "parent_id": "t3_kqy410",
            "score": 2,
            "created_utc": 1609878863.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gi6imxl",
            "parent_id": "t3_kqy410",
            "score": 0,
            "created_utc": 1609856114.0,
            "replies": [
                {
                    "body": "If they were fun loving individuals they would be open about the situation not secretive.",
                    "author": "wildhorses6565",
                    "id": "gi714mz",
                    "parent_id": "t1_gi6imxl",
                    "score": 1,
                    "created_utc": 1609865374.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Did the wife know you were SD1's SB when you were on the elevator?",
            "author": "wildhorses6565",
            "id": "gi71c0o",
            "parent_id": "t3_kqy410",
            "score": 1,
            "created_utc": 1609865469.0,
            "replies": []
        },
        {
            "body": "If you find out it’s her husband then you should reach out before, but not unless it is him",
            "author": null,
            "id": "gi78ejy",
            "parent_id": "t3_kqy410",
            "score": 1,
            "created_utc": 1609868670.0,
            "replies": []
        },
        {
            "body": "Stay away from the wife.  I don't see anything good coming from that.  However if SD1 wants you and the wife for 3some, all is probably good.",
            "author": "HappyBear1952",
            "id": "gi7z930",
            "parent_id": "t3_kqy410",
            "score": 1,
            "created_utc": 1609879517.0,
            "replies": []
        },
        {
            "body": "Plz keep us updated cause this is intense lol they probably just have an open relationship tho, although its very coincidental..",
            "author": "t0keahontas",
            "id": "gi85uc6",
            "parent_id": "t3_kqy410",
            "score": 1,
            "created_utc": 1609882068.0,
            "replies": []
        },
        {
            "body": "I would say nothing to either SD don’t mess up a great thing. Ask for a picture of the third and only if it’s your SD mention it to him to give him the heads up. If she’s going to be a new SM you have an extra ability to make money.",
            "author": "roseSea",
            "id": "gi8hdka",
            "parent_id": "t3_kqy410",
            "score": 1,
            "created_utc": 1609886578.0,
            "replies": []
        },
        {
            "body": "Please continue this saga, I am entranced!",
            "author": "RealEarthAngel",
            "id": "gi8j3nd",
            "parent_id": "t3_kqy410",
            "score": 1,
            "created_utc": 1609887271.0,
            "replies": []
        },
        {
            "body": "Thanks for updating us!\n\nBtw, watch the movie Chloe with Julianne Moore and Amanda Seyfried.",
            "author": "BlBl_SD",
            "id": "gi92jkl",
            "parent_id": "t3_kqy410",
            "score": 1,
            "created_utc": 1609895848.0,
            "replies": []
        },
        {
            "body": "Seriously, I would watch the hell out of this movie.  😂",
            "author": "kamagone",
            "id": "gi743f0",
            "parent_id": "t1_gi6fu2h",
            "score": 27,
            "created_utc": 1609866739.0,
            "replies": []
        },
        {
            "body": "First thing I thought. When can I see this on my Netflix",
            "author": "RockyLeal",
            "id": "gi8yv6r",
            "parent_id": "t1_gi6fu2h",
            "score": 3,
            "created_utc": 1609894010.0,
            "replies": []
        },
        {
            "body": "Chloe with Julianne Moore and Amanda Seyfried.",
            "author": "BlBl_SD",
            "id": "gibcv6k",
            "parent_id": "t1_gi6fu2h",
            "score": 1,
            "created_utc": 1609949571.0,
            "replies": []
        },
        {
            "body": "This is a good option; could ask in case it's someone I know already etc.... I have considered messaging SD1 just to say that his wife has contacted me in order to arrange a threesome...but that may be messy.",
            "author": "al3x400",
            "id": "gi6fsmz",
            "parent_id": "t1_gi6eye5",
            "score": 30,
            "created_utc": 1609854377.0,
            "replies": [
                {
                    "body": "Don’t involve SD1 until you know more about who she is bringing. Is she even bringing a male? Could be another female. If another guy keep this detail to yourself and consider you have a new $ source with the SD1’s wife now. Be safe and remember lube is your friend.",
                    "author": "zztop1999",
                    "id": "gi6gh0l",
                    "parent_id": "t1_gi6fsmz",
                    "score": 39,
                    "created_utc": 1609854797.0,
                    "replies": [
                        {
                            "body": "I agree w the above. Talk to SD2 and inquire about the woman. How did they meet. Find out if it's a sugar thing or affair. He may not even know she's married. \n\nAsk her for pic of the new partner. Don't involve SD1 just yet.  Maybe SD1 doesn't know his wife is having sex w other men ? Maybe this is her bringing another female into the mix at his request ?  Maybe they all know and are just enjoying your company?",
                            "author": "inafishbowl17",
                            "id": "gi6s0x2",
                            "parent_id": "t1_gi6gh0l",
                            "score": 18,
                            "created_utc": 1609861106.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "This is what a part of me thinks/hopes for. Maybe I am a pawn in a sex game amongst people with resources; I'm okay with that under the circumstances.",
            "author": "al3x400",
            "id": "gi6qv4v",
            "parent_id": "t1_gi6ljf1",
            "score": 20,
            "created_utc": 1609860529.0,
            "replies": [
                {
                    "body": "Love the way you put that! Hope you have fun and don’t have to deal with any crazy conflict",
                    "author": "kash62",
                    "id": "gi7l18v",
                    "parent_id": "t1_gi6qv4v",
                    "score": 1,
                    "created_utc": 1609874304.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "She has mentioned compensation for my time, I am assuming that it will the same as SD2 since she got my contact from him.",
            "author": "al3x400",
            "id": "gi6p8m4",
            "parent_id": "t1_gi6h34m",
            "score": 10,
            "created_utc": 1609859708.0,
            "replies": [
                {
                    "body": "I agree with who you replied to. Tell her you’re happy to see her with SD2 again but not with someone new.",
                    "author": "Cdnsugarr",
                    "id": "gi713o0",
                    "parent_id": "t1_gi6p8m4",
                    "score": 8,
                    "created_utc": 1609865363.0,
                    "replies": []
                },
                {
                    "body": "So one potential payout that will likely blow up or not lead to anything long term-versus two consistent SRs that you are happy in.... especially if you are relying on these funds during covid- I think you know what to do here..",
                    "author": "crystalxx32",
                    "id": "gi8vvn2",
                    "parent_id": "t1_gi6p8m4",
                    "score": 2,
                    "created_utc": 1609892503.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "He has other SRs, as do I. He talks about his SRs, I do not. He has not mentioned an open relationship, but then I have never asked. He volunteered his marital status himself. And yes, he does since I have seen them together.",
            "author": "al3x400",
            "id": "gi6qdao",
            "parent_id": "t1_gi6lv17",
            "score": 8,
            "created_utc": 1609860282.0,
            "replies": [
                {
                    "body": "I think you could unwind the situation one question at a time, with a \"go/no go\" decisions with each question. \n\n - Is he in an open marriage?  Yes, proceed.\n - If open, do they share details? Yes, proceed.\n - Is he okay if you had another SR? Yes, proceed.\n - Has he and his wife ever had a 3sum together? Yes, proceed.\n - Is he open to another 3sum with his wife?  Yes, proceed. \n - Would he be open to a 3sum with you and his wife?  Yes, proceed.  \n - Ask his wife if she is in an open marriage?  Yes, proceed.\n - Aks her if they share details with each other?  If yes, proceed.\n - Ask her if her husband knows about the 3sum you had?  Yes, proceed.\n - Ask her if her suggested 3sum is with her husband?  Yes, proceed.\n - Ask SD1 if he would be okay that you have already been intimate his his wife?  Yes, proceed.\n - Ask SD1 if he would be okay if his wife suggested a 3sum with all 3 of you?  Yes, proceed.\n - Ask SD1 if he is comfortable discussing the 3sum with all 3 of you with her?  Yes, proceed.\n\nAt any point along the way, if you get a negative answer, stop and don't proceed.",
                    "author": "willfromvb",
                    "id": "gi6sxvm",
                    "parent_id": "t1_gi6qdao",
                    "score": 11,
                    "created_utc": 1609861553.0,
                    "replies": [
                        {
                            "body": "We're getting pretty far out on the limb of this decision tree and assuming at each point the \"information\" we are getting is solid......  Like limbs of an old tree, the bark can cover the rot and then we become a student pilot without wings.",
                            "author": "pinotandsugar",
                            "id": "gi7nm61",
                            "parent_id": "t1_gi6sxvm",
                            "score": 3,
                            "created_utc": 1609875351.0,
                            "replies": [
                                {
                                    "body": "I like the analogy, but just like climbing a tree, you make sure each branch can hold your weight before trusting it.  By cross referencing the wife's answer with SD1, she can verify if the story holds without outing either one or herself.  The safest answer is not to climb the tree, but some people like to climb trees.  🤗",
                                    "author": "willfromvb",
                                    "id": "gi7prmr",
                                    "parent_id": "t1_gi7nm61",
                                    "score": 4,
                                    "created_utc": 1609876076.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Additionally, if she is including her husband in this potential threesome, she'd have to explain how she met you. If she is lying about it, she'd want to get her story straight with you.",
            "author": "SugarDandy212",
            "id": "gi6wgf4",
            "parent_id": "t1_gi6ss8a",
            "score": 1,
            "created_utc": 1609863198.0,
            "replies": []
        },
        {
            "body": "Ditto. I would be less unsure in more... financially secure times. It's not so much a matter of sugar as it is sustenance these days though...",
            "author": "al3x400",
            "id": "gi6qive",
            "parent_id": "t1_gi6jedl",
            "score": 4,
            "created_utc": 1609860360.0,
            "replies": []
        },
        {
            "body": "I think this is a good option. But then I would.be revealing SD1's affair to his Wife's other guy...I am trying to get through this without fucking things up for anyone. Especially myself!",
            "author": "al3x400",
            "id": "gi6qpg6",
            "parent_id": "t1_gi6ogia",
            "score": 9,
            "created_utc": 1609860451.0,
            "replies": [
                {
                    "body": "You don't need to reveal your relationship with SD1.  You have already had fun with SD2 and SD1wife.  SD1wife reaches out for another play date.  SD2 either knows that she wanted you again, or not. If he is aware, you can ask follow ups on her situation.  If he is in the dark, beg his discretion...but i would assume he will add background on his own.",
                    "author": "sdphilly",
                    "id": "gi75veq",
                    "parent_id": "t1_gi6qpg6",
                    "score": 6,
                    "created_utc": 1609867538.0,
                    "replies": [
                        {
                            "body": "Yup...that's actually an obvious thing to do! I'll message him!",
                            "author": "al3x400",
                            "id": "gi78621",
                            "parent_id": "t1_gi75veq",
                            "score": 3,
                            "created_utc": 1609868565.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Lol...I don't think she'd be a great SM. She isn't that interested in getting to know me, or at least she wasn't. She was very much about doing the business. But who knows, I'm not the type to make the proposal, but maybe she will.",
            "author": "al3x400",
            "id": "gi77u29",
            "parent_id": "t1_gi744gs",
            "score": 2,
            "created_utc": 1609868417.0,
            "replies": []
        },
        {
            "body": "You’re giving the kardashians way too much credit . This is more real housewives drama lol",
            "author": "Disastrous_Author638",
            "id": "gi6p7ij",
            "parent_id": "t1_gi6d4kc",
            "score": 9,
            "created_utc": 1609859693.0,
            "replies": [
                {
                    "body": "Good point!",
                    "author": "GSSD",
                    "id": "gi6q65z",
                    "parent_id": "t1_gi6p7ij",
                    "score": 4,
                    "created_utc": 1609860181.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "If they were fun loving individuals they would be open about the situation not secretive.",
            "author": "wildhorses6565",
            "id": "gi714mz",
            "parent_id": "t1_gi6imxl",
            "score": 1,
            "created_utc": 1609865374.0,
            "replies": []
        },
        {
            "body": "Don’t involve SD1 until you know more about who she is bringing. Is she even bringing a male? Could be another female. If another guy keep this detail to yourself and consider you have a new $ source with the SD1’s wife now. Be safe and remember lube is your friend.",
            "author": "zztop1999",
            "id": "gi6gh0l",
            "parent_id": "t1_gi6fsmz",
            "score": 39,
            "created_utc": 1609854797.0,
            "replies": [
                {
                    "body": "I agree w the above. Talk to SD2 and inquire about the woman. How did they meet. Find out if it's a sugar thing or affair. He may not even know she's married. \n\nAsk her for pic of the new partner. Don't involve SD1 just yet.  Maybe SD1 doesn't know his wife is having sex w other men ? Maybe this is her bringing another female into the mix at his request ?  Maybe they all know and are just enjoying your company?",
                    "author": "inafishbowl17",
                    "id": "gi6s0x2",
                    "parent_id": "t1_gi6gh0l",
                    "score": 18,
                    "created_utc": 1609861106.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Love the way you put that! Hope you have fun and don’t have to deal with any crazy conflict",
            "author": "kash62",
            "id": "gi7l18v",
            "parent_id": "t1_gi6qv4v",
            "score": 1,
            "created_utc": 1609874304.0,
            "replies": []
        },
        {
            "body": "I agree with who you replied to. Tell her you’re happy to see her with SD2 again but not with someone new.",
            "author": "Cdnsugarr",
            "id": "gi713o0",
            "parent_id": "t1_gi6p8m4",
            "score": 8,
            "created_utc": 1609865363.0,
            "replies": []
        },
        {
            "body": "So one potential payout that will likely blow up or not lead to anything long term-versus two consistent SRs that you are happy in.... especially if you are relying on these funds during covid- I think you know what to do here..",
            "author": "crystalxx32",
            "id": "gi8vvn2",
            "parent_id": "t1_gi6p8m4",
            "score": 2,
            "created_utc": 1609892503.0,
            "replies": []
        },
        {
            "body": "I think you could unwind the situation one question at a time, with a \"go/no go\" decisions with each question. \n\n - Is he in an open marriage?  Yes, proceed.\n - If open, do they share details? Yes, proceed.\n - Is he okay if you had another SR? Yes, proceed.\n - Has he and his wife ever had a 3sum together? Yes, proceed.\n - Is he open to another 3sum with his wife?  Yes, proceed. \n - Would he be open to a 3sum with you and his wife?  Yes, proceed.  \n - Ask his wife if she is in an open marriage?  Yes, proceed.\n - Aks her if they share details with each other?  If yes, proceed.\n - Ask her if her husband knows about the 3sum you had?  Yes, proceed.\n - Ask her if her suggested 3sum is with her husband?  Yes, proceed.\n - Ask SD1 if he would be okay that you have already been intimate his his wife?  Yes, proceed.\n - Ask SD1 if he would be okay if his wife suggested a 3sum with all 3 of you?  Yes, proceed.\n - Ask SD1 if he is comfortable discussing the 3sum with all 3 of you with her?  Yes, proceed.\n\nAt any point along the way, if you get a negative answer, stop and don't proceed.",
            "author": "willfromvb",
            "id": "gi6sxvm",
            "parent_id": "t1_gi6qdao",
            "score": 11,
            "created_utc": 1609861553.0,
            "replies": [
                {
                    "body": "We're getting pretty far out on the limb of this decision tree and assuming at each point the \"information\" we are getting is solid......  Like limbs of an old tree, the bark can cover the rot and then we become a student pilot without wings.",
                    "author": "pinotandsugar",
                    "id": "gi7nm61",
                    "parent_id": "t1_gi6sxvm",
                    "score": 3,
                    "created_utc": 1609875351.0,
                    "replies": [
                        {
                            "body": "I like the analogy, but just like climbing a tree, you make sure each branch can hold your weight before trusting it.  By cross referencing the wife's answer with SD1, she can verify if the story holds without outing either one or herself.  The safest answer is not to climb the tree, but some people like to climb trees.  🤗",
                            "author": "willfromvb",
                            "id": "gi7prmr",
                            "parent_id": "t1_gi7nm61",
                            "score": 4,
                            "created_utc": 1609876076.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "You don't need to reveal your relationship with SD1.  You have already had fun with SD2 and SD1wife.  SD1wife reaches out for another play date.  SD2 either knows that she wanted you again, or not. If he is aware, you can ask follow ups on her situation.  If he is in the dark, beg his discretion...but i would assume he will add background on his own.",
            "author": "sdphilly",
            "id": "gi75veq",
            "parent_id": "t1_gi6qpg6",
            "score": 6,
            "created_utc": 1609867538.0,
            "replies": [
                {
                    "body": "Yup...that's actually an obvious thing to do! I'll message him!",
                    "author": "al3x400",
                    "id": "gi78621",
                    "parent_id": "t1_gi75veq",
                    "score": 3,
                    "created_utc": 1609868565.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Good point!",
            "author": "GSSD",
            "id": "gi6q65z",
            "parent_id": "t1_gi6p7ij",
            "score": 4,
            "created_utc": 1609860181.0,
            "replies": []
        },
        {
            "body": "I agree w the above. Talk to SD2 and inquire about the woman. How did they meet. Find out if it's a sugar thing or affair. He may not even know she's married. \n\nAsk her for pic of the new partner. Don't involve SD1 just yet.  Maybe SD1 doesn't know his wife is having sex w other men ? Maybe this is her bringing another female into the mix at his request ?  Maybe they all know and are just enjoying your company?",
            "author": "inafishbowl17",
            "id": "gi6s0x2",
            "parent_id": "t1_gi6gh0l",
            "score": 18,
            "created_utc": 1609861106.0,
            "replies": []
        },
        {
            "body": "We're getting pretty far out on the limb of this decision tree and assuming at each point the \"information\" we are getting is solid......  Like limbs of an old tree, the bark can cover the rot and then we become a student pilot without wings.",
            "author": "pinotandsugar",
            "id": "gi7nm61",
            "parent_id": "t1_gi6sxvm",
            "score": 3,
            "created_utc": 1609875351.0,
            "replies": [
                {
                    "body": "I like the analogy, but just like climbing a tree, you make sure each branch can hold your weight before trusting it.  By cross referencing the wife's answer with SD1, she can verify if the story holds without outing either one or herself.  The safest answer is not to climb the tree, but some people like to climb trees.  🤗",
                    "author": "willfromvb",
                    "id": "gi7prmr",
                    "parent_id": "t1_gi7nm61",
                    "score": 4,
                    "created_utc": 1609876076.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Yup...that's actually an obvious thing to do! I'll message him!",
            "author": "al3x400",
            "id": "gi78621",
            "parent_id": "t1_gi75veq",
            "score": 3,
            "created_utc": 1609868565.0,
            "replies": []
        },
        {
            "body": "I like the analogy, but just like climbing a tree, you make sure each branch can hold your weight before trusting it.  By cross referencing the wife's answer with SD1, she can verify if the story holds without outing either one or herself.  The safest answer is not to climb the tree, but some people like to climb trees.  🤗",
            "author": "willfromvb",
            "id": "gi7prmr",
            "parent_id": "t1_gi7nm61",
            "score": 4,
            "created_utc": 1609876076.0,
            "replies": []
        }
    ]
}