{
    "title": "\"I fucked hotter girls before and I didn't have to pay for it.\"",
    "post_id": "h9uz9v",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/h9uz9v/i_fucked_hotter_girls_before_and_i_didnt_have_to/",
    "author": "Randombabe21",
    "body": "Okay this guy is cream of the salt, from a while back. \n\nWe agreed upon an allowance before and after M&G we went on a second date. He touched me A LOT while we were walking and I clearly said I was not comfortable. When we reached the hotel, I sticked to the community rule: sugar before sugaring. \n\nThus he said that (title) and started to criticize that my thighs are fat (I'm 5'4, 110lbs, in my country, Singapore, they worship skinny girls) (while still couldn't get his hands off me!!). I slammed the hotel door and left. \n\nOmg this just comes off as a huge loser I knew it. Though I didn't get scammed, it crushed my confidence yet again, fyi I had anorexia before due to body dysmorphia and finally gained back some weight. \n\nNow with our lockdown measures eased, I'm wondering if the sugar bowl is really for me as I am VERY weak in taking critics about my fats.",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/h9uz9v/i_fucked_hotter_girls_before_and_i_didnt_have_to/",
    "score": 125,
    "upvote_ratio": 0.96,
    "created_utc": 1592275723.0,
    "num_comments": 26,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "There are PUAs in the bowl, and they may insult you when you call them out.   At 5'4\", 110 pounds, I guarantee your thighs are not fat.",
            "author": "UseTheForceRey",
            "id": "fuz8j3f",
            "parent_id": "t3_h9uz9v",
            "score": 84,
            "created_utc": 1592280620.0,
            "replies": [
                {
                    "body": "Agreed. Objectively speaking, you can't have fat thighs. This guy probably just guessed the body part that makes you most anxious. Good for you for walking away!",
                    "author": "Laforge2bridge",
                    "id": "fv0cz7i",
                    "parent_id": "t1_fuz8j3f",
                    "score": 18,
                    "created_utc": 1592314445.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "fuzvxum",
            "parent_id": "t3_h9uz9v",
            "score": 24,
            "created_utc": 1592301133.0,
            "replies": [
                {
                    "body": "> lil dick having ass\n\nThat's a cool body shaming you got going on there... are you proud?",
                    "author": null,
                    "id": "fv2rqhi",
                    "parent_id": "t1_fuzvxum",
                    "score": 1,
                    "created_utc": 1592356611.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "fv8wjsm",
                            "parent_id": "t1_fv2rqhi",
                            "score": 1,
                            "created_utc": 1592498270.0,
                            "replies": [
                                {
                                    "body": ">\"lil dick ENERGY having ass.\" \n\nIt's still body shaming, because having a lil dick means you are an asshole/insecure right?\n\nImagine if we told women: you have \"small boob energy\"",
                                    "author": null,
                                    "id": "fv8xn6n",
                                    "parent_id": "t1_fv8wjsm",
                                    "score": 0,
                                    "created_utc": 1592498797.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "So sorry you experienced this. That is messed up.  But I’m glad to hear you were able to get out of the situation! \n\nSending love and support from a fellow recoverer💙💚",
            "author": "JetsetterBabe",
            "id": "fuz84kd",
            "parent_id": "t3_h9uz9v",
            "score": 18,
            "created_utc": 1592280349.0,
            "replies": []
        },
        {
            "body": "Gurl you didn’t deserve that. 110 lbs is not fat. We’re the same height and weight and I can say it is just proportional. Whoever Ahole was that, he’s ugly inside and don’t deserve women. Don’t let anyone touch you without you being comfy. You deserve better girl! Sending positivity to you💖",
            "author": "cranerish",
            "id": "fuzp8f2",
            "parent_id": "t3_h9uz9v",
            "score": 8,
            "created_utc": 1592294317.0,
            "replies": [
                {
                    "body": "110 lbs is 49.94 kg",
                    "author": "converter-bot",
                    "id": "fuzp8hw",
                    "parent_id": "t1_fuzp8f2",
                    "score": 10,
                    "created_utc": 1592294319.0,
                    "replies": [
                        {
                            "body": "Good bot!",
                            "author": "BinghamtonSD",
                            "id": "fuzq1mk",
                            "parent_id": "t1_fuzp8hw",
                            "score": 9,
                            "created_utc": 1592295118.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Just imagine him sitting on the bed alone with blue balls and a broken ego in a hotel he had to pay for, thinking about how his plan to scam you failed. Trust me, you won in this situation and he knows it. Remind yourself of that too! 💕",
            "author": "Assman_99",
            "id": "fv0eq52",
            "parent_id": "t3_h9uz9v",
            "score": 6,
            "created_utc": 1592315454.0,
            "replies": []
        },
        {
            "body": "Haha if you were really fat or unattractive to him he wouldn't have his hands all over you. He's had his ego hurt cause you said your uncomfortable which you should. His ego takes a shot but instead of taking it an learning from it he attacks you verbally to supplement his brittle ego. Have confidence in yourself cause he won't be the last loser you come across",
            "author": "squeeze_it_do_it",
            "id": "fuzzsxr",
            "parent_id": "t3_h9uz9v",
            "score": 4,
            "created_utc": 1592304812.0,
            "replies": []
        },
        {
            "body": "Sorry to hear of this.  Keep your head up and have thick skin--you'll need it for the bowl, and I can assure you are totally fine.  Anorexic skinny may be in with many Asian countries, but that's not every SD you'll encounter no matter where you are!  Slimeball just wanted free sex.",
            "author": null,
            "id": "fuzjcwx",
            "parent_id": "t3_h9uz9v",
            "score": 7,
            "created_utc": 1592288934.0,
            "replies": []
        },
        {
            "body": "Why do men always revert to insults when they don't get to sleep with you? Remember you're the one pursuing me.",
            "author": "veganhotdoggie",
            "id": "fv15rft",
            "parent_id": "t3_h9uz9v",
            "score": 3,
            "created_utc": 1592327910.0,
            "replies": []
        },
        {
            "body": "If it makes you feel any better, his anger is not with you but at something in his past that he takes out on you.   \n\n\nMaybe he was rejected by cute girls in his past and when rejected by you he attacks.  \n\n\nHe also could be an a1 asshole, creep, and someone I would avoid ever contacting again.   \n\n\nFinally, as a 5'6 250+ guy, I'd walk to Singapore for a girl with your stats. Keep your head up, block and lose this dude and find someone who thinks the sun rises and sets in your thighs.",
            "author": "TexasSD",
            "id": "fuzc5ch",
            "parent_id": "t3_h9uz9v",
            "score": 7,
            "created_utc": 1592283157.0,
            "replies": [
                {
                    "body": "Omg yes :(( I just wanted things we agreed upon.  Thanks for the encouragement :D",
                    "author": "Randombabe21",
                    "id": "fuzyjb2",
                    "parent_id": "t1_fuzc5ch",
                    "score": 1,
                    "created_utc": 1592303643.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "The issue when deciding to return to the bowl is whether you will be able to recognise the red flags with a POT like this.\nYou did the right thing when you walked out of the hotel.  Sounds like you dodged a bullet.  Well done.\n\nFor next time will you be able to identify a POT who is a dick earlier so you don’t waste your time and endanger yourself.   You don’t have to put up with the poor behaviour and insults if you can identify the dick earlier.\n\nCan you identify when during your conversations with him you started to recognise red flags?\nYou mentioned inappropriate touching... but were there other warning signs even earlier?",
            "author": "bradpitt3",
            "id": "fuzn7h2",
            "parent_id": "t3_h9uz9v",
            "score": 2,
            "created_utc": 1592292364.0,
            "replies": [
                {
                    "body": "Mm... I suspect he was very good at pretending to be nice at M&G and texting. While during the actual meeting he just did whatever he could to get something outta the girl (like touching non-stop). Sigh...... \nOne possible red flag was that he was rushing to meet :(",
                    "author": "Randombabe21",
                    "id": "fuzyc00",
                    "parent_id": "t1_fuzn7h2",
                    "score": 2,
                    "created_utc": 1592303454.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "That guy sucks! 5'4\" and 110 lbs is very petite. I'm taller and heavier than you are -5'5\" and 120 lbs-, and I still wear a size XS/S in most things. You are objectively thin. I know body weight distributes differently on everyone and everyone's proportions are different, but there's no possible way you could even be called a little bit chubby, let alone fat. That guy is just a douchcanoe. \n\nGood for you for sticking to your guns and insisting on sugar before sugaring, and for walking out on him when he doubled down and acted like an asshole. You deserve MUCH better than that.",
            "author": "bourbonandblonde",
            "id": "fv2pbu1",
            "parent_id": "t3_h9uz9v",
            "score": 2,
            "created_utc": 1592355188.0,
            "replies": []
        },
        {
            "body": "eugh thats shit. i totally get you tho, i moved to singapore a few years ago and developed bulimia (there was a combination of reasons but the shitty body ideals over there really took a toll on me). i haven't done any sugaring over there yet but it sounds like this dude is an asshole and im sure you'll have much better experiences if you choose to continue!",
            "author": "fei010817",
            "id": "fv00yrc",
            "parent_id": "t3_h9uz9v",
            "score": 1,
            "created_utc": 1592305861.0,
            "replies": []
        },
        {
            "body": "You and I are the same size. I wear XS/S in all of my clothes. There is nothing fat about you. He was trying to hurt you because his ego was feeling bruised at the rejection. Good for you for leaving. A guy made a similar comment to me “you’re a little fatter than I usually like” I saw him once more after that and he asked if I had gained any weight. I told him, “Just for you” 🙄\n\nThere is nothing wrong with your size. In fact, any less would be considered unhealthy. \n\nExercising, for me, builds confidence because I feel stronger. My body issue is that I feel like my arms look like twigs. Running and swimming are fantastic. Just be careful to keep in mind why you’re doing it so it doesn’t cross into unhealthy obsession. A counselor/psychologist can help with that.",
            "author": "playgroundinthesky",
            "id": "fv0eoic",
            "parent_id": "t3_h9uz9v",
            "score": 1,
            "created_utc": 1592315428.0,
            "replies": []
        },
        {
            "body": "sugar before sugaring\n\nGood job! You exposed this DB for what he is-a scammer. You were never going to see a dime. Sadly narcissists are very good at gaslighting and intuitively know how to diminish others to make them seem better. I only dream about BMIs of 18.",
            "author": "GSSD",
            "id": "fv0nx0q",
            "parent_id": "t3_h9uz9v",
            "score": 1,
            "created_utc": 1592320300.0,
            "replies": []
        },
        {
            "body": "Hey feel better! Don't let this tiny dick prick get to you, he couldn't handle a woman skinny or fat so he aims for insecurities! Kill them with confidence girl! Big Hugs from the Big SB!",
            "author": "Ipatchcat",
            "id": "fv1fb6w",
            "parent_id": "t3_h9uz9v",
            "score": 1,
            "created_utc": 1592332271.0,
            "replies": []
        },
        {
            "body": "That’s not a reflection of you, but it’s a reflection of who they are. He’s such a lame asshole for being on a sugar dating site thinking he can have sex with you without providing.",
            "author": "wndrlnds",
            "id": "fv1rxb3",
            "parent_id": "t3_h9uz9v",
            "score": 1,
            "created_utc": 1592337866.0,
            "replies": []
        },
        {
            "body": "I am way bigger than you! I am 5’6 and thick, don’t lose confidence! He is just broke, fake with a complex.",
            "author": null,
            "id": "fv2anc7",
            "parent_id": "t3_h9uz9v",
            "score": 1,
            "created_utc": 1592346992.0,
            "replies": []
        },
        {
            "body": "Hello from singapore too! Anyway nah the guy is a dick. Like people have said, he was just trying to convince you that you are fat and that by sleeping with you he is doing you a fav. Typical PUA behaviour. I would say that with more people joining seeking, you will meet more people like these!  Also 5\"4 110lbs is not fat.",
            "author": "AznSD",
            "id": "fv2optd",
            "parent_id": "t3_h9uz9v",
            "score": 1,
            "created_utc": 1592354831.0,
            "replies": []
        },
        {
            "body": "At 110 u are Bordeline underweight honey.  Your tights are not fat. In comparison I am 5’4 and 140 lbs and I know I am sexy as hell 😂 my tights are bigger than yours 😂😂😇😇",
            "author": "alicia85xxx",
            "id": "fv0g68o",
            "parent_id": "t3_h9uz9v",
            "score": 1,
            "created_utc": 1592316267.0,
            "replies": []
        },
        {
            "body": "he's an idiot, he should have said he'll give you half now then half after. if you said no to that, then you're the idiot\n\nbtw, all my sugar babies i pay after the meet. none have complained about it. except one time the girl demanded i pay her first, but that was the first time. after the first time and they see i'm not scamming or bullshitting, then they don't care and i just send it after",
            "author": "absolutelyhere11",
            "id": "fv33bjz",
            "parent_id": "t3_h9uz9v",
            "score": 0,
            "created_utc": 1592363555.0,
            "replies": []
        },
        {
            "body": "Agreed. Objectively speaking, you can't have fat thighs. This guy probably just guessed the body part that makes you most anxious. Good for you for walking away!",
            "author": "Laforge2bridge",
            "id": "fv0cz7i",
            "parent_id": "t1_fuz8j3f",
            "score": 18,
            "created_utc": 1592314445.0,
            "replies": []
        },
        {
            "body": "> lil dick having ass\n\nThat's a cool body shaming you got going on there... are you proud?",
            "author": null,
            "id": "fv2rqhi",
            "parent_id": "t1_fuzvxum",
            "score": 1,
            "created_utc": 1592356611.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "fv8wjsm",
                    "parent_id": "t1_fv2rqhi",
                    "score": 1,
                    "created_utc": 1592498270.0,
                    "replies": [
                        {
                            "body": ">\"lil dick ENERGY having ass.\" \n\nIt's still body shaming, because having a lil dick means you are an asshole/insecure right?\n\nImagine if we told women: you have \"small boob energy\"",
                            "author": null,
                            "id": "fv8xn6n",
                            "parent_id": "t1_fv8wjsm",
                            "score": 0,
                            "created_utc": 1592498797.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "110 lbs is 49.94 kg",
            "author": "converter-bot",
            "id": "fuzp8hw",
            "parent_id": "t1_fuzp8f2",
            "score": 10,
            "created_utc": 1592294319.0,
            "replies": [
                {
                    "body": "Good bot!",
                    "author": "BinghamtonSD",
                    "id": "fuzq1mk",
                    "parent_id": "t1_fuzp8hw",
                    "score": 9,
                    "created_utc": 1592295118.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Omg yes :(( I just wanted things we agreed upon.  Thanks for the encouragement :D",
            "author": "Randombabe21",
            "id": "fuzyjb2",
            "parent_id": "t1_fuzc5ch",
            "score": 1,
            "created_utc": 1592303643.0,
            "replies": []
        },
        {
            "body": "Mm... I suspect he was very good at pretending to be nice at M&G and texting. While during the actual meeting he just did whatever he could to get something outta the girl (like touching non-stop). Sigh...... \nOne possible red flag was that he was rushing to meet :(",
            "author": "Randombabe21",
            "id": "fuzyc00",
            "parent_id": "t1_fuzn7h2",
            "score": 2,
            "created_utc": 1592303454.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "fv8wjsm",
            "parent_id": "t1_fv2rqhi",
            "score": 1,
            "created_utc": 1592498270.0,
            "replies": [
                {
                    "body": ">\"lil dick ENERGY having ass.\" \n\nIt's still body shaming, because having a lil dick means you are an asshole/insecure right?\n\nImagine if we told women: you have \"small boob energy\"",
                    "author": null,
                    "id": "fv8xn6n",
                    "parent_id": "t1_fv8wjsm",
                    "score": 0,
                    "created_utc": 1592498797.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Good bot!",
            "author": "BinghamtonSD",
            "id": "fuzq1mk",
            "parent_id": "t1_fuzp8hw",
            "score": 9,
            "created_utc": 1592295118.0,
            "replies": []
        },
        {
            "body": ">\"lil dick ENERGY having ass.\" \n\nIt's still body shaming, because having a lil dick means you are an asshole/insecure right?\n\nImagine if we told women: you have \"small boob energy\"",
            "author": null,
            "id": "fv8xn6n",
            "parent_id": "t1_fv8wjsm",
            "score": 0,
            "created_utc": 1592498797.0,
            "replies": []
        }
    ]
}