{
    "title": "Is anyone else extremely turned off by men complaining about women on the site on their profile?",
    "post_id": "mejsjj",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/mejsjj/is_anyone_else_extremely_turned_off_by_men/",
    "author": "nycnoa",
    "body": "I’ve recently made a return back to the bowl and someone sent me a quick message to “read their profile,” and to text them if I was interested. For their about me they had about a sentence of just one worded vague traits(articulate, athletic, nature, tech) that told me nothing about them. A majority of the few traits had something to do with money. I really can’t find out much about someone off of 15 words.\n\nHowever for the Seeking section, it turns out they did have some writing skills! The first sentence comments on how “most women on here have to be kidding if they think they’re hot.” Spectacular start. In 8 paragraphs he wrote exactly what he was seeking! How most girls are not attractive, liars, and stupid! He also does not wait in line and holds interviews but getting an interview does not mean someone is accepted or not. \n\nThe girls also must be naturally attractive and he isn’t into sloppy seconds, thirds, or hundreds. He knows the difference between fresh untapped and these girls, “Must pass interview and inspection.” Are we cars? He just blocked me because I mentioned how I’d rather know more about his hobbies then read about his utter disregard for women. God. I always forget when I reenter the bowl again how loaded up the misogyny is on seeking. Please look at women as people.",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/mejsjj/is_anyone_else_extremely_turned_off_by_men/",
    "score": 252,
    "upvote_ratio": 0.95,
    "created_utc": 1616870472.0,
    "num_comments": 63,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "Any negativity on a profile is a turn-off.  Also, 9 times out of 10, anytime someone tells me to read their profile or has \"read my profile\" in their headline, their profile sucks.\n\nI don't get frustrated over this type of thing, I look at it as a fantastic filter.  Saved me time messaging and interacting with them before finding out they suck",
            "author": "Azurecole",
            "id": "gshq8os",
            "parent_id": "t3_mejsjj",
            "score": 98,
            "created_utc": 1616872238.0,
            "replies": [
                {
                    "body": "People that say \"read my profile\" are pretty much saying that their profile is their disclaimer for anything else they will communicate or bad behavior they will exhibit during interactions. It's like a WARNING label for household cleaners that have toxic chemicals except these people usually have toxic personalities.\n\nAbsolutely a filter.",
                    "author": "MidwestSB",
                    "id": "gshxxuf",
                    "parent_id": "t1_gshq8os",
                    "score": 33,
                    "created_utc": 1616874585.0,
                    "replies": [
                        {
                            "body": "I like to read them to see what is so special, I’ve yet to find it, lol.",
                            "author": "OffhandCut",
                            "id": "gsieu6y",
                            "parent_id": "t1_gshxxuf",
                            "score": 9,
                            "created_utc": 1616880272.0,
                            "replies": [
                                {
                                    "body": "I'm with you, I always read them!  I am looking to find that silver-tongued succubus whose velvet prose binds my heart\n\nStill, mostly get demands, negativity, and toxicity, surrounded by generic basicness.  The search continues!",
                                    "author": "Azurecole",
                                    "id": "gsilhe3",
                                    "parent_id": "t1_gsieu6y",
                                    "score": 4,
                                    "created_utc": 1616882456.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "I got a \"did you read my profile??\" angry message from someone once and I had to point out that they had no profile text.",
                            "author": "wikishart",
                            "id": "gsk6vrk",
                            "parent_id": "t1_gshxxuf",
                            "score": 4,
                            "created_utc": 1616915827.0,
                            "replies": [
                                {
                                    "body": "Priceless",
                                    "author": "Momopllc",
                                    "id": "gslqj1h",
                                    "parent_id": "t1_gsk6vrk",
                                    "score": 1,
                                    "created_utc": 1616955590.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "> Any negativity on a profile is a turn-off\n\nTook the words out of my mouth.  And that applies to an awful lot of situations, not just online profiles.",
                    "author": "SpacemanLost",
                    "id": "gsis2z8",
                    "parent_id": "t1_gshq8os",
                    "score": 4,
                    "created_utc": 1616885907.0,
                    "replies": []
                },
                {
                    "body": "+1. This is all ya need to hear, OP.",
                    "author": "quietgrey1",
                    "id": "gsk6lk2",
                    "parent_id": "t1_gshq8os",
                    "score": 1,
                    "created_utc": 1616915558.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gsixkpr",
            "parent_id": "t3_mejsjj",
            "score": 49,
            "created_utc": 1616888921.0,
            "replies": [
                {
                    "body": "It makes me wish I had a scam going. 😂",
                    "author": "sallybluntz",
                    "id": "gsjdq7o",
                    "parent_id": "t1_gsixkpr",
                    "score": 8,
                    "created_utc": 1616896371.0,
                    "replies": []
                },
                {
                    "body": "Lol so true 🤣🤣",
                    "author": "CompetitiveAppealSB",
                    "id": "gsjuoit",
                    "parent_id": "t1_gsixkpr",
                    "score": 1,
                    "created_utc": 1616906019.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Any negativity in a profile is a turn off.  There are things we all don't like about the bowl, but broadcasting them on your profile makes it seem like you assume those traits are commonplace and does a disservice to the majority of people viewing your profile.",
            "author": "storm170",
            "id": "gshn3cx",
            "parent_id": "t3_mejsjj",
            "score": 23,
            "created_utc": 1616871238.0,
            "replies": [
                {
                    "body": "Your profile serves as an advertisement for yourself not a billboard for complaints. I feel like you can complain about people on the site on a first date or on a phone call. If you have more complaining and demeaning language in your profile rather then facts, hobbies, or traits about yourself... a bit telling of someone’s lack of depth and insufferable-ness",
                    "author": "nycnoa",
                    "id": "gshoxw1",
                    "parent_id": "t1_gshn3cx",
                    "score": 11,
                    "created_utc": 1616871851.0,
                    "replies": [
                        {
                            "body": "> Your profile serves as an advertisement for yourself not a billboard for complaints\n\nSome people just have a negative outlook on life in general, though, and they *are* complainers. So those are not two mutually-exclusive things, really.",
                            "author": "Y_4Z44",
                            "id": "gsi8dhs",
                            "parent_id": "t1_gshoxw1",
                            "score": 3,
                            "created_utc": 1616878140.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I've recently seen a lot of \"I'm not like the typical woman on this site...\" lately, mostly from women who fail to really distinguish themselves.",
            "author": "non_giant_panda",
            "id": "gshw29w",
            "parent_id": "t3_mejsjj",
            "score": 16,
            "created_utc": 1616873965.0,
            "replies": [
                {
                    "body": "“Not like other girls” rhetoric is a turn off for most women too bleh",
                    "author": "kirathekira",
                    "id": "gsj3o0p",
                    "parent_id": "t1_gshw29w",
                    "score": 14,
                    "created_utc": 1616892277.0,
                    "replies": []
                },
                {
                    "body": "The funny part is, how would I, as a SB, even know what most the other women on the site are like to even make such a statement?",
                    "author": "sallybluntz",
                    "id": "gsjeink",
                    "parent_id": "t1_gshw29w",
                    "score": 6,
                    "created_utc": 1616896836.0,
                    "replies": [
                        {
                            "body": "To create an additional male profile just for that sort of research:)",
                            "author": "Gigi9662",
                            "id": "gske1z9",
                            "parent_id": "t1_gsjeink",
                            "score": 1,
                            "created_utc": 1616922771.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "\"I'm not like other girls.\" *3 boring sentences later* \"I enjoy hiking, watching movies, and dogs.\" \n\n🙄",
                    "author": "2catsandacomputer",
                    "id": "gslalfr",
                    "parent_id": "t1_gshw29w",
                    "score": 6,
                    "created_utc": 1616948229.0,
                    "replies": [
                        {
                            "body": "I also like the same 5 fashion brands as everyone else, I follow the same makeup trends, I have my lip fillers and my BBL, and I will call you babe or hun after the third text exchange.",
                            "author": "wikishart",
                            "id": "gslgs1n",
                            "parent_id": "t1_gslalfr",
                            "score": 3,
                            "created_utc": 1616951007.0,
                            "replies": []
                        },
                        {
                            "body": ">and dogs.\n\nThis made me laugh when I saw your username. 🤣",
                            "author": "non_giant_panda",
                            "id": "gslhi2l",
                            "parent_id": "t1_gslalfr",
                            "score": 2,
                            "created_utc": 1616951339.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I get turned off by all complaining on profiles — yep we all know there’s a lot of bs in this world but let’s focus on the people we might like rather than the 99% we aren’t interested in.",
            "author": "daddoms",
            "id": "gshmvuq",
            "parent_id": "t3_mejsjj",
            "score": 12,
            "created_utc": 1616871132.0,
            "replies": []
        },
        {
            "body": "God the amount of times I see “no fatties” is just an automatic next to me. I’m really thin but that just shows what poor character those men are, oh poor you you get contacted by people you aren’t attracted to, join the club 🥴",
            "author": "kirathekira",
            "id": "gsizx9e",
            "parent_id": "t3_mejsjj",
            "score": 28,
            "created_utc": 1616890197.0,
            "replies": [
                {
                    "body": "And let's be honest, 2/3 of the men who write \"no fatties\" have bitch tits.",
                    "author": null,
                    "id": "gsl7dvt",
                    "parent_id": "t1_gsizx9e",
                    "score": 6,
                    "created_utc": 1616946732.0,
                    "replies": []
                },
                {
                    "body": "Yes it awlful, its fine to have things you are attracted ie a body shape range but why be negative you can still get point across in a nice way. Why be toxic",
                    "author": "Momopllc",
                    "id": "gslqvgk",
                    "parent_id": "t1_gsizx9e",
                    "score": 3,
                    "created_utc": 1616955754.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "He's not into sloppy seconds-- is he saying he wants a VIRGIN? Lmao, how sad. Any man who will only deign to date virgins is basically announcing \"I'm not confident about my skills in bed and only want to date women with no basis of comparison so I can dictate what is normal to them about every aspect of our sexual encounters!!\"\n\nTbh a guy not being that great in bed is not a dealbreaker at all- a man who is loudly and angrily insecure about his sex skills to the point that he has to be rude to women to compensate, however, absolutely is.",
            "author": "ColdHeaux",
            "id": "gsiolrk",
            "parent_id": "t3_mejsjj",
            "score": 20,
            "created_utc": 1616884042.0,
            "replies": [
                {
                    "body": ">He's not into sloppy seconds-- is he saying he wants a VIRGIN? Lmao, how sad.\n\nI assume that's what the \"interview and inspection\" would be all about. It's not just sad, it's disturbing for all the reasons you laid out and more.\n\nHe sounds like an utter creep.",
                    "author": "Sophs_B",
                    "id": "gsk52k1",
                    "parent_id": "t1_gsiolrk",
                    "score": 6,
                    "created_utc": 1616914128.0,
                    "replies": [
                        {
                            "body": "Exactly, what the fuck does \"inspection\" mean, are you going to make sure my hymen is intact?? Ludicrous",
                            "author": "ColdHeaux",
                            "id": "gslmxit",
                            "parent_id": "t1_gsk52k1",
                            "score": 6,
                            "created_utc": 1616953870.0,
                            "replies": []
                        },
                        {
                            "body": "What bothers me about the \"virgin\" rhetoric is that just because you have or don't have a hymen doesn't mean you are/aren't a virgin. But then again, I wouldn't expect anyone who thinks they can \"inspect\" women to tell, to know that.",
                            "author": "2catsandacomputer",
                            "id": "gslaq9h",
                            "parent_id": "t1_gsk52k1",
                            "score": 3,
                            "created_utc": 1616948292.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Oh my god, YES. It’s online dating 101, I can’t believe so many people haven’t gotten that memo. But yeah like others have said here, it’s a great asshole filter.",
            "author": "coffeepolynkittens",
            "id": "gsil9au",
            "parent_id": "t3_mejsjj",
            "score": 7,
            "created_utc": 1616882387.0,
            "replies": []
        },
        {
            "body": "Hey, they are doing you and other SBs a favor by revealing who they are upfront.",
            "author": "uniballSD",
            "id": "gshqtqq",
            "parent_id": "t3_mejsjj",
            "score": 5,
            "created_utc": 1616872414.0,
            "replies": []
        },
        {
            "body": "I'm a SD am **I'm** turned off by it.  Don't settle in SR's for anything less than you want in a vanilla relationship.",
            "author": "TY2022",
            "id": "gsj1qz3",
            "parent_id": "t3_mejsjj",
            "score": 7,
            "created_utc": 1616891210.0,
            "replies": []
        },
        {
            "body": "All negativity is a turn off, especially if it’s your first impression of someone.",
            "author": null,
            "id": "gshxary",
            "parent_id": "t3_mejsjj",
            "score": 5,
            "created_utc": 1616874393.0,
            "replies": []
        },
        {
            "body": "True. Even if they think those things, just in terms of efficiency it would make sense to leave it out. Speaking like that gives a horrible first impression. \n\nPersonally I try to make my profile as inoffensive and courteous as possible. As well as my messaging. Cant even count how many times women have complemented me on being polite and well spoken compared to a lot of other guys on the site.\n\nMy current SB was hesitant to meet up with anyone due to being afraid, but told me she chose to meet up with me because she \"could tell I know how to treat women\".",
            "author": "YoMamas_azz",
            "id": "gsj0odk",
            "parent_id": "t3_mejsjj",
            "score": 5,
            "created_utc": 1616890616.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gsiorif",
            "parent_id": "t3_mejsjj",
            "score": 5,
            "created_utc": 1616884125.0,
            "replies": [
                {
                    "body": "actually, typical reason for negativity is projected low self esteem, and if you are well adjusted yourself it can be seen as a reason to feel empathy for the person.",
                    "author": "sucRoseToTheOccasion",
                    "id": "gsk2ifv",
                    "parent_id": "t1_gsiorif",
                    "score": 3,
                    "created_utc": 1616911898.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Obviously he is on a different planet ,  what percentage are like him in SA ???\n\nI am a NYC SD and I see sugar couples in every corner so you are in the best location as you know, just ignore them and focus on the good",
            "author": "shamloo77",
            "id": "gshyo0u",
            "parent_id": "t3_mejsjj",
            "score": 2,
            "created_utc": 1616874809.0,
            "replies": []
        },
        {
            "body": "Negativity is a turn off for both sides!",
            "author": null,
            "id": "gsi5bgv",
            "parent_id": "t3_mejsjj",
            "score": 2,
            "created_utc": 1616876965.0,
            "replies": []
        },
        {
            "body": "Pet hate is when they say how busy they are and don't waste my time like its a privilege they message back",
            "author": "wb19081908",
            "id": "gsj61d4",
            "parent_id": "t3_mejsjj",
            "score": 2,
            "created_utc": 1616893191.0,
            "replies": []
        },
        {
            "body": "Ew big red flag 🚩",
            "author": "Ricaaaaaaaaaaaaa",
            "id": "gsj90w9",
            "parent_id": "t3_mejsjj",
            "score": 2,
            "created_utc": 1616894358.0,
            "replies": []
        },
        {
            "body": "Eww and fuck no that's all I have to say as I block mindless drivel from my cute little eyes.  Plus I don't read past the first paragraph of shit like that.",
            "author": "KittenReigns",
            "id": "gsjlsop",
            "parent_id": "t3_mejsjj",
            "score": 2,
            "created_utc": 1616900935.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gsjugwi",
            "parent_id": "t3_mejsjj",
            "score": 2,
            "created_utc": 1616905888.0,
            "replies": [
                {
                    "body": "😂 looking at these comments made me realize I may not be as much of an asshole as I thought. I would never write or say these kinds of things but I’m curious now to see just how bad it is. Might be an extra single photo svetlana account on SA today",
                    "author": "kitkatbrainz",
                    "id": "gumahjd",
                    "parent_id": "t1_gsjugwi",
                    "score": 1,
                    "created_utc": 1618503072.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "misogyny, just in general, doesn't do it for me.",
            "author": "ruasrules",
            "id": "gsmjesm",
            "parent_id": "t3_mejsjj",
            "score": 2,
            "created_utc": 1616970158.0,
            "replies": []
        },
        {
            "body": "‘Aren’t there any legit sugar daddies in here you’re all cheap assholes’ is a favourite of mine.",
            "author": "timrid",
            "id": "gsixt8s",
            "parent_id": "t3_mejsjj",
            "score": 3,
            "created_utc": 1616889043.0,
            "replies": []
        },
        {
            "body": "Gee, I wonder if he voted for Biden?\n#\nThere is no amount of money that makes it worthwhile to date a misogynist, even if Melania says otherwise. This is the kind of dude that would yell at a retail worker, because he doesn't see humans; he thinks that his money entitles him to slaves.",
            "author": "TastySpermDispenser",
            "id": "gshpcrn",
            "parent_id": "t3_mejsjj",
            "score": -3,
            "created_utc": 1616871974.0,
            "replies": [
                {
                    "body": "LOL he’s a male Karen",
                    "author": "kirathekira",
                    "id": "gsj3s5q",
                    "parent_id": "t1_gshpcrn",
                    "score": 8,
                    "created_utc": 1616892340.0,
                    "replies": []
                },
                {
                    "body": "You’re an idiot if you think a misogynist is more likely to be on the left than on the right.",
                    "author": "LuluvioletSB",
                    "id": "gsisgyy",
                    "parent_id": "t1_gshpcrn",
                    "score": 8,
                    "created_utc": 1616886122.0,
                    "replies": [
                        {
                            "body": "Both sides are sexist but they are not equally sexist",
                            "author": "RadicalSugar",
                            "id": "gsity3z",
                            "parent_id": "t1_gsisgyy",
                            "score": 5,
                            "created_utc": 1616886918.0,
                            "replies": [
                                {
                                    "body": "You hit it right on the nose!",
                                    "author": "LuluvioletSB",
                                    "id": "gsj9oae",
                                    "parent_id": "t1_gsity3z",
                                    "score": 3,
                                    "created_utc": 1616894595.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "I think just the opposite. This guy writes like trump, lol, can you imagine him voting for biden? I thought: \"surely every Democrat, Republican, and third party voter knows this,\" but sadly I guess I need the /s.  :(",
                            "author": "TastySpermDispenser",
                            "id": "gsitwvi",
                            "parent_id": "t1_gsisgyy",
                            "score": 2,
                            "created_utc": 1616886898.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Which app are you referring to?",
            "author": "lucaismynameo",
            "id": "gsj1kn9",
            "parent_id": "t3_mejsjj",
            "score": 1,
            "created_utc": 1616891110.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gshvut7",
            "parent_id": "t3_mejsjj",
            "score": -11,
            "created_utc": 1616873904.0,
            "replies": [
                {
                    "body": "How is this relevant to OP’s post? She isn’t denying that some SBs have questionable profiles nor is she claiming SBs are perfect. She’s making an observation based on her experience on SA. Why the need to make this about sides (SD vs SB) with the immature “oh yea? Well SBs profiles are even worse! Blah blah blah”. 🙄  \n\nHaven’t we had enough of that recently?",
                    "author": "uniballSD",
                    "id": "gsieyd9",
                    "parent_id": "t1_gshvut7",
                    "score": 17,
                    "created_utc": 1616880310.0,
                    "replies": [
                        {
                            "body": "Check the rules. Gender bashing isn’t allowed. These one sided posts are anecdotal and don’t have much evidence to back them up",
                            "author": "UnearthlyDinosaur",
                            "id": "gsih1ec",
                            "parent_id": "t1_gsieyd9",
                            "score": -8,
                            "created_utc": 1616880991.0,
                            "replies": [
                                {
                                    "body": "How is her post gender bashing? She’s talking about 1 guy’s profile. Since when is evidence needed to share an experience? 🤦‍♂️",
                                    "author": "uniballSD",
                                    "id": "gsil2b6",
                                    "parent_id": "t1_gsih1ec",
                                    "score": 14,
                                    "created_utc": 1616882326.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "I mean what differs here is I’m talking about the sexism from the SD end. Not once did I mention the entitlement with SBs, which also as I mentioned comes from your side. For you to instantly invalidate my post just feels a bit reactionary and ingenuine in your response",
                    "author": "nycnoa",
                    "id": "gsikp0r",
                    "parent_id": "t1_gshvut7",
                    "score": 9,
                    "created_utc": 1616882211.0,
                    "replies": []
                },
                {
                    "body": "Just because a profile sucks it doesn't mean others can't be awful as well",
                    "author": "amaneeee",
                    "id": "gshxuc5",
                    "parent_id": "t1_gshvut7",
                    "score": 5,
                    "created_utc": 1616874555.0,
                    "replies": []
                },
                {
                    "body": "This reads a little \"doth protest too much\"-y. She's talking about one profile she found annoying, not saying that all or that even a lot of SDs do this. This isn't gender wars.",
                    "author": "Intrepid_Egg_7722",
                    "id": "gsjy9my",
                    "parent_id": "t1_gshvut7",
                    "score": 5,
                    "created_utc": 1616908508.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "People with their long \"do not\" lists are turnoffs no matter what and who they are. They don't stop the idiots. Stops people who are turned off though.",
            "author": "wikishart",
            "id": "gsk6uj6",
            "parent_id": "t3_mejsjj",
            "score": 1,
            "created_utc": 1616915794.0,
            "replies": [
                {
                    "body": "Exactly - long lists like that are evidence that the man is not a generous and giving person. Exactly what you want to avoid in SD land.\n\nAs a SD, do I sometimes make compromises that challenge my preferences? Yes, I do. Because I am a *generous and giving* person, who looks at the totality of the circumstance before negatively judging a real human being.\n\nWhen you get a gignatic list maker who wants to select a mate like buying a car from a used car lot, it's time to next him.",
                    "author": null,
                    "id": "gsl7t7v",
                    "parent_id": "t1_gsk6uj6",
                    "score": 1,
                    "created_utc": 1616946931.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "The Seeking/SD world is going to be populated by a unusually high number of self-selected racists, mysognists, and deplorable assholes. That's just the nature of people who are somewhat interested in the SD lifestyle.\n\nTo the extent that there are aspects of being a SD that appear to be regressive and give the older man an upper-hand over his dates, it will attract people who see that as a positive relationship dynamic.\n\nThe best medicine to counter this is exactly what you are doing - not giving those type of men the time of day, and to circle the wagons against them.",
            "author": null,
            "id": "gsl7av5",
            "parent_id": "t3_mejsjj",
            "score": 1,
            "created_utc": 1616946691.0,
            "replies": []
        },
        {
            "body": "Money and extreme pursuit of, when obtained no matter the sex tends to enable self centered tendencies to extreme levels of sociopath behavior, more prevalent in the male species.\n\nMany times people have no self awareness, its not your job to fix them, life generally does that .  You dont need that kind of toxic in your life. Just next him",
            "author": "Momopllc",
            "id": "gslrf95",
            "parent_id": "t3_mejsjj",
            "score": 1,
            "created_utc": 1616956017.0,
            "replies": []
        },
        {
            "body": "Absolutely. I've seen it on vanilla dating sites too. I can understand listing some things that are dealbreakers but half the profiles are either not filled out at all or extremely vague \"I'm a successful business man looking for a lovely lady to spend some time with\" and the rest are a huge rant about things they hate and how amazing they are even though they don't actually describe any positive traits about themselves. I'm also a big fan of the profiles that are weird word salads that sound like they were written by a drunk, depressed philosophy student.",
            "author": "clashingtaco",
            "id": "gsm2z8y",
            "parent_id": "t3_mejsjj",
            "score": 1,
            "created_utc": 1616961705.0,
            "replies": []
        },
        {
            "body": "Sounds like a catch.",
            "author": "DarthNylus",
            "id": "gso179m",
            "parent_id": "t3_mejsjj",
            "score": 1,
            "created_utc": 1617006357.0,
            "replies": []
        },
        {
            "body": "Not a good guy clearly but I personally would love to see that info up front and just pass on that person.  I love treating a lady like a lady (and person) once I know that I'm not viewed as a mark / target for a scam.\n\nYour guy didn't ask for money at least which about half SB's do now before you even meet which is a hard no for me. Also against site rules.   I'm much, much wiser and cautious now because I've come across so many career criminal SB's on there over the last 30 months. One of whom is in prison for felony fraud, attempted blackmail, theft, and property damage and multiple victims were involved.  That's a bit more serious than a guy just being weird, misogynistic, and intense.  I can unequivocally say that while there are male scammers out there, if SB's don't realize that any time a SD asks for any kind of bank info, gift card, or even a nickel to be honest, something is wrong and you walk away.  Period.  Generally speaking a SD will figure out if a SB is doing something shady pretty quickly.  Most of us are businessmen and have the means, connections, and definitely the motivation to make sure that doesn't happen to anyone else.  Plus if they're doing it to multiple people it's not hard to figure out.  Not wise moves in the Bowl\n\nBy no means am I complaining about women here, I'm venting about the criminals on there who are ok with making an entire living by attempting to rob men.  It doesn't end well and makes SD's skeptical of all of the real SB's making your lives harder!  It should be so simple if you get along, but I'm seeing about half of the SA posts now being 2-5 days old, too good to be true and then they want money before meeting.  So about half the chicks on SA are fakes / frauds (at least in my city).",
            "author": "Snoo71180",
            "id": "gst1xdv",
            "parent_id": "t3_mejsjj",
            "score": 1,
            "created_utc": 1617116379.0,
            "replies": []
        },
        {
            "body": "Look over half of the SB profiles are fake...some 350lb guy sitting in his moms basement selling content. I ask every SB to look at my profile and let me know if they want to talk.  Its just to weed out the fakes.",
            "author": "Tough-Raisin1514",
            "id": "gtj9dzh",
            "parent_id": "t3_mejsjj",
            "score": 1,
            "created_utc": 1617682114.0,
            "replies": []
        },
        {
            "body": "People that say \"read my profile\" are pretty much saying that their profile is their disclaimer for anything else they will communicate or bad behavior they will exhibit during interactions. It's like a WARNING label for household cleaners that have toxic chemicals except these people usually have toxic personalities.\n\nAbsolutely a filter.",
            "author": "MidwestSB",
            "id": "gshxxuf",
            "parent_id": "t1_gshq8os",
            "score": 33,
            "created_utc": 1616874585.0,
            "replies": [
                {
                    "body": "I like to read them to see what is so special, I’ve yet to find it, lol.",
                    "author": "OffhandCut",
                    "id": "gsieu6y",
                    "parent_id": "t1_gshxxuf",
                    "score": 9,
                    "created_utc": 1616880272.0,
                    "replies": [
                        {
                            "body": "I'm with you, I always read them!  I am looking to find that silver-tongued succubus whose velvet prose binds my heart\n\nStill, mostly get demands, negativity, and toxicity, surrounded by generic basicness.  The search continues!",
                            "author": "Azurecole",
                            "id": "gsilhe3",
                            "parent_id": "t1_gsieu6y",
                            "score": 4,
                            "created_utc": 1616882456.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "I got a \"did you read my profile??\" angry message from someone once and I had to point out that they had no profile text.",
                    "author": "wikishart",
                    "id": "gsk6vrk",
                    "parent_id": "t1_gshxxuf",
                    "score": 4,
                    "created_utc": 1616915827.0,
                    "replies": [
                        {
                            "body": "Priceless",
                            "author": "Momopllc",
                            "id": "gslqj1h",
                            "parent_id": "t1_gsk6vrk",
                            "score": 1,
                            "created_utc": 1616955590.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "> Any negativity on a profile is a turn-off\n\nTook the words out of my mouth.  And that applies to an awful lot of situations, not just online profiles.",
            "author": "SpacemanLost",
            "id": "gsis2z8",
            "parent_id": "t1_gshq8os",
            "score": 4,
            "created_utc": 1616885907.0,
            "replies": []
        },
        {
            "body": "+1. This is all ya need to hear, OP.",
            "author": "quietgrey1",
            "id": "gsk6lk2",
            "parent_id": "t1_gshq8os",
            "score": 1,
            "created_utc": 1616915558.0,
            "replies": []
        },
        {
            "body": "It makes me wish I had a scam going. 😂",
            "author": "sallybluntz",
            "id": "gsjdq7o",
            "parent_id": "t1_gsixkpr",
            "score": 8,
            "created_utc": 1616896371.0,
            "replies": []
        },
        {
            "body": "Lol so true 🤣🤣",
            "author": "CompetitiveAppealSB",
            "id": "gsjuoit",
            "parent_id": "t1_gsixkpr",
            "score": 1,
            "created_utc": 1616906019.0,
            "replies": []
        },
        {
            "body": "Your profile serves as an advertisement for yourself not a billboard for complaints. I feel like you can complain about people on the site on a first date or on a phone call. If you have more complaining and demeaning language in your profile rather then facts, hobbies, or traits about yourself... a bit telling of someone’s lack of depth and insufferable-ness",
            "author": "nycnoa",
            "id": "gshoxw1",
            "parent_id": "t1_gshn3cx",
            "score": 11,
            "created_utc": 1616871851.0,
            "replies": [
                {
                    "body": "> Your profile serves as an advertisement for yourself not a billboard for complaints\n\nSome people just have a negative outlook on life in general, though, and they *are* complainers. So those are not two mutually-exclusive things, really.",
                    "author": "Y_4Z44",
                    "id": "gsi8dhs",
                    "parent_id": "t1_gshoxw1",
                    "score": 3,
                    "created_utc": 1616878140.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "“Not like other girls” rhetoric is a turn off for most women too bleh",
            "author": "kirathekira",
            "id": "gsj3o0p",
            "parent_id": "t1_gshw29w",
            "score": 14,
            "created_utc": 1616892277.0,
            "replies": []
        },
        {
            "body": "The funny part is, how would I, as a SB, even know what most the other women on the site are like to even make such a statement?",
            "author": "sallybluntz",
            "id": "gsjeink",
            "parent_id": "t1_gshw29w",
            "score": 6,
            "created_utc": 1616896836.0,
            "replies": [
                {
                    "body": "To create an additional male profile just for that sort of research:)",
                    "author": "Gigi9662",
                    "id": "gske1z9",
                    "parent_id": "t1_gsjeink",
                    "score": 1,
                    "created_utc": 1616922771.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "\"I'm not like other girls.\" *3 boring sentences later* \"I enjoy hiking, watching movies, and dogs.\" \n\n🙄",
            "author": "2catsandacomputer",
            "id": "gslalfr",
            "parent_id": "t1_gshw29w",
            "score": 6,
            "created_utc": 1616948229.0,
            "replies": [
                {
                    "body": "I also like the same 5 fashion brands as everyone else, I follow the same makeup trends, I have my lip fillers and my BBL, and I will call you babe or hun after the third text exchange.",
                    "author": "wikishart",
                    "id": "gslgs1n",
                    "parent_id": "t1_gslalfr",
                    "score": 3,
                    "created_utc": 1616951007.0,
                    "replies": []
                },
                {
                    "body": ">and dogs.\n\nThis made me laugh when I saw your username. 🤣",
                    "author": "non_giant_panda",
                    "id": "gslhi2l",
                    "parent_id": "t1_gslalfr",
                    "score": 2,
                    "created_utc": 1616951339.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "And let's be honest, 2/3 of the men who write \"no fatties\" have bitch tits.",
            "author": null,
            "id": "gsl7dvt",
            "parent_id": "t1_gsizx9e",
            "score": 6,
            "created_utc": 1616946732.0,
            "replies": []
        },
        {
            "body": "Yes it awlful, its fine to have things you are attracted ie a body shape range but why be negative you can still get point across in a nice way. Why be toxic",
            "author": "Momopllc",
            "id": "gslqvgk",
            "parent_id": "t1_gsizx9e",
            "score": 3,
            "created_utc": 1616955754.0,
            "replies": []
        },
        {
            "body": ">He's not into sloppy seconds-- is he saying he wants a VIRGIN? Lmao, how sad.\n\nI assume that's what the \"interview and inspection\" would be all about. It's not just sad, it's disturbing for all the reasons you laid out and more.\n\nHe sounds like an utter creep.",
            "author": "Sophs_B",
            "id": "gsk52k1",
            "parent_id": "t1_gsiolrk",
            "score": 6,
            "created_utc": 1616914128.0,
            "replies": [
                {
                    "body": "Exactly, what the fuck does \"inspection\" mean, are you going to make sure my hymen is intact?? Ludicrous",
                    "author": "ColdHeaux",
                    "id": "gslmxit",
                    "parent_id": "t1_gsk52k1",
                    "score": 6,
                    "created_utc": 1616953870.0,
                    "replies": []
                },
                {
                    "body": "What bothers me about the \"virgin\" rhetoric is that just because you have or don't have a hymen doesn't mean you are/aren't a virgin. But then again, I wouldn't expect anyone who thinks they can \"inspect\" women to tell, to know that.",
                    "author": "2catsandacomputer",
                    "id": "gslaq9h",
                    "parent_id": "t1_gsk52k1",
                    "score": 3,
                    "created_utc": 1616948292.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "actually, typical reason for negativity is projected low self esteem, and if you are well adjusted yourself it can be seen as a reason to feel empathy for the person.",
            "author": "sucRoseToTheOccasion",
            "id": "gsk2ifv",
            "parent_id": "t1_gsiorif",
            "score": 3,
            "created_utc": 1616911898.0,
            "replies": []
        },
        {
            "body": "😂 looking at these comments made me realize I may not be as much of an asshole as I thought. I would never write or say these kinds of things but I’m curious now to see just how bad it is. Might be an extra single photo svetlana account on SA today",
            "author": "kitkatbrainz",
            "id": "gumahjd",
            "parent_id": "t1_gsjugwi",
            "score": 1,
            "created_utc": 1618503072.0,
            "replies": []
        },
        {
            "body": "LOL he’s a male Karen",
            "author": "kirathekira",
            "id": "gsj3s5q",
            "parent_id": "t1_gshpcrn",
            "score": 8,
            "created_utc": 1616892340.0,
            "replies": []
        },
        {
            "body": "You’re an idiot if you think a misogynist is more likely to be on the left than on the right.",
            "author": "LuluvioletSB",
            "id": "gsisgyy",
            "parent_id": "t1_gshpcrn",
            "score": 8,
            "created_utc": 1616886122.0,
            "replies": [
                {
                    "body": "Both sides are sexist but they are not equally sexist",
                    "author": "RadicalSugar",
                    "id": "gsity3z",
                    "parent_id": "t1_gsisgyy",
                    "score": 5,
                    "created_utc": 1616886918.0,
                    "replies": [
                        {
                            "body": "You hit it right on the nose!",
                            "author": "LuluvioletSB",
                            "id": "gsj9oae",
                            "parent_id": "t1_gsity3z",
                            "score": 3,
                            "created_utc": 1616894595.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "I think just the opposite. This guy writes like trump, lol, can you imagine him voting for biden? I thought: \"surely every Democrat, Republican, and third party voter knows this,\" but sadly I guess I need the /s.  :(",
                    "author": "TastySpermDispenser",
                    "id": "gsitwvi",
                    "parent_id": "t1_gsisgyy",
                    "score": 2,
                    "created_utc": 1616886898.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "How is this relevant to OP’s post? She isn’t denying that some SBs have questionable profiles nor is she claiming SBs are perfect. She’s making an observation based on her experience on SA. Why the need to make this about sides (SD vs SB) with the immature “oh yea? Well SBs profiles are even worse! Blah blah blah”. 🙄  \n\nHaven’t we had enough of that recently?",
            "author": "uniballSD",
            "id": "gsieyd9",
            "parent_id": "t1_gshvut7",
            "score": 17,
            "created_utc": 1616880310.0,
            "replies": [
                {
                    "body": "Check the rules. Gender bashing isn’t allowed. These one sided posts are anecdotal and don’t have much evidence to back them up",
                    "author": "UnearthlyDinosaur",
                    "id": "gsih1ec",
                    "parent_id": "t1_gsieyd9",
                    "score": -8,
                    "created_utc": 1616880991.0,
                    "replies": [
                        {
                            "body": "How is her post gender bashing? She’s talking about 1 guy’s profile. Since when is evidence needed to share an experience? 🤦‍♂️",
                            "author": "uniballSD",
                            "id": "gsil2b6",
                            "parent_id": "t1_gsih1ec",
                            "score": 14,
                            "created_utc": 1616882326.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I mean what differs here is I’m talking about the sexism from the SD end. Not once did I mention the entitlement with SBs, which also as I mentioned comes from your side. For you to instantly invalidate my post just feels a bit reactionary and ingenuine in your response",
            "author": "nycnoa",
            "id": "gsikp0r",
            "parent_id": "t1_gshvut7",
            "score": 9,
            "created_utc": 1616882211.0,
            "replies": []
        },
        {
            "body": "Just because a profile sucks it doesn't mean others can't be awful as well",
            "author": "amaneeee",
            "id": "gshxuc5",
            "parent_id": "t1_gshvut7",
            "score": 5,
            "created_utc": 1616874555.0,
            "replies": []
        },
        {
            "body": "This reads a little \"doth protest too much\"-y. She's talking about one profile she found annoying, not saying that all or that even a lot of SDs do this. This isn't gender wars.",
            "author": "Intrepid_Egg_7722",
            "id": "gsjy9my",
            "parent_id": "t1_gshvut7",
            "score": 5,
            "created_utc": 1616908508.0,
            "replies": []
        },
        {
            "body": "Exactly - long lists like that are evidence that the man is not a generous and giving person. Exactly what you want to avoid in SD land.\n\nAs a SD, do I sometimes make compromises that challenge my preferences? Yes, I do. Because I am a *generous and giving* person, who looks at the totality of the circumstance before negatively judging a real human being.\n\nWhen you get a gignatic list maker who wants to select a mate like buying a car from a used car lot, it's time to next him.",
            "author": null,
            "id": "gsl7t7v",
            "parent_id": "t1_gsk6uj6",
            "score": 1,
            "created_utc": 1616946931.0,
            "replies": []
        },
        {
            "body": "I like to read them to see what is so special, I’ve yet to find it, lol.",
            "author": "OffhandCut",
            "id": "gsieu6y",
            "parent_id": "t1_gshxxuf",
            "score": 9,
            "created_utc": 1616880272.0,
            "replies": [
                {
                    "body": "I'm with you, I always read them!  I am looking to find that silver-tongued succubus whose velvet prose binds my heart\n\nStill, mostly get demands, negativity, and toxicity, surrounded by generic basicness.  The search continues!",
                    "author": "Azurecole",
                    "id": "gsilhe3",
                    "parent_id": "t1_gsieu6y",
                    "score": 4,
                    "created_utc": 1616882456.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I got a \"did you read my profile??\" angry message from someone once and I had to point out that they had no profile text.",
            "author": "wikishart",
            "id": "gsk6vrk",
            "parent_id": "t1_gshxxuf",
            "score": 4,
            "created_utc": 1616915827.0,
            "replies": [
                {
                    "body": "Priceless",
                    "author": "Momopllc",
                    "id": "gslqj1h",
                    "parent_id": "t1_gsk6vrk",
                    "score": 1,
                    "created_utc": 1616955590.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "> Your profile serves as an advertisement for yourself not a billboard for complaints\n\nSome people just have a negative outlook on life in general, though, and they *are* complainers. So those are not two mutually-exclusive things, really.",
            "author": "Y_4Z44",
            "id": "gsi8dhs",
            "parent_id": "t1_gshoxw1",
            "score": 3,
            "created_utc": 1616878140.0,
            "replies": []
        },
        {
            "body": "To create an additional male profile just for that sort of research:)",
            "author": "Gigi9662",
            "id": "gske1z9",
            "parent_id": "t1_gsjeink",
            "score": 1,
            "created_utc": 1616922771.0,
            "replies": []
        },
        {
            "body": "I also like the same 5 fashion brands as everyone else, I follow the same makeup trends, I have my lip fillers and my BBL, and I will call you babe or hun after the third text exchange.",
            "author": "wikishart",
            "id": "gslgs1n",
            "parent_id": "t1_gslalfr",
            "score": 3,
            "created_utc": 1616951007.0,
            "replies": []
        },
        {
            "body": ">and dogs.\n\nThis made me laugh when I saw your username. 🤣",
            "author": "non_giant_panda",
            "id": "gslhi2l",
            "parent_id": "t1_gslalfr",
            "score": 2,
            "created_utc": 1616951339.0,
            "replies": []
        },
        {
            "body": "Exactly, what the fuck does \"inspection\" mean, are you going to make sure my hymen is intact?? Ludicrous",
            "author": "ColdHeaux",
            "id": "gslmxit",
            "parent_id": "t1_gsk52k1",
            "score": 6,
            "created_utc": 1616953870.0,
            "replies": []
        },
        {
            "body": "What bothers me about the \"virgin\" rhetoric is that just because you have or don't have a hymen doesn't mean you are/aren't a virgin. But then again, I wouldn't expect anyone who thinks they can \"inspect\" women to tell, to know that.",
            "author": "2catsandacomputer",
            "id": "gslaq9h",
            "parent_id": "t1_gsk52k1",
            "score": 3,
            "created_utc": 1616948292.0,
            "replies": []
        },
        {
            "body": "Both sides are sexist but they are not equally sexist",
            "author": "RadicalSugar",
            "id": "gsity3z",
            "parent_id": "t1_gsisgyy",
            "score": 5,
            "created_utc": 1616886918.0,
            "replies": [
                {
                    "body": "You hit it right on the nose!",
                    "author": "LuluvioletSB",
                    "id": "gsj9oae",
                    "parent_id": "t1_gsity3z",
                    "score": 3,
                    "created_utc": 1616894595.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I think just the opposite. This guy writes like trump, lol, can you imagine him voting for biden? I thought: \"surely every Democrat, Republican, and third party voter knows this,\" but sadly I guess I need the /s.  :(",
            "author": "TastySpermDispenser",
            "id": "gsitwvi",
            "parent_id": "t1_gsisgyy",
            "score": 2,
            "created_utc": 1616886898.0,
            "replies": []
        },
        {
            "body": "Check the rules. Gender bashing isn’t allowed. These one sided posts are anecdotal and don’t have much evidence to back them up",
            "author": "UnearthlyDinosaur",
            "id": "gsih1ec",
            "parent_id": "t1_gsieyd9",
            "score": -8,
            "created_utc": 1616880991.0,
            "replies": [
                {
                    "body": "How is her post gender bashing? She’s talking about 1 guy’s profile. Since when is evidence needed to share an experience? 🤦‍♂️",
                    "author": "uniballSD",
                    "id": "gsil2b6",
                    "parent_id": "t1_gsih1ec",
                    "score": 14,
                    "created_utc": 1616882326.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I'm with you, I always read them!  I am looking to find that silver-tongued succubus whose velvet prose binds my heart\n\nStill, mostly get demands, negativity, and toxicity, surrounded by generic basicness.  The search continues!",
            "author": "Azurecole",
            "id": "gsilhe3",
            "parent_id": "t1_gsieu6y",
            "score": 4,
            "created_utc": 1616882456.0,
            "replies": []
        },
        {
            "body": "Priceless",
            "author": "Momopllc",
            "id": "gslqj1h",
            "parent_id": "t1_gsk6vrk",
            "score": 1,
            "created_utc": 1616955590.0,
            "replies": []
        },
        {
            "body": "You hit it right on the nose!",
            "author": "LuluvioletSB",
            "id": "gsj9oae",
            "parent_id": "t1_gsity3z",
            "score": 3,
            "created_utc": 1616894595.0,
            "replies": []
        },
        {
            "body": "How is her post gender bashing? She’s talking about 1 guy’s profile. Since when is evidence needed to share an experience? 🤦‍♂️",
            "author": "uniballSD",
            "id": "gsil2b6",
            "parent_id": "t1_gsih1ec",
            "score": 14,
            "created_utc": 1616882326.0,
            "replies": []
        }
    ]
}