{
    "title": "Glorified Tinder",
    "post_id": "evtm2s",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/evtm2s/glorified_tinder/",
    "author": "7475DeerDr",
    "body": "I've decided my market is just full of overgrown frat boys looking for an easy lay.\n\nThey say it all the time that SA is full of baby SBs trying to duck out on their side of the arrangement... but I'm feeling like it's just as bad on the flip side of things.\n\nI'm sorry for requiring to meet you somewhere besides your couch for the first time. Maybe things will progress naturally and end up that way, if we click and I feel safe...but please dont make assumptions.\n\nI'm not trying to get something for nothing but it feels like that's the new consensus. Do you want to go out or just come to my house... DUDE I dont know you... SO YEAH some witnesses would be nice.\n\nI'm not trying to string you along...I'm just trying to make sure I can go home at the end of the night in one piece.\n\nIf I were interested in the random hook up...there's other places to find like minded people...\n\n&#x200B;\n\nOK SORRY, Mini rant over.",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/evtm2s/glorified_tinder/",
    "score": 131,
    "upvote_ratio": 0.93,
    "created_utc": 1580333251.0,
    "num_comments": 62,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "[deleted]",
            "author": null,
            "id": "ffy0ckm",
            "parent_id": "t3_evtm2s",
            "score": 42,
            "created_utc": 1580336015.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "ffy5131",
                    "parent_id": "t1_ffy0ckm",
                    "score": 43,
                    "created_utc": 1580338674.0,
                    "replies": []
                },
                {
                    "body": "🤢🤢🤢",
                    "author": null,
                    "id": "ffyk39x",
                    "parent_id": "t1_ffy0ckm",
                    "score": 5,
                    "created_utc": 1580348315.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "ffyms66",
                            "parent_id": "t1_ffyk39x",
                            "score": 5,
                            "created_utc": 1580350141.0,
                            "replies": [
                                {
                                    "body": "I don’t have a problem with a kiss or an ass grab after a M&G. I mean the point is having chemistry, so if I don’t want you to kiss me by the end of the M&G then I probably just don’t want an arrangement with you. But yeah good job on not going to his house. Sounds like you overall just weren’t into him.",
                                    "author": "thatfitgirlmocha",
                                    "id": "ffyzwa0",
                                    "parent_id": "t1_ffyms66",
                                    "score": 6,
                                    "created_utc": 1580359573.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Tbh I deleted my SA over a year ago. It felt like even a lot of work back then. Found current SD and a few other good prospects on the smaller SD sites. Much better quality for us SB’s to choose from. The smaller sites have more scammers on the women’s side though for the men (at least that is what they told me) More men also showed up to the meet and greets and didn’t flake as much as SA and overall better experience (gentlemen). At this point would even freelance over SA. I had one bad experience and a lot of time waisted.",
            "author": "Odd-Student",
            "id": "ffy2f17",
            "parent_id": "t3_evtm2s",
            "score": 27,
            "created_utc": 1580337266.0,
            "replies": [
                {
                    "body": "May I ask which site? I’m considering branching out 😃",
                    "author": "BratinaHat",
                    "id": "ffyh0g7",
                    "parent_id": "t1_ffy2f17",
                    "score": 14,
                    "created_utc": 1580346215.0,
                    "replies": [
                        {
                            "body": "Sorry for the late response. The sites I used are Sugar Daddy Meet, Established Men and Secret Benefits. SDM was my favorite because it has a swipe matcher and a lot of choices. A few salts/splendas are on SDM but they are pretty honest upfront so you don’t have to waste time. Established men has a low number to pick from but most of the men on the site want a long term arrangement and are generous/sincere. Secret Benefits advertises on Eros so if you are looking long term make sure to relay that you are looking long term mutual. My current is actually from SB and I couldn’t be more happy.",
                            "author": "Odd-Student",
                            "id": "fg7w4vh",
                            "parent_id": "t1_ffyh0g7",
                            "score": 5,
                            "created_utc": 1580602980.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Which sites were you on, I’m not having much luck on SA and Tinder.",
                    "author": "Rozz2013",
                    "id": "ffyl150",
                    "parent_id": "t1_ffy2f17",
                    "score": 6,
                    "created_utc": 1580348958.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "overgrown frat boys looking for an easy lay\n\nStay the course and don't abandon your principles and boundaries. Real SDs know the score and will respect those boundaries. It will take longer but one day Mr Right Now will show up for the platonic M&G",
            "author": "GSSD",
            "id": "ffxxvp8",
            "parent_id": "t3_evtm2s",
            "score": 28,
            "created_utc": 1580334568.0,
            "replies": [
                {
                    "body": "So I think the problem is in the second and third words in your first sentence.  Is she filtering for younger gentlemen?  I dont know many 40+ year old men who get referred to as frat boys.",
                    "author": "FrankTheTankSD",
                    "id": "ffzy6la",
                    "parent_id": "t1_ffxxvp8",
                    "score": 1,
                    "created_utc": 1580395896.0,
                    "replies": [
                        {
                            "body": "I think she is referring to their mindset and behavior, not their age.",
                            "author": "GSSD",
                            "id": "ffzyfw1",
                            "parent_id": "t1_ffzy6la",
                            "score": 2,
                            "created_utc": 1580396074.0,
                            "replies": [
                                {
                                    "body": "Im curious to see her response. Ive met a few SB's at least in my area, who refuse to date anyone more than 35.",
                                    "author": "FrankTheTankSD",
                                    "id": "ffzymfy",
                                    "parent_id": "t1_ffzyfw1",
                                    "score": 1,
                                    "created_utc": 1580396199.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "It is the mentality that \"I can buy my way in or out of anything\" that starts with spoiled kids who grow up to be even more spoiled men once they realize the power their money has. They're used to getting their way always.\n\nFrat boys may allude more towards the maturity level rather than age but it is very real trait that can be carried later in life by those that havent worked hard for what they have.\n\nI guess I would consider myself an older SB as I'm in my upper 30s but am told I look younger. I'm in a weird filter where I'm too old for some but somehow meets the criteria of \"older woman.\" \n\nI personally filter my age and older but am still finding many are here for the quick pass rather than the longer term.",
                            "author": "7475DeerDr",
                            "id": "fg6ohdv",
                            "parent_id": "t1_ffzy6la",
                            "score": 2,
                            "created_utc": 1580573197.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "These guys asking for meet over at there place have no fear at all. I'd love to have the freedom of navigating the dating world like a man, not having to think about being assaulted or raped. Must be nice.",
            "author": "jcebabe",
            "id": "ffy55vg",
            "parent_id": "t3_evtm2s",
            "score": 31,
            "created_utc": 1580338746.0,
            "replies": [
                {
                    "body": "It is, and you absolutely should have that same freedom.  Maybe one day the world will get there...🤞🤞🤞",
                    "author": "Gemini-Fox",
                    "id": "ffyf8po",
                    "parent_id": "t1_ffy55vg",
                    "score": 8,
                    "created_utc": 1580345007.0,
                    "replies": []
                },
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "ffz8dme",
                    "parent_id": "t1_ffy55vg",
                    "score": -4,
                    "created_utc": 1580367178.0,
                    "replies": [
                        {
                            "body": "Lol at equating the risk of serious bodily harm with....attention? \n\nThis particular thing does not “cut both ways.”\n\nMost of it isn’t flattering and usually comes with aggression if you don’t respond the “right” way. I’ve lived in cities with vocal but playful cat calling cultures and cities where men are unlikely ever come up to women and I much prefer the latter. \n\nI think anyone claiming they’d trade some bodily autonomy and freedom of movement to be ogled by women is probably deluded about the actual value of attention from total strangers.",
                            "author": "WandererOfInterwebs",
                            "id": "ffznlqp",
                            "parent_id": "t1_ffz8dme",
                            "score": 5,
                            "created_utc": 1580387159.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "ffznzv7",
                                    "parent_id": "t1_ffznlqp",
                                    "score": 0,
                                    "created_utc": 1580387553.0,
                                    "replies": [
                                        {
                                            "body": "Who asked for it “both ways”?\n\nAnd the things she mentioned don’t come along with being a beautiful woman, but being any woman. \n\nAnd it makes no logical sense to compare being celebrity, which is a job people choose and actively pursue, with being born with vagina.  People are annoyed when celebrities complain (some are anyway, I think anyone is allowed to be vocal about being poorly treated?) because they willingly put themselves in the spot light. \n\nYou seem to think that because being a woman comes with certain perceived “benefits” it’s somehow bad form to complain about the insanely shitty parts of it? You’re doing more feeling than reasoning here.",
                                            "author": "WandererOfInterwebs",
                                            "id": "ffzoblv",
                                            "parent_id": "t1_ffznzv7",
                                            "score": 3,
                                            "created_utc": 1580387876.0,
                                            "replies": [
                                                {
                                                    "body": "[deleted]",
                                                    "author": null,
                                                    "id": "ffzoi53",
                                                    "parent_id": "t1_ffzoblv",
                                                    "score": 0,
                                                    "created_utc": 1580388054.0,
                                                    "replies": [
                                                        {
                                                            "body": "Show me on the doll where the post shamed you",
                                                            "author": "WandererOfInterwebs",
                                                            "id": "ffzoktb",
                                                            "parent_id": "t1_ffzoi53",
                                                            "score": 4,
                                                            "created_utc": 1580388126.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "You don't get how people work.\n\nWe all understimate what we have plenty of.\n\nOfc you don't care about attention as you are up to your neck in it. And we guys don't care about safety as feeling unsafe during a date isn't really a thing for us.",
                                    "author": null,
                                    "id": "fg1g1sl",
                                    "parent_id": "t1_ffznlqp",
                                    "score": 0,
                                    "created_utc": 1580426447.0,
                                    "replies": [
                                        {
                                            "body": "OK brain genius, but safety —as in not dying or being subjected to bodily harm—is objectively more important than someone you don’t know telling you that your ass is cute.",
                                            "author": "WandererOfInterwebs",
                                            "id": "fg1geas",
                                            "parent_id": "t1_fg1g1sl",
                                            "score": 2,
                                            "created_utc": 1580426628.0,
                                            "replies": [
                                                {
                                                    "body": ">is objectively more important \n\nNope, you don't get to decide that for others, each person has to evaluate that on their own.\n\nAnd keep in mind that lack of attentiond and affection does kill a lot of men through depression and suicide.\n\nBut I'm sure you don't care about that as your problems are just more important right?",
                                                    "author": null,
                                                    "id": "fg1n2xg",
                                                    "parent_id": "t1_fg1geas",
                                                    "score": 0,
                                                    "created_utc": 1580430083.0,
                                                    "replies": [
                                                        {
                                                            "body": "The sort of attention we are talking about in this thread—romantic or sexual interest from the opposite sex—does not cause depression and/or suicide. That’s not how mental illness works.\n\nBut it is telling you’re conflating interest with “affection” as if being hit on by strangers makes anyone less lonely.",
                                                            "author": "WandererOfInterwebs",
                                                            "id": "fg1ojjb",
                                                            "parent_id": "t1_fg1n2xg",
                                                            "score": 2,
                                                            "created_utc": 1580430861.0,
                                                            "replies": [
                                                                {
                                                                    "body": ">romantic or sexual interest from the opposite sex—does not cause depression and/or suicide. \n\nYes, it does. In fact that's the whole point of incels. You literally can't see the problem because you've never experienced a chronic lack of attention and how it hurts your ego",
                                                                    "author": null,
                                                                    "id": "fg1op13",
                                                                    "parent_id": "t1_fg1ojjb",
                                                                    "score": 0,
                                                                    "created_utc": 1580430935.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "That isn’t “the whole point of incels” but your general ignorance of the topic  despite having a very strong opinion on it is noted",
                                                                            "author": "WandererOfInterwebs",
                                                                            "id": "fg1p5o9",
                                                                            "parent_id": "t1_fg1op13",
                                                                            "score": 2,
                                                                            "created_utc": 1580431154.0,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "This",
                            "author": null,
                            "id": "ffzg03e",
                            "parent_id": "t1_ffz8dme",
                            "score": 0,
                            "created_utc": 1580377200.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Tried to set up a MnG tonite, 1st at a tavern next to a Starbucks, then the Starbucks.  POT SB then asks me to come to her house. When I resisted, she suggests a parking lot (“it’s safe and public”).  Even offered a donation. Could never get on the same page.  Next!  Another one wanted me to pick her up at her house to drive us to the MnG location, didn’t want the offered paid for Uber. It happens on this side too.",
            "author": "stlmo2019",
            "id": "ffypo3s",
            "parent_id": "t3_evtm2s",
            "score": 6,
            "created_utc": 1580352097.0,
            "replies": [
                {
                    "body": "What the earth??? Are these girls stupid? You must be dating under 21's.",
                    "author": null,
                    "id": "ffzjonj",
                    "parent_id": "t1_ffypo3s",
                    "score": 3,
                    "created_utc": 1580382500.0,
                    "replies": [
                        {
                            "body": "One yes (parking lot) other no (27yo).",
                            "author": "stlmo2019",
                            "id": "fg1mmfj",
                            "parent_id": "t1_ffzjonj",
                            "score": 2,
                            "created_utc": 1580429840.0,
                            "replies": [
                                {
                                    "body": "I'm shocked! You haven't been very lucky :(.",
                                    "author": null,
                                    "id": "fg2zdev",
                                    "parent_id": "t1_fg1mmfj",
                                    "score": 1,
                                    "created_utc": 1580462897.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "There are bad apples on both sides. \n\nI can tell you a few tales. Most recent one, met on SA, I insisted that the lady meet me at a bar when she wanted to meet me at my place!!! Then she shows up and texts her “guy friend” to let him know she is ok. Then in 15 mins she bluntly tells me she normally does not waste time meeting guys in bars, she wants to make things happens fast. She likes me and asks if we could go back to my place. \n\nAt that moment I have had enough and tell her I need to leave and if I can help her get an uber back home? She is like well let me text my friend so he can come and pick me up. I thank her for the time, clear the check and we walk out. From there she disappeared in the darkness!",
            "author": null,
            "id": "ffypp2w",
            "parent_id": "t3_evtm2s",
            "score": 6,
            "created_utc": 1580352116.0,
            "replies": []
        },
        {
            "body": "It is always better to meet in public first. I insist on it.",
            "author": "9Voices2020",
            "id": "ffy0gm2",
            "parent_id": "t3_evtm2s",
            "score": 10,
            "created_utc": 1580336082.0,
            "replies": []
        },
        {
            "body": "Exactly the same as men who are not into sugar relationships.",
            "author": "miz_nyc",
            "id": "ffy67wr",
            "parent_id": "t3_evtm2s",
            "score": 3,
            "created_utc": 1580339339.0,
            "replies": []
        },
        {
            "body": "THANK YOU. I was on SA for weeks and got so fed up with all these guys just thinking i was interested in a hook up right away, that I ended up giving up. Felt like it was impossible to find a SD who actually wanted a relationship, not just a quick fuck.",
            "author": null,
            "id": "ffyamcf",
            "parent_id": "t3_evtm2s",
            "score": 3,
            "created_utc": 1580341896.0,
            "replies": [
                {
                    "body": "It’s so funny that I am for sure not interested in that, and on the SD side of things it’s hard to get the time of Day much less actually make it to a M&G.",
                    "author": "garret6758",
                    "id": "ffz4x76",
                    "parent_id": "t1_ffyamcf",
                    "score": 2,
                    "created_utc": 1580364101.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "General consensus from what I've seen is that you find a worthy pick maybe twice a year. Definitely takes patience, definitely don't settle. Don't lose hope, either! Your perfect fit is out there, and it sure beats traditional.",
            "author": "yeehaw_yall",
            "id": "ffy8607",
            "parent_id": "t3_evtm2s",
            "score": 4,
            "created_utc": 1580340439.0,
            "replies": []
        },
        {
            "body": "Just today I had two go women go straight to \"pay me for live online videos and I might sleep with you, sign up here... (link)\" and a strange midqest SB ask for dinner dates (I am in Canada, nowhere near Iowa)....\n\nIt's a shitshow, but it's better than all the rest.",
            "author": "Cdnmaple75",
            "id": "ffygnt9",
            "parent_id": "t3_evtm2s",
            "score": 3,
            "created_utc": 1580345976.0,
            "replies": []
        },
        {
            "body": "Please, these rants go both ways. It’s pretty much immature, half-in-college girls looking to take money for nothing.\n\nThat said, I always do meet and greets in public. I never encourage someone back to my place unless I think they’re ready — and rarely ever on a first date does anything happen besides the meeting.\n\nWhile I continue to be 100% supportive of women taking precautions for their personal safety, the odds are so overwhelmingly against you being murdered it’s ridiculous how often this is brought up here.\n\nThe real danger is winding up in a place with someone who overpowers you physically and hurts you or sexually assaults you. I’d say that is fortunately rare with SA too, but the risk is real. And that’s why you shouldn’t rush back to the residence of someone you don’t know yet.\n\nBut this post goes and conflates cheap-ass phony SDs with serial killers. And trust me, we real SDs have to deal with countless rinsers and fake SBs. Fortunately, no serial killers either.",
            "author": "marker3000",
            "id": "ffz89r0",
            "parent_id": "t3_evtm2s",
            "score": 4,
            "created_utc": 1580367079.0,
            "replies": [
                {
                    "body": "The being overpowered and hurt physically is probably the #1 concern. I can deal with rudeness and messy actions. As women, we're already taught our whole lives to beware of aggressive behavior. There's no way to mentally relax and give someone a chance to get to know you if you've got a wall up to begin with.",
                    "author": "7475DeerDr",
                    "id": "fg6n3yx",
                    "parent_id": "t1_ffz89r0",
                    "score": 1,
                    "created_utc": 1580572246.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Lol yeah that’s so valid tinder is a shit show even for vanilla relationships",
            "author": "snakefather",
            "id": "ffyugbl",
            "parent_id": "t3_evtm2s",
            "score": 2,
            "created_utc": 1580355426.0,
            "replies": []
        },
        {
            "body": "Feel you girl!! You got to do a whole lot of digging to find the real ones",
            "author": "redheadedbeautyxo",
            "id": "ffxxefe",
            "parent_id": "t3_evtm2s",
            "score": 4,
            "created_utc": 1580334296.0,
            "replies": []
        },
        {
            "body": "I mean yeah it's like any dating app except Christian mingle. Whole bunch of bullshit and then a decent match 🤣",
            "author": null,
            "id": "ffxvzjy",
            "parent_id": "t3_evtm2s",
            "score": 2,
            "created_utc": 1580333505.0,
            "replies": [
                {
                    "body": "Maybe there are secret pervs on Christian Mingle.",
                    "author": null,
                    "id": "ffxxush",
                    "parent_id": "t1_ffxvzjy",
                    "score": 6,
                    "created_utc": 1580334554.0,
                    "replies": [
                        {
                            "body": "Maybe they're into flogging away sins😏",
                            "author": null,
                            "id": "ffxyzgs",
                            "parent_id": "t1_ffxxush",
                            "score": 5,
                            "created_utc": 1580335200.0,
                            "replies": [
                                {
                                    "body": "And little boys",
                                    "author": "silversilomi",
                                    "id": "ffy763o",
                                    "parent_id": "t1_ffxyzgs",
                                    "score": 1,
                                    "created_utc": 1580339875.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "yep, i talk to so many sb's who complain about having had bad experiences, like having given up sugar w/o getting any back. Then when someone like me who is actually honest wants to get together with them, they are already overly skeptical.  Just today i chatted with 3 on SA who were wining about how they got humped/dumped and when i offered them to chat over the phone and/or meet in PUBLIC for lunch or drinks, crickets, no replies ...  \nMany will continue this behavior so i have no sympathy for these though honestly. Most just have very very poor judgment, both in vanilla and sugar worlds.",
                    "author": null,
                    "id": "ffyz2tw",
                    "parent_id": "t1_ffxvzjy",
                    "score": 7,
                    "created_utc": 1580358897.0,
                    "replies": [
                        {
                            "body": "I personally freeze when it comes to phone calls. Call center PTSD is strong, but I try to arrange m&gs as soon as possible and I guess it scares POTs?",
                            "author": null,
                            "id": "ffyzk6m",
                            "parent_id": "t1_ffyz2tw",
                            "score": 2,
                            "created_utc": 1580359297.0,
                            "replies": [
                                {
                                    "body": "I do the same. Limit conversation and texts until we meet In person. I tell them my expectations and then try to meet in person as soon as possible if they agree. The reason I do it is because my time is very precious and it helps me weed out the window shoppers and time wasters.",
                                    "author": "Odd-Student",
                                    "id": "fg7yhd1",
                                    "parent_id": "t1_ffyzk6m",
                                    "score": 1,
                                    "created_utc": 1580604730.0,
                                    "replies": []
                                },
                                {
                                    "body": "I have no idea honestly. Some have been open to chat over the phone and the ones who actually agree to chat, we usually have great conversations and they are 100 times more willing to meet up, but then you have pot's who answer like \"LOL, what do u wana talk about\" and thats when I know that they are just not gonna meet ... or will throw out objections like \"my family lives in your city, i am little worried\"\nsometimes i dont know whether these chicks are trolling or not the smartest of the bunch lol\n\nProbably the latter, otherwise they'd somehow manage to get by in life without being broke and sitting on SA\n:)",
                                    "author": null,
                                    "id": "ffyzwhe",
                                    "parent_id": "t1_ffyzk6m",
                                    "score": 1,
                                    "created_utc": 1580359578.0,
                                    "replies": [
                                        {
                                            "body": "I can't make excuses for others when I didn't enter the bowl broke, so yeah. I take it as casual dating with money as a perk instead of income, so to me I approach it as, \"I'm not gonna bullshit, we went over the basics. Let's meet up?\" And then boom crickets? Maybe I'm too assertive",
                                            "author": null,
                                            "id": "ffz0l7f",
                                            "parent_id": "t1_ffyzwhe",
                                            "score": 2,
                                            "created_utc": 1580360150.0,
                                            "replies": [
                                                {
                                                    "body": "why would men be scared of meets? i understand so many things can go wrong for women, but as long as a man is interested and you make it convenient for him, most should be able/willing to meet. I have a fake sb account setup and she gets hit up by 40 emails a day begging her to meet in real person.",
                                                    "author": null,
                                                    "id": "ffz14ym",
                                                    "parent_id": "t1_ffz0l7f",
                                                    "score": 1,
                                                    "created_utc": 1580360615.0,
                                                    "replies": [
                                                        {
                                                            "body": "Wow the most I get is like 3-5 a day. A fake account is getting more hits. I'm just gonna cry in a corner with a bag of tostitos.😭",
                                                            "author": null,
                                                            "id": "ffz1vm9",
                                                            "parent_id": "t1_ffz14ym",
                                                            "score": 2,
                                                            "created_utc": 1580361275.0,
                                                            "replies": [
                                                                {
                                                                    "body": "It’s all about looks. The fake Sb is a 7 at least ... plus the cleavage is showing ...😍",
                                                                    "author": null,
                                                                    "id": "ffzvvyu",
                                                                    "parent_id": "t1_ffz1vm9",
                                                                    "score": 1,
                                                                    "created_utc": 1580394266.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "Ah. Well I barely have boobs so there's that🤣",
                                                                            "author": null,
                                                                            "id": "fg0ektf",
                                                                            "parent_id": "t1_ffzvvyu",
                                                                            "score": 1,
                                                                            "created_utc": 1580406161.0,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "ffxwq4a",
                    "parent_id": "t1_ffxvzjy",
                    "score": 3,
                    "created_utc": 1580333925.0,
                    "replies": [
                        {
                            "body": "Too christian for my liking. I already say fuck too much for a catholic🤣",
                            "author": null,
                            "id": "ffxz7jc",
                            "parent_id": "t1_ffxwq4a",
                            "score": 5,
                            "created_utc": 1580335333.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "ffyr2dp",
            "parent_id": "t3_evtm2s",
            "score": 3,
            "created_utc": 1580353056.0,
            "replies": [
                {
                    "body": "10's my ass! LOL most women on SA are 5-6 at best. I see 10's in LA maybe or Miami locales.",
                    "author": null,
                    "id": "ffyzkip",
                    "parent_id": "t1_ffyr2dp",
                    "score": 3,
                    "created_utc": 1580359304.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "ffz415b",
                            "parent_id": "t1_ffyzkip",
                            "score": 11,
                            "created_utc": 1580363237.0,
                            "replies": [
                                {
                                    "body": "It's almost as if most men who use that website aren't attractive 20 year old men. Shocker!",
                                    "author": "RedPillLookism",
                                    "id": "fg0h9ly",
                                    "parent_id": "t1_ffz415b",
                                    "score": 1,
                                    "created_utc": 1580407768.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "yeeeep",
            "author": null,
            "id": "ffyn5b2",
            "parent_id": "t3_evtm2s",
            "score": 1,
            "created_utc": 1580350385.0,
            "replies": []
        },
        {
            "body": "perfectly put",
            "author": "slowlyrot",
            "id": "ffyz09m",
            "parent_id": "t3_evtm2s",
            "score": 1,
            "created_utc": 1580358838.0,
            "replies": []
        },
        {
            "body": "Continue to vet people very selectively. Look out for good character and integrity and you'll find people worth trusting in an arrangement. Best of luck. Your cynicism about it being glorified tinder will work in your favor, actually, because you'll know to expect and filter the worst.",
            "author": "Aishurel",
            "id": "ffz4jqs",
            "parent_id": "t3_evtm2s",
            "score": 1,
            "created_utc": 1580363734.0,
            "replies": []
        },
        {
            "body": "YES TOTALLY AGREE! I wish all sd’s saw this",
            "author": "honeybeevixen",
            "id": "fg06na3",
            "parent_id": "t3_evtm2s",
            "score": 1,
            "created_utc": 1580401369.0,
            "replies": []
        },
        {
            "body": "Brilliant writing.\n\nA humorous spin on something that sounds real and present.",
            "author": null,
            "id": "ffyaifs",
            "parent_id": "t3_evtm2s",
            "score": 0,
            "created_utc": 1580341824.0,
            "replies": []
        },
        {
            "body": "Maybe I'm reading this wrong?  But they asked how you would like to meet for the first time and that's a problem?  My wife and I essentially ask the same thing.",
            "author": "conquest1977",
            "id": "ffxzm56",
            "parent_id": "t3_evtm2s",
            "score": -6,
            "created_utc": 1580335577.0,
            "replies": [
                {
                    "body": "Let's not make a first meet at home a standard. That's not safe. I don't care how safe you think YOU are, there are men who will abuse the naivety of some younger SBs who read on this forum that YOU said its totally safe to venture to some rando's house before meeting and screening him.",
                    "author": "kaeladurden",
                    "id": "ffy588n",
                    "parent_id": "t1_ffxzm56",
                    "score": 9,
                    "created_utc": 1580338783.0,
                    "replies": []
                },
                {
                    "body": "No, the assumption is meeting at his house or hotel is equal to a M&G...with the benefit of well..we're already here so....let's just do this now. He's always a 10 so there's no chance I won't like him in his mind. \n\nWe can cuddle or watch a movie...sorry these are not activities you get to manipulate into a freebie or ONS with me.",
                    "author": "7475DeerDr",
                    "id": "ffz49ek",
                    "parent_id": "t1_ffxzm56",
                    "score": 1,
                    "created_utc": 1580363460.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "ffy5131",
            "parent_id": "t1_ffy0ckm",
            "score": 43,
            "created_utc": 1580338674.0,
            "replies": []
        },
        {
            "body": "🤢🤢🤢",
            "author": null,
            "id": "ffyk39x",
            "parent_id": "t1_ffy0ckm",
            "score": 5,
            "created_utc": 1580348315.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "ffyms66",
                    "parent_id": "t1_ffyk39x",
                    "score": 5,
                    "created_utc": 1580350141.0,
                    "replies": [
                        {
                            "body": "I don’t have a problem with a kiss or an ass grab after a M&G. I mean the point is having chemistry, so if I don’t want you to kiss me by the end of the M&G then I probably just don’t want an arrangement with you. But yeah good job on not going to his house. Sounds like you overall just weren’t into him.",
                            "author": "thatfitgirlmocha",
                            "id": "ffyzwa0",
                            "parent_id": "t1_ffyms66",
                            "score": 6,
                            "created_utc": 1580359573.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "May I ask which site? I’m considering branching out 😃",
            "author": "BratinaHat",
            "id": "ffyh0g7",
            "parent_id": "t1_ffy2f17",
            "score": 14,
            "created_utc": 1580346215.0,
            "replies": [
                {
                    "body": "Sorry for the late response. The sites I used are Sugar Daddy Meet, Established Men and Secret Benefits. SDM was my favorite because it has a swipe matcher and a lot of choices. A few salts/splendas are on SDM but they are pretty honest upfront so you don’t have to waste time. Established men has a low number to pick from but most of the men on the site want a long term arrangement and are generous/sincere. Secret Benefits advertises on Eros so if you are looking long term make sure to relay that you are looking long term mutual. My current is actually from SB and I couldn’t be more happy.",
                    "author": "Odd-Student",
                    "id": "fg7w4vh",
                    "parent_id": "t1_ffyh0g7",
                    "score": 5,
                    "created_utc": 1580602980.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Which sites were you on, I’m not having much luck on SA and Tinder.",
            "author": "Rozz2013",
            "id": "ffyl150",
            "parent_id": "t1_ffy2f17",
            "score": 6,
            "created_utc": 1580348958.0,
            "replies": []
        },
        {
            "body": "So I think the problem is in the second and third words in your first sentence.  Is she filtering for younger gentlemen?  I dont know many 40+ year old men who get referred to as frat boys.",
            "author": "FrankTheTankSD",
            "id": "ffzy6la",
            "parent_id": "t1_ffxxvp8",
            "score": 1,
            "created_utc": 1580395896.0,
            "replies": [
                {
                    "body": "I think she is referring to their mindset and behavior, not their age.",
                    "author": "GSSD",
                    "id": "ffzyfw1",
                    "parent_id": "t1_ffzy6la",
                    "score": 2,
                    "created_utc": 1580396074.0,
                    "replies": [
                        {
                            "body": "Im curious to see her response. Ive met a few SB's at least in my area, who refuse to date anyone more than 35.",
                            "author": "FrankTheTankSD",
                            "id": "ffzymfy",
                            "parent_id": "t1_ffzyfw1",
                            "score": 1,
                            "created_utc": 1580396199.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "It is the mentality that \"I can buy my way in or out of anything\" that starts with spoiled kids who grow up to be even more spoiled men once they realize the power their money has. They're used to getting their way always.\n\nFrat boys may allude more towards the maturity level rather than age but it is very real trait that can be carried later in life by those that havent worked hard for what they have.\n\nI guess I would consider myself an older SB as I'm in my upper 30s but am told I look younger. I'm in a weird filter where I'm too old for some but somehow meets the criteria of \"older woman.\" \n\nI personally filter my age and older but am still finding many are here for the quick pass rather than the longer term.",
                    "author": "7475DeerDr",
                    "id": "fg6ohdv",
                    "parent_id": "t1_ffzy6la",
                    "score": 2,
                    "created_utc": 1580573197.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "It is, and you absolutely should have that same freedom.  Maybe one day the world will get there...🤞🤞🤞",
            "author": "Gemini-Fox",
            "id": "ffyf8po",
            "parent_id": "t1_ffy55vg",
            "score": 8,
            "created_utc": 1580345007.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "ffz8dme",
            "parent_id": "t1_ffy55vg",
            "score": -4,
            "created_utc": 1580367178.0,
            "replies": [
                {
                    "body": "Lol at equating the risk of serious bodily harm with....attention? \n\nThis particular thing does not “cut both ways.”\n\nMost of it isn’t flattering and usually comes with aggression if you don’t respond the “right” way. I’ve lived in cities with vocal but playful cat calling cultures and cities where men are unlikely ever come up to women and I much prefer the latter. \n\nI think anyone claiming they’d trade some bodily autonomy and freedom of movement to be ogled by women is probably deluded about the actual value of attention from total strangers.",
                    "author": "WandererOfInterwebs",
                    "id": "ffznlqp",
                    "parent_id": "t1_ffz8dme",
                    "score": 5,
                    "created_utc": 1580387159.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "ffznzv7",
                            "parent_id": "t1_ffznlqp",
                            "score": 0,
                            "created_utc": 1580387553.0,
                            "replies": [
                                {
                                    "body": "Who asked for it “both ways”?\n\nAnd the things she mentioned don’t come along with being a beautiful woman, but being any woman. \n\nAnd it makes no logical sense to compare being celebrity, which is a job people choose and actively pursue, with being born with vagina.  People are annoyed when celebrities complain (some are anyway, I think anyone is allowed to be vocal about being poorly treated?) because they willingly put themselves in the spot light. \n\nYou seem to think that because being a woman comes with certain perceived “benefits” it’s somehow bad form to complain about the insanely shitty parts of it? You’re doing more feeling than reasoning here.",
                                    "author": "WandererOfInterwebs",
                                    "id": "ffzoblv",
                                    "parent_id": "t1_ffznzv7",
                                    "score": 3,
                                    "created_utc": 1580387876.0,
                                    "replies": [
                                        {
                                            "body": "[deleted]",
                                            "author": null,
                                            "id": "ffzoi53",
                                            "parent_id": "t1_ffzoblv",
                                            "score": 0,
                                            "created_utc": 1580388054.0,
                                            "replies": [
                                                {
                                                    "body": "Show me on the doll where the post shamed you",
                                                    "author": "WandererOfInterwebs",
                                                    "id": "ffzoktb",
                                                    "parent_id": "t1_ffzoi53",
                                                    "score": 4,
                                                    "created_utc": 1580388126.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "You don't get how people work.\n\nWe all understimate what we have plenty of.\n\nOfc you don't care about attention as you are up to your neck in it. And we guys don't care about safety as feeling unsafe during a date isn't really a thing for us.",
                            "author": null,
                            "id": "fg1g1sl",
                            "parent_id": "t1_ffznlqp",
                            "score": 0,
                            "created_utc": 1580426447.0,
                            "replies": [
                                {
                                    "body": "OK brain genius, but safety —as in not dying or being subjected to bodily harm—is objectively more important than someone you don’t know telling you that your ass is cute.",
                                    "author": "WandererOfInterwebs",
                                    "id": "fg1geas",
                                    "parent_id": "t1_fg1g1sl",
                                    "score": 2,
                                    "created_utc": 1580426628.0,
                                    "replies": [
                                        {
                                            "body": ">is objectively more important \n\nNope, you don't get to decide that for others, each person has to evaluate that on their own.\n\nAnd keep in mind that lack of attentiond and affection does kill a lot of men through depression and suicide.\n\nBut I'm sure you don't care about that as your problems are just more important right?",
                                            "author": null,
                                            "id": "fg1n2xg",
                                            "parent_id": "t1_fg1geas",
                                            "score": 0,
                                            "created_utc": 1580430083.0,
                                            "replies": [
                                                {
                                                    "body": "The sort of attention we are talking about in this thread—romantic or sexual interest from the opposite sex—does not cause depression and/or suicide. That’s not how mental illness works.\n\nBut it is telling you’re conflating interest with “affection” as if being hit on by strangers makes anyone less lonely.",
                                                    "author": "WandererOfInterwebs",
                                                    "id": "fg1ojjb",
                                                    "parent_id": "t1_fg1n2xg",
                                                    "score": 2,
                                                    "created_utc": 1580430861.0,
                                                    "replies": [
                                                        {
                                                            "body": ">romantic or sexual interest from the opposite sex—does not cause depression and/or suicide. \n\nYes, it does. In fact that's the whole point of incels. You literally can't see the problem because you've never experienced a chronic lack of attention and how it hurts your ego",
                                                            "author": null,
                                                            "id": "fg1op13",
                                                            "parent_id": "t1_fg1ojjb",
                                                            "score": 0,
                                                            "created_utc": 1580430935.0,
                                                            "replies": [
                                                                {
                                                                    "body": "That isn’t “the whole point of incels” but your general ignorance of the topic  despite having a very strong opinion on it is noted",
                                                                    "author": "WandererOfInterwebs",
                                                                    "id": "fg1p5o9",
                                                                    "parent_id": "t1_fg1op13",
                                                                    "score": 2,
                                                                    "created_utc": 1580431154.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "This",
                    "author": null,
                    "id": "ffzg03e",
                    "parent_id": "t1_ffz8dme",
                    "score": 0,
                    "created_utc": 1580377200.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "What the earth??? Are these girls stupid? You must be dating under 21's.",
            "author": null,
            "id": "ffzjonj",
            "parent_id": "t1_ffypo3s",
            "score": 3,
            "created_utc": 1580382500.0,
            "replies": [
                {
                    "body": "One yes (parking lot) other no (27yo).",
                    "author": "stlmo2019",
                    "id": "fg1mmfj",
                    "parent_id": "t1_ffzjonj",
                    "score": 2,
                    "created_utc": 1580429840.0,
                    "replies": [
                        {
                            "body": "I'm shocked! You haven't been very lucky :(.",
                            "author": null,
                            "id": "fg2zdev",
                            "parent_id": "t1_fg1mmfj",
                            "score": 1,
                            "created_utc": 1580462897.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "It’s so funny that I am for sure not interested in that, and on the SD side of things it’s hard to get the time of Day much less actually make it to a M&G.",
            "author": "garret6758",
            "id": "ffz4x76",
            "parent_id": "t1_ffyamcf",
            "score": 2,
            "created_utc": 1580364101.0,
            "replies": []
        },
        {
            "body": "The being overpowered and hurt physically is probably the #1 concern. I can deal with rudeness and messy actions. As women, we're already taught our whole lives to beware of aggressive behavior. There's no way to mentally relax and give someone a chance to get to know you if you've got a wall up to begin with.",
            "author": "7475DeerDr",
            "id": "fg6n3yx",
            "parent_id": "t1_ffz89r0",
            "score": 1,
            "created_utc": 1580572246.0,
            "replies": []
        },
        {
            "body": "Maybe there are secret pervs on Christian Mingle.",
            "author": null,
            "id": "ffxxush",
            "parent_id": "t1_ffxvzjy",
            "score": 6,
            "created_utc": 1580334554.0,
            "replies": [
                {
                    "body": "Maybe they're into flogging away sins😏",
                    "author": null,
                    "id": "ffxyzgs",
                    "parent_id": "t1_ffxxush",
                    "score": 5,
                    "created_utc": 1580335200.0,
                    "replies": [
                        {
                            "body": "And little boys",
                            "author": "silversilomi",
                            "id": "ffy763o",
                            "parent_id": "t1_ffxyzgs",
                            "score": 1,
                            "created_utc": 1580339875.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "yep, i talk to so many sb's who complain about having had bad experiences, like having given up sugar w/o getting any back. Then when someone like me who is actually honest wants to get together with them, they are already overly skeptical.  Just today i chatted with 3 on SA who were wining about how they got humped/dumped and when i offered them to chat over the phone and/or meet in PUBLIC for lunch or drinks, crickets, no replies ...  \nMany will continue this behavior so i have no sympathy for these though honestly. Most just have very very poor judgment, both in vanilla and sugar worlds.",
            "author": null,
            "id": "ffyz2tw",
            "parent_id": "t1_ffxvzjy",
            "score": 7,
            "created_utc": 1580358897.0,
            "replies": [
                {
                    "body": "I personally freeze when it comes to phone calls. Call center PTSD is strong, but I try to arrange m&gs as soon as possible and I guess it scares POTs?",
                    "author": null,
                    "id": "ffyzk6m",
                    "parent_id": "t1_ffyz2tw",
                    "score": 2,
                    "created_utc": 1580359297.0,
                    "replies": [
                        {
                            "body": "I do the same. Limit conversation and texts until we meet In person. I tell them my expectations and then try to meet in person as soon as possible if they agree. The reason I do it is because my time is very precious and it helps me weed out the window shoppers and time wasters.",
                            "author": "Odd-Student",
                            "id": "fg7yhd1",
                            "parent_id": "t1_ffyzk6m",
                            "score": 1,
                            "created_utc": 1580604730.0,
                            "replies": []
                        },
                        {
                            "body": "I have no idea honestly. Some have been open to chat over the phone and the ones who actually agree to chat, we usually have great conversations and they are 100 times more willing to meet up, but then you have pot's who answer like \"LOL, what do u wana talk about\" and thats when I know that they are just not gonna meet ... or will throw out objections like \"my family lives in your city, i am little worried\"\nsometimes i dont know whether these chicks are trolling or not the smartest of the bunch lol\n\nProbably the latter, otherwise they'd somehow manage to get by in life without being broke and sitting on SA\n:)",
                            "author": null,
                            "id": "ffyzwhe",
                            "parent_id": "t1_ffyzk6m",
                            "score": 1,
                            "created_utc": 1580359578.0,
                            "replies": [
                                {
                                    "body": "I can't make excuses for others when I didn't enter the bowl broke, so yeah. I take it as casual dating with money as a perk instead of income, so to me I approach it as, \"I'm not gonna bullshit, we went over the basics. Let's meet up?\" And then boom crickets? Maybe I'm too assertive",
                                    "author": null,
                                    "id": "ffz0l7f",
                                    "parent_id": "t1_ffyzwhe",
                                    "score": 2,
                                    "created_utc": 1580360150.0,
                                    "replies": [
                                        {
                                            "body": "why would men be scared of meets? i understand so many things can go wrong for women, but as long as a man is interested and you make it convenient for him, most should be able/willing to meet. I have a fake sb account setup and she gets hit up by 40 emails a day begging her to meet in real person.",
                                            "author": null,
                                            "id": "ffz14ym",
                                            "parent_id": "t1_ffz0l7f",
                                            "score": 1,
                                            "created_utc": 1580360615.0,
                                            "replies": [
                                                {
                                                    "body": "Wow the most I get is like 3-5 a day. A fake account is getting more hits. I'm just gonna cry in a corner with a bag of tostitos.😭",
                                                    "author": null,
                                                    "id": "ffz1vm9",
                                                    "parent_id": "t1_ffz14ym",
                                                    "score": 2,
                                                    "created_utc": 1580361275.0,
                                                    "replies": [
                                                        {
                                                            "body": "It’s all about looks. The fake Sb is a 7 at least ... plus the cleavage is showing ...😍",
                                                            "author": null,
                                                            "id": "ffzvvyu",
                                                            "parent_id": "t1_ffz1vm9",
                                                            "score": 1,
                                                            "created_utc": 1580394266.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Ah. Well I barely have boobs so there's that🤣",
                                                                    "author": null,
                                                                    "id": "fg0ektf",
                                                                    "parent_id": "t1_ffzvvyu",
                                                                    "score": 1,
                                                                    "created_utc": 1580406161.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "ffxwq4a",
            "parent_id": "t1_ffxvzjy",
            "score": 3,
            "created_utc": 1580333925.0,
            "replies": [
                {
                    "body": "Too christian for my liking. I already say fuck too much for a catholic🤣",
                    "author": null,
                    "id": "ffxz7jc",
                    "parent_id": "t1_ffxwq4a",
                    "score": 5,
                    "created_utc": 1580335333.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "10's my ass! LOL most women on SA are 5-6 at best. I see 10's in LA maybe or Miami locales.",
            "author": null,
            "id": "ffyzkip",
            "parent_id": "t1_ffyr2dp",
            "score": 3,
            "created_utc": 1580359304.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "ffz415b",
                    "parent_id": "t1_ffyzkip",
                    "score": 11,
                    "created_utc": 1580363237.0,
                    "replies": [
                        {
                            "body": "It's almost as if most men who use that website aren't attractive 20 year old men. Shocker!",
                            "author": "RedPillLookism",
                            "id": "fg0h9ly",
                            "parent_id": "t1_ffz415b",
                            "score": 1,
                            "created_utc": 1580407768.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Let's not make a first meet at home a standard. That's not safe. I don't care how safe you think YOU are, there are men who will abuse the naivety of some younger SBs who read on this forum that YOU said its totally safe to venture to some rando's house before meeting and screening him.",
            "author": "kaeladurden",
            "id": "ffy588n",
            "parent_id": "t1_ffxzm56",
            "score": 9,
            "created_utc": 1580338783.0,
            "replies": []
        },
        {
            "body": "No, the assumption is meeting at his house or hotel is equal to a M&G...with the benefit of well..we're already here so....let's just do this now. He's always a 10 so there's no chance I won't like him in his mind. \n\nWe can cuddle or watch a movie...sorry these are not activities you get to manipulate into a freebie or ONS with me.",
            "author": "7475DeerDr",
            "id": "ffz49ek",
            "parent_id": "t1_ffxzm56",
            "score": 1,
            "created_utc": 1580363460.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "ffyms66",
            "parent_id": "t1_ffyk39x",
            "score": 5,
            "created_utc": 1580350141.0,
            "replies": [
                {
                    "body": "I don’t have a problem with a kiss or an ass grab after a M&G. I mean the point is having chemistry, so if I don’t want you to kiss me by the end of the M&G then I probably just don’t want an arrangement with you. But yeah good job on not going to his house. Sounds like you overall just weren’t into him.",
                    "author": "thatfitgirlmocha",
                    "id": "ffyzwa0",
                    "parent_id": "t1_ffyms66",
                    "score": 6,
                    "created_utc": 1580359573.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Sorry for the late response. The sites I used are Sugar Daddy Meet, Established Men and Secret Benefits. SDM was my favorite because it has a swipe matcher and a lot of choices. A few salts/splendas are on SDM but they are pretty honest upfront so you don’t have to waste time. Established men has a low number to pick from but most of the men on the site want a long term arrangement and are generous/sincere. Secret Benefits advertises on Eros so if you are looking long term make sure to relay that you are looking long term mutual. My current is actually from SB and I couldn’t be more happy.",
            "author": "Odd-Student",
            "id": "fg7w4vh",
            "parent_id": "t1_ffyh0g7",
            "score": 5,
            "created_utc": 1580602980.0,
            "replies": []
        },
        {
            "body": "I think she is referring to their mindset and behavior, not their age.",
            "author": "GSSD",
            "id": "ffzyfw1",
            "parent_id": "t1_ffzy6la",
            "score": 2,
            "created_utc": 1580396074.0,
            "replies": [
                {
                    "body": "Im curious to see her response. Ive met a few SB's at least in my area, who refuse to date anyone more than 35.",
                    "author": "FrankTheTankSD",
                    "id": "ffzymfy",
                    "parent_id": "t1_ffzyfw1",
                    "score": 1,
                    "created_utc": 1580396199.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "It is the mentality that \"I can buy my way in or out of anything\" that starts with spoiled kids who grow up to be even more spoiled men once they realize the power their money has. They're used to getting their way always.\n\nFrat boys may allude more towards the maturity level rather than age but it is very real trait that can be carried later in life by those that havent worked hard for what they have.\n\nI guess I would consider myself an older SB as I'm in my upper 30s but am told I look younger. I'm in a weird filter where I'm too old for some but somehow meets the criteria of \"older woman.\" \n\nI personally filter my age and older but am still finding many are here for the quick pass rather than the longer term.",
            "author": "7475DeerDr",
            "id": "fg6ohdv",
            "parent_id": "t1_ffzy6la",
            "score": 2,
            "created_utc": 1580573197.0,
            "replies": []
        },
        {
            "body": "Lol at equating the risk of serious bodily harm with....attention? \n\nThis particular thing does not “cut both ways.”\n\nMost of it isn’t flattering and usually comes with aggression if you don’t respond the “right” way. I’ve lived in cities with vocal but playful cat calling cultures and cities where men are unlikely ever come up to women and I much prefer the latter. \n\nI think anyone claiming they’d trade some bodily autonomy and freedom of movement to be ogled by women is probably deluded about the actual value of attention from total strangers.",
            "author": "WandererOfInterwebs",
            "id": "ffznlqp",
            "parent_id": "t1_ffz8dme",
            "score": 5,
            "created_utc": 1580387159.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "ffznzv7",
                    "parent_id": "t1_ffznlqp",
                    "score": 0,
                    "created_utc": 1580387553.0,
                    "replies": [
                        {
                            "body": "Who asked for it “both ways”?\n\nAnd the things she mentioned don’t come along with being a beautiful woman, but being any woman. \n\nAnd it makes no logical sense to compare being celebrity, which is a job people choose and actively pursue, with being born with vagina.  People are annoyed when celebrities complain (some are anyway, I think anyone is allowed to be vocal about being poorly treated?) because they willingly put themselves in the spot light. \n\nYou seem to think that because being a woman comes with certain perceived “benefits” it’s somehow bad form to complain about the insanely shitty parts of it? You’re doing more feeling than reasoning here.",
                            "author": "WandererOfInterwebs",
                            "id": "ffzoblv",
                            "parent_id": "t1_ffznzv7",
                            "score": 3,
                            "created_utc": 1580387876.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "ffzoi53",
                                    "parent_id": "t1_ffzoblv",
                                    "score": 0,
                                    "created_utc": 1580388054.0,
                                    "replies": [
                                        {
                                            "body": "Show me on the doll where the post shamed you",
                                            "author": "WandererOfInterwebs",
                                            "id": "ffzoktb",
                                            "parent_id": "t1_ffzoi53",
                                            "score": 4,
                                            "created_utc": 1580388126.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "You don't get how people work.\n\nWe all understimate what we have plenty of.\n\nOfc you don't care about attention as you are up to your neck in it. And we guys don't care about safety as feeling unsafe during a date isn't really a thing for us.",
                    "author": null,
                    "id": "fg1g1sl",
                    "parent_id": "t1_ffznlqp",
                    "score": 0,
                    "created_utc": 1580426447.0,
                    "replies": [
                        {
                            "body": "OK brain genius, but safety —as in not dying or being subjected to bodily harm—is objectively more important than someone you don’t know telling you that your ass is cute.",
                            "author": "WandererOfInterwebs",
                            "id": "fg1geas",
                            "parent_id": "t1_fg1g1sl",
                            "score": 2,
                            "created_utc": 1580426628.0,
                            "replies": [
                                {
                                    "body": ">is objectively more important \n\nNope, you don't get to decide that for others, each person has to evaluate that on their own.\n\nAnd keep in mind that lack of attentiond and affection does kill a lot of men through depression and suicide.\n\nBut I'm sure you don't care about that as your problems are just more important right?",
                                    "author": null,
                                    "id": "fg1n2xg",
                                    "parent_id": "t1_fg1geas",
                                    "score": 0,
                                    "created_utc": 1580430083.0,
                                    "replies": [
                                        {
                                            "body": "The sort of attention we are talking about in this thread—romantic or sexual interest from the opposite sex—does not cause depression and/or suicide. That’s not how mental illness works.\n\nBut it is telling you’re conflating interest with “affection” as if being hit on by strangers makes anyone less lonely.",
                                            "author": "WandererOfInterwebs",
                                            "id": "fg1ojjb",
                                            "parent_id": "t1_fg1n2xg",
                                            "score": 2,
                                            "created_utc": 1580430861.0,
                                            "replies": [
                                                {
                                                    "body": ">romantic or sexual interest from the opposite sex—does not cause depression and/or suicide. \n\nYes, it does. In fact that's the whole point of incels. You literally can't see the problem because you've never experienced a chronic lack of attention and how it hurts your ego",
                                                    "author": null,
                                                    "id": "fg1op13",
                                                    "parent_id": "t1_fg1ojjb",
                                                    "score": 0,
                                                    "created_utc": 1580430935.0,
                                                    "replies": [
                                                        {
                                                            "body": "That isn’t “the whole point of incels” but your general ignorance of the topic  despite having a very strong opinion on it is noted",
                                                            "author": "WandererOfInterwebs",
                                                            "id": "fg1p5o9",
                                                            "parent_id": "t1_fg1op13",
                                                            "score": 2,
                                                            "created_utc": 1580431154.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "This",
            "author": null,
            "id": "ffzg03e",
            "parent_id": "t1_ffz8dme",
            "score": 0,
            "created_utc": 1580377200.0,
            "replies": []
        },
        {
            "body": "One yes (parking lot) other no (27yo).",
            "author": "stlmo2019",
            "id": "fg1mmfj",
            "parent_id": "t1_ffzjonj",
            "score": 2,
            "created_utc": 1580429840.0,
            "replies": [
                {
                    "body": "I'm shocked! You haven't been very lucky :(.",
                    "author": null,
                    "id": "fg2zdev",
                    "parent_id": "t1_fg1mmfj",
                    "score": 1,
                    "created_utc": 1580462897.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Maybe they're into flogging away sins😏",
            "author": null,
            "id": "ffxyzgs",
            "parent_id": "t1_ffxxush",
            "score": 5,
            "created_utc": 1580335200.0,
            "replies": [
                {
                    "body": "And little boys",
                    "author": "silversilomi",
                    "id": "ffy763o",
                    "parent_id": "t1_ffxyzgs",
                    "score": 1,
                    "created_utc": 1580339875.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I personally freeze when it comes to phone calls. Call center PTSD is strong, but I try to arrange m&gs as soon as possible and I guess it scares POTs?",
            "author": null,
            "id": "ffyzk6m",
            "parent_id": "t1_ffyz2tw",
            "score": 2,
            "created_utc": 1580359297.0,
            "replies": [
                {
                    "body": "I do the same. Limit conversation and texts until we meet In person. I tell them my expectations and then try to meet in person as soon as possible if they agree. The reason I do it is because my time is very precious and it helps me weed out the window shoppers and time wasters.",
                    "author": "Odd-Student",
                    "id": "fg7yhd1",
                    "parent_id": "t1_ffyzk6m",
                    "score": 1,
                    "created_utc": 1580604730.0,
                    "replies": []
                },
                {
                    "body": "I have no idea honestly. Some have been open to chat over the phone and the ones who actually agree to chat, we usually have great conversations and they are 100 times more willing to meet up, but then you have pot's who answer like \"LOL, what do u wana talk about\" and thats when I know that they are just not gonna meet ... or will throw out objections like \"my family lives in your city, i am little worried\"\nsometimes i dont know whether these chicks are trolling or not the smartest of the bunch lol\n\nProbably the latter, otherwise they'd somehow manage to get by in life without being broke and sitting on SA\n:)",
                    "author": null,
                    "id": "ffyzwhe",
                    "parent_id": "t1_ffyzk6m",
                    "score": 1,
                    "created_utc": 1580359578.0,
                    "replies": [
                        {
                            "body": "I can't make excuses for others when I didn't enter the bowl broke, so yeah. I take it as casual dating with money as a perk instead of income, so to me I approach it as, \"I'm not gonna bullshit, we went over the basics. Let's meet up?\" And then boom crickets? Maybe I'm too assertive",
                            "author": null,
                            "id": "ffz0l7f",
                            "parent_id": "t1_ffyzwhe",
                            "score": 2,
                            "created_utc": 1580360150.0,
                            "replies": [
                                {
                                    "body": "why would men be scared of meets? i understand so many things can go wrong for women, but as long as a man is interested and you make it convenient for him, most should be able/willing to meet. I have a fake sb account setup and she gets hit up by 40 emails a day begging her to meet in real person.",
                                    "author": null,
                                    "id": "ffz14ym",
                                    "parent_id": "t1_ffz0l7f",
                                    "score": 1,
                                    "created_utc": 1580360615.0,
                                    "replies": [
                                        {
                                            "body": "Wow the most I get is like 3-5 a day. A fake account is getting more hits. I'm just gonna cry in a corner with a bag of tostitos.😭",
                                            "author": null,
                                            "id": "ffz1vm9",
                                            "parent_id": "t1_ffz14ym",
                                            "score": 2,
                                            "created_utc": 1580361275.0,
                                            "replies": [
                                                {
                                                    "body": "It’s all about looks. The fake Sb is a 7 at least ... plus the cleavage is showing ...😍",
                                                    "author": null,
                                                    "id": "ffzvvyu",
                                                    "parent_id": "t1_ffz1vm9",
                                                    "score": 1,
                                                    "created_utc": 1580394266.0,
                                                    "replies": [
                                                        {
                                                            "body": "Ah. Well I barely have boobs so there's that🤣",
                                                            "author": null,
                                                            "id": "fg0ektf",
                                                            "parent_id": "t1_ffzvvyu",
                                                            "score": 1,
                                                            "created_utc": 1580406161.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Too christian for my liking. I already say fuck too much for a catholic🤣",
            "author": null,
            "id": "ffxz7jc",
            "parent_id": "t1_ffxwq4a",
            "score": 5,
            "created_utc": 1580335333.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "ffz415b",
            "parent_id": "t1_ffyzkip",
            "score": 11,
            "created_utc": 1580363237.0,
            "replies": [
                {
                    "body": "It's almost as if most men who use that website aren't attractive 20 year old men. Shocker!",
                    "author": "RedPillLookism",
                    "id": "fg0h9ly",
                    "parent_id": "t1_ffz415b",
                    "score": 1,
                    "created_utc": 1580407768.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I don’t have a problem with a kiss or an ass grab after a M&G. I mean the point is having chemistry, so if I don’t want you to kiss me by the end of the M&G then I probably just don’t want an arrangement with you. But yeah good job on not going to his house. Sounds like you overall just weren’t into him.",
            "author": "thatfitgirlmocha",
            "id": "ffyzwa0",
            "parent_id": "t1_ffyms66",
            "score": 6,
            "created_utc": 1580359573.0,
            "replies": []
        },
        {
            "body": "Im curious to see her response. Ive met a few SB's at least in my area, who refuse to date anyone more than 35.",
            "author": "FrankTheTankSD",
            "id": "ffzymfy",
            "parent_id": "t1_ffzyfw1",
            "score": 1,
            "created_utc": 1580396199.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "ffznzv7",
            "parent_id": "t1_ffznlqp",
            "score": 0,
            "created_utc": 1580387553.0,
            "replies": [
                {
                    "body": "Who asked for it “both ways”?\n\nAnd the things she mentioned don’t come along with being a beautiful woman, but being any woman. \n\nAnd it makes no logical sense to compare being celebrity, which is a job people choose and actively pursue, with being born with vagina.  People are annoyed when celebrities complain (some are anyway, I think anyone is allowed to be vocal about being poorly treated?) because they willingly put themselves in the spot light. \n\nYou seem to think that because being a woman comes with certain perceived “benefits” it’s somehow bad form to complain about the insanely shitty parts of it? You’re doing more feeling than reasoning here.",
                    "author": "WandererOfInterwebs",
                    "id": "ffzoblv",
                    "parent_id": "t1_ffznzv7",
                    "score": 3,
                    "created_utc": 1580387876.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "ffzoi53",
                            "parent_id": "t1_ffzoblv",
                            "score": 0,
                            "created_utc": 1580388054.0,
                            "replies": [
                                {
                                    "body": "Show me on the doll where the post shamed you",
                                    "author": "WandererOfInterwebs",
                                    "id": "ffzoktb",
                                    "parent_id": "t1_ffzoi53",
                                    "score": 4,
                                    "created_utc": 1580388126.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "You don't get how people work.\n\nWe all understimate what we have plenty of.\n\nOfc you don't care about attention as you are up to your neck in it. And we guys don't care about safety as feeling unsafe during a date isn't really a thing for us.",
            "author": null,
            "id": "fg1g1sl",
            "parent_id": "t1_ffznlqp",
            "score": 0,
            "created_utc": 1580426447.0,
            "replies": [
                {
                    "body": "OK brain genius, but safety —as in not dying or being subjected to bodily harm—is objectively more important than someone you don’t know telling you that your ass is cute.",
                    "author": "WandererOfInterwebs",
                    "id": "fg1geas",
                    "parent_id": "t1_fg1g1sl",
                    "score": 2,
                    "created_utc": 1580426628.0,
                    "replies": [
                        {
                            "body": ">is objectively more important \n\nNope, you don't get to decide that for others, each person has to evaluate that on their own.\n\nAnd keep in mind that lack of attentiond and affection does kill a lot of men through depression and suicide.\n\nBut I'm sure you don't care about that as your problems are just more important right?",
                            "author": null,
                            "id": "fg1n2xg",
                            "parent_id": "t1_fg1geas",
                            "score": 0,
                            "created_utc": 1580430083.0,
                            "replies": [
                                {
                                    "body": "The sort of attention we are talking about in this thread—romantic or sexual interest from the opposite sex—does not cause depression and/or suicide. That’s not how mental illness works.\n\nBut it is telling you’re conflating interest with “affection” as if being hit on by strangers makes anyone less lonely.",
                                    "author": "WandererOfInterwebs",
                                    "id": "fg1ojjb",
                                    "parent_id": "t1_fg1n2xg",
                                    "score": 2,
                                    "created_utc": 1580430861.0,
                                    "replies": [
                                        {
                                            "body": ">romantic or sexual interest from the opposite sex—does not cause depression and/or suicide. \n\nYes, it does. In fact that's the whole point of incels. You literally can't see the problem because you've never experienced a chronic lack of attention and how it hurts your ego",
                                            "author": null,
                                            "id": "fg1op13",
                                            "parent_id": "t1_fg1ojjb",
                                            "score": 0,
                                            "created_utc": 1580430935.0,
                                            "replies": [
                                                {
                                                    "body": "That isn’t “the whole point of incels” but your general ignorance of the topic  despite having a very strong opinion on it is noted",
                                                    "author": "WandererOfInterwebs",
                                                    "id": "fg1p5o9",
                                                    "parent_id": "t1_fg1op13",
                                                    "score": 2,
                                                    "created_utc": 1580431154.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I'm shocked! You haven't been very lucky :(.",
            "author": null,
            "id": "fg2zdev",
            "parent_id": "t1_fg1mmfj",
            "score": 1,
            "created_utc": 1580462897.0,
            "replies": []
        },
        {
            "body": "And little boys",
            "author": "silversilomi",
            "id": "ffy763o",
            "parent_id": "t1_ffxyzgs",
            "score": 1,
            "created_utc": 1580339875.0,
            "replies": []
        },
        {
            "body": "I do the same. Limit conversation and texts until we meet In person. I tell them my expectations and then try to meet in person as soon as possible if they agree. The reason I do it is because my time is very precious and it helps me weed out the window shoppers and time wasters.",
            "author": "Odd-Student",
            "id": "fg7yhd1",
            "parent_id": "t1_ffyzk6m",
            "score": 1,
            "created_utc": 1580604730.0,
            "replies": []
        },
        {
            "body": "I have no idea honestly. Some have been open to chat over the phone and the ones who actually agree to chat, we usually have great conversations and they are 100 times more willing to meet up, but then you have pot's who answer like \"LOL, what do u wana talk about\" and thats when I know that they are just not gonna meet ... or will throw out objections like \"my family lives in your city, i am little worried\"\nsometimes i dont know whether these chicks are trolling or not the smartest of the bunch lol\n\nProbably the latter, otherwise they'd somehow manage to get by in life without being broke and sitting on SA\n:)",
            "author": null,
            "id": "ffyzwhe",
            "parent_id": "t1_ffyzk6m",
            "score": 1,
            "created_utc": 1580359578.0,
            "replies": [
                {
                    "body": "I can't make excuses for others when I didn't enter the bowl broke, so yeah. I take it as casual dating with money as a perk instead of income, so to me I approach it as, \"I'm not gonna bullshit, we went over the basics. Let's meet up?\" And then boom crickets? Maybe I'm too assertive",
                    "author": null,
                    "id": "ffz0l7f",
                    "parent_id": "t1_ffyzwhe",
                    "score": 2,
                    "created_utc": 1580360150.0,
                    "replies": [
                        {
                            "body": "why would men be scared of meets? i understand so many things can go wrong for women, but as long as a man is interested and you make it convenient for him, most should be able/willing to meet. I have a fake sb account setup and she gets hit up by 40 emails a day begging her to meet in real person.",
                            "author": null,
                            "id": "ffz14ym",
                            "parent_id": "t1_ffz0l7f",
                            "score": 1,
                            "created_utc": 1580360615.0,
                            "replies": [
                                {
                                    "body": "Wow the most I get is like 3-5 a day. A fake account is getting more hits. I'm just gonna cry in a corner with a bag of tostitos.😭",
                                    "author": null,
                                    "id": "ffz1vm9",
                                    "parent_id": "t1_ffz14ym",
                                    "score": 2,
                                    "created_utc": 1580361275.0,
                                    "replies": [
                                        {
                                            "body": "It’s all about looks. The fake Sb is a 7 at least ... plus the cleavage is showing ...😍",
                                            "author": null,
                                            "id": "ffzvvyu",
                                            "parent_id": "t1_ffz1vm9",
                                            "score": 1,
                                            "created_utc": 1580394266.0,
                                            "replies": [
                                                {
                                                    "body": "Ah. Well I barely have boobs so there's that🤣",
                                                    "author": null,
                                                    "id": "fg0ektf",
                                                    "parent_id": "t1_ffzvvyu",
                                                    "score": 1,
                                                    "created_utc": 1580406161.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "It's almost as if most men who use that website aren't attractive 20 year old men. Shocker!",
            "author": "RedPillLookism",
            "id": "fg0h9ly",
            "parent_id": "t1_ffz415b",
            "score": 1,
            "created_utc": 1580407768.0,
            "replies": []
        },
        {
            "body": "Who asked for it “both ways”?\n\nAnd the things she mentioned don’t come along with being a beautiful woman, but being any woman. \n\nAnd it makes no logical sense to compare being celebrity, which is a job people choose and actively pursue, with being born with vagina.  People are annoyed when celebrities complain (some are anyway, I think anyone is allowed to be vocal about being poorly treated?) because they willingly put themselves in the spot light. \n\nYou seem to think that because being a woman comes with certain perceived “benefits” it’s somehow bad form to complain about the insanely shitty parts of it? You’re doing more feeling than reasoning here.",
            "author": "WandererOfInterwebs",
            "id": "ffzoblv",
            "parent_id": "t1_ffznzv7",
            "score": 3,
            "created_utc": 1580387876.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "ffzoi53",
                    "parent_id": "t1_ffzoblv",
                    "score": 0,
                    "created_utc": 1580388054.0,
                    "replies": [
                        {
                            "body": "Show me on the doll where the post shamed you",
                            "author": "WandererOfInterwebs",
                            "id": "ffzoktb",
                            "parent_id": "t1_ffzoi53",
                            "score": 4,
                            "created_utc": 1580388126.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "OK brain genius, but safety —as in not dying or being subjected to bodily harm—is objectively more important than someone you don’t know telling you that your ass is cute.",
            "author": "WandererOfInterwebs",
            "id": "fg1geas",
            "parent_id": "t1_fg1g1sl",
            "score": 2,
            "created_utc": 1580426628.0,
            "replies": [
                {
                    "body": ">is objectively more important \n\nNope, you don't get to decide that for others, each person has to evaluate that on their own.\n\nAnd keep in mind that lack of attentiond and affection does kill a lot of men through depression and suicide.\n\nBut I'm sure you don't care about that as your problems are just more important right?",
                    "author": null,
                    "id": "fg1n2xg",
                    "parent_id": "t1_fg1geas",
                    "score": 0,
                    "created_utc": 1580430083.0,
                    "replies": [
                        {
                            "body": "The sort of attention we are talking about in this thread—romantic or sexual interest from the opposite sex—does not cause depression and/or suicide. That’s not how mental illness works.\n\nBut it is telling you’re conflating interest with “affection” as if being hit on by strangers makes anyone less lonely.",
                            "author": "WandererOfInterwebs",
                            "id": "fg1ojjb",
                            "parent_id": "t1_fg1n2xg",
                            "score": 2,
                            "created_utc": 1580430861.0,
                            "replies": [
                                {
                                    "body": ">romantic or sexual interest from the opposite sex—does not cause depression and/or suicide. \n\nYes, it does. In fact that's the whole point of incels. You literally can't see the problem because you've never experienced a chronic lack of attention and how it hurts your ego",
                                    "author": null,
                                    "id": "fg1op13",
                                    "parent_id": "t1_fg1ojjb",
                                    "score": 0,
                                    "created_utc": 1580430935.0,
                                    "replies": [
                                        {
                                            "body": "That isn’t “the whole point of incels” but your general ignorance of the topic  despite having a very strong opinion on it is noted",
                                            "author": "WandererOfInterwebs",
                                            "id": "fg1p5o9",
                                            "parent_id": "t1_fg1op13",
                                            "score": 2,
                                            "created_utc": 1580431154.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I can't make excuses for others when I didn't enter the bowl broke, so yeah. I take it as casual dating with money as a perk instead of income, so to me I approach it as, \"I'm not gonna bullshit, we went over the basics. Let's meet up?\" And then boom crickets? Maybe I'm too assertive",
            "author": null,
            "id": "ffz0l7f",
            "parent_id": "t1_ffyzwhe",
            "score": 2,
            "created_utc": 1580360150.0,
            "replies": [
                {
                    "body": "why would men be scared of meets? i understand so many things can go wrong for women, but as long as a man is interested and you make it convenient for him, most should be able/willing to meet. I have a fake sb account setup and she gets hit up by 40 emails a day begging her to meet in real person.",
                    "author": null,
                    "id": "ffz14ym",
                    "parent_id": "t1_ffz0l7f",
                    "score": 1,
                    "created_utc": 1580360615.0,
                    "replies": [
                        {
                            "body": "Wow the most I get is like 3-5 a day. A fake account is getting more hits. I'm just gonna cry in a corner with a bag of tostitos.😭",
                            "author": null,
                            "id": "ffz1vm9",
                            "parent_id": "t1_ffz14ym",
                            "score": 2,
                            "created_utc": 1580361275.0,
                            "replies": [
                                {
                                    "body": "It’s all about looks. The fake Sb is a 7 at least ... plus the cleavage is showing ...😍",
                                    "author": null,
                                    "id": "ffzvvyu",
                                    "parent_id": "t1_ffz1vm9",
                                    "score": 1,
                                    "created_utc": 1580394266.0,
                                    "replies": [
                                        {
                                            "body": "Ah. Well I barely have boobs so there's that🤣",
                                            "author": null,
                                            "id": "fg0ektf",
                                            "parent_id": "t1_ffzvvyu",
                                            "score": 1,
                                            "created_utc": 1580406161.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "ffzoi53",
            "parent_id": "t1_ffzoblv",
            "score": 0,
            "created_utc": 1580388054.0,
            "replies": [
                {
                    "body": "Show me on the doll where the post shamed you",
                    "author": "WandererOfInterwebs",
                    "id": "ffzoktb",
                    "parent_id": "t1_ffzoi53",
                    "score": 4,
                    "created_utc": 1580388126.0,
                    "replies": []
                }
            ]
        },
        {
            "body": ">is objectively more important \n\nNope, you don't get to decide that for others, each person has to evaluate that on their own.\n\nAnd keep in mind that lack of attentiond and affection does kill a lot of men through depression and suicide.\n\nBut I'm sure you don't care about that as your problems are just more important right?",
            "author": null,
            "id": "fg1n2xg",
            "parent_id": "t1_fg1geas",
            "score": 0,
            "created_utc": 1580430083.0,
            "replies": [
                {
                    "body": "The sort of attention we are talking about in this thread—romantic or sexual interest from the opposite sex—does not cause depression and/or suicide. That’s not how mental illness works.\n\nBut it is telling you’re conflating interest with “affection” as if being hit on by strangers makes anyone less lonely.",
                    "author": "WandererOfInterwebs",
                    "id": "fg1ojjb",
                    "parent_id": "t1_fg1n2xg",
                    "score": 2,
                    "created_utc": 1580430861.0,
                    "replies": [
                        {
                            "body": ">romantic or sexual interest from the opposite sex—does not cause depression and/or suicide. \n\nYes, it does. In fact that's the whole point of incels. You literally can't see the problem because you've never experienced a chronic lack of attention and how it hurts your ego",
                            "author": null,
                            "id": "fg1op13",
                            "parent_id": "t1_fg1ojjb",
                            "score": 0,
                            "created_utc": 1580430935.0,
                            "replies": [
                                {
                                    "body": "That isn’t “the whole point of incels” but your general ignorance of the topic  despite having a very strong opinion on it is noted",
                                    "author": "WandererOfInterwebs",
                                    "id": "fg1p5o9",
                                    "parent_id": "t1_fg1op13",
                                    "score": 2,
                                    "created_utc": 1580431154.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "why would men be scared of meets? i understand so many things can go wrong for women, but as long as a man is interested and you make it convenient for him, most should be able/willing to meet. I have a fake sb account setup and she gets hit up by 40 emails a day begging her to meet in real person.",
            "author": null,
            "id": "ffz14ym",
            "parent_id": "t1_ffz0l7f",
            "score": 1,
            "created_utc": 1580360615.0,
            "replies": [
                {
                    "body": "Wow the most I get is like 3-5 a day. A fake account is getting more hits. I'm just gonna cry in a corner with a bag of tostitos.😭",
                    "author": null,
                    "id": "ffz1vm9",
                    "parent_id": "t1_ffz14ym",
                    "score": 2,
                    "created_utc": 1580361275.0,
                    "replies": [
                        {
                            "body": "It’s all about looks. The fake Sb is a 7 at least ... plus the cleavage is showing ...😍",
                            "author": null,
                            "id": "ffzvvyu",
                            "parent_id": "t1_ffz1vm9",
                            "score": 1,
                            "created_utc": 1580394266.0,
                            "replies": [
                                {
                                    "body": "Ah. Well I barely have boobs so there's that🤣",
                                    "author": null,
                                    "id": "fg0ektf",
                                    "parent_id": "t1_ffzvvyu",
                                    "score": 1,
                                    "created_utc": 1580406161.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Show me on the doll where the post shamed you",
            "author": "WandererOfInterwebs",
            "id": "ffzoktb",
            "parent_id": "t1_ffzoi53",
            "score": 4,
            "created_utc": 1580388126.0,
            "replies": []
        },
        {
            "body": "The sort of attention we are talking about in this thread—romantic or sexual interest from the opposite sex—does not cause depression and/or suicide. That’s not how mental illness works.\n\nBut it is telling you’re conflating interest with “affection” as if being hit on by strangers makes anyone less lonely.",
            "author": "WandererOfInterwebs",
            "id": "fg1ojjb",
            "parent_id": "t1_fg1n2xg",
            "score": 2,
            "created_utc": 1580430861.0,
            "replies": [
                {
                    "body": ">romantic or sexual interest from the opposite sex—does not cause depression and/or suicide. \n\nYes, it does. In fact that's the whole point of incels. You literally can't see the problem because you've never experienced a chronic lack of attention and how it hurts your ego",
                    "author": null,
                    "id": "fg1op13",
                    "parent_id": "t1_fg1ojjb",
                    "score": 0,
                    "created_utc": 1580430935.0,
                    "replies": [
                        {
                            "body": "That isn’t “the whole point of incels” but your general ignorance of the topic  despite having a very strong opinion on it is noted",
                            "author": "WandererOfInterwebs",
                            "id": "fg1p5o9",
                            "parent_id": "t1_fg1op13",
                            "score": 2,
                            "created_utc": 1580431154.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Wow the most I get is like 3-5 a day. A fake account is getting more hits. I'm just gonna cry in a corner with a bag of tostitos.😭",
            "author": null,
            "id": "ffz1vm9",
            "parent_id": "t1_ffz14ym",
            "score": 2,
            "created_utc": 1580361275.0,
            "replies": [
                {
                    "body": "It’s all about looks. The fake Sb is a 7 at least ... plus the cleavage is showing ...😍",
                    "author": null,
                    "id": "ffzvvyu",
                    "parent_id": "t1_ffz1vm9",
                    "score": 1,
                    "created_utc": 1580394266.0,
                    "replies": [
                        {
                            "body": "Ah. Well I barely have boobs so there's that🤣",
                            "author": null,
                            "id": "fg0ektf",
                            "parent_id": "t1_ffzvvyu",
                            "score": 1,
                            "created_utc": 1580406161.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": ">romantic or sexual interest from the opposite sex—does not cause depression and/or suicide. \n\nYes, it does. In fact that's the whole point of incels. You literally can't see the problem because you've never experienced a chronic lack of attention and how it hurts your ego",
            "author": null,
            "id": "fg1op13",
            "parent_id": "t1_fg1ojjb",
            "score": 0,
            "created_utc": 1580430935.0,
            "replies": [
                {
                    "body": "That isn’t “the whole point of incels” but your general ignorance of the topic  despite having a very strong opinion on it is noted",
                    "author": "WandererOfInterwebs",
                    "id": "fg1p5o9",
                    "parent_id": "t1_fg1op13",
                    "score": 2,
                    "created_utc": 1580431154.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "It’s all about looks. The fake Sb is a 7 at least ... plus the cleavage is showing ...😍",
            "author": null,
            "id": "ffzvvyu",
            "parent_id": "t1_ffz1vm9",
            "score": 1,
            "created_utc": 1580394266.0,
            "replies": [
                {
                    "body": "Ah. Well I barely have boobs so there's that🤣",
                    "author": null,
                    "id": "fg0ektf",
                    "parent_id": "t1_ffzvvyu",
                    "score": 1,
                    "created_utc": 1580406161.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "That isn’t “the whole point of incels” but your general ignorance of the topic  despite having a very strong opinion on it is noted",
            "author": "WandererOfInterwebs",
            "id": "fg1p5o9",
            "parent_id": "t1_fg1op13",
            "score": 2,
            "created_utc": 1580431154.0,
            "replies": []
        },
        {
            "body": "Ah. Well I barely have boobs so there's that🤣",
            "author": null,
            "id": "fg0ektf",
            "parent_id": "t1_ffzvvyu",
            "score": 1,
            "created_utc": 1580406161.0,
            "replies": []
        }
    ]
}