{
    "title": "Settling once and for all because I’m sick of seeing it - allowance conversations",
    "post_id": "x2p9q6",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/x2p9q6/settling_once_and_for_all_because_im_sick_of/",
    "author": "CatLadyAmy1",
    "body": "I’ve been in the bowl for 6 years and have had my fair share of allowances and conversations. I’ve have mid range to xx,xxx ones. \n\n“How do I bring up the conversation?”\n“How do I talk to a whale about this?”\n\nThe answer is so simple, YOU ASK. Closed mouths do not get fed. \n\nYou met on a site where financial compensation is part of the relationship, if he doesn’t bring it up MAKE SURE YOU DO because then we’ll get the post,\n“My POT didn’t pay me and I already slept with him because he said, blah blah blah..:” \n\nIf a POT/SD doesn’t bring it up in the initial messages, I’ll go on a full blown date with the guy. (No financial expectations to meet… obviously) hell, it may not come up over dinner… usually it does though and if it doesn’t then you TEXT him. \n“Hey, I had an amazing time with you, I’d love to move forward and talk expectations*” key word. You’ve opened up the conversation. If he agrees, then literally say what you want. \n\n“Looking for a genuine connection where we go to dinner, activities, (the obvious) meet relatively once a week. My allowances that I’ve had in the past usually range from x to x, if that works for you, great! If not, I wish you the best of luck!” \n\nThat’s it. It’s so simple. Both parties are able to choose and move on. Just be Frank, that’s the beauty of these relationships… you don’t have to hide. \nUntil this conversation is had do not go to his house, the hotel or on another date (the last one is just my personal opinion) \n\nHope this helps.",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/x2p9q6/settling_once_and_for_all_because_im_sick_of/",
    "score": 130,
    "upvote_ratio": 0.91,
    "created_utc": 1661981455.0,
    "num_comments": 70,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "I’m an SD. Been one for the last 4 years. Had 3 SB’s and a few dozen M&Gs. I’ve always brought up the arrangement conversation ahead of the M&G and leave it to the SB to decide is she wants to sort things out ahead of time or at the M&G. I’m older, have way more money, and far more life experience. I view it as my job to make things as easy as I can for her. I have a number I’m willing to use to make her life better. It’s a small piece of my pie and usually a significant amount to her. I always offer the full amount. I have never thought of this as a negotiation. To me that’s an ugly approach that totally misses the point. I would rather spend an extra x,xxx per month and make someone’s life that much better then keep it in my account. The result is happy relationships that have only ended because she moved or was ready for her forever guy. To me, this is the way.",
            "author": null,
            "id": "imm75lt",
            "parent_id": "t3_x2p9q6",
            "score": 64,
            "created_utc": 1662004005.0,
            "replies": [
                {
                    "body": "You are a real SD and do what all real SDs do. The number might change but the intent and presentation is the same. \n\nBut sadly most \"SDs\" don't appear to be that at all. So the young girls need to be educated as to the proper way to handle the slick,older ,and vastly more experienced predators.",
                    "author": "GSSD",
                    "id": "imng84d",
                    "parent_id": "t1_imm75lt",
                    "score": 15,
                    "created_utc": 1662035159.0,
                    "replies": []
                },
                {
                    "body": "Wow…..I’m completely new to this world but you just showed me the kind of man I should be looking for. That is the classiest, hottest response I’ve ever read. Thank you for giving me hope that there are more SD’s out there like you & not to settle for less. ❤️",
                    "author": "Pryncess913",
                    "id": "imo9hno",
                    "parent_id": "t1_imm75lt",
                    "score": 8,
                    "created_utc": 1662047517.0,
                    "replies": [
                        {
                            "body": "You’re welcome! Good luck with your search",
                            "author": null,
                            "id": "imrtfw7",
                            "parent_id": "t1_imo9hno",
                            "score": 3,
                            "created_utc": 1662107603.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "I think honestly this works and makes alot of sense. Well said.",
                    "author": "Brownsugatoez",
                    "id": "imn1eei",
                    "parent_id": "t1_imm75lt",
                    "score": 3,
                    "created_utc": 1662026046.0,
                    "replies": [
                        {
                            "body": "Thanks. Works for me! I suppose that’s all that matters as far as I’m concerned 😀",
                            "author": null,
                            "id": "imn231w",
                            "parent_id": "t1_imn1eei",
                            "score": 2,
                            "created_utc": 1662026563.0,
                            "replies": [
                                {
                                    "body": "Exactly! What works for you works for you. It’s really not Rocket science. I think some people really overcomplicate the topic by overthinking. But thank you for being one to bring ease to it when it comes up 😉",
                                    "author": "Brownsugatoez",
                                    "id": "imn2hx8",
                                    "parent_id": "t1_imn231w",
                                    "score": 4,
                                    "created_utc": 1662026868.0,
                                    "replies": [
                                        {
                                            "body": "It’s literally my pleasure 🤣",
                                            "author": null,
                                            "id": "imn2qfx",
                                            "parent_id": "t1_imn2hx8",
                                            "score": 1,
                                            "created_utc": 1662027048.0,
                                            "replies": [
                                                {
                                                    "body": "🤣🤣🤣",
                                                    "author": "Brownsugatoez",
                                                    "id": "imn2scm",
                                                    "parent_id": "t1_imn2qfx",
                                                    "score": 1,
                                                    "created_utc": 1662027087.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Well said and thanks. \n\nAs a reminder - and POT SD who does not react well to the topic - he is not an SD.",
            "author": "sfwinefan",
            "id": "imkxlsv",
            "parent_id": "t3_x2p9q6",
            "score": 49,
            "created_utc": 1661983533.0,
            "replies": [
                {
                    "body": "💯",
                    "author": "CatLadyAmy1",
                    "id": "iml2xzh",
                    "parent_id": "t1_imkxlsv",
                    "score": 6,
                    "created_utc": 1661985782.0,
                    "replies": []
                },
                {
                    "body": "Exactly",
                    "author": "NoBagelNoBagel1",
                    "id": "iml3kbz",
                    "parent_id": "t1_imkxlsv",
                    "score": 4,
                    "created_utc": 1661986051.0,
                    "replies": []
                },
                {
                    "body": "Lol what 💩",
                    "author": "thesuitelife2010",
                    "id": "imlrhbq",
                    "parent_id": "t1_imkxlsv",
                    "score": -4,
                    "created_utc": 1661996512.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "settled once and for all\n\nuntil tomorrow",
            "author": "mraspencer",
            "id": "iml6ygc",
            "parent_id": "t3_x2p9q6",
            "score": 39,
            "created_utc": 1661987531.0,
            "replies": [
                {
                    "body": "Until tomorrow 😂",
                    "author": "CatLadyAmy1",
                    "id": "iml7i43",
                    "parent_id": "t1_iml6ygc",
                    "score": 18,
                    "created_utc": 1661987775.0,
                    "replies": [
                        {
                            "body": "This genuinely made me snicker out loud",
                            "author": "britdidntgetthejoke",
                            "id": "imn96s7",
                            "parent_id": "t1_iml7i43",
                            "score": 4,
                            "created_utc": 1662031340.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "This.  Don't let anyone dismiss your concerns or gaslight you into thinking that the relationship is anything other than SR. Any SD unwilling to discuss at the start will just lead to more headaches later.",
            "author": "Slow-Chemistry-9188",
            "id": "imksx3m",
            "parent_id": "t3_x2p9q6",
            "score": 23,
            "created_utc": 1661981651.0,
            "replies": [
                {
                    "body": "I take issue with the words “the relationship is anything but an SR” - perhaps that’s true for YOU…not everyone.\n\nAt a minimum the two people should have an expectation that financial assistance is part of the relationship.",
                    "author": "Pitkin_SD",
                    "id": "imlb8kz",
                    "parent_id": "t1_imksx3m",
                    "score": 4,
                    "created_utc": 1661989417.0,
                    "replies": [
                        {
                            "body": "That was my point. It's an SR. Financial assistance is a given.  Don't let them try to pretend it's a relationship or they'll help you in the future",
                            "author": "Slow-Chemistry-9188",
                            "id": "imld6pr",
                            "parent_id": "t1_imlb8kz",
                            "score": 3,
                            "created_utc": 1661990283.0,
                            "replies": [
                                {
                                    "body": "Not a relationship for YOU.  [Can be more than just a transaction for others.](https://www.reddit.com/r/sugarlifestyleforum/comments/x1t9h3/seeing_a_former_sb_become_a_very_successful_woman/)",
                                    "author": "Pitkin_SD",
                                    "id": "imlhiny",
                                    "parent_id": "t1_imld6pr",
                                    "score": 1,
                                    "created_utc": 1661992190.0,
                                    "replies": [
                                        {
                                            "body": "It is possible to develop bonds with people where the actual basis for being in the relationship is still transactional.  I know many who develop strong relationships with therapists or tutors or trainers.",
                                            "author": null,
                                            "id": "imocfrh",
                                            "parent_id": "t1_imlhiny",
                                            "score": 2,
                                            "created_utc": 1662048648.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Sounds great, I’d only add one thing: fake allowance offers from online scammers should not be counted as part of your ‘in previous arrangements’ pitch. If you got it, great. If it was dangled in front of you but never happened, put that out of your mind.",
            "author": "timrid",
            "id": "imkvkmd",
            "parent_id": "t3_x2p9q6",
            "score": 24,
            "created_utc": 1661982707.0,
            "replies": [
                {
                    "body": "Agreed.",
                    "author": "CatLadyAmy1",
                    "id": "imkwsie",
                    "parent_id": "t1_imkvkmd",
                    "score": 3,
                    "created_utc": 1661983201.0,
                    "replies": []
                },
                {
                    "body": "Nor anything less than a month of weekly meet ups. Its easy for any guy to afford a one off even at high ppm.\n\nSugar babies aren't escorts for a reason, its super low volume on purpose.",
                    "author": "NotARussianBot1984",
                    "id": "imndcs8",
                    "parent_id": "t1_imkvkmd",
                    "score": 2,
                    "created_utc": 1662033680.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Incoming: the salty sardines claiming that all \"past allowance\" figures (that exceed their lowball offers) are fake. All your previous SDs who moved, or ended it, or had the audacity to exist are also figments of your delusional fantasy 🙃 \n\nAgreed: know what you want, ask for it, and don't be afraid to walk away. Why settle? Goes both ways.",
            "author": "JemimaQuackers",
            "id": "iml1790",
            "parent_id": "t3_x2p9q6",
            "score": 17,
            "created_utc": 1661985036.0,
            "replies": [
                {
                    "body": "SBs actually have the be ones to settle in the sugar world because there's very few legitimate SDs out there\n\nthink about it, hot women know this situation fairly well. if you're hot and have all the value, what are you going to do? you're going to screen out 95% of the guys and narrow it down to 2-3 select few guys that are your ideal\n\nsame thing happens in the sugar world. guy narrows it down to a select few girls. if he doesn't end up getting any of those girls? cool, he just stays single. because paying the type of allowance he's offering to a girl that is NOT his ideal is... just not worth it",
                    "author": "inside_andout",
                    "id": "imohk3v",
                    "parent_id": "t1_iml1790",
                    "score": 4,
                    "created_utc": 1662050602.0,
                    "replies": []
                },
                {
                    "body": "The problem is that the whole “previous SD” logic is grossly misused. In the end who the heck cares what you got. From what we see that guy, if he was even real has moved on.",
                    "author": null,
                    "id": "imlaz13",
                    "parent_id": "t1_iml1790",
                    "score": 3,
                    "created_utc": 1661989300.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "“Looking for a genuine connection where we go to dinner,---etc\" \n\nExcellent way to present this to a Pot! We should have this as a wiki to give new SBs the wording to discuss with a Pot SD. Girls too often say \"I don't want to scare off this Pot--\" They need to understand that they aren't losing anything because many of these would be \"SDs\" are not at all,so they should want to lose them asap.",
            "author": "GSSD",
            "id": "imnftak",
            "parent_id": "t3_x2p9q6",
            "score": 6,
            "created_utc": 1662034951.0,
            "replies": []
        },
        {
            "body": "Agree with this. A good sd would just take the initiative and be clear about everything from the get go even before first date but sb should be clear about whats shes looking for as well. Here in LA the going ppm was about $XXX for 9s and 10s. My previous sugargf requested twice that much and I didnt hesitate. She confirmed that twice before our initial meet was one of the best relationship I had despite it being the higher end allowance. We saw each other at least twice a week for the past year getting her to mid XX,XXX monthly and I was continulously looking for additional ways to make her happy with flowers, alo yoga, lingerie and lululemon giftcards along with upgrading her flights whenever she had to go back to visit family. came to an end cause WFH is no more. mfferrs",
            "author": "socalspoiler",
            "id": "iml7fxq",
            "parent_id": "t3_x2p9q6",
            "score": 8,
            "created_utc": 1661987748.0,
            "replies": [
                {
                    "body": "You sound amazing. I’ve yet to talk to any men around LA who are clear with what they want and aren’t cheap😭  I can say what I expect and then I ask them and they say something so vague as “have fun and enjoy each other’s company” dismissing me brining up the financial assistance part",
                    "author": "erykahbabeeyyy",
                    "id": "imlube4",
                    "parent_id": "t1_iml7fxq",
                    "score": 5,
                    "created_utc": 1661997767.0,
                    "replies": []
                },
                {
                    "body": "Another example of where the bar should be set. You are the kind of classy, genuine SD that we all hope to find! I’m super new to this world. Thank you for assuring me that there are real men out there, and not to settle until I find one like you. 💕",
                    "author": "Pryncess913",
                    "id": "imoa4lw",
                    "parent_id": "t1_iml7fxq",
                    "score": 2,
                    "created_utc": 1662047757.0,
                    "replies": []
                },
                {
                    "body": "Awww love this",
                    "author": "CatLadyAmy1",
                    "id": "iml7k8o",
                    "parent_id": "t1_iml7fxq",
                    "score": 1,
                    "created_utc": 1661987801.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I don't disagree at all with an SB taking a strong position with regard to the allowance; in fact it's something that I really support.  However, I think many SB's leave a lot on the table by choosing the wrong SD's,  not differentiating their \"brand\" of sugar, by not managing the relationship from the start and, of course, making sure the little head gets a vote in the matter. \n\nThe brief M&G provides the opportunity for the SB both determine if she is interested and if the answer is yes to use her charm to add value.  It's changing what she brings to the table from a commodity to a very special opportunity.  At this point or in a followup conversation it's time to finalize the expectations/allowance discussion.",
            "author": "pinotandsugar",
            "id": "imm8i7d",
            "parent_id": "t3_x2p9q6",
            "score": 3,
            "created_utc": 1662004749.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "imkw5gj",
            "parent_id": "t3_x2p9q6",
            "score": 3,
            "created_utc": 1661982942.0,
            "replies": [
                {
                    "body": "They can take me out to an $$$$ upscale steak and crab dinner all they want.",
                    "author": "CatLadyAmy1",
                    "id": "imkwy99",
                    "parent_id": "t1_imkw5gj",
                    "score": 8,
                    "created_utc": 1661983264.0,
                    "replies": [
                        {
                            "body": "IKR?  Previous poster doesn't seem to get it and expects to just do the deed.  \"Hanging Out\" is DEFINITELY part of sugaring!  \n\n\nThe POT wants to know if they are going to enjoy the relationship; will it be a net benefit, a mere transactional outlet, or simply drama?  They have a stable world and loves ones they don't need an SB or over-zealous LE upending.  \n\n\nThat said, I always start a M&G explaining what they can expect from it.  Specifically, I'll explain how I handle arrangements, that I'll leave the restaurant later for their safety, and that I'll text them after and tell them that I had a good time and make an offer if I'm interested so there's no pressure on them in the moment.  \n\n\nI'm never committing any of that to paper/digital form prior to a M&G and sorting out the crazies first.  So, if those vetting meeting requests are being deleted because... reasons (?)... bullet dodged for me!",
                            "author": "IoTGiant",
                            "id": "immmxey",
                            "parent_id": "t1_imkwy99",
                            "score": 3,
                            "created_utc": 1662014209.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": ">they want someone to hang out with.\n\nThis sugaring thing may not be for you...",
                    "author": null,
                    "id": "imoclxu",
                    "parent_id": "t1_imkw5gj",
                    "score": 1,
                    "created_utc": 1662048715.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "All right messages except it’s best to get it all clarified during initial text. Genuine SDs will bring it up. \n\nThen the big one. The “previous” stuff that almost never goes well.\n\n“My allowances that I’ve had in the past usually range from x to x”\n\nSeriously do you have proof? What type of guy was he, young & handsome or fat and fugly? How many times did you meet? Was this a one time drive by or long term? Was it exclusive? \n\nToo many gaping holes in bringing up the mythical previous SD character to ask for an allowance.",
            "author": null,
            "id": "imla3dz",
            "parent_id": "t3_x2p9q6",
            "score": 0,
            "created_utc": 1661988911.0,
            "replies": [
                {
                    "body": "I only give a range because some might not be willing to pay the higher, so the lower end of the spectrum fits them and it's more agreeable. As opposed to, I want X amount and getting shot down because it was too high. You mitigate the risk of a flat NOPE to yeah, actually that works.",
                    "author": "CatLadyAmy1",
                    "id": "imlg4h9",
                    "parent_id": "t1_imla3dz",
                    "score": 3,
                    "created_utc": 1661991577.0,
                    "replies": [
                        {
                            "body": "OP how would you get this same point across if you haven't had any previous allowances - like how would you phrase it for a SB just starting out with no SR experiences in the past?",
                            "author": "Left-Action-3442",
                            "id": "imm0tvg",
                            "parent_id": "t1_imlg4h9",
                            "score": 1,
                            "created_utc": 1662000783.0,
                            "replies": [
                                {
                                    "body": "Go to the allowance thread on SLF and figure out what’s an acceptable price range for the area you’re in",
                                    "author": "CatLadyAmy1",
                                    "id": "imm1v5n",
                                    "parent_id": "t1_imm0tvg",
                                    "score": 2,
                                    "created_utc": 1662001289.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Lord’s work",
            "author": null,
            "id": "imkzeng",
            "parent_id": "t3_x2p9q6",
            "score": 1,
            "created_utc": 1661984282.0,
            "replies": []
        },
        {
            "body": "Except Seeking isn’t about arrangements anymore. It used to be, but it’s now just a different dating site.",
            "author": "3hrs2thebeach",
            "id": "imltkbr",
            "parent_id": "t3_x2p9q6",
            "score": -1,
            "created_utc": 1661997434.0,
            "replies": [
                {
                    "body": "It is, but if the mass majority of SBs changed how they did things.. and not accept ppm anymore it would be back. The shifty thing is, TikTok SBs got in for views, scammers, backpage etc",
                    "author": "CatLadyAmy1",
                    "id": "imm2cp7",
                    "parent_id": "t1_imltkbr",
                    "score": 1,
                    "created_utc": 1662001532.0,
                    "replies": [
                        {
                            "body": "PPM has always been a part of SA even before TikTok and before the owner decided to change the direction of the site towards a more vanilla tone.",
                            "author": "3hrs2thebeach",
                            "id": "imm30rt",
                            "parent_id": "t1_imm2cp7",
                            "score": 1,
                            "created_utc": 1662001864.0,
                            "replies": [
                                {
                                    "body": "I never had ppm offered up until the last couple of years",
                                    "author": "CatLadyAmy1",
                                    "id": "imm34dn",
                                    "parent_id": "t1_imm30rt",
                                    "score": 2,
                                    "created_utc": 1662001915.0,
                                    "replies": [
                                        {
                                            "body": "Sugar Vet of nearly 20 years.  It really has changed these last few years... and now everyone expects to be an online SB (pfft).  \n\n\nI famously used to tell candidates, \"I really don't trust anyone who wants less than (x) per month; I feel they aren't invested enough in this arrangement or in me.\"  Usually breaks the ice because they feel more comfortable making their ask since I've given a minimum that \\*I\\* will consider.  \n\n\nPPM basically just says that we're going to (or can) use each this one time.  That's not an \"arrangement\" in my book.  There are apps for that!",
                                            "author": "IoTGiant",
                                            "id": "immndmc",
                                            "parent_id": "t1_imm34dn",
                                            "score": 4,
                                            "created_utc": 1662014557.0,
                                            "replies": [
                                                {
                                                    "body": "I’m new here but this thread is really giving me hope, that I’ll be able to find a real, decent, classy SD. I guess I’ll just have to be patient & weed through a lot of weeds to find a rose, lol!! Thank you!!! 😊",
                                                    "author": "Pryncess913",
                                                    "id": "imoaliu",
                                                    "parent_id": "t1_immndmc",
                                                    "score": 2,
                                                    "created_utc": 1662047939.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "> PPM has always been\n\nAbsolutely PPM is the gold standard, at least to begin a relationship. The unfortunate thing about PPM is that it enables the existence of fakes and scammers. No fake is going to prepay a months worth of allowance. But the other reality is the fake SBs take advantage as well,so guys have to protect themselves as well.",
                                    "author": "GSSD",
                                    "id": "imngxud",
                                    "parent_id": "t1_imm30rt",
                                    "score": 2,
                                    "created_utc": 1662035520.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Hold up. Have you been in the bowl 6 years?!",
            "author": null,
            "id": "imlz279",
            "parent_id": "t3_x2p9q6",
            "score": 0,
            "created_utc": 1661999941.0,
            "replies": [
                {
                    "body": "I have. Got in at 23 and I’ll be 29 soon",
                    "author": "CatLadyAmy1",
                    "id": "imm22yb",
                    "parent_id": "t1_imlz279",
                    "score": 1,
                    "created_utc": 1662001398.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I don't like to discuss financial details. If you want to fine but please be prepared to articulate what your expectations are and what you bring to the table. Don't expect me to throw a number your way. Before we've become intimate I have no idea if we have sexual chemistry or if we'll get along. Of course I want to have sex with you. That doesn't mean much though. I also want to have dinner tonight. Am I eating at Mc Donald's or Morton's? You need to sell me or I'll move along.",
            "author": "GordonGuapo",
            "id": "iml538m",
            "parent_id": "t3_x2p9q6",
            "score": -9,
            "created_utc": 1661986711.0,
            "replies": [
                {
                    "body": "Do not bother writing as SD if you come up with the \"what you bring to the table\". Do you even have the table?!",
                    "author": "idontlikespiderplant",
                    "id": "imlez2a",
                    "parent_id": "t1_iml538m",
                    "score": 10,
                    "created_utc": 1661991071.0,
                    "replies": [
                        {
                            "body": "Seriously. It's just as bad as, \"I'm not bald, fat and ugly. . .I don't have to do this\" Then go back on Tinder or Hinge and have sex for free",
                            "author": "CatLadyAmy1",
                            "id": "imlgsgs",
                            "parent_id": "t1_imlez2a",
                            "score": 11,
                            "created_utc": 1661991869.0,
                            "replies": [
                                {
                                    "body": "Exactly. It is cringe for men and women too. When women are trying to pretend they are something they are not, trying to force how you should treat them verbally instead of by action. What is the point of talking how you are the princess and demand the best treatment while accepting shitty behaviour but sweet talk.",
                                    "author": "idontlikespiderplant",
                                    "id": "imokuw4",
                                    "parent_id": "t1_imlgsgs",
                                    "score": 2,
                                    "created_utc": 1662051865.0,
                                    "replies": []
                                },
                                {
                                    "body": "Hey, I'm not bald...",
                                    "author": "GordonGuapo",
                                    "id": "imm00xy",
                                    "parent_id": "t1_imlgsgs",
                                    "score": 0,
                                    "created_utc": 1662000400.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "Try not to get hung up on the verbiage. I have plenty of tables. Which one I'm gonna eat at is my challenge. If you know your worth, speak up. Then I can decide if we're going to eat together. Just don't expect fine dining if all you have to give is a happy meal toy.",
                            "author": "GordonGuapo",
                            "id": "imlzzei",
                            "parent_id": "t1_imlez2a",
                            "score": -2,
                            "created_utc": 1662000380.0,
                            "replies": [
                                {
                                    "body": "What you bring to the table is as cringe as if a woman start her rant how she is high quality, likes only the best, is the best and that she is queen, princess or whatever. If whoever ask me what I bring to the table, I know he do not have a table I would be even interested to sit by. If you know your worth, you will remove yourself from company of people that do not try to find or see your value. It is like with diamonds. Most of people will not be able to see whether you are one, so should you try to prove yourself or go to the one that can see that.",
                                    "author": "idontlikespiderplant",
                                    "id": "imoke9z",
                                    "parent_id": "t1_imlzzei",
                                    "score": 1,
                                    "created_utc": 1662051685.0,
                                    "replies": [
                                        {
                                            "body": "\"What you bring to the table\" is no different than \"I know my worth\". Definitely cringe worthy. The point is that if you want to talk about money, you better articulate why you want and deserve X amount.",
                                            "author": "GordonGuapo",
                                            "id": "imqcgmf",
                                            "parent_id": "t1_imoke9z",
                                            "score": 1,
                                            "created_utc": 1662077157.0,
                                            "replies": [
                                                {
                                                    "body": "Agree on the cringe part. But the same cringe is to you thinking SBs needs to articulate why they are worth the money. You guys are primitive, you either like what you see and hear or you dont. I set my money based on my goals. So if you like what you see and want me to entertain you you will pay what I want. If you dont you will not agree or will settle if the money is good which will leas to you still searching for better option. Which is not good for my game. You either have the looks and presentation or you dont, and no articulation will change that ✌🏼.",
                                                    "author": "idontlikespiderplant",
                                                    "id": "imyw9cz",
                                                    "parent_id": "t1_imqcgmf",
                                                    "score": 1,
                                                    "created_utc": 1662236246.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "That’s the beauty of how you formulate it but I’m certainly not engaging in any sexual relationship without some kind of an allowance in place.",
                    "author": "CatLadyAmy1",
                    "id": "iml7g1w",
                    "parent_id": "t1_iml538m",
                    "score": 6,
                    "created_utc": 1661987749.0,
                    "replies": [
                        {
                            "body": "That's  fine. Name your price. We either proceed or I next you. Simple concept. Except it's a slippery slope for you. You don't want to sell yourself short nor do you want to ask too much and scare a POT away.",
                            "author": "GordonGuapo",
                            "id": "imm0z6v",
                            "parent_id": "t1_iml7g1w",
                            "score": -4,
                            "created_utc": 1662000855.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "🤮",
                    "author": null,
                    "id": "imlzob5",
                    "parent_id": "t1_iml538m",
                    "score": 5,
                    "created_utc": 1662000230.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Yeah but what if I'm not that old, good looking, fit, and rich ? Maybe the girl will just want to date me for real, like an age gap relationship, because she's genuinely attracted to me.",
            "author": "sugardad123",
            "id": "imle738",
            "parent_id": "t3_x2p9q6",
            "score": -10,
            "created_utc": 1661990728.0,
            "replies": [
                {
                    "body": "I didn't go on SA to find a vanilla boyfriend. I've dated your type from the site before, it was awful.",
                    "author": "CatLadyAmy1",
                    "id": "imlfavr",
                    "parent_id": "t1_imle738",
                    "score": 6,
                    "created_utc": 1661991215.0,
                    "replies": [
                        {
                            "body": "I didn't say it was me, I was playing devil's advocate.\n\nSome girls go on SA to find vanilla. Didn't you heard it's dating up now :)",
                            "author": "sugardad123",
                            "id": "imlgjys",
                            "parent_id": "t1_imlfavr",
                            "score": -3,
                            "created_utc": 1661991766.0,
                            "replies": [
                                {
                                    "body": "Even though IRONICALLY more scammers, hourly girls and picture sellers came on the site instead of this \"up dating\" Brandon Wade advocates so much",
                                    "author": "CatLadyAmy1",
                                    "id": "imlh0g2",
                                    "parent_id": "t1_imlgjys",
                                    "score": 2,
                                    "created_utc": 1661991967.0,
                                    "replies": [
                                        {
                                            "body": "You should try as a SD to filter through that, it's not fun either. Why would I look for an escort or platonic girl on SA, these people are deluded.",
                                            "author": "sugardad123",
                                            "id": "imlhiwp",
                                            "parent_id": "t1_imlh0g2",
                                            "score": 1,
                                            "created_utc": 1661992193.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Be blunt- straight forward",
            "author": "HollywoodStarlight",
            "id": "immagh6",
            "parent_id": "t3_x2p9q6",
            "score": 1,
            "created_utc": 1662005864.0,
            "replies": []
        },
        {
            "body": "Thank you!",
            "author": "saltyb1tch",
            "id": "ipmfht4",
            "parent_id": "t3_x2p9q6",
            "score": 1,
            "created_utc": 1663956328.0,
            "replies": []
        },
        {
            "body": "You are a real SD and do what all real SDs do. The number might change but the intent and presentation is the same. \n\nBut sadly most \"SDs\" don't appear to be that at all. So the young girls need to be educated as to the proper way to handle the slick,older ,and vastly more experienced predators.",
            "author": "GSSD",
            "id": "imng84d",
            "parent_id": "t1_imm75lt",
            "score": 15,
            "created_utc": 1662035159.0,
            "replies": []
        },
        {
            "body": "Wow…..I’m completely new to this world but you just showed me the kind of man I should be looking for. That is the classiest, hottest response I’ve ever read. Thank you for giving me hope that there are more SD’s out there like you & not to settle for less. ❤️",
            "author": "Pryncess913",
            "id": "imo9hno",
            "parent_id": "t1_imm75lt",
            "score": 8,
            "created_utc": 1662047517.0,
            "replies": [
                {
                    "body": "You’re welcome! Good luck with your search",
                    "author": null,
                    "id": "imrtfw7",
                    "parent_id": "t1_imo9hno",
                    "score": 3,
                    "created_utc": 1662107603.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I think honestly this works and makes alot of sense. Well said.",
            "author": "Brownsugatoez",
            "id": "imn1eei",
            "parent_id": "t1_imm75lt",
            "score": 3,
            "created_utc": 1662026046.0,
            "replies": [
                {
                    "body": "Thanks. Works for me! I suppose that’s all that matters as far as I’m concerned 😀",
                    "author": null,
                    "id": "imn231w",
                    "parent_id": "t1_imn1eei",
                    "score": 2,
                    "created_utc": 1662026563.0,
                    "replies": [
                        {
                            "body": "Exactly! What works for you works for you. It’s really not Rocket science. I think some people really overcomplicate the topic by overthinking. But thank you for being one to bring ease to it when it comes up 😉",
                            "author": "Brownsugatoez",
                            "id": "imn2hx8",
                            "parent_id": "t1_imn231w",
                            "score": 4,
                            "created_utc": 1662026868.0,
                            "replies": [
                                {
                                    "body": "It’s literally my pleasure 🤣",
                                    "author": null,
                                    "id": "imn2qfx",
                                    "parent_id": "t1_imn2hx8",
                                    "score": 1,
                                    "created_utc": 1662027048.0,
                                    "replies": [
                                        {
                                            "body": "🤣🤣🤣",
                                            "author": "Brownsugatoez",
                                            "id": "imn2scm",
                                            "parent_id": "t1_imn2qfx",
                                            "score": 1,
                                            "created_utc": 1662027087.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "💯",
            "author": "CatLadyAmy1",
            "id": "iml2xzh",
            "parent_id": "t1_imkxlsv",
            "score": 6,
            "created_utc": 1661985782.0,
            "replies": []
        },
        {
            "body": "Exactly",
            "author": "NoBagelNoBagel1",
            "id": "iml3kbz",
            "parent_id": "t1_imkxlsv",
            "score": 4,
            "created_utc": 1661986051.0,
            "replies": []
        },
        {
            "body": "Lol what 💩",
            "author": "thesuitelife2010",
            "id": "imlrhbq",
            "parent_id": "t1_imkxlsv",
            "score": -4,
            "created_utc": 1661996512.0,
            "replies": []
        },
        {
            "body": "Until tomorrow 😂",
            "author": "CatLadyAmy1",
            "id": "iml7i43",
            "parent_id": "t1_iml6ygc",
            "score": 18,
            "created_utc": 1661987775.0,
            "replies": [
                {
                    "body": "This genuinely made me snicker out loud",
                    "author": "britdidntgetthejoke",
                    "id": "imn96s7",
                    "parent_id": "t1_iml7i43",
                    "score": 4,
                    "created_utc": 1662031340.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I take issue with the words “the relationship is anything but an SR” - perhaps that’s true for YOU…not everyone.\n\nAt a minimum the two people should have an expectation that financial assistance is part of the relationship.",
            "author": "Pitkin_SD",
            "id": "imlb8kz",
            "parent_id": "t1_imksx3m",
            "score": 4,
            "created_utc": 1661989417.0,
            "replies": [
                {
                    "body": "That was my point. It's an SR. Financial assistance is a given.  Don't let them try to pretend it's a relationship or they'll help you in the future",
                    "author": "Slow-Chemistry-9188",
                    "id": "imld6pr",
                    "parent_id": "t1_imlb8kz",
                    "score": 3,
                    "created_utc": 1661990283.0,
                    "replies": [
                        {
                            "body": "Not a relationship for YOU.  [Can be more than just a transaction for others.](https://www.reddit.com/r/sugarlifestyleforum/comments/x1t9h3/seeing_a_former_sb_become_a_very_successful_woman/)",
                            "author": "Pitkin_SD",
                            "id": "imlhiny",
                            "parent_id": "t1_imld6pr",
                            "score": 1,
                            "created_utc": 1661992190.0,
                            "replies": [
                                {
                                    "body": "It is possible to develop bonds with people where the actual basis for being in the relationship is still transactional.  I know many who develop strong relationships with therapists or tutors or trainers.",
                                    "author": null,
                                    "id": "imocfrh",
                                    "parent_id": "t1_imlhiny",
                                    "score": 2,
                                    "created_utc": 1662048648.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Agreed.",
            "author": "CatLadyAmy1",
            "id": "imkwsie",
            "parent_id": "t1_imkvkmd",
            "score": 3,
            "created_utc": 1661983201.0,
            "replies": []
        },
        {
            "body": "Nor anything less than a month of weekly meet ups. Its easy for any guy to afford a one off even at high ppm.\n\nSugar babies aren't escorts for a reason, its super low volume on purpose.",
            "author": "NotARussianBot1984",
            "id": "imndcs8",
            "parent_id": "t1_imkvkmd",
            "score": 2,
            "created_utc": 1662033680.0,
            "replies": []
        },
        {
            "body": "SBs actually have the be ones to settle in the sugar world because there's very few legitimate SDs out there\n\nthink about it, hot women know this situation fairly well. if you're hot and have all the value, what are you going to do? you're going to screen out 95% of the guys and narrow it down to 2-3 select few guys that are your ideal\n\nsame thing happens in the sugar world. guy narrows it down to a select few girls. if he doesn't end up getting any of those girls? cool, he just stays single. because paying the type of allowance he's offering to a girl that is NOT his ideal is... just not worth it",
            "author": "inside_andout",
            "id": "imohk3v",
            "parent_id": "t1_iml1790",
            "score": 4,
            "created_utc": 1662050602.0,
            "replies": []
        },
        {
            "body": "The problem is that the whole “previous SD” logic is grossly misused. In the end who the heck cares what you got. From what we see that guy, if he was even real has moved on.",
            "author": null,
            "id": "imlaz13",
            "parent_id": "t1_iml1790",
            "score": 3,
            "created_utc": 1661989300.0,
            "replies": []
        },
        {
            "body": "You sound amazing. I’ve yet to talk to any men around LA who are clear with what they want and aren’t cheap😭  I can say what I expect and then I ask them and they say something so vague as “have fun and enjoy each other’s company” dismissing me brining up the financial assistance part",
            "author": "erykahbabeeyyy",
            "id": "imlube4",
            "parent_id": "t1_iml7fxq",
            "score": 5,
            "created_utc": 1661997767.0,
            "replies": []
        },
        {
            "body": "Another example of where the bar should be set. You are the kind of classy, genuine SD that we all hope to find! I’m super new to this world. Thank you for assuring me that there are real men out there, and not to settle until I find one like you. 💕",
            "author": "Pryncess913",
            "id": "imoa4lw",
            "parent_id": "t1_iml7fxq",
            "score": 2,
            "created_utc": 1662047757.0,
            "replies": []
        },
        {
            "body": "Awww love this",
            "author": "CatLadyAmy1",
            "id": "iml7k8o",
            "parent_id": "t1_iml7fxq",
            "score": 1,
            "created_utc": 1661987801.0,
            "replies": []
        },
        {
            "body": "They can take me out to an $$$$ upscale steak and crab dinner all they want.",
            "author": "CatLadyAmy1",
            "id": "imkwy99",
            "parent_id": "t1_imkw5gj",
            "score": 8,
            "created_utc": 1661983264.0,
            "replies": [
                {
                    "body": "IKR?  Previous poster doesn't seem to get it and expects to just do the deed.  \"Hanging Out\" is DEFINITELY part of sugaring!  \n\n\nThe POT wants to know if they are going to enjoy the relationship; will it be a net benefit, a mere transactional outlet, or simply drama?  They have a stable world and loves ones they don't need an SB or over-zealous LE upending.  \n\n\nThat said, I always start a M&G explaining what they can expect from it.  Specifically, I'll explain how I handle arrangements, that I'll leave the restaurant later for their safety, and that I'll text them after and tell them that I had a good time and make an offer if I'm interested so there's no pressure on them in the moment.  \n\n\nI'm never committing any of that to paper/digital form prior to a M&G and sorting out the crazies first.  So, if those vetting meeting requests are being deleted because... reasons (?)... bullet dodged for me!",
                    "author": "IoTGiant",
                    "id": "immmxey",
                    "parent_id": "t1_imkwy99",
                    "score": 3,
                    "created_utc": 1662014209.0,
                    "replies": []
                }
            ]
        },
        {
            "body": ">they want someone to hang out with.\n\nThis sugaring thing may not be for you...",
            "author": null,
            "id": "imoclxu",
            "parent_id": "t1_imkw5gj",
            "score": 1,
            "created_utc": 1662048715.0,
            "replies": []
        },
        {
            "body": "I only give a range because some might not be willing to pay the higher, so the lower end of the spectrum fits them and it's more agreeable. As opposed to, I want X amount and getting shot down because it was too high. You mitigate the risk of a flat NOPE to yeah, actually that works.",
            "author": "CatLadyAmy1",
            "id": "imlg4h9",
            "parent_id": "t1_imla3dz",
            "score": 3,
            "created_utc": 1661991577.0,
            "replies": [
                {
                    "body": "OP how would you get this same point across if you haven't had any previous allowances - like how would you phrase it for a SB just starting out with no SR experiences in the past?",
                    "author": "Left-Action-3442",
                    "id": "imm0tvg",
                    "parent_id": "t1_imlg4h9",
                    "score": 1,
                    "created_utc": 1662000783.0,
                    "replies": [
                        {
                            "body": "Go to the allowance thread on SLF and figure out what’s an acceptable price range for the area you’re in",
                            "author": "CatLadyAmy1",
                            "id": "imm1v5n",
                            "parent_id": "t1_imm0tvg",
                            "score": 2,
                            "created_utc": 1662001289.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "It is, but if the mass majority of SBs changed how they did things.. and not accept ppm anymore it would be back. The shifty thing is, TikTok SBs got in for views, scammers, backpage etc",
            "author": "CatLadyAmy1",
            "id": "imm2cp7",
            "parent_id": "t1_imltkbr",
            "score": 1,
            "created_utc": 1662001532.0,
            "replies": [
                {
                    "body": "PPM has always been a part of SA even before TikTok and before the owner decided to change the direction of the site towards a more vanilla tone.",
                    "author": "3hrs2thebeach",
                    "id": "imm30rt",
                    "parent_id": "t1_imm2cp7",
                    "score": 1,
                    "created_utc": 1662001864.0,
                    "replies": [
                        {
                            "body": "I never had ppm offered up until the last couple of years",
                            "author": "CatLadyAmy1",
                            "id": "imm34dn",
                            "parent_id": "t1_imm30rt",
                            "score": 2,
                            "created_utc": 1662001915.0,
                            "replies": [
                                {
                                    "body": "Sugar Vet of nearly 20 years.  It really has changed these last few years... and now everyone expects to be an online SB (pfft).  \n\n\nI famously used to tell candidates, \"I really don't trust anyone who wants less than (x) per month; I feel they aren't invested enough in this arrangement or in me.\"  Usually breaks the ice because they feel more comfortable making their ask since I've given a minimum that \\*I\\* will consider.  \n\n\nPPM basically just says that we're going to (or can) use each this one time.  That's not an \"arrangement\" in my book.  There are apps for that!",
                                    "author": "IoTGiant",
                                    "id": "immndmc",
                                    "parent_id": "t1_imm34dn",
                                    "score": 4,
                                    "created_utc": 1662014557.0,
                                    "replies": [
                                        {
                                            "body": "I’m new here but this thread is really giving me hope, that I’ll be able to find a real, decent, classy SD. I guess I’ll just have to be patient & weed through a lot of weeds to find a rose, lol!! Thank you!!! 😊",
                                            "author": "Pryncess913",
                                            "id": "imoaliu",
                                            "parent_id": "t1_immndmc",
                                            "score": 2,
                                            "created_utc": 1662047939.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "> PPM has always been\n\nAbsolutely PPM is the gold standard, at least to begin a relationship. The unfortunate thing about PPM is that it enables the existence of fakes and scammers. No fake is going to prepay a months worth of allowance. But the other reality is the fake SBs take advantage as well,so guys have to protect themselves as well.",
                            "author": "GSSD",
                            "id": "imngxud",
                            "parent_id": "t1_imm30rt",
                            "score": 2,
                            "created_utc": 1662035520.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I have. Got in at 23 and I’ll be 29 soon",
            "author": "CatLadyAmy1",
            "id": "imm22yb",
            "parent_id": "t1_imlz279",
            "score": 1,
            "created_utc": 1662001398.0,
            "replies": []
        },
        {
            "body": "Do not bother writing as SD if you come up with the \"what you bring to the table\". Do you even have the table?!",
            "author": "idontlikespiderplant",
            "id": "imlez2a",
            "parent_id": "t1_iml538m",
            "score": 10,
            "created_utc": 1661991071.0,
            "replies": [
                {
                    "body": "Seriously. It's just as bad as, \"I'm not bald, fat and ugly. . .I don't have to do this\" Then go back on Tinder or Hinge and have sex for free",
                    "author": "CatLadyAmy1",
                    "id": "imlgsgs",
                    "parent_id": "t1_imlez2a",
                    "score": 11,
                    "created_utc": 1661991869.0,
                    "replies": [
                        {
                            "body": "Exactly. It is cringe for men and women too. When women are trying to pretend they are something they are not, trying to force how you should treat them verbally instead of by action. What is the point of talking how you are the princess and demand the best treatment while accepting shitty behaviour but sweet talk.",
                            "author": "idontlikespiderplant",
                            "id": "imokuw4",
                            "parent_id": "t1_imlgsgs",
                            "score": 2,
                            "created_utc": 1662051865.0,
                            "replies": []
                        },
                        {
                            "body": "Hey, I'm not bald...",
                            "author": "GordonGuapo",
                            "id": "imm00xy",
                            "parent_id": "t1_imlgsgs",
                            "score": 0,
                            "created_utc": 1662000400.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Try not to get hung up on the verbiage. I have plenty of tables. Which one I'm gonna eat at is my challenge. If you know your worth, speak up. Then I can decide if we're going to eat together. Just don't expect fine dining if all you have to give is a happy meal toy.",
                    "author": "GordonGuapo",
                    "id": "imlzzei",
                    "parent_id": "t1_imlez2a",
                    "score": -2,
                    "created_utc": 1662000380.0,
                    "replies": [
                        {
                            "body": "What you bring to the table is as cringe as if a woman start her rant how she is high quality, likes only the best, is the best and that she is queen, princess or whatever. If whoever ask me what I bring to the table, I know he do not have a table I would be even interested to sit by. If you know your worth, you will remove yourself from company of people that do not try to find or see your value. It is like with diamonds. Most of people will not be able to see whether you are one, so should you try to prove yourself or go to the one that can see that.",
                            "author": "idontlikespiderplant",
                            "id": "imoke9z",
                            "parent_id": "t1_imlzzei",
                            "score": 1,
                            "created_utc": 1662051685.0,
                            "replies": [
                                {
                                    "body": "\"What you bring to the table\" is no different than \"I know my worth\". Definitely cringe worthy. The point is that if you want to talk about money, you better articulate why you want and deserve X amount.",
                                    "author": "GordonGuapo",
                                    "id": "imqcgmf",
                                    "parent_id": "t1_imoke9z",
                                    "score": 1,
                                    "created_utc": 1662077157.0,
                                    "replies": [
                                        {
                                            "body": "Agree on the cringe part. But the same cringe is to you thinking SBs needs to articulate why they are worth the money. You guys are primitive, you either like what you see and hear or you dont. I set my money based on my goals. So if you like what you see and want me to entertain you you will pay what I want. If you dont you will not agree or will settle if the money is good which will leas to you still searching for better option. Which is not good for my game. You either have the looks and presentation or you dont, and no articulation will change that ✌🏼.",
                                            "author": "idontlikespiderplant",
                                            "id": "imyw9cz",
                                            "parent_id": "t1_imqcgmf",
                                            "score": 1,
                                            "created_utc": 1662236246.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "That’s the beauty of how you formulate it but I’m certainly not engaging in any sexual relationship without some kind of an allowance in place.",
            "author": "CatLadyAmy1",
            "id": "iml7g1w",
            "parent_id": "t1_iml538m",
            "score": 6,
            "created_utc": 1661987749.0,
            "replies": [
                {
                    "body": "That's  fine. Name your price. We either proceed or I next you. Simple concept. Except it's a slippery slope for you. You don't want to sell yourself short nor do you want to ask too much and scare a POT away.",
                    "author": "GordonGuapo",
                    "id": "imm0z6v",
                    "parent_id": "t1_iml7g1w",
                    "score": -4,
                    "created_utc": 1662000855.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "🤮",
            "author": null,
            "id": "imlzob5",
            "parent_id": "t1_iml538m",
            "score": 5,
            "created_utc": 1662000230.0,
            "replies": []
        },
        {
            "body": "I didn't go on SA to find a vanilla boyfriend. I've dated your type from the site before, it was awful.",
            "author": "CatLadyAmy1",
            "id": "imlfavr",
            "parent_id": "t1_imle738",
            "score": 6,
            "created_utc": 1661991215.0,
            "replies": [
                {
                    "body": "I didn't say it was me, I was playing devil's advocate.\n\nSome girls go on SA to find vanilla. Didn't you heard it's dating up now :)",
                    "author": "sugardad123",
                    "id": "imlgjys",
                    "parent_id": "t1_imlfavr",
                    "score": -3,
                    "created_utc": 1661991766.0,
                    "replies": [
                        {
                            "body": "Even though IRONICALLY more scammers, hourly girls and picture sellers came on the site instead of this \"up dating\" Brandon Wade advocates so much",
                            "author": "CatLadyAmy1",
                            "id": "imlh0g2",
                            "parent_id": "t1_imlgjys",
                            "score": 2,
                            "created_utc": 1661991967.0,
                            "replies": [
                                {
                                    "body": "You should try as a SD to filter through that, it's not fun either. Why would I look for an escort or platonic girl on SA, these people are deluded.",
                                    "author": "sugardad123",
                                    "id": "imlhiwp",
                                    "parent_id": "t1_imlh0g2",
                                    "score": 1,
                                    "created_utc": 1661992193.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "You’re welcome! Good luck with your search",
            "author": null,
            "id": "imrtfw7",
            "parent_id": "t1_imo9hno",
            "score": 3,
            "created_utc": 1662107603.0,
            "replies": []
        },
        {
            "body": "Thanks. Works for me! I suppose that’s all that matters as far as I’m concerned 😀",
            "author": null,
            "id": "imn231w",
            "parent_id": "t1_imn1eei",
            "score": 2,
            "created_utc": 1662026563.0,
            "replies": [
                {
                    "body": "Exactly! What works for you works for you. It’s really not Rocket science. I think some people really overcomplicate the topic by overthinking. But thank you for being one to bring ease to it when it comes up 😉",
                    "author": "Brownsugatoez",
                    "id": "imn2hx8",
                    "parent_id": "t1_imn231w",
                    "score": 4,
                    "created_utc": 1662026868.0,
                    "replies": [
                        {
                            "body": "It’s literally my pleasure 🤣",
                            "author": null,
                            "id": "imn2qfx",
                            "parent_id": "t1_imn2hx8",
                            "score": 1,
                            "created_utc": 1662027048.0,
                            "replies": [
                                {
                                    "body": "🤣🤣🤣",
                                    "author": "Brownsugatoez",
                                    "id": "imn2scm",
                                    "parent_id": "t1_imn2qfx",
                                    "score": 1,
                                    "created_utc": 1662027087.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "This genuinely made me snicker out loud",
            "author": "britdidntgetthejoke",
            "id": "imn96s7",
            "parent_id": "t1_iml7i43",
            "score": 4,
            "created_utc": 1662031340.0,
            "replies": []
        },
        {
            "body": "That was my point. It's an SR. Financial assistance is a given.  Don't let them try to pretend it's a relationship or they'll help you in the future",
            "author": "Slow-Chemistry-9188",
            "id": "imld6pr",
            "parent_id": "t1_imlb8kz",
            "score": 3,
            "created_utc": 1661990283.0,
            "replies": [
                {
                    "body": "Not a relationship for YOU.  [Can be more than just a transaction for others.](https://www.reddit.com/r/sugarlifestyleforum/comments/x1t9h3/seeing_a_former_sb_become_a_very_successful_woman/)",
                    "author": "Pitkin_SD",
                    "id": "imlhiny",
                    "parent_id": "t1_imld6pr",
                    "score": 1,
                    "created_utc": 1661992190.0,
                    "replies": [
                        {
                            "body": "It is possible to develop bonds with people where the actual basis for being in the relationship is still transactional.  I know many who develop strong relationships with therapists or tutors or trainers.",
                            "author": null,
                            "id": "imocfrh",
                            "parent_id": "t1_imlhiny",
                            "score": 2,
                            "created_utc": 1662048648.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "IKR?  Previous poster doesn't seem to get it and expects to just do the deed.  \"Hanging Out\" is DEFINITELY part of sugaring!  \n\n\nThe POT wants to know if they are going to enjoy the relationship; will it be a net benefit, a mere transactional outlet, or simply drama?  They have a stable world and loves ones they don't need an SB or over-zealous LE upending.  \n\n\nThat said, I always start a M&G explaining what they can expect from it.  Specifically, I'll explain how I handle arrangements, that I'll leave the restaurant later for their safety, and that I'll text them after and tell them that I had a good time and make an offer if I'm interested so there's no pressure on them in the moment.  \n\n\nI'm never committing any of that to paper/digital form prior to a M&G and sorting out the crazies first.  So, if those vetting meeting requests are being deleted because... reasons (?)... bullet dodged for me!",
            "author": "IoTGiant",
            "id": "immmxey",
            "parent_id": "t1_imkwy99",
            "score": 3,
            "created_utc": 1662014209.0,
            "replies": []
        },
        {
            "body": "OP how would you get this same point across if you haven't had any previous allowances - like how would you phrase it for a SB just starting out with no SR experiences in the past?",
            "author": "Left-Action-3442",
            "id": "imm0tvg",
            "parent_id": "t1_imlg4h9",
            "score": 1,
            "created_utc": 1662000783.0,
            "replies": [
                {
                    "body": "Go to the allowance thread on SLF and figure out what’s an acceptable price range for the area you’re in",
                    "author": "CatLadyAmy1",
                    "id": "imm1v5n",
                    "parent_id": "t1_imm0tvg",
                    "score": 2,
                    "created_utc": 1662001289.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "PPM has always been a part of SA even before TikTok and before the owner decided to change the direction of the site towards a more vanilla tone.",
            "author": "3hrs2thebeach",
            "id": "imm30rt",
            "parent_id": "t1_imm2cp7",
            "score": 1,
            "created_utc": 1662001864.0,
            "replies": [
                {
                    "body": "I never had ppm offered up until the last couple of years",
                    "author": "CatLadyAmy1",
                    "id": "imm34dn",
                    "parent_id": "t1_imm30rt",
                    "score": 2,
                    "created_utc": 1662001915.0,
                    "replies": [
                        {
                            "body": "Sugar Vet of nearly 20 years.  It really has changed these last few years... and now everyone expects to be an online SB (pfft).  \n\n\nI famously used to tell candidates, \"I really don't trust anyone who wants less than (x) per month; I feel they aren't invested enough in this arrangement or in me.\"  Usually breaks the ice because they feel more comfortable making their ask since I've given a minimum that \\*I\\* will consider.  \n\n\nPPM basically just says that we're going to (or can) use each this one time.  That's not an \"arrangement\" in my book.  There are apps for that!",
                            "author": "IoTGiant",
                            "id": "immndmc",
                            "parent_id": "t1_imm34dn",
                            "score": 4,
                            "created_utc": 1662014557.0,
                            "replies": [
                                {
                                    "body": "I’m new here but this thread is really giving me hope, that I’ll be able to find a real, decent, classy SD. I guess I’ll just have to be patient & weed through a lot of weeds to find a rose, lol!! Thank you!!! 😊",
                                    "author": "Pryncess913",
                                    "id": "imoaliu",
                                    "parent_id": "t1_immndmc",
                                    "score": 2,
                                    "created_utc": 1662047939.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "> PPM has always been\n\nAbsolutely PPM is the gold standard, at least to begin a relationship. The unfortunate thing about PPM is that it enables the existence of fakes and scammers. No fake is going to prepay a months worth of allowance. But the other reality is the fake SBs take advantage as well,so guys have to protect themselves as well.",
                    "author": "GSSD",
                    "id": "imngxud",
                    "parent_id": "t1_imm30rt",
                    "score": 2,
                    "created_utc": 1662035520.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Seriously. It's just as bad as, \"I'm not bald, fat and ugly. . .I don't have to do this\" Then go back on Tinder or Hinge and have sex for free",
            "author": "CatLadyAmy1",
            "id": "imlgsgs",
            "parent_id": "t1_imlez2a",
            "score": 11,
            "created_utc": 1661991869.0,
            "replies": [
                {
                    "body": "Exactly. It is cringe for men and women too. When women are trying to pretend they are something they are not, trying to force how you should treat them verbally instead of by action. What is the point of talking how you are the princess and demand the best treatment while accepting shitty behaviour but sweet talk.",
                    "author": "idontlikespiderplant",
                    "id": "imokuw4",
                    "parent_id": "t1_imlgsgs",
                    "score": 2,
                    "created_utc": 1662051865.0,
                    "replies": []
                },
                {
                    "body": "Hey, I'm not bald...",
                    "author": "GordonGuapo",
                    "id": "imm00xy",
                    "parent_id": "t1_imlgsgs",
                    "score": 0,
                    "created_utc": 1662000400.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Try not to get hung up on the verbiage. I have plenty of tables. Which one I'm gonna eat at is my challenge. If you know your worth, speak up. Then I can decide if we're going to eat together. Just don't expect fine dining if all you have to give is a happy meal toy.",
            "author": "GordonGuapo",
            "id": "imlzzei",
            "parent_id": "t1_imlez2a",
            "score": -2,
            "created_utc": 1662000380.0,
            "replies": [
                {
                    "body": "What you bring to the table is as cringe as if a woman start her rant how she is high quality, likes only the best, is the best and that she is queen, princess or whatever. If whoever ask me what I bring to the table, I know he do not have a table I would be even interested to sit by. If you know your worth, you will remove yourself from company of people that do not try to find or see your value. It is like with diamonds. Most of people will not be able to see whether you are one, so should you try to prove yourself or go to the one that can see that.",
                    "author": "idontlikespiderplant",
                    "id": "imoke9z",
                    "parent_id": "t1_imlzzei",
                    "score": 1,
                    "created_utc": 1662051685.0,
                    "replies": [
                        {
                            "body": "\"What you bring to the table\" is no different than \"I know my worth\". Definitely cringe worthy. The point is that if you want to talk about money, you better articulate why you want and deserve X amount.",
                            "author": "GordonGuapo",
                            "id": "imqcgmf",
                            "parent_id": "t1_imoke9z",
                            "score": 1,
                            "created_utc": 1662077157.0,
                            "replies": [
                                {
                                    "body": "Agree on the cringe part. But the same cringe is to you thinking SBs needs to articulate why they are worth the money. You guys are primitive, you either like what you see and hear or you dont. I set my money based on my goals. So if you like what you see and want me to entertain you you will pay what I want. If you dont you will not agree or will settle if the money is good which will leas to you still searching for better option. Which is not good for my game. You either have the looks and presentation or you dont, and no articulation will change that ✌🏼.",
                                    "author": "idontlikespiderplant",
                                    "id": "imyw9cz",
                                    "parent_id": "t1_imqcgmf",
                                    "score": 1,
                                    "created_utc": 1662236246.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "That's  fine. Name your price. We either proceed or I next you. Simple concept. Except it's a slippery slope for you. You don't want to sell yourself short nor do you want to ask too much and scare a POT away.",
            "author": "GordonGuapo",
            "id": "imm0z6v",
            "parent_id": "t1_iml7g1w",
            "score": -4,
            "created_utc": 1662000855.0,
            "replies": []
        },
        {
            "body": "I didn't say it was me, I was playing devil's advocate.\n\nSome girls go on SA to find vanilla. Didn't you heard it's dating up now :)",
            "author": "sugardad123",
            "id": "imlgjys",
            "parent_id": "t1_imlfavr",
            "score": -3,
            "created_utc": 1661991766.0,
            "replies": [
                {
                    "body": "Even though IRONICALLY more scammers, hourly girls and picture sellers came on the site instead of this \"up dating\" Brandon Wade advocates so much",
                    "author": "CatLadyAmy1",
                    "id": "imlh0g2",
                    "parent_id": "t1_imlgjys",
                    "score": 2,
                    "created_utc": 1661991967.0,
                    "replies": [
                        {
                            "body": "You should try as a SD to filter through that, it's not fun either. Why would I look for an escort or platonic girl on SA, these people are deluded.",
                            "author": "sugardad123",
                            "id": "imlhiwp",
                            "parent_id": "t1_imlh0g2",
                            "score": 1,
                            "created_utc": 1661992193.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Exactly! What works for you works for you. It’s really not Rocket science. I think some people really overcomplicate the topic by overthinking. But thank you for being one to bring ease to it when it comes up 😉",
            "author": "Brownsugatoez",
            "id": "imn2hx8",
            "parent_id": "t1_imn231w",
            "score": 4,
            "created_utc": 1662026868.0,
            "replies": [
                {
                    "body": "It’s literally my pleasure 🤣",
                    "author": null,
                    "id": "imn2qfx",
                    "parent_id": "t1_imn2hx8",
                    "score": 1,
                    "created_utc": 1662027048.0,
                    "replies": [
                        {
                            "body": "🤣🤣🤣",
                            "author": "Brownsugatoez",
                            "id": "imn2scm",
                            "parent_id": "t1_imn2qfx",
                            "score": 1,
                            "created_utc": 1662027087.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Not a relationship for YOU.  [Can be more than just a transaction for others.](https://www.reddit.com/r/sugarlifestyleforum/comments/x1t9h3/seeing_a_former_sb_become_a_very_successful_woman/)",
            "author": "Pitkin_SD",
            "id": "imlhiny",
            "parent_id": "t1_imld6pr",
            "score": 1,
            "created_utc": 1661992190.0,
            "replies": [
                {
                    "body": "It is possible to develop bonds with people where the actual basis for being in the relationship is still transactional.  I know many who develop strong relationships with therapists or tutors or trainers.",
                    "author": null,
                    "id": "imocfrh",
                    "parent_id": "t1_imlhiny",
                    "score": 2,
                    "created_utc": 1662048648.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Go to the allowance thread on SLF and figure out what’s an acceptable price range for the area you’re in",
            "author": "CatLadyAmy1",
            "id": "imm1v5n",
            "parent_id": "t1_imm0tvg",
            "score": 2,
            "created_utc": 1662001289.0,
            "replies": []
        },
        {
            "body": "I never had ppm offered up until the last couple of years",
            "author": "CatLadyAmy1",
            "id": "imm34dn",
            "parent_id": "t1_imm30rt",
            "score": 2,
            "created_utc": 1662001915.0,
            "replies": [
                {
                    "body": "Sugar Vet of nearly 20 years.  It really has changed these last few years... and now everyone expects to be an online SB (pfft).  \n\n\nI famously used to tell candidates, \"I really don't trust anyone who wants less than (x) per month; I feel they aren't invested enough in this arrangement or in me.\"  Usually breaks the ice because they feel more comfortable making their ask since I've given a minimum that \\*I\\* will consider.  \n\n\nPPM basically just says that we're going to (or can) use each this one time.  That's not an \"arrangement\" in my book.  There are apps for that!",
                    "author": "IoTGiant",
                    "id": "immndmc",
                    "parent_id": "t1_imm34dn",
                    "score": 4,
                    "created_utc": 1662014557.0,
                    "replies": [
                        {
                            "body": "I’m new here but this thread is really giving me hope, that I’ll be able to find a real, decent, classy SD. I guess I’ll just have to be patient & weed through a lot of weeds to find a rose, lol!! Thank you!!! 😊",
                            "author": "Pryncess913",
                            "id": "imoaliu",
                            "parent_id": "t1_immndmc",
                            "score": 2,
                            "created_utc": 1662047939.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "> PPM has always been\n\nAbsolutely PPM is the gold standard, at least to begin a relationship. The unfortunate thing about PPM is that it enables the existence of fakes and scammers. No fake is going to prepay a months worth of allowance. But the other reality is the fake SBs take advantage as well,so guys have to protect themselves as well.",
            "author": "GSSD",
            "id": "imngxud",
            "parent_id": "t1_imm30rt",
            "score": 2,
            "created_utc": 1662035520.0,
            "replies": []
        },
        {
            "body": "Exactly. It is cringe for men and women too. When women are trying to pretend they are something they are not, trying to force how you should treat them verbally instead of by action. What is the point of talking how you are the princess and demand the best treatment while accepting shitty behaviour but sweet talk.",
            "author": "idontlikespiderplant",
            "id": "imokuw4",
            "parent_id": "t1_imlgsgs",
            "score": 2,
            "created_utc": 1662051865.0,
            "replies": []
        },
        {
            "body": "Hey, I'm not bald...",
            "author": "GordonGuapo",
            "id": "imm00xy",
            "parent_id": "t1_imlgsgs",
            "score": 0,
            "created_utc": 1662000400.0,
            "replies": []
        },
        {
            "body": "What you bring to the table is as cringe as if a woman start her rant how she is high quality, likes only the best, is the best and that she is queen, princess or whatever. If whoever ask me what I bring to the table, I know he do not have a table I would be even interested to sit by. If you know your worth, you will remove yourself from company of people that do not try to find or see your value. It is like with diamonds. Most of people will not be able to see whether you are one, so should you try to prove yourself or go to the one that can see that.",
            "author": "idontlikespiderplant",
            "id": "imoke9z",
            "parent_id": "t1_imlzzei",
            "score": 1,
            "created_utc": 1662051685.0,
            "replies": [
                {
                    "body": "\"What you bring to the table\" is no different than \"I know my worth\". Definitely cringe worthy. The point is that if you want to talk about money, you better articulate why you want and deserve X amount.",
                    "author": "GordonGuapo",
                    "id": "imqcgmf",
                    "parent_id": "t1_imoke9z",
                    "score": 1,
                    "created_utc": 1662077157.0,
                    "replies": [
                        {
                            "body": "Agree on the cringe part. But the same cringe is to you thinking SBs needs to articulate why they are worth the money. You guys are primitive, you either like what you see and hear or you dont. I set my money based on my goals. So if you like what you see and want me to entertain you you will pay what I want. If you dont you will not agree or will settle if the money is good which will leas to you still searching for better option. Which is not good for my game. You either have the looks and presentation or you dont, and no articulation will change that ✌🏼.",
                            "author": "idontlikespiderplant",
                            "id": "imyw9cz",
                            "parent_id": "t1_imqcgmf",
                            "score": 1,
                            "created_utc": 1662236246.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Even though IRONICALLY more scammers, hourly girls and picture sellers came on the site instead of this \"up dating\" Brandon Wade advocates so much",
            "author": "CatLadyAmy1",
            "id": "imlh0g2",
            "parent_id": "t1_imlgjys",
            "score": 2,
            "created_utc": 1661991967.0,
            "replies": [
                {
                    "body": "You should try as a SD to filter through that, it's not fun either. Why would I look for an escort or platonic girl on SA, these people are deluded.",
                    "author": "sugardad123",
                    "id": "imlhiwp",
                    "parent_id": "t1_imlh0g2",
                    "score": 1,
                    "created_utc": 1661992193.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "It’s literally my pleasure 🤣",
            "author": null,
            "id": "imn2qfx",
            "parent_id": "t1_imn2hx8",
            "score": 1,
            "created_utc": 1662027048.0,
            "replies": [
                {
                    "body": "🤣🤣🤣",
                    "author": "Brownsugatoez",
                    "id": "imn2scm",
                    "parent_id": "t1_imn2qfx",
                    "score": 1,
                    "created_utc": 1662027087.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "It is possible to develop bonds with people where the actual basis for being in the relationship is still transactional.  I know many who develop strong relationships with therapists or tutors or trainers.",
            "author": null,
            "id": "imocfrh",
            "parent_id": "t1_imlhiny",
            "score": 2,
            "created_utc": 1662048648.0,
            "replies": []
        },
        {
            "body": "Sugar Vet of nearly 20 years.  It really has changed these last few years... and now everyone expects to be an online SB (pfft).  \n\n\nI famously used to tell candidates, \"I really don't trust anyone who wants less than (x) per month; I feel they aren't invested enough in this arrangement or in me.\"  Usually breaks the ice because they feel more comfortable making their ask since I've given a minimum that \\*I\\* will consider.  \n\n\nPPM basically just says that we're going to (or can) use each this one time.  That's not an \"arrangement\" in my book.  There are apps for that!",
            "author": "IoTGiant",
            "id": "immndmc",
            "parent_id": "t1_imm34dn",
            "score": 4,
            "created_utc": 1662014557.0,
            "replies": [
                {
                    "body": "I’m new here but this thread is really giving me hope, that I’ll be able to find a real, decent, classy SD. I guess I’ll just have to be patient & weed through a lot of weeds to find a rose, lol!! Thank you!!! 😊",
                    "author": "Pryncess913",
                    "id": "imoaliu",
                    "parent_id": "t1_immndmc",
                    "score": 2,
                    "created_utc": 1662047939.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "\"What you bring to the table\" is no different than \"I know my worth\". Definitely cringe worthy. The point is that if you want to talk about money, you better articulate why you want and deserve X amount.",
            "author": "GordonGuapo",
            "id": "imqcgmf",
            "parent_id": "t1_imoke9z",
            "score": 1,
            "created_utc": 1662077157.0,
            "replies": [
                {
                    "body": "Agree on the cringe part. But the same cringe is to you thinking SBs needs to articulate why they are worth the money. You guys are primitive, you either like what you see and hear or you dont. I set my money based on my goals. So if you like what you see and want me to entertain you you will pay what I want. If you dont you will not agree or will settle if the money is good which will leas to you still searching for better option. Which is not good for my game. You either have the looks and presentation or you dont, and no articulation will change that ✌🏼.",
                    "author": "idontlikespiderplant",
                    "id": "imyw9cz",
                    "parent_id": "t1_imqcgmf",
                    "score": 1,
                    "created_utc": 1662236246.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "You should try as a SD to filter through that, it's not fun either. Why would I look for an escort or platonic girl on SA, these people are deluded.",
            "author": "sugardad123",
            "id": "imlhiwp",
            "parent_id": "t1_imlh0g2",
            "score": 1,
            "created_utc": 1661992193.0,
            "replies": []
        },
        {
            "body": "🤣🤣🤣",
            "author": "Brownsugatoez",
            "id": "imn2scm",
            "parent_id": "t1_imn2qfx",
            "score": 1,
            "created_utc": 1662027087.0,
            "replies": []
        },
        {
            "body": "I’m new here but this thread is really giving me hope, that I’ll be able to find a real, decent, classy SD. I guess I’ll just have to be patient & weed through a lot of weeds to find a rose, lol!! Thank you!!! 😊",
            "author": "Pryncess913",
            "id": "imoaliu",
            "parent_id": "t1_immndmc",
            "score": 2,
            "created_utc": 1662047939.0,
            "replies": []
        },
        {
            "body": "Agree on the cringe part. But the same cringe is to you thinking SBs needs to articulate why they are worth the money. You guys are primitive, you either like what you see and hear or you dont. I set my money based on my goals. So if you like what you see and want me to entertain you you will pay what I want. If you dont you will not agree or will settle if the money is good which will leas to you still searching for better option. Which is not good for my game. You either have the looks and presentation or you dont, and no articulation will change that ✌🏼.",
            "author": "idontlikespiderplant",
            "id": "imyw9cz",
            "parent_id": "t1_imqcgmf",
            "score": 1,
            "created_utc": 1662236246.0,
            "replies": []
        }
    ]
}