{
    "title": "I guess I am a sex worker",
    "post_id": "ep1hri",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/ep1hri/i_guess_i_am_a_sex_worker/",
    "author": null,
    "body": "I live in a country where health care is pretty elaborate. Different governmentally funded organisations are being really pushy about people checking their STD's and it's free and it's easy and there are clinics everywhere you can do it.\n\nSoo I went into one, like I've done before. The waiting hall is full of teenagers wanting that free chlamydia test or IUD or whatever. They always want you to fill out a form and you have to answer yes or no to the following questions:\n\n\n- have you slept with someone new during the last four weeks?\n- have you slept with Gay men?\n- have you slept with gay women?\n- have you received anal sex?\n- have you sold/traded sex or slept with someone who buys/trades sex?\n\n\nI know these questions were coming, this ain't my first rodeo. But it was the first time I answered 'yes' to the last question. And it's weird to admit, but in certain SR's I've really felt that I'm selling sex. And no matter what I wanted to tell myself in the beginning, I do feel that sugaring is a type of sex work. I am definitely sure that one of my SD's have been with a traditional escort before, anyways.\n\n\nAnyhow.. I got called in to the nurses office, and she was really nice. She asked me the same questions again, and asked about what tests I wanted to do. Because I answered yes to sexwork, that puts me in a category of people who can get free Hep B vaccine. She also did my bloodwork, swabbed my throat, and I got to swab my own vagina in the bathroom. She asked if someone was pushing me to do sexwork, and of course I answered no. But I'm glad that she did :)\n\n\nI don't really have a purpose with this post. I definitely don't want to start the old \"sugaring vs escorting\" discussion. But I dunno... this lifestyle has shaped me in a lot of ways, and I don't really have a place to vent about this. The appointment just really stuck with me. In a good way! Anyone had similar experiences?",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/ep1hri/i_guess_i_am_a_sex_worker/",
    "score": 127,
    "upvote_ratio": 0.95,
    "created_utc": 1579090058.0,
    "num_comments": 134,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "Coincidentally, my county (US) has a STI screening clinic, and today happens to be the day. The questionnaire asks whether I have been with someone who traded sex for money, and I always answer no. Not for deep philosophical reasons, but because I am wary of admitting that to the government, and I'm not confident it will remain confidential. Germs don't care about money, so I see the question as irrelevant. I do wonder now whether I would get extra services if I said yes.",
            "author": "ArnoldArmadillo",
            "id": "fegnv3d",
            "parent_id": "t3_ep1hri",
            "score": 29,
            "created_utc": 1579098288.0,
            "replies": [
                {
                    "body": "You can say that you have had sex with someone who has bought sex. Take all the service you can get! :)",
                    "author": null,
                    "id": "fego4q8",
                    "parent_id": "t1_fegnv3d",
                    "score": 18,
                    "created_utc": 1579098485.0,
                    "replies": []
                },
                {
                    "body": "If you were super concerned you could state you dated a sex worker. They likely won't believe you but it gives some cover.\n\nIt's important to tell them for additional high risk screenings.",
                    "author": "Sweettooth_dragon",
                    "id": "fegrx69",
                    "parent_id": "t1_fegnv3d",
                    "score": 17,
                    "created_utc": 1579101121.0,
                    "replies": [
                        {
                            "body": "I said yes to \"had sex with someone who traded sex for money...\" and checked the box \"in my lifetime\" rather than \"this year.\" I got the same treatment as usual: blood and urine. No extra questions, counseling, or treatment so far.",
                            "author": "ArnoldArmadillo",
                            "id": "fehgg4u",
                            "parent_id": "t1_fegrx69",
                            "score": 6,
                            "created_utc": 1579116025.0,
                            "replies": [
                                {
                                    "body": "I see. It's an interesting experiment though",
                                    "author": null,
                                    "id": "fehgzvx",
                                    "parent_id": "t1_fehgg4u",
                                    "score": 6,
                                    "created_utc": 1579116346.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": ">I don't really have a purpose with this post. I definitely don't want to start the old \"sugaring vs escorting\" discussion. But I dunno... this lifestyle has shaped me in a lot of ways, and I don't really have a place to vent about this. The appointment just really stuck with me. In a good way! Anyone had similar experiences?\n\nI'm glad that you live in a place where the views on sex work is more progressive than the US. Quite unfortunately, US seems to have regressed further lately with the SESTA/FOTSA. All I'm seeing is that these laws have strengthened the hands of pimps than save anyone. I wish things were different here.\n\nI don't see the sugaring vs escorting debate going away anytime soon ... :) Wonder if it'll ever make it mainstream like the old debate about \"pornography or art\". A civil debate is never a bad thing.",
            "author": "clutchcitysd",
            "id": "feghp5r",
            "parent_id": "t3_ep1hri",
            "score": 53,
            "created_utc": 1579093102.0,
            "replies": [
                {
                    "body": "I have the same comment. Living in the US, I’m legitimately afraid of what would happen if I were ever assaulted by a POT.....since sex work is illegal I’d be scared to report 😔",
                    "author": "BratinaHat",
                    "id": "fegng0v",
                    "parent_id": "t1_feghp5r",
                    "score": 18,
                    "created_utc": 1579097980.0,
                    "replies": [
                        {
                            "body": "Sex work isn’t illegal, prostitution is.  And you aren’t working as a prostitute. Not that it would mean you shouldn’t report, as rape is also illegal.\n\nBut in your case you aren’t breaking any law.",
                            "author": "WandererOfInterwebs",
                            "id": "fegr6rt",
                            "parent_id": "t1_fegng0v",
                            "score": 9,
                            "created_utc": 1579100620.0,
                            "replies": []
                        },
                        {
                            "body": "In most American cities you can be a sexworker  working on the streets and you are still going to get help with an assault .  Wasn't always that way but is, for the most part now.  Working the Hollywood Studio chiefs   well that's another matter.",
                            "author": "pinotandsugar",
                            "id": "fehf4ya",
                            "parent_id": "t1_fegng0v",
                            "score": 3,
                            "created_utc": 1579115257.0,
                            "replies": [
                                {
                                    "body": "Do you have any sources to back that up?",
                                    "author": "BratinaHat",
                                    "id": "fehw7m9",
                                    "parent_id": "t1_fehf4ya",
                                    "score": 4,
                                    "created_utc": 1579125091.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Those laws are even damaging to indie porn producers like myself. They were not written to protect women, they were written to protect the big traffickers.",
                    "author": "Elvishgirl",
                    "id": "fehubjo",
                    "parent_id": "t1_feghp5r",
                    "score": 6,
                    "created_utc": 1579124018.0,
                    "replies": [
                        {
                            "body": "😔",
                            "author": "BratinaHat",
                            "id": "fehxsum",
                            "parent_id": "t1_fehubjo",
                            "score": 3,
                            "created_utc": 1579126009.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "> have you sold/traded sex or slept with someone who buys/trades sex? \n\nThis question is outdated and should be \"Have you had sex with multiple partners who also have sex with multiple partners.\"",
            "author": "scott7sd",
            "id": "fegvy9v",
            "parent_id": "t3_ep1hri",
            "score": 23,
            "created_utc": 1579103748.0,
            "replies": [
                {
                    "body": "I’m so glad you addressed that. When I first read it, I thought of situations where a girl’s boyfriend was sleeping with multiple girls on the side so she’s been at risk more than most sugar relationships.",
                    "author": "racejeff",
                    "id": "fehbhk5",
                    "parent_id": "t1_fegvy9v",
                    "score": 8,
                    "created_utc": 1579113134.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Even if you don't want to veiw it as sex work, my opinion is this.\n\nA LOT of sugarbabies could greatly benifit from sex worker resources. I got into sugar first, and I did SO many stupid things that put my life and health at risk because I had some stupid mental block about looking at sex worker blogs for advice.\n\nJust do it. They have good advice.",
            "author": "Elvishgirl",
            "id": "fehu8av",
            "parent_id": "t3_ep1hri",
            "score": 9,
            "created_utc": 1579123967.0,
            "replies": [
                {
                    "body": "I would love any links you'd recommend on this.",
                    "author": "_velvet_blue",
                    "id": "fei7ojj",
                    "parent_id": "t1_fehu8av",
                    "score": 5,
                    "created_utc": 1579132120.0,
                    "replies": [
                        {
                            "body": "Sexworkersonly is a great resource and sub...",
                            "author": "kitten_ftw",
                            "id": "fejdi4h",
                            "parent_id": "t1_fei7ojj",
                            "score": 3,
                            "created_utc": 1579168687.0,
                            "replies": [
                                {
                                    "body": "Literally what I was going to say. \n\nReddit has a great base of sex workers. Some of the most talented and intelligent women ive met",
                                    "author": "Elvishgirl",
                                    "id": "fekrwuf",
                                    "parent_id": "t1_fejdi4h",
                                    "score": 3,
                                    "created_utc": 1579206339.0,
                                    "replies": [
                                        {
                                            "body": "That's so cool that you've met them! I'm very grateful for Reddit",
                                            "author": "kitten_ftw",
                                            "id": "felyh34",
                                            "parent_id": "t1_fekrwuf",
                                            "score": 1,
                                            "created_utc": 1579234173.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "Holy shit. Thank all of you who recommended this sub. This is quite literally some of the most emotionally intelligent dialogue I've ever read on the internet. I wish I'd found it sooner.",
                                            "author": "_velvet_blue",
                                            "id": "ffj6xga",
                                            "parent_id": "t1_fekrwuf",
                                            "score": 1,
                                            "created_utc": 1579991925.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "\"Revolting Prostitutes\" By Juno Mac and Molly Smith is an amazing book that discusses all the various laws and frameworks related to sex work in different areas of the world. Both authors are sex workers from the UK. It reads pretty academic because they have done a ton of research and cite all sorts of studies and statistics. Really fascinating and highly recommend!",
                            "author": "Altruistic-Yesterday",
                            "id": "ffb41g4",
                            "parent_id": "t1_fei7ojj",
                            "score": 2,
                            "created_utc": 1579751233.0,
                            "replies": [
                                {
                                    "body": "Thank you! Will check it out.",
                                    "author": "_velvet_blue",
                                    "id": "ffdjalg",
                                    "parent_id": "t1_ffb41g4",
                                    "score": 2,
                                    "created_utc": 1579822065.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Yes, Sugaring is most definitely sex work. I think anyone who doesn't acknowledge this is simply being swayed by the stigma against sex work.",
            "author": "SD-ofNote",
            "id": "fegnhh8",
            "parent_id": "t3_ep1hri",
            "score": 38,
            "created_utc": 1579098009.0,
            "replies": [
                {
                    "body": "If I am receiving money and there is sex involved... and if there were no sex involved, I would not be receiving that money, then yes, I am doing sex work. And personally, I don’t feel there needs to be any shame in that.",
                    "author": "RealEarthAngel",
                    "id": "fehdkm9",
                    "parent_id": "t1_fegnhh8",
                    "score": 15,
                    "created_utc": 1579114351.0,
                    "replies": [
                        {
                            "body": "> If I am receiving money and there is sex involved..\n\nIs that the definition of marriage  \n\na much better series of questions would be more than N  partners in the last 30 days,  any partners engaged in male homosexual acts, IV drug use",
                            "author": "pinotandsugar",
                            "id": "fehffwz",
                            "parent_id": "t1_fehdkm9",
                            "score": -1,
                            "created_utc": 1579115434.0,
                            "replies": [
                                {
                                    "body": "No. There’s a lot more to marriage then there is to an arrangement.",
                                    "author": "RealEarthAngel",
                                    "id": "fehfthj",
                                    "parent_id": "t1_fehffwz",
                                    "score": 11,
                                    "created_utc": 1579115657.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "What about the notion that sugaring is really an avocation, a hobby. Work is a vocation. Some would say a vocation is a calling, lots of wiggle room there. I am using the term vocation as a synonym for profession. Are there professional SBs?",
                    "author": "ontherdagn",
                    "id": "feh37du",
                    "parent_id": "t1_fegnhh8",
                    "score": 3,
                    "created_utc": 1579108206.0,
                    "replies": [
                        {
                            "body": "As with most things in the sex trade, there is a lot of grey area here. Just because a SB isn't doing it as her full time career doesn't disqualify the activity from being classified as sex work. Yes, I would imagine most SB's do it part-time, if you want to use career based terminology, but its still a form of sex work.",
                            "author": "SD-ofNote",
                            "id": "feha066",
                            "parent_id": "t1_feh37du",
                            "score": 6,
                            "created_utc": 1579112246.0,
                            "replies": [
                                {
                                    "body": "Unfortunately I spend more time driving than having sex  but I would never consider my profession to be driving",
                                    "author": "pinotandsugar",
                                    "id": "fehg2q1",
                                    "parent_id": "t1_feha066",
                                    "score": 2,
                                    "created_utc": 1579115807.0,
                                    "replies": [
                                        {
                                            "body": "But you do have a government issued certificate that you are competent to drive.",
                                            "author": "ontherdagn",
                                            "id": "feiwaze",
                                            "parent_id": "t1_fehg2q1",
                                            "score": 1,
                                            "created_utc": 1579148965.0,
                                            "replies": [
                                                {
                                                    "body": "FIA",
                                                    "author": "pinotandsugar",
                                                    "id": "feiwnql",
                                                    "parent_id": "t1_feiwaze",
                                                    "score": 1,
                                                    "created_utc": 1579149251.0,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "body": "Sugaring is sex work. Period.",
                                            "author": "kitten_ftw",
                                            "id": "fejbrlk",
                                            "parent_id": "t1_fehg2q1",
                                            "score": 1,
                                            "created_utc": 1579166046.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I always panic when Planned Parenthood asks me this and lie and say no. I don't know what they would do if I said yes.",
            "author": null,
            "id": "fegjpeu",
            "parent_id": "t3_ep1hri",
            "score": 8,
            "created_utc": 1579094843.0,
            "replies": [
                {
                    "body": "Typically they shoot you on site.\n\nC'mon.\n\nThey are asking to better be able to treat / advise you.\n\nIf you have multiple partners or engage in more risky behavior you will get a talk about condom use (and free condoms at most PPs), maybe an HPV vaccine recommendation (I got that!), maybe some talk about hepatitis.",
                    "author": "marker3000",
                    "id": "feh7t73",
                    "parent_id": "t1_fegjpeu",
                    "score": 8,
                    "created_utc": 1579110933.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I think about the sex work/STI risk screening questions a lot when I go to the Drs or donate blood. Ultimately I always lie and say I've never had sex in exchange for money, just to avoid the questioning that's going to come with saying yes, but it definitely sits with me every time I read the question. \n\nI actually did a STI screen this morning and had to lie, so serendipitous timing.",
            "author": "MASugarBaby",
            "id": "fegqghe",
            "parent_id": "t3_ep1hri",
            "score": 7,
            "created_utc": 1579100121.0,
            "replies": [
                {
                    "body": "It sucks that we feel we have to lie. Bc you can't always tell someone's views.💕",
                    "author": "kitten_ftw",
                    "id": "felzux6",
                    "parent_id": "t1_fegqghe",
                    "score": 2,
                    "created_utc": 1579235304.0,
                    "replies": []
                },
                {
                    "body": "I'm lucky to currently have a nurse practitioner who doesn't ask those questions. At my last well woman test, I asked her to test me for everything.   But when I used to go to planned Parenthood I remember all those questions you are talking about. Some Drs are very judgemental. I remember one from planned Parenthood insinuating that my job as a stripper at that time was causing me to worry about STDs. I was insulted bc I didn't have sex with the customers. And I ended up being diagnosed with BV. Not an STD. So I can only imagine what that woman would have said had I checked the box about sleeping with people for money. I'm lucky to have a very open minded NP but I have not told her or any Dr that I do SW. I'm also new to sugaring and escorting.",
                    "author": "kitten_ftw",
                    "id": "felzsas",
                    "parent_id": "t1_fegqghe",
                    "score": 1,
                    "created_utc": 1579235242.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Hopefully you don’t get profiled",
            "author": "perryplats",
            "id": "fegfmqx",
            "parent_id": "t3_ep1hri",
            "score": 3,
            "created_utc": 1579091141.0,
            "replies": [
                {
                    "body": "It's legal in my country, besides their medical journal is to be kept confidental even from my doctor! Which is greatttt",
                    "author": null,
                    "id": "feggq7o",
                    "parent_id": "t1_fegfmqx",
                    "score": 12,
                    "created_utc": 1579092205.0,
                    "replies": [
                        {
                            "body": "Nice! Honestly, I like the US but they are lacking behind when it comes to rights for sex workers and women’s freedom of choice. Why can’t women make money with their body if that’s what she chooses? My friend got her social media taken down for putting too many bikini pics. Why does everything have to be so secretive and potentially dangerous? There too much ignorance and prejudice around  this  topic.",
                            "author": null,
                            "id": "fegjne3",
                            "parent_id": "t1_feggq7o",
                            "score": 10,
                            "created_utc": 1579094797.0,
                            "replies": [
                                {
                                    "body": "USA is like a modern yet medieval",
                                    "author": null,
                                    "id": "fegk7iz",
                                    "parent_id": "t1_fegjne3",
                                    "score": 11,
                                    "created_utc": 1579095261.0,
                                    "replies": []
                                },
                                {
                                    "body": "I have been in nearly every country in the world, not many are more prudish than the US.",
                                    "author": null,
                                    "id": "feikpnd",
                                    "parent_id": "t1_fegjne3",
                                    "score": 2,
                                    "created_utc": 1579140787.0,
                                    "replies": []
                                },
                                {
                                    "body": "> rights for sex workers and women’s freedom of choice.\n\nBecause it also comes with \"and regulate it\", which means the sex worker can sue the government if anything happens to them.  The frivolous lawsuit system would need to be fixed first.",
                                    "author": "scott7sd",
                                    "id": "fegkxsb",
                                    "parent_id": "t1_fegjne3",
                                    "score": 3,
                                    "created_utc": 1579095979.0,
                                    "replies": [
                                        {
                                            "body": "We have a lot to fix in the US and frivolous lawsuits is one of the biggest issues, but because lawyers are the primary beneficiaries and politicians are mostly lawyers don't expect that to change soon.  Most people have no idea of how much frivolous lawsuits, class action lawsuits and threat of lawsuits negatively impacts the daily life.  There is much to fix, but we have few if anyone in politics actually wanting to fix the issues.  They just want to blame the other political party for the problems.\n\n* Tort Reform\n* Prison Reform\n* Healthcare Reform\n* Education Reform\n* Legalize, regulate and tax drugs and prostitution\n* Tax reform\n* etc",
                                            "author": "willfromvb",
                                            "id": "fegui0r",
                                            "parent_id": "t1_fegkxsb",
                                            "score": 1,
                                            "created_utc": 1579102819.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "^this 💯%! Women should be able to do whatever they want with their bodies; and if a woman chooses to make money from her body and emotional labor, it should be accepted.",
                                    "author": "kitten_ftw",
                                    "id": "fek9ot7",
                                    "parent_id": "t1_fegjne3",
                                    "score": 1,
                                    "created_utc": 1579195517.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Loved this post. Have had the same ponderings getting STI screenings (usually wondering \"how much do I trust this system's data security?\" and whether I'd get a free smear test out of it). \n\nI have always considered sugaring SW (although different from escorting; SW is a big umbrella). I've never understood people's tacit acceptance of the shame that comes with that word on this sub. I think the fact that I do something interesting, subversive, and different than most makes me more interesting as a person. \n\nJust my thoughts! Thanks for your post - I get that lack of venting space.",
            "author": "_velvet_blue",
            "id": "fei92ln",
            "parent_id": "t3_ep1hri",
            "score": 4,
            "created_utc": 1579133012.0,
            "replies": [
                {
                    "body": "Thank you!\nReading the comments here made me realize that a lot of people on this sub are totally cool woth the SW part. Maybe even proud :) I don't feel so weird about it anymore, even the incel in my inbox trying to \"your parents must be proud\"-me can't phase me lol",
                    "author": null,
                    "id": "feji5jz",
                    "parent_id": "t1_fei92ln",
                    "score": 2,
                    "created_utc": 1579175311.0,
                    "replies": [
                        {
                            "body": "Yes I am finding that out too! I thought a lot of the people on here were anti sex work, but it's interesting to see that many don't have a problem with it",
                            "author": "kitten_ftw",
                            "id": "fekbntn",
                            "parent_id": "t1_feji5jz",
                            "score": 3,
                            "created_utc": 1579196677.0,
                            "replies": []
                        },
                        {
                            "body": "😂",
                            "author": "_velvet_blue",
                            "id": "feo20re",
                            "parent_id": "t1_feji5jz",
                            "score": 2,
                            "created_utc": 1579294111.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "And there is nothing to be ashamed with! I also make some sex work sometimes to help me pay things, and it help me so good",
            "author": "MonsieurChandon",
            "id": "feidmpy",
            "parent_id": "t3_ep1hri",
            "score": 3,
            "created_utc": 1579136052.0,
            "replies": []
        },
        {
            "body": "It’s just sex work... don’t know why people deny this. Whether people like it or not, a transaction is a transaction.",
            "author": "Limitlesspappy",
            "id": "fegnvom",
            "parent_id": "t3_ep1hri",
            "score": 10,
            "created_utc": 1579098300.0,
            "replies": [
                {
                    "body": "But \"let's not make this transactional\"",
                    "author": "anonymou555andWich",
                    "id": "fegog3d",
                    "parent_id": "t1_fegnvom",
                    "score": 9,
                    "created_utc": 1579098712.0,
                    "replies": [
                        {
                            "body": "But I as a POT SD will ask you 20 questions personal ones about your sexual preferences and request pics. Me: how do you feel about ppm, allowance or paid meet and greets. Him: transactional, blah blah blah I never pay for meet and greets. And I never pay under (names low amt) per ppm. I just want there to be a connection. This after asking me if I have ever squirted 😭😜🤣 \n\nBut I can't bring up money and get a real answer?!?",
                            "author": "kitten_ftw",
                            "id": "feizs75",
                            "parent_id": "t1_fegog3d",
                            "score": 3,
                            "created_utc": 1579151907.0,
                            "replies": [
                                {
                                    "body": "I'm not like that I bring it up fairly quickly. \n\nI never pay for meets though.",
                                    "author": "anonymou555andWich",
                                    "id": "fejfj78",
                                    "parent_id": "t1_feizs75",
                                    "score": 2,
                                    "created_utc": 1579171748.0,
                                    "replies": [
                                        {
                                            "body": "I think it's great that you bring it up quickly. Takes a lot of anxiety off the sb. At least for me!\n\nAs a SB I'm a fan of paid meet and greets. Where I live if it's a paid meet and greet, the standard amt isn't much but its a sweet guesture I appreciate 😊\n But it's not something I require. I only occasionally ask for it. Most times I don't bring it up. Certainly not a deal breaker, but it helps and makes me feel good/special ☺️",
                                            "author": "kitten_ftw",
                                            "id": "fekb1yt",
                                            "parent_id": "t1_fejfj78",
                                            "score": 2,
                                            "created_utc": 1579196320.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": ">It’s just sex work... \n\nI like this",
                    "author": null,
                    "id": "fehhjvh",
                    "parent_id": "t1_fegnvom",
                    "score": 3,
                    "created_utc": 1579116669.0,
                    "replies": [
                        {
                            "body": "Yas!!!! Louder for the people in the back!",
                            "author": "kitten_ftw",
                            "id": "fejbva5",
                            "parent_id": "t1_fehhjvh",
                            "score": 2,
                            "created_utc": 1579166195.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "fegru38",
            "parent_id": "t3_ep1hri",
            "score": 7,
            "created_utc": 1579101064.0,
            "replies": [
                {
                    "body": "My goodness, can't sexwork just mean sexwork. Was Kinsey in sexwork? How about obstetrics, is that sex work. \"men use the word sexwoek to lower...\"  Really, some men perhaps but I don't. Maybe we should use the word professional, as in the oldest. I'm sure most consider the working girls at the Bunny Ranch to be professionals. Surely hardly any SB can be considered a professional. Sexwork is neither ameliorative or pejorative, unless sex is. That's our problem, too many individuals in our culture consider sex in a bad light. It just happens to be one of our primary motivations you dirty animals.",
                    "author": "ontherdagn",
                    "id": "feh4e4x",
                    "parent_id": "t1_fegru38",
                    "score": 2,
                    "created_utc": 1579108906.0,
                    "replies": [
                        {
                            "body": "Sugaring is sex work. Being an obgyn is not.",
                            "author": "kitten_ftw",
                            "id": "feizz4r",
                            "parent_id": "t1_feh4e4x",
                            "score": 1,
                            "created_utc": 1579152076.0,
                            "replies": []
                        },
                        {
                            "body": "I agree",
                            "author": "kitten_ftw",
                            "id": "fekbbf1",
                            "parent_id": "t1_feh4e4x",
                            "score": 1,
                            "created_utc": 1579196474.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "You know men can be stay at home husbands and can also participate in being a sugar baby as well right? I’m a male sugar baby and make way more than any female sugar baby I know, and I don’t even participate in penetrative or give oral sex.",
                    "author": null,
                    "id": "fehd69k",
                    "parent_id": "t1_fegru38",
                    "score": 3,
                    "created_utc": 1579114120.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Sugaring is sex work . Period.",
            "author": "lovelylivia13",
            "id": "fehkq6p",
            "parent_id": "t3_ep1hri",
            "score": 2,
            "created_utc": 1579118523.0,
            "replies": []
        },
        {
            "body": "I just wanted to say - you are so lucky to live in a country where these services are easily available and affordable! The closest we have here is PP, and it’s scary to be near one because of the protesters harassing patients. Like damn, I just wanted my annual exam birth control refilled 😭\n\nAlso, I’ve seen at least a 2 posts here about girls being shamed by their OBGYNs into not getting BC and for being tested too often. Seriously, your healthcare system is awesome.",
            "author": "DallasSugarBaby",
            "id": "fei3elr",
            "parent_id": "t3_ep1hri",
            "score": 2,
            "created_utc": 1579129405.0,
            "replies": [
                {
                    "body": "I've heard about the situation in the states, and honestly, it sounds so horrible. I am really thankful for my options, and I hope you get the same opportunity.\n\nHonestly, USA seems to be so divided. You have this huge continent consisting of so many people woth differemt political views who have to abide by the same laws. It sounds impossible to please everyone! Why can't the anti-abortion people get the south, then those who want free healthcare take the north!\n\nI'm just kidding of course. But America is such a weird consept. But it sounds wonderful on other aspects!",
                    "author": null,
                    "id": "fei5hb1",
                    "parent_id": "t1_fei3elr",
                    "score": 2,
                    "created_utc": 1579130715.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I think your missing the point of the question. The clinic is trying to figure out if you are in a high risk group for contracting STDs. Being a SB has nothing to do with that question. STDs don’t know the difference between vanilla and sugar. If you have many sexual partners (like an escort or many 20 year olds) you are at higher risk.",
            "author": "ab1035",
            "id": "fegoizv",
            "parent_id": "t3_ep1hri",
            "score": 5,
            "created_utc": 1579098772.0,
            "replies": [
                {
                    "body": "I don't think you know my situation enough to know what risk I'm at",
                    "author": null,
                    "id": "fegve34",
                    "parent_id": "t1_fegoizv",
                    "score": 8,
                    "created_utc": 1579103390.0,
                    "replies": [
                        {
                            "body": "I don’t know you at all. Point is that being a sugar baby does not increase your risk versus vanilla dating.  The more risky your behavior, the more likely you are to get infected. STDs don’t judge you they infect you.",
                            "author": "ab1035",
                            "id": "fegwhut",
                            "parent_id": "t1_fegve34",
                            "score": 4,
                            "created_utc": 1579104090.0,
                            "replies": [
                                {
                                    "body": "I get that. But risky behaviour often comes as part of the sugaring, as I believe I mention shortly. But yeah, I agree. Viruses don't care.",
                                    "author": null,
                                    "id": "fegwn8n",
                                    "parent_id": "t1_fegwhut",
                                    "score": 4,
                                    "created_utc": 1579104185.0,
                                    "replies": [
                                        {
                                            "body": "I feel far more comfortable with an SB even if she has an IRL BF or another SD than hooking up with the typical  F Hollywood Club patron .",
                                            "author": "pinotandsugar",
                                            "id": "fehgcbz",
                                            "parent_id": "t1_fegwn8n",
                                            "score": 1,
                                            "created_utc": 1579115965.0,
                                            "replies": [
                                                {
                                                    "body": "Lol🤣 🤣 🤣 sbs can be escorts too. Or are you saying u feel more comfortable hooking up with a SB than a woman you met at a bar or club? I'm confused.",
                                                    "author": "kitten_ftw",
                                                    "id": "fejc334",
                                                    "parent_id": "t1_fehgcbz",
                                                    "score": 1,
                                                    "created_utc": 1579166523.0,
                                                    "replies": [
                                                        {
                                                            "body": "Typical Hollywood club you have a crowd that has a high level of non commercial or marginally commercial sexual activity,  drugs and frequently bi-sexual males intermixed.   A steady college student or single mother  SB even with two SD is likely to be a far lower risk",
                                                            "author": "pinotandsugar",
                                                            "id": "fekatzy",
                                                            "parent_id": "t1_fejc334",
                                                            "score": 1,
                                                            "created_utc": 1579196190.0,
                                                            "replies": [
                                                                {
                                                                    "body": "I see your point. I've never been to Hollywood before. I always use condoms. I think a lot of SBs and escorts are more likely to use protection than your average party goer. But I feel uncomfortable, personally making assumptions about men that are bisexual. But as a young woman who loved to party, do drugs and went through a promiscuous phase; I wasn't very careful. I got lucky. Now as a SW I always use protection. I do agree that SBs are probably more aware of the dangers of unprotected sex",
                                                                    "author": "kitten_ftw",
                                                                    "id": "fem1ajw",
                                                                    "parent_id": "t1_fekatzy",
                                                                    "score": 1,
                                                                    "created_utc": 1579236524.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "> assumptions about men that are bisexual\n\nsadly the stats don't lie",
                                                                            "author": "pinotandsugar",
                                                                            "id": "fem7mp0",
                                                                            "parent_id": "t1_fem1ajw",
                                                                            "score": 1,
                                                                            "created_utc": 1579242672.0,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "body": "Bc SDs have multiple babies and babies have multiple daddies unless exclusivity is part of the arrangement 🙂",
                                            "author": "kitten_ftw",
                                            "id": "fejc4kp",
                                            "parent_id": "t1_fegwn8n",
                                            "score": 1,
                                            "created_utc": 1579166587.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "Maybe we can agree that all sexual relations have risk. If one has more sexual partners due to being a SB than the risk goes up. Fair?",
                                            "author": "ab1035",
                                            "id": "fegxf8l",
                                            "parent_id": "t1_fegwn8n",
                                            "score": 0,
                                            "created_utc": 1579104682.0,
                                            "replies": [
                                                {
                                                    "body": "Yes I agree",
                                                    "author": null,
                                                    "id": "fegzb6r",
                                                    "parent_id": "t1_fegxf8l",
                                                    "score": 3,
                                                    "created_utc": 1579105851.0,
                                                    "replies": [
                                                        {
                                                            "body": "😀",
                                                            "author": "ab1035",
                                                            "id": "fegzeiu",
                                                            "parent_id": "t1_fegzb6r",
                                                            "score": 2,
                                                            "created_utc": 1579105908.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "body": "Fair but the risk is really associated with the pool from which they are plucked (M or F )",
                                                    "author": "pinotandsugar",
                                                    "id": "fehgfrg",
                                                    "parent_id": "t1_fegxf8l",
                                                    "score": 2,
                                                    "created_utc": 1579116019.0,
                                                    "replies": [
                                                        {
                                                            "body": "True to an extent. But the sweet girl next door can also give you the clap.",
                                                            "author": "ab1035",
                                                            "id": "fehiaop",
                                                            "parent_id": "t1_fehgfrg",
                                                            "score": 2,
                                                            "created_utc": 1579117109.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "fegkb7o",
            "parent_id": "t3_ep1hri",
            "score": 2,
            "created_utc": 1579095357.0,
            "replies": [
                {
                    "body": "Well then by that logic any sb not in a platonic relationship is a sex worker.",
                    "author": "redditgrl1140",
                    "id": "feglvee",
                    "parent_id": "t1_fegkb7o",
                    "score": 8,
                    "created_utc": 1579096752.0,
                    "replies": [
                        {
                            "body": "I consider sugaring sex work just like camming, being a dominatrix (that may or may not actually have contacted with their clients genitals), phone sex for pay, etc. Sex work is a big umbrella term and I don't really get the stigma in this sub.",
                            "author": "brylikestrees",
                            "id": "fegnqha",
                            "parent_id": "t1_feglvee",
                            "score": 12,
                            "created_utc": 1579098194.0,
                            "replies": [
                                {
                                    "body": "I don't either! This sub could be really cool if they would let go of the stigma!",
                                    "author": "kitten_ftw",
                                    "id": "fejc63r",
                                    "parent_id": "t1_fegnqha",
                                    "score": 1,
                                    "created_utc": 1579166651.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "Exactly.",
                            "author": "RealEarthAngel",
                            "id": "fehe28e",
                            "parent_id": "t1_feglvee",
                            "score": 2,
                            "created_utc": 1579114632.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "fegmcd4",
                    "parent_id": "t1_fegkb7o",
                    "score": -4,
                    "created_utc": 1579097127.0,
                    "replies": [
                        {
                            "body": "> so are wives and girlfriends\n\nThe difference is the \"requirement \" for money. Most BFs and husbands contribute greatly to the support of their partners, but it is a voluntary contribution.",
                            "author": "GSSD",
                            "id": "fegnl8s",
                            "parent_id": "t1_fegmcd4",
                            "score": 6,
                            "created_utc": 1579098085.0,
                            "replies": [
                                {
                                    "body": "^ this",
                                    "author": "kitten_ftw",
                                    "id": "fejc9df",
                                    "parent_id": "t1_fegnl8s",
                                    "score": 1,
                                    "created_utc": 1579166789.0,
                                    "replies": []
                                },
                                {
                                    "body": "> but it is a voluntary contribution.\n\nLOL.  And what happens when the \"voluntary contribution\" doesn't happen such as on Valentine's day, birthday, anniversary, Christmas, Mother's day, etc?  Not so voluntary is it?",
                                    "author": "scott7sd",
                                    "id": "fegwigf",
                                    "parent_id": "t1_fegnl8s",
                                    "score": -2,
                                    "created_utc": 1579104101.0,
                                    "replies": [
                                        {
                                            "body": "Bizarre. You are acting like a committed relationship is like a sugar relationship... and it's not. I don't wanna break it to ya but folks generally don't choose their partners solely for their ability to financially compensate them. \n\nA sugar relationship is literally 100% about someones ability to financially compensate someone for their time and company because if you can't pay then you aren't playing.",
                                            "author": "MxMonstera",
                                            "id": "feh3qzf",
                                            "parent_id": "t1_fegwigf",
                                            "score": 7,
                                            "created_utc": 1579108527.0,
                                            "replies": [
                                                {
                                                    "body": ">A sugar relationship is literally 100% about someones ability to financially compensate someone for their time and company\n\nHow many SBs would accept a sugar relationship with Brad Pitt that involved zero financial compensation and only involved \"the experience\"?",
                                                    "author": "scott7sd",
                                                    "id": "feh6gxe",
                                                    "parent_id": "t1_feh3qzf",
                                                    "score": 0,
                                                    "created_utc": 1579110144.0,
                                                    "replies": [
                                                        {
                                                            "body": "If you want financial compensation in exchange for intercourse or time spent, sugar is for you. \n\nIf you want a relationship between equals based upon mutual attraction and compatibility without a primary financial focus, then go for regular dating. \n\nIf they were the same thing, we wouldn't have made up a term for sugaring. They are two different things. Stop deluding yourself.",
                                                            "author": "MxMonstera",
                                                            "id": "feh8gpb",
                                                            "parent_id": "t1_feh6gxe",
                                                            "score": 3,
                                                            "created_utc": 1579111314.0,
                                                            "replies": [
                                                                {
                                                                    "body": "> If you want financial compensation in exchange for intercourse and time spent, sugar relationship is for you. \n\nThen what is escorting if, as you said, f they were the same thing, we wouldn't have made up a term for sugaring.",
                                                                    "author": "scott7sd",
                                                                    "id": "feha8ew",
                                                                    "parent_id": "t1_feh8gpb",
                                                                    "score": 0,
                                                                    "created_utc": 1579112384.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "If you need more explaining, I suggest you use google or pay me for my time. Peace.",
                                                                            "author": "MxMonstera",
                                                                            "id": "fehedf1",
                                                                            "parent_id": "t1_feha8ew",
                                                                            "score": 10,
                                                                            "created_utc": 1579114811.0,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "body": "It would not be a sugar relationship. It would be dating Brad Pitt",
                                                            "author": "kitten_ftw",
                                                            "id": "fejccvm",
                                                            "parent_id": "t1_feh6gxe",
                                                            "score": 1,
                                                            "created_utc": 1579166937.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "body": ">Bizarre. You are acting like a committed relationship is like a sugar relationship... and it's not.\n\nNo, I am saying that sugar relationships can be closer to a committed relationship than it is to escort because a sugar relationship is what you make it out to be.",
                                                    "author": "scott7sd",
                                                    "id": "feh6ls0",
                                                    "parent_id": "t1_feh3qzf",
                                                    "score": -1,
                                                    "created_utc": 1579110225.0,
                                                    "replies": [
                                                        {
                                                            "body": "You are saying that you feel comfortable twisting reality to suit your definitions. And I'm saying \"nah, that's not cool\" \n\nTransactional arrangements = escorting, sugaring, sex work, etc. \n\nThere's not a damn thing wrong with transactional arrangements so long as you are honest with yourself and the other person.  Regular dating isn't transactional. Or if it is, you should reevaluate your relationship ;p",
                                                            "author": "MxMonstera",
                                                            "id": "feh8oip",
                                                            "parent_id": "t1_feh6ls0",
                                                            "score": 4,
                                                            "created_utc": 1579111445.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "body": "Well expectations and requirement are two different things.",
                                            "author": "GSSD",
                                            "id": "fegy4mu",
                                            "parent_id": "t1_fegwigf",
                                            "score": 1,
                                            "created_utc": 1579105120.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "Yes it is. You can choose whether to exchange gifts on those holidays ot not. Or the husband and wife can argue over it but that is not a sugar arrangement",
                                            "author": "kitten_ftw",
                                            "id": "fejcbit",
                                            "parent_id": "t1_fegwigf",
                                            "score": 1,
                                            "created_utc": 1579166880.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "escorts can choose who they sleep with as much as SBs....",
                            "author": "sacredsslut",
                            "id": "feh43f4",
                            "parent_id": "t1_fegmcd4",
                            "score": 7,
                            "created_utc": 1579108730.0,
                            "replies": []
                        },
                        {
                            "body": "I know a couple escorts. They definitely chose their clients. The more experienced one is pretty choosy, in fact 🤷‍♀️",
                            "author": "BratinaHat",
                            "id": "fegnkba",
                            "parent_id": "t1_fegmcd4",
                            "score": 6,
                            "created_utc": 1579098065.0,
                            "replies": []
                        },
                        {
                            "body": "Hmmm... Because wives do not contribute to the household? This logic is ridiculous because many women make more  than their husbands. And it's s monagamous love relationship. It's completely different from sugaring or any sex work.",
                            "author": "redditgrl1140",
                            "id": "fegoocu",
                            "parent_id": "t1_fegmcd4",
                            "score": 5,
                            "created_utc": 1579098877.0,
                            "replies": [
                                {
                                    "body": "> And it's s monagamous love relationship \n\nSeems like many of the married SDs would disagree with this.",
                                    "author": "scott7sd",
                                    "id": "fegwoyx",
                                    "parent_id": "t1_fegoocu",
                                    "score": 1,
                                    "created_utc": 1579104215.0,
                                    "replies": [
                                        {
                                            "body": "Yep",
                                            "author": "ontherdagn",
                                            "id": "feh4xl1",
                                            "parent_id": "t1_fegwoyx",
                                            "score": 1,
                                            "created_utc": 1579109225.0,
                                            "replies": [
                                                {
                                                    "body": "Explain how they'd disagree.",
                                                    "author": "redditgrl1140",
                                                    "id": "feh9m84",
                                                    "parent_id": "t1_feh4xl1",
                                                    "score": 1,
                                                    "created_utc": 1579112012.0,
                                                    "replies": [
                                                        {
                                                            "body": "Because they have sugar babies on the side",
                                                            "author": null,
                                                            "id": "fehhrcw",
                                                            "parent_id": "t1_feh9m84",
                                                            "score": 1,
                                                            "created_utc": 1579116790.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "But over the years many of my sugar relationships have been monogamous (more so that some of the married F in my client's offices)",
                                    "author": "pinotandsugar",
                                    "id": "fehgw0z",
                                    "parent_id": "t1_fegoocu",
                                    "score": 0,
                                    "created_utc": 1579116283.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "fegreus",
                            "parent_id": "t1_fegmcd4",
                            "score": 4,
                            "created_utc": 1579100777.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "feh9bs6",
                                    "parent_id": "t1_fegreus",
                                    "score": -1,
                                    "created_utc": 1579111834.0,
                                    "replies": [
                                        {
                                            "body": "That is not the same as a sugar relationship.",
                                            "author": "kitten_ftw",
                                            "id": "fejcw5c",
                                            "parent_id": "t1_feh9bs6",
                                            "score": 1,
                                            "created_utc": 1579167752.0,
                                            "replies": [
                                                {
                                                    "body": "In your opinion, not mine!",
                                                    "author": "HwdSD",
                                                    "id": "fekl8v5",
                                                    "parent_id": "t1_fejcw5c",
                                                    "score": 2,
                                                    "created_utc": 1579202382.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "We both choose and a lot of us do both.",
                            "author": "kitten_ftw",
                            "id": "fejc7ok",
                            "parent_id": "t1_fegmcd4",
                            "score": 1,
                            "created_utc": 1579166720.0,
                            "replies": []
                        },
                        {
                            "body": "The wives and gfs argument is silly. Simply doesn't apply",
                            "author": "kitten_ftw",
                            "id": "fejc8pt",
                            "parent_id": "t1_fegmcd4",
                            "score": 1,
                            "created_utc": 1579166762.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I'm guessing you live in the UK or continental Europe. They have rodeos there?",
            "author": "The_Year_2525",
            "id": "fegxj9j",
            "parent_id": "t3_ep1hri",
            "score": 1,
            "created_utc": 1579104751.0,
            "replies": [
                {
                    "body": "The best",
                    "author": null,
                    "id": "fegz9aq",
                    "parent_id": "t1_fegxj9j",
                    "score": 1,
                    "created_utc": 1579105818.0,
                    "replies": [
                        {
                            "body": "Sorry, but the Calgary Stampede is the best... :P",
                            "author": "The_Year_2525",
                            "id": "feh1vmk",
                            "parent_id": "t1_fegz9aq",
                            "score": 1,
                            "created_utc": 1579107410.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "A sugaring is a bit different from escorting but still sex work. I agree that there are different types of sugar relationships. I just feel this sub puts down the ones where like in mine; there is a 28 year age difference. And I'm an older SB too! While there is mutual respect between us and we both share art - there is no sexual attraction on my part. I genuinely enjoy his company. He is pleasant and easy going. But he knows if the money were to stop, I'd stop coming by. And that's a perfectly acceptable sugar relationship) arrangement. I'm not using him anymore than he is using me. He could care less if I got another SD.",
            "author": "kitten_ftw",
            "id": "fejddnv",
            "parent_id": "t3_ep1hri",
            "score": 1,
            "created_utc": 1579168496.0,
            "replies": [
                {
                    "body": "Sounds like my main relationship as well! \nI wouldn't say that the sub itself puts down the more transactional relationships, it seems to be just certain users. Writing this post and reading all the comments made me realize how not-alone I am in this :)",
                    "author": null,
                    "id": "fejhjl2",
                    "parent_id": "t1_fejddnv",
                    "score": 2,
                    "created_utc": 1579174538.0,
                    "replies": [
                        {
                            "body": "Ditto!",
                            "author": "kitten_ftw",
                            "id": "fekhf7h",
                            "parent_id": "t1_fejhjl2",
                            "score": 1,
                            "created_utc": 1579200102.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "We actually had a discussion in my philosophy class about if sugaring was sex work (we talked about porn and it somehow ended there). \n\nSome say yes and some say no. This is the closest experience I have had with it all.\n\nTho I’m glad you seen comfortable/confident to say those things. \n\nAlso the entire system kinda reminds me of Norway haha, except sexwork is illegal here (sugaring is not).",
            "author": null,
            "id": "fgfl9ct",
            "parent_id": "t3_ep1hri",
            "score": 1,
            "created_utc": 1580741758.0,
            "replies": [
                {
                    "body": "One thing that sugaring has taught me, is that whatever youve heard about it is prpbably wrong\n\nI cant imagine discussing that subject with those who haven't tried it. At least i didn't consider it sex work before i tried it",
                    "author": null,
                    "id": "fgfly36",
                    "parent_id": "t1_fgfl9ct",
                    "score": 1,
                    "created_utc": 1580742250.0,
                    "replies": [
                        {
                            "body": "Yeah nah I don’t really take much of their things Into consideration what they said. I am getting into it and i have read a lot about it of course. \n\nTho I have talked to my friends about it who are positive to it. Mostly for my own safety reasons. \n\nBut yeah was honestly still a very interesting talk since most guys said yes it was and most girls said no it wasn’t.",
                            "author": null,
                            "id": "fgfm64r",
                            "parent_id": "t1_fgfly36",
                            "score": 2,
                            "created_utc": 1580742412.0,
                            "replies": [
                                {
                                    "body": "That's good!\nKnowing that my closest friends know about it makes me feel very safe. I send them my location if I ever feel iffy, and since they already know, it's easier to talk about it if something were to happen",
                                    "author": null,
                                    "id": "fgfmjea",
                                    "parent_id": "t1_fgfm64r",
                                    "score": 2,
                                    "created_utc": 1580742672.0,
                                    "replies": [
                                        {
                                            "body": "Yup! Same reason why I told mine. Sorry for replying earlier btw. Stay safe and take care!",
                                            "author": null,
                                            "id": "fghswvj",
                                            "parent_id": "t1_fgfmjea",
                                            "score": 1,
                                            "created_utc": 1580792925.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Skeptical hippo is skeptical based on the timing of this post from user who is part of subReddit which looks down upon members of this subreddit.",
            "author": null,
            "id": "feh0p1x",
            "parent_id": "t3_ep1hri",
            "score": 0,
            "created_utc": 1579106694.0,
            "replies": [
                {
                    "body": "Skeptical of... what though?",
                    "author": "MxMonstera",
                    "id": "feh39wu",
                    "parent_id": "t1_feh0p1x",
                    "score": 2,
                    "created_utc": 1579108248.0,
                    "replies": [
                        {
                            "body": "You going to play coy and not see this as an attempt to subtly tell other SBs that they are sex workers based on the recent drama?",
                            "author": null,
                            "id": "fehhj11",
                            "parent_id": "t1_feh39wu",
                            "score": 0,
                            "created_utc": 1579116656.0,
                            "replies": [
                                {
                                    "body": "Nah, not coy. I assume there is always an ongoing debate on “is sugar sex work??” but I’m unaware of a particularly recent flare up.\n\nAlso, I think the assumption that an entire sub looks down on another is pretty silly. Shit goes both ways, can we move on now?",
                                    "author": "MxMonstera",
                                    "id": "feho2g8",
                                    "parent_id": "t1_fehhj11",
                                    "score": 5,
                                    "created_utc": 1579120452.0,
                                    "replies": [
                                        {
                                            "body": "I don't even care and I might have been with some but I have not seen obsessively level of postings for the other subreddit out here compared to what you see over there.  If this was your moment of epiphany then it was better suited for that subreddit but to post this next day after all the drama makes me skeptical.",
                                            "author": null,
                                            "id": "fehprvu",
                                            "parent_id": "t1_feho2g8",
                                            "score": 0,
                                            "created_utc": 1579121436.0,
                                            "replies": [
                                                {
                                                    "body": "I'm not OP. No epiphany here. Like I said, shit goes both ways, it's stupid, can we move on now? Quit with the scarlet letter shit.",
                                                    "author": "MxMonstera",
                                                    "id": "fehukwy",
                                                    "parent_id": "t1_fehprvu",
                                                    "score": 4,
                                                    "created_utc": 1579124167.0,
                                                    "replies": []
                                                },
                                                {
                                                    "body": "What drama are you talking about? I have clearly missed out.",
                                                    "author": null,
                                                    "id": "feji9ub",
                                                    "parent_id": "t1_fehprvu",
                                                    "score": 1,
                                                    "created_utc": 1579175457.0,
                                                    "replies": [
                                                        {
                                                            "body": "I DM'ed you.",
                                                            "author": null,
                                                            "id": "fekd0b3",
                                                            "parent_id": "t1_feji9ub",
                                                            "score": 1,
                                                            "created_utc": 1579197476.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": " I'm part of r/shortcels as well, not sure what that makes me haha\n\nJk, I'm banned from the other sugar sub, but I'm still following it",
                    "author": null,
                    "id": "fehhz0r",
                    "parent_id": "t1_feh0p1x",
                    "score": 2,
                    "created_utc": 1579116916.0,
                    "replies": [
                        {
                            "body": "Ooh which sub is that?",
                            "author": "kitten_ftw",
                            "id": "fejd46a",
                            "parent_id": "t1_fehhz0r",
                            "score": 1,
                            "created_utc": 1579168089.0,
                            "replies": [
                                {
                                    "body": "It's like an incel sub, but everyone is under 5'4\"\nAnd the number one rule is to not discuss the undeniable facts that foids (women) discriminate men based on height. It's literally written in the subs bio lol",
                                    "author": null,
                                    "id": "fejhn2b",
                                    "parent_id": "t1_fejd46a",
                                    "score": 2,
                                    "created_utc": 1579174662.0,
                                    "replies": [
                                        {
                                            "body": "Oh lawd help me! Incels...i just can't",
                                            "author": "kitten_ftw",
                                            "id": "fekhmnl",
                                            "parent_id": "t1_fejhn2b",
                                            "score": 1,
                                            "created_utc": 1579200224.0,
                                            "replies": [
                                                {
                                                    "body": "It's super fun. I love the DM's they send. Do you know how many tumes I have received the exact message of \"you are LITERALLY a whore\"?\n\nLike duh. Is that supposed to phase me?",
                                                    "author": null,
                                                    "id": "fekin8q",
                                                    "parent_id": "t1_fekhmnl",
                                                    "score": 2,
                                                    "created_utc": 1579200833.0,
                                                    "replies": [
                                                        {
                                                            "body": "Lol🤣🤣 I'm going to have to check that one out",
                                                            "author": "kitten_ftw",
                                                            "id": "felzxaw",
                                                            "parent_id": "t1_fekin8q",
                                                            "score": 1,
                                                            "created_utc": 1579235360.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Wives are the most overpaid sex workers. They should always answer “Yes” to the last question",
            "author": "MarcusNJ",
            "id": "feinmr4",
            "parent_id": "t3_ep1hri",
            "score": 0,
            "created_utc": 1579142754.0,
            "replies": []
        },
        {
            "body": "You can say that you have had sex with someone who has bought sex. Take all the service you can get! :)",
            "author": null,
            "id": "fego4q8",
            "parent_id": "t1_fegnv3d",
            "score": 18,
            "created_utc": 1579098485.0,
            "replies": []
        },
        {
            "body": "If you were super concerned you could state you dated a sex worker. They likely won't believe you but it gives some cover.\n\nIt's important to tell them for additional high risk screenings.",
            "author": "Sweettooth_dragon",
            "id": "fegrx69",
            "parent_id": "t1_fegnv3d",
            "score": 17,
            "created_utc": 1579101121.0,
            "replies": [
                {
                    "body": "I said yes to \"had sex with someone who traded sex for money...\" and checked the box \"in my lifetime\" rather than \"this year.\" I got the same treatment as usual: blood and urine. No extra questions, counseling, or treatment so far.",
                    "author": "ArnoldArmadillo",
                    "id": "fehgg4u",
                    "parent_id": "t1_fegrx69",
                    "score": 6,
                    "created_utc": 1579116025.0,
                    "replies": [
                        {
                            "body": "I see. It's an interesting experiment though",
                            "author": null,
                            "id": "fehgzvx",
                            "parent_id": "t1_fehgg4u",
                            "score": 6,
                            "created_utc": 1579116346.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I have the same comment. Living in the US, I’m legitimately afraid of what would happen if I were ever assaulted by a POT.....since sex work is illegal I’d be scared to report 😔",
            "author": "BratinaHat",
            "id": "fegng0v",
            "parent_id": "t1_feghp5r",
            "score": 18,
            "created_utc": 1579097980.0,
            "replies": [
                {
                    "body": "Sex work isn’t illegal, prostitution is.  And you aren’t working as a prostitute. Not that it would mean you shouldn’t report, as rape is also illegal.\n\nBut in your case you aren’t breaking any law.",
                    "author": "WandererOfInterwebs",
                    "id": "fegr6rt",
                    "parent_id": "t1_fegng0v",
                    "score": 9,
                    "created_utc": 1579100620.0,
                    "replies": []
                },
                {
                    "body": "In most American cities you can be a sexworker  working on the streets and you are still going to get help with an assault .  Wasn't always that way but is, for the most part now.  Working the Hollywood Studio chiefs   well that's another matter.",
                    "author": "pinotandsugar",
                    "id": "fehf4ya",
                    "parent_id": "t1_fegng0v",
                    "score": 3,
                    "created_utc": 1579115257.0,
                    "replies": [
                        {
                            "body": "Do you have any sources to back that up?",
                            "author": "BratinaHat",
                            "id": "fehw7m9",
                            "parent_id": "t1_fehf4ya",
                            "score": 4,
                            "created_utc": 1579125091.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Those laws are even damaging to indie porn producers like myself. They were not written to protect women, they were written to protect the big traffickers.",
            "author": "Elvishgirl",
            "id": "fehubjo",
            "parent_id": "t1_feghp5r",
            "score": 6,
            "created_utc": 1579124018.0,
            "replies": [
                {
                    "body": "😔",
                    "author": "BratinaHat",
                    "id": "fehxsum",
                    "parent_id": "t1_fehubjo",
                    "score": 3,
                    "created_utc": 1579126009.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I’m so glad you addressed that. When I first read it, I thought of situations where a girl’s boyfriend was sleeping with multiple girls on the side so she’s been at risk more than most sugar relationships.",
            "author": "racejeff",
            "id": "fehbhk5",
            "parent_id": "t1_fegvy9v",
            "score": 8,
            "created_utc": 1579113134.0,
            "replies": []
        },
        {
            "body": "I would love any links you'd recommend on this.",
            "author": "_velvet_blue",
            "id": "fei7ojj",
            "parent_id": "t1_fehu8av",
            "score": 5,
            "created_utc": 1579132120.0,
            "replies": [
                {
                    "body": "Sexworkersonly is a great resource and sub...",
                    "author": "kitten_ftw",
                    "id": "fejdi4h",
                    "parent_id": "t1_fei7ojj",
                    "score": 3,
                    "created_utc": 1579168687.0,
                    "replies": [
                        {
                            "body": "Literally what I was going to say. \n\nReddit has a great base of sex workers. Some of the most talented and intelligent women ive met",
                            "author": "Elvishgirl",
                            "id": "fekrwuf",
                            "parent_id": "t1_fejdi4h",
                            "score": 3,
                            "created_utc": 1579206339.0,
                            "replies": [
                                {
                                    "body": "That's so cool that you've met them! I'm very grateful for Reddit",
                                    "author": "kitten_ftw",
                                    "id": "felyh34",
                                    "parent_id": "t1_fekrwuf",
                                    "score": 1,
                                    "created_utc": 1579234173.0,
                                    "replies": []
                                },
                                {
                                    "body": "Holy shit. Thank all of you who recommended this sub. This is quite literally some of the most emotionally intelligent dialogue I've ever read on the internet. I wish I'd found it sooner.",
                                    "author": "_velvet_blue",
                                    "id": "ffj6xga",
                                    "parent_id": "t1_fekrwuf",
                                    "score": 1,
                                    "created_utc": 1579991925.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "\"Revolting Prostitutes\" By Juno Mac and Molly Smith is an amazing book that discusses all the various laws and frameworks related to sex work in different areas of the world. Both authors are sex workers from the UK. It reads pretty academic because they have done a ton of research and cite all sorts of studies and statistics. Really fascinating and highly recommend!",
                    "author": "Altruistic-Yesterday",
                    "id": "ffb41g4",
                    "parent_id": "t1_fei7ojj",
                    "score": 2,
                    "created_utc": 1579751233.0,
                    "replies": [
                        {
                            "body": "Thank you! Will check it out.",
                            "author": "_velvet_blue",
                            "id": "ffdjalg",
                            "parent_id": "t1_ffb41g4",
                            "score": 2,
                            "created_utc": 1579822065.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "If I am receiving money and there is sex involved... and if there were no sex involved, I would not be receiving that money, then yes, I am doing sex work. And personally, I don’t feel there needs to be any shame in that.",
            "author": "RealEarthAngel",
            "id": "fehdkm9",
            "parent_id": "t1_fegnhh8",
            "score": 15,
            "created_utc": 1579114351.0,
            "replies": [
                {
                    "body": "> If I am receiving money and there is sex involved..\n\nIs that the definition of marriage  \n\na much better series of questions would be more than N  partners in the last 30 days,  any partners engaged in male homosexual acts, IV drug use",
                    "author": "pinotandsugar",
                    "id": "fehffwz",
                    "parent_id": "t1_fehdkm9",
                    "score": -1,
                    "created_utc": 1579115434.0,
                    "replies": [
                        {
                            "body": "No. There’s a lot more to marriage then there is to an arrangement.",
                            "author": "RealEarthAngel",
                            "id": "fehfthj",
                            "parent_id": "t1_fehffwz",
                            "score": 11,
                            "created_utc": 1579115657.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "What about the notion that sugaring is really an avocation, a hobby. Work is a vocation. Some would say a vocation is a calling, lots of wiggle room there. I am using the term vocation as a synonym for profession. Are there professional SBs?",
            "author": "ontherdagn",
            "id": "feh37du",
            "parent_id": "t1_fegnhh8",
            "score": 3,
            "created_utc": 1579108206.0,
            "replies": [
                {
                    "body": "As with most things in the sex trade, there is a lot of grey area here. Just because a SB isn't doing it as her full time career doesn't disqualify the activity from being classified as sex work. Yes, I would imagine most SB's do it part-time, if you want to use career based terminology, but its still a form of sex work.",
                    "author": "SD-ofNote",
                    "id": "feha066",
                    "parent_id": "t1_feh37du",
                    "score": 6,
                    "created_utc": 1579112246.0,
                    "replies": [
                        {
                            "body": "Unfortunately I spend more time driving than having sex  but I would never consider my profession to be driving",
                            "author": "pinotandsugar",
                            "id": "fehg2q1",
                            "parent_id": "t1_feha066",
                            "score": 2,
                            "created_utc": 1579115807.0,
                            "replies": [
                                {
                                    "body": "But you do have a government issued certificate that you are competent to drive.",
                                    "author": "ontherdagn",
                                    "id": "feiwaze",
                                    "parent_id": "t1_fehg2q1",
                                    "score": 1,
                                    "created_utc": 1579148965.0,
                                    "replies": [
                                        {
                                            "body": "FIA",
                                            "author": "pinotandsugar",
                                            "id": "feiwnql",
                                            "parent_id": "t1_feiwaze",
                                            "score": 1,
                                            "created_utc": 1579149251.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "Sugaring is sex work. Period.",
                                    "author": "kitten_ftw",
                                    "id": "fejbrlk",
                                    "parent_id": "t1_fehg2q1",
                                    "score": 1,
                                    "created_utc": 1579166046.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Typically they shoot you on site.\n\nC'mon.\n\nThey are asking to better be able to treat / advise you.\n\nIf you have multiple partners or engage in more risky behavior you will get a talk about condom use (and free condoms at most PPs), maybe an HPV vaccine recommendation (I got that!), maybe some talk about hepatitis.",
            "author": "marker3000",
            "id": "feh7t73",
            "parent_id": "t1_fegjpeu",
            "score": 8,
            "created_utc": 1579110933.0,
            "replies": []
        },
        {
            "body": "It sucks that we feel we have to lie. Bc you can't always tell someone's views.💕",
            "author": "kitten_ftw",
            "id": "felzux6",
            "parent_id": "t1_fegqghe",
            "score": 2,
            "created_utc": 1579235304.0,
            "replies": []
        },
        {
            "body": "I'm lucky to currently have a nurse practitioner who doesn't ask those questions. At my last well woman test, I asked her to test me for everything.   But when I used to go to planned Parenthood I remember all those questions you are talking about. Some Drs are very judgemental. I remember one from planned Parenthood insinuating that my job as a stripper at that time was causing me to worry about STDs. I was insulted bc I didn't have sex with the customers. And I ended up being diagnosed with BV. Not an STD. So I can only imagine what that woman would have said had I checked the box about sleeping with people for money. I'm lucky to have a very open minded NP but I have not told her or any Dr that I do SW. I'm also new to sugaring and escorting.",
            "author": "kitten_ftw",
            "id": "felzsas",
            "parent_id": "t1_fegqghe",
            "score": 1,
            "created_utc": 1579235242.0,
            "replies": []
        },
        {
            "body": "It's legal in my country, besides their medical journal is to be kept confidental even from my doctor! Which is greatttt",
            "author": null,
            "id": "feggq7o",
            "parent_id": "t1_fegfmqx",
            "score": 12,
            "created_utc": 1579092205.0,
            "replies": [
                {
                    "body": "Nice! Honestly, I like the US but they are lacking behind when it comes to rights for sex workers and women’s freedom of choice. Why can’t women make money with their body if that’s what she chooses? My friend got her social media taken down for putting too many bikini pics. Why does everything have to be so secretive and potentially dangerous? There too much ignorance and prejudice around  this  topic.",
                    "author": null,
                    "id": "fegjne3",
                    "parent_id": "t1_feggq7o",
                    "score": 10,
                    "created_utc": 1579094797.0,
                    "replies": [
                        {
                            "body": "USA is like a modern yet medieval",
                            "author": null,
                            "id": "fegk7iz",
                            "parent_id": "t1_fegjne3",
                            "score": 11,
                            "created_utc": 1579095261.0,
                            "replies": []
                        },
                        {
                            "body": "I have been in nearly every country in the world, not many are more prudish than the US.",
                            "author": null,
                            "id": "feikpnd",
                            "parent_id": "t1_fegjne3",
                            "score": 2,
                            "created_utc": 1579140787.0,
                            "replies": []
                        },
                        {
                            "body": "> rights for sex workers and women’s freedom of choice.\n\nBecause it also comes with \"and regulate it\", which means the sex worker can sue the government if anything happens to them.  The frivolous lawsuit system would need to be fixed first.",
                            "author": "scott7sd",
                            "id": "fegkxsb",
                            "parent_id": "t1_fegjne3",
                            "score": 3,
                            "created_utc": 1579095979.0,
                            "replies": [
                                {
                                    "body": "We have a lot to fix in the US and frivolous lawsuits is one of the biggest issues, but because lawyers are the primary beneficiaries and politicians are mostly lawyers don't expect that to change soon.  Most people have no idea of how much frivolous lawsuits, class action lawsuits and threat of lawsuits negatively impacts the daily life.  There is much to fix, but we have few if anyone in politics actually wanting to fix the issues.  They just want to blame the other political party for the problems.\n\n* Tort Reform\n* Prison Reform\n* Healthcare Reform\n* Education Reform\n* Legalize, regulate and tax drugs and prostitution\n* Tax reform\n* etc",
                                    "author": "willfromvb",
                                    "id": "fegui0r",
                                    "parent_id": "t1_fegkxsb",
                                    "score": 1,
                                    "created_utc": 1579102819.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "^this 💯%! Women should be able to do whatever they want with their bodies; and if a woman chooses to make money from her body and emotional labor, it should be accepted.",
                            "author": "kitten_ftw",
                            "id": "fek9ot7",
                            "parent_id": "t1_fegjne3",
                            "score": 1,
                            "created_utc": 1579195517.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Thank you!\nReading the comments here made me realize that a lot of people on this sub are totally cool woth the SW part. Maybe even proud :) I don't feel so weird about it anymore, even the incel in my inbox trying to \"your parents must be proud\"-me can't phase me lol",
            "author": null,
            "id": "feji5jz",
            "parent_id": "t1_fei92ln",
            "score": 2,
            "created_utc": 1579175311.0,
            "replies": [
                {
                    "body": "Yes I am finding that out too! I thought a lot of the people on here were anti sex work, but it's interesting to see that many don't have a problem with it",
                    "author": "kitten_ftw",
                    "id": "fekbntn",
                    "parent_id": "t1_feji5jz",
                    "score": 3,
                    "created_utc": 1579196677.0,
                    "replies": []
                },
                {
                    "body": "😂",
                    "author": "_velvet_blue",
                    "id": "feo20re",
                    "parent_id": "t1_feji5jz",
                    "score": 2,
                    "created_utc": 1579294111.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "But \"let's not make this transactional\"",
            "author": "anonymou555andWich",
            "id": "fegog3d",
            "parent_id": "t1_fegnvom",
            "score": 9,
            "created_utc": 1579098712.0,
            "replies": [
                {
                    "body": "But I as a POT SD will ask you 20 questions personal ones about your sexual preferences and request pics. Me: how do you feel about ppm, allowance or paid meet and greets. Him: transactional, blah blah blah I never pay for meet and greets. And I never pay under (names low amt) per ppm. I just want there to be a connection. This after asking me if I have ever squirted 😭😜🤣 \n\nBut I can't bring up money and get a real answer?!?",
                    "author": "kitten_ftw",
                    "id": "feizs75",
                    "parent_id": "t1_fegog3d",
                    "score": 3,
                    "created_utc": 1579151907.0,
                    "replies": [
                        {
                            "body": "I'm not like that I bring it up fairly quickly. \n\nI never pay for meets though.",
                            "author": "anonymou555andWich",
                            "id": "fejfj78",
                            "parent_id": "t1_feizs75",
                            "score": 2,
                            "created_utc": 1579171748.0,
                            "replies": [
                                {
                                    "body": "I think it's great that you bring it up quickly. Takes a lot of anxiety off the sb. At least for me!\n\nAs a SB I'm a fan of paid meet and greets. Where I live if it's a paid meet and greet, the standard amt isn't much but its a sweet guesture I appreciate 😊\n But it's not something I require. I only occasionally ask for it. Most times I don't bring it up. Certainly not a deal breaker, but it helps and makes me feel good/special ☺️",
                                    "author": "kitten_ftw",
                                    "id": "fekb1yt",
                                    "parent_id": "t1_fejfj78",
                                    "score": 2,
                                    "created_utc": 1579196320.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": ">It’s just sex work... \n\nI like this",
            "author": null,
            "id": "fehhjvh",
            "parent_id": "t1_fegnvom",
            "score": 3,
            "created_utc": 1579116669.0,
            "replies": [
                {
                    "body": "Yas!!!! Louder for the people in the back!",
                    "author": "kitten_ftw",
                    "id": "fejbva5",
                    "parent_id": "t1_fehhjvh",
                    "score": 2,
                    "created_utc": 1579166195.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "My goodness, can't sexwork just mean sexwork. Was Kinsey in sexwork? How about obstetrics, is that sex work. \"men use the word sexwoek to lower...\"  Really, some men perhaps but I don't. Maybe we should use the word professional, as in the oldest. I'm sure most consider the working girls at the Bunny Ranch to be professionals. Surely hardly any SB can be considered a professional. Sexwork is neither ameliorative or pejorative, unless sex is. That's our problem, too many individuals in our culture consider sex in a bad light. It just happens to be one of our primary motivations you dirty animals.",
            "author": "ontherdagn",
            "id": "feh4e4x",
            "parent_id": "t1_fegru38",
            "score": 2,
            "created_utc": 1579108906.0,
            "replies": [
                {
                    "body": "Sugaring is sex work. Being an obgyn is not.",
                    "author": "kitten_ftw",
                    "id": "feizz4r",
                    "parent_id": "t1_feh4e4x",
                    "score": 1,
                    "created_utc": 1579152076.0,
                    "replies": []
                },
                {
                    "body": "I agree",
                    "author": "kitten_ftw",
                    "id": "fekbbf1",
                    "parent_id": "t1_feh4e4x",
                    "score": 1,
                    "created_utc": 1579196474.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "You know men can be stay at home husbands and can also participate in being a sugar baby as well right? I’m a male sugar baby and make way more than any female sugar baby I know, and I don’t even participate in penetrative or give oral sex.",
            "author": null,
            "id": "fehd69k",
            "parent_id": "t1_fegru38",
            "score": 3,
            "created_utc": 1579114120.0,
            "replies": []
        },
        {
            "body": "I've heard about the situation in the states, and honestly, it sounds so horrible. I am really thankful for my options, and I hope you get the same opportunity.\n\nHonestly, USA seems to be so divided. You have this huge continent consisting of so many people woth differemt political views who have to abide by the same laws. It sounds impossible to please everyone! Why can't the anti-abortion people get the south, then those who want free healthcare take the north!\n\nI'm just kidding of course. But America is such a weird consept. But it sounds wonderful on other aspects!",
            "author": null,
            "id": "fei5hb1",
            "parent_id": "t1_fei3elr",
            "score": 2,
            "created_utc": 1579130715.0,
            "replies": []
        },
        {
            "body": "I don't think you know my situation enough to know what risk I'm at",
            "author": null,
            "id": "fegve34",
            "parent_id": "t1_fegoizv",
            "score": 8,
            "created_utc": 1579103390.0,
            "replies": [
                {
                    "body": "I don’t know you at all. Point is that being a sugar baby does not increase your risk versus vanilla dating.  The more risky your behavior, the more likely you are to get infected. STDs don’t judge you they infect you.",
                    "author": "ab1035",
                    "id": "fegwhut",
                    "parent_id": "t1_fegve34",
                    "score": 4,
                    "created_utc": 1579104090.0,
                    "replies": [
                        {
                            "body": "I get that. But risky behaviour often comes as part of the sugaring, as I believe I mention shortly. But yeah, I agree. Viruses don't care.",
                            "author": null,
                            "id": "fegwn8n",
                            "parent_id": "t1_fegwhut",
                            "score": 4,
                            "created_utc": 1579104185.0,
                            "replies": [
                                {
                                    "body": "I feel far more comfortable with an SB even if she has an IRL BF or another SD than hooking up with the typical  F Hollywood Club patron .",
                                    "author": "pinotandsugar",
                                    "id": "fehgcbz",
                                    "parent_id": "t1_fegwn8n",
                                    "score": 1,
                                    "created_utc": 1579115965.0,
                                    "replies": [
                                        {
                                            "body": "Lol🤣 🤣 🤣 sbs can be escorts too. Or are you saying u feel more comfortable hooking up with a SB than a woman you met at a bar or club? I'm confused.",
                                            "author": "kitten_ftw",
                                            "id": "fejc334",
                                            "parent_id": "t1_fehgcbz",
                                            "score": 1,
                                            "created_utc": 1579166523.0,
                                            "replies": [
                                                {
                                                    "body": "Typical Hollywood club you have a crowd that has a high level of non commercial or marginally commercial sexual activity,  drugs and frequently bi-sexual males intermixed.   A steady college student or single mother  SB even with two SD is likely to be a far lower risk",
                                                    "author": "pinotandsugar",
                                                    "id": "fekatzy",
                                                    "parent_id": "t1_fejc334",
                                                    "score": 1,
                                                    "created_utc": 1579196190.0,
                                                    "replies": [
                                                        {
                                                            "body": "I see your point. I've never been to Hollywood before. I always use condoms. I think a lot of SBs and escorts are more likely to use protection than your average party goer. But I feel uncomfortable, personally making assumptions about men that are bisexual. But as a young woman who loved to party, do drugs and went through a promiscuous phase; I wasn't very careful. I got lucky. Now as a SW I always use protection. I do agree that SBs are probably more aware of the dangers of unprotected sex",
                                                            "author": "kitten_ftw",
                                                            "id": "fem1ajw",
                                                            "parent_id": "t1_fekatzy",
                                                            "score": 1,
                                                            "created_utc": 1579236524.0,
                                                            "replies": [
                                                                {
                                                                    "body": "> assumptions about men that are bisexual\n\nsadly the stats don't lie",
                                                                    "author": "pinotandsugar",
                                                                    "id": "fem7mp0",
                                                                    "parent_id": "t1_fem1ajw",
                                                                    "score": 1,
                                                                    "created_utc": 1579242672.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "Bc SDs have multiple babies and babies have multiple daddies unless exclusivity is part of the arrangement 🙂",
                                    "author": "kitten_ftw",
                                    "id": "fejc4kp",
                                    "parent_id": "t1_fegwn8n",
                                    "score": 1,
                                    "created_utc": 1579166587.0,
                                    "replies": []
                                },
                                {
                                    "body": "Maybe we can agree that all sexual relations have risk. If one has more sexual partners due to being a SB than the risk goes up. Fair?",
                                    "author": "ab1035",
                                    "id": "fegxf8l",
                                    "parent_id": "t1_fegwn8n",
                                    "score": 0,
                                    "created_utc": 1579104682.0,
                                    "replies": [
                                        {
                                            "body": "Yes I agree",
                                            "author": null,
                                            "id": "fegzb6r",
                                            "parent_id": "t1_fegxf8l",
                                            "score": 3,
                                            "created_utc": 1579105851.0,
                                            "replies": [
                                                {
                                                    "body": "😀",
                                                    "author": "ab1035",
                                                    "id": "fegzeiu",
                                                    "parent_id": "t1_fegzb6r",
                                                    "score": 2,
                                                    "created_utc": 1579105908.0,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "body": "Fair but the risk is really associated with the pool from which they are plucked (M or F )",
                                            "author": "pinotandsugar",
                                            "id": "fehgfrg",
                                            "parent_id": "t1_fegxf8l",
                                            "score": 2,
                                            "created_utc": 1579116019.0,
                                            "replies": [
                                                {
                                                    "body": "True to an extent. But the sweet girl next door can also give you the clap.",
                                                    "author": "ab1035",
                                                    "id": "fehiaop",
                                                    "parent_id": "t1_fehgfrg",
                                                    "score": 2,
                                                    "created_utc": 1579117109.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Well then by that logic any sb not in a platonic relationship is a sex worker.",
            "author": "redditgrl1140",
            "id": "feglvee",
            "parent_id": "t1_fegkb7o",
            "score": 8,
            "created_utc": 1579096752.0,
            "replies": [
                {
                    "body": "I consider sugaring sex work just like camming, being a dominatrix (that may or may not actually have contacted with their clients genitals), phone sex for pay, etc. Sex work is a big umbrella term and I don't really get the stigma in this sub.",
                    "author": "brylikestrees",
                    "id": "fegnqha",
                    "parent_id": "t1_feglvee",
                    "score": 12,
                    "created_utc": 1579098194.0,
                    "replies": [
                        {
                            "body": "I don't either! This sub could be really cool if they would let go of the stigma!",
                            "author": "kitten_ftw",
                            "id": "fejc63r",
                            "parent_id": "t1_fegnqha",
                            "score": 1,
                            "created_utc": 1579166651.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Exactly.",
                    "author": "RealEarthAngel",
                    "id": "fehe28e",
                    "parent_id": "t1_feglvee",
                    "score": 2,
                    "created_utc": 1579114632.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "fegmcd4",
            "parent_id": "t1_fegkb7o",
            "score": -4,
            "created_utc": 1579097127.0,
            "replies": [
                {
                    "body": "> so are wives and girlfriends\n\nThe difference is the \"requirement \" for money. Most BFs and husbands contribute greatly to the support of their partners, but it is a voluntary contribution.",
                    "author": "GSSD",
                    "id": "fegnl8s",
                    "parent_id": "t1_fegmcd4",
                    "score": 6,
                    "created_utc": 1579098085.0,
                    "replies": [
                        {
                            "body": "^ this",
                            "author": "kitten_ftw",
                            "id": "fejc9df",
                            "parent_id": "t1_fegnl8s",
                            "score": 1,
                            "created_utc": 1579166789.0,
                            "replies": []
                        },
                        {
                            "body": "> but it is a voluntary contribution.\n\nLOL.  And what happens when the \"voluntary contribution\" doesn't happen such as on Valentine's day, birthday, anniversary, Christmas, Mother's day, etc?  Not so voluntary is it?",
                            "author": "scott7sd",
                            "id": "fegwigf",
                            "parent_id": "t1_fegnl8s",
                            "score": -2,
                            "created_utc": 1579104101.0,
                            "replies": [
                                {
                                    "body": "Bizarre. You are acting like a committed relationship is like a sugar relationship... and it's not. I don't wanna break it to ya but folks generally don't choose their partners solely for their ability to financially compensate them. \n\nA sugar relationship is literally 100% about someones ability to financially compensate someone for their time and company because if you can't pay then you aren't playing.",
                                    "author": "MxMonstera",
                                    "id": "feh3qzf",
                                    "parent_id": "t1_fegwigf",
                                    "score": 7,
                                    "created_utc": 1579108527.0,
                                    "replies": [
                                        {
                                            "body": ">A sugar relationship is literally 100% about someones ability to financially compensate someone for their time and company\n\nHow many SBs would accept a sugar relationship with Brad Pitt that involved zero financial compensation and only involved \"the experience\"?",
                                            "author": "scott7sd",
                                            "id": "feh6gxe",
                                            "parent_id": "t1_feh3qzf",
                                            "score": 0,
                                            "created_utc": 1579110144.0,
                                            "replies": [
                                                {
                                                    "body": "If you want financial compensation in exchange for intercourse or time spent, sugar is for you. \n\nIf you want a relationship between equals based upon mutual attraction and compatibility without a primary financial focus, then go for regular dating. \n\nIf they were the same thing, we wouldn't have made up a term for sugaring. They are two different things. Stop deluding yourself.",
                                                    "author": "MxMonstera",
                                                    "id": "feh8gpb",
                                                    "parent_id": "t1_feh6gxe",
                                                    "score": 3,
                                                    "created_utc": 1579111314.0,
                                                    "replies": [
                                                        {
                                                            "body": "> If you want financial compensation in exchange for intercourse and time spent, sugar relationship is for you. \n\nThen what is escorting if, as you said, f they were the same thing, we wouldn't have made up a term for sugaring.",
                                                            "author": "scott7sd",
                                                            "id": "feha8ew",
                                                            "parent_id": "t1_feh8gpb",
                                                            "score": 0,
                                                            "created_utc": 1579112384.0,
                                                            "replies": [
                                                                {
                                                                    "body": "If you need more explaining, I suggest you use google or pay me for my time. Peace.",
                                                                    "author": "MxMonstera",
                                                                    "id": "fehedf1",
                                                                    "parent_id": "t1_feha8ew",
                                                                    "score": 10,
                                                                    "created_utc": 1579114811.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "body": "It would not be a sugar relationship. It would be dating Brad Pitt",
                                                    "author": "kitten_ftw",
                                                    "id": "fejccvm",
                                                    "parent_id": "t1_feh6gxe",
                                                    "score": 1,
                                                    "created_utc": 1579166937.0,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "body": ">Bizarre. You are acting like a committed relationship is like a sugar relationship... and it's not.\n\nNo, I am saying that sugar relationships can be closer to a committed relationship than it is to escort because a sugar relationship is what you make it out to be.",
                                            "author": "scott7sd",
                                            "id": "feh6ls0",
                                            "parent_id": "t1_feh3qzf",
                                            "score": -1,
                                            "created_utc": 1579110225.0,
                                            "replies": [
                                                {
                                                    "body": "You are saying that you feel comfortable twisting reality to suit your definitions. And I'm saying \"nah, that's not cool\" \n\nTransactional arrangements = escorting, sugaring, sex work, etc. \n\nThere's not a damn thing wrong with transactional arrangements so long as you are honest with yourself and the other person.  Regular dating isn't transactional. Or if it is, you should reevaluate your relationship ;p",
                                                    "author": "MxMonstera",
                                                    "id": "feh8oip",
                                                    "parent_id": "t1_feh6ls0",
                                                    "score": 4,
                                                    "created_utc": 1579111445.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "Well expectations and requirement are two different things.",
                                    "author": "GSSD",
                                    "id": "fegy4mu",
                                    "parent_id": "t1_fegwigf",
                                    "score": 1,
                                    "created_utc": 1579105120.0,
                                    "replies": []
                                },
                                {
                                    "body": "Yes it is. You can choose whether to exchange gifts on those holidays ot not. Or the husband and wife can argue over it but that is not a sugar arrangement",
                                    "author": "kitten_ftw",
                                    "id": "fejcbit",
                                    "parent_id": "t1_fegwigf",
                                    "score": 1,
                                    "created_utc": 1579166880.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "escorts can choose who they sleep with as much as SBs....",
                    "author": "sacredsslut",
                    "id": "feh43f4",
                    "parent_id": "t1_fegmcd4",
                    "score": 7,
                    "created_utc": 1579108730.0,
                    "replies": []
                },
                {
                    "body": "I know a couple escorts. They definitely chose their clients. The more experienced one is pretty choosy, in fact 🤷‍♀️",
                    "author": "BratinaHat",
                    "id": "fegnkba",
                    "parent_id": "t1_fegmcd4",
                    "score": 6,
                    "created_utc": 1579098065.0,
                    "replies": []
                },
                {
                    "body": "Hmmm... Because wives do not contribute to the household? This logic is ridiculous because many women make more  than their husbands. And it's s monagamous love relationship. It's completely different from sugaring or any sex work.",
                    "author": "redditgrl1140",
                    "id": "fegoocu",
                    "parent_id": "t1_fegmcd4",
                    "score": 5,
                    "created_utc": 1579098877.0,
                    "replies": [
                        {
                            "body": "> And it's s monagamous love relationship \n\nSeems like many of the married SDs would disagree with this.",
                            "author": "scott7sd",
                            "id": "fegwoyx",
                            "parent_id": "t1_fegoocu",
                            "score": 1,
                            "created_utc": 1579104215.0,
                            "replies": [
                                {
                                    "body": "Yep",
                                    "author": "ontherdagn",
                                    "id": "feh4xl1",
                                    "parent_id": "t1_fegwoyx",
                                    "score": 1,
                                    "created_utc": 1579109225.0,
                                    "replies": [
                                        {
                                            "body": "Explain how they'd disagree.",
                                            "author": "redditgrl1140",
                                            "id": "feh9m84",
                                            "parent_id": "t1_feh4xl1",
                                            "score": 1,
                                            "created_utc": 1579112012.0,
                                            "replies": [
                                                {
                                                    "body": "Because they have sugar babies on the side",
                                                    "author": null,
                                                    "id": "fehhrcw",
                                                    "parent_id": "t1_feh9m84",
                                                    "score": 1,
                                                    "created_utc": 1579116790.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "But over the years many of my sugar relationships have been monogamous (more so that some of the married F in my client's offices)",
                            "author": "pinotandsugar",
                            "id": "fehgw0z",
                            "parent_id": "t1_fegoocu",
                            "score": 0,
                            "created_utc": 1579116283.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "fegreus",
                    "parent_id": "t1_fegmcd4",
                    "score": 4,
                    "created_utc": 1579100777.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "feh9bs6",
                            "parent_id": "t1_fegreus",
                            "score": -1,
                            "created_utc": 1579111834.0,
                            "replies": [
                                {
                                    "body": "That is not the same as a sugar relationship.",
                                    "author": "kitten_ftw",
                                    "id": "fejcw5c",
                                    "parent_id": "t1_feh9bs6",
                                    "score": 1,
                                    "created_utc": 1579167752.0,
                                    "replies": [
                                        {
                                            "body": "In your opinion, not mine!",
                                            "author": "HwdSD",
                                            "id": "fekl8v5",
                                            "parent_id": "t1_fejcw5c",
                                            "score": 2,
                                            "created_utc": 1579202382.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "We both choose and a lot of us do both.",
                    "author": "kitten_ftw",
                    "id": "fejc7ok",
                    "parent_id": "t1_fegmcd4",
                    "score": 1,
                    "created_utc": 1579166720.0,
                    "replies": []
                },
                {
                    "body": "The wives and gfs argument is silly. Simply doesn't apply",
                    "author": "kitten_ftw",
                    "id": "fejc8pt",
                    "parent_id": "t1_fegmcd4",
                    "score": 1,
                    "created_utc": 1579166762.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "The best",
            "author": null,
            "id": "fegz9aq",
            "parent_id": "t1_fegxj9j",
            "score": 1,
            "created_utc": 1579105818.0,
            "replies": [
                {
                    "body": "Sorry, but the Calgary Stampede is the best... :P",
                    "author": "The_Year_2525",
                    "id": "feh1vmk",
                    "parent_id": "t1_fegz9aq",
                    "score": 1,
                    "created_utc": 1579107410.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Sounds like my main relationship as well! \nI wouldn't say that the sub itself puts down the more transactional relationships, it seems to be just certain users. Writing this post and reading all the comments made me realize how not-alone I am in this :)",
            "author": null,
            "id": "fejhjl2",
            "parent_id": "t1_fejddnv",
            "score": 2,
            "created_utc": 1579174538.0,
            "replies": [
                {
                    "body": "Ditto!",
                    "author": "kitten_ftw",
                    "id": "fekhf7h",
                    "parent_id": "t1_fejhjl2",
                    "score": 1,
                    "created_utc": 1579200102.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "One thing that sugaring has taught me, is that whatever youve heard about it is prpbably wrong\n\nI cant imagine discussing that subject with those who haven't tried it. At least i didn't consider it sex work before i tried it",
            "author": null,
            "id": "fgfly36",
            "parent_id": "t1_fgfl9ct",
            "score": 1,
            "created_utc": 1580742250.0,
            "replies": [
                {
                    "body": "Yeah nah I don’t really take much of their things Into consideration what they said. I am getting into it and i have read a lot about it of course. \n\nTho I have talked to my friends about it who are positive to it. Mostly for my own safety reasons. \n\nBut yeah was honestly still a very interesting talk since most guys said yes it was and most girls said no it wasn’t.",
                    "author": null,
                    "id": "fgfm64r",
                    "parent_id": "t1_fgfly36",
                    "score": 2,
                    "created_utc": 1580742412.0,
                    "replies": [
                        {
                            "body": "That's good!\nKnowing that my closest friends know about it makes me feel very safe. I send them my location if I ever feel iffy, and since they already know, it's easier to talk about it if something were to happen",
                            "author": null,
                            "id": "fgfmjea",
                            "parent_id": "t1_fgfm64r",
                            "score": 2,
                            "created_utc": 1580742672.0,
                            "replies": [
                                {
                                    "body": "Yup! Same reason why I told mine. Sorry for replying earlier btw. Stay safe and take care!",
                                    "author": null,
                                    "id": "fghswvj",
                                    "parent_id": "t1_fgfmjea",
                                    "score": 1,
                                    "created_utc": 1580792925.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Skeptical of... what though?",
            "author": "MxMonstera",
            "id": "feh39wu",
            "parent_id": "t1_feh0p1x",
            "score": 2,
            "created_utc": 1579108248.0,
            "replies": [
                {
                    "body": "You going to play coy and not see this as an attempt to subtly tell other SBs that they are sex workers based on the recent drama?",
                    "author": null,
                    "id": "fehhj11",
                    "parent_id": "t1_feh39wu",
                    "score": 0,
                    "created_utc": 1579116656.0,
                    "replies": [
                        {
                            "body": "Nah, not coy. I assume there is always an ongoing debate on “is sugar sex work??” but I’m unaware of a particularly recent flare up.\n\nAlso, I think the assumption that an entire sub looks down on another is pretty silly. Shit goes both ways, can we move on now?",
                            "author": "MxMonstera",
                            "id": "feho2g8",
                            "parent_id": "t1_fehhj11",
                            "score": 5,
                            "created_utc": 1579120452.0,
                            "replies": [
                                {
                                    "body": "I don't even care and I might have been with some but I have not seen obsessively level of postings for the other subreddit out here compared to what you see over there.  If this was your moment of epiphany then it was better suited for that subreddit but to post this next day after all the drama makes me skeptical.",
                                    "author": null,
                                    "id": "fehprvu",
                                    "parent_id": "t1_feho2g8",
                                    "score": 0,
                                    "created_utc": 1579121436.0,
                                    "replies": [
                                        {
                                            "body": "I'm not OP. No epiphany here. Like I said, shit goes both ways, it's stupid, can we move on now? Quit with the scarlet letter shit.",
                                            "author": "MxMonstera",
                                            "id": "fehukwy",
                                            "parent_id": "t1_fehprvu",
                                            "score": 4,
                                            "created_utc": 1579124167.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "What drama are you talking about? I have clearly missed out.",
                                            "author": null,
                                            "id": "feji9ub",
                                            "parent_id": "t1_fehprvu",
                                            "score": 1,
                                            "created_utc": 1579175457.0,
                                            "replies": [
                                                {
                                                    "body": "I DM'ed you.",
                                                    "author": null,
                                                    "id": "fekd0b3",
                                                    "parent_id": "t1_feji9ub",
                                                    "score": 1,
                                                    "created_utc": 1579197476.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": " I'm part of r/shortcels as well, not sure what that makes me haha\n\nJk, I'm banned from the other sugar sub, but I'm still following it",
            "author": null,
            "id": "fehhz0r",
            "parent_id": "t1_feh0p1x",
            "score": 2,
            "created_utc": 1579116916.0,
            "replies": [
                {
                    "body": "Ooh which sub is that?",
                    "author": "kitten_ftw",
                    "id": "fejd46a",
                    "parent_id": "t1_fehhz0r",
                    "score": 1,
                    "created_utc": 1579168089.0,
                    "replies": [
                        {
                            "body": "It's like an incel sub, but everyone is under 5'4\"\nAnd the number one rule is to not discuss the undeniable facts that foids (women) discriminate men based on height. It's literally written in the subs bio lol",
                            "author": null,
                            "id": "fejhn2b",
                            "parent_id": "t1_fejd46a",
                            "score": 2,
                            "created_utc": 1579174662.0,
                            "replies": [
                                {
                                    "body": "Oh lawd help me! Incels...i just can't",
                                    "author": "kitten_ftw",
                                    "id": "fekhmnl",
                                    "parent_id": "t1_fejhn2b",
                                    "score": 1,
                                    "created_utc": 1579200224.0,
                                    "replies": [
                                        {
                                            "body": "It's super fun. I love the DM's they send. Do you know how many tumes I have received the exact message of \"you are LITERALLY a whore\"?\n\nLike duh. Is that supposed to phase me?",
                                            "author": null,
                                            "id": "fekin8q",
                                            "parent_id": "t1_fekhmnl",
                                            "score": 2,
                                            "created_utc": 1579200833.0,
                                            "replies": [
                                                {
                                                    "body": "Lol🤣🤣 I'm going to have to check that one out",
                                                    "author": "kitten_ftw",
                                                    "id": "felzxaw",
                                                    "parent_id": "t1_fekin8q",
                                                    "score": 1,
                                                    "created_utc": 1579235360.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I said yes to \"had sex with someone who traded sex for money...\" and checked the box \"in my lifetime\" rather than \"this year.\" I got the same treatment as usual: blood and urine. No extra questions, counseling, or treatment so far.",
            "author": "ArnoldArmadillo",
            "id": "fehgg4u",
            "parent_id": "t1_fegrx69",
            "score": 6,
            "created_utc": 1579116025.0,
            "replies": [
                {
                    "body": "I see. It's an interesting experiment though",
                    "author": null,
                    "id": "fehgzvx",
                    "parent_id": "t1_fehgg4u",
                    "score": 6,
                    "created_utc": 1579116346.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Sex work isn’t illegal, prostitution is.  And you aren’t working as a prostitute. Not that it would mean you shouldn’t report, as rape is also illegal.\n\nBut in your case you aren’t breaking any law.",
            "author": "WandererOfInterwebs",
            "id": "fegr6rt",
            "parent_id": "t1_fegng0v",
            "score": 9,
            "created_utc": 1579100620.0,
            "replies": []
        },
        {
            "body": "In most American cities you can be a sexworker  working on the streets and you are still going to get help with an assault .  Wasn't always that way but is, for the most part now.  Working the Hollywood Studio chiefs   well that's another matter.",
            "author": "pinotandsugar",
            "id": "fehf4ya",
            "parent_id": "t1_fegng0v",
            "score": 3,
            "created_utc": 1579115257.0,
            "replies": [
                {
                    "body": "Do you have any sources to back that up?",
                    "author": "BratinaHat",
                    "id": "fehw7m9",
                    "parent_id": "t1_fehf4ya",
                    "score": 4,
                    "created_utc": 1579125091.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "😔",
            "author": "BratinaHat",
            "id": "fehxsum",
            "parent_id": "t1_fehubjo",
            "score": 3,
            "created_utc": 1579126009.0,
            "replies": []
        },
        {
            "body": "Sexworkersonly is a great resource and sub...",
            "author": "kitten_ftw",
            "id": "fejdi4h",
            "parent_id": "t1_fei7ojj",
            "score": 3,
            "created_utc": 1579168687.0,
            "replies": [
                {
                    "body": "Literally what I was going to say. \n\nReddit has a great base of sex workers. Some of the most talented and intelligent women ive met",
                    "author": "Elvishgirl",
                    "id": "fekrwuf",
                    "parent_id": "t1_fejdi4h",
                    "score": 3,
                    "created_utc": 1579206339.0,
                    "replies": [
                        {
                            "body": "That's so cool that you've met them! I'm very grateful for Reddit",
                            "author": "kitten_ftw",
                            "id": "felyh34",
                            "parent_id": "t1_fekrwuf",
                            "score": 1,
                            "created_utc": 1579234173.0,
                            "replies": []
                        },
                        {
                            "body": "Holy shit. Thank all of you who recommended this sub. This is quite literally some of the most emotionally intelligent dialogue I've ever read on the internet. I wish I'd found it sooner.",
                            "author": "_velvet_blue",
                            "id": "ffj6xga",
                            "parent_id": "t1_fekrwuf",
                            "score": 1,
                            "created_utc": 1579991925.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "\"Revolting Prostitutes\" By Juno Mac and Molly Smith is an amazing book that discusses all the various laws and frameworks related to sex work in different areas of the world. Both authors are sex workers from the UK. It reads pretty academic because they have done a ton of research and cite all sorts of studies and statistics. Really fascinating and highly recommend!",
            "author": "Altruistic-Yesterday",
            "id": "ffb41g4",
            "parent_id": "t1_fei7ojj",
            "score": 2,
            "created_utc": 1579751233.0,
            "replies": [
                {
                    "body": "Thank you! Will check it out.",
                    "author": "_velvet_blue",
                    "id": "ffdjalg",
                    "parent_id": "t1_ffb41g4",
                    "score": 2,
                    "created_utc": 1579822065.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "> If I am receiving money and there is sex involved..\n\nIs that the definition of marriage  \n\na much better series of questions would be more than N  partners in the last 30 days,  any partners engaged in male homosexual acts, IV drug use",
            "author": "pinotandsugar",
            "id": "fehffwz",
            "parent_id": "t1_fehdkm9",
            "score": -1,
            "created_utc": 1579115434.0,
            "replies": [
                {
                    "body": "No. There’s a lot more to marriage then there is to an arrangement.",
                    "author": "RealEarthAngel",
                    "id": "fehfthj",
                    "parent_id": "t1_fehffwz",
                    "score": 11,
                    "created_utc": 1579115657.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "As with most things in the sex trade, there is a lot of grey area here. Just because a SB isn't doing it as her full time career doesn't disqualify the activity from being classified as sex work. Yes, I would imagine most SB's do it part-time, if you want to use career based terminology, but its still a form of sex work.",
            "author": "SD-ofNote",
            "id": "feha066",
            "parent_id": "t1_feh37du",
            "score": 6,
            "created_utc": 1579112246.0,
            "replies": [
                {
                    "body": "Unfortunately I spend more time driving than having sex  but I would never consider my profession to be driving",
                    "author": "pinotandsugar",
                    "id": "fehg2q1",
                    "parent_id": "t1_feha066",
                    "score": 2,
                    "created_utc": 1579115807.0,
                    "replies": [
                        {
                            "body": "But you do have a government issued certificate that you are competent to drive.",
                            "author": "ontherdagn",
                            "id": "feiwaze",
                            "parent_id": "t1_fehg2q1",
                            "score": 1,
                            "created_utc": 1579148965.0,
                            "replies": [
                                {
                                    "body": "FIA",
                                    "author": "pinotandsugar",
                                    "id": "feiwnql",
                                    "parent_id": "t1_feiwaze",
                                    "score": 1,
                                    "created_utc": 1579149251.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "Sugaring is sex work. Period.",
                            "author": "kitten_ftw",
                            "id": "fejbrlk",
                            "parent_id": "t1_fehg2q1",
                            "score": 1,
                            "created_utc": 1579166046.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Nice! Honestly, I like the US but they are lacking behind when it comes to rights for sex workers and women’s freedom of choice. Why can’t women make money with their body if that’s what she chooses? My friend got her social media taken down for putting too many bikini pics. Why does everything have to be so secretive and potentially dangerous? There too much ignorance and prejudice around  this  topic.",
            "author": null,
            "id": "fegjne3",
            "parent_id": "t1_feggq7o",
            "score": 10,
            "created_utc": 1579094797.0,
            "replies": [
                {
                    "body": "USA is like a modern yet medieval",
                    "author": null,
                    "id": "fegk7iz",
                    "parent_id": "t1_fegjne3",
                    "score": 11,
                    "created_utc": 1579095261.0,
                    "replies": []
                },
                {
                    "body": "I have been in nearly every country in the world, not many are more prudish than the US.",
                    "author": null,
                    "id": "feikpnd",
                    "parent_id": "t1_fegjne3",
                    "score": 2,
                    "created_utc": 1579140787.0,
                    "replies": []
                },
                {
                    "body": "> rights for sex workers and women’s freedom of choice.\n\nBecause it also comes with \"and regulate it\", which means the sex worker can sue the government if anything happens to them.  The frivolous lawsuit system would need to be fixed first.",
                    "author": "scott7sd",
                    "id": "fegkxsb",
                    "parent_id": "t1_fegjne3",
                    "score": 3,
                    "created_utc": 1579095979.0,
                    "replies": [
                        {
                            "body": "We have a lot to fix in the US and frivolous lawsuits is one of the biggest issues, but because lawyers are the primary beneficiaries and politicians are mostly lawyers don't expect that to change soon.  Most people have no idea of how much frivolous lawsuits, class action lawsuits and threat of lawsuits negatively impacts the daily life.  There is much to fix, but we have few if anyone in politics actually wanting to fix the issues.  They just want to blame the other political party for the problems.\n\n* Tort Reform\n* Prison Reform\n* Healthcare Reform\n* Education Reform\n* Legalize, regulate and tax drugs and prostitution\n* Tax reform\n* etc",
                            "author": "willfromvb",
                            "id": "fegui0r",
                            "parent_id": "t1_fegkxsb",
                            "score": 1,
                            "created_utc": 1579102819.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "^this 💯%! Women should be able to do whatever they want with their bodies; and if a woman chooses to make money from her body and emotional labor, it should be accepted.",
                    "author": "kitten_ftw",
                    "id": "fek9ot7",
                    "parent_id": "t1_fegjne3",
                    "score": 1,
                    "created_utc": 1579195517.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Yes I am finding that out too! I thought a lot of the people on here were anti sex work, but it's interesting to see that many don't have a problem with it",
            "author": "kitten_ftw",
            "id": "fekbntn",
            "parent_id": "t1_feji5jz",
            "score": 3,
            "created_utc": 1579196677.0,
            "replies": []
        },
        {
            "body": "😂",
            "author": "_velvet_blue",
            "id": "feo20re",
            "parent_id": "t1_feji5jz",
            "score": 2,
            "created_utc": 1579294111.0,
            "replies": []
        },
        {
            "body": "But I as a POT SD will ask you 20 questions personal ones about your sexual preferences and request pics. Me: how do you feel about ppm, allowance or paid meet and greets. Him: transactional, blah blah blah I never pay for meet and greets. And I never pay under (names low amt) per ppm. I just want there to be a connection. This after asking me if I have ever squirted 😭😜🤣 \n\nBut I can't bring up money and get a real answer?!?",
            "author": "kitten_ftw",
            "id": "feizs75",
            "parent_id": "t1_fegog3d",
            "score": 3,
            "created_utc": 1579151907.0,
            "replies": [
                {
                    "body": "I'm not like that I bring it up fairly quickly. \n\nI never pay for meets though.",
                    "author": "anonymou555andWich",
                    "id": "fejfj78",
                    "parent_id": "t1_feizs75",
                    "score": 2,
                    "created_utc": 1579171748.0,
                    "replies": [
                        {
                            "body": "I think it's great that you bring it up quickly. Takes a lot of anxiety off the sb. At least for me!\n\nAs a SB I'm a fan of paid meet and greets. Where I live if it's a paid meet and greet, the standard amt isn't much but its a sweet guesture I appreciate 😊\n But it's not something I require. I only occasionally ask for it. Most times I don't bring it up. Certainly not a deal breaker, but it helps and makes me feel good/special ☺️",
                            "author": "kitten_ftw",
                            "id": "fekb1yt",
                            "parent_id": "t1_fejfj78",
                            "score": 2,
                            "created_utc": 1579196320.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Yas!!!! Louder for the people in the back!",
            "author": "kitten_ftw",
            "id": "fejbva5",
            "parent_id": "t1_fehhjvh",
            "score": 2,
            "created_utc": 1579166195.0,
            "replies": []
        },
        {
            "body": "Sugaring is sex work. Being an obgyn is not.",
            "author": "kitten_ftw",
            "id": "feizz4r",
            "parent_id": "t1_feh4e4x",
            "score": 1,
            "created_utc": 1579152076.0,
            "replies": []
        },
        {
            "body": "I agree",
            "author": "kitten_ftw",
            "id": "fekbbf1",
            "parent_id": "t1_feh4e4x",
            "score": 1,
            "created_utc": 1579196474.0,
            "replies": []
        },
        {
            "body": "I don’t know you at all. Point is that being a sugar baby does not increase your risk versus vanilla dating.  The more risky your behavior, the more likely you are to get infected. STDs don’t judge you they infect you.",
            "author": "ab1035",
            "id": "fegwhut",
            "parent_id": "t1_fegve34",
            "score": 4,
            "created_utc": 1579104090.0,
            "replies": [
                {
                    "body": "I get that. But risky behaviour often comes as part of the sugaring, as I believe I mention shortly. But yeah, I agree. Viruses don't care.",
                    "author": null,
                    "id": "fegwn8n",
                    "parent_id": "t1_fegwhut",
                    "score": 4,
                    "created_utc": 1579104185.0,
                    "replies": [
                        {
                            "body": "I feel far more comfortable with an SB even if she has an IRL BF or another SD than hooking up with the typical  F Hollywood Club patron .",
                            "author": "pinotandsugar",
                            "id": "fehgcbz",
                            "parent_id": "t1_fegwn8n",
                            "score": 1,
                            "created_utc": 1579115965.0,
                            "replies": [
                                {
                                    "body": "Lol🤣 🤣 🤣 sbs can be escorts too. Or are you saying u feel more comfortable hooking up with a SB than a woman you met at a bar or club? I'm confused.",
                                    "author": "kitten_ftw",
                                    "id": "fejc334",
                                    "parent_id": "t1_fehgcbz",
                                    "score": 1,
                                    "created_utc": 1579166523.0,
                                    "replies": [
                                        {
                                            "body": "Typical Hollywood club you have a crowd that has a high level of non commercial or marginally commercial sexual activity,  drugs and frequently bi-sexual males intermixed.   A steady college student or single mother  SB even with two SD is likely to be a far lower risk",
                                            "author": "pinotandsugar",
                                            "id": "fekatzy",
                                            "parent_id": "t1_fejc334",
                                            "score": 1,
                                            "created_utc": 1579196190.0,
                                            "replies": [
                                                {
                                                    "body": "I see your point. I've never been to Hollywood before. I always use condoms. I think a lot of SBs and escorts are more likely to use protection than your average party goer. But I feel uncomfortable, personally making assumptions about men that are bisexual. But as a young woman who loved to party, do drugs and went through a promiscuous phase; I wasn't very careful. I got lucky. Now as a SW I always use protection. I do agree that SBs are probably more aware of the dangers of unprotected sex",
                                                    "author": "kitten_ftw",
                                                    "id": "fem1ajw",
                                                    "parent_id": "t1_fekatzy",
                                                    "score": 1,
                                                    "created_utc": 1579236524.0,
                                                    "replies": [
                                                        {
                                                            "body": "> assumptions about men that are bisexual\n\nsadly the stats don't lie",
                                                            "author": "pinotandsugar",
                                                            "id": "fem7mp0",
                                                            "parent_id": "t1_fem1ajw",
                                                            "score": 1,
                                                            "created_utc": 1579242672.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "Bc SDs have multiple babies and babies have multiple daddies unless exclusivity is part of the arrangement 🙂",
                            "author": "kitten_ftw",
                            "id": "fejc4kp",
                            "parent_id": "t1_fegwn8n",
                            "score": 1,
                            "created_utc": 1579166587.0,
                            "replies": []
                        },
                        {
                            "body": "Maybe we can agree that all sexual relations have risk. If one has more sexual partners due to being a SB than the risk goes up. Fair?",
                            "author": "ab1035",
                            "id": "fegxf8l",
                            "parent_id": "t1_fegwn8n",
                            "score": 0,
                            "created_utc": 1579104682.0,
                            "replies": [
                                {
                                    "body": "Yes I agree",
                                    "author": null,
                                    "id": "fegzb6r",
                                    "parent_id": "t1_fegxf8l",
                                    "score": 3,
                                    "created_utc": 1579105851.0,
                                    "replies": [
                                        {
                                            "body": "😀",
                                            "author": "ab1035",
                                            "id": "fegzeiu",
                                            "parent_id": "t1_fegzb6r",
                                            "score": 2,
                                            "created_utc": 1579105908.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "Fair but the risk is really associated with the pool from which they are plucked (M or F )",
                                    "author": "pinotandsugar",
                                    "id": "fehgfrg",
                                    "parent_id": "t1_fegxf8l",
                                    "score": 2,
                                    "created_utc": 1579116019.0,
                                    "replies": [
                                        {
                                            "body": "True to an extent. But the sweet girl next door can also give you the clap.",
                                            "author": "ab1035",
                                            "id": "fehiaop",
                                            "parent_id": "t1_fehgfrg",
                                            "score": 2,
                                            "created_utc": 1579117109.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I consider sugaring sex work just like camming, being a dominatrix (that may or may not actually have contacted with their clients genitals), phone sex for pay, etc. Sex work is a big umbrella term and I don't really get the stigma in this sub.",
            "author": "brylikestrees",
            "id": "fegnqha",
            "parent_id": "t1_feglvee",
            "score": 12,
            "created_utc": 1579098194.0,
            "replies": [
                {
                    "body": "I don't either! This sub could be really cool if they would let go of the stigma!",
                    "author": "kitten_ftw",
                    "id": "fejc63r",
                    "parent_id": "t1_fegnqha",
                    "score": 1,
                    "created_utc": 1579166651.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Exactly.",
            "author": "RealEarthAngel",
            "id": "fehe28e",
            "parent_id": "t1_feglvee",
            "score": 2,
            "created_utc": 1579114632.0,
            "replies": []
        },
        {
            "body": "> so are wives and girlfriends\n\nThe difference is the \"requirement \" for money. Most BFs and husbands contribute greatly to the support of their partners, but it is a voluntary contribution.",
            "author": "GSSD",
            "id": "fegnl8s",
            "parent_id": "t1_fegmcd4",
            "score": 6,
            "created_utc": 1579098085.0,
            "replies": [
                {
                    "body": "^ this",
                    "author": "kitten_ftw",
                    "id": "fejc9df",
                    "parent_id": "t1_fegnl8s",
                    "score": 1,
                    "created_utc": 1579166789.0,
                    "replies": []
                },
                {
                    "body": "> but it is a voluntary contribution.\n\nLOL.  And what happens when the \"voluntary contribution\" doesn't happen such as on Valentine's day, birthday, anniversary, Christmas, Mother's day, etc?  Not so voluntary is it?",
                    "author": "scott7sd",
                    "id": "fegwigf",
                    "parent_id": "t1_fegnl8s",
                    "score": -2,
                    "created_utc": 1579104101.0,
                    "replies": [
                        {
                            "body": "Bizarre. You are acting like a committed relationship is like a sugar relationship... and it's not. I don't wanna break it to ya but folks generally don't choose their partners solely for their ability to financially compensate them. \n\nA sugar relationship is literally 100% about someones ability to financially compensate someone for their time and company because if you can't pay then you aren't playing.",
                            "author": "MxMonstera",
                            "id": "feh3qzf",
                            "parent_id": "t1_fegwigf",
                            "score": 7,
                            "created_utc": 1579108527.0,
                            "replies": [
                                {
                                    "body": ">A sugar relationship is literally 100% about someones ability to financially compensate someone for their time and company\n\nHow many SBs would accept a sugar relationship with Brad Pitt that involved zero financial compensation and only involved \"the experience\"?",
                                    "author": "scott7sd",
                                    "id": "feh6gxe",
                                    "parent_id": "t1_feh3qzf",
                                    "score": 0,
                                    "created_utc": 1579110144.0,
                                    "replies": [
                                        {
                                            "body": "If you want financial compensation in exchange for intercourse or time spent, sugar is for you. \n\nIf you want a relationship between equals based upon mutual attraction and compatibility without a primary financial focus, then go for regular dating. \n\nIf they were the same thing, we wouldn't have made up a term for sugaring. They are two different things. Stop deluding yourself.",
                                            "author": "MxMonstera",
                                            "id": "feh8gpb",
                                            "parent_id": "t1_feh6gxe",
                                            "score": 3,
                                            "created_utc": 1579111314.0,
                                            "replies": [
                                                {
                                                    "body": "> If you want financial compensation in exchange for intercourse and time spent, sugar relationship is for you. \n\nThen what is escorting if, as you said, f they were the same thing, we wouldn't have made up a term for sugaring.",
                                                    "author": "scott7sd",
                                                    "id": "feha8ew",
                                                    "parent_id": "t1_feh8gpb",
                                                    "score": 0,
                                                    "created_utc": 1579112384.0,
                                                    "replies": [
                                                        {
                                                            "body": "If you need more explaining, I suggest you use google or pay me for my time. Peace.",
                                                            "author": "MxMonstera",
                                                            "id": "fehedf1",
                                                            "parent_id": "t1_feha8ew",
                                                            "score": 10,
                                                            "created_utc": 1579114811.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "body": "It would not be a sugar relationship. It would be dating Brad Pitt",
                                            "author": "kitten_ftw",
                                            "id": "fejccvm",
                                            "parent_id": "t1_feh6gxe",
                                            "score": 1,
                                            "created_utc": 1579166937.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": ">Bizarre. You are acting like a committed relationship is like a sugar relationship... and it's not.\n\nNo, I am saying that sugar relationships can be closer to a committed relationship than it is to escort because a sugar relationship is what you make it out to be.",
                                    "author": "scott7sd",
                                    "id": "feh6ls0",
                                    "parent_id": "t1_feh3qzf",
                                    "score": -1,
                                    "created_utc": 1579110225.0,
                                    "replies": [
                                        {
                                            "body": "You are saying that you feel comfortable twisting reality to suit your definitions. And I'm saying \"nah, that's not cool\" \n\nTransactional arrangements = escorting, sugaring, sex work, etc. \n\nThere's not a damn thing wrong with transactional arrangements so long as you are honest with yourself and the other person.  Regular dating isn't transactional. Or if it is, you should reevaluate your relationship ;p",
                                            "author": "MxMonstera",
                                            "id": "feh8oip",
                                            "parent_id": "t1_feh6ls0",
                                            "score": 4,
                                            "created_utc": 1579111445.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "Well expectations and requirement are two different things.",
                            "author": "GSSD",
                            "id": "fegy4mu",
                            "parent_id": "t1_fegwigf",
                            "score": 1,
                            "created_utc": 1579105120.0,
                            "replies": []
                        },
                        {
                            "body": "Yes it is. You can choose whether to exchange gifts on those holidays ot not. Or the husband and wife can argue over it but that is not a sugar arrangement",
                            "author": "kitten_ftw",
                            "id": "fejcbit",
                            "parent_id": "t1_fegwigf",
                            "score": 1,
                            "created_utc": 1579166880.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "escorts can choose who they sleep with as much as SBs....",
            "author": "sacredsslut",
            "id": "feh43f4",
            "parent_id": "t1_fegmcd4",
            "score": 7,
            "created_utc": 1579108730.0,
            "replies": []
        },
        {
            "body": "I know a couple escorts. They definitely chose their clients. The more experienced one is pretty choosy, in fact 🤷‍♀️",
            "author": "BratinaHat",
            "id": "fegnkba",
            "parent_id": "t1_fegmcd4",
            "score": 6,
            "created_utc": 1579098065.0,
            "replies": []
        },
        {
            "body": "Hmmm... Because wives do not contribute to the household? This logic is ridiculous because many women make more  than their husbands. And it's s monagamous love relationship. It's completely different from sugaring or any sex work.",
            "author": "redditgrl1140",
            "id": "fegoocu",
            "parent_id": "t1_fegmcd4",
            "score": 5,
            "created_utc": 1579098877.0,
            "replies": [
                {
                    "body": "> And it's s monagamous love relationship \n\nSeems like many of the married SDs would disagree with this.",
                    "author": "scott7sd",
                    "id": "fegwoyx",
                    "parent_id": "t1_fegoocu",
                    "score": 1,
                    "created_utc": 1579104215.0,
                    "replies": [
                        {
                            "body": "Yep",
                            "author": "ontherdagn",
                            "id": "feh4xl1",
                            "parent_id": "t1_fegwoyx",
                            "score": 1,
                            "created_utc": 1579109225.0,
                            "replies": [
                                {
                                    "body": "Explain how they'd disagree.",
                                    "author": "redditgrl1140",
                                    "id": "feh9m84",
                                    "parent_id": "t1_feh4xl1",
                                    "score": 1,
                                    "created_utc": 1579112012.0,
                                    "replies": [
                                        {
                                            "body": "Because they have sugar babies on the side",
                                            "author": null,
                                            "id": "fehhrcw",
                                            "parent_id": "t1_feh9m84",
                                            "score": 1,
                                            "created_utc": 1579116790.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "But over the years many of my sugar relationships have been monogamous (more so that some of the married F in my client's offices)",
                    "author": "pinotandsugar",
                    "id": "fehgw0z",
                    "parent_id": "t1_fegoocu",
                    "score": 0,
                    "created_utc": 1579116283.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "fegreus",
            "parent_id": "t1_fegmcd4",
            "score": 4,
            "created_utc": 1579100777.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "feh9bs6",
                    "parent_id": "t1_fegreus",
                    "score": -1,
                    "created_utc": 1579111834.0,
                    "replies": [
                        {
                            "body": "That is not the same as a sugar relationship.",
                            "author": "kitten_ftw",
                            "id": "fejcw5c",
                            "parent_id": "t1_feh9bs6",
                            "score": 1,
                            "created_utc": 1579167752.0,
                            "replies": [
                                {
                                    "body": "In your opinion, not mine!",
                                    "author": "HwdSD",
                                    "id": "fekl8v5",
                                    "parent_id": "t1_fejcw5c",
                                    "score": 2,
                                    "created_utc": 1579202382.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "We both choose and a lot of us do both.",
            "author": "kitten_ftw",
            "id": "fejc7ok",
            "parent_id": "t1_fegmcd4",
            "score": 1,
            "created_utc": 1579166720.0,
            "replies": []
        },
        {
            "body": "The wives and gfs argument is silly. Simply doesn't apply",
            "author": "kitten_ftw",
            "id": "fejc8pt",
            "parent_id": "t1_fegmcd4",
            "score": 1,
            "created_utc": 1579166762.0,
            "replies": []
        },
        {
            "body": "Sorry, but the Calgary Stampede is the best... :P",
            "author": "The_Year_2525",
            "id": "feh1vmk",
            "parent_id": "t1_fegz9aq",
            "score": 1,
            "created_utc": 1579107410.0,
            "replies": []
        },
        {
            "body": "Ditto!",
            "author": "kitten_ftw",
            "id": "fekhf7h",
            "parent_id": "t1_fejhjl2",
            "score": 1,
            "created_utc": 1579200102.0,
            "replies": []
        },
        {
            "body": "Yeah nah I don’t really take much of their things Into consideration what they said. I am getting into it and i have read a lot about it of course. \n\nTho I have talked to my friends about it who are positive to it. Mostly for my own safety reasons. \n\nBut yeah was honestly still a very interesting talk since most guys said yes it was and most girls said no it wasn’t.",
            "author": null,
            "id": "fgfm64r",
            "parent_id": "t1_fgfly36",
            "score": 2,
            "created_utc": 1580742412.0,
            "replies": [
                {
                    "body": "That's good!\nKnowing that my closest friends know about it makes me feel very safe. I send them my location if I ever feel iffy, and since they already know, it's easier to talk about it if something were to happen",
                    "author": null,
                    "id": "fgfmjea",
                    "parent_id": "t1_fgfm64r",
                    "score": 2,
                    "created_utc": 1580742672.0,
                    "replies": [
                        {
                            "body": "Yup! Same reason why I told mine. Sorry for replying earlier btw. Stay safe and take care!",
                            "author": null,
                            "id": "fghswvj",
                            "parent_id": "t1_fgfmjea",
                            "score": 1,
                            "created_utc": 1580792925.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "You going to play coy and not see this as an attempt to subtly tell other SBs that they are sex workers based on the recent drama?",
            "author": null,
            "id": "fehhj11",
            "parent_id": "t1_feh39wu",
            "score": 0,
            "created_utc": 1579116656.0,
            "replies": [
                {
                    "body": "Nah, not coy. I assume there is always an ongoing debate on “is sugar sex work??” but I’m unaware of a particularly recent flare up.\n\nAlso, I think the assumption that an entire sub looks down on another is pretty silly. Shit goes both ways, can we move on now?",
                    "author": "MxMonstera",
                    "id": "feho2g8",
                    "parent_id": "t1_fehhj11",
                    "score": 5,
                    "created_utc": 1579120452.0,
                    "replies": [
                        {
                            "body": "I don't even care and I might have been with some but I have not seen obsessively level of postings for the other subreddit out here compared to what you see over there.  If this was your moment of epiphany then it was better suited for that subreddit but to post this next day after all the drama makes me skeptical.",
                            "author": null,
                            "id": "fehprvu",
                            "parent_id": "t1_feho2g8",
                            "score": 0,
                            "created_utc": 1579121436.0,
                            "replies": [
                                {
                                    "body": "I'm not OP. No epiphany here. Like I said, shit goes both ways, it's stupid, can we move on now? Quit with the scarlet letter shit.",
                                    "author": "MxMonstera",
                                    "id": "fehukwy",
                                    "parent_id": "t1_fehprvu",
                                    "score": 4,
                                    "created_utc": 1579124167.0,
                                    "replies": []
                                },
                                {
                                    "body": "What drama are you talking about? I have clearly missed out.",
                                    "author": null,
                                    "id": "feji9ub",
                                    "parent_id": "t1_fehprvu",
                                    "score": 1,
                                    "created_utc": 1579175457.0,
                                    "replies": [
                                        {
                                            "body": "I DM'ed you.",
                                            "author": null,
                                            "id": "fekd0b3",
                                            "parent_id": "t1_feji9ub",
                                            "score": 1,
                                            "created_utc": 1579197476.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Ooh which sub is that?",
            "author": "kitten_ftw",
            "id": "fejd46a",
            "parent_id": "t1_fehhz0r",
            "score": 1,
            "created_utc": 1579168089.0,
            "replies": [
                {
                    "body": "It's like an incel sub, but everyone is under 5'4\"\nAnd the number one rule is to not discuss the undeniable facts that foids (women) discriminate men based on height. It's literally written in the subs bio lol",
                    "author": null,
                    "id": "fejhn2b",
                    "parent_id": "t1_fejd46a",
                    "score": 2,
                    "created_utc": 1579174662.0,
                    "replies": [
                        {
                            "body": "Oh lawd help me! Incels...i just can't",
                            "author": "kitten_ftw",
                            "id": "fekhmnl",
                            "parent_id": "t1_fejhn2b",
                            "score": 1,
                            "created_utc": 1579200224.0,
                            "replies": [
                                {
                                    "body": "It's super fun. I love the DM's they send. Do you know how many tumes I have received the exact message of \"you are LITERALLY a whore\"?\n\nLike duh. Is that supposed to phase me?",
                                    "author": null,
                                    "id": "fekin8q",
                                    "parent_id": "t1_fekhmnl",
                                    "score": 2,
                                    "created_utc": 1579200833.0,
                                    "replies": [
                                        {
                                            "body": "Lol🤣🤣 I'm going to have to check that one out",
                                            "author": "kitten_ftw",
                                            "id": "felzxaw",
                                            "parent_id": "t1_fekin8q",
                                            "score": 1,
                                            "created_utc": 1579235360.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I see. It's an interesting experiment though",
            "author": null,
            "id": "fehgzvx",
            "parent_id": "t1_fehgg4u",
            "score": 6,
            "created_utc": 1579116346.0,
            "replies": []
        },
        {
            "body": "Do you have any sources to back that up?",
            "author": "BratinaHat",
            "id": "fehw7m9",
            "parent_id": "t1_fehf4ya",
            "score": 4,
            "created_utc": 1579125091.0,
            "replies": []
        },
        {
            "body": "Literally what I was going to say. \n\nReddit has a great base of sex workers. Some of the most talented and intelligent women ive met",
            "author": "Elvishgirl",
            "id": "fekrwuf",
            "parent_id": "t1_fejdi4h",
            "score": 3,
            "created_utc": 1579206339.0,
            "replies": [
                {
                    "body": "That's so cool that you've met them! I'm very grateful for Reddit",
                    "author": "kitten_ftw",
                    "id": "felyh34",
                    "parent_id": "t1_fekrwuf",
                    "score": 1,
                    "created_utc": 1579234173.0,
                    "replies": []
                },
                {
                    "body": "Holy shit. Thank all of you who recommended this sub. This is quite literally some of the most emotionally intelligent dialogue I've ever read on the internet. I wish I'd found it sooner.",
                    "author": "_velvet_blue",
                    "id": "ffj6xga",
                    "parent_id": "t1_fekrwuf",
                    "score": 1,
                    "created_utc": 1579991925.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Thank you! Will check it out.",
            "author": "_velvet_blue",
            "id": "ffdjalg",
            "parent_id": "t1_ffb41g4",
            "score": 2,
            "created_utc": 1579822065.0,
            "replies": []
        },
        {
            "body": "No. There’s a lot more to marriage then there is to an arrangement.",
            "author": "RealEarthAngel",
            "id": "fehfthj",
            "parent_id": "t1_fehffwz",
            "score": 11,
            "created_utc": 1579115657.0,
            "replies": []
        },
        {
            "body": "Unfortunately I spend more time driving than having sex  but I would never consider my profession to be driving",
            "author": "pinotandsugar",
            "id": "fehg2q1",
            "parent_id": "t1_feha066",
            "score": 2,
            "created_utc": 1579115807.0,
            "replies": [
                {
                    "body": "But you do have a government issued certificate that you are competent to drive.",
                    "author": "ontherdagn",
                    "id": "feiwaze",
                    "parent_id": "t1_fehg2q1",
                    "score": 1,
                    "created_utc": 1579148965.0,
                    "replies": [
                        {
                            "body": "FIA",
                            "author": "pinotandsugar",
                            "id": "feiwnql",
                            "parent_id": "t1_feiwaze",
                            "score": 1,
                            "created_utc": 1579149251.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Sugaring is sex work. Period.",
                    "author": "kitten_ftw",
                    "id": "fejbrlk",
                    "parent_id": "t1_fehg2q1",
                    "score": 1,
                    "created_utc": 1579166046.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "USA is like a modern yet medieval",
            "author": null,
            "id": "fegk7iz",
            "parent_id": "t1_fegjne3",
            "score": 11,
            "created_utc": 1579095261.0,
            "replies": []
        },
        {
            "body": "I have been in nearly every country in the world, not many are more prudish than the US.",
            "author": null,
            "id": "feikpnd",
            "parent_id": "t1_fegjne3",
            "score": 2,
            "created_utc": 1579140787.0,
            "replies": []
        },
        {
            "body": "> rights for sex workers and women’s freedom of choice.\n\nBecause it also comes with \"and regulate it\", which means the sex worker can sue the government if anything happens to them.  The frivolous lawsuit system would need to be fixed first.",
            "author": "scott7sd",
            "id": "fegkxsb",
            "parent_id": "t1_fegjne3",
            "score": 3,
            "created_utc": 1579095979.0,
            "replies": [
                {
                    "body": "We have a lot to fix in the US and frivolous lawsuits is one of the biggest issues, but because lawyers are the primary beneficiaries and politicians are mostly lawyers don't expect that to change soon.  Most people have no idea of how much frivolous lawsuits, class action lawsuits and threat of lawsuits negatively impacts the daily life.  There is much to fix, but we have few if anyone in politics actually wanting to fix the issues.  They just want to blame the other political party for the problems.\n\n* Tort Reform\n* Prison Reform\n* Healthcare Reform\n* Education Reform\n* Legalize, regulate and tax drugs and prostitution\n* Tax reform\n* etc",
                    "author": "willfromvb",
                    "id": "fegui0r",
                    "parent_id": "t1_fegkxsb",
                    "score": 1,
                    "created_utc": 1579102819.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "^this 💯%! Women should be able to do whatever they want with their bodies; and if a woman chooses to make money from her body and emotional labor, it should be accepted.",
            "author": "kitten_ftw",
            "id": "fek9ot7",
            "parent_id": "t1_fegjne3",
            "score": 1,
            "created_utc": 1579195517.0,
            "replies": []
        },
        {
            "body": "I'm not like that I bring it up fairly quickly. \n\nI never pay for meets though.",
            "author": "anonymou555andWich",
            "id": "fejfj78",
            "parent_id": "t1_feizs75",
            "score": 2,
            "created_utc": 1579171748.0,
            "replies": [
                {
                    "body": "I think it's great that you bring it up quickly. Takes a lot of anxiety off the sb. At least for me!\n\nAs a SB I'm a fan of paid meet and greets. Where I live if it's a paid meet and greet, the standard amt isn't much but its a sweet guesture I appreciate 😊\n But it's not something I require. I only occasionally ask for it. Most times I don't bring it up. Certainly not a deal breaker, but it helps and makes me feel good/special ☺️",
                    "author": "kitten_ftw",
                    "id": "fekb1yt",
                    "parent_id": "t1_fejfj78",
                    "score": 2,
                    "created_utc": 1579196320.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I get that. But risky behaviour often comes as part of the sugaring, as I believe I mention shortly. But yeah, I agree. Viruses don't care.",
            "author": null,
            "id": "fegwn8n",
            "parent_id": "t1_fegwhut",
            "score": 4,
            "created_utc": 1579104185.0,
            "replies": [
                {
                    "body": "I feel far more comfortable with an SB even if she has an IRL BF or another SD than hooking up with the typical  F Hollywood Club patron .",
                    "author": "pinotandsugar",
                    "id": "fehgcbz",
                    "parent_id": "t1_fegwn8n",
                    "score": 1,
                    "created_utc": 1579115965.0,
                    "replies": [
                        {
                            "body": "Lol🤣 🤣 🤣 sbs can be escorts too. Or are you saying u feel more comfortable hooking up with a SB than a woman you met at a bar or club? I'm confused.",
                            "author": "kitten_ftw",
                            "id": "fejc334",
                            "parent_id": "t1_fehgcbz",
                            "score": 1,
                            "created_utc": 1579166523.0,
                            "replies": [
                                {
                                    "body": "Typical Hollywood club you have a crowd that has a high level of non commercial or marginally commercial sexual activity,  drugs and frequently bi-sexual males intermixed.   A steady college student or single mother  SB even with two SD is likely to be a far lower risk",
                                    "author": "pinotandsugar",
                                    "id": "fekatzy",
                                    "parent_id": "t1_fejc334",
                                    "score": 1,
                                    "created_utc": 1579196190.0,
                                    "replies": [
                                        {
                                            "body": "I see your point. I've never been to Hollywood before. I always use condoms. I think a lot of SBs and escorts are more likely to use protection than your average party goer. But I feel uncomfortable, personally making assumptions about men that are bisexual. But as a young woman who loved to party, do drugs and went through a promiscuous phase; I wasn't very careful. I got lucky. Now as a SW I always use protection. I do agree that SBs are probably more aware of the dangers of unprotected sex",
                                            "author": "kitten_ftw",
                                            "id": "fem1ajw",
                                            "parent_id": "t1_fekatzy",
                                            "score": 1,
                                            "created_utc": 1579236524.0,
                                            "replies": [
                                                {
                                                    "body": "> assumptions about men that are bisexual\n\nsadly the stats don't lie",
                                                    "author": "pinotandsugar",
                                                    "id": "fem7mp0",
                                                    "parent_id": "t1_fem1ajw",
                                                    "score": 1,
                                                    "created_utc": 1579242672.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Bc SDs have multiple babies and babies have multiple daddies unless exclusivity is part of the arrangement 🙂",
                    "author": "kitten_ftw",
                    "id": "fejc4kp",
                    "parent_id": "t1_fegwn8n",
                    "score": 1,
                    "created_utc": 1579166587.0,
                    "replies": []
                },
                {
                    "body": "Maybe we can agree that all sexual relations have risk. If one has more sexual partners due to being a SB than the risk goes up. Fair?",
                    "author": "ab1035",
                    "id": "fegxf8l",
                    "parent_id": "t1_fegwn8n",
                    "score": 0,
                    "created_utc": 1579104682.0,
                    "replies": [
                        {
                            "body": "Yes I agree",
                            "author": null,
                            "id": "fegzb6r",
                            "parent_id": "t1_fegxf8l",
                            "score": 3,
                            "created_utc": 1579105851.0,
                            "replies": [
                                {
                                    "body": "😀",
                                    "author": "ab1035",
                                    "id": "fegzeiu",
                                    "parent_id": "t1_fegzb6r",
                                    "score": 2,
                                    "created_utc": 1579105908.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "Fair but the risk is really associated with the pool from which they are plucked (M or F )",
                            "author": "pinotandsugar",
                            "id": "fehgfrg",
                            "parent_id": "t1_fegxf8l",
                            "score": 2,
                            "created_utc": 1579116019.0,
                            "replies": [
                                {
                                    "body": "True to an extent. But the sweet girl next door can also give you the clap.",
                                    "author": "ab1035",
                                    "id": "fehiaop",
                                    "parent_id": "t1_fehgfrg",
                                    "score": 2,
                                    "created_utc": 1579117109.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I don't either! This sub could be really cool if they would let go of the stigma!",
            "author": "kitten_ftw",
            "id": "fejc63r",
            "parent_id": "t1_fegnqha",
            "score": 1,
            "created_utc": 1579166651.0,
            "replies": []
        },
        {
            "body": "^ this",
            "author": "kitten_ftw",
            "id": "fejc9df",
            "parent_id": "t1_fegnl8s",
            "score": 1,
            "created_utc": 1579166789.0,
            "replies": []
        },
        {
            "body": "> but it is a voluntary contribution.\n\nLOL.  And what happens when the \"voluntary contribution\" doesn't happen such as on Valentine's day, birthday, anniversary, Christmas, Mother's day, etc?  Not so voluntary is it?",
            "author": "scott7sd",
            "id": "fegwigf",
            "parent_id": "t1_fegnl8s",
            "score": -2,
            "created_utc": 1579104101.0,
            "replies": [
                {
                    "body": "Bizarre. You are acting like a committed relationship is like a sugar relationship... and it's not. I don't wanna break it to ya but folks generally don't choose their partners solely for their ability to financially compensate them. \n\nA sugar relationship is literally 100% about someones ability to financially compensate someone for their time and company because if you can't pay then you aren't playing.",
                    "author": "MxMonstera",
                    "id": "feh3qzf",
                    "parent_id": "t1_fegwigf",
                    "score": 7,
                    "created_utc": 1579108527.0,
                    "replies": [
                        {
                            "body": ">A sugar relationship is literally 100% about someones ability to financially compensate someone for their time and company\n\nHow many SBs would accept a sugar relationship with Brad Pitt that involved zero financial compensation and only involved \"the experience\"?",
                            "author": "scott7sd",
                            "id": "feh6gxe",
                            "parent_id": "t1_feh3qzf",
                            "score": 0,
                            "created_utc": 1579110144.0,
                            "replies": [
                                {
                                    "body": "If you want financial compensation in exchange for intercourse or time spent, sugar is for you. \n\nIf you want a relationship between equals based upon mutual attraction and compatibility without a primary financial focus, then go for regular dating. \n\nIf they were the same thing, we wouldn't have made up a term for sugaring. They are two different things. Stop deluding yourself.",
                                    "author": "MxMonstera",
                                    "id": "feh8gpb",
                                    "parent_id": "t1_feh6gxe",
                                    "score": 3,
                                    "created_utc": 1579111314.0,
                                    "replies": [
                                        {
                                            "body": "> If you want financial compensation in exchange for intercourse and time spent, sugar relationship is for you. \n\nThen what is escorting if, as you said, f they were the same thing, we wouldn't have made up a term for sugaring.",
                                            "author": "scott7sd",
                                            "id": "feha8ew",
                                            "parent_id": "t1_feh8gpb",
                                            "score": 0,
                                            "created_utc": 1579112384.0,
                                            "replies": [
                                                {
                                                    "body": "If you need more explaining, I suggest you use google or pay me for my time. Peace.",
                                                    "author": "MxMonstera",
                                                    "id": "fehedf1",
                                                    "parent_id": "t1_feha8ew",
                                                    "score": 10,
                                                    "created_utc": 1579114811.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "It would not be a sugar relationship. It would be dating Brad Pitt",
                                    "author": "kitten_ftw",
                                    "id": "fejccvm",
                                    "parent_id": "t1_feh6gxe",
                                    "score": 1,
                                    "created_utc": 1579166937.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": ">Bizarre. You are acting like a committed relationship is like a sugar relationship... and it's not.\n\nNo, I am saying that sugar relationships can be closer to a committed relationship than it is to escort because a sugar relationship is what you make it out to be.",
                            "author": "scott7sd",
                            "id": "feh6ls0",
                            "parent_id": "t1_feh3qzf",
                            "score": -1,
                            "created_utc": 1579110225.0,
                            "replies": [
                                {
                                    "body": "You are saying that you feel comfortable twisting reality to suit your definitions. And I'm saying \"nah, that's not cool\" \n\nTransactional arrangements = escorting, sugaring, sex work, etc. \n\nThere's not a damn thing wrong with transactional arrangements so long as you are honest with yourself and the other person.  Regular dating isn't transactional. Or if it is, you should reevaluate your relationship ;p",
                                    "author": "MxMonstera",
                                    "id": "feh8oip",
                                    "parent_id": "t1_feh6ls0",
                                    "score": 4,
                                    "created_utc": 1579111445.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Well expectations and requirement are two different things.",
                    "author": "GSSD",
                    "id": "fegy4mu",
                    "parent_id": "t1_fegwigf",
                    "score": 1,
                    "created_utc": 1579105120.0,
                    "replies": []
                },
                {
                    "body": "Yes it is. You can choose whether to exchange gifts on those holidays ot not. Or the husband and wife can argue over it but that is not a sugar arrangement",
                    "author": "kitten_ftw",
                    "id": "fejcbit",
                    "parent_id": "t1_fegwigf",
                    "score": 1,
                    "created_utc": 1579166880.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "> And it's s monagamous love relationship \n\nSeems like many of the married SDs would disagree with this.",
            "author": "scott7sd",
            "id": "fegwoyx",
            "parent_id": "t1_fegoocu",
            "score": 1,
            "created_utc": 1579104215.0,
            "replies": [
                {
                    "body": "Yep",
                    "author": "ontherdagn",
                    "id": "feh4xl1",
                    "parent_id": "t1_fegwoyx",
                    "score": 1,
                    "created_utc": 1579109225.0,
                    "replies": [
                        {
                            "body": "Explain how they'd disagree.",
                            "author": "redditgrl1140",
                            "id": "feh9m84",
                            "parent_id": "t1_feh4xl1",
                            "score": 1,
                            "created_utc": 1579112012.0,
                            "replies": [
                                {
                                    "body": "Because they have sugar babies on the side",
                                    "author": null,
                                    "id": "fehhrcw",
                                    "parent_id": "t1_feh9m84",
                                    "score": 1,
                                    "created_utc": 1579116790.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "But over the years many of my sugar relationships have been monogamous (more so that some of the married F in my client's offices)",
            "author": "pinotandsugar",
            "id": "fehgw0z",
            "parent_id": "t1_fegoocu",
            "score": 0,
            "created_utc": 1579116283.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "feh9bs6",
            "parent_id": "t1_fegreus",
            "score": -1,
            "created_utc": 1579111834.0,
            "replies": [
                {
                    "body": "That is not the same as a sugar relationship.",
                    "author": "kitten_ftw",
                    "id": "fejcw5c",
                    "parent_id": "t1_feh9bs6",
                    "score": 1,
                    "created_utc": 1579167752.0,
                    "replies": [
                        {
                            "body": "In your opinion, not mine!",
                            "author": "HwdSD",
                            "id": "fekl8v5",
                            "parent_id": "t1_fejcw5c",
                            "score": 2,
                            "created_utc": 1579202382.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "That's good!\nKnowing that my closest friends know about it makes me feel very safe. I send them my location if I ever feel iffy, and since they already know, it's easier to talk about it if something were to happen",
            "author": null,
            "id": "fgfmjea",
            "parent_id": "t1_fgfm64r",
            "score": 2,
            "created_utc": 1580742672.0,
            "replies": [
                {
                    "body": "Yup! Same reason why I told mine. Sorry for replying earlier btw. Stay safe and take care!",
                    "author": null,
                    "id": "fghswvj",
                    "parent_id": "t1_fgfmjea",
                    "score": 1,
                    "created_utc": 1580792925.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Nah, not coy. I assume there is always an ongoing debate on “is sugar sex work??” but I’m unaware of a particularly recent flare up.\n\nAlso, I think the assumption that an entire sub looks down on another is pretty silly. Shit goes both ways, can we move on now?",
            "author": "MxMonstera",
            "id": "feho2g8",
            "parent_id": "t1_fehhj11",
            "score": 5,
            "created_utc": 1579120452.0,
            "replies": [
                {
                    "body": "I don't even care and I might have been with some but I have not seen obsessively level of postings for the other subreddit out here compared to what you see over there.  If this was your moment of epiphany then it was better suited for that subreddit but to post this next day after all the drama makes me skeptical.",
                    "author": null,
                    "id": "fehprvu",
                    "parent_id": "t1_feho2g8",
                    "score": 0,
                    "created_utc": 1579121436.0,
                    "replies": [
                        {
                            "body": "I'm not OP. No epiphany here. Like I said, shit goes both ways, it's stupid, can we move on now? Quit with the scarlet letter shit.",
                            "author": "MxMonstera",
                            "id": "fehukwy",
                            "parent_id": "t1_fehprvu",
                            "score": 4,
                            "created_utc": 1579124167.0,
                            "replies": []
                        },
                        {
                            "body": "What drama are you talking about? I have clearly missed out.",
                            "author": null,
                            "id": "feji9ub",
                            "parent_id": "t1_fehprvu",
                            "score": 1,
                            "created_utc": 1579175457.0,
                            "replies": [
                                {
                                    "body": "I DM'ed you.",
                                    "author": null,
                                    "id": "fekd0b3",
                                    "parent_id": "t1_feji9ub",
                                    "score": 1,
                                    "created_utc": 1579197476.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "It's like an incel sub, but everyone is under 5'4\"\nAnd the number one rule is to not discuss the undeniable facts that foids (women) discriminate men based on height. It's literally written in the subs bio lol",
            "author": null,
            "id": "fejhn2b",
            "parent_id": "t1_fejd46a",
            "score": 2,
            "created_utc": 1579174662.0,
            "replies": [
                {
                    "body": "Oh lawd help me! Incels...i just can't",
                    "author": "kitten_ftw",
                    "id": "fekhmnl",
                    "parent_id": "t1_fejhn2b",
                    "score": 1,
                    "created_utc": 1579200224.0,
                    "replies": [
                        {
                            "body": "It's super fun. I love the DM's they send. Do you know how many tumes I have received the exact message of \"you are LITERALLY a whore\"?\n\nLike duh. Is that supposed to phase me?",
                            "author": null,
                            "id": "fekin8q",
                            "parent_id": "t1_fekhmnl",
                            "score": 2,
                            "created_utc": 1579200833.0,
                            "replies": [
                                {
                                    "body": "Lol🤣🤣 I'm going to have to check that one out",
                                    "author": "kitten_ftw",
                                    "id": "felzxaw",
                                    "parent_id": "t1_fekin8q",
                                    "score": 1,
                                    "created_utc": 1579235360.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "That's so cool that you've met them! I'm very grateful for Reddit",
            "author": "kitten_ftw",
            "id": "felyh34",
            "parent_id": "t1_fekrwuf",
            "score": 1,
            "created_utc": 1579234173.0,
            "replies": []
        },
        {
            "body": "Holy shit. Thank all of you who recommended this sub. This is quite literally some of the most emotionally intelligent dialogue I've ever read on the internet. I wish I'd found it sooner.",
            "author": "_velvet_blue",
            "id": "ffj6xga",
            "parent_id": "t1_fekrwuf",
            "score": 1,
            "created_utc": 1579991925.0,
            "replies": []
        },
        {
            "body": "But you do have a government issued certificate that you are competent to drive.",
            "author": "ontherdagn",
            "id": "feiwaze",
            "parent_id": "t1_fehg2q1",
            "score": 1,
            "created_utc": 1579148965.0,
            "replies": [
                {
                    "body": "FIA",
                    "author": "pinotandsugar",
                    "id": "feiwnql",
                    "parent_id": "t1_feiwaze",
                    "score": 1,
                    "created_utc": 1579149251.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Sugaring is sex work. Period.",
            "author": "kitten_ftw",
            "id": "fejbrlk",
            "parent_id": "t1_fehg2q1",
            "score": 1,
            "created_utc": 1579166046.0,
            "replies": []
        },
        {
            "body": "We have a lot to fix in the US and frivolous lawsuits is one of the biggest issues, but because lawyers are the primary beneficiaries and politicians are mostly lawyers don't expect that to change soon.  Most people have no idea of how much frivolous lawsuits, class action lawsuits and threat of lawsuits negatively impacts the daily life.  There is much to fix, but we have few if anyone in politics actually wanting to fix the issues.  They just want to blame the other political party for the problems.\n\n* Tort Reform\n* Prison Reform\n* Healthcare Reform\n* Education Reform\n* Legalize, regulate and tax drugs and prostitution\n* Tax reform\n* etc",
            "author": "willfromvb",
            "id": "fegui0r",
            "parent_id": "t1_fegkxsb",
            "score": 1,
            "created_utc": 1579102819.0,
            "replies": []
        },
        {
            "body": "I think it's great that you bring it up quickly. Takes a lot of anxiety off the sb. At least for me!\n\nAs a SB I'm a fan of paid meet and greets. Where I live if it's a paid meet and greet, the standard amt isn't much but its a sweet guesture I appreciate 😊\n But it's not something I require. I only occasionally ask for it. Most times I don't bring it up. Certainly not a deal breaker, but it helps and makes me feel good/special ☺️",
            "author": "kitten_ftw",
            "id": "fekb1yt",
            "parent_id": "t1_fejfj78",
            "score": 2,
            "created_utc": 1579196320.0,
            "replies": []
        },
        {
            "body": "I feel far more comfortable with an SB even if she has an IRL BF or another SD than hooking up with the typical  F Hollywood Club patron .",
            "author": "pinotandsugar",
            "id": "fehgcbz",
            "parent_id": "t1_fegwn8n",
            "score": 1,
            "created_utc": 1579115965.0,
            "replies": [
                {
                    "body": "Lol🤣 🤣 🤣 sbs can be escorts too. Or are you saying u feel more comfortable hooking up with a SB than a woman you met at a bar or club? I'm confused.",
                    "author": "kitten_ftw",
                    "id": "fejc334",
                    "parent_id": "t1_fehgcbz",
                    "score": 1,
                    "created_utc": 1579166523.0,
                    "replies": [
                        {
                            "body": "Typical Hollywood club you have a crowd that has a high level of non commercial or marginally commercial sexual activity,  drugs and frequently bi-sexual males intermixed.   A steady college student or single mother  SB even with two SD is likely to be a far lower risk",
                            "author": "pinotandsugar",
                            "id": "fekatzy",
                            "parent_id": "t1_fejc334",
                            "score": 1,
                            "created_utc": 1579196190.0,
                            "replies": [
                                {
                                    "body": "I see your point. I've never been to Hollywood before. I always use condoms. I think a lot of SBs and escorts are more likely to use protection than your average party goer. But I feel uncomfortable, personally making assumptions about men that are bisexual. But as a young woman who loved to party, do drugs and went through a promiscuous phase; I wasn't very careful. I got lucky. Now as a SW I always use protection. I do agree that SBs are probably more aware of the dangers of unprotected sex",
                                    "author": "kitten_ftw",
                                    "id": "fem1ajw",
                                    "parent_id": "t1_fekatzy",
                                    "score": 1,
                                    "created_utc": 1579236524.0,
                                    "replies": [
                                        {
                                            "body": "> assumptions about men that are bisexual\n\nsadly the stats don't lie",
                                            "author": "pinotandsugar",
                                            "id": "fem7mp0",
                                            "parent_id": "t1_fem1ajw",
                                            "score": 1,
                                            "created_utc": 1579242672.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Bc SDs have multiple babies and babies have multiple daddies unless exclusivity is part of the arrangement 🙂",
            "author": "kitten_ftw",
            "id": "fejc4kp",
            "parent_id": "t1_fegwn8n",
            "score": 1,
            "created_utc": 1579166587.0,
            "replies": []
        },
        {
            "body": "Maybe we can agree that all sexual relations have risk. If one has more sexual partners due to being a SB than the risk goes up. Fair?",
            "author": "ab1035",
            "id": "fegxf8l",
            "parent_id": "t1_fegwn8n",
            "score": 0,
            "created_utc": 1579104682.0,
            "replies": [
                {
                    "body": "Yes I agree",
                    "author": null,
                    "id": "fegzb6r",
                    "parent_id": "t1_fegxf8l",
                    "score": 3,
                    "created_utc": 1579105851.0,
                    "replies": [
                        {
                            "body": "😀",
                            "author": "ab1035",
                            "id": "fegzeiu",
                            "parent_id": "t1_fegzb6r",
                            "score": 2,
                            "created_utc": 1579105908.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Fair but the risk is really associated with the pool from which they are plucked (M or F )",
                    "author": "pinotandsugar",
                    "id": "fehgfrg",
                    "parent_id": "t1_fegxf8l",
                    "score": 2,
                    "created_utc": 1579116019.0,
                    "replies": [
                        {
                            "body": "True to an extent. But the sweet girl next door can also give you the clap.",
                            "author": "ab1035",
                            "id": "fehiaop",
                            "parent_id": "t1_fehgfrg",
                            "score": 2,
                            "created_utc": 1579117109.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Bizarre. You are acting like a committed relationship is like a sugar relationship... and it's not. I don't wanna break it to ya but folks generally don't choose their partners solely for their ability to financially compensate them. \n\nA sugar relationship is literally 100% about someones ability to financially compensate someone for their time and company because if you can't pay then you aren't playing.",
            "author": "MxMonstera",
            "id": "feh3qzf",
            "parent_id": "t1_fegwigf",
            "score": 7,
            "created_utc": 1579108527.0,
            "replies": [
                {
                    "body": ">A sugar relationship is literally 100% about someones ability to financially compensate someone for their time and company\n\nHow many SBs would accept a sugar relationship with Brad Pitt that involved zero financial compensation and only involved \"the experience\"?",
                    "author": "scott7sd",
                    "id": "feh6gxe",
                    "parent_id": "t1_feh3qzf",
                    "score": 0,
                    "created_utc": 1579110144.0,
                    "replies": [
                        {
                            "body": "If you want financial compensation in exchange for intercourse or time spent, sugar is for you. \n\nIf you want a relationship between equals based upon mutual attraction and compatibility without a primary financial focus, then go for regular dating. \n\nIf they were the same thing, we wouldn't have made up a term for sugaring. They are two different things. Stop deluding yourself.",
                            "author": "MxMonstera",
                            "id": "feh8gpb",
                            "parent_id": "t1_feh6gxe",
                            "score": 3,
                            "created_utc": 1579111314.0,
                            "replies": [
                                {
                                    "body": "> If you want financial compensation in exchange for intercourse and time spent, sugar relationship is for you. \n\nThen what is escorting if, as you said, f they were the same thing, we wouldn't have made up a term for sugaring.",
                                    "author": "scott7sd",
                                    "id": "feha8ew",
                                    "parent_id": "t1_feh8gpb",
                                    "score": 0,
                                    "created_utc": 1579112384.0,
                                    "replies": [
                                        {
                                            "body": "If you need more explaining, I suggest you use google or pay me for my time. Peace.",
                                            "author": "MxMonstera",
                                            "id": "fehedf1",
                                            "parent_id": "t1_feha8ew",
                                            "score": 10,
                                            "created_utc": 1579114811.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "It would not be a sugar relationship. It would be dating Brad Pitt",
                            "author": "kitten_ftw",
                            "id": "fejccvm",
                            "parent_id": "t1_feh6gxe",
                            "score": 1,
                            "created_utc": 1579166937.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": ">Bizarre. You are acting like a committed relationship is like a sugar relationship... and it's not.\n\nNo, I am saying that sugar relationships can be closer to a committed relationship than it is to escort because a sugar relationship is what you make it out to be.",
                    "author": "scott7sd",
                    "id": "feh6ls0",
                    "parent_id": "t1_feh3qzf",
                    "score": -1,
                    "created_utc": 1579110225.0,
                    "replies": [
                        {
                            "body": "You are saying that you feel comfortable twisting reality to suit your definitions. And I'm saying \"nah, that's not cool\" \n\nTransactional arrangements = escorting, sugaring, sex work, etc. \n\nThere's not a damn thing wrong with transactional arrangements so long as you are honest with yourself and the other person.  Regular dating isn't transactional. Or if it is, you should reevaluate your relationship ;p",
                            "author": "MxMonstera",
                            "id": "feh8oip",
                            "parent_id": "t1_feh6ls0",
                            "score": 4,
                            "created_utc": 1579111445.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Well expectations and requirement are two different things.",
            "author": "GSSD",
            "id": "fegy4mu",
            "parent_id": "t1_fegwigf",
            "score": 1,
            "created_utc": 1579105120.0,
            "replies": []
        },
        {
            "body": "Yes it is. You can choose whether to exchange gifts on those holidays ot not. Or the husband and wife can argue over it but that is not a sugar arrangement",
            "author": "kitten_ftw",
            "id": "fejcbit",
            "parent_id": "t1_fegwigf",
            "score": 1,
            "created_utc": 1579166880.0,
            "replies": []
        },
        {
            "body": "Yep",
            "author": "ontherdagn",
            "id": "feh4xl1",
            "parent_id": "t1_fegwoyx",
            "score": 1,
            "created_utc": 1579109225.0,
            "replies": [
                {
                    "body": "Explain how they'd disagree.",
                    "author": "redditgrl1140",
                    "id": "feh9m84",
                    "parent_id": "t1_feh4xl1",
                    "score": 1,
                    "created_utc": 1579112012.0,
                    "replies": [
                        {
                            "body": "Because they have sugar babies on the side",
                            "author": null,
                            "id": "fehhrcw",
                            "parent_id": "t1_feh9m84",
                            "score": 1,
                            "created_utc": 1579116790.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "That is not the same as a sugar relationship.",
            "author": "kitten_ftw",
            "id": "fejcw5c",
            "parent_id": "t1_feh9bs6",
            "score": 1,
            "created_utc": 1579167752.0,
            "replies": [
                {
                    "body": "In your opinion, not mine!",
                    "author": "HwdSD",
                    "id": "fekl8v5",
                    "parent_id": "t1_fejcw5c",
                    "score": 2,
                    "created_utc": 1579202382.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Yup! Same reason why I told mine. Sorry for replying earlier btw. Stay safe and take care!",
            "author": null,
            "id": "fghswvj",
            "parent_id": "t1_fgfmjea",
            "score": 1,
            "created_utc": 1580792925.0,
            "replies": []
        },
        {
            "body": "I don't even care and I might have been with some but I have not seen obsessively level of postings for the other subreddit out here compared to what you see over there.  If this was your moment of epiphany then it was better suited for that subreddit but to post this next day after all the drama makes me skeptical.",
            "author": null,
            "id": "fehprvu",
            "parent_id": "t1_feho2g8",
            "score": 0,
            "created_utc": 1579121436.0,
            "replies": [
                {
                    "body": "I'm not OP. No epiphany here. Like I said, shit goes both ways, it's stupid, can we move on now? Quit with the scarlet letter shit.",
                    "author": "MxMonstera",
                    "id": "fehukwy",
                    "parent_id": "t1_fehprvu",
                    "score": 4,
                    "created_utc": 1579124167.0,
                    "replies": []
                },
                {
                    "body": "What drama are you talking about? I have clearly missed out.",
                    "author": null,
                    "id": "feji9ub",
                    "parent_id": "t1_fehprvu",
                    "score": 1,
                    "created_utc": 1579175457.0,
                    "replies": [
                        {
                            "body": "I DM'ed you.",
                            "author": null,
                            "id": "fekd0b3",
                            "parent_id": "t1_feji9ub",
                            "score": 1,
                            "created_utc": 1579197476.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Oh lawd help me! Incels...i just can't",
            "author": "kitten_ftw",
            "id": "fekhmnl",
            "parent_id": "t1_fejhn2b",
            "score": 1,
            "created_utc": 1579200224.0,
            "replies": [
                {
                    "body": "It's super fun. I love the DM's they send. Do you know how many tumes I have received the exact message of \"you are LITERALLY a whore\"?\n\nLike duh. Is that supposed to phase me?",
                    "author": null,
                    "id": "fekin8q",
                    "parent_id": "t1_fekhmnl",
                    "score": 2,
                    "created_utc": 1579200833.0,
                    "replies": [
                        {
                            "body": "Lol🤣🤣 I'm going to have to check that one out",
                            "author": "kitten_ftw",
                            "id": "felzxaw",
                            "parent_id": "t1_fekin8q",
                            "score": 1,
                            "created_utc": 1579235360.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "FIA",
            "author": "pinotandsugar",
            "id": "feiwnql",
            "parent_id": "t1_feiwaze",
            "score": 1,
            "created_utc": 1579149251.0,
            "replies": []
        },
        {
            "body": "Lol🤣 🤣 🤣 sbs can be escorts too. Or are you saying u feel more comfortable hooking up with a SB than a woman you met at a bar or club? I'm confused.",
            "author": "kitten_ftw",
            "id": "fejc334",
            "parent_id": "t1_fehgcbz",
            "score": 1,
            "created_utc": 1579166523.0,
            "replies": [
                {
                    "body": "Typical Hollywood club you have a crowd that has a high level of non commercial or marginally commercial sexual activity,  drugs and frequently bi-sexual males intermixed.   A steady college student or single mother  SB even with two SD is likely to be a far lower risk",
                    "author": "pinotandsugar",
                    "id": "fekatzy",
                    "parent_id": "t1_fejc334",
                    "score": 1,
                    "created_utc": 1579196190.0,
                    "replies": [
                        {
                            "body": "I see your point. I've never been to Hollywood before. I always use condoms. I think a lot of SBs and escorts are more likely to use protection than your average party goer. But I feel uncomfortable, personally making assumptions about men that are bisexual. But as a young woman who loved to party, do drugs and went through a promiscuous phase; I wasn't very careful. I got lucky. Now as a SW I always use protection. I do agree that SBs are probably more aware of the dangers of unprotected sex",
                            "author": "kitten_ftw",
                            "id": "fem1ajw",
                            "parent_id": "t1_fekatzy",
                            "score": 1,
                            "created_utc": 1579236524.0,
                            "replies": [
                                {
                                    "body": "> assumptions about men that are bisexual\n\nsadly the stats don't lie",
                                    "author": "pinotandsugar",
                                    "id": "fem7mp0",
                                    "parent_id": "t1_fem1ajw",
                                    "score": 1,
                                    "created_utc": 1579242672.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Yes I agree",
            "author": null,
            "id": "fegzb6r",
            "parent_id": "t1_fegxf8l",
            "score": 3,
            "created_utc": 1579105851.0,
            "replies": [
                {
                    "body": "😀",
                    "author": "ab1035",
                    "id": "fegzeiu",
                    "parent_id": "t1_fegzb6r",
                    "score": 2,
                    "created_utc": 1579105908.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Fair but the risk is really associated with the pool from which they are plucked (M or F )",
            "author": "pinotandsugar",
            "id": "fehgfrg",
            "parent_id": "t1_fegxf8l",
            "score": 2,
            "created_utc": 1579116019.0,
            "replies": [
                {
                    "body": "True to an extent. But the sweet girl next door can also give you the clap.",
                    "author": "ab1035",
                    "id": "fehiaop",
                    "parent_id": "t1_fehgfrg",
                    "score": 2,
                    "created_utc": 1579117109.0,
                    "replies": []
                }
            ]
        },
        {
            "body": ">A sugar relationship is literally 100% about someones ability to financially compensate someone for their time and company\n\nHow many SBs would accept a sugar relationship with Brad Pitt that involved zero financial compensation and only involved \"the experience\"?",
            "author": "scott7sd",
            "id": "feh6gxe",
            "parent_id": "t1_feh3qzf",
            "score": 0,
            "created_utc": 1579110144.0,
            "replies": [
                {
                    "body": "If you want financial compensation in exchange for intercourse or time spent, sugar is for you. \n\nIf you want a relationship between equals based upon mutual attraction and compatibility without a primary financial focus, then go for regular dating. \n\nIf they were the same thing, we wouldn't have made up a term for sugaring. They are two different things. Stop deluding yourself.",
                    "author": "MxMonstera",
                    "id": "feh8gpb",
                    "parent_id": "t1_feh6gxe",
                    "score": 3,
                    "created_utc": 1579111314.0,
                    "replies": [
                        {
                            "body": "> If you want financial compensation in exchange for intercourse and time spent, sugar relationship is for you. \n\nThen what is escorting if, as you said, f they were the same thing, we wouldn't have made up a term for sugaring.",
                            "author": "scott7sd",
                            "id": "feha8ew",
                            "parent_id": "t1_feh8gpb",
                            "score": 0,
                            "created_utc": 1579112384.0,
                            "replies": [
                                {
                                    "body": "If you need more explaining, I suggest you use google or pay me for my time. Peace.",
                                    "author": "MxMonstera",
                                    "id": "fehedf1",
                                    "parent_id": "t1_feha8ew",
                                    "score": 10,
                                    "created_utc": 1579114811.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "It would not be a sugar relationship. It would be dating Brad Pitt",
                    "author": "kitten_ftw",
                    "id": "fejccvm",
                    "parent_id": "t1_feh6gxe",
                    "score": 1,
                    "created_utc": 1579166937.0,
                    "replies": []
                }
            ]
        },
        {
            "body": ">Bizarre. You are acting like a committed relationship is like a sugar relationship... and it's not.\n\nNo, I am saying that sugar relationships can be closer to a committed relationship than it is to escort because a sugar relationship is what you make it out to be.",
            "author": "scott7sd",
            "id": "feh6ls0",
            "parent_id": "t1_feh3qzf",
            "score": -1,
            "created_utc": 1579110225.0,
            "replies": [
                {
                    "body": "You are saying that you feel comfortable twisting reality to suit your definitions. And I'm saying \"nah, that's not cool\" \n\nTransactional arrangements = escorting, sugaring, sex work, etc. \n\nThere's not a damn thing wrong with transactional arrangements so long as you are honest with yourself and the other person.  Regular dating isn't transactional. Or if it is, you should reevaluate your relationship ;p",
                    "author": "MxMonstera",
                    "id": "feh8oip",
                    "parent_id": "t1_feh6ls0",
                    "score": 4,
                    "created_utc": 1579111445.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Explain how they'd disagree.",
            "author": "redditgrl1140",
            "id": "feh9m84",
            "parent_id": "t1_feh4xl1",
            "score": 1,
            "created_utc": 1579112012.0,
            "replies": [
                {
                    "body": "Because they have sugar babies on the side",
                    "author": null,
                    "id": "fehhrcw",
                    "parent_id": "t1_feh9m84",
                    "score": 1,
                    "created_utc": 1579116790.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "In your opinion, not mine!",
            "author": "HwdSD",
            "id": "fekl8v5",
            "parent_id": "t1_fejcw5c",
            "score": 2,
            "created_utc": 1579202382.0,
            "replies": []
        },
        {
            "body": "I'm not OP. No epiphany here. Like I said, shit goes both ways, it's stupid, can we move on now? Quit with the scarlet letter shit.",
            "author": "MxMonstera",
            "id": "fehukwy",
            "parent_id": "t1_fehprvu",
            "score": 4,
            "created_utc": 1579124167.0,
            "replies": []
        },
        {
            "body": "What drama are you talking about? I have clearly missed out.",
            "author": null,
            "id": "feji9ub",
            "parent_id": "t1_fehprvu",
            "score": 1,
            "created_utc": 1579175457.0,
            "replies": [
                {
                    "body": "I DM'ed you.",
                    "author": null,
                    "id": "fekd0b3",
                    "parent_id": "t1_feji9ub",
                    "score": 1,
                    "created_utc": 1579197476.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "It's super fun. I love the DM's they send. Do you know how many tumes I have received the exact message of \"you are LITERALLY a whore\"?\n\nLike duh. Is that supposed to phase me?",
            "author": null,
            "id": "fekin8q",
            "parent_id": "t1_fekhmnl",
            "score": 2,
            "created_utc": 1579200833.0,
            "replies": [
                {
                    "body": "Lol🤣🤣 I'm going to have to check that one out",
                    "author": "kitten_ftw",
                    "id": "felzxaw",
                    "parent_id": "t1_fekin8q",
                    "score": 1,
                    "created_utc": 1579235360.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Typical Hollywood club you have a crowd that has a high level of non commercial or marginally commercial sexual activity,  drugs and frequently bi-sexual males intermixed.   A steady college student or single mother  SB even with two SD is likely to be a far lower risk",
            "author": "pinotandsugar",
            "id": "fekatzy",
            "parent_id": "t1_fejc334",
            "score": 1,
            "created_utc": 1579196190.0,
            "replies": [
                {
                    "body": "I see your point. I've never been to Hollywood before. I always use condoms. I think a lot of SBs and escorts are more likely to use protection than your average party goer. But I feel uncomfortable, personally making assumptions about men that are bisexual. But as a young woman who loved to party, do drugs and went through a promiscuous phase; I wasn't very careful. I got lucky. Now as a SW I always use protection. I do agree that SBs are probably more aware of the dangers of unprotected sex",
                    "author": "kitten_ftw",
                    "id": "fem1ajw",
                    "parent_id": "t1_fekatzy",
                    "score": 1,
                    "created_utc": 1579236524.0,
                    "replies": [
                        {
                            "body": "> assumptions about men that are bisexual\n\nsadly the stats don't lie",
                            "author": "pinotandsugar",
                            "id": "fem7mp0",
                            "parent_id": "t1_fem1ajw",
                            "score": 1,
                            "created_utc": 1579242672.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "😀",
            "author": "ab1035",
            "id": "fegzeiu",
            "parent_id": "t1_fegzb6r",
            "score": 2,
            "created_utc": 1579105908.0,
            "replies": []
        },
        {
            "body": "True to an extent. But the sweet girl next door can also give you the clap.",
            "author": "ab1035",
            "id": "fehiaop",
            "parent_id": "t1_fehgfrg",
            "score": 2,
            "created_utc": 1579117109.0,
            "replies": []
        },
        {
            "body": "If you want financial compensation in exchange for intercourse or time spent, sugar is for you. \n\nIf you want a relationship between equals based upon mutual attraction and compatibility without a primary financial focus, then go for regular dating. \n\nIf they were the same thing, we wouldn't have made up a term for sugaring. They are two different things. Stop deluding yourself.",
            "author": "MxMonstera",
            "id": "feh8gpb",
            "parent_id": "t1_feh6gxe",
            "score": 3,
            "created_utc": 1579111314.0,
            "replies": [
                {
                    "body": "> If you want financial compensation in exchange for intercourse and time spent, sugar relationship is for you. \n\nThen what is escorting if, as you said, f they were the same thing, we wouldn't have made up a term for sugaring.",
                    "author": "scott7sd",
                    "id": "feha8ew",
                    "parent_id": "t1_feh8gpb",
                    "score": 0,
                    "created_utc": 1579112384.0,
                    "replies": [
                        {
                            "body": "If you need more explaining, I suggest you use google or pay me for my time. Peace.",
                            "author": "MxMonstera",
                            "id": "fehedf1",
                            "parent_id": "t1_feha8ew",
                            "score": 10,
                            "created_utc": 1579114811.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "It would not be a sugar relationship. It would be dating Brad Pitt",
            "author": "kitten_ftw",
            "id": "fejccvm",
            "parent_id": "t1_feh6gxe",
            "score": 1,
            "created_utc": 1579166937.0,
            "replies": []
        },
        {
            "body": "You are saying that you feel comfortable twisting reality to suit your definitions. And I'm saying \"nah, that's not cool\" \n\nTransactional arrangements = escorting, sugaring, sex work, etc. \n\nThere's not a damn thing wrong with transactional arrangements so long as you are honest with yourself and the other person.  Regular dating isn't transactional. Or if it is, you should reevaluate your relationship ;p",
            "author": "MxMonstera",
            "id": "feh8oip",
            "parent_id": "t1_feh6ls0",
            "score": 4,
            "created_utc": 1579111445.0,
            "replies": []
        },
        {
            "body": "Because they have sugar babies on the side",
            "author": null,
            "id": "fehhrcw",
            "parent_id": "t1_feh9m84",
            "score": 1,
            "created_utc": 1579116790.0,
            "replies": []
        },
        {
            "body": "I DM'ed you.",
            "author": null,
            "id": "fekd0b3",
            "parent_id": "t1_feji9ub",
            "score": 1,
            "created_utc": 1579197476.0,
            "replies": []
        },
        {
            "body": "Lol🤣🤣 I'm going to have to check that one out",
            "author": "kitten_ftw",
            "id": "felzxaw",
            "parent_id": "t1_fekin8q",
            "score": 1,
            "created_utc": 1579235360.0,
            "replies": []
        },
        {
            "body": "I see your point. I've never been to Hollywood before. I always use condoms. I think a lot of SBs and escorts are more likely to use protection than your average party goer. But I feel uncomfortable, personally making assumptions about men that are bisexual. But as a young woman who loved to party, do drugs and went through a promiscuous phase; I wasn't very careful. I got lucky. Now as a SW I always use protection. I do agree that SBs are probably more aware of the dangers of unprotected sex",
            "author": "kitten_ftw",
            "id": "fem1ajw",
            "parent_id": "t1_fekatzy",
            "score": 1,
            "created_utc": 1579236524.0,
            "replies": [
                {
                    "body": "> assumptions about men that are bisexual\n\nsadly the stats don't lie",
                    "author": "pinotandsugar",
                    "id": "fem7mp0",
                    "parent_id": "t1_fem1ajw",
                    "score": 1,
                    "created_utc": 1579242672.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "> If you want financial compensation in exchange for intercourse and time spent, sugar relationship is for you. \n\nThen what is escorting if, as you said, f they were the same thing, we wouldn't have made up a term for sugaring.",
            "author": "scott7sd",
            "id": "feha8ew",
            "parent_id": "t1_feh8gpb",
            "score": 0,
            "created_utc": 1579112384.0,
            "replies": [
                {
                    "body": "If you need more explaining, I suggest you use google or pay me for my time. Peace.",
                    "author": "MxMonstera",
                    "id": "fehedf1",
                    "parent_id": "t1_feha8ew",
                    "score": 10,
                    "created_utc": 1579114811.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "> assumptions about men that are bisexual\n\nsadly the stats don't lie",
            "author": "pinotandsugar",
            "id": "fem7mp0",
            "parent_id": "t1_fem1ajw",
            "score": 1,
            "created_utc": 1579242672.0,
            "replies": []
        },
        {
            "body": "If you need more explaining, I suggest you use google or pay me for my time. Peace.",
            "author": "MxMonstera",
            "id": "fehedf1",
            "parent_id": "t1_feha8ew",
            "score": 10,
            "created_utc": 1579114811.0,
            "replies": []
        }
    ]
}