{
    "title": "Snake ass mfs",
    "post_id": "zd0lb7",
    "post_url": "https://www.reddit.com/r/dankruto/comments/zd0lb7/snake_ass_mfs/",
    "author": "Fulltime_Introvert",
    "body": "",
    "url": "https://i.redd.it/cs1rv9hgb14a1.png",
    "score": 5324,
    "upvote_ratio": 0.99,
    "created_utc": 1670226527.0,
    "num_comments": 157,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "It’s kind of fucked up how most of the town was Saved perhaps even personally by his father the forth Hokage and no one even fucking told him who his father was. \n\nIm sorry a man risks his life to save me and my whole town and dies in the process, that man’s child is a part of my family now. And not some outcast living alone in a dorm room.\n\n\nEdit: And that child is told his father died a hero saving fucking everyone, including him and that’s why he’s not here. Making him think he was some fucking lost unwanted orphan…it sickens me.",
            "author": "Adrewmc",
            "id": "iz008qk",
            "parent_id": "t3_zd0lb7",
            "score": 335,
            "created_utc": 1670247670.0,
            "replies": [
                {
                    "body": "The town was only told that Naruto has the fox in him, not who his parents were.",
                    "author": "The_TIGER3",
                    "id": "iz025s7",
                    "parent_id": "t1_iz008qk",
                    "score": 123,
                    "created_utc": 1670248687.0,
                    "replies": [
                        {
                            "body": "You’re acting like that should be considered a good thing. \n\nAnd let’s face it many people in that town knew. Kakashi knew, the Third Hokage knew, and I bet most of the BLACK Ops knew, and it’s not like the whole town didn’t know he was expecting.",
                            "author": "Adrewmc",
                            "id": "iz03sd4",
                            "parent_id": "t1_iz025s7",
                            "score": 156,
                            "created_utc": 1670249513.0,
                            "replies": [
                                {
                                    "body": "Exactly. The ones that knew didn't treat him poorly, but were not allowed to tell anyone. Not saying it's wrong or right, just how it is.",
                                    "author": "The_TIGER3",
                                    "id": "iz08ke9",
                                    "parent_id": "t1_iz03sd4",
                                    "score": 69,
                                    "created_utc": 1670251775.0,
                                    "replies": []
                                },
                                {
                                    "body": "The whole Blonde hair Blue eyes thing should've clued them in as well. Imo they're dumb af",
                                    "author": "ChildConsumer66",
                                    "id": "iz2fy22",
                                    "parent_id": "t1_iz03sd4",
                                    "score": 29,
                                    "created_utc": 1670283639.0,
                                    "replies": [
                                        {
                                            "body": "Are you trying to say that Naruto was a German",
                                            "author": "Kanejy",
                                            "id": "j273x2m",
                                            "parent_id": "t1_iz2fy22",
                                            "score": 1,
                                            "created_utc": 1672369570.0,
                                            "replies": [
                                                {
                                                    "body": "Glaube es! (“believe it!” in german, according to google)",
                                                    "author": "Dragowaow",
                                                    "id": "j2bc2c7",
                                                    "parent_id": "t1_j273x2m",
                                                    "score": 2,
                                                    "created_utc": 1672445324.0,
                                                    "replies": []
                                                },
                                                {
                                                    "body": "by that logic so is ino.",
                                                    "author": "bigblackowskiC",
                                                    "id": "j2i7mle",
                                                    "parent_id": "t1_j273x2m",
                                                    "score": 1,
                                                    "created_utc": 1672584674.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "Yes, but not like there are tons of blond haired and blue eyed people in the village lol! Could be an easy educated guess for an adult",
                            "author": "vk136",
                            "id": "iz0gag1",
                            "parent_id": "t1_iz025s7",
                            "score": 48,
                            "created_utc": 1670255175.0,
                            "replies": [
                                {
                                    "body": "You're not wrong, but does anyone from the show think Lee is Guy's son even though they're identical.",
                                    "author": "The_TIGER3",
                                    "id": "iz0mxg7",
                                    "parent_id": "t1_iz0gag1",
                                    "score": 22,
                                    "created_utc": 1670257876.0,
                                    "replies": [
                                        {
                                            "body": "TBF I thought Lee was Guys' son at first and when I first picked up the series I saw the 4th's face on the rock, paused the episode and said \"That guy on the rock is either Naruto's dad or grandad.\" the resemblance was so great that I knew who his dad was near instantly.",
                                            "author": "Zombiecidialfreak",
                                            "id": "iz0ysyl",
                                            "parent_id": "t1_iz0mxg7",
                                            "score": 34,
                                            "created_utc": 1670262489.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "Not really a similar comparison! Lee was a relatively less popular kid and people didn’t really know him. Naruto used to play pranks and was known as an annoying kid from most of the villagers from the start!\n\nIf a kid is annoying you, your first question is probably “who the hell are the kid’s parents?” and the theories could start from there\n\nAlso the fact that an uzumaki was pregnant, she was basically the First Lady by being the hokage’s wife. And then comes along a kid with the same name and features similar to that of the most recent hokage! Not at all hard to predict his lineage!",
                                            "author": "vk136",
                                            "id": "iz0ovg8",
                                            "parent_id": "t1_iz0mxg7",
                                            "score": 24,
                                            "created_utc": 1670258657.0,
                                            "replies": [
                                                {
                                                    "body": "Very valid statement. I was more trying to reference how anime land is sometimes best left unquestioned.",
                                                    "author": "The_TIGER3",
                                                    "id": "iz0qlhi",
                                                    "parent_id": "t1_iz0ovg8",
                                                    "score": 12,
                                                    "created_utc": 1670259336.0,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "body": "That’s different, lee tailored himself to look like guy, it was genes",
                                            "author": "erenyeager255",
                                            "id": "j0yorvj",
                                            "parent_id": "t1_iz0mxg7",
                                            "score": 1,
                                            "created_utc": 1671537183.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "There’s not a lot of blond haired and blue eyed people in the village that we know of. Doesn’t mean they aren’t out there.\n\nAnd considering Kushina’s seal weakens during pregnancy, I’m pretty sure aside from people who personally know her, no one else knew she was pregnant. Very few people are supposed to know about it.\n\nAlso, considering that Minato has a lot of enemies and that was significant enough for Naruto to take the Uzumaki name instead of Namikaze, I’m pretty sure Minato would’ve kept his relationship to Kushina a secret as well to the masses.",
                                    "author": "BoneeBones",
                                    "id": "iz0oghc",
                                    "parent_id": "t1_iz0gag1",
                                    "score": 3,
                                    "created_utc": 1670258490.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "Ah yes, he just looks EXACTLY like the guy who ruled them for years, and his parents are missing… and the Hokage’s pregnant wife died with him…",
                            "author": "Heroright",
                            "id": "iz1isw1",
                            "parent_id": "t1_iz025s7",
                            "score": 6,
                            "created_utc": 1670270186.0,
                            "replies": []
                        },
                        {
                            "body": "His name is uzamaki naruto. The name of jirayas hero with the family name of the 3rd hokages wife. Lets not forget the blond hair which isnt a thing in the uzamaki clan since he got it from his dad. They all knew!",
                            "author": "ceelo18",
                            "id": "iz1bi0g",
                            "parent_id": "t1_iz025s7",
                            "score": 3,
                            "created_utc": 1670267390.0,
                            "replies": []
                        },
                        {
                            "body": "Ah yes, he just looks EXACTLY like the guy who ruled them for years, and his parents are missing… and the Hokage’s pregnant wife died with him…",
                            "author": "Heroright",
                            "id": "iz1is02",
                            "parent_id": "t1_iz025s7",
                            "score": 1,
                            "created_utc": 1670270176.0,
                            "replies": []
                        },
                        {
                            "body": "If u use that logic, when naruto was given uzumaki as his last name and had yellow hair, it was obvious he was minatos son. Everyone knew minatos wife and an uzumaki with yellow hair is uncommon to the leaf",
                            "author": "PooKindle",
                            "id": "iz20uvd",
                            "parent_id": "t1_iz025s7",
                            "score": 1,
                            "created_utc": 1670277228.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "You only say this because you know the entire situation.\n\nMinato was cautious of his enemies going after his son, so Naruto took on the name Uzumaki. Kushina also went by Uzumaki, not Namikaze. I think the fact that they were a couple was kept a secret from the masses.\n\nKushina’s seal on the Nine Tails also weakens during pregnancy, so that is supposed to be a secret from the masses as well. I think I remember the elders being pissed that Kushina went around town and told Mikoto.\n\nNone of the villagers know anything. All they knew was that the 4th saved them all and that Nine Tails is sealed in Naruto’s body. They don’t know Naruto’s relationship to the 4th.\n\nThe 4th Hokage sealing the Nine Tails inside the body of a boy doesn’t tell us anything about the boy’s lineage. For all we know, the 4th used the boy because the boy was evil and compatible with the Nine Tails. The fact that Naruto grew up to be mischievous could support the idea.",
                    "author": "BoneeBones",
                    "id": "iz0q2sr",
                    "parent_id": "t1_iz008qk",
                    "score": 18,
                    "created_utc": 1670259136.0,
                    "replies": [
                        {
                            "body": "To add on, tailed beasts were pretty much bargaining chips balancing power between nations, but there were also incidents where people get creative like putting one in rin to release it when she reaches konoha. If they knew he's minato son I'm pretty sure some countries will start getting ideas on top of massive political upheaval. \n\nThat said, living off instant ramen? Sarutobi could do better heh.",
                            "author": "LookAtItGo123",
                            "id": "iz1e90z",
                            "parent_id": "t1_iz0q2sr",
                            "score": 7,
                            "created_utc": 1670268458.0,
                            "replies": []
                        },
                        {
                            "body": "One of the best analysis in awhile. Last piece to add. Given his entitlement at young age that turned into hard work and perseverance. How would it affected his character development knowing before he could appreciate it? \n\nPlus we all knew and how much angst and anticipation did it create in the series for him to find out?",
                            "author": "TheBigDiesel619",
                            "id": "j1n91jp",
                            "parent_id": "t1_iz0q2sr",
                            "score": 1,
                            "created_utc": 1671999795.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Dark naruto kind of addresses this",
                    "author": "LikeRealityDislike",
                    "id": "iz1d7f5",
                    "parent_id": "t1_iz008qk",
                    "score": 5,
                    "created_utc": 1670268052.0,
                    "replies": []
                },
                {
                    "body": "Well it was too protect him as he could be a target for assassination. That said for him to be only known as the jinchuriki is cruel rather he should have been adopted by village ninja or even by 3rd hokage(or even his children since everyone knows konahamaru)",
                    "author": "Nightstriker5124",
                    "id": "iz148x1",
                    "parent_id": "t1_iz008qk",
                    "score": 2,
                    "created_utc": 1670264577.0,
                    "replies": [
                        {
                            "body": "Letting a powerful jinchuicki run around as a small child practically completely unsupervised seems like a weird way to protect a child to me but idk…maybe give him like a home, a guardian that watches over him…frankly the raising of Naruto is disrespectful to his family, and the and should bring shame upon the village. None of that was his fault.",
                            "author": "Adrewmc",
                            "id": "iz16dnv",
                            "parent_id": "t1_iz148x1",
                            "score": 3,
                            "created_utc": 1670265399.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Well. No. And anyway that's the premise of the story and the origin story of his will to be recognized. That's why the set up is \"nobody knew\"... They loved him for him, due to his actions, and not from a reflection of his father.\n\nI mean you are trying to deconstruct in a bad way the main reason for him being who he is 😳",
                    "author": "il_Dudre",
                    "id": "iz27gyl",
                    "parent_id": "t1_iz008qk",
                    "score": 1,
                    "created_utc": 1670279992.0,
                    "replies": []
                },
                {
                    "body": "It is because 3rd Hokage is fucked everything up. He should cover up Naruto with something but just let everyone know.",
                    "author": "raja_afiq1991",
                    "id": "iz3qlj4",
                    "parent_id": "t1_iz008qk",
                    "score": 1,
                    "created_utc": 1670306987.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I mean isn't that what Naruto was tryna do the entire time tho? Gain the acknowledgement of the villagers?",
            "author": "sukezanebaro",
            "id": "iyzgavh",
            "parent_id": "t3_zd0lb7",
            "score": 225,
            "created_utc": 1670232837.0,
            "replies": [
                {
                    "body": "yeah, but if you're out here hatting on someone for years then show up expecting to get into their birthday party once they make it big because you knew him then, thats fake as fuck.",
                    "author": "nizzy2k11",
                    "id": "iyzpdi0",
                    "parent_id": "t1_iyzgavh",
                    "score": 218,
                    "created_utc": 1670240735.0,
                    "replies": [
                        {
                            "body": "Idk if someone, (*checks notes*), has a demon within them that killed a shit ton of my friends and family and destroyed a significant portion of my village, i might be inclined to be wary of said individual until his full control over aforementioned demon is proven.",
                            "author": "JAM3SBND",
                            "id": "iyzvsw2",
                            "parent_id": "t1_iyzpdi0",
                            "score": 93,
                            "created_utc": 1670245076.0,
                            "replies": [
                                {
                                    "body": "Staying wary is one thing. Treating him like shit is another 💀💀💀",
                                    "author": "grapesssszz",
                                    "id": "iz0p4rb",
                                    "parent_id": "t1_iyzvsw2",
                                    "score": 25,
                                    "created_utc": 1670258759.0,
                                    "replies": [
                                        {
                                            "body": "All they did was avoid him bruh",
                                            "author": "JoTheAnimator",
                                            "id": "iz2h62j",
                                            "parent_id": "t1_iz0p4rb",
                                            "score": -6,
                                            "created_utc": 1670284178.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "They didn't treat him like shit, they just let him be.",
                                            "author": "MrLowkey13",
                                            "id": "iz11lx9",
                                            "parent_id": "t1_iz0p4rb",
                                            "score": -13,
                                            "created_utc": 1670263556.0,
                                            "replies": [
                                                {
                                                    "body": "Yes they did tho??",
                                                    "author": "grapesssszz",
                                                    "id": "iz1wvxx",
                                                    "parent_id": "t1_iz11lx9",
                                                    "score": 20,
                                                    "created_utc": 1670275635.0,
                                                    "replies": [
                                                        {
                                                            "body": "They just avoided him tho?",
                                                            "author": "MrLowkey13",
                                                            "id": "iz213vv",
                                                            "parent_id": "t1_iz1wvxx",
                                                            "score": -9,
                                                            "created_utc": 1670277329.0,
                                                            "replies": [
                                                                {
                                                                    "body": "That doesn’t make it any better to basically shun a child who didn’t ask to have these things happen to them and who had no control in the events that led to him being shunned.",
                                                                    "author": "Dragon-Titan",
                                                                    "id": "j15ndv3",
                                                                    "parent_id": "t1_iz213vv",
                                                                    "score": 1,
                                                                    "created_utc": 1671656927.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "No, but it's common sense to avoid a walking nuke.",
                                                                            "author": "MrLowkey13",
                                                                            "id": "j15tsxv",
                                                                            "parent_id": "t1_j15ndv3",
                                                                            "score": 3,
                                                                            "created_utc": 1671659505.0,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "Ichiraku didn’t hate on him, he too was a common man. It’s just how you treat any person, being friends is a different story.",
                                    "author": "antiray",
                                    "id": "iz0ubjy",
                                    "parent_id": "t1_iyzvsw2",
                                    "score": 6,
                                    "created_utc": 1670260802.0,
                                    "replies": []
                                },
                                {
                                    "body": "And Naruto was also a shithead troublemaker. He had to grow up and become a better person and people started to like him more.",
                                    "author": "examm",
                                    "id": "iz00j3g",
                                    "parent_id": "t1_iyzvsw2",
                                    "score": 47,
                                    "created_utc": 1670247826.0,
                                    "replies": [
                                        {
                                            "body": "He was only a troublemaker because of the isolation from everyone. He created trouble because that was the only way his lonely self got attention.",
                                            "author": "Imconfusedithink",
                                            "id": "iz02n9r",
                                            "parent_id": "t1_iz00j3g",
                                            "score": 55,
                                            "created_utc": 1670248940.0,
                                            "replies": [
                                                {
                                                    "body": "Do you think about every person’s back story when they’re annoying? No. I doubt your standard villager cared they were the cause of anything, they saw an annoying kid and treated him as such. You’re not taking into account standard human behavior or the context we only had as the viewer.",
                                                    "author": "examm",
                                                    "id": "iz03idq",
                                                    "parent_id": "t1_iz02n9r",
                                                    "score": 45,
                                                    "created_utc": 1670249377.0,
                                                    "replies": [
                                                        {
                                                            "body": "True! It's not like the villagers saw the 100 flashbacks of that swing",
                                                            "author": "spookyghosties",
                                                            "id": "iz0peuf",
                                                            "parent_id": "t1_iz03idq",
                                                            "score": 13,
                                                            "created_utc": 1670258871.0,
                                                            "replies": []
                                                        },
                                                        {
                                                            "body": "People are so quick to judge even if they know someone has a troubled past irl. Most people live under standard villager mindset so there's no benefit holding it against them even.",
                                                            "author": "Kirogu",
                                                            "id": "iz1yw2o",
                                                            "parent_id": "t1_iz03idq",
                                                            "score": 1,
                                                            "created_utc": 1670276437.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "Well said!",
                                    "author": "LORD_HOKAGE_",
                                    "id": "iz04t2i",
                                    "parent_id": "t1_iyzvsw2",
                                    "score": 1,
                                    "created_utc": 1670250013.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "I mean he literally saved them from being killed by pain",
                            "author": "darcenator411",
                            "id": "iz3bs6h",
                            "parent_id": "t1_iyzpdi0",
                            "score": 1,
                            "created_utc": 1670298320.0,
                            "replies": [
                                {
                                    "body": "cool motive, still fake fucks.",
                                    "author": "nizzy2k11",
                                    "id": "iz3cdmv",
                                    "parent_id": "t1_iz3bs6h",
                                    "score": 2,
                                    "created_utc": 1670298618.0,
                                    "replies": [
                                        {
                                            "body": "I mean they could be genuinely grateful he saved them is what I meant",
                                            "author": "darcenator411",
                                            "id": "iz3l9b8",
                                            "parent_id": "t1_iz3cdmv",
                                            "score": 2,
                                            "created_utc": 1670303471.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "[deleted]",
                                            "author": null,
                                            "id": "iz4s1et",
                                            "parent_id": "t1_iz3cdmv",
                                            "score": 1,
                                            "created_utc": 1670335425.0,
                                            "replies": [
                                                {
                                                    "body": "None of them know where he is. And it was only the Shinobi who were always more respectful of Naruto compared to the normal people of the village.",
                                                    "author": "nizzy2k11",
                                                    "id": "iz5zhm7",
                                                    "parent_id": "t1_iz4s1et",
                                                    "score": 1,
                                                    "created_utc": 1670353067.0,
                                                    "replies": [
                                                        {
                                                            "body": "[deleted]",
                                                            "author": null,
                                                            "id": "iz6h841",
                                                            "parent_id": "t1_iz5zhm7",
                                                            "score": 1,
                                                            "created_utc": 1670359866.0,
                                                            "replies": [
                                                                {
                                                                    "body": "The Shinobi were never the ones offensively persecuting Naruto. Most of the students in his class weren't instructed to avoid him, especially the ones with ninja parents. Idk who you think this post is about, but it's not really about the ninjas who all know who his father is, who all know what he is, and who all know what is life is like.",
                                                                    "author": "nizzy2k11",
                                                                    "id": "iz6i33j",
                                                                    "parent_id": "t1_iz6h841",
                                                                    "score": 1,
                                                                    "created_utc": 1670360188.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "[deleted]",
                                                                            "author": null,
                                                                            "id": "iz6j88m",
                                                                            "parent_id": "t1_iz6i33j",
                                                                            "score": 1,
                                                                            "created_utc": 1670360626.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": ">But none of civilians or ninja were ever attacking or abusing him as a kid. \n\nThat's not what happened lol.",
                                                                                    "author": "nizzy2k11",
                                                                                    "id": "iz6kku4",
                                                                                    "parent_id": "t1_iz6j88m",
                                                                                    "score": 1,
                                                                                    "created_utc": 1670361148.0,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I felt same way but it seems this is based on Japanese culture. I may be wrong though.",
            "author": "careytommy37",
            "id": "iyzodcw",
            "parent_id": "t3_zd0lb7",
            "score": 40,
            "created_utc": 1670239946.0,
            "replies": [
                {
                    "body": "“In Japan is customary to be rood af until it benefits you”",
                    "author": "-ShagginTurtles-",
                    "id": "iz0qddj",
                    "parent_id": "t1_iyzodcw",
                    "score": 43,
                    "created_utc": 1670259250.0,
                    "replies": [
                        {
                            "body": "rude",
                            "author": "warisverybad",
                            "id": "iz1d7j9",
                            "parent_id": "t1_iz0qddj",
                            "score": 10,
                            "created_utc": 1670268053.0,
                            "replies": []
                        },
                        {
                            "body": "No. In Japan people mind their business and people who are abnormal or strange, are usually isolated because Japan is very monolithic",
                            "author": "JoTheAnimator",
                            "id": "iz2hd3u",
                            "parent_id": "t1_iz0qddj",
                            "score": 5,
                            "created_utc": 1670284264.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Except Hinata and Iruka, everyone else is bitch ass",
            "author": "gab_rab_24",
            "id": "iyzcks5",
            "parent_id": "t3_zd0lb7",
            "score": 104,
            "created_utc": 1670229364.0,
            "replies": [
                {
                    "body": "And the ramen shop owner and his daughter",
                    "author": "Zetsu-Akatsuki",
                    "id": "iyzde81",
                    "parent_id": "t1_iyzcks5",
                    "score": 128,
                    "created_utc": 1670230107.0,
                    "replies": [
                        {
                            "body": "Teuchi and Ayame",
                            "author": "Divine_thunder",
                            "id": "iyzif76",
                            "parent_id": "t1_iyzde81",
                            "score": 49,
                            "created_utc": 1670234798.0,
                            "replies": []
                        },
                        {
                            "body": "That was his daughter?",
                            "author": "careytommy37",
                            "id": "iyzogh2",
                            "parent_id": "t1_iyzde81",
                            "score": 12,
                            "created_utc": 1670240015.0,
                            "replies": []
                        },
                        {
                            "body": "And Danzo, he keeps it real",
                            "author": "languish24",
                            "id": "iz0j4kd",
                            "parent_id": "t1_iyzde81",
                            "score": 3,
                            "created_utc": 1670256332.0,
                            "replies": [
                                {
                                    "body": "Nah Danzo was a little bitch.",
                                    "author": "Xillia_Maxwell",
                                    "id": "iz0vf2b",
                                    "parent_id": "t1_iz0j4kd",
                                    "score": 11,
                                    "created_utc": 1670261226.0,
                                    "replies": [
                                        {
                                            "body": "So I guess yall still need a /s huh?",
                                            "author": "languish24",
                                            "id": "iz12r6g",
                                            "parent_id": "t1_iz0vf2b",
                                            "score": 8,
                                            "created_utc": 1670264003.0,
                                            "replies": [
                                                {
                                                    "body": "It’s an anime sub, probably the least socially aware group in the world, you’ll always need the /s",
                                                    "author": "Resident-Syllabub-74",
                                                    "id": "iz666ya",
                                                    "parent_id": "t1_iz12r6g",
                                                    "score": 3,
                                                    "created_utc": 1670355673.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "I won't blame the kids of Naruto's generation. They're the one who accepted Naruto. Prob only the adults are such",
                    "author": "Blankb01",
                    "id": "iyze9fq",
                    "parent_id": "t1_iyzcks5",
                    "score": 53,
                    "created_utc": 1670230907.0,
                    "replies": []
                },
                {
                    "body": "How dare you forget ramen guy and his daughter",
                    "author": "Proof-Exercise984",
                    "id": "iyzq4p8",
                    "parent_id": "t1_iyzcks5",
                    "score": 13,
                    "created_utc": 1670241295.0,
                    "replies": []
                },
                {
                    "body": "People always forget kakashi he was a real one from the start smh",
                    "author": "Ebb8505revenge",
                    "id": "iyzjn3n",
                    "parent_id": "t1_iyzcks5",
                    "score": 18,
                    "created_utc": 1670235901.0,
                    "replies": []
                },
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "iyzdb9m",
                    "parent_id": "t1_iyzcks5",
                    "score": 6,
                    "created_utc": 1670230031.0,
                    "replies": [
                        {
                            "body": "Oh, wait I also wanna include Might Gai and Rock Lee\nand Ramen Guy",
                            "author": "gab_rab_24",
                            "id": "iyzder3",
                            "parent_id": "t1_iyzdb9m",
                            "score": 18,
                            "created_utc": 1670230120.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Shikamaru and choji were his friends",
                    "author": "MFT12",
                    "id": "iyzxzre",
                    "parent_id": "t1_iyzcks5",
                    "score": 5,
                    "created_utc": 1670246389.0,
                    "replies": []
                },
                {
                    "body": "Yeah, those twi should be hanged on another three, separated from the rest of Konoha",
                    "author": "Damaaain",
                    "id": "iyzf8n5",
                    "parent_id": "t1_iyzcks5",
                    "score": 4,
                    "created_utc": 1670231827.0,
                    "replies": []
                },
                {
                    "body": "Weren't Shikamaru and Choji also shown to play/hangout with kid Naruto every now and then?",
                    "author": "UnoLaLaLa",
                    "id": "iyzu8uv",
                    "parent_id": "t1_iyzcks5",
                    "score": 5,
                    "created_utc": 1670244106.0,
                    "replies": [
                        {
                            "body": "That was some filler and retcon scenes,",
                            "author": "CEO_of_discord69",
                            "id": "iyzwhhz",
                            "parent_id": "t1_iyzu8uv",
                            "score": 18,
                            "created_utc": 1670245493.0,
                            "replies": [
                                {
                                    "body": "I have yet to read the manga, but that just sounds like a fail in the manga department. Shikamaru would definitely make his own unbiased opinion on Naruto. Choji just likes everyone that doesn't bully him. Easy friends.",
                                    "author": "The_TIGER3",
                                    "id": "iz01ism",
                                    "parent_id": "t1_iyzwhhz",
                                    "score": 7,
                                    "created_utc": 1670248354.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Yeah, Naruto should've helped Sasuke to destroy it, instead of hindering him",
            "author": "Damaaain",
            "id": "iyzf0sx",
            "parent_id": "t3_zd0lb7",
            "score": 107,
            "created_utc": 1670231623.0,
            "replies": [
                {
                    "body": "Sasuke was right",
                    "author": "Murky_Blueberry2617",
                    "id": "iyzi765",
                    "parent_id": "t1_iyzf0sx",
                    "score": 77,
                    "created_utc": 1670234596.0,
                    "replies": [
                        {
                            "body": "He's always right",
                            "author": "Damaaain",
                            "id": "iyzq6tb",
                            "parent_id": "t1_iyzi765",
                            "score": 24,
                            "created_utc": 1670241337.0,
                            "replies": []
                        },
                        {
                            "body": "The uchiha in general were right about Konoha. It was a corrupt village. Itachi was a major traitor and a complete tool for turning on the uchiha. He should've helped lead the takeover and ouster of Hiruzen, Danzo and the other old fucks.",
                            "author": "U_Arent_Special",
                            "id": "j0awsl2",
                            "parent_id": "t1_iyzi765",
                            "score": 6,
                            "created_utc": 1671094975.0,
                            "replies": [
                                {
                                    "body": "I agree. The Uchiha deserved justice. Too bad Sasuke got beaten by Naruto, he would have probably finished off those 2 old idiots if that happened.",
                                    "author": "Murky_Blueberry2617",
                                    "id": "j0d40fz",
                                    "parent_id": "t1_j0awsl2",
                                    "score": 3,
                                    "created_utc": 1671133711.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "I've been saying this from the start. And why didn't the third take him under his wing. Why did the village know he had the nine tails but he wasn't the 4tgs son. Bull shit",
                    "author": "Dr_nobby",
                    "id": "iz0b0mg",
                    "parent_id": "t1_iyzf0sx",
                    "score": 23,
                    "created_utc": 1670252897.0,
                    "replies": []
                },
                {
                    "body": "Things are never that simple... Do you think the whole population was bad?",
                    "author": "Divine_thunder",
                    "id": "iyzie62",
                    "parent_id": "t1_iyzf0sx",
                    "score": -15,
                    "created_utc": 1670234772.0,
                    "replies": [
                        {
                            "body": "Yes, they need to get to know Pain",
                            "author": "Damaaain",
                            "id": "iyzq7ar",
                            "parent_id": "t1_iyzie62",
                            "score": 29,
                            "created_utc": 1670241347.0,
                            "replies": []
                        },
                        {
                            "body": "I mean literally no one even talked to him with respect except his sensei but still.",
                            "author": "Specific-Raspberry94",
                            "id": "iz3xqqq",
                            "parent_id": "t1_iyzie62",
                            "score": 1,
                            "created_utc": 1670312570.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "They adressed this, with the whole \"Real Naruto\" thing",
            "author": "Admirable-Store9362",
            "id": "iyzolda",
            "parent_id": "t3_zd0lb7",
            "score": 15,
            "created_utc": 1670240124.0,
            "replies": []
        },
        {
            "body": "The villagers are somewhat justified. \n\nThe Kyuubi destroyed nearly half of their fucking village which led to the death of their many friends and family members. And it's not as if the villagers know anything about fuinjutsu, even most shinobi know nothing more than that it exists.\n\nAnd you can't blame the kids either, they were strictly prohibited to interact with naruto \n\nAlso, I want to ask you what tf was Jiraiya doing for 12 years when naruto needed him the most",
            "author": "CEO_of_discord69",
            "id": "iyzg6vn",
            "parent_id": "t3_zd0lb7",
            "score": 131,
            "created_utc": 1670232730.0,
            "replies": [
                {
                    "body": "He was on a more important mission. To write porn.",
                    "author": "TheSomberWolf",
                    "id": "iyzifqe",
                    "parent_id": "t1_iyzg6vn",
                    "score": 157,
                    "created_utc": 1670234811.0,
                    "replies": [
                        {
                            "body": "It has even been adapted into a movie according to the latest side story.",
                            "author": "LookAtItGo123",
                            "id": "iz01owe",
                            "parent_id": "t1_iyzifqe",
                            "score": 19,
                            "created_utc": 1670248442.0,
                            "replies": [
                                {
                                    "body": "So does that mean the first movie is canon now? Or just a coincidence?",
                                    "author": "MrGame22",
                                    "id": "iz1yqkv",
                                    "parent_id": "t1_iz01owe",
                                    "score": 3,
                                    "created_utc": 1670276377.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "It was more important though. Like seriously, those villagers didn’t deserve to live anyways and I hope their families suffered greatly.",
                            "author": "MaskOfReality",
                            "id": "iyzl3bj",
                            "parent_id": "t1_iyzifqe",
                            "score": -15,
                            "created_utc": 1670237198.0,
                            "replies": [
                                {
                                    "body": "Found Pain’s reddit account",
                                    "author": "rumblevn",
                                    "id": "iz01502",
                                    "parent_id": "t1_iyzl3bj",
                                    "score": 26,
                                    "created_utc": 1670248152.0,
                                    "replies": []
                                },
                                {
                                    "body": "Hmm people ignoring a child is not a reason I can find to justify killing them if they were abusing naruto then yes but there only one scene where we see that.",
                                    "author": "GHR501",
                                    "id": "iyzu10v",
                                    "parent_id": "t1_iyzl3bj",
                                    "score": 9,
                                    "created_utc": 1670243968.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Lol his entire relationship with Naruto’s father is such a retcon. Naruto literally just runs into Jiraiya at a spa.",
                    "author": "SinisterPuppy",
                    "id": "iz05ai7",
                    "parent_id": "t1_iyzg6vn",
                    "score": 18,
                    "created_utc": 1670250245.0,
                    "replies": []
                },
                {
                    "body": "> The villagers are somewhat justified.\n\nits understandable, but i wouldn't call it justified. naruto has nothing to do with the 9 tails, and he didn't choose to be the vessel. blaming him is just outright wrong, but an emotional group would understandably make that judgement.",
                    "author": "nizzy2k11",
                    "id": "iyzp9a9",
                    "parent_id": "t1_iyzg6vn",
                    "score": 50,
                    "created_utc": 1670240645.0,
                    "replies": [
                        {
                            "body": "They don’t know how jinchurikki work. For all they know Naruto is just the human body of the nine tails. \n\nOnly we, as the audience know anything about them.",
                            "author": "jonny1211",
                            "id": "iyzpizw",
                            "parent_id": "t1_iyzp9a9",
                            "score": 25,
                            "created_utc": 1670240853.0,
                            "replies": [
                                {
                                    "body": "> They don’t know how jinchurikki work. \n\nso educate them. there is 0 reason to keep naruto's identity secret from everyone when they already know, and there is no reason not the educate them about what being a jinchuriki is like so that they don't make him explode in the middle of the village and kill everyone.",
                                    "author": "nizzy2k11",
                                    "id": "iyzprun",
                                    "parent_id": "t1_iyzpizw",
                                    "score": 29,
                                    "created_utc": 1670241034.0,
                                    "replies": [
                                        {
                                            "body": "That is 100% on Hiruzen as Hokage and mostly likely thanks to being convinced by Danzo and the other 2 elders advice.",
                                            "author": "batmanbnb",
                                            "id": "iyzrc0b",
                                            "parent_id": "t1_iyzprun",
                                            "score": 35,
                                            "created_utc": 1670242161.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "But does anyone in-universe know how jinchurriki work or not, especially Hiruzen and the village elders? \n\nThey only just seal the kyuubi inside a human and try to keep them contained",
                                            "author": "jonny1211",
                                            "id": "iyzwvrq",
                                            "parent_id": "t1_iyzprun",
                                            "score": 7,
                                            "created_utc": 1670245728.0,
                                            "replies": [
                                                {
                                                    "body": "He was married to a previous vessel wasn't he? He should know how it works.",
                                                    "author": "nizzy2k11",
                                                    "id": "iz1peyz",
                                                    "parent_id": "t1_iyzwvrq",
                                                    "score": 1,
                                                    "created_utc": 1670272721.0,
                                                    "replies": [
                                                        {
                                                            "body": "That was Hashirama",
                                                            "author": "jonny1211",
                                                            "id": "iz2ng0w",
                                                            "parent_id": "t1_iz1peyz",
                                                            "score": 1,
                                                            "created_utc": 1670286991.0,
                                                            "replies": [
                                                                {
                                                                    "body": "And he would have been aware of when they moved the 9 tails, it's still not like he didn't know her.",
                                                                    "author": "nizzy2k11",
                                                                    "id": "iz2oeyw",
                                                                    "parent_id": "t1_iz2ng0w",
                                                                    "score": 1,
                                                                    "created_utc": 1670287429.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "But that doesn’t mean he knows how jinchurriki work",
                                                                            "author": "jonny1211",
                                                                            "id": "iz2qbvb",
                                                                            "parent_id": "t1_iz2oeyw",
                                                                            "score": 0,
                                                                            "created_utc": 1670288302.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "someone there does, they know how to control them, they know how to suppress them, they even know how they are psychologically torchered by the tailed beast and how they should handle that, but they elect not to do it, every time.",
                                                                                    "author": "nizzy2k11",
                                                                                    "id": "iz2rbua",
                                                                                    "parent_id": "t1_iz2qbvb",
                                                                                    "score": 1,
                                                                                    "created_utc": 1670288763.0,
                                                                                    "replies": [
                                                                                        {
                                                                                            "body": "Only Uzumakis know the sealing jutsu and Kushina was the one to teach it to Minato so no one other than them knows how to control one",
                                                                                            "author": "jonny1211",
                                                                                            "id": "iz4bm7r",
                                                                                            "parent_id": "t1_iz2rbua",
                                                                                            "score": 1,
                                                                                            "created_utc": 1670325116.0,
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "body": "A theme throughout naruto is mass repression of information. That knowledge on bijus is hidden away from even high level ninja. People fight kages and have no clue what their powers are. Basic history and info is never covered.\n\nWhy? Because if the general public knows that Shit they’ll snitch and share it everywhere. No you have shitloads of bad actors trying to get bijus, copy Hax techniques, etc. Or selling that info to enemies. It’d be a nightmare",
                                            "author": "bilbo_swagginz_boi",
                                            "id": "iz0mjyb",
                                            "parent_id": "t1_iyzprun",
                                            "score": 3,
                                            "created_utc": 1670257723.0,
                                            "replies": [
                                                {
                                                    "body": ">Because if the general public knows that Shit they’ll snitch and share it everywhere.\n\nYet they let Naruto go on mission outside the village and he ended up telling basically everyone around him every time he left the village.",
                                                    "author": "nizzy2k11",
                                                    "id": "iz1pp6y",
                                                    "parent_id": "t1_iz0mjyb",
                                                    "score": 1,
                                                    "created_utc": 1670272829.0,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "body": "Educating people isn’t as simple as saying it. People try to educate people on social issues all the time now and even then half the time it never gets through.",
                                            "author": "examm",
                                            "id": "iz00rau",
                                            "parent_id": "t1_iyzprun",
                                            "score": 5,
                                            "created_utc": 1670247949.0,
                                            "replies": [
                                                {
                                                    "body": "And I don’t think even Hiruzen and the village elders know how jinchuriki work, they just know Minato sealed Kurama within Naruto.",
                                                    "author": "jonny1211",
                                                    "id": "iz01rek",
                                                    "parent_id": "t1_iz00rau",
                                                    "score": 4,
                                                    "created_utc": 1670248479.0,
                                                    "replies": []
                                                },
                                                {
                                                    "body": "And saying nothing is better?",
                                                    "author": "nizzy2k11",
                                                    "id": "iz1phv7",
                                                    "parent_id": "t1_iz00rau",
                                                    "score": 1,
                                                    "created_utc": 1670272752.0,
                                                    "replies": [
                                                        {
                                                            "body": "No. But that’s not the only reason that info was kept secret.",
                                                            "author": "examm",
                                                            "id": "iz1z2cg",
                                                            "parent_id": "t1_iz1phv7",
                                                            "score": 1,
                                                            "created_utc": 1670276506.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "That brings up another question then, why would the villagers need to know he is a jinchurikki in the first place, it just paints a target on his back for another village to kidnap him.",
                                    "author": "MrGame22",
                                    "id": "iz20i9k",
                                    "parent_id": "t1_iyzpizw",
                                    "score": 1,
                                    "created_utc": 1670277088.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "here is a question, why where villagers told Naruto had the nine tails in the first place?",
                    "author": "MrGame22",
                    "id": "iz1yixf",
                    "parent_id": "t1_iyzg6vn",
                    "score": 1,
                    "created_utc": 1670276293.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "\"They changed their ways but the populace still held a grudge, so the only thing to do is taunt/massacre\"",
            "author": "NetherPortals",
            "id": "iyzga7o",
            "parent_id": "t3_zd0lb7",
            "score": 7,
            "created_utc": 1670232820.0,
            "replies": []
        },
        {
            "body": "Ignoring the fact that he never was given a choice in containing the Kyubi. Which is a big one by the way. Everyone ignores the actions of his parents. His dad was the Hokage, people knew that. He was a literal hero of the village. Even if you didn't know who is father was, his mother was an Uzumake. See any other other Uzumakes around? It was no secret she was, pregnant right? Wouldn't take some major detective work to put two and two together.\n\nI get its partial anime logic, but there is no question whose kid he is by looks alone. I get part of Naruto's whole schtick is being recognized and loved. However, I feel it would be just as neat had he matured and realized that he never needed their approval and found his own \"village,\" of people to love him. Village as in a group of people, not a place.",
            "author": "NAbberman",
            "id": "iz0eg2p",
            "parent_id": "t3_zd0lb7",
            "score": 7,
            "created_utc": 1670254400.0,
            "replies": []
        },
        {
            "body": "Tbf i doubt guys like gai sensei,Rock Lee,shino and co hated Naruto even from the start",
            "author": "XxannoyingassxX",
            "id": "iyzunzx",
            "parent_id": "t3_zd0lb7",
            "score": 7,
            "created_utc": 1670244372.0,
            "replies": []
        },
        {
            "body": "If some kid was the container for a demon that destroyed the village, I’d also stay away from him and keep my kids away from him.",
            "author": "HeavensHellFire",
            "id": "iz094bz",
            "parent_id": "t3_zd0lb7",
            "score": 9,
            "created_utc": 1670252029.0,
            "replies": []
        },
        {
            "body": "True",
            "author": "AdFriendly8669",
            "id": "iyzjzqe",
            "parent_id": "t3_zd0lb7",
            "score": 4,
            "created_utc": 1670236219.0,
            "replies": []
        },
        {
            "body": "The entire society irl is like that. No one gives a fuck about u until u prove urself.",
            "author": "tlb7781",
            "id": "iz06ur0",
            "parent_id": "t3_zd0lb7",
            "score": 4,
            "created_utc": 1670250985.0,
            "replies": []
        },
        {
            "body": "The best real life analogy i could think of is like theres this kid in your town who for as much as everyone knows could turn into a nuke and blow up the city if you made him mad so of course people didn’t like him. But then 15 years later that same kid protects everyone from a nuke from north korea so hes a hero. Idk you kinda had to see it from the villagers perspective",
            "author": "sw2bh",
            "id": "iz0j09l",
            "parent_id": "t3_zd0lb7",
            "score": 3,
            "created_utc": 1670256282.0,
            "replies": []
        },
        {
            "body": "Demon who almost destroyed konoha \n\n720 episodes later...\n\nSame demon prevents konoha from destruction",
            "author": "Unlucky-Disaster1588",
            "id": "iz0o4zs",
            "parent_id": "t3_zd0lb7",
            "score": 3,
            "created_utc": 1670258362.0,
            "replies": []
        },
        {
            "body": "Something else that I thought was screwed up was how Minato sacrifice his life just so Kushina could have like 30 minutes to talk to him even though that would mean leaving him all alone during his childhood and being ostracize by the village",
            "author": "Daryno90",
            "id": "iz2co72",
            "parent_id": "t3_zd0lb7",
            "score": 3,
            "created_utc": 1670282213.0,
            "replies": []
        },
        {
            "body": "He was hated really bad tbh I mean who calls a 12 year old orphan with everyone hating him an 'it'?\nI had totally lost it in the first ep itself like who jusgea kids like an it and after he saved the village which is because 'he' wanted to they recognised him and started calling him hero of the village instead of calling him 'it' ... I mean you deep down know that dark Naruto at the waterfall of truth was damn correct but he was too hateful.... And yes this is why I support the post saying that Konoha's villagers and some Shinobi were snake ass fake mfs",
            "author": "FLASH_OP",
            "id": "iz0i732",
            "parent_id": "t3_zd0lb7",
            "score": 2,
            "created_utc": 1670255945.0,
            "replies": []
        },
        {
            "body": "Oh, hey. Been a while since this got reposted here.",
            "author": "drowsy_damad",
            "id": "iz0iprz",
            "parent_id": "t3_zd0lb7",
            "score": 2,
            "created_utc": 1670256159.0,
            "replies": []
        },
        {
            "body": "To be fair most of the people praising him in the 2nd pic would have been children in the 1st, and not really able to form their own opinions. Mostly the adults treated him like shit and the kids simply did because the adults told them to.",
            "author": "DrJoypuck",
            "id": "iz0wyhk",
            "parent_id": "t3_zd0lb7",
            "score": 2,
            "created_utc": 1670261817.0,
            "replies": []
        },
        {
            "body": "Konoha villagers be like:\"ah yes,I will provoke the living walking WMD because I am afraid of him\"",
            "author": "Skitaree",
            "id": "iz3b8k7",
            "parent_id": "t3_zd0lb7",
            "score": 2,
            "created_utc": 1670298053.0,
            "replies": []
        },
        {
            "body": "Whoever says they can't understand Sasuke wanting to burn the Leaf to the fucking ground is just lying.\n\nEVERYONE thinks the Leaf is full of two-faced bastards after seeing this scene.",
            "author": "JokerChaos77",
            "id": "iz3mn2t",
            "parent_id": "t3_zd0lb7",
            "score": 1,
            "created_utc": 1670304335.0,
            "replies": []
        },
        {
            "body": "i can understand this from a comedic standpoint but if this is an actual opinion then is missing the point. naruto slowly gained the approval of the villagers throughout the show. of course naruto would be hated and feared for having a demon that killed many villagers in the past. and ofc people would accept him more as he proved himself to be a hero.",
            "author": "WiseLightskin",
            "id": "iz0cfj6",
            "parent_id": "t3_zd0lb7",
            "score": 0,
            "created_utc": 1670253526.0,
            "replies": [
                {
                    "body": "Also, not many blond haired and blue eyed people in the village too!",
                    "author": "vk136",
                    "id": "iz0gj6v",
                    "parent_id": "t1_iz0cfj6",
                    "score": 1,
                    "created_utc": 1670255274.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "“i dont care what anyone says” as if anyones gonna disagree with this post…?",
            "author": "mystoganslefteye",
            "id": "iz08t21",
            "parent_id": "t3_zd0lb7",
            "score": 0,
            "created_utc": 1670251886.0,
            "replies": []
        },
        {
            "body": "Hinata was the only real one",
            "author": "StatusOmega",
            "id": "iz1saol",
            "parent_id": "t3_zd0lb7",
            "score": 0,
            "created_utc": 1670273825.0,
            "replies": []
        },
        {
            "body": "The leaf village is full of damn fakers",
            "author": "Pink4everUwU",
            "id": "iz0gyg4",
            "parent_id": "t3_zd0lb7",
            "score": 1,
            "created_utc": 1670255446.0,
            "replies": []
        },
        {
            "body": "It's OK they recognized him after he saved them. But anyone asked his forgiveness for how they treated him.",
            "author": "Historical-Ad-3362",
            "id": "iz0lidy",
            "parent_id": "t3_zd0lb7",
            "score": 1,
            "created_utc": 1670257305.0,
            "replies": []
        },
        {
            "body": "Yeah Naruto should have sided with sasuke",
            "author": "idkdidkkdkdj",
            "id": "iz0rm3f",
            "parent_id": "t3_zd0lb7",
            "score": 1,
            "created_utc": 1670259740.0,
            "replies": []
        },
        {
            "body": "Village Hidden in the Bullshit",
            "author": "chrisonetime",
            "id": "iz0xd28",
            "parent_id": "t3_zd0lb7",
            "score": 2,
            "created_utc": 1670261967.0,
            "replies": []
        },
        {
            "body": "The only thing the village did for him was outright refuse to give up his location to pain. Most people didn’t even know where Naruto was and still said you’ll have to kill me before I give up a comrade\n\nWe saw more of this from other ninja though. Regular townspeople can all be thrown out with the bathwater",
            "author": "Jthrowaway162",
            "id": "iz0xdee",
            "parent_id": "t3_zd0lb7",
            "score": 1,
            "created_utc": 1670261970.0,
            "replies": []
        },
        {
            "body": "To be fair those people knew the Nine Tails was in Naruto and Naruto didn’t control it and only a few years prior did that thing almost destroy everything. They saw death and it all.\n\nAt some point people recognized Naruto was in control.\n\n\nThey wernt being shitty to Naruto. They were afraid of the Nine Tails",
            "author": "PikaBabyBoo",
            "id": "iz10ekr",
            "parent_id": "t3_zd0lb7",
            "score": 1,
            "created_utc": 1670263090.0,
            "replies": []
        },
        {
            "body": "Yeah but naruto is forgiving unlike ya’ll",
            "author": "StayApprehensive2455",
            "id": "iz11dwo",
            "parent_id": "t3_zd0lb7",
            "score": 1,
            "created_utc": 1670263468.0,
            "replies": []
        },
        {
            "body": "So we're just gotta ignore how no one ratted him out when Pain attacked, regardless of whether they knew or not? Okay.",
            "author": "hidari_shotaro",
            "id": "iz12dml",
            "parent_id": "t3_zd0lb7",
            "score": 1,
            "created_utc": 1670263856.0,
            "replies": []
        },
        {
            "body": "They don’t like you til you’re winning 🤣🤣",
            "author": "redpotato179",
            "id": "iz18c2o",
            "parent_id": "t3_zd0lb7",
            "score": 1,
            "created_utc": 1670266161.0,
            "replies": []
        },
        {
            "body": "I get that Naruto was the jinchuriki of the tailed beast that almost destroyed the village but treating him like shit when he still *could* destroy the village probably wasn't the best idea",
            "author": "Kobseyy",
            "id": "iz1i2va",
            "parent_id": "t3_zd0lb7",
            "score": 1,
            "created_utc": 1670269916.0,
            "replies": []
        },
        {
            "body": "Hate you til they need you",
            "author": "Almighty_Push91",
            "id": "iz1kdmd",
            "parent_id": "t3_zd0lb7",
            "score": 1,
            "created_utc": 1670270789.0,
            "replies": []
        },
        {
            "body": "Everybody is fuckin fake except the guy with yellow hair",
            "author": "doto2trader",
            "id": "iz1p4c2",
            "parent_id": "t3_zd0lb7",
            "score": 1,
            "created_utc": 1670272611.0,
            "replies": []
        },
        {
            "body": "When naruto was happy the villagers loved him I understood that he liked attention but I kinda hoped he would glare at them or something to make them realize they did something wrong",
            "author": "amiawaffle",
            "id": "iz1r26s",
            "parent_id": "t3_zd0lb7",
            "score": 1,
            "created_utc": 1670273353.0,
            "replies": []
        },
        {
            "body": "They show it right before that scene how the villagers slowly started to accept and respect him over the years and him doing that heroic act sealed the deal though?",
            "author": "_Dumaru_",
            "id": "iz1uf09",
            "parent_id": "t3_zd0lb7",
            "score": 1,
            "created_utc": 1670274652.0,
            "replies": []
        },
        {
            "body": "After being forced to listen to Rudolph the Red Nosed Reindeer a lot lately I realized it is basically the same story",
            "author": "StatusOmega",
            "id": "iz1v56s",
            "parent_id": "t3_zd0lb7",
            "score": 1,
            "created_utc": 1670274939.0,
            "replies": []
        },
        {
            "body": "Naruto?  You mean Rudolph the red nose reindeer?",
            "author": "mega345",
            "id": "iz1y92z",
            "parent_id": "t3_zd0lb7",
            "score": 1,
            "created_utc": 1670276184.0,
            "replies": []
        },
        {
            "body": "![gif](giphy|xr9AQyxLtjlx4IeYtN)",
            "author": null,
            "id": "iz1yp70",
            "parent_id": "t3_zd0lb7",
            "score": 1,
            "created_utc": 1670276361.0,
            "replies": []
        },
        {
            "body": "Yep",
            "author": "AcePhoenix79",
            "id": "iz2ou5w",
            "parent_id": "t3_zd0lb7",
            "score": 1,
            "created_utc": 1670287621.0,
            "replies": []
        },
        {
            "body": "OK I’m still trying to get into the hole anime, but I feel like the Uchiha’s would treat Naruto better than the entire hidden leaf village. Please correct me if I’m wrong.",
            "author": "DrakeStorm71785",
            "id": "iz34p74",
            "parent_id": "t3_zd0lb7",
            "score": 1,
            "created_utc": 1670294886.0,
            "replies": []
        },
        {
            "body": "Leaf village is a representation of society, if you haven't noticed our world is also kinda like this. A rumour by one person is enough to get the judgemental bastards to hate on a person. If Naruto was in our world and people knew there was a demon sealed inside him, they will act exactly the same and the govt. may even try to put him in jail and people might secretly try to kill him. \n\nHis story is just a reversal of the quote \"you either die a hero or love long enough to see yourself become the villain\". Society is too judgemental to either label a good person evil and a bad one good.",
            "author": "MICHELEANARD",
            "id": "iz36r2j",
            "parent_id": "t3_zd0lb7",
            "score": 1,
            "created_utc": 1670295864.0,
            "replies": []
        },
        {
            "body": "I think it's a pretty fair example of people and societies. Judging, discriminating, all the hate and silence he faced. Ignorant until people were forced in a corner of despair.  I think any of us would change our opinions even toward people we hate if they saved the world or even a village.",
            "author": "Visual_Conclusion206",
            "id": "iz3p2y3",
            "parent_id": "t3_zd0lb7",
            "score": 1,
            "created_utc": 1670305940.0,
            "replies": []
        },
        {
            "body": "Before Naruto Shippuden, writer did not mean to have Tails Beast. So he made Naruto a nine tails reincarnation. He was the monster at that time, so the writer made people hate him for destroying the village. He reconsidered the story. \n\nOn another point of view, Naruto is jinchuuriki. Villagers hate him because he has nine tails that destroy the village once and it is still in their memory. They are also afraid that he will lose control once again. 3rd Hokage should cover the story and did not tell Villagers about Naruto but he fucked up. Once he saved the village. The villagers view on him is changing. That's what Naruto wants. People have changed hearts. It is not snake.",
            "author": "raja_afiq1991",
            "id": "iz3ryph",
            "parent_id": "t3_zd0lb7",
            "score": 1,
            "created_utc": 1670307972.0,
            "replies": []
        },
        {
            "body": "World full of fake mf's.",
            "author": "wastedmalice420",
            "id": "iz3ryxg",
            "parent_id": "t3_zd0lb7",
            "score": 1,
            "created_utc": 1670307977.0,
            "replies": []
        },
        {
            "body": "Y’all trash",
            "author": "NoChampionship1361",
            "id": "j0x1f3m",
            "parent_id": "t3_zd0lb7",
            "score": 1,
            "created_utc": 1671499371.0,
            "replies": []
        },
        {
            "body": "Its a bit late, but i think they are blaming Naruto for the death of Minato.",
            "author": "melikepies",
            "id": "j1d73tt",
            "parent_id": "t3_zd0lb7",
            "score": 1,
            "created_utc": 1671800153.0,
            "replies": [
                {
                    "body": "Didn't danzo say Naruto was the nine tailed fox and he was responsible for all their family and friends",
                    "author": "DanielDanvers",
                    "id": "j23dsn6",
                    "parent_id": "t1_j1d73tt",
                    "score": 1,
                    "created_utc": 1672309931.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "absolutely the disrespect is sickening😵",
            "author": "Praline_Afraid",
            "id": "j1kxlfa",
            "parent_id": "t3_zd0lb7",
            "score": 1,
            "created_utc": 1671944944.0,
            "replies": []
        },
        {
            "body": "Na that's a Fukn fact.. been saying this.. fukk all that tryna gain the affection and adoration of a town full of creeps that were willing to treat a child like ABSOLUTE GARBAGE. All cuz of some shit they had absolutely no control over smh.. I would've still became hokage but just cuz I'd rather boss up than be on their level, cuz fukk them lls",
            "author": "TimmyTurner69_",
            "id": "j1szle5",
            "parent_id": "t3_zd0lb7",
            "score": 1,
            "created_utc": 1672113058.0,
            "replies": []
        },
        {
            "body": "T",
            "author": "Aqua22Crafter",
            "id": "j2iw92m",
            "parent_id": "t3_zd0lb7",
            "score": 1,
            "created_utc": 1672595953.0,
            "replies": []
        },
        {
            "body": "Naruto was 1 ramen guy away from turning against the village",
            "author": "chanman789",
            "id": "j2laea0",
            "parent_id": "t3_zd0lb7",
            "score": 1,
            "created_utc": 1672632166.0,
            "replies": []
        },
        {
            "body": "No bc fr js like Gaara💀",
            "author": "pssytightcleanfreshn",
            "id": "j2ras2l",
            "parent_id": "t3_zd0lb7",
            "score": 1,
            "created_utc": 1672746548.0,
            "replies": []
        },
        {
            "body": "The town was only told that Naruto has the fox in him, not who his parents were.",
            "author": "The_TIGER3",
            "id": "iz025s7",
            "parent_id": "t1_iz008qk",
            "score": 123,
            "created_utc": 1670248687.0,
            "replies": [
                {
                    "body": "You’re acting like that should be considered a good thing. \n\nAnd let’s face it many people in that town knew. Kakashi knew, the Third Hokage knew, and I bet most of the BLACK Ops knew, and it’s not like the whole town didn’t know he was expecting.",
                    "author": "Adrewmc",
                    "id": "iz03sd4",
                    "parent_id": "t1_iz025s7",
                    "score": 156,
                    "created_utc": 1670249513.0,
                    "replies": [
                        {
                            "body": "Exactly. The ones that knew didn't treat him poorly, but were not allowed to tell anyone. Not saying it's wrong or right, just how it is.",
                            "author": "The_TIGER3",
                            "id": "iz08ke9",
                            "parent_id": "t1_iz03sd4",
                            "score": 69,
                            "created_utc": 1670251775.0,
                            "replies": []
                        },
                        {
                            "body": "The whole Blonde hair Blue eyes thing should've clued them in as well. Imo they're dumb af",
                            "author": "ChildConsumer66",
                            "id": "iz2fy22",
                            "parent_id": "t1_iz03sd4",
                            "score": 29,
                            "created_utc": 1670283639.0,
                            "replies": [
                                {
                                    "body": "Are you trying to say that Naruto was a German",
                                    "author": "Kanejy",
                                    "id": "j273x2m",
                                    "parent_id": "t1_iz2fy22",
                                    "score": 1,
                                    "created_utc": 1672369570.0,
                                    "replies": [
                                        {
                                            "body": "Glaube es! (“believe it!” in german, according to google)",
                                            "author": "Dragowaow",
                                            "id": "j2bc2c7",
                                            "parent_id": "t1_j273x2m",
                                            "score": 2,
                                            "created_utc": 1672445324.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "by that logic so is ino.",
                                            "author": "bigblackowskiC",
                                            "id": "j2i7mle",
                                            "parent_id": "t1_j273x2m",
                                            "score": 1,
                                            "created_utc": 1672584674.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Yes, but not like there are tons of blond haired and blue eyed people in the village lol! Could be an easy educated guess for an adult",
                    "author": "vk136",
                    "id": "iz0gag1",
                    "parent_id": "t1_iz025s7",
                    "score": 48,
                    "created_utc": 1670255175.0,
                    "replies": [
                        {
                            "body": "You're not wrong, but does anyone from the show think Lee is Guy's son even though they're identical.",
                            "author": "The_TIGER3",
                            "id": "iz0mxg7",
                            "parent_id": "t1_iz0gag1",
                            "score": 22,
                            "created_utc": 1670257876.0,
                            "replies": [
                                {
                                    "body": "TBF I thought Lee was Guys' son at first and when I first picked up the series I saw the 4th's face on the rock, paused the episode and said \"That guy on the rock is either Naruto's dad or grandad.\" the resemblance was so great that I knew who his dad was near instantly.",
                                    "author": "Zombiecidialfreak",
                                    "id": "iz0ysyl",
                                    "parent_id": "t1_iz0mxg7",
                                    "score": 34,
                                    "created_utc": 1670262489.0,
                                    "replies": []
                                },
                                {
                                    "body": "Not really a similar comparison! Lee was a relatively less popular kid and people didn’t really know him. Naruto used to play pranks and was known as an annoying kid from most of the villagers from the start!\n\nIf a kid is annoying you, your first question is probably “who the hell are the kid’s parents?” and the theories could start from there\n\nAlso the fact that an uzumaki was pregnant, she was basically the First Lady by being the hokage’s wife. And then comes along a kid with the same name and features similar to that of the most recent hokage! Not at all hard to predict his lineage!",
                                    "author": "vk136",
                                    "id": "iz0ovg8",
                                    "parent_id": "t1_iz0mxg7",
                                    "score": 24,
                                    "created_utc": 1670258657.0,
                                    "replies": [
                                        {
                                            "body": "Very valid statement. I was more trying to reference how anime land is sometimes best left unquestioned.",
                                            "author": "The_TIGER3",
                                            "id": "iz0qlhi",
                                            "parent_id": "t1_iz0ovg8",
                                            "score": 12,
                                            "created_utc": 1670259336.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "That’s different, lee tailored himself to look like guy, it was genes",
                                    "author": "erenyeager255",
                                    "id": "j0yorvj",
                                    "parent_id": "t1_iz0mxg7",
                                    "score": 1,
                                    "created_utc": 1671537183.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "There’s not a lot of blond haired and blue eyed people in the village that we know of. Doesn’t mean they aren’t out there.\n\nAnd considering Kushina’s seal weakens during pregnancy, I’m pretty sure aside from people who personally know her, no one else knew she was pregnant. Very few people are supposed to know about it.\n\nAlso, considering that Minato has a lot of enemies and that was significant enough for Naruto to take the Uzumaki name instead of Namikaze, I’m pretty sure Minato would’ve kept his relationship to Kushina a secret as well to the masses.",
                            "author": "BoneeBones",
                            "id": "iz0oghc",
                            "parent_id": "t1_iz0gag1",
                            "score": 3,
                            "created_utc": 1670258490.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Ah yes, he just looks EXACTLY like the guy who ruled them for years, and his parents are missing… and the Hokage’s pregnant wife died with him…",
                    "author": "Heroright",
                    "id": "iz1isw1",
                    "parent_id": "t1_iz025s7",
                    "score": 6,
                    "created_utc": 1670270186.0,
                    "replies": []
                },
                {
                    "body": "His name is uzamaki naruto. The name of jirayas hero with the family name of the 3rd hokages wife. Lets not forget the blond hair which isnt a thing in the uzamaki clan since he got it from his dad. They all knew!",
                    "author": "ceelo18",
                    "id": "iz1bi0g",
                    "parent_id": "t1_iz025s7",
                    "score": 3,
                    "created_utc": 1670267390.0,
                    "replies": []
                },
                {
                    "body": "Ah yes, he just looks EXACTLY like the guy who ruled them for years, and his parents are missing… and the Hokage’s pregnant wife died with him…",
                    "author": "Heroright",
                    "id": "iz1is02",
                    "parent_id": "t1_iz025s7",
                    "score": 1,
                    "created_utc": 1670270176.0,
                    "replies": []
                },
                {
                    "body": "If u use that logic, when naruto was given uzumaki as his last name and had yellow hair, it was obvious he was minatos son. Everyone knew minatos wife and an uzumaki with yellow hair is uncommon to the leaf",
                    "author": "PooKindle",
                    "id": "iz20uvd",
                    "parent_id": "t1_iz025s7",
                    "score": 1,
                    "created_utc": 1670277228.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "You only say this because you know the entire situation.\n\nMinato was cautious of his enemies going after his son, so Naruto took on the name Uzumaki. Kushina also went by Uzumaki, not Namikaze. I think the fact that they were a couple was kept a secret from the masses.\n\nKushina’s seal on the Nine Tails also weakens during pregnancy, so that is supposed to be a secret from the masses as well. I think I remember the elders being pissed that Kushina went around town and told Mikoto.\n\nNone of the villagers know anything. All they knew was that the 4th saved them all and that Nine Tails is sealed in Naruto’s body. They don’t know Naruto’s relationship to the 4th.\n\nThe 4th Hokage sealing the Nine Tails inside the body of a boy doesn’t tell us anything about the boy’s lineage. For all we know, the 4th used the boy because the boy was evil and compatible with the Nine Tails. The fact that Naruto grew up to be mischievous could support the idea.",
            "author": "BoneeBones",
            "id": "iz0q2sr",
            "parent_id": "t1_iz008qk",
            "score": 18,
            "created_utc": 1670259136.0,
            "replies": [
                {
                    "body": "To add on, tailed beasts were pretty much bargaining chips balancing power between nations, but there were also incidents where people get creative like putting one in rin to release it when she reaches konoha. If they knew he's minato son I'm pretty sure some countries will start getting ideas on top of massive political upheaval. \n\nThat said, living off instant ramen? Sarutobi could do better heh.",
                    "author": "LookAtItGo123",
                    "id": "iz1e90z",
                    "parent_id": "t1_iz0q2sr",
                    "score": 7,
                    "created_utc": 1670268458.0,
                    "replies": []
                },
                {
                    "body": "One of the best analysis in awhile. Last piece to add. Given his entitlement at young age that turned into hard work and perseverance. How would it affected his character development knowing before he could appreciate it? \n\nPlus we all knew and how much angst and anticipation did it create in the series for him to find out?",
                    "author": "TheBigDiesel619",
                    "id": "j1n91jp",
                    "parent_id": "t1_iz0q2sr",
                    "score": 1,
                    "created_utc": 1671999795.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Dark naruto kind of addresses this",
            "author": "LikeRealityDislike",
            "id": "iz1d7f5",
            "parent_id": "t1_iz008qk",
            "score": 5,
            "created_utc": 1670268052.0,
            "replies": []
        },
        {
            "body": "Well it was too protect him as he could be a target for assassination. That said for him to be only known as the jinchuriki is cruel rather he should have been adopted by village ninja or even by 3rd hokage(or even his children since everyone knows konahamaru)",
            "author": "Nightstriker5124",
            "id": "iz148x1",
            "parent_id": "t1_iz008qk",
            "score": 2,
            "created_utc": 1670264577.0,
            "replies": [
                {
                    "body": "Letting a powerful jinchuicki run around as a small child practically completely unsupervised seems like a weird way to protect a child to me but idk…maybe give him like a home, a guardian that watches over him…frankly the raising of Naruto is disrespectful to his family, and the and should bring shame upon the village. None of that was his fault.",
                    "author": "Adrewmc",
                    "id": "iz16dnv",
                    "parent_id": "t1_iz148x1",
                    "score": 3,
                    "created_utc": 1670265399.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Well. No. And anyway that's the premise of the story and the origin story of his will to be recognized. That's why the set up is \"nobody knew\"... They loved him for him, due to his actions, and not from a reflection of his father.\n\nI mean you are trying to deconstruct in a bad way the main reason for him being who he is 😳",
            "author": "il_Dudre",
            "id": "iz27gyl",
            "parent_id": "t1_iz008qk",
            "score": 1,
            "created_utc": 1670279992.0,
            "replies": []
        },
        {
            "body": "It is because 3rd Hokage is fucked everything up. He should cover up Naruto with something but just let everyone know.",
            "author": "raja_afiq1991",
            "id": "iz3qlj4",
            "parent_id": "t1_iz008qk",
            "score": 1,
            "created_utc": 1670306987.0,
            "replies": []
        },
        {
            "body": "yeah, but if you're out here hatting on someone for years then show up expecting to get into their birthday party once they make it big because you knew him then, thats fake as fuck.",
            "author": "nizzy2k11",
            "id": "iyzpdi0",
            "parent_id": "t1_iyzgavh",
            "score": 218,
            "created_utc": 1670240735.0,
            "replies": [
                {
                    "body": "Idk if someone, (*checks notes*), has a demon within them that killed a shit ton of my friends and family and destroyed a significant portion of my village, i might be inclined to be wary of said individual until his full control over aforementioned demon is proven.",
                    "author": "JAM3SBND",
                    "id": "iyzvsw2",
                    "parent_id": "t1_iyzpdi0",
                    "score": 93,
                    "created_utc": 1670245076.0,
                    "replies": [
                        {
                            "body": "Staying wary is one thing. Treating him like shit is another 💀💀💀",
                            "author": "grapesssszz",
                            "id": "iz0p4rb",
                            "parent_id": "t1_iyzvsw2",
                            "score": 25,
                            "created_utc": 1670258759.0,
                            "replies": [
                                {
                                    "body": "All they did was avoid him bruh",
                                    "author": "JoTheAnimator",
                                    "id": "iz2h62j",
                                    "parent_id": "t1_iz0p4rb",
                                    "score": -6,
                                    "created_utc": 1670284178.0,
                                    "replies": []
                                },
                                {
                                    "body": "They didn't treat him like shit, they just let him be.",
                                    "author": "MrLowkey13",
                                    "id": "iz11lx9",
                                    "parent_id": "t1_iz0p4rb",
                                    "score": -13,
                                    "created_utc": 1670263556.0,
                                    "replies": [
                                        {
                                            "body": "Yes they did tho??",
                                            "author": "grapesssszz",
                                            "id": "iz1wvxx",
                                            "parent_id": "t1_iz11lx9",
                                            "score": 20,
                                            "created_utc": 1670275635.0,
                                            "replies": [
                                                {
                                                    "body": "They just avoided him tho?",
                                                    "author": "MrLowkey13",
                                                    "id": "iz213vv",
                                                    "parent_id": "t1_iz1wvxx",
                                                    "score": -9,
                                                    "created_utc": 1670277329.0,
                                                    "replies": [
                                                        {
                                                            "body": "That doesn’t make it any better to basically shun a child who didn’t ask to have these things happen to them and who had no control in the events that led to him being shunned.",
                                                            "author": "Dragon-Titan",
                                                            "id": "j15ndv3",
                                                            "parent_id": "t1_iz213vv",
                                                            "score": 1,
                                                            "created_utc": 1671656927.0,
                                                            "replies": [
                                                                {
                                                                    "body": "No, but it's common sense to avoid a walking nuke.",
                                                                    "author": "MrLowkey13",
                                                                    "id": "j15tsxv",
                                                                    "parent_id": "t1_j15ndv3",
                                                                    "score": 3,
                                                                    "created_utc": 1671659505.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "Ichiraku didn’t hate on him, he too was a common man. It’s just how you treat any person, being friends is a different story.",
                            "author": "antiray",
                            "id": "iz0ubjy",
                            "parent_id": "t1_iyzvsw2",
                            "score": 6,
                            "created_utc": 1670260802.0,
                            "replies": []
                        },
                        {
                            "body": "And Naruto was also a shithead troublemaker. He had to grow up and become a better person and people started to like him more.",
                            "author": "examm",
                            "id": "iz00j3g",
                            "parent_id": "t1_iyzvsw2",
                            "score": 47,
                            "created_utc": 1670247826.0,
                            "replies": [
                                {
                                    "body": "He was only a troublemaker because of the isolation from everyone. He created trouble because that was the only way his lonely self got attention.",
                                    "author": "Imconfusedithink",
                                    "id": "iz02n9r",
                                    "parent_id": "t1_iz00j3g",
                                    "score": 55,
                                    "created_utc": 1670248940.0,
                                    "replies": [
                                        {
                                            "body": "Do you think about every person’s back story when they’re annoying? No. I doubt your standard villager cared they were the cause of anything, they saw an annoying kid and treated him as such. You’re not taking into account standard human behavior or the context we only had as the viewer.",
                                            "author": "examm",
                                            "id": "iz03idq",
                                            "parent_id": "t1_iz02n9r",
                                            "score": 45,
                                            "created_utc": 1670249377.0,
                                            "replies": [
                                                {
                                                    "body": "True! It's not like the villagers saw the 100 flashbacks of that swing",
                                                    "author": "spookyghosties",
                                                    "id": "iz0peuf",
                                                    "parent_id": "t1_iz03idq",
                                                    "score": 13,
                                                    "created_utc": 1670258871.0,
                                                    "replies": []
                                                },
                                                {
                                                    "body": "People are so quick to judge even if they know someone has a troubled past irl. Most people live under standard villager mindset so there's no benefit holding it against them even.",
                                                    "author": "Kirogu",
                                                    "id": "iz1yw2o",
                                                    "parent_id": "t1_iz03idq",
                                                    "score": 1,
                                                    "created_utc": 1670276437.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "Well said!",
                            "author": "LORD_HOKAGE_",
                            "id": "iz04t2i",
                            "parent_id": "t1_iyzvsw2",
                            "score": 1,
                            "created_utc": 1670250013.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "I mean he literally saved them from being killed by pain",
                    "author": "darcenator411",
                    "id": "iz3bs6h",
                    "parent_id": "t1_iyzpdi0",
                    "score": 1,
                    "created_utc": 1670298320.0,
                    "replies": [
                        {
                            "body": "cool motive, still fake fucks.",
                            "author": "nizzy2k11",
                            "id": "iz3cdmv",
                            "parent_id": "t1_iz3bs6h",
                            "score": 2,
                            "created_utc": 1670298618.0,
                            "replies": [
                                {
                                    "body": "I mean they could be genuinely grateful he saved them is what I meant",
                                    "author": "darcenator411",
                                    "id": "iz3l9b8",
                                    "parent_id": "t1_iz3cdmv",
                                    "score": 2,
                                    "created_utc": 1670303471.0,
                                    "replies": []
                                },
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "iz4s1et",
                                    "parent_id": "t1_iz3cdmv",
                                    "score": 1,
                                    "created_utc": 1670335425.0,
                                    "replies": [
                                        {
                                            "body": "None of them know where he is. And it was only the Shinobi who were always more respectful of Naruto compared to the normal people of the village.",
                                            "author": "nizzy2k11",
                                            "id": "iz5zhm7",
                                            "parent_id": "t1_iz4s1et",
                                            "score": 1,
                                            "created_utc": 1670353067.0,
                                            "replies": [
                                                {
                                                    "body": "[deleted]",
                                                    "author": null,
                                                    "id": "iz6h841",
                                                    "parent_id": "t1_iz5zhm7",
                                                    "score": 1,
                                                    "created_utc": 1670359866.0,
                                                    "replies": [
                                                        {
                                                            "body": "The Shinobi were never the ones offensively persecuting Naruto. Most of the students in his class weren't instructed to avoid him, especially the ones with ninja parents. Idk who you think this post is about, but it's not really about the ninjas who all know who his father is, who all know what he is, and who all know what is life is like.",
                                                            "author": "nizzy2k11",
                                                            "id": "iz6i33j",
                                                            "parent_id": "t1_iz6h841",
                                                            "score": 1,
                                                            "created_utc": 1670360188.0,
                                                            "replies": [
                                                                {
                                                                    "body": "[deleted]",
                                                                    "author": null,
                                                                    "id": "iz6j88m",
                                                                    "parent_id": "t1_iz6i33j",
                                                                    "score": 1,
                                                                    "created_utc": 1670360626.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": ">But none of civilians or ninja were ever attacking or abusing him as a kid. \n\nThat's not what happened lol.",
                                                                            "author": "nizzy2k11",
                                                                            "id": "iz6kku4",
                                                                            "parent_id": "t1_iz6j88m",
                                                                            "score": 1,
                                                                            "created_utc": 1670361148.0,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "“In Japan is customary to be rood af until it benefits you”",
            "author": "-ShagginTurtles-",
            "id": "iz0qddj",
            "parent_id": "t1_iyzodcw",
            "score": 43,
            "created_utc": 1670259250.0,
            "replies": [
                {
                    "body": "rude",
                    "author": "warisverybad",
                    "id": "iz1d7j9",
                    "parent_id": "t1_iz0qddj",
                    "score": 10,
                    "created_utc": 1670268053.0,
                    "replies": []
                },
                {
                    "body": "No. In Japan people mind their business and people who are abnormal or strange, are usually isolated because Japan is very monolithic",
                    "author": "JoTheAnimator",
                    "id": "iz2hd3u",
                    "parent_id": "t1_iz0qddj",
                    "score": 5,
                    "created_utc": 1670284264.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "And the ramen shop owner and his daughter",
            "author": "Zetsu-Akatsuki",
            "id": "iyzde81",
            "parent_id": "t1_iyzcks5",
            "score": 128,
            "created_utc": 1670230107.0,
            "replies": [
                {
                    "body": "Teuchi and Ayame",
                    "author": "Divine_thunder",
                    "id": "iyzif76",
                    "parent_id": "t1_iyzde81",
                    "score": 49,
                    "created_utc": 1670234798.0,
                    "replies": []
                },
                {
                    "body": "That was his daughter?",
                    "author": "careytommy37",
                    "id": "iyzogh2",
                    "parent_id": "t1_iyzde81",
                    "score": 12,
                    "created_utc": 1670240015.0,
                    "replies": []
                },
                {
                    "body": "And Danzo, he keeps it real",
                    "author": "languish24",
                    "id": "iz0j4kd",
                    "parent_id": "t1_iyzde81",
                    "score": 3,
                    "created_utc": 1670256332.0,
                    "replies": [
                        {
                            "body": "Nah Danzo was a little bitch.",
                            "author": "Xillia_Maxwell",
                            "id": "iz0vf2b",
                            "parent_id": "t1_iz0j4kd",
                            "score": 11,
                            "created_utc": 1670261226.0,
                            "replies": [
                                {
                                    "body": "So I guess yall still need a /s huh?",
                                    "author": "languish24",
                                    "id": "iz12r6g",
                                    "parent_id": "t1_iz0vf2b",
                                    "score": 8,
                                    "created_utc": 1670264003.0,
                                    "replies": [
                                        {
                                            "body": "It’s an anime sub, probably the least socially aware group in the world, you’ll always need the /s",
                                            "author": "Resident-Syllabub-74",
                                            "id": "iz666ya",
                                            "parent_id": "t1_iz12r6g",
                                            "score": 3,
                                            "created_utc": 1670355673.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I won't blame the kids of Naruto's generation. They're the one who accepted Naruto. Prob only the adults are such",
            "author": "Blankb01",
            "id": "iyze9fq",
            "parent_id": "t1_iyzcks5",
            "score": 53,
            "created_utc": 1670230907.0,
            "replies": []
        },
        {
            "body": "How dare you forget ramen guy and his daughter",
            "author": "Proof-Exercise984",
            "id": "iyzq4p8",
            "parent_id": "t1_iyzcks5",
            "score": 13,
            "created_utc": 1670241295.0,
            "replies": []
        },
        {
            "body": "People always forget kakashi he was a real one from the start smh",
            "author": "Ebb8505revenge",
            "id": "iyzjn3n",
            "parent_id": "t1_iyzcks5",
            "score": 18,
            "created_utc": 1670235901.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "iyzdb9m",
            "parent_id": "t1_iyzcks5",
            "score": 6,
            "created_utc": 1670230031.0,
            "replies": [
                {
                    "body": "Oh, wait I also wanna include Might Gai and Rock Lee\nand Ramen Guy",
                    "author": "gab_rab_24",
                    "id": "iyzder3",
                    "parent_id": "t1_iyzdb9m",
                    "score": 18,
                    "created_utc": 1670230120.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Shikamaru and choji were his friends",
            "author": "MFT12",
            "id": "iyzxzre",
            "parent_id": "t1_iyzcks5",
            "score": 5,
            "created_utc": 1670246389.0,
            "replies": []
        },
        {
            "body": "Yeah, those twi should be hanged on another three, separated from the rest of Konoha",
            "author": "Damaaain",
            "id": "iyzf8n5",
            "parent_id": "t1_iyzcks5",
            "score": 4,
            "created_utc": 1670231827.0,
            "replies": []
        },
        {
            "body": "Weren't Shikamaru and Choji also shown to play/hangout with kid Naruto every now and then?",
            "author": "UnoLaLaLa",
            "id": "iyzu8uv",
            "parent_id": "t1_iyzcks5",
            "score": 5,
            "created_utc": 1670244106.0,
            "replies": [
                {
                    "body": "That was some filler and retcon scenes,",
                    "author": "CEO_of_discord69",
                    "id": "iyzwhhz",
                    "parent_id": "t1_iyzu8uv",
                    "score": 18,
                    "created_utc": 1670245493.0,
                    "replies": [
                        {
                            "body": "I have yet to read the manga, but that just sounds like a fail in the manga department. Shikamaru would definitely make his own unbiased opinion on Naruto. Choji just likes everyone that doesn't bully him. Easy friends.",
                            "author": "The_TIGER3",
                            "id": "iz01ism",
                            "parent_id": "t1_iyzwhhz",
                            "score": 7,
                            "created_utc": 1670248354.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Sasuke was right",
            "author": "Murky_Blueberry2617",
            "id": "iyzi765",
            "parent_id": "t1_iyzf0sx",
            "score": 77,
            "created_utc": 1670234596.0,
            "replies": [
                {
                    "body": "He's always right",
                    "author": "Damaaain",
                    "id": "iyzq6tb",
                    "parent_id": "t1_iyzi765",
                    "score": 24,
                    "created_utc": 1670241337.0,
                    "replies": []
                },
                {
                    "body": "The uchiha in general were right about Konoha. It was a corrupt village. Itachi was a major traitor and a complete tool for turning on the uchiha. He should've helped lead the takeover and ouster of Hiruzen, Danzo and the other old fucks.",
                    "author": "U_Arent_Special",
                    "id": "j0awsl2",
                    "parent_id": "t1_iyzi765",
                    "score": 6,
                    "created_utc": 1671094975.0,
                    "replies": [
                        {
                            "body": "I agree. The Uchiha deserved justice. Too bad Sasuke got beaten by Naruto, he would have probably finished off those 2 old idiots if that happened.",
                            "author": "Murky_Blueberry2617",
                            "id": "j0d40fz",
                            "parent_id": "t1_j0awsl2",
                            "score": 3,
                            "created_utc": 1671133711.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I've been saying this from the start. And why didn't the third take him under his wing. Why did the village know he had the nine tails but he wasn't the 4tgs son. Bull shit",
            "author": "Dr_nobby",
            "id": "iz0b0mg",
            "parent_id": "t1_iyzf0sx",
            "score": 23,
            "created_utc": 1670252897.0,
            "replies": []
        },
        {
            "body": "Things are never that simple... Do you think the whole population was bad?",
            "author": "Divine_thunder",
            "id": "iyzie62",
            "parent_id": "t1_iyzf0sx",
            "score": -15,
            "created_utc": 1670234772.0,
            "replies": [
                {
                    "body": "Yes, they need to get to know Pain",
                    "author": "Damaaain",
                    "id": "iyzq7ar",
                    "parent_id": "t1_iyzie62",
                    "score": 29,
                    "created_utc": 1670241347.0,
                    "replies": []
                },
                {
                    "body": "I mean literally no one even talked to him with respect except his sensei but still.",
                    "author": "Specific-Raspberry94",
                    "id": "iz3xqqq",
                    "parent_id": "t1_iyzie62",
                    "score": 1,
                    "created_utc": 1670312570.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "He was on a more important mission. To write porn.",
            "author": "TheSomberWolf",
            "id": "iyzifqe",
            "parent_id": "t1_iyzg6vn",
            "score": 157,
            "created_utc": 1670234811.0,
            "replies": [
                {
                    "body": "It has even been adapted into a movie according to the latest side story.",
                    "author": "LookAtItGo123",
                    "id": "iz01owe",
                    "parent_id": "t1_iyzifqe",
                    "score": 19,
                    "created_utc": 1670248442.0,
                    "replies": [
                        {
                            "body": "So does that mean the first movie is canon now? Or just a coincidence?",
                            "author": "MrGame22",
                            "id": "iz1yqkv",
                            "parent_id": "t1_iz01owe",
                            "score": 3,
                            "created_utc": 1670276377.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "It was more important though. Like seriously, those villagers didn’t deserve to live anyways and I hope their families suffered greatly.",
                    "author": "MaskOfReality",
                    "id": "iyzl3bj",
                    "parent_id": "t1_iyzifqe",
                    "score": -15,
                    "created_utc": 1670237198.0,
                    "replies": [
                        {
                            "body": "Found Pain’s reddit account",
                            "author": "rumblevn",
                            "id": "iz01502",
                            "parent_id": "t1_iyzl3bj",
                            "score": 26,
                            "created_utc": 1670248152.0,
                            "replies": []
                        },
                        {
                            "body": "Hmm people ignoring a child is not a reason I can find to justify killing them if they were abusing naruto then yes but there only one scene where we see that.",
                            "author": "GHR501",
                            "id": "iyzu10v",
                            "parent_id": "t1_iyzl3bj",
                            "score": 9,
                            "created_utc": 1670243968.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Lol his entire relationship with Naruto’s father is such a retcon. Naruto literally just runs into Jiraiya at a spa.",
            "author": "SinisterPuppy",
            "id": "iz05ai7",
            "parent_id": "t1_iyzg6vn",
            "score": 18,
            "created_utc": 1670250245.0,
            "replies": []
        },
        {
            "body": "> The villagers are somewhat justified.\n\nits understandable, but i wouldn't call it justified. naruto has nothing to do with the 9 tails, and he didn't choose to be the vessel. blaming him is just outright wrong, but an emotional group would understandably make that judgement.",
            "author": "nizzy2k11",
            "id": "iyzp9a9",
            "parent_id": "t1_iyzg6vn",
            "score": 50,
            "created_utc": 1670240645.0,
            "replies": [
                {
                    "body": "They don’t know how jinchurikki work. For all they know Naruto is just the human body of the nine tails. \n\nOnly we, as the audience know anything about them.",
                    "author": "jonny1211",
                    "id": "iyzpizw",
                    "parent_id": "t1_iyzp9a9",
                    "score": 25,
                    "created_utc": 1670240853.0,
                    "replies": [
                        {
                            "body": "> They don’t know how jinchurikki work. \n\nso educate them. there is 0 reason to keep naruto's identity secret from everyone when they already know, and there is no reason not the educate them about what being a jinchuriki is like so that they don't make him explode in the middle of the village and kill everyone.",
                            "author": "nizzy2k11",
                            "id": "iyzprun",
                            "parent_id": "t1_iyzpizw",
                            "score": 29,
                            "created_utc": 1670241034.0,
                            "replies": [
                                {
                                    "body": "That is 100% on Hiruzen as Hokage and mostly likely thanks to being convinced by Danzo and the other 2 elders advice.",
                                    "author": "batmanbnb",
                                    "id": "iyzrc0b",
                                    "parent_id": "t1_iyzprun",
                                    "score": 35,
                                    "created_utc": 1670242161.0,
                                    "replies": []
                                },
                                {
                                    "body": "But does anyone in-universe know how jinchurriki work or not, especially Hiruzen and the village elders? \n\nThey only just seal the kyuubi inside a human and try to keep them contained",
                                    "author": "jonny1211",
                                    "id": "iyzwvrq",
                                    "parent_id": "t1_iyzprun",
                                    "score": 7,
                                    "created_utc": 1670245728.0,
                                    "replies": [
                                        {
                                            "body": "He was married to a previous vessel wasn't he? He should know how it works.",
                                            "author": "nizzy2k11",
                                            "id": "iz1peyz",
                                            "parent_id": "t1_iyzwvrq",
                                            "score": 1,
                                            "created_utc": 1670272721.0,
                                            "replies": [
                                                {
                                                    "body": "That was Hashirama",
                                                    "author": "jonny1211",
                                                    "id": "iz2ng0w",
                                                    "parent_id": "t1_iz1peyz",
                                                    "score": 1,
                                                    "created_utc": 1670286991.0,
                                                    "replies": [
                                                        {
                                                            "body": "And he would have been aware of when they moved the 9 tails, it's still not like he didn't know her.",
                                                            "author": "nizzy2k11",
                                                            "id": "iz2oeyw",
                                                            "parent_id": "t1_iz2ng0w",
                                                            "score": 1,
                                                            "created_utc": 1670287429.0,
                                                            "replies": [
                                                                {
                                                                    "body": "But that doesn’t mean he knows how jinchurriki work",
                                                                    "author": "jonny1211",
                                                                    "id": "iz2qbvb",
                                                                    "parent_id": "t1_iz2oeyw",
                                                                    "score": 0,
                                                                    "created_utc": 1670288302.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "someone there does, they know how to control them, they know how to suppress them, they even know how they are psychologically torchered by the tailed beast and how they should handle that, but they elect not to do it, every time.",
                                                                            "author": "nizzy2k11",
                                                                            "id": "iz2rbua",
                                                                            "parent_id": "t1_iz2qbvb",
                                                                            "score": 1,
                                                                            "created_utc": 1670288763.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "Only Uzumakis know the sealing jutsu and Kushina was the one to teach it to Minato so no one other than them knows how to control one",
                                                                                    "author": "jonny1211",
                                                                                    "id": "iz4bm7r",
                                                                                    "parent_id": "t1_iz2rbua",
                                                                                    "score": 1,
                                                                                    "created_utc": 1670325116.0,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "A theme throughout naruto is mass repression of information. That knowledge on bijus is hidden away from even high level ninja. People fight kages and have no clue what their powers are. Basic history and info is never covered.\n\nWhy? Because if the general public knows that Shit they’ll snitch and share it everywhere. No you have shitloads of bad actors trying to get bijus, copy Hax techniques, etc. Or selling that info to enemies. It’d be a nightmare",
                                    "author": "bilbo_swagginz_boi",
                                    "id": "iz0mjyb",
                                    "parent_id": "t1_iyzprun",
                                    "score": 3,
                                    "created_utc": 1670257723.0,
                                    "replies": [
                                        {
                                            "body": ">Because if the general public knows that Shit they’ll snitch and share it everywhere.\n\nYet they let Naruto go on mission outside the village and he ended up telling basically everyone around him every time he left the village.",
                                            "author": "nizzy2k11",
                                            "id": "iz1pp6y",
                                            "parent_id": "t1_iz0mjyb",
                                            "score": 1,
                                            "created_utc": 1670272829.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "Educating people isn’t as simple as saying it. People try to educate people on social issues all the time now and even then half the time it never gets through.",
                                    "author": "examm",
                                    "id": "iz00rau",
                                    "parent_id": "t1_iyzprun",
                                    "score": 5,
                                    "created_utc": 1670247949.0,
                                    "replies": [
                                        {
                                            "body": "And I don’t think even Hiruzen and the village elders know how jinchuriki work, they just know Minato sealed Kurama within Naruto.",
                                            "author": "jonny1211",
                                            "id": "iz01rek",
                                            "parent_id": "t1_iz00rau",
                                            "score": 4,
                                            "created_utc": 1670248479.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "And saying nothing is better?",
                                            "author": "nizzy2k11",
                                            "id": "iz1phv7",
                                            "parent_id": "t1_iz00rau",
                                            "score": 1,
                                            "created_utc": 1670272752.0,
                                            "replies": [
                                                {
                                                    "body": "No. But that’s not the only reason that info was kept secret.",
                                                    "author": "examm",
                                                    "id": "iz1z2cg",
                                                    "parent_id": "t1_iz1phv7",
                                                    "score": 1,
                                                    "created_utc": 1670276506.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "That brings up another question then, why would the villagers need to know he is a jinchurikki in the first place, it just paints a target on his back for another village to kidnap him.",
                            "author": "MrGame22",
                            "id": "iz20i9k",
                            "parent_id": "t1_iyzpizw",
                            "score": 1,
                            "created_utc": 1670277088.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "here is a question, why where villagers told Naruto had the nine tails in the first place?",
            "author": "MrGame22",
            "id": "iz1yixf",
            "parent_id": "t1_iyzg6vn",
            "score": 1,
            "created_utc": 1670276293.0,
            "replies": []
        },
        {
            "body": "Also, not many blond haired and blue eyed people in the village too!",
            "author": "vk136",
            "id": "iz0gj6v",
            "parent_id": "t1_iz0cfj6",
            "score": 1,
            "created_utc": 1670255274.0,
            "replies": []
        },
        {
            "body": "Didn't danzo say Naruto was the nine tailed fox and he was responsible for all their family and friends",
            "author": "DanielDanvers",
            "id": "j23dsn6",
            "parent_id": "t1_j1d73tt",
            "score": 1,
            "created_utc": 1672309931.0,
            "replies": []
        },
        {
            "body": "You’re acting like that should be considered a good thing. \n\nAnd let’s face it many people in that town knew. Kakashi knew, the Third Hokage knew, and I bet most of the BLACK Ops knew, and it’s not like the whole town didn’t know he was expecting.",
            "author": "Adrewmc",
            "id": "iz03sd4",
            "parent_id": "t1_iz025s7",
            "score": 156,
            "created_utc": 1670249513.0,
            "replies": [
                {
                    "body": "Exactly. The ones that knew didn't treat him poorly, but were not allowed to tell anyone. Not saying it's wrong or right, just how it is.",
                    "author": "The_TIGER3",
                    "id": "iz08ke9",
                    "parent_id": "t1_iz03sd4",
                    "score": 69,
                    "created_utc": 1670251775.0,
                    "replies": []
                },
                {
                    "body": "The whole Blonde hair Blue eyes thing should've clued them in as well. Imo they're dumb af",
                    "author": "ChildConsumer66",
                    "id": "iz2fy22",
                    "parent_id": "t1_iz03sd4",
                    "score": 29,
                    "created_utc": 1670283639.0,
                    "replies": [
                        {
                            "body": "Are you trying to say that Naruto was a German",
                            "author": "Kanejy",
                            "id": "j273x2m",
                            "parent_id": "t1_iz2fy22",
                            "score": 1,
                            "created_utc": 1672369570.0,
                            "replies": [
                                {
                                    "body": "Glaube es! (“believe it!” in german, according to google)",
                                    "author": "Dragowaow",
                                    "id": "j2bc2c7",
                                    "parent_id": "t1_j273x2m",
                                    "score": 2,
                                    "created_utc": 1672445324.0,
                                    "replies": []
                                },
                                {
                                    "body": "by that logic so is ino.",
                                    "author": "bigblackowskiC",
                                    "id": "j2i7mle",
                                    "parent_id": "t1_j273x2m",
                                    "score": 1,
                                    "created_utc": 1672584674.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Yes, but not like there are tons of blond haired and blue eyed people in the village lol! Could be an easy educated guess for an adult",
            "author": "vk136",
            "id": "iz0gag1",
            "parent_id": "t1_iz025s7",
            "score": 48,
            "created_utc": 1670255175.0,
            "replies": [
                {
                    "body": "You're not wrong, but does anyone from the show think Lee is Guy's son even though they're identical.",
                    "author": "The_TIGER3",
                    "id": "iz0mxg7",
                    "parent_id": "t1_iz0gag1",
                    "score": 22,
                    "created_utc": 1670257876.0,
                    "replies": [
                        {
                            "body": "TBF I thought Lee was Guys' son at first and when I first picked up the series I saw the 4th's face on the rock, paused the episode and said \"That guy on the rock is either Naruto's dad or grandad.\" the resemblance was so great that I knew who his dad was near instantly.",
                            "author": "Zombiecidialfreak",
                            "id": "iz0ysyl",
                            "parent_id": "t1_iz0mxg7",
                            "score": 34,
                            "created_utc": 1670262489.0,
                            "replies": []
                        },
                        {
                            "body": "Not really a similar comparison! Lee was a relatively less popular kid and people didn’t really know him. Naruto used to play pranks and was known as an annoying kid from most of the villagers from the start!\n\nIf a kid is annoying you, your first question is probably “who the hell are the kid’s parents?” and the theories could start from there\n\nAlso the fact that an uzumaki was pregnant, she was basically the First Lady by being the hokage’s wife. And then comes along a kid with the same name and features similar to that of the most recent hokage! Not at all hard to predict his lineage!",
                            "author": "vk136",
                            "id": "iz0ovg8",
                            "parent_id": "t1_iz0mxg7",
                            "score": 24,
                            "created_utc": 1670258657.0,
                            "replies": [
                                {
                                    "body": "Very valid statement. I was more trying to reference how anime land is sometimes best left unquestioned.",
                                    "author": "The_TIGER3",
                                    "id": "iz0qlhi",
                                    "parent_id": "t1_iz0ovg8",
                                    "score": 12,
                                    "created_utc": 1670259336.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "That’s different, lee tailored himself to look like guy, it was genes",
                            "author": "erenyeager255",
                            "id": "j0yorvj",
                            "parent_id": "t1_iz0mxg7",
                            "score": 1,
                            "created_utc": 1671537183.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "There’s not a lot of blond haired and blue eyed people in the village that we know of. Doesn’t mean they aren’t out there.\n\nAnd considering Kushina’s seal weakens during pregnancy, I’m pretty sure aside from people who personally know her, no one else knew she was pregnant. Very few people are supposed to know about it.\n\nAlso, considering that Minato has a lot of enemies and that was significant enough for Naruto to take the Uzumaki name instead of Namikaze, I’m pretty sure Minato would’ve kept his relationship to Kushina a secret as well to the masses.",
                    "author": "BoneeBones",
                    "id": "iz0oghc",
                    "parent_id": "t1_iz0gag1",
                    "score": 3,
                    "created_utc": 1670258490.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Ah yes, he just looks EXACTLY like the guy who ruled them for years, and his parents are missing… and the Hokage’s pregnant wife died with him…",
            "author": "Heroright",
            "id": "iz1isw1",
            "parent_id": "t1_iz025s7",
            "score": 6,
            "created_utc": 1670270186.0,
            "replies": []
        },
        {
            "body": "His name is uzamaki naruto. The name of jirayas hero with the family name of the 3rd hokages wife. Lets not forget the blond hair which isnt a thing in the uzamaki clan since he got it from his dad. They all knew!",
            "author": "ceelo18",
            "id": "iz1bi0g",
            "parent_id": "t1_iz025s7",
            "score": 3,
            "created_utc": 1670267390.0,
            "replies": []
        },
        {
            "body": "Ah yes, he just looks EXACTLY like the guy who ruled them for years, and his parents are missing… and the Hokage’s pregnant wife died with him…",
            "author": "Heroright",
            "id": "iz1is02",
            "parent_id": "t1_iz025s7",
            "score": 1,
            "created_utc": 1670270176.0,
            "replies": []
        },
        {
            "body": "If u use that logic, when naruto was given uzumaki as his last name and had yellow hair, it was obvious he was minatos son. Everyone knew minatos wife and an uzumaki with yellow hair is uncommon to the leaf",
            "author": "PooKindle",
            "id": "iz20uvd",
            "parent_id": "t1_iz025s7",
            "score": 1,
            "created_utc": 1670277228.0,
            "replies": []
        },
        {
            "body": "To add on, tailed beasts were pretty much bargaining chips balancing power between nations, but there were also incidents where people get creative like putting one in rin to release it when she reaches konoha. If they knew he's minato son I'm pretty sure some countries will start getting ideas on top of massive political upheaval. \n\nThat said, living off instant ramen? Sarutobi could do better heh.",
            "author": "LookAtItGo123",
            "id": "iz1e90z",
            "parent_id": "t1_iz0q2sr",
            "score": 7,
            "created_utc": 1670268458.0,
            "replies": []
        },
        {
            "body": "One of the best analysis in awhile. Last piece to add. Given his entitlement at young age that turned into hard work and perseverance. How would it affected his character development knowing before he could appreciate it? \n\nPlus we all knew and how much angst and anticipation did it create in the series for him to find out?",
            "author": "TheBigDiesel619",
            "id": "j1n91jp",
            "parent_id": "t1_iz0q2sr",
            "score": 1,
            "created_utc": 1671999795.0,
            "replies": []
        },
        {
            "body": "Letting a powerful jinchuicki run around as a small child practically completely unsupervised seems like a weird way to protect a child to me but idk…maybe give him like a home, a guardian that watches over him…frankly the raising of Naruto is disrespectful to his family, and the and should bring shame upon the village. None of that was his fault.",
            "author": "Adrewmc",
            "id": "iz16dnv",
            "parent_id": "t1_iz148x1",
            "score": 3,
            "created_utc": 1670265399.0,
            "replies": []
        },
        {
            "body": "Idk if someone, (*checks notes*), has a demon within them that killed a shit ton of my friends and family and destroyed a significant portion of my village, i might be inclined to be wary of said individual until his full control over aforementioned demon is proven.",
            "author": "JAM3SBND",
            "id": "iyzvsw2",
            "parent_id": "t1_iyzpdi0",
            "score": 93,
            "created_utc": 1670245076.0,
            "replies": [
                {
                    "body": "Staying wary is one thing. Treating him like shit is another 💀💀💀",
                    "author": "grapesssszz",
                    "id": "iz0p4rb",
                    "parent_id": "t1_iyzvsw2",
                    "score": 25,
                    "created_utc": 1670258759.0,
                    "replies": [
                        {
                            "body": "All they did was avoid him bruh",
                            "author": "JoTheAnimator",
                            "id": "iz2h62j",
                            "parent_id": "t1_iz0p4rb",
                            "score": -6,
                            "created_utc": 1670284178.0,
                            "replies": []
                        },
                        {
                            "body": "They didn't treat him like shit, they just let him be.",
                            "author": "MrLowkey13",
                            "id": "iz11lx9",
                            "parent_id": "t1_iz0p4rb",
                            "score": -13,
                            "created_utc": 1670263556.0,
                            "replies": [
                                {
                                    "body": "Yes they did tho??",
                                    "author": "grapesssszz",
                                    "id": "iz1wvxx",
                                    "parent_id": "t1_iz11lx9",
                                    "score": 20,
                                    "created_utc": 1670275635.0,
                                    "replies": [
                                        {
                                            "body": "They just avoided him tho?",
                                            "author": "MrLowkey13",
                                            "id": "iz213vv",
                                            "parent_id": "t1_iz1wvxx",
                                            "score": -9,
                                            "created_utc": 1670277329.0,
                                            "replies": [
                                                {
                                                    "body": "That doesn’t make it any better to basically shun a child who didn’t ask to have these things happen to them and who had no control in the events that led to him being shunned.",
                                                    "author": "Dragon-Titan",
                                                    "id": "j15ndv3",
                                                    "parent_id": "t1_iz213vv",
                                                    "score": 1,
                                                    "created_utc": 1671656927.0,
                                                    "replies": [
                                                        {
                                                            "body": "No, but it's common sense to avoid a walking nuke.",
                                                            "author": "MrLowkey13",
                                                            "id": "j15tsxv",
                                                            "parent_id": "t1_j15ndv3",
                                                            "score": 3,
                                                            "created_utc": 1671659505.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Ichiraku didn’t hate on him, he too was a common man. It’s just how you treat any person, being friends is a different story.",
                    "author": "antiray",
                    "id": "iz0ubjy",
                    "parent_id": "t1_iyzvsw2",
                    "score": 6,
                    "created_utc": 1670260802.0,
                    "replies": []
                },
                {
                    "body": "And Naruto was also a shithead troublemaker. He had to grow up and become a better person and people started to like him more.",
                    "author": "examm",
                    "id": "iz00j3g",
                    "parent_id": "t1_iyzvsw2",
                    "score": 47,
                    "created_utc": 1670247826.0,
                    "replies": [
                        {
                            "body": "He was only a troublemaker because of the isolation from everyone. He created trouble because that was the only way his lonely self got attention.",
                            "author": "Imconfusedithink",
                            "id": "iz02n9r",
                            "parent_id": "t1_iz00j3g",
                            "score": 55,
                            "created_utc": 1670248940.0,
                            "replies": [
                                {
                                    "body": "Do you think about every person’s back story when they’re annoying? No. I doubt your standard villager cared they were the cause of anything, they saw an annoying kid and treated him as such. You’re not taking into account standard human behavior or the context we only had as the viewer.",
                                    "author": "examm",
                                    "id": "iz03idq",
                                    "parent_id": "t1_iz02n9r",
                                    "score": 45,
                                    "created_utc": 1670249377.0,
                                    "replies": [
                                        {
                                            "body": "True! It's not like the villagers saw the 100 flashbacks of that swing",
                                            "author": "spookyghosties",
                                            "id": "iz0peuf",
                                            "parent_id": "t1_iz03idq",
                                            "score": 13,
                                            "created_utc": 1670258871.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "People are so quick to judge even if they know someone has a troubled past irl. Most people live under standard villager mindset so there's no benefit holding it against them even.",
                                            "author": "Kirogu",
                                            "id": "iz1yw2o",
                                            "parent_id": "t1_iz03idq",
                                            "score": 1,
                                            "created_utc": 1670276437.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Well said!",
                    "author": "LORD_HOKAGE_",
                    "id": "iz04t2i",
                    "parent_id": "t1_iyzvsw2",
                    "score": 1,
                    "created_utc": 1670250013.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I mean he literally saved them from being killed by pain",
            "author": "darcenator411",
            "id": "iz3bs6h",
            "parent_id": "t1_iyzpdi0",
            "score": 1,
            "created_utc": 1670298320.0,
            "replies": [
                {
                    "body": "cool motive, still fake fucks.",
                    "author": "nizzy2k11",
                    "id": "iz3cdmv",
                    "parent_id": "t1_iz3bs6h",
                    "score": 2,
                    "created_utc": 1670298618.0,
                    "replies": [
                        {
                            "body": "I mean they could be genuinely grateful he saved them is what I meant",
                            "author": "darcenator411",
                            "id": "iz3l9b8",
                            "parent_id": "t1_iz3cdmv",
                            "score": 2,
                            "created_utc": 1670303471.0,
                            "replies": []
                        },
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "iz4s1et",
                            "parent_id": "t1_iz3cdmv",
                            "score": 1,
                            "created_utc": 1670335425.0,
                            "replies": [
                                {
                                    "body": "None of them know where he is. And it was only the Shinobi who were always more respectful of Naruto compared to the normal people of the village.",
                                    "author": "nizzy2k11",
                                    "id": "iz5zhm7",
                                    "parent_id": "t1_iz4s1et",
                                    "score": 1,
                                    "created_utc": 1670353067.0,
                                    "replies": [
                                        {
                                            "body": "[deleted]",
                                            "author": null,
                                            "id": "iz6h841",
                                            "parent_id": "t1_iz5zhm7",
                                            "score": 1,
                                            "created_utc": 1670359866.0,
                                            "replies": [
                                                {
                                                    "body": "The Shinobi were never the ones offensively persecuting Naruto. Most of the students in his class weren't instructed to avoid him, especially the ones with ninja parents. Idk who you think this post is about, but it's not really about the ninjas who all know who his father is, who all know what he is, and who all know what is life is like.",
                                                    "author": "nizzy2k11",
                                                    "id": "iz6i33j",
                                                    "parent_id": "t1_iz6h841",
                                                    "score": 1,
                                                    "created_utc": 1670360188.0,
                                                    "replies": [
                                                        {
                                                            "body": "[deleted]",
                                                            "author": null,
                                                            "id": "iz6j88m",
                                                            "parent_id": "t1_iz6i33j",
                                                            "score": 1,
                                                            "created_utc": 1670360626.0,
                                                            "replies": [
                                                                {
                                                                    "body": ">But none of civilians or ninja were ever attacking or abusing him as a kid. \n\nThat's not what happened lol.",
                                                                    "author": "nizzy2k11",
                                                                    "id": "iz6kku4",
                                                                    "parent_id": "t1_iz6j88m",
                                                                    "score": 1,
                                                                    "created_utc": 1670361148.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "rude",
            "author": "warisverybad",
            "id": "iz1d7j9",
            "parent_id": "t1_iz0qddj",
            "score": 10,
            "created_utc": 1670268053.0,
            "replies": []
        },
        {
            "body": "No. In Japan people mind their business and people who are abnormal or strange, are usually isolated because Japan is very monolithic",
            "author": "JoTheAnimator",
            "id": "iz2hd3u",
            "parent_id": "t1_iz0qddj",
            "score": 5,
            "created_utc": 1670284264.0,
            "replies": []
        },
        {
            "body": "Teuchi and Ayame",
            "author": "Divine_thunder",
            "id": "iyzif76",
            "parent_id": "t1_iyzde81",
            "score": 49,
            "created_utc": 1670234798.0,
            "replies": []
        },
        {
            "body": "That was his daughter?",
            "author": "careytommy37",
            "id": "iyzogh2",
            "parent_id": "t1_iyzde81",
            "score": 12,
            "created_utc": 1670240015.0,
            "replies": []
        },
        {
            "body": "And Danzo, he keeps it real",
            "author": "languish24",
            "id": "iz0j4kd",
            "parent_id": "t1_iyzde81",
            "score": 3,
            "created_utc": 1670256332.0,
            "replies": [
                {
                    "body": "Nah Danzo was a little bitch.",
                    "author": "Xillia_Maxwell",
                    "id": "iz0vf2b",
                    "parent_id": "t1_iz0j4kd",
                    "score": 11,
                    "created_utc": 1670261226.0,
                    "replies": [
                        {
                            "body": "So I guess yall still need a /s huh?",
                            "author": "languish24",
                            "id": "iz12r6g",
                            "parent_id": "t1_iz0vf2b",
                            "score": 8,
                            "created_utc": 1670264003.0,
                            "replies": [
                                {
                                    "body": "It’s an anime sub, probably the least socially aware group in the world, you’ll always need the /s",
                                    "author": "Resident-Syllabub-74",
                                    "id": "iz666ya",
                                    "parent_id": "t1_iz12r6g",
                                    "score": 3,
                                    "created_utc": 1670355673.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Oh, wait I also wanna include Might Gai and Rock Lee\nand Ramen Guy",
            "author": "gab_rab_24",
            "id": "iyzder3",
            "parent_id": "t1_iyzdb9m",
            "score": 18,
            "created_utc": 1670230120.0,
            "replies": []
        },
        {
            "body": "That was some filler and retcon scenes,",
            "author": "CEO_of_discord69",
            "id": "iyzwhhz",
            "parent_id": "t1_iyzu8uv",
            "score": 18,
            "created_utc": 1670245493.0,
            "replies": [
                {
                    "body": "I have yet to read the manga, but that just sounds like a fail in the manga department. Shikamaru would definitely make his own unbiased opinion on Naruto. Choji just likes everyone that doesn't bully him. Easy friends.",
                    "author": "The_TIGER3",
                    "id": "iz01ism",
                    "parent_id": "t1_iyzwhhz",
                    "score": 7,
                    "created_utc": 1670248354.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "He's always right",
            "author": "Damaaain",
            "id": "iyzq6tb",
            "parent_id": "t1_iyzi765",
            "score": 24,
            "created_utc": 1670241337.0,
            "replies": []
        },
        {
            "body": "The uchiha in general were right about Konoha. It was a corrupt village. Itachi was a major traitor and a complete tool for turning on the uchiha. He should've helped lead the takeover and ouster of Hiruzen, Danzo and the other old fucks.",
            "author": "U_Arent_Special",
            "id": "j0awsl2",
            "parent_id": "t1_iyzi765",
            "score": 6,
            "created_utc": 1671094975.0,
            "replies": [
                {
                    "body": "I agree. The Uchiha deserved justice. Too bad Sasuke got beaten by Naruto, he would have probably finished off those 2 old idiots if that happened.",
                    "author": "Murky_Blueberry2617",
                    "id": "j0d40fz",
                    "parent_id": "t1_j0awsl2",
                    "score": 3,
                    "created_utc": 1671133711.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Yes, they need to get to know Pain",
            "author": "Damaaain",
            "id": "iyzq7ar",
            "parent_id": "t1_iyzie62",
            "score": 29,
            "created_utc": 1670241347.0,
            "replies": []
        },
        {
            "body": "I mean literally no one even talked to him with respect except his sensei but still.",
            "author": "Specific-Raspberry94",
            "id": "iz3xqqq",
            "parent_id": "t1_iyzie62",
            "score": 1,
            "created_utc": 1670312570.0,
            "replies": []
        },
        {
            "body": "It has even been adapted into a movie according to the latest side story.",
            "author": "LookAtItGo123",
            "id": "iz01owe",
            "parent_id": "t1_iyzifqe",
            "score": 19,
            "created_utc": 1670248442.0,
            "replies": [
                {
                    "body": "So does that mean the first movie is canon now? Or just a coincidence?",
                    "author": "MrGame22",
                    "id": "iz1yqkv",
                    "parent_id": "t1_iz01owe",
                    "score": 3,
                    "created_utc": 1670276377.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "It was more important though. Like seriously, those villagers didn’t deserve to live anyways and I hope their families suffered greatly.",
            "author": "MaskOfReality",
            "id": "iyzl3bj",
            "parent_id": "t1_iyzifqe",
            "score": -15,
            "created_utc": 1670237198.0,
            "replies": [
                {
                    "body": "Found Pain’s reddit account",
                    "author": "rumblevn",
                    "id": "iz01502",
                    "parent_id": "t1_iyzl3bj",
                    "score": 26,
                    "created_utc": 1670248152.0,
                    "replies": []
                },
                {
                    "body": "Hmm people ignoring a child is not a reason I can find to justify killing them if they were abusing naruto then yes but there only one scene where we see that.",
                    "author": "GHR501",
                    "id": "iyzu10v",
                    "parent_id": "t1_iyzl3bj",
                    "score": 9,
                    "created_utc": 1670243968.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "They don’t know how jinchurikki work. For all they know Naruto is just the human body of the nine tails. \n\nOnly we, as the audience know anything about them.",
            "author": "jonny1211",
            "id": "iyzpizw",
            "parent_id": "t1_iyzp9a9",
            "score": 25,
            "created_utc": 1670240853.0,
            "replies": [
                {
                    "body": "> They don’t know how jinchurikki work. \n\nso educate them. there is 0 reason to keep naruto's identity secret from everyone when they already know, and there is no reason not the educate them about what being a jinchuriki is like so that they don't make him explode in the middle of the village and kill everyone.",
                    "author": "nizzy2k11",
                    "id": "iyzprun",
                    "parent_id": "t1_iyzpizw",
                    "score": 29,
                    "created_utc": 1670241034.0,
                    "replies": [
                        {
                            "body": "That is 100% on Hiruzen as Hokage and mostly likely thanks to being convinced by Danzo and the other 2 elders advice.",
                            "author": "batmanbnb",
                            "id": "iyzrc0b",
                            "parent_id": "t1_iyzprun",
                            "score": 35,
                            "created_utc": 1670242161.0,
                            "replies": []
                        },
                        {
                            "body": "But does anyone in-universe know how jinchurriki work or not, especially Hiruzen and the village elders? \n\nThey only just seal the kyuubi inside a human and try to keep them contained",
                            "author": "jonny1211",
                            "id": "iyzwvrq",
                            "parent_id": "t1_iyzprun",
                            "score": 7,
                            "created_utc": 1670245728.0,
                            "replies": [
                                {
                                    "body": "He was married to a previous vessel wasn't he? He should know how it works.",
                                    "author": "nizzy2k11",
                                    "id": "iz1peyz",
                                    "parent_id": "t1_iyzwvrq",
                                    "score": 1,
                                    "created_utc": 1670272721.0,
                                    "replies": [
                                        {
                                            "body": "That was Hashirama",
                                            "author": "jonny1211",
                                            "id": "iz2ng0w",
                                            "parent_id": "t1_iz1peyz",
                                            "score": 1,
                                            "created_utc": 1670286991.0,
                                            "replies": [
                                                {
                                                    "body": "And he would have been aware of when they moved the 9 tails, it's still not like he didn't know her.",
                                                    "author": "nizzy2k11",
                                                    "id": "iz2oeyw",
                                                    "parent_id": "t1_iz2ng0w",
                                                    "score": 1,
                                                    "created_utc": 1670287429.0,
                                                    "replies": [
                                                        {
                                                            "body": "But that doesn’t mean he knows how jinchurriki work",
                                                            "author": "jonny1211",
                                                            "id": "iz2qbvb",
                                                            "parent_id": "t1_iz2oeyw",
                                                            "score": 0,
                                                            "created_utc": 1670288302.0,
                                                            "replies": [
                                                                {
                                                                    "body": "someone there does, they know how to control them, they know how to suppress them, they even know how they are psychologically torchered by the tailed beast and how they should handle that, but they elect not to do it, every time.",
                                                                    "author": "nizzy2k11",
                                                                    "id": "iz2rbua",
                                                                    "parent_id": "t1_iz2qbvb",
                                                                    "score": 1,
                                                                    "created_utc": 1670288763.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "Only Uzumakis know the sealing jutsu and Kushina was the one to teach it to Minato so no one other than them knows how to control one",
                                                                            "author": "jonny1211",
                                                                            "id": "iz4bm7r",
                                                                            "parent_id": "t1_iz2rbua",
                                                                            "score": 1,
                                                                            "created_utc": 1670325116.0,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "A theme throughout naruto is mass repression of information. That knowledge on bijus is hidden away from even high level ninja. People fight kages and have no clue what their powers are. Basic history and info is never covered.\n\nWhy? Because if the general public knows that Shit they’ll snitch and share it everywhere. No you have shitloads of bad actors trying to get bijus, copy Hax techniques, etc. Or selling that info to enemies. It’d be a nightmare",
                            "author": "bilbo_swagginz_boi",
                            "id": "iz0mjyb",
                            "parent_id": "t1_iyzprun",
                            "score": 3,
                            "created_utc": 1670257723.0,
                            "replies": [
                                {
                                    "body": ">Because if the general public knows that Shit they’ll snitch and share it everywhere.\n\nYet they let Naruto go on mission outside the village and he ended up telling basically everyone around him every time he left the village.",
                                    "author": "nizzy2k11",
                                    "id": "iz1pp6y",
                                    "parent_id": "t1_iz0mjyb",
                                    "score": 1,
                                    "created_utc": 1670272829.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "Educating people isn’t as simple as saying it. People try to educate people on social issues all the time now and even then half the time it never gets through.",
                            "author": "examm",
                            "id": "iz00rau",
                            "parent_id": "t1_iyzprun",
                            "score": 5,
                            "created_utc": 1670247949.0,
                            "replies": [
                                {
                                    "body": "And I don’t think even Hiruzen and the village elders know how jinchuriki work, they just know Minato sealed Kurama within Naruto.",
                                    "author": "jonny1211",
                                    "id": "iz01rek",
                                    "parent_id": "t1_iz00rau",
                                    "score": 4,
                                    "created_utc": 1670248479.0,
                                    "replies": []
                                },
                                {
                                    "body": "And saying nothing is better?",
                                    "author": "nizzy2k11",
                                    "id": "iz1phv7",
                                    "parent_id": "t1_iz00rau",
                                    "score": 1,
                                    "created_utc": 1670272752.0,
                                    "replies": [
                                        {
                                            "body": "No. But that’s not the only reason that info was kept secret.",
                                            "author": "examm",
                                            "id": "iz1z2cg",
                                            "parent_id": "t1_iz1phv7",
                                            "score": 1,
                                            "created_utc": 1670276506.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "That brings up another question then, why would the villagers need to know he is a jinchurikki in the first place, it just paints a target on his back for another village to kidnap him.",
                    "author": "MrGame22",
                    "id": "iz20i9k",
                    "parent_id": "t1_iyzpizw",
                    "score": 1,
                    "created_utc": 1670277088.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Exactly. The ones that knew didn't treat him poorly, but were not allowed to tell anyone. Not saying it's wrong or right, just how it is.",
            "author": "The_TIGER3",
            "id": "iz08ke9",
            "parent_id": "t1_iz03sd4",
            "score": 69,
            "created_utc": 1670251775.0,
            "replies": []
        },
        {
            "body": "The whole Blonde hair Blue eyes thing should've clued them in as well. Imo they're dumb af",
            "author": "ChildConsumer66",
            "id": "iz2fy22",
            "parent_id": "t1_iz03sd4",
            "score": 29,
            "created_utc": 1670283639.0,
            "replies": [
                {
                    "body": "Are you trying to say that Naruto was a German",
                    "author": "Kanejy",
                    "id": "j273x2m",
                    "parent_id": "t1_iz2fy22",
                    "score": 1,
                    "created_utc": 1672369570.0,
                    "replies": [
                        {
                            "body": "Glaube es! (“believe it!” in german, according to google)",
                            "author": "Dragowaow",
                            "id": "j2bc2c7",
                            "parent_id": "t1_j273x2m",
                            "score": 2,
                            "created_utc": 1672445324.0,
                            "replies": []
                        },
                        {
                            "body": "by that logic so is ino.",
                            "author": "bigblackowskiC",
                            "id": "j2i7mle",
                            "parent_id": "t1_j273x2m",
                            "score": 1,
                            "created_utc": 1672584674.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "You're not wrong, but does anyone from the show think Lee is Guy's son even though they're identical.",
            "author": "The_TIGER3",
            "id": "iz0mxg7",
            "parent_id": "t1_iz0gag1",
            "score": 22,
            "created_utc": 1670257876.0,
            "replies": [
                {
                    "body": "TBF I thought Lee was Guys' son at first and when I first picked up the series I saw the 4th's face on the rock, paused the episode and said \"That guy on the rock is either Naruto's dad or grandad.\" the resemblance was so great that I knew who his dad was near instantly.",
                    "author": "Zombiecidialfreak",
                    "id": "iz0ysyl",
                    "parent_id": "t1_iz0mxg7",
                    "score": 34,
                    "created_utc": 1670262489.0,
                    "replies": []
                },
                {
                    "body": "Not really a similar comparison! Lee was a relatively less popular kid and people didn’t really know him. Naruto used to play pranks and was known as an annoying kid from most of the villagers from the start!\n\nIf a kid is annoying you, your first question is probably “who the hell are the kid’s parents?” and the theories could start from there\n\nAlso the fact that an uzumaki was pregnant, she was basically the First Lady by being the hokage’s wife. And then comes along a kid with the same name and features similar to that of the most recent hokage! Not at all hard to predict his lineage!",
                    "author": "vk136",
                    "id": "iz0ovg8",
                    "parent_id": "t1_iz0mxg7",
                    "score": 24,
                    "created_utc": 1670258657.0,
                    "replies": [
                        {
                            "body": "Very valid statement. I was more trying to reference how anime land is sometimes best left unquestioned.",
                            "author": "The_TIGER3",
                            "id": "iz0qlhi",
                            "parent_id": "t1_iz0ovg8",
                            "score": 12,
                            "created_utc": 1670259336.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "That’s different, lee tailored himself to look like guy, it was genes",
                    "author": "erenyeager255",
                    "id": "j0yorvj",
                    "parent_id": "t1_iz0mxg7",
                    "score": 1,
                    "created_utc": 1671537183.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "There’s not a lot of blond haired and blue eyed people in the village that we know of. Doesn’t mean they aren’t out there.\n\nAnd considering Kushina’s seal weakens during pregnancy, I’m pretty sure aside from people who personally know her, no one else knew she was pregnant. Very few people are supposed to know about it.\n\nAlso, considering that Minato has a lot of enemies and that was significant enough for Naruto to take the Uzumaki name instead of Namikaze, I’m pretty sure Minato would’ve kept his relationship to Kushina a secret as well to the masses.",
            "author": "BoneeBones",
            "id": "iz0oghc",
            "parent_id": "t1_iz0gag1",
            "score": 3,
            "created_utc": 1670258490.0,
            "replies": []
        },
        {
            "body": "Staying wary is one thing. Treating him like shit is another 💀💀💀",
            "author": "grapesssszz",
            "id": "iz0p4rb",
            "parent_id": "t1_iyzvsw2",
            "score": 25,
            "created_utc": 1670258759.0,
            "replies": [
                {
                    "body": "All they did was avoid him bruh",
                    "author": "JoTheAnimator",
                    "id": "iz2h62j",
                    "parent_id": "t1_iz0p4rb",
                    "score": -6,
                    "created_utc": 1670284178.0,
                    "replies": []
                },
                {
                    "body": "They didn't treat him like shit, they just let him be.",
                    "author": "MrLowkey13",
                    "id": "iz11lx9",
                    "parent_id": "t1_iz0p4rb",
                    "score": -13,
                    "created_utc": 1670263556.0,
                    "replies": [
                        {
                            "body": "Yes they did tho??",
                            "author": "grapesssszz",
                            "id": "iz1wvxx",
                            "parent_id": "t1_iz11lx9",
                            "score": 20,
                            "created_utc": 1670275635.0,
                            "replies": [
                                {
                                    "body": "They just avoided him tho?",
                                    "author": "MrLowkey13",
                                    "id": "iz213vv",
                                    "parent_id": "t1_iz1wvxx",
                                    "score": -9,
                                    "created_utc": 1670277329.0,
                                    "replies": [
                                        {
                                            "body": "That doesn’t make it any better to basically shun a child who didn’t ask to have these things happen to them and who had no control in the events that led to him being shunned.",
                                            "author": "Dragon-Titan",
                                            "id": "j15ndv3",
                                            "parent_id": "t1_iz213vv",
                                            "score": 1,
                                            "created_utc": 1671656927.0,
                                            "replies": [
                                                {
                                                    "body": "No, but it's common sense to avoid a walking nuke.",
                                                    "author": "MrLowkey13",
                                                    "id": "j15tsxv",
                                                    "parent_id": "t1_j15ndv3",
                                                    "score": 3,
                                                    "created_utc": 1671659505.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Ichiraku didn’t hate on him, he too was a common man. It’s just how you treat any person, being friends is a different story.",
            "author": "antiray",
            "id": "iz0ubjy",
            "parent_id": "t1_iyzvsw2",
            "score": 6,
            "created_utc": 1670260802.0,
            "replies": []
        },
        {
            "body": "And Naruto was also a shithead troublemaker. He had to grow up and become a better person and people started to like him more.",
            "author": "examm",
            "id": "iz00j3g",
            "parent_id": "t1_iyzvsw2",
            "score": 47,
            "created_utc": 1670247826.0,
            "replies": [
                {
                    "body": "He was only a troublemaker because of the isolation from everyone. He created trouble because that was the only way his lonely self got attention.",
                    "author": "Imconfusedithink",
                    "id": "iz02n9r",
                    "parent_id": "t1_iz00j3g",
                    "score": 55,
                    "created_utc": 1670248940.0,
                    "replies": [
                        {
                            "body": "Do you think about every person’s back story when they’re annoying? No. I doubt your standard villager cared they were the cause of anything, they saw an annoying kid and treated him as such. You’re not taking into account standard human behavior or the context we only had as the viewer.",
                            "author": "examm",
                            "id": "iz03idq",
                            "parent_id": "t1_iz02n9r",
                            "score": 45,
                            "created_utc": 1670249377.0,
                            "replies": [
                                {
                                    "body": "True! It's not like the villagers saw the 100 flashbacks of that swing",
                                    "author": "spookyghosties",
                                    "id": "iz0peuf",
                                    "parent_id": "t1_iz03idq",
                                    "score": 13,
                                    "created_utc": 1670258871.0,
                                    "replies": []
                                },
                                {
                                    "body": "People are so quick to judge even if they know someone has a troubled past irl. Most people live under standard villager mindset so there's no benefit holding it against them even.",
                                    "author": "Kirogu",
                                    "id": "iz1yw2o",
                                    "parent_id": "t1_iz03idq",
                                    "score": 1,
                                    "created_utc": 1670276437.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Well said!",
            "author": "LORD_HOKAGE_",
            "id": "iz04t2i",
            "parent_id": "t1_iyzvsw2",
            "score": 1,
            "created_utc": 1670250013.0,
            "replies": []
        },
        {
            "body": "cool motive, still fake fucks.",
            "author": "nizzy2k11",
            "id": "iz3cdmv",
            "parent_id": "t1_iz3bs6h",
            "score": 2,
            "created_utc": 1670298618.0,
            "replies": [
                {
                    "body": "I mean they could be genuinely grateful he saved them is what I meant",
                    "author": "darcenator411",
                    "id": "iz3l9b8",
                    "parent_id": "t1_iz3cdmv",
                    "score": 2,
                    "created_utc": 1670303471.0,
                    "replies": []
                },
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "iz4s1et",
                    "parent_id": "t1_iz3cdmv",
                    "score": 1,
                    "created_utc": 1670335425.0,
                    "replies": [
                        {
                            "body": "None of them know where he is. And it was only the Shinobi who were always more respectful of Naruto compared to the normal people of the village.",
                            "author": "nizzy2k11",
                            "id": "iz5zhm7",
                            "parent_id": "t1_iz4s1et",
                            "score": 1,
                            "created_utc": 1670353067.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "iz6h841",
                                    "parent_id": "t1_iz5zhm7",
                                    "score": 1,
                                    "created_utc": 1670359866.0,
                                    "replies": [
                                        {
                                            "body": "The Shinobi were never the ones offensively persecuting Naruto. Most of the students in his class weren't instructed to avoid him, especially the ones with ninja parents. Idk who you think this post is about, but it's not really about the ninjas who all know who his father is, who all know what he is, and who all know what is life is like.",
                                            "author": "nizzy2k11",
                                            "id": "iz6i33j",
                                            "parent_id": "t1_iz6h841",
                                            "score": 1,
                                            "created_utc": 1670360188.0,
                                            "replies": [
                                                {
                                                    "body": "[deleted]",
                                                    "author": null,
                                                    "id": "iz6j88m",
                                                    "parent_id": "t1_iz6i33j",
                                                    "score": 1,
                                                    "created_utc": 1670360626.0,
                                                    "replies": [
                                                        {
                                                            "body": ">But none of civilians or ninja were ever attacking or abusing him as a kid. \n\nThat's not what happened lol.",
                                                            "author": "nizzy2k11",
                                                            "id": "iz6kku4",
                                                            "parent_id": "t1_iz6j88m",
                                                            "score": 1,
                                                            "created_utc": 1670361148.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Nah Danzo was a little bitch.",
            "author": "Xillia_Maxwell",
            "id": "iz0vf2b",
            "parent_id": "t1_iz0j4kd",
            "score": 11,
            "created_utc": 1670261226.0,
            "replies": [
                {
                    "body": "So I guess yall still need a /s huh?",
                    "author": "languish24",
                    "id": "iz12r6g",
                    "parent_id": "t1_iz0vf2b",
                    "score": 8,
                    "created_utc": 1670264003.0,
                    "replies": [
                        {
                            "body": "It’s an anime sub, probably the least socially aware group in the world, you’ll always need the /s",
                            "author": "Resident-Syllabub-74",
                            "id": "iz666ya",
                            "parent_id": "t1_iz12r6g",
                            "score": 3,
                            "created_utc": 1670355673.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I have yet to read the manga, but that just sounds like a fail in the manga department. Shikamaru would definitely make his own unbiased opinion on Naruto. Choji just likes everyone that doesn't bully him. Easy friends.",
            "author": "The_TIGER3",
            "id": "iz01ism",
            "parent_id": "t1_iyzwhhz",
            "score": 7,
            "created_utc": 1670248354.0,
            "replies": []
        },
        {
            "body": "I agree. The Uchiha deserved justice. Too bad Sasuke got beaten by Naruto, he would have probably finished off those 2 old idiots if that happened.",
            "author": "Murky_Blueberry2617",
            "id": "j0d40fz",
            "parent_id": "t1_j0awsl2",
            "score": 3,
            "created_utc": 1671133711.0,
            "replies": []
        },
        {
            "body": "So does that mean the first movie is canon now? Or just a coincidence?",
            "author": "MrGame22",
            "id": "iz1yqkv",
            "parent_id": "t1_iz01owe",
            "score": 3,
            "created_utc": 1670276377.0,
            "replies": []
        },
        {
            "body": "Found Pain’s reddit account",
            "author": "rumblevn",
            "id": "iz01502",
            "parent_id": "t1_iyzl3bj",
            "score": 26,
            "created_utc": 1670248152.0,
            "replies": []
        },
        {
            "body": "Hmm people ignoring a child is not a reason I can find to justify killing them if they were abusing naruto then yes but there only one scene where we see that.",
            "author": "GHR501",
            "id": "iyzu10v",
            "parent_id": "t1_iyzl3bj",
            "score": 9,
            "created_utc": 1670243968.0,
            "replies": []
        },
        {
            "body": "> They don’t know how jinchurikki work. \n\nso educate them. there is 0 reason to keep naruto's identity secret from everyone when they already know, and there is no reason not the educate them about what being a jinchuriki is like so that they don't make him explode in the middle of the village and kill everyone.",
            "author": "nizzy2k11",
            "id": "iyzprun",
            "parent_id": "t1_iyzpizw",
            "score": 29,
            "created_utc": 1670241034.0,
            "replies": [
                {
                    "body": "That is 100% on Hiruzen as Hokage and mostly likely thanks to being convinced by Danzo and the other 2 elders advice.",
                    "author": "batmanbnb",
                    "id": "iyzrc0b",
                    "parent_id": "t1_iyzprun",
                    "score": 35,
                    "created_utc": 1670242161.0,
                    "replies": []
                },
                {
                    "body": "But does anyone in-universe know how jinchurriki work or not, especially Hiruzen and the village elders? \n\nThey only just seal the kyuubi inside a human and try to keep them contained",
                    "author": "jonny1211",
                    "id": "iyzwvrq",
                    "parent_id": "t1_iyzprun",
                    "score": 7,
                    "created_utc": 1670245728.0,
                    "replies": [
                        {
                            "body": "He was married to a previous vessel wasn't he? He should know how it works.",
                            "author": "nizzy2k11",
                            "id": "iz1peyz",
                            "parent_id": "t1_iyzwvrq",
                            "score": 1,
                            "created_utc": 1670272721.0,
                            "replies": [
                                {
                                    "body": "That was Hashirama",
                                    "author": "jonny1211",
                                    "id": "iz2ng0w",
                                    "parent_id": "t1_iz1peyz",
                                    "score": 1,
                                    "created_utc": 1670286991.0,
                                    "replies": [
                                        {
                                            "body": "And he would have been aware of when they moved the 9 tails, it's still not like he didn't know her.",
                                            "author": "nizzy2k11",
                                            "id": "iz2oeyw",
                                            "parent_id": "t1_iz2ng0w",
                                            "score": 1,
                                            "created_utc": 1670287429.0,
                                            "replies": [
                                                {
                                                    "body": "But that doesn’t mean he knows how jinchurriki work",
                                                    "author": "jonny1211",
                                                    "id": "iz2qbvb",
                                                    "parent_id": "t1_iz2oeyw",
                                                    "score": 0,
                                                    "created_utc": 1670288302.0,
                                                    "replies": [
                                                        {
                                                            "body": "someone there does, they know how to control them, they know how to suppress them, they even know how they are psychologically torchered by the tailed beast and how they should handle that, but they elect not to do it, every time.",
                                                            "author": "nizzy2k11",
                                                            "id": "iz2rbua",
                                                            "parent_id": "t1_iz2qbvb",
                                                            "score": 1,
                                                            "created_utc": 1670288763.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Only Uzumakis know the sealing jutsu and Kushina was the one to teach it to Minato so no one other than them knows how to control one",
                                                                    "author": "jonny1211",
                                                                    "id": "iz4bm7r",
                                                                    "parent_id": "t1_iz2rbua",
                                                                    "score": 1,
                                                                    "created_utc": 1670325116.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "A theme throughout naruto is mass repression of information. That knowledge on bijus is hidden away from even high level ninja. People fight kages and have no clue what their powers are. Basic history and info is never covered.\n\nWhy? Because if the general public knows that Shit they’ll snitch and share it everywhere. No you have shitloads of bad actors trying to get bijus, copy Hax techniques, etc. Or selling that info to enemies. It’d be a nightmare",
                    "author": "bilbo_swagginz_boi",
                    "id": "iz0mjyb",
                    "parent_id": "t1_iyzprun",
                    "score": 3,
                    "created_utc": 1670257723.0,
                    "replies": [
                        {
                            "body": ">Because if the general public knows that Shit they’ll snitch and share it everywhere.\n\nYet they let Naruto go on mission outside the village and he ended up telling basically everyone around him every time he left the village.",
                            "author": "nizzy2k11",
                            "id": "iz1pp6y",
                            "parent_id": "t1_iz0mjyb",
                            "score": 1,
                            "created_utc": 1670272829.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Educating people isn’t as simple as saying it. People try to educate people on social issues all the time now and even then half the time it never gets through.",
                    "author": "examm",
                    "id": "iz00rau",
                    "parent_id": "t1_iyzprun",
                    "score": 5,
                    "created_utc": 1670247949.0,
                    "replies": [
                        {
                            "body": "And I don’t think even Hiruzen and the village elders know how jinchuriki work, they just know Minato sealed Kurama within Naruto.",
                            "author": "jonny1211",
                            "id": "iz01rek",
                            "parent_id": "t1_iz00rau",
                            "score": 4,
                            "created_utc": 1670248479.0,
                            "replies": []
                        },
                        {
                            "body": "And saying nothing is better?",
                            "author": "nizzy2k11",
                            "id": "iz1phv7",
                            "parent_id": "t1_iz00rau",
                            "score": 1,
                            "created_utc": 1670272752.0,
                            "replies": [
                                {
                                    "body": "No. But that’s not the only reason that info was kept secret.",
                                    "author": "examm",
                                    "id": "iz1z2cg",
                                    "parent_id": "t1_iz1phv7",
                                    "score": 1,
                                    "created_utc": 1670276506.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "That brings up another question then, why would the villagers need to know he is a jinchurikki in the first place, it just paints a target on his back for another village to kidnap him.",
            "author": "MrGame22",
            "id": "iz20i9k",
            "parent_id": "t1_iyzpizw",
            "score": 1,
            "created_utc": 1670277088.0,
            "replies": []
        },
        {
            "body": "Are you trying to say that Naruto was a German",
            "author": "Kanejy",
            "id": "j273x2m",
            "parent_id": "t1_iz2fy22",
            "score": 1,
            "created_utc": 1672369570.0,
            "replies": [
                {
                    "body": "Glaube es! (“believe it!” in german, according to google)",
                    "author": "Dragowaow",
                    "id": "j2bc2c7",
                    "parent_id": "t1_j273x2m",
                    "score": 2,
                    "created_utc": 1672445324.0,
                    "replies": []
                },
                {
                    "body": "by that logic so is ino.",
                    "author": "bigblackowskiC",
                    "id": "j2i7mle",
                    "parent_id": "t1_j273x2m",
                    "score": 1,
                    "created_utc": 1672584674.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "TBF I thought Lee was Guys' son at first and when I first picked up the series I saw the 4th's face on the rock, paused the episode and said \"That guy on the rock is either Naruto's dad or grandad.\" the resemblance was so great that I knew who his dad was near instantly.",
            "author": "Zombiecidialfreak",
            "id": "iz0ysyl",
            "parent_id": "t1_iz0mxg7",
            "score": 34,
            "created_utc": 1670262489.0,
            "replies": []
        },
        {
            "body": "Not really a similar comparison! Lee was a relatively less popular kid and people didn’t really know him. Naruto used to play pranks and was known as an annoying kid from most of the villagers from the start!\n\nIf a kid is annoying you, your first question is probably “who the hell are the kid’s parents?” and the theories could start from there\n\nAlso the fact that an uzumaki was pregnant, she was basically the First Lady by being the hokage’s wife. And then comes along a kid with the same name and features similar to that of the most recent hokage! Not at all hard to predict his lineage!",
            "author": "vk136",
            "id": "iz0ovg8",
            "parent_id": "t1_iz0mxg7",
            "score": 24,
            "created_utc": 1670258657.0,
            "replies": [
                {
                    "body": "Very valid statement. I was more trying to reference how anime land is sometimes best left unquestioned.",
                    "author": "The_TIGER3",
                    "id": "iz0qlhi",
                    "parent_id": "t1_iz0ovg8",
                    "score": 12,
                    "created_utc": 1670259336.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "That’s different, lee tailored himself to look like guy, it was genes",
            "author": "erenyeager255",
            "id": "j0yorvj",
            "parent_id": "t1_iz0mxg7",
            "score": 1,
            "created_utc": 1671537183.0,
            "replies": []
        },
        {
            "body": "All they did was avoid him bruh",
            "author": "JoTheAnimator",
            "id": "iz2h62j",
            "parent_id": "t1_iz0p4rb",
            "score": -6,
            "created_utc": 1670284178.0,
            "replies": []
        },
        {
            "body": "They didn't treat him like shit, they just let him be.",
            "author": "MrLowkey13",
            "id": "iz11lx9",
            "parent_id": "t1_iz0p4rb",
            "score": -13,
            "created_utc": 1670263556.0,
            "replies": [
                {
                    "body": "Yes they did tho??",
                    "author": "grapesssszz",
                    "id": "iz1wvxx",
                    "parent_id": "t1_iz11lx9",
                    "score": 20,
                    "created_utc": 1670275635.0,
                    "replies": [
                        {
                            "body": "They just avoided him tho?",
                            "author": "MrLowkey13",
                            "id": "iz213vv",
                            "parent_id": "t1_iz1wvxx",
                            "score": -9,
                            "created_utc": 1670277329.0,
                            "replies": [
                                {
                                    "body": "That doesn’t make it any better to basically shun a child who didn’t ask to have these things happen to them and who had no control in the events that led to him being shunned.",
                                    "author": "Dragon-Titan",
                                    "id": "j15ndv3",
                                    "parent_id": "t1_iz213vv",
                                    "score": 1,
                                    "created_utc": 1671656927.0,
                                    "replies": [
                                        {
                                            "body": "No, but it's common sense to avoid a walking nuke.",
                                            "author": "MrLowkey13",
                                            "id": "j15tsxv",
                                            "parent_id": "t1_j15ndv3",
                                            "score": 3,
                                            "created_utc": 1671659505.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "He was only a troublemaker because of the isolation from everyone. He created trouble because that was the only way his lonely self got attention.",
            "author": "Imconfusedithink",
            "id": "iz02n9r",
            "parent_id": "t1_iz00j3g",
            "score": 55,
            "created_utc": 1670248940.0,
            "replies": [
                {
                    "body": "Do you think about every person’s back story when they’re annoying? No. I doubt your standard villager cared they were the cause of anything, they saw an annoying kid and treated him as such. You’re not taking into account standard human behavior or the context we only had as the viewer.",
                    "author": "examm",
                    "id": "iz03idq",
                    "parent_id": "t1_iz02n9r",
                    "score": 45,
                    "created_utc": 1670249377.0,
                    "replies": [
                        {
                            "body": "True! It's not like the villagers saw the 100 flashbacks of that swing",
                            "author": "spookyghosties",
                            "id": "iz0peuf",
                            "parent_id": "t1_iz03idq",
                            "score": 13,
                            "created_utc": 1670258871.0,
                            "replies": []
                        },
                        {
                            "body": "People are so quick to judge even if they know someone has a troubled past irl. Most people live under standard villager mindset so there's no benefit holding it against them even.",
                            "author": "Kirogu",
                            "id": "iz1yw2o",
                            "parent_id": "t1_iz03idq",
                            "score": 1,
                            "created_utc": 1670276437.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I mean they could be genuinely grateful he saved them is what I meant",
            "author": "darcenator411",
            "id": "iz3l9b8",
            "parent_id": "t1_iz3cdmv",
            "score": 2,
            "created_utc": 1670303471.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "iz4s1et",
            "parent_id": "t1_iz3cdmv",
            "score": 1,
            "created_utc": 1670335425.0,
            "replies": [
                {
                    "body": "None of them know where he is. And it was only the Shinobi who were always more respectful of Naruto compared to the normal people of the village.",
                    "author": "nizzy2k11",
                    "id": "iz5zhm7",
                    "parent_id": "t1_iz4s1et",
                    "score": 1,
                    "created_utc": 1670353067.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "iz6h841",
                            "parent_id": "t1_iz5zhm7",
                            "score": 1,
                            "created_utc": 1670359866.0,
                            "replies": [
                                {
                                    "body": "The Shinobi were never the ones offensively persecuting Naruto. Most of the students in his class weren't instructed to avoid him, especially the ones with ninja parents. Idk who you think this post is about, but it's not really about the ninjas who all know who his father is, who all know what he is, and who all know what is life is like.",
                                    "author": "nizzy2k11",
                                    "id": "iz6i33j",
                                    "parent_id": "t1_iz6h841",
                                    "score": 1,
                                    "created_utc": 1670360188.0,
                                    "replies": [
                                        {
                                            "body": "[deleted]",
                                            "author": null,
                                            "id": "iz6j88m",
                                            "parent_id": "t1_iz6i33j",
                                            "score": 1,
                                            "created_utc": 1670360626.0,
                                            "replies": [
                                                {
                                                    "body": ">But none of civilians or ninja were ever attacking or abusing him as a kid. \n\nThat's not what happened lol.",
                                                    "author": "nizzy2k11",
                                                    "id": "iz6kku4",
                                                    "parent_id": "t1_iz6j88m",
                                                    "score": 1,
                                                    "created_utc": 1670361148.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "So I guess yall still need a /s huh?",
            "author": "languish24",
            "id": "iz12r6g",
            "parent_id": "t1_iz0vf2b",
            "score": 8,
            "created_utc": 1670264003.0,
            "replies": [
                {
                    "body": "It’s an anime sub, probably the least socially aware group in the world, you’ll always need the /s",
                    "author": "Resident-Syllabub-74",
                    "id": "iz666ya",
                    "parent_id": "t1_iz12r6g",
                    "score": 3,
                    "created_utc": 1670355673.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "That is 100% on Hiruzen as Hokage and mostly likely thanks to being convinced by Danzo and the other 2 elders advice.",
            "author": "batmanbnb",
            "id": "iyzrc0b",
            "parent_id": "t1_iyzprun",
            "score": 35,
            "created_utc": 1670242161.0,
            "replies": []
        },
        {
            "body": "But does anyone in-universe know how jinchurriki work or not, especially Hiruzen and the village elders? \n\nThey only just seal the kyuubi inside a human and try to keep them contained",
            "author": "jonny1211",
            "id": "iyzwvrq",
            "parent_id": "t1_iyzprun",
            "score": 7,
            "created_utc": 1670245728.0,
            "replies": [
                {
                    "body": "He was married to a previous vessel wasn't he? He should know how it works.",
                    "author": "nizzy2k11",
                    "id": "iz1peyz",
                    "parent_id": "t1_iyzwvrq",
                    "score": 1,
                    "created_utc": 1670272721.0,
                    "replies": [
                        {
                            "body": "That was Hashirama",
                            "author": "jonny1211",
                            "id": "iz2ng0w",
                            "parent_id": "t1_iz1peyz",
                            "score": 1,
                            "created_utc": 1670286991.0,
                            "replies": [
                                {
                                    "body": "And he would have been aware of when they moved the 9 tails, it's still not like he didn't know her.",
                                    "author": "nizzy2k11",
                                    "id": "iz2oeyw",
                                    "parent_id": "t1_iz2ng0w",
                                    "score": 1,
                                    "created_utc": 1670287429.0,
                                    "replies": [
                                        {
                                            "body": "But that doesn’t mean he knows how jinchurriki work",
                                            "author": "jonny1211",
                                            "id": "iz2qbvb",
                                            "parent_id": "t1_iz2oeyw",
                                            "score": 0,
                                            "created_utc": 1670288302.0,
                                            "replies": [
                                                {
                                                    "body": "someone there does, they know how to control them, they know how to suppress them, they even know how they are psychologically torchered by the tailed beast and how they should handle that, but they elect not to do it, every time.",
                                                    "author": "nizzy2k11",
                                                    "id": "iz2rbua",
                                                    "parent_id": "t1_iz2qbvb",
                                                    "score": 1,
                                                    "created_utc": 1670288763.0,
                                                    "replies": [
                                                        {
                                                            "body": "Only Uzumakis know the sealing jutsu and Kushina was the one to teach it to Minato so no one other than them knows how to control one",
                                                            "author": "jonny1211",
                                                            "id": "iz4bm7r",
                                                            "parent_id": "t1_iz2rbua",
                                                            "score": 1,
                                                            "created_utc": 1670325116.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "A theme throughout naruto is mass repression of information. That knowledge on bijus is hidden away from even high level ninja. People fight kages and have no clue what their powers are. Basic history and info is never covered.\n\nWhy? Because if the general public knows that Shit they’ll snitch and share it everywhere. No you have shitloads of bad actors trying to get bijus, copy Hax techniques, etc. Or selling that info to enemies. It’d be a nightmare",
            "author": "bilbo_swagginz_boi",
            "id": "iz0mjyb",
            "parent_id": "t1_iyzprun",
            "score": 3,
            "created_utc": 1670257723.0,
            "replies": [
                {
                    "body": ">Because if the general public knows that Shit they’ll snitch and share it everywhere.\n\nYet they let Naruto go on mission outside the village and he ended up telling basically everyone around him every time he left the village.",
                    "author": "nizzy2k11",
                    "id": "iz1pp6y",
                    "parent_id": "t1_iz0mjyb",
                    "score": 1,
                    "created_utc": 1670272829.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Educating people isn’t as simple as saying it. People try to educate people on social issues all the time now and even then half the time it never gets through.",
            "author": "examm",
            "id": "iz00rau",
            "parent_id": "t1_iyzprun",
            "score": 5,
            "created_utc": 1670247949.0,
            "replies": [
                {
                    "body": "And I don’t think even Hiruzen and the village elders know how jinchuriki work, they just know Minato sealed Kurama within Naruto.",
                    "author": "jonny1211",
                    "id": "iz01rek",
                    "parent_id": "t1_iz00rau",
                    "score": 4,
                    "created_utc": 1670248479.0,
                    "replies": []
                },
                {
                    "body": "And saying nothing is better?",
                    "author": "nizzy2k11",
                    "id": "iz1phv7",
                    "parent_id": "t1_iz00rau",
                    "score": 1,
                    "created_utc": 1670272752.0,
                    "replies": [
                        {
                            "body": "No. But that’s not the only reason that info was kept secret.",
                            "author": "examm",
                            "id": "iz1z2cg",
                            "parent_id": "t1_iz1phv7",
                            "score": 1,
                            "created_utc": 1670276506.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Glaube es! (“believe it!” in german, according to google)",
            "author": "Dragowaow",
            "id": "j2bc2c7",
            "parent_id": "t1_j273x2m",
            "score": 2,
            "created_utc": 1672445324.0,
            "replies": []
        },
        {
            "body": "by that logic so is ino.",
            "author": "bigblackowskiC",
            "id": "j2i7mle",
            "parent_id": "t1_j273x2m",
            "score": 1,
            "created_utc": 1672584674.0,
            "replies": []
        },
        {
            "body": "Very valid statement. I was more trying to reference how anime land is sometimes best left unquestioned.",
            "author": "The_TIGER3",
            "id": "iz0qlhi",
            "parent_id": "t1_iz0ovg8",
            "score": 12,
            "created_utc": 1670259336.0,
            "replies": []
        },
        {
            "body": "Yes they did tho??",
            "author": "grapesssszz",
            "id": "iz1wvxx",
            "parent_id": "t1_iz11lx9",
            "score": 20,
            "created_utc": 1670275635.0,
            "replies": [
                {
                    "body": "They just avoided him tho?",
                    "author": "MrLowkey13",
                    "id": "iz213vv",
                    "parent_id": "t1_iz1wvxx",
                    "score": -9,
                    "created_utc": 1670277329.0,
                    "replies": [
                        {
                            "body": "That doesn’t make it any better to basically shun a child who didn’t ask to have these things happen to them and who had no control in the events that led to him being shunned.",
                            "author": "Dragon-Titan",
                            "id": "j15ndv3",
                            "parent_id": "t1_iz213vv",
                            "score": 1,
                            "created_utc": 1671656927.0,
                            "replies": [
                                {
                                    "body": "No, but it's common sense to avoid a walking nuke.",
                                    "author": "MrLowkey13",
                                    "id": "j15tsxv",
                                    "parent_id": "t1_j15ndv3",
                                    "score": 3,
                                    "created_utc": 1671659505.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Do you think about every person’s back story when they’re annoying? No. I doubt your standard villager cared they were the cause of anything, they saw an annoying kid and treated him as such. You’re not taking into account standard human behavior or the context we only had as the viewer.",
            "author": "examm",
            "id": "iz03idq",
            "parent_id": "t1_iz02n9r",
            "score": 45,
            "created_utc": 1670249377.0,
            "replies": [
                {
                    "body": "True! It's not like the villagers saw the 100 flashbacks of that swing",
                    "author": "spookyghosties",
                    "id": "iz0peuf",
                    "parent_id": "t1_iz03idq",
                    "score": 13,
                    "created_utc": 1670258871.0,
                    "replies": []
                },
                {
                    "body": "People are so quick to judge even if they know someone has a troubled past irl. Most people live under standard villager mindset so there's no benefit holding it against them even.",
                    "author": "Kirogu",
                    "id": "iz1yw2o",
                    "parent_id": "t1_iz03idq",
                    "score": 1,
                    "created_utc": 1670276437.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "None of them know where he is. And it was only the Shinobi who were always more respectful of Naruto compared to the normal people of the village.",
            "author": "nizzy2k11",
            "id": "iz5zhm7",
            "parent_id": "t1_iz4s1et",
            "score": 1,
            "created_utc": 1670353067.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "iz6h841",
                    "parent_id": "t1_iz5zhm7",
                    "score": 1,
                    "created_utc": 1670359866.0,
                    "replies": [
                        {
                            "body": "The Shinobi were never the ones offensively persecuting Naruto. Most of the students in his class weren't instructed to avoid him, especially the ones with ninja parents. Idk who you think this post is about, but it's not really about the ninjas who all know who his father is, who all know what he is, and who all know what is life is like.",
                            "author": "nizzy2k11",
                            "id": "iz6i33j",
                            "parent_id": "t1_iz6h841",
                            "score": 1,
                            "created_utc": 1670360188.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "iz6j88m",
                                    "parent_id": "t1_iz6i33j",
                                    "score": 1,
                                    "created_utc": 1670360626.0,
                                    "replies": [
                                        {
                                            "body": ">But none of civilians or ninja were ever attacking or abusing him as a kid. \n\nThat's not what happened lol.",
                                            "author": "nizzy2k11",
                                            "id": "iz6kku4",
                                            "parent_id": "t1_iz6j88m",
                                            "score": 1,
                                            "created_utc": 1670361148.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "It’s an anime sub, probably the least socially aware group in the world, you’ll always need the /s",
            "author": "Resident-Syllabub-74",
            "id": "iz666ya",
            "parent_id": "t1_iz12r6g",
            "score": 3,
            "created_utc": 1670355673.0,
            "replies": []
        },
        {
            "body": "He was married to a previous vessel wasn't he? He should know how it works.",
            "author": "nizzy2k11",
            "id": "iz1peyz",
            "parent_id": "t1_iyzwvrq",
            "score": 1,
            "created_utc": 1670272721.0,
            "replies": [
                {
                    "body": "That was Hashirama",
                    "author": "jonny1211",
                    "id": "iz2ng0w",
                    "parent_id": "t1_iz1peyz",
                    "score": 1,
                    "created_utc": 1670286991.0,
                    "replies": [
                        {
                            "body": "And he would have been aware of when they moved the 9 tails, it's still not like he didn't know her.",
                            "author": "nizzy2k11",
                            "id": "iz2oeyw",
                            "parent_id": "t1_iz2ng0w",
                            "score": 1,
                            "created_utc": 1670287429.0,
                            "replies": [
                                {
                                    "body": "But that doesn’t mean he knows how jinchurriki work",
                                    "author": "jonny1211",
                                    "id": "iz2qbvb",
                                    "parent_id": "t1_iz2oeyw",
                                    "score": 0,
                                    "created_utc": 1670288302.0,
                                    "replies": [
                                        {
                                            "body": "someone there does, they know how to control them, they know how to suppress them, they even know how they are psychologically torchered by the tailed beast and how they should handle that, but they elect not to do it, every time.",
                                            "author": "nizzy2k11",
                                            "id": "iz2rbua",
                                            "parent_id": "t1_iz2qbvb",
                                            "score": 1,
                                            "created_utc": 1670288763.0,
                                            "replies": [
                                                {
                                                    "body": "Only Uzumakis know the sealing jutsu and Kushina was the one to teach it to Minato so no one other than them knows how to control one",
                                                    "author": "jonny1211",
                                                    "id": "iz4bm7r",
                                                    "parent_id": "t1_iz2rbua",
                                                    "score": 1,
                                                    "created_utc": 1670325116.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": ">Because if the general public knows that Shit they’ll snitch and share it everywhere.\n\nYet they let Naruto go on mission outside the village and he ended up telling basically everyone around him every time he left the village.",
            "author": "nizzy2k11",
            "id": "iz1pp6y",
            "parent_id": "t1_iz0mjyb",
            "score": 1,
            "created_utc": 1670272829.0,
            "replies": []
        },
        {
            "body": "And I don’t think even Hiruzen and the village elders know how jinchuriki work, they just know Minato sealed Kurama within Naruto.",
            "author": "jonny1211",
            "id": "iz01rek",
            "parent_id": "t1_iz00rau",
            "score": 4,
            "created_utc": 1670248479.0,
            "replies": []
        },
        {
            "body": "And saying nothing is better?",
            "author": "nizzy2k11",
            "id": "iz1phv7",
            "parent_id": "t1_iz00rau",
            "score": 1,
            "created_utc": 1670272752.0,
            "replies": [
                {
                    "body": "No. But that’s not the only reason that info was kept secret.",
                    "author": "examm",
                    "id": "iz1z2cg",
                    "parent_id": "t1_iz1phv7",
                    "score": 1,
                    "created_utc": 1670276506.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "They just avoided him tho?",
            "author": "MrLowkey13",
            "id": "iz213vv",
            "parent_id": "t1_iz1wvxx",
            "score": -9,
            "created_utc": 1670277329.0,
            "replies": [
                {
                    "body": "That doesn’t make it any better to basically shun a child who didn’t ask to have these things happen to them and who had no control in the events that led to him being shunned.",
                    "author": "Dragon-Titan",
                    "id": "j15ndv3",
                    "parent_id": "t1_iz213vv",
                    "score": 1,
                    "created_utc": 1671656927.0,
                    "replies": [
                        {
                            "body": "No, but it's common sense to avoid a walking nuke.",
                            "author": "MrLowkey13",
                            "id": "j15tsxv",
                            "parent_id": "t1_j15ndv3",
                            "score": 3,
                            "created_utc": 1671659505.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "True! It's not like the villagers saw the 100 flashbacks of that swing",
            "author": "spookyghosties",
            "id": "iz0peuf",
            "parent_id": "t1_iz03idq",
            "score": 13,
            "created_utc": 1670258871.0,
            "replies": []
        },
        {
            "body": "People are so quick to judge even if they know someone has a troubled past irl. Most people live under standard villager mindset so there's no benefit holding it against them even.",
            "author": "Kirogu",
            "id": "iz1yw2o",
            "parent_id": "t1_iz03idq",
            "score": 1,
            "created_utc": 1670276437.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "iz6h841",
            "parent_id": "t1_iz5zhm7",
            "score": 1,
            "created_utc": 1670359866.0,
            "replies": [
                {
                    "body": "The Shinobi were never the ones offensively persecuting Naruto. Most of the students in his class weren't instructed to avoid him, especially the ones with ninja parents. Idk who you think this post is about, but it's not really about the ninjas who all know who his father is, who all know what he is, and who all know what is life is like.",
                    "author": "nizzy2k11",
                    "id": "iz6i33j",
                    "parent_id": "t1_iz6h841",
                    "score": 1,
                    "created_utc": 1670360188.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "iz6j88m",
                            "parent_id": "t1_iz6i33j",
                            "score": 1,
                            "created_utc": 1670360626.0,
                            "replies": [
                                {
                                    "body": ">But none of civilians or ninja were ever attacking or abusing him as a kid. \n\nThat's not what happened lol.",
                                    "author": "nizzy2k11",
                                    "id": "iz6kku4",
                                    "parent_id": "t1_iz6j88m",
                                    "score": 1,
                                    "created_utc": 1670361148.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "That was Hashirama",
            "author": "jonny1211",
            "id": "iz2ng0w",
            "parent_id": "t1_iz1peyz",
            "score": 1,
            "created_utc": 1670286991.0,
            "replies": [
                {
                    "body": "And he would have been aware of when they moved the 9 tails, it's still not like he didn't know her.",
                    "author": "nizzy2k11",
                    "id": "iz2oeyw",
                    "parent_id": "t1_iz2ng0w",
                    "score": 1,
                    "created_utc": 1670287429.0,
                    "replies": [
                        {
                            "body": "But that doesn’t mean he knows how jinchurriki work",
                            "author": "jonny1211",
                            "id": "iz2qbvb",
                            "parent_id": "t1_iz2oeyw",
                            "score": 0,
                            "created_utc": 1670288302.0,
                            "replies": [
                                {
                                    "body": "someone there does, they know how to control them, they know how to suppress them, they even know how they are psychologically torchered by the tailed beast and how they should handle that, but they elect not to do it, every time.",
                                    "author": "nizzy2k11",
                                    "id": "iz2rbua",
                                    "parent_id": "t1_iz2qbvb",
                                    "score": 1,
                                    "created_utc": 1670288763.0,
                                    "replies": [
                                        {
                                            "body": "Only Uzumakis know the sealing jutsu and Kushina was the one to teach it to Minato so no one other than them knows how to control one",
                                            "author": "jonny1211",
                                            "id": "iz4bm7r",
                                            "parent_id": "t1_iz2rbua",
                                            "score": 1,
                                            "created_utc": 1670325116.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "No. But that’s not the only reason that info was kept secret.",
            "author": "examm",
            "id": "iz1z2cg",
            "parent_id": "t1_iz1phv7",
            "score": 1,
            "created_utc": 1670276506.0,
            "replies": []
        },
        {
            "body": "That doesn’t make it any better to basically shun a child who didn’t ask to have these things happen to them and who had no control in the events that led to him being shunned.",
            "author": "Dragon-Titan",
            "id": "j15ndv3",
            "parent_id": "t1_iz213vv",
            "score": 1,
            "created_utc": 1671656927.0,
            "replies": [
                {
                    "body": "No, but it's common sense to avoid a walking nuke.",
                    "author": "MrLowkey13",
                    "id": "j15tsxv",
                    "parent_id": "t1_j15ndv3",
                    "score": 3,
                    "created_utc": 1671659505.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "The Shinobi were never the ones offensively persecuting Naruto. Most of the students in his class weren't instructed to avoid him, especially the ones with ninja parents. Idk who you think this post is about, but it's not really about the ninjas who all know who his father is, who all know what he is, and who all know what is life is like.",
            "author": "nizzy2k11",
            "id": "iz6i33j",
            "parent_id": "t1_iz6h841",
            "score": 1,
            "created_utc": 1670360188.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "iz6j88m",
                    "parent_id": "t1_iz6i33j",
                    "score": 1,
                    "created_utc": 1670360626.0,
                    "replies": [
                        {
                            "body": ">But none of civilians or ninja were ever attacking or abusing him as a kid. \n\nThat's not what happened lol.",
                            "author": "nizzy2k11",
                            "id": "iz6kku4",
                            "parent_id": "t1_iz6j88m",
                            "score": 1,
                            "created_utc": 1670361148.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "And he would have been aware of when they moved the 9 tails, it's still not like he didn't know her.",
            "author": "nizzy2k11",
            "id": "iz2oeyw",
            "parent_id": "t1_iz2ng0w",
            "score": 1,
            "created_utc": 1670287429.0,
            "replies": [
                {
                    "body": "But that doesn’t mean he knows how jinchurriki work",
                    "author": "jonny1211",
                    "id": "iz2qbvb",
                    "parent_id": "t1_iz2oeyw",
                    "score": 0,
                    "created_utc": 1670288302.0,
                    "replies": [
                        {
                            "body": "someone there does, they know how to control them, they know how to suppress them, they even know how they are psychologically torchered by the tailed beast and how they should handle that, but they elect not to do it, every time.",
                            "author": "nizzy2k11",
                            "id": "iz2rbua",
                            "parent_id": "t1_iz2qbvb",
                            "score": 1,
                            "created_utc": 1670288763.0,
                            "replies": [
                                {
                                    "body": "Only Uzumakis know the sealing jutsu and Kushina was the one to teach it to Minato so no one other than them knows how to control one",
                                    "author": "jonny1211",
                                    "id": "iz4bm7r",
                                    "parent_id": "t1_iz2rbua",
                                    "score": 1,
                                    "created_utc": 1670325116.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "No, but it's common sense to avoid a walking nuke.",
            "author": "MrLowkey13",
            "id": "j15tsxv",
            "parent_id": "t1_j15ndv3",
            "score": 3,
            "created_utc": 1671659505.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "iz6j88m",
            "parent_id": "t1_iz6i33j",
            "score": 1,
            "created_utc": 1670360626.0,
            "replies": [
                {
                    "body": ">But none of civilians or ninja were ever attacking or abusing him as a kid. \n\nThat's not what happened lol.",
                    "author": "nizzy2k11",
                    "id": "iz6kku4",
                    "parent_id": "t1_iz6j88m",
                    "score": 1,
                    "created_utc": 1670361148.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "But that doesn’t mean he knows how jinchurriki work",
            "author": "jonny1211",
            "id": "iz2qbvb",
            "parent_id": "t1_iz2oeyw",
            "score": 0,
            "created_utc": 1670288302.0,
            "replies": [
                {
                    "body": "someone there does, they know how to control them, they know how to suppress them, they even know how they are psychologically torchered by the tailed beast and how they should handle that, but they elect not to do it, every time.",
                    "author": "nizzy2k11",
                    "id": "iz2rbua",
                    "parent_id": "t1_iz2qbvb",
                    "score": 1,
                    "created_utc": 1670288763.0,
                    "replies": [
                        {
                            "body": "Only Uzumakis know the sealing jutsu and Kushina was the one to teach it to Minato so no one other than them knows how to control one",
                            "author": "jonny1211",
                            "id": "iz4bm7r",
                            "parent_id": "t1_iz2rbua",
                            "score": 1,
                            "created_utc": 1670325116.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": ">But none of civilians or ninja were ever attacking or abusing him as a kid. \n\nThat's not what happened lol.",
            "author": "nizzy2k11",
            "id": "iz6kku4",
            "parent_id": "t1_iz6j88m",
            "score": 1,
            "created_utc": 1670361148.0,
            "replies": []
        },
        {
            "body": "someone there does, they know how to control them, they know how to suppress them, they even know how they are psychologically torchered by the tailed beast and how they should handle that, but they elect not to do it, every time.",
            "author": "nizzy2k11",
            "id": "iz2rbua",
            "parent_id": "t1_iz2qbvb",
            "score": 1,
            "created_utc": 1670288763.0,
            "replies": [
                {
                    "body": "Only Uzumakis know the sealing jutsu and Kushina was the one to teach it to Minato so no one other than them knows how to control one",
                    "author": "jonny1211",
                    "id": "iz4bm7r",
                    "parent_id": "t1_iz2rbua",
                    "score": 1,
                    "created_utc": 1670325116.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Only Uzumakis know the sealing jutsu and Kushina was the one to teach it to Minato so no one other than them knows how to control one",
            "author": "jonny1211",
            "id": "iz4bm7r",
            "parent_id": "t1_iz2rbua",
            "score": 1,
            "created_utc": 1670325116.0,
            "replies": []
        }
    ]
}