{
    "title": "4chan on haircut troubles",
    "post_id": "yhgw6",
    "post_url": "https://www.reddit.com/r/malehairadvice/comments/yhgw6/4chan_on_haircut_troubles/",
    "author": "tamper",
    "body": "",
    "url": "http://i.imgur.com/ll6zz.jpg",
    "score": 362,
    "upvote_ratio": 0.93,
    "created_utc": 1345405613.0,
    "num_comments": 34,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "[deleted]",
            "author": null,
            "id": "c5vsby4",
            "parent_id": "t3_yhgw6",
            "score": 38,
            "created_utc": 1345433845.0,
            "replies": [
                {
                    "body": "I think the hairdresser uses the mirror also while they cut your hair. They need it as a reference since they are usually standing over the top of you and are too close to see what the total style will look like. \n\nAs to your idea, I can see how that would be really popular. TBH, the only reason I go to my hairdresser is because I am familiar with her and don't want to get to know a new one. BUT it would still be really awkward to not talk to the hairdresser at all. Maybe even more awkward then having to talk to them. I would feel incredibly rude. ",
                    "author": "toychristopher",
                    "id": "c5vt10q",
                    "parent_id": "t1_c5vsby4",
                    "score": 16,
                    "created_utc": 1345436726.0,
                    "replies": [
                        {
                            "body": ">I think the hairdresser uses the mirror also while they cut your hair. \n\nTrue, I may need to set up some cameras so they can have a screen on the side that shows the front of you. Part of the purpose of not having a mirror is to avoid the awkward eye contact.\n\n> TBH, the only reason I go to my hairdresser is because I am familiar with her and don't want to get to know a new one.\n\nExactly, because you can avoid the awkward introductions, the questions about your job, whether you're married yet, etc, and just get down to exchanging money for services.\n\n>BUT it would still be really awkward to not talk to the hairdresser at all.\n\nBut that's why it would be a hard rule that they're not allowed to converse to you. They're not expecting you to you talk, so you don't need to feel weird about it. If you tried to engage them, they might give a friendly smile and point to the large sign that says \"NO FUCKING SMALL TALK\" in bold red impact font on top of each station. ",
                            "author": null,
                            "id": "c5vxoxs",
                            "parent_id": "t1_c5vt10q",
                            "score": 4,
                            "created_utc": 1345469952.0,
                            "replies": [
                                {
                                    "body": "As a straight male hairdresser, I like the idea of your idea (If you'll excuse my meta statement)\n\nThe TV and vidya (Sorry, it is a thread about 4chan) is a great idea that SportClips sort of already does. toychristopher was correct when he pointed out that we needed the mirror, and as a nerdy hairdresser, the idea about the cameras/screen would fill my fingers up with scars. The training to use that would suck for ME, not to think about most hairdressers who do not stare at computer screens all day. Mirrors are necessary, as is our ability to walk all around you.\n\nUs walking around you brings up my second point. I always say excuse me if a client is playing on their phone or reading a magazine and I have to intrude upon it for a moment. Fuck if they're talking on their phone, I'll just tell them to move it (That's rude), but I'm generally very polite and courteous. I'd feel like a dick if I had to walk in front of some dudes game. Any hairdresser would unless they were the evil bitchy girls who don't like anyone, but those are the same chicks who quit easily. So I would need to talk, just for excuse me's and the like. Plus, some guys go to the salon or barber because they don't KNOW what would look good on them, thus asking me (With my stylish $30 haircut that I got for free from a stylist friend) what would look good on them.\n\nAs an overall summation (Damn I should have written this when the post was current) your business idea is cool, but the clientele draw is FAR too small for anyplace but the densest cities, and I doubt it, as written, would work even in those thriving economies. Only the most awkward, anti-social, angry neckbeards would go there due to the awkwardness of the situation. And I don't think you could staff a place like that with stylists/barbers that would stay for any length of time (Source: I know these people). We're known for being friendly people persons. (People people?) \n\nAnd don't even get me started on the tips thing (If you could pay well enough to give us the salary we need in place of tips, I'd suggest investing in something more lucrative).\n\nIf you toned down this idea you may have something, sort of a \"Sport Clips for nerds\". Ditch the setting and switch it to gamer/tv/movie nerd friendly and keep the hot chicks or friendly guys cutting hair, and it would be golden. Have a tv with games and a wireless controller on the flat screen NEXT to my station. You can move your eyeballs and I can still apologize. Not to mention hiring people who dig the environment and can watch Firefly, Doctor Who, My Little Pony, or Star Wars with you and actually *talk about and relate* to it. Instead of idle pointless chat, let's have a place where a guy like me can nerd out while cutting your hair. My favorite client in the last three months was a Whovian, I'd jump to work at your place.\n\nIn short (Too late), your post made me think, and I like where it's taking my mind. Cheers.\n\n",
                                    "author": "MundaneHymn",
                                    "id": "c61syu8",
                                    "parent_id": "t1_c5vxoxs",
                                    "score": 4,
                                    "created_utc": 1346473951.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Your salon would attract some nerds expecting to pay $10 for their haircuts and nobody else. You would never even earn enough money to pay for your video games.",
                    "author": null,
                    "id": "c5vwe4p",
                    "parent_id": "t1_c5vsby4",
                    "score": 4,
                    "created_utc": 1345459556.0,
                    "replies": []
                },
                {
                    "body": "Sports cuts is like that with the TVs (but there still is a mirror so you can, you know, see if they aren't fucking your hair up). ",
                    "author": "rebuildingMyself",
                    "id": "c5vv9yo",
                    "parent_id": "t1_c5vsby4",
                    "score": 3,
                    "created_utc": 1345448739.0,
                    "replies": [
                        {
                            "body": "Cool I wish I had a sports cuts near here. \n\nAs for the mirror thing, does anybody actually critique the haircut while it's happening? Like, do you say \"please don't cut off that hair that you just cut off\"? Maybe it's just because I wear glasses that I have to take off during the cut (so I can't really see what they're doing anyway), but I pretty much just hope they don't fuck it up.\n\nI also hate that part at the end where they use the second mirror to show you the back. It's like \"well, you fucked it up and cut it way too short, but I guess there's no point in complaining about it now. I'll just go somewhere else next time\"",
                            "author": null,
                            "id": "c5vxlqu",
                            "parent_id": "t1_c5vv9yo",
                            "score": 0,
                            "created_utc": 1345469430.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "I have no idea how widespread the problem of SAPs and /b/tards is in your country, but in mine it's close to 0. As such, your idea would flop horribly. Some people go to the salon specifically for the small-talk.",
                    "author": null,
                    "id": "c5vv2om",
                    "parent_id": "t1_c5vsby4",
                    "score": 5,
                    "created_utc": 1345447331.0,
                    "replies": [
                        {
                            "body": "It's not that it's a huge \"problem\", but some days I just don't feel like making shitty small talk with a complete stranger for 10 minutes. It's really one of the only businesses where this is an expectation, and I think there's a market for avoiding it. \n\nI mean, cashier talk hardly ever goes beyond a few simple sentences about the weather or something, they definitely never start asking about your job or about sports or anything else.\n\nOf course some people enjoy the small-talk, but just as many (or more) people hate it a lot and currently have no recourse.",
                            "author": null,
                            "id": "c5vxmzg",
                            "parent_id": "t1_c5vv2om",
                            "score": 1,
                            "created_utc": 1345469638.0,
                            "replies": [
                                {
                                    "body": "I know what you mean, I myself don't fancy doing small-talk (when I was a kid I'd avoid shopping for this exact reason). It's legitimate not to want to exchange bullshit stuff just to avoid the silence - although with time I've learned to simply give the barbers a bullshit excuse if they're too chatty (work/school trouble, etc).\n\nMy post was about the macro- level of the idea, however. Its success really depends on the local population - I don't think many men would drive > 100km just for a haircut. Besides, what if your chosen hair style just wouldn't work with your hair type? Those who feel socially awkward dread even exchanges like this:\n\n-Oh, would you like me to do X instead of Y, because of condition Z?\n- Umm, yeah, sure, whatever, just let me get out of there ASAP\n",
                                    "author": null,
                                    "id": "c5vy6ga",
                                    "parent_id": "t1_c5vxmzg",
                                    "score": 1,
                                    "created_utc": 1345472399.0,
                                    "replies": [
                                        {
                                            "body": ">Its success really depends on the local population \n\nNo matter where you go, there's people that don't like small talk banter where a complete stranger starts asking about their jobs and personal life just because they're giving them a service of some sort. It's weird to me that this is the only place this happens.\n\nIf I was actually seriously considering starting a business like this soon, I'd target a big-city area, where people are more likely to want to skip the bullshit. I mean, if I was a businessman, looking to get a plain business-haircut, I'd love to be able to go somewhere that I can sit down and do emails on my blackberry while getting a haircut. ",
                                            "author": null,
                                            "id": "c5vysk2",
                                            "parent_id": "t1_c5vy6ga",
                                            "score": 0,
                                            "created_utc": 1345474804.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Everything else sounds awesome, but as a hairdresser, I still want that tip money... There's no way a salon owner could make money by paying their employees well. On average Salon Owners only make $25,000 a year, which is the same as the average Hair Dresser's Salary. ",
                    "author": null,
                    "id": "c5w3miz",
                    "parent_id": "t1_c5vsby4",
                    "score": 1,
                    "created_utc": 1345489922.0,
                    "replies": [
                        {
                            "body": "Basically, I'd be increasing the price by the amount of the tips, and then passing that increase directly back to the hairdressers. I mean, what's the difference if I tip you $4 directly, or if my bill is $4 higher and then you get paid $4 more to do it? Actually, I guess there's a few differences:\n\n1) You have no incentive to be extra friendly or memorable to each customer, which is the goal in my business\n\n2) As the hairdresser, you're guaranteed the tip amount in the form of increased wage, regardless of how much of an ass the customer is\n\n3) The customer doesn't have to go through the pain in the ass of balancing generosity with cheapness. \n\nI mean, in the end, if the same amount of money is being paid by the customers, then it's just about redistributing it all fairly. If this business model attracted more customers, there'd be more than enough to go around.",
                            "author": null,
                            "id": "c5w4tt4",
                            "parent_id": "t1_c5w3miz",
                            "score": 1,
                            "created_utc": 1345493878.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Male hairdresser here. Just talk. If you're such a SAP that you can't deal with it, just go to someone like me or a barber.",
            "author": "MundaneHymn",
            "id": "c5vob9a",
            "parent_id": "t3_yhgw6",
            "score": 15,
            "created_utc": 1345417487.0,
            "replies": [
                {
                    "body": "But I never talk because I never have anything to say. And then they don't say anything either and it becomes an awkward thing. Arghhh",
                    "author": "TheEmeraldCat",
                    "id": "c5voldw",
                    "parent_id": "t1_c5vob9a",
                    "score": 9,
                    "created_utc": 1345418677.0,
                    "replies": [
                        {
                            "body": "If they're at all good with customers, they'll just follow your lead. I always make a bit of idle chat (Job, school, kids, blah blah) and after a moment or two I can tell if the client is someone I can chat with or if I should stick with just asking about what they want their hair to look like and recommending products and the like. ",
                            "author": "MundaneHymn",
                            "id": "c5vopw6",
                            "parent_id": "t1_c5voldw",
                            "score": 11,
                            "created_utc": 1345419219.0,
                            "replies": []
                        },
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "c5vp4em",
                            "parent_id": "t1_c5voldw",
                            "score": 6,
                            "created_utc": 1345420973.0,
                            "replies": [
                                {
                                    "body": "Amen sir. All we care about is making your hair look as good as we possibly can. Hairdressers get into the buisness for two reasons. Because thy love doing hair and want to make people look great, or because they are in a lucritive buisness that can make them lots of money, especially from tips. If they're good at either of these, you're going to leave looking great. That's their job.",
                                    "author": "MundaneHymn",
                                    "id": "c5vpl6f",
                                    "parent_id": "t1_c5vp4em",
                                    "score": 8,
                                    "created_utc": 1345422988.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "dat autism.",
            "author": "dinozauru_fertil",
            "id": "c5vw6y4",
            "parent_id": "t3_yhgw6",
            "score": 11,
            "created_utc": 1345457398.0,
            "replies": []
        },
        {
            "body": "That's why men should go to barbers instead of salons and, God forbid, great clips or supercuts",
            "author": "Tyler185",
            "id": "c5vnhv0",
            "parent_id": "t3_yhgw6",
            "score": 20,
            "created_utc": 1345413965.0,
            "replies": [
                {
                    "body": "Or you could leave your pocket spaghetti at home and enjoy a nice salon. Hell, I love going to a salon.",
                    "author": "iseeyoutroll",
                    "id": "c5vqa19",
                    "parent_id": "t1_c5vnhv0",
                    "score": 34,
                    "created_utc": 1345425821.0,
                    "replies": [
                        {
                            "body": "I hate when everyone starts vomiting uncontrollably and then spaghetti falls out of my pocket",
                            "author": null,
                            "id": "c5vqe3m",
                            "parent_id": "t1_c5vqa19",
                            "score": 13,
                            "created_utc": 1345426277.0,
                            "replies": []
                        },
                        {
                            "body": "They always cut my hair wrong.",
                            "author": "Tyler185",
                            "id": "c5vqj97",
                            "parent_id": "t1_c5vqa19",
                            "score": 1,
                            "created_utc": 1345426857.0,
                            "replies": [
                                {
                                    "body": "*shrug* Go to a better salon? Barbers were always the ones who cut my hair wrong, hence the switch to a salon.",
                                    "author": "iseeyoutroll",
                                    "id": "c5vqqqc",
                                    "parent_id": "t1_c5vqj97",
                                    "score": 9,
                                    "created_utc": 1345427709.0,
                                    "replies": [
                                        {
                                            "body": "Well it seems we'll have to disagree on this matter. I'm completely loyal to my barber and you're loyal to your salon.",
                                            "author": "Tyler185",
                                            "id": "c5vqzq1",
                                            "parent_id": "t1_c5vqqqc",
                                            "score": 2,
                                            "created_utc": 1345428696.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "I've been going to a salon for men for years and haven't had any issues. Prefer it over a barber, honestly. And I won't even mention Great Clips/SuperCuts.. ",
                    "author": "alaughinmoose",
                    "id": "c5vrvyj",
                    "parent_id": "t1_c5vnhv0",
                    "score": 1,
                    "created_utc": 1345432091.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Unfortunately this picture kind of sums up me going to get my hair cut, but without the boob-anxiety. I hate it. I guess I'm not great at explaining what I want (which I can't really be at fault for since I didn't go to cosmetology school), and the hairdresser is always pretty bad and is preoccupied with talking to other people/hairdressers so it takes 3x longer than it should (not to mention she always forgets stuff). I usually just go to the shitty mall place since I've tried smaller \"barbershops\" and such and haven't noticed any difference, so I might as well use the more convenient shitty hairdresser.\n\nI'm envious of those who don't share my haircut anxiety.",
            "author": "Reiker0",
            "id": "c5vvbxe",
            "parent_id": "t3_yhgw6",
            "score": 3,
            "created_utc": 1345449141.0,
            "replies": []
        },
        {
            "body": "Makes me wonder if there are any good topics here on how to talk to (female) hairdressers. ",
            "author": "Panteloons",
            "id": "c5vmglb",
            "parent_id": "t3_yhgw6",
            "score": 3,
            "created_utc": 1345409496.0,
            "replies": [
                {
                    "body": "They always ask me how high school is going or if I like my classes. I'm 27. It's awkward.",
                    "author": null,
                    "id": "c5vml4p",
                    "parent_id": "t1_c5vmglb",
                    "score": 41,
                    "created_utc": 1345410057.0,
                    "replies": [
                        {
                            "body": "Thats why I have my own barber",
                            "author": null,
                            "id": "c5vmny0",
                            "parent_id": "t1_c5vml4p",
                            "score": 7,
                            "created_utc": 1345410403.0,
                            "replies": []
                        },
                        {
                            "body": "Soon in /r/MFA ..",
                            "author": null,
                            "id": "c5vv227",
                            "parent_id": "t1_c5vml4p",
                            "score": 1,
                            "created_utc": 1345447213.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "This just in: women are people too. Tonight at six: hairdressers are also people.",
                    "author": "Helmet_Icicle",
                    "id": "c5vocx2",
                    "parent_id": "t1_c5vmglb",
                    "score": 17,
                    "created_utc": 1345417682.0,
                    "replies": [
                        {
                            "body": "But what about women who are also hairdressers?",
                            "author": "2-long-didnt-reddit",
                            "id": "c5w550o",
                            "parent_id": "t1_c5vocx2",
                            "score": 2,
                            "created_utc": 1345494905.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Look for me and wear a reddit shirt. I'm still waiting for my first redditor client to sit in my chair!",
                    "author": null,
                    "id": "c5w3ncq",
                    "parent_id": "t1_c5vmglb",
                    "score": 0,
                    "created_utc": 1345489999.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Makes me glad I go to the same stylist every other week. Always something to talk about.",
            "author": null,
            "id": "c5vxddg",
            "parent_id": "t3_yhgw6",
            "score": 2,
            "created_utc": 1345467954.0,
            "replies": []
        },
        {
            "body": "That's why I cut my own hair.",
            "author": "drunk2407",
            "id": "c5vw6ol",
            "parent_id": "t3_yhgw6",
            "score": 1,
            "created_utc": 1345457318.0,
            "replies": []
        },
        {
            "body": "I think the hairdresser uses the mirror also while they cut your hair. They need it as a reference since they are usually standing over the top of you and are too close to see what the total style will look like. \n\nAs to your idea, I can see how that would be really popular. TBH, the only reason I go to my hairdresser is because I am familiar with her and don't want to get to know a new one. BUT it would still be really awkward to not talk to the hairdresser at all. Maybe even more awkward then having to talk to them. I would feel incredibly rude. ",
            "author": "toychristopher",
            "id": "c5vt10q",
            "parent_id": "t1_c5vsby4",
            "score": 16,
            "created_utc": 1345436726.0,
            "replies": [
                {
                    "body": ">I think the hairdresser uses the mirror also while they cut your hair. \n\nTrue, I may need to set up some cameras so they can have a screen on the side that shows the front of you. Part of the purpose of not having a mirror is to avoid the awkward eye contact.\n\n> TBH, the only reason I go to my hairdresser is because I am familiar with her and don't want to get to know a new one.\n\nExactly, because you can avoid the awkward introductions, the questions about your job, whether you're married yet, etc, and just get down to exchanging money for services.\n\n>BUT it would still be really awkward to not talk to the hairdresser at all.\n\nBut that's why it would be a hard rule that they're not allowed to converse to you. They're not expecting you to you talk, so you don't need to feel weird about it. If you tried to engage them, they might give a friendly smile and point to the large sign that says \"NO FUCKING SMALL TALK\" in bold red impact font on top of each station. ",
                    "author": null,
                    "id": "c5vxoxs",
                    "parent_id": "t1_c5vt10q",
                    "score": 4,
                    "created_utc": 1345469952.0,
                    "replies": [
                        {
                            "body": "As a straight male hairdresser, I like the idea of your idea (If you'll excuse my meta statement)\n\nThe TV and vidya (Sorry, it is a thread about 4chan) is a great idea that SportClips sort of already does. toychristopher was correct when he pointed out that we needed the mirror, and as a nerdy hairdresser, the idea about the cameras/screen would fill my fingers up with scars. The training to use that would suck for ME, not to think about most hairdressers who do not stare at computer screens all day. Mirrors are necessary, as is our ability to walk all around you.\n\nUs walking around you brings up my second point. I always say excuse me if a client is playing on their phone or reading a magazine and I have to intrude upon it for a moment. Fuck if they're talking on their phone, I'll just tell them to move it (That's rude), but I'm generally very polite and courteous. I'd feel like a dick if I had to walk in front of some dudes game. Any hairdresser would unless they were the evil bitchy girls who don't like anyone, but those are the same chicks who quit easily. So I would need to talk, just for excuse me's and the like. Plus, some guys go to the salon or barber because they don't KNOW what would look good on them, thus asking me (With my stylish $30 haircut that I got for free from a stylist friend) what would look good on them.\n\nAs an overall summation (Damn I should have written this when the post was current) your business idea is cool, but the clientele draw is FAR too small for anyplace but the densest cities, and I doubt it, as written, would work even in those thriving economies. Only the most awkward, anti-social, angry neckbeards would go there due to the awkwardness of the situation. And I don't think you could staff a place like that with stylists/barbers that would stay for any length of time (Source: I know these people). We're known for being friendly people persons. (People people?) \n\nAnd don't even get me started on the tips thing (If you could pay well enough to give us the salary we need in place of tips, I'd suggest investing in something more lucrative).\n\nIf you toned down this idea you may have something, sort of a \"Sport Clips for nerds\". Ditch the setting and switch it to gamer/tv/movie nerd friendly and keep the hot chicks or friendly guys cutting hair, and it would be golden. Have a tv with games and a wireless controller on the flat screen NEXT to my station. You can move your eyeballs and I can still apologize. Not to mention hiring people who dig the environment and can watch Firefly, Doctor Who, My Little Pony, or Star Wars with you and actually *talk about and relate* to it. Instead of idle pointless chat, let's have a place where a guy like me can nerd out while cutting your hair. My favorite client in the last three months was a Whovian, I'd jump to work at your place.\n\nIn short (Too late), your post made me think, and I like where it's taking my mind. Cheers.\n\n",
                            "author": "MundaneHymn",
                            "id": "c61syu8",
                            "parent_id": "t1_c5vxoxs",
                            "score": 4,
                            "created_utc": 1346473951.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Your salon would attract some nerds expecting to pay $10 for their haircuts and nobody else. You would never even earn enough money to pay for your video games.",
            "author": null,
            "id": "c5vwe4p",
            "parent_id": "t1_c5vsby4",
            "score": 4,
            "created_utc": 1345459556.0,
            "replies": []
        },
        {
            "body": "Sports cuts is like that with the TVs (but there still is a mirror so you can, you know, see if they aren't fucking your hair up). ",
            "author": "rebuildingMyself",
            "id": "c5vv9yo",
            "parent_id": "t1_c5vsby4",
            "score": 3,
            "created_utc": 1345448739.0,
            "replies": [
                {
                    "body": "Cool I wish I had a sports cuts near here. \n\nAs for the mirror thing, does anybody actually critique the haircut while it's happening? Like, do you say \"please don't cut off that hair that you just cut off\"? Maybe it's just because I wear glasses that I have to take off during the cut (so I can't really see what they're doing anyway), but I pretty much just hope they don't fuck it up.\n\nI also hate that part at the end where they use the second mirror to show you the back. It's like \"well, you fucked it up and cut it way too short, but I guess there's no point in complaining about it now. I'll just go somewhere else next time\"",
                    "author": null,
                    "id": "c5vxlqu",
                    "parent_id": "t1_c5vv9yo",
                    "score": 0,
                    "created_utc": 1345469430.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I have no idea how widespread the problem of SAPs and /b/tards is in your country, but in mine it's close to 0. As such, your idea would flop horribly. Some people go to the salon specifically for the small-talk.",
            "author": null,
            "id": "c5vv2om",
            "parent_id": "t1_c5vsby4",
            "score": 5,
            "created_utc": 1345447331.0,
            "replies": [
                {
                    "body": "It's not that it's a huge \"problem\", but some days I just don't feel like making shitty small talk with a complete stranger for 10 minutes. It's really one of the only businesses where this is an expectation, and I think there's a market for avoiding it. \n\nI mean, cashier talk hardly ever goes beyond a few simple sentences about the weather or something, they definitely never start asking about your job or about sports or anything else.\n\nOf course some people enjoy the small-talk, but just as many (or more) people hate it a lot and currently have no recourse.",
                    "author": null,
                    "id": "c5vxmzg",
                    "parent_id": "t1_c5vv2om",
                    "score": 1,
                    "created_utc": 1345469638.0,
                    "replies": [
                        {
                            "body": "I know what you mean, I myself don't fancy doing small-talk (when I was a kid I'd avoid shopping for this exact reason). It's legitimate not to want to exchange bullshit stuff just to avoid the silence - although with time I've learned to simply give the barbers a bullshit excuse if they're too chatty (work/school trouble, etc).\n\nMy post was about the macro- level of the idea, however. Its success really depends on the local population - I don't think many men would drive > 100km just for a haircut. Besides, what if your chosen hair style just wouldn't work with your hair type? Those who feel socially awkward dread even exchanges like this:\n\n-Oh, would you like me to do X instead of Y, because of condition Z?\n- Umm, yeah, sure, whatever, just let me get out of there ASAP\n",
                            "author": null,
                            "id": "c5vy6ga",
                            "parent_id": "t1_c5vxmzg",
                            "score": 1,
                            "created_utc": 1345472399.0,
                            "replies": [
                                {
                                    "body": ">Its success really depends on the local population \n\nNo matter where you go, there's people that don't like small talk banter where a complete stranger starts asking about their jobs and personal life just because they're giving them a service of some sort. It's weird to me that this is the only place this happens.\n\nIf I was actually seriously considering starting a business like this soon, I'd target a big-city area, where people are more likely to want to skip the bullshit. I mean, if I was a businessman, looking to get a plain business-haircut, I'd love to be able to go somewhere that I can sit down and do emails on my blackberry while getting a haircut. ",
                                    "author": null,
                                    "id": "c5vysk2",
                                    "parent_id": "t1_c5vy6ga",
                                    "score": 0,
                                    "created_utc": 1345474804.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Everything else sounds awesome, but as a hairdresser, I still want that tip money... There's no way a salon owner could make money by paying their employees well. On average Salon Owners only make $25,000 a year, which is the same as the average Hair Dresser's Salary. ",
            "author": null,
            "id": "c5w3miz",
            "parent_id": "t1_c5vsby4",
            "score": 1,
            "created_utc": 1345489922.0,
            "replies": [
                {
                    "body": "Basically, I'd be increasing the price by the amount of the tips, and then passing that increase directly back to the hairdressers. I mean, what's the difference if I tip you $4 directly, or if my bill is $4 higher and then you get paid $4 more to do it? Actually, I guess there's a few differences:\n\n1) You have no incentive to be extra friendly or memorable to each customer, which is the goal in my business\n\n2) As the hairdresser, you're guaranteed the tip amount in the form of increased wage, regardless of how much of an ass the customer is\n\n3) The customer doesn't have to go through the pain in the ass of balancing generosity with cheapness. \n\nI mean, in the end, if the same amount of money is being paid by the customers, then it's just about redistributing it all fairly. If this business model attracted more customers, there'd be more than enough to go around.",
                    "author": null,
                    "id": "c5w4tt4",
                    "parent_id": "t1_c5w3miz",
                    "score": 1,
                    "created_utc": 1345493878.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "But I never talk because I never have anything to say. And then they don't say anything either and it becomes an awkward thing. Arghhh",
            "author": "TheEmeraldCat",
            "id": "c5voldw",
            "parent_id": "t1_c5vob9a",
            "score": 9,
            "created_utc": 1345418677.0,
            "replies": [
                {
                    "body": "If they're at all good with customers, they'll just follow your lead. I always make a bit of idle chat (Job, school, kids, blah blah) and after a moment or two I can tell if the client is someone I can chat with or if I should stick with just asking about what they want their hair to look like and recommending products and the like. ",
                    "author": "MundaneHymn",
                    "id": "c5vopw6",
                    "parent_id": "t1_c5voldw",
                    "score": 11,
                    "created_utc": 1345419219.0,
                    "replies": []
                },
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "c5vp4em",
                    "parent_id": "t1_c5voldw",
                    "score": 6,
                    "created_utc": 1345420973.0,
                    "replies": [
                        {
                            "body": "Amen sir. All we care about is making your hair look as good as we possibly can. Hairdressers get into the buisness for two reasons. Because thy love doing hair and want to make people look great, or because they are in a lucritive buisness that can make them lots of money, especially from tips. If they're good at either of these, you're going to leave looking great. That's their job.",
                            "author": "MundaneHymn",
                            "id": "c5vpl6f",
                            "parent_id": "t1_c5vp4em",
                            "score": 8,
                            "created_utc": 1345422988.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Or you could leave your pocket spaghetti at home and enjoy a nice salon. Hell, I love going to a salon.",
            "author": "iseeyoutroll",
            "id": "c5vqa19",
            "parent_id": "t1_c5vnhv0",
            "score": 34,
            "created_utc": 1345425821.0,
            "replies": [
                {
                    "body": "I hate when everyone starts vomiting uncontrollably and then spaghetti falls out of my pocket",
                    "author": null,
                    "id": "c5vqe3m",
                    "parent_id": "t1_c5vqa19",
                    "score": 13,
                    "created_utc": 1345426277.0,
                    "replies": []
                },
                {
                    "body": "They always cut my hair wrong.",
                    "author": "Tyler185",
                    "id": "c5vqj97",
                    "parent_id": "t1_c5vqa19",
                    "score": 1,
                    "created_utc": 1345426857.0,
                    "replies": [
                        {
                            "body": "*shrug* Go to a better salon? Barbers were always the ones who cut my hair wrong, hence the switch to a salon.",
                            "author": "iseeyoutroll",
                            "id": "c5vqqqc",
                            "parent_id": "t1_c5vqj97",
                            "score": 9,
                            "created_utc": 1345427709.0,
                            "replies": [
                                {
                                    "body": "Well it seems we'll have to disagree on this matter. I'm completely loyal to my barber and you're loyal to your salon.",
                                    "author": "Tyler185",
                                    "id": "c5vqzq1",
                                    "parent_id": "t1_c5vqqqc",
                                    "score": 2,
                                    "created_utc": 1345428696.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I've been going to a salon for men for years and haven't had any issues. Prefer it over a barber, honestly. And I won't even mention Great Clips/SuperCuts.. ",
            "author": "alaughinmoose",
            "id": "c5vrvyj",
            "parent_id": "t1_c5vnhv0",
            "score": 1,
            "created_utc": 1345432091.0,
            "replies": []
        },
        {
            "body": "They always ask me how high school is going or if I like my classes. I'm 27. It's awkward.",
            "author": null,
            "id": "c5vml4p",
            "parent_id": "t1_c5vmglb",
            "score": 41,
            "created_utc": 1345410057.0,
            "replies": [
                {
                    "body": "Thats why I have my own barber",
                    "author": null,
                    "id": "c5vmny0",
                    "parent_id": "t1_c5vml4p",
                    "score": 7,
                    "created_utc": 1345410403.0,
                    "replies": []
                },
                {
                    "body": "Soon in /r/MFA ..",
                    "author": null,
                    "id": "c5vv227",
                    "parent_id": "t1_c5vml4p",
                    "score": 1,
                    "created_utc": 1345447213.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "This just in: women are people too. Tonight at six: hairdressers are also people.",
            "author": "Helmet_Icicle",
            "id": "c5vocx2",
            "parent_id": "t1_c5vmglb",
            "score": 17,
            "created_utc": 1345417682.0,
            "replies": [
                {
                    "body": "But what about women who are also hairdressers?",
                    "author": "2-long-didnt-reddit",
                    "id": "c5w550o",
                    "parent_id": "t1_c5vocx2",
                    "score": 2,
                    "created_utc": 1345494905.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Look for me and wear a reddit shirt. I'm still waiting for my first redditor client to sit in my chair!",
            "author": null,
            "id": "c5w3ncq",
            "parent_id": "t1_c5vmglb",
            "score": 0,
            "created_utc": 1345489999.0,
            "replies": []
        },
        {
            "body": ">I think the hairdresser uses the mirror also while they cut your hair. \n\nTrue, I may need to set up some cameras so they can have a screen on the side that shows the front of you. Part of the purpose of not having a mirror is to avoid the awkward eye contact.\n\n> TBH, the only reason I go to my hairdresser is because I am familiar with her and don't want to get to know a new one.\n\nExactly, because you can avoid the awkward introductions, the questions about your job, whether you're married yet, etc, and just get down to exchanging money for services.\n\n>BUT it would still be really awkward to not talk to the hairdresser at all.\n\nBut that's why it would be a hard rule that they're not allowed to converse to you. They're not expecting you to you talk, so you don't need to feel weird about it. If you tried to engage them, they might give a friendly smile and point to the large sign that says \"NO FUCKING SMALL TALK\" in bold red impact font on top of each station. ",
            "author": null,
            "id": "c5vxoxs",
            "parent_id": "t1_c5vt10q",
            "score": 4,
            "created_utc": 1345469952.0,
            "replies": [
                {
                    "body": "As a straight male hairdresser, I like the idea of your idea (If you'll excuse my meta statement)\n\nThe TV and vidya (Sorry, it is a thread about 4chan) is a great idea that SportClips sort of already does. toychristopher was correct when he pointed out that we needed the mirror, and as a nerdy hairdresser, the idea about the cameras/screen would fill my fingers up with scars. The training to use that would suck for ME, not to think about most hairdressers who do not stare at computer screens all day. Mirrors are necessary, as is our ability to walk all around you.\n\nUs walking around you brings up my second point. I always say excuse me if a client is playing on their phone or reading a magazine and I have to intrude upon it for a moment. Fuck if they're talking on their phone, I'll just tell them to move it (That's rude), but I'm generally very polite and courteous. I'd feel like a dick if I had to walk in front of some dudes game. Any hairdresser would unless they were the evil bitchy girls who don't like anyone, but those are the same chicks who quit easily. So I would need to talk, just for excuse me's and the like. Plus, some guys go to the salon or barber because they don't KNOW what would look good on them, thus asking me (With my stylish $30 haircut that I got for free from a stylist friend) what would look good on them.\n\nAs an overall summation (Damn I should have written this when the post was current) your business idea is cool, but the clientele draw is FAR too small for anyplace but the densest cities, and I doubt it, as written, would work even in those thriving economies. Only the most awkward, anti-social, angry neckbeards would go there due to the awkwardness of the situation. And I don't think you could staff a place like that with stylists/barbers that would stay for any length of time (Source: I know these people). We're known for being friendly people persons. (People people?) \n\nAnd don't even get me started on the tips thing (If you could pay well enough to give us the salary we need in place of tips, I'd suggest investing in something more lucrative).\n\nIf you toned down this idea you may have something, sort of a \"Sport Clips for nerds\". Ditch the setting and switch it to gamer/tv/movie nerd friendly and keep the hot chicks or friendly guys cutting hair, and it would be golden. Have a tv with games and a wireless controller on the flat screen NEXT to my station. You can move your eyeballs and I can still apologize. Not to mention hiring people who dig the environment and can watch Firefly, Doctor Who, My Little Pony, or Star Wars with you and actually *talk about and relate* to it. Instead of idle pointless chat, let's have a place where a guy like me can nerd out while cutting your hair. My favorite client in the last three months was a Whovian, I'd jump to work at your place.\n\nIn short (Too late), your post made me think, and I like where it's taking my mind. Cheers.\n\n",
                    "author": "MundaneHymn",
                    "id": "c61syu8",
                    "parent_id": "t1_c5vxoxs",
                    "score": 4,
                    "created_utc": 1346473951.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Cool I wish I had a sports cuts near here. \n\nAs for the mirror thing, does anybody actually critique the haircut while it's happening? Like, do you say \"please don't cut off that hair that you just cut off\"? Maybe it's just because I wear glasses that I have to take off during the cut (so I can't really see what they're doing anyway), but I pretty much just hope they don't fuck it up.\n\nI also hate that part at the end where they use the second mirror to show you the back. It's like \"well, you fucked it up and cut it way too short, but I guess there's no point in complaining about it now. I'll just go somewhere else next time\"",
            "author": null,
            "id": "c5vxlqu",
            "parent_id": "t1_c5vv9yo",
            "score": 0,
            "created_utc": 1345469430.0,
            "replies": []
        },
        {
            "body": "It's not that it's a huge \"problem\", but some days I just don't feel like making shitty small talk with a complete stranger for 10 minutes. It's really one of the only businesses where this is an expectation, and I think there's a market for avoiding it. \n\nI mean, cashier talk hardly ever goes beyond a few simple sentences about the weather or something, they definitely never start asking about your job or about sports or anything else.\n\nOf course some people enjoy the small-talk, but just as many (or more) people hate it a lot and currently have no recourse.",
            "author": null,
            "id": "c5vxmzg",
            "parent_id": "t1_c5vv2om",
            "score": 1,
            "created_utc": 1345469638.0,
            "replies": [
                {
                    "body": "I know what you mean, I myself don't fancy doing small-talk (when I was a kid I'd avoid shopping for this exact reason). It's legitimate not to want to exchange bullshit stuff just to avoid the silence - although with time I've learned to simply give the barbers a bullshit excuse if they're too chatty (work/school trouble, etc).\n\nMy post was about the macro- level of the idea, however. Its success really depends on the local population - I don't think many men would drive > 100km just for a haircut. Besides, what if your chosen hair style just wouldn't work with your hair type? Those who feel socially awkward dread even exchanges like this:\n\n-Oh, would you like me to do X instead of Y, because of condition Z?\n- Umm, yeah, sure, whatever, just let me get out of there ASAP\n",
                    "author": null,
                    "id": "c5vy6ga",
                    "parent_id": "t1_c5vxmzg",
                    "score": 1,
                    "created_utc": 1345472399.0,
                    "replies": [
                        {
                            "body": ">Its success really depends on the local population \n\nNo matter where you go, there's people that don't like small talk banter where a complete stranger starts asking about their jobs and personal life just because they're giving them a service of some sort. It's weird to me that this is the only place this happens.\n\nIf I was actually seriously considering starting a business like this soon, I'd target a big-city area, where people are more likely to want to skip the bullshit. I mean, if I was a businessman, looking to get a plain business-haircut, I'd love to be able to go somewhere that I can sit down and do emails on my blackberry while getting a haircut. ",
                            "author": null,
                            "id": "c5vysk2",
                            "parent_id": "t1_c5vy6ga",
                            "score": 0,
                            "created_utc": 1345474804.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Basically, I'd be increasing the price by the amount of the tips, and then passing that increase directly back to the hairdressers. I mean, what's the difference if I tip you $4 directly, or if my bill is $4 higher and then you get paid $4 more to do it? Actually, I guess there's a few differences:\n\n1) You have no incentive to be extra friendly or memorable to each customer, which is the goal in my business\n\n2) As the hairdresser, you're guaranteed the tip amount in the form of increased wage, regardless of how much of an ass the customer is\n\n3) The customer doesn't have to go through the pain in the ass of balancing generosity with cheapness. \n\nI mean, in the end, if the same amount of money is being paid by the customers, then it's just about redistributing it all fairly. If this business model attracted more customers, there'd be more than enough to go around.",
            "author": null,
            "id": "c5w4tt4",
            "parent_id": "t1_c5w3miz",
            "score": 1,
            "created_utc": 1345493878.0,
            "replies": []
        },
        {
            "body": "If they're at all good with customers, they'll just follow your lead. I always make a bit of idle chat (Job, school, kids, blah blah) and after a moment or two I can tell if the client is someone I can chat with or if I should stick with just asking about what they want their hair to look like and recommending products and the like. ",
            "author": "MundaneHymn",
            "id": "c5vopw6",
            "parent_id": "t1_c5voldw",
            "score": 11,
            "created_utc": 1345419219.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "c5vp4em",
            "parent_id": "t1_c5voldw",
            "score": 6,
            "created_utc": 1345420973.0,
            "replies": [
                {
                    "body": "Amen sir. All we care about is making your hair look as good as we possibly can. Hairdressers get into the buisness for two reasons. Because thy love doing hair and want to make people look great, or because they are in a lucritive buisness that can make them lots of money, especially from tips. If they're good at either of these, you're going to leave looking great. That's their job.",
                    "author": "MundaneHymn",
                    "id": "c5vpl6f",
                    "parent_id": "t1_c5vp4em",
                    "score": 8,
                    "created_utc": 1345422988.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I hate when everyone starts vomiting uncontrollably and then spaghetti falls out of my pocket",
            "author": null,
            "id": "c5vqe3m",
            "parent_id": "t1_c5vqa19",
            "score": 13,
            "created_utc": 1345426277.0,
            "replies": []
        },
        {
            "body": "They always cut my hair wrong.",
            "author": "Tyler185",
            "id": "c5vqj97",
            "parent_id": "t1_c5vqa19",
            "score": 1,
            "created_utc": 1345426857.0,
            "replies": [
                {
                    "body": "*shrug* Go to a better salon? Barbers were always the ones who cut my hair wrong, hence the switch to a salon.",
                    "author": "iseeyoutroll",
                    "id": "c5vqqqc",
                    "parent_id": "t1_c5vqj97",
                    "score": 9,
                    "created_utc": 1345427709.0,
                    "replies": [
                        {
                            "body": "Well it seems we'll have to disagree on this matter. I'm completely loyal to my barber and you're loyal to your salon.",
                            "author": "Tyler185",
                            "id": "c5vqzq1",
                            "parent_id": "t1_c5vqqqc",
                            "score": 2,
                            "created_utc": 1345428696.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Thats why I have my own barber",
            "author": null,
            "id": "c5vmny0",
            "parent_id": "t1_c5vml4p",
            "score": 7,
            "created_utc": 1345410403.0,
            "replies": []
        },
        {
            "body": "Soon in /r/MFA ..",
            "author": null,
            "id": "c5vv227",
            "parent_id": "t1_c5vml4p",
            "score": 1,
            "created_utc": 1345447213.0,
            "replies": []
        },
        {
            "body": "But what about women who are also hairdressers?",
            "author": "2-long-didnt-reddit",
            "id": "c5w550o",
            "parent_id": "t1_c5vocx2",
            "score": 2,
            "created_utc": 1345494905.0,
            "replies": []
        },
        {
            "body": "As a straight male hairdresser, I like the idea of your idea (If you'll excuse my meta statement)\n\nThe TV and vidya (Sorry, it is a thread about 4chan) is a great idea that SportClips sort of already does. toychristopher was correct when he pointed out that we needed the mirror, and as a nerdy hairdresser, the idea about the cameras/screen would fill my fingers up with scars. The training to use that would suck for ME, not to think about most hairdressers who do not stare at computer screens all day. Mirrors are necessary, as is our ability to walk all around you.\n\nUs walking around you brings up my second point. I always say excuse me if a client is playing on their phone or reading a magazine and I have to intrude upon it for a moment. Fuck if they're talking on their phone, I'll just tell them to move it (That's rude), but I'm generally very polite and courteous. I'd feel like a dick if I had to walk in front of some dudes game. Any hairdresser would unless they were the evil bitchy girls who don't like anyone, but those are the same chicks who quit easily. So I would need to talk, just for excuse me's and the like. Plus, some guys go to the salon or barber because they don't KNOW what would look good on them, thus asking me (With my stylish $30 haircut that I got for free from a stylist friend) what would look good on them.\n\nAs an overall summation (Damn I should have written this when the post was current) your business idea is cool, but the clientele draw is FAR too small for anyplace but the densest cities, and I doubt it, as written, would work even in those thriving economies. Only the most awkward, anti-social, angry neckbeards would go there due to the awkwardness of the situation. And I don't think you could staff a place like that with stylists/barbers that would stay for any length of time (Source: I know these people). We're known for being friendly people persons. (People people?) \n\nAnd don't even get me started on the tips thing (If you could pay well enough to give us the salary we need in place of tips, I'd suggest investing in something more lucrative).\n\nIf you toned down this idea you may have something, sort of a \"Sport Clips for nerds\". Ditch the setting and switch it to gamer/tv/movie nerd friendly and keep the hot chicks or friendly guys cutting hair, and it would be golden. Have a tv with games and a wireless controller on the flat screen NEXT to my station. You can move your eyeballs and I can still apologize. Not to mention hiring people who dig the environment and can watch Firefly, Doctor Who, My Little Pony, or Star Wars with you and actually *talk about and relate* to it. Instead of idle pointless chat, let's have a place where a guy like me can nerd out while cutting your hair. My favorite client in the last three months was a Whovian, I'd jump to work at your place.\n\nIn short (Too late), your post made me think, and I like where it's taking my mind. Cheers.\n\n",
            "author": "MundaneHymn",
            "id": "c61syu8",
            "parent_id": "t1_c5vxoxs",
            "score": 4,
            "created_utc": 1346473951.0,
            "replies": []
        },
        {
            "body": "I know what you mean, I myself don't fancy doing small-talk (when I was a kid I'd avoid shopping for this exact reason). It's legitimate not to want to exchange bullshit stuff just to avoid the silence - although with time I've learned to simply give the barbers a bullshit excuse if they're too chatty (work/school trouble, etc).\n\nMy post was about the macro- level of the idea, however. Its success really depends on the local population - I don't think many men would drive > 100km just for a haircut. Besides, what if your chosen hair style just wouldn't work with your hair type? Those who feel socially awkward dread even exchanges like this:\n\n-Oh, would you like me to do X instead of Y, because of condition Z?\n- Umm, yeah, sure, whatever, just let me get out of there ASAP\n",
            "author": null,
            "id": "c5vy6ga",
            "parent_id": "t1_c5vxmzg",
            "score": 1,
            "created_utc": 1345472399.0,
            "replies": [
                {
                    "body": ">Its success really depends on the local population \n\nNo matter where you go, there's people that don't like small talk banter where a complete stranger starts asking about their jobs and personal life just because they're giving them a service of some sort. It's weird to me that this is the only place this happens.\n\nIf I was actually seriously considering starting a business like this soon, I'd target a big-city area, where people are more likely to want to skip the bullshit. I mean, if I was a businessman, looking to get a plain business-haircut, I'd love to be able to go somewhere that I can sit down and do emails on my blackberry while getting a haircut. ",
                    "author": null,
                    "id": "c5vysk2",
                    "parent_id": "t1_c5vy6ga",
                    "score": 0,
                    "created_utc": 1345474804.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Amen sir. All we care about is making your hair look as good as we possibly can. Hairdressers get into the buisness for two reasons. Because thy love doing hair and want to make people look great, or because they are in a lucritive buisness that can make them lots of money, especially from tips. If they're good at either of these, you're going to leave looking great. That's their job.",
            "author": "MundaneHymn",
            "id": "c5vpl6f",
            "parent_id": "t1_c5vp4em",
            "score": 8,
            "created_utc": 1345422988.0,
            "replies": []
        },
        {
            "body": "*shrug* Go to a better salon? Barbers were always the ones who cut my hair wrong, hence the switch to a salon.",
            "author": "iseeyoutroll",
            "id": "c5vqqqc",
            "parent_id": "t1_c5vqj97",
            "score": 9,
            "created_utc": 1345427709.0,
            "replies": [
                {
                    "body": "Well it seems we'll have to disagree on this matter. I'm completely loyal to my barber and you're loyal to your salon.",
                    "author": "Tyler185",
                    "id": "c5vqzq1",
                    "parent_id": "t1_c5vqqqc",
                    "score": 2,
                    "created_utc": 1345428696.0,
                    "replies": []
                }
            ]
        },
        {
            "body": ">Its success really depends on the local population \n\nNo matter where you go, there's people that don't like small talk banter where a complete stranger starts asking about their jobs and personal life just because they're giving them a service of some sort. It's weird to me that this is the only place this happens.\n\nIf I was actually seriously considering starting a business like this soon, I'd target a big-city area, where people are more likely to want to skip the bullshit. I mean, if I was a businessman, looking to get a plain business-haircut, I'd love to be able to go somewhere that I can sit down and do emails on my blackberry while getting a haircut. ",
            "author": null,
            "id": "c5vysk2",
            "parent_id": "t1_c5vy6ga",
            "score": 0,
            "created_utc": 1345474804.0,
            "replies": []
        },
        {
            "body": "Well it seems we'll have to disagree on this matter. I'm completely loyal to my barber and you're loyal to your salon.",
            "author": "Tyler185",
            "id": "c5vqzq1",
            "parent_id": "t1_c5vqqqc",
            "score": 2,
            "created_utc": 1345428696.0,
            "replies": []
        }
    ]
}