{
    "title": "should i go to the police?",
    "post_id": "e5zj5k",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/e5zj5k/should_i_go_to_the_police/",
    "author": "sugaradriana",
    "body": "hey so i was meeting a POT SD just at the border of France and Belgium and at first we were just talking about a M&G and he would pay for the train and hotel etc.. all fine. \nthen he asked if i had a friend, so i told hem yes (me and a close friend sometimes go to M&G’s together some guys are really into it) so he asked me is she younger then you? and i was like??? younger than me???? mind you im 18 ( turning 19 in 5 days) so i told him absolutely not and besides i dont know anyone who is underage. He apologised and told me it wasn’t to have sex with her and we moved on, he also offered a crazy big amount for a platonic m&g and it felt really sketchy he offered to pay double the amount if i brought a underage girl anyway this morning i was suppose to see him  but i was like hell nah i blocked his ass real quick, think i really dodged a bullet, but THEN he texted me with a different number offering me triple the amount to come and 5 times the amount if i brought a younger friend..... i was curious so i asked him why are you so keen on me bringing a underage girl? and he told me he did not want to have sex wit her but he did want to kiss and touch her so i told him thats illegal and he responded with, it will be very discreet  nobody will know, i was shoooooook he even told me at one point cant you go to a high-school and look for some girl\nshould i go to the police? report him? i have all the texts and his name and number, the problem is im scared my mom is going to find out when i go to the police, but i dont want him to actually do this with underage girls",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/e5zj5k/should_i_go_to_the_police/",
    "score": 111,
    "upvote_ratio": 0.93,
    "created_utc": 1575467610.0,
    "num_comments": 51,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "He could be a trafficker with no intention of ever paying you. Go to the police and please DON'T meet him",
            "author": "xxca1ibur",
            "id": "f9mty6t",
            "parent_id": "t3_e5zj5k",
            "score": 80,
            "created_utc": 1575470215.0,
            "replies": [
                {
                    "body": "Traffickers don't typically find victims off of sugar dating sites",
                    "author": "69goodvibes69",
                    "id": "f9ocb34",
                    "parent_id": "t1_f9mty6t",
                    "score": -4,
                    "created_utc": 1575501180.0,
                    "replies": [
                        {
                            "body": "they absolutely do.",
                            "author": null,
                            "id": "f9osagy",
                            "parent_id": "t1_f9ocb34",
                            "score": 9,
                            "created_utc": 1575512183.0,
                            "replies": [
                                {
                                    "body": "I'm sorry, but where are you from? That's not typically how pimps/traffickers find victims \nAre you American?",
                                    "author": "69goodvibes69",
                                    "id": "f9ozd2q",
                                    "parent_id": "t1_f9osagy",
                                    "score": -3,
                                    "created_utc": 1575517418.0,
                                    "replies": [
                                        {
                                            "body": "yes i am american.",
                                            "author": null,
                                            "id": "f9p1kzr",
                                            "parent_id": "t1_f9ozd2q",
                                            "score": 3,
                                            "created_utc": 1575519084.0,
                                            "replies": [
                                                {
                                                    "body": "I can tell.",
                                                    "author": "69goodvibes69",
                                                    "id": "f9p1zdu",
                                                    "parent_id": "t1_f9p1kzr",
                                                    "score": -4,
                                                    "created_utc": 1575519397.0,
                                                    "replies": [
                                                        {
                                                            "body": "because traffickers use sugar dating to lure victims? is that not a thing worldwide?",
                                                            "author": null,
                                                            "id": "f9p310w",
                                                            "parent_id": "t1_f9p1zdu",
                                                            "score": 3,
                                                            "created_utc": 1575520232.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "Yes they do, I am European, and it happens here, in America and everywhere, just because is not the common thing for you, doesn't mean it doesn't happen a lot.",
                            "author": "Paradiseislandgg",
                            "id": "f9qbdzm",
                            "parent_id": "t1_f9ocb34",
                            "score": 1,
                            "created_utc": 1575558355.0,
                            "replies": [
                                {
                                    "body": "Are you Western European? \nI'm sorry, but that's not really how traffickers/pimps usually work.. .\nIf it happens \"all the time\", can you please give me articles where it talks about how many times (percentages) pimps/traffickers use this as a technique? \nFrom op's post, this does not sound like trafficking at all",
                                    "author": "69goodvibes69",
                                    "id": "f9s8463",
                                    "parent_id": "t1_f9qbdzm",
                                    "score": 0,
                                    "created_utc": 1575587404.0,
                                    "replies": [
                                        {
                                            "body": "are u a trafficker why r u trying to argue w people over it it happens all the time",
                                            "author": "asswaterv2",
                                            "id": "f9s8q0w",
                                            "parent_id": "t1_f9s8463",
                                            "score": 2,
                                            "created_utc": 1575587673.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "No, I am spanish, you? why are you arguing about this? are you a pimp or a trafficker? You seem tooo keen to make us change our minds about something that is common knowledge. Please, give me an explanation of why we are wrong? it seems like you are pretty sure of how pimps trafickers work",
                                            "author": "Paradiseislandgg",
                                            "id": "f9t6xy4",
                                            "parent_id": "t1_f9s8463",
                                            "score": 0,
                                            "created_utc": 1575610861.0,
                                            "replies": [
                                                {
                                                    "body": "If you are Spanish, then yes, you are Western European. How could you possibly consider Spain Eastern European??? Really, that says enough about your mental state. \nI have spoken to pimps from your country (Spain) and other Western European countries who have offered me \"jobs\", most will either offer straight away (but of course lie and say how much money you can make, you don't even need nie/immigration papers), use the \"lover boy\" technique or of course the stereotypical offering a fake job then stealing passport \nThe people I know of who are survivors of forced prostitution , none of them used a sugar dating website \nAlthough there are other dangers that can arise from sugar dating (rape, kidnapping, even murder) trafficking is not a likely one, it may happen but the situation op described does not sound like it",
                                                    "author": "69goodvibes69",
                                                    "id": "f9uspg0",
                                                    "parent_id": "t1_f9t6xy4",
                                                    "score": 1,
                                                    "created_utc": 1575657013.0,
                                                    "replies": [
                                                        {
                                                            "body": "I misread the western european fact, but anyway, if you have to try to put me down with the \"that says a lot about your mental state\" to make your argument valid, I have literally nothing else to say to you. Whatever you want to think, I don't care anymore.",
                                                            "author": "Paradiseislandgg",
                                                            "id": "f9ut4xr",
                                                            "parent_id": "t1_f9uspg0",
                                                            "score": 2,
                                                            "created_utc": 1575657236.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Yes. Keep the receipts. Predator",
            "author": "perryplats",
            "id": "f9mqah4",
            "parent_id": "t3_e5zj5k",
            "score": 119,
            "created_utc": 1575467714.0,
            "replies": [
                {
                    "body": "Or worse, human trafficker. \n\n&#x200B;\n\n\\*Not that there is some scale of people that prey on the young but ...",
                    "author": "sortasapien",
                    "id": "f9nijhe",
                    "parent_id": "t1_f9mqah4",
                    "score": 51,
                    "created_utc": 1575485132.0,
                    "replies": [
                        {
                            "body": "Happy Cake Day",
                            "author": "perryplats",
                            "id": "f9nl7q6",
                            "parent_id": "t1_f9nijhe",
                            "score": 7,
                            "created_utc": 1575486449.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Agreed with the above comments. I’m worried for YOUR safely as well. You need to tell some type of authority, whether it’s local police of the feds. The way he kept upping the amount offered AND kept pushing, it makes me think he’s not only a predator but a trafficker. Please for your sake and SAFETY, go to the authorities and TAKE someone with you. This is some scary shit... stay smart, and stay safe, love. ♥️",
            "author": "victory304",
            "id": "f9mrkmn",
            "parent_id": "t3_e5zj5k",
            "score": 63,
            "created_utc": 1575468622.0,
            "replies": [
                {
                    "body": "thats what i was thinking, i really needed the money so i was about to go meet him but my body was like NO so i think i really dodged a bullet here",
                    "author": "sugaradriana",
                    "id": "f9ms4sm",
                    "parent_id": "t1_f9mrkmn",
                    "score": 30,
                    "created_utc": 1575469003.0,
                    "replies": [
                        {
                            "body": "It sounds like you did. Your instincts kicked in and self preservation took over, which I am glad for. I’m glad you’re okay and hold on to ANY PHYSICAL PROOF that you have so you can show the cops or whoever. Make copies, take screenshots, and put/save them in multiple places. Email... separate thumb drive, google drive, whatever. Just MULTIPLE PLACES. I’m so glad you questioned what was happening and that you’re okay. I’ve been in almost an identical situation, I just wasn’t asked to bring a younger friend. But the more I said no, the more the money went up. I immediately ejected myself from the situation, blocked him and reported him. Which brings me to my next question. Have you reported him to POF, and do you have any pictures that you can show to the police because people like this usually have more than one “name” or alias.",
                            "author": "victory304",
                            "id": "f9msvrw",
                            "parent_id": "t1_f9ms4sm",
                            "score": 15,
                            "created_utc": 1575469512.0,
                            "replies": [
                                {
                                    "body": "i actually have a pic of him and his “name” i know the place where he lives and i know some info but its possible that its all fake, whats is also super weird is he kept sending me pictures of enveloppes with crazy amounts of cash in. (that can be legal money right?) \nanyway i just checked our convo and saw he deleted everything luckily i made a screen video of our whole convo. everything is kind of sinking in atm i need to be way more careful  with who i trust and meet. im still trying to figure out if i should go to the police because i have a feeling they wont take me serious and that they will look at me like this dirty whore. because the place where i live is really conservative. but its the right thing to do and i think i will go anyway. and btw im sorry but for what stands POF?",
                                    "author": "sugaradriana",
                                    "id": "f9muce8",
                                    "parent_id": "t1_f9msvrw",
                                    "score": 21,
                                    "created_utc": 1575470463.0,
                                    "replies": [
                                        {
                                            "body": "It's a learning experience.  Generally, if it sounds too good to be true (crazy money for a platonic m&g), it probably is.  And of course always meet in public, etc.  Having a friend or at least someone who knows where you are and can call the cops if you don't report in is a good idea, too.\n\nGlad you're safe.",
                                            "author": null,
                                            "id": "f9o8bq3",
                                            "parent_id": "t1_f9muce8",
                                            "score": 5,
                                            "created_utc": 1575498620.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "Reach out to an organization in your country that combats sex trafficking or protects women or children - they may give you very helpful advice and may go with you to the police so you don’t have to do it alone.",
                                            "author": null,
                                            "id": "f9p1cyt",
                                            "parent_id": "t1_f9muce8",
                                            "score": 1,
                                            "created_utc": 1575518913.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Disgusting. Screenshot everything, find a way to place a tip. \n\nYou did the right thing and should definitely report him. His behavior seems really erratic and pushy; making a new number to text you, repeatedly increasing the PPM, proposing you go find a random girl?? \n\nHe’s clearly using younger SBs who likely have even younger, more naive friends.",
            "author": "meadowlarks-",
            "id": "f9mwfkr",
            "parent_id": "t3_e5zj5k",
            "score": 17,
            "created_utc": 1575471766.0,
            "replies": []
        },
        {
            "body": "Go to the police-they could set up a sting",
            "author": "GSSD",
            "id": "f9my68p",
            "parent_id": "t3_e5zj5k",
            "score": 14,
            "created_utc": 1575472849.0,
            "replies": []
        },
        {
            "body": "I thought the age of consent in most European countries was super low.\n\nLooked it up. 15 in both Belgium and France. So I doubt the cops in either country will care.",
            "author": "ifisch",
            "id": "f9mv5g0",
            "parent_id": "t3_e5zj5k",
            "score": 16,
            "created_utc": 1575470968.0,
            "replies": [
                {
                    "body": "Kinda what I was thinking when first reading this. Creepy, yes. Illegal, highly doubtful.",
                    "author": "mraspencer",
                    "id": "f9mwzdn",
                    "parent_id": "t1_f9mv5g0",
                    "score": 11,
                    "created_utc": 1575472111.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "f9n8cdt",
                            "parent_id": "t1_f9mwzdn",
                            "score": 15,
                            "created_utc": 1575479179.0,
                            "replies": [
                                {
                                    "body": "Well that will make things a tad trickier.",
                                    "author": "mraspencer",
                                    "id": "f9n8uky",
                                    "parent_id": "t1_f9n8cdt",
                                    "score": -1,
                                    "created_utc": 1575479490.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Girl that sounds like sex trafficking. Don't meet him and definitely report him. You are 18 so the police can't involve ur parents. Ur legally an adult and as long as ur messages don't make you look like a prostitute, ur fine. Definitely go to the police with the information. If ur not comfortable showing up immediately you can call the sheriff's department and tell them over the phone before going in. Save a life girl!",
            "author": "Swallowyouurpride",
            "id": "f9mwaj3",
            "parent_id": "t3_e5zj5k",
            "score": 10,
            "created_utc": 1575471683.0,
            "replies": []
        },
        {
            "body": "This is horrible. Absolutely go to police glad you didn’t see him he’s a predator 100%",
            "author": "DYummyPanty",
            "id": "f9nn6r1",
            "parent_id": "t3_e5zj5k",
            "score": 3,
            "created_utc": 1575487402.0,
            "replies": [
                {
                    "body": "im going first thing tomorrow but im afraid that they wont take it seriously",
                    "author": "sugaradriana",
                    "id": "f9nv0qt",
                    "parent_id": "t1_f9nn6r1",
                    "score": 5,
                    "created_utc": 1575491128.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Go to the police! He may find another woman willing to do this for him and child could be put in danger",
            "author": "JaySey1001",
            "id": "f9n96k7",
            "parent_id": "t3_e5zj5k",
            "score": 3,
            "created_utc": 1575479693.0,
            "replies": []
        },
        {
            "body": "I agree with the others to go to the police.  First, report his profile to SA & hopefully they take it down.  Then go tell the police everything you know about him.  \n\nThe part about soliciting minors is very illegal.  We need people like this off of SA.",
            "author": "Aaronm989",
            "id": "f9ndd3j",
            "parent_id": "t3_e5zj5k",
            "score": 3,
            "created_utc": 1575482189.0,
            "replies": []
        },
        {
            "body": "Yes. He says he won’t have sex but simply touch and kiss!? That’s a nono. Good thing that you want and hopefully do report it.\nEdit*: a word rich to touch. Cause autocorrect.",
            "author": null,
            "id": "f9mrdcj",
            "parent_id": "t3_e5zj5k",
            "score": 5,
            "created_utc": 1575468483.0,
            "replies": []
        },
        {
            "body": "That’s unfortunate if they don’t, but at least you did your part!",
            "author": "DYummyPanty",
            "id": "f9nv93i",
            "parent_id": "t3_e5zj5k",
            "score": 2,
            "created_utc": 1575491238.0,
            "replies": []
        },
        {
            "body": "Always call the police if you're asking if you should call the police",
            "author": null,
            "id": "f9ovhvs",
            "parent_id": "t3_e5zj5k",
            "score": 2,
            "created_utc": 1575514637.0,
            "replies": []
        },
        {
            "body": "Are you in Belgium/France? Then the age of consent is 15 or 16, so unless he was asking for really younger girls there's nothing much the police can do.",
            "author": null,
            "id": "f9n1qay",
            "parent_id": "t3_e5zj5k",
            "score": 2,
            "created_utc": 1575475098.0,
            "replies": []
        },
        {
            "body": "Belgium, NL, North of France, and other parts of northern Europe, etc. There have been countless networks of pedophilic rings unraveled.\n\nAt the very least, protect YOURSELF from him and whoever he's apparently trying to recruit for.\n\nBringing this guy to justice might be someone else's battle. It sounds as though a ‘sting-’ type operation might do the trick.  Police are equipped with gear, nerves, maturity, and a legal ability to arrest someone, and even make deals for one apprehended person to bring down accomplices.\n\nWhat is most important at this moment is YOU, your safety, sanity, and freedom.\n\n&#x200B;\n\nedit: a single typo corrected",
            "author": null,
            "id": "f9nm2re",
            "parent_id": "t3_e5zj5k",
            "score": 2,
            "created_utc": 1575486862.0,
            "replies": []
        },
        {
            "body": "Yes,  get him off the site and on law enforcements radar.",
            "author": "LotBuilder",
            "id": "f9nepsn",
            "parent_id": "t3_e5zj5k",
            "score": 1,
            "created_utc": 1575482993.0,
            "replies": []
        },
        {
            "body": "The police can't legally tell your parents anything. No way they can find out. Please go to The police. If this guy has been successful with this method in the past there is a chance he has been intimate with underage girls and potentially trafficked them. Go to police.",
            "author": "IDontspeakdog",
            "id": "f9ob7fy",
            "parent_id": "t3_e5zj5k",
            "score": 1,
            "created_utc": 1575500452.0,
            "replies": []
        },
        {
            "body": "´Report him to the police, who knows what else he might have done already? Or what if he finds someone who is very naive and does it?   \n\n\nDON'T MEET HIM PLEASE, and report that sicko to the authorities to help others!",
            "author": "Paradiseislandgg",
            "id": "f9qbmah",
            "parent_id": "t3_e5zj5k",
            "score": 1,
            "created_utc": 1575558464.0,
            "replies": []
        },
        {
            "body": "you are right, i called the police quickly after :)",
            "author": "sugaradriana",
            "id": "fnlbh2q",
            "parent_id": "t3_e5zj5k",
            "score": 1,
            "created_utc": 1587050581.0,
            "replies": []
        },
        {
            "body": "18 is not the minimum age in many places.",
            "author": "nerojt",
            "id": "f9ob6cb",
            "parent_id": "t3_e5zj5k",
            "score": 0,
            "created_utc": 1575500433.0,
            "replies": [
                {
                    "body": "Not the point.",
                    "author": "bsbdfw",
                    "id": "f9oe0pi",
                    "parent_id": "t1_f9ob6cb",
                    "score": 1,
                    "created_utc": 1575502321.0,
                    "replies": [
                        {
                            "body": "That's the cool thing about open forums, one may make any point they wish to make.  If something is illegal or not is certainly relevant when OP is asking if the police should be involved.  Right?  Indeed, the age of consent is 15 in France and 16 in Belgium. so there is plenty of legal room to bring someone younger than 18.  But you knew all of that before you commented, right?",
                            "author": "nerojt",
                            "id": "f9pcq7y",
                            "parent_id": "t1_f9oe0pi",
                            "score": 0,
                            "created_utc": 1575529828.0,
                            "replies": [
                                {
                                    "body": "Not the point still.",
                                    "author": "bsbdfw",
                                    "id": "f9qelxm",
                                    "parent_id": "t1_f9pcq7y",
                                    "score": 1,
                                    "created_utc": 1575559863.0,
                                    "replies": [
                                        {
                                            "body": "OP asks for legal advice, you say bringing up legality is not the point. Got it.",
                                            "author": "nerojt",
                                            "id": "f9qma2c",
                                            "parent_id": "t1_f9qelxm",
                                            "score": 0,
                                            "created_utc": 1575563502.0,
                                            "replies": [
                                                {
                                                    "body": "Yeah she asked for legal advice but did she ask what the legal age of her country is? She told us the man asked her to go high school. Didn't specify girls in her age group or 10th grade and higher.",
                                                    "author": "bsbdfw",
                                                    "id": "f9sstto",
                                                    "parent_id": "t1_f9qma2c",
                                                    "score": 0,
                                                    "created_utc": 1575599721.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I thought you did he was a POF SD. POF- plenty of fish. It’s a dating site. Also, when it comes to your safety, fuck what everyone else thinks. You do what keeps you safe and alive. It’s ultimately your decision, but you could also call a local officer and ask someone to come to you.",
            "author": "victory304",
            "id": "f9myvpj",
            "parent_id": "t3_e5zj5k",
            "score": 0,
            "created_utc": 1575473307.0,
            "replies": []
        },
        {
            "body": "Yep",
            "author": "rosescents",
            "id": "f9mqc20",
            "parent_id": "t3_e5zj5k",
            "score": 0,
            "created_utc": 1575467749.0,
            "replies": []
        },
        {
            "body": "YES.  Call the police.  Save messages.  DO NOT respond anymore.",
            "author": null,
            "id": "f9mwj2q",
            "parent_id": "t3_e5zj5k",
            "score": 0,
            "created_utc": 1575471827.0,
            "replies": []
        },
        {
            "body": "Trafficker.",
            "author": "foggymaria",
            "id": "f9osjvk",
            "parent_id": "t3_e5zj5k",
            "score": 0,
            "created_utc": 1575512364.0,
            "replies": []
        },
        {
            "body": "Traffickers don't typically find victims off of sugar dating sites",
            "author": "69goodvibes69",
            "id": "f9ocb34",
            "parent_id": "t1_f9mty6t",
            "score": -4,
            "created_utc": 1575501180.0,
            "replies": [
                {
                    "body": "they absolutely do.",
                    "author": null,
                    "id": "f9osagy",
                    "parent_id": "t1_f9ocb34",
                    "score": 9,
                    "created_utc": 1575512183.0,
                    "replies": [
                        {
                            "body": "I'm sorry, but where are you from? That's not typically how pimps/traffickers find victims \nAre you American?",
                            "author": "69goodvibes69",
                            "id": "f9ozd2q",
                            "parent_id": "t1_f9osagy",
                            "score": -3,
                            "created_utc": 1575517418.0,
                            "replies": [
                                {
                                    "body": "yes i am american.",
                                    "author": null,
                                    "id": "f9p1kzr",
                                    "parent_id": "t1_f9ozd2q",
                                    "score": 3,
                                    "created_utc": 1575519084.0,
                                    "replies": [
                                        {
                                            "body": "I can tell.",
                                            "author": "69goodvibes69",
                                            "id": "f9p1zdu",
                                            "parent_id": "t1_f9p1kzr",
                                            "score": -4,
                                            "created_utc": 1575519397.0,
                                            "replies": [
                                                {
                                                    "body": "because traffickers use sugar dating to lure victims? is that not a thing worldwide?",
                                                    "author": null,
                                                    "id": "f9p310w",
                                                    "parent_id": "t1_f9p1zdu",
                                                    "score": 3,
                                                    "created_utc": 1575520232.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Yes they do, I am European, and it happens here, in America and everywhere, just because is not the common thing for you, doesn't mean it doesn't happen a lot.",
                    "author": "Paradiseislandgg",
                    "id": "f9qbdzm",
                    "parent_id": "t1_f9ocb34",
                    "score": 1,
                    "created_utc": 1575558355.0,
                    "replies": [
                        {
                            "body": "Are you Western European? \nI'm sorry, but that's not really how traffickers/pimps usually work.. .\nIf it happens \"all the time\", can you please give me articles where it talks about how many times (percentages) pimps/traffickers use this as a technique? \nFrom op's post, this does not sound like trafficking at all",
                            "author": "69goodvibes69",
                            "id": "f9s8463",
                            "parent_id": "t1_f9qbdzm",
                            "score": 0,
                            "created_utc": 1575587404.0,
                            "replies": [
                                {
                                    "body": "are u a trafficker why r u trying to argue w people over it it happens all the time",
                                    "author": "asswaterv2",
                                    "id": "f9s8q0w",
                                    "parent_id": "t1_f9s8463",
                                    "score": 2,
                                    "created_utc": 1575587673.0,
                                    "replies": []
                                },
                                {
                                    "body": "No, I am spanish, you? why are you arguing about this? are you a pimp or a trafficker? You seem tooo keen to make us change our minds about something that is common knowledge. Please, give me an explanation of why we are wrong? it seems like you are pretty sure of how pimps trafickers work",
                                    "author": "Paradiseislandgg",
                                    "id": "f9t6xy4",
                                    "parent_id": "t1_f9s8463",
                                    "score": 0,
                                    "created_utc": 1575610861.0,
                                    "replies": [
                                        {
                                            "body": "If you are Spanish, then yes, you are Western European. How could you possibly consider Spain Eastern European??? Really, that says enough about your mental state. \nI have spoken to pimps from your country (Spain) and other Western European countries who have offered me \"jobs\", most will either offer straight away (but of course lie and say how much money you can make, you don't even need nie/immigration papers), use the \"lover boy\" technique or of course the stereotypical offering a fake job then stealing passport \nThe people I know of who are survivors of forced prostitution , none of them used a sugar dating website \nAlthough there are other dangers that can arise from sugar dating (rape, kidnapping, even murder) trafficking is not a likely one, it may happen but the situation op described does not sound like it",
                                            "author": "69goodvibes69",
                                            "id": "f9uspg0",
                                            "parent_id": "t1_f9t6xy4",
                                            "score": 1,
                                            "created_utc": 1575657013.0,
                                            "replies": [
                                                {
                                                    "body": "I misread the western european fact, but anyway, if you have to try to put me down with the \"that says a lot about your mental state\" to make your argument valid, I have literally nothing else to say to you. Whatever you want to think, I don't care anymore.",
                                                    "author": "Paradiseislandgg",
                                                    "id": "f9ut4xr",
                                                    "parent_id": "t1_f9uspg0",
                                                    "score": 2,
                                                    "created_utc": 1575657236.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Or worse, human trafficker. \n\n&#x200B;\n\n\\*Not that there is some scale of people that prey on the young but ...",
            "author": "sortasapien",
            "id": "f9nijhe",
            "parent_id": "t1_f9mqah4",
            "score": 51,
            "created_utc": 1575485132.0,
            "replies": [
                {
                    "body": "Happy Cake Day",
                    "author": "perryplats",
                    "id": "f9nl7q6",
                    "parent_id": "t1_f9nijhe",
                    "score": 7,
                    "created_utc": 1575486449.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "thats what i was thinking, i really needed the money so i was about to go meet him but my body was like NO so i think i really dodged a bullet here",
            "author": "sugaradriana",
            "id": "f9ms4sm",
            "parent_id": "t1_f9mrkmn",
            "score": 30,
            "created_utc": 1575469003.0,
            "replies": [
                {
                    "body": "It sounds like you did. Your instincts kicked in and self preservation took over, which I am glad for. I’m glad you’re okay and hold on to ANY PHYSICAL PROOF that you have so you can show the cops or whoever. Make copies, take screenshots, and put/save them in multiple places. Email... separate thumb drive, google drive, whatever. Just MULTIPLE PLACES. I’m so glad you questioned what was happening and that you’re okay. I’ve been in almost an identical situation, I just wasn’t asked to bring a younger friend. But the more I said no, the more the money went up. I immediately ejected myself from the situation, blocked him and reported him. Which brings me to my next question. Have you reported him to POF, and do you have any pictures that you can show to the police because people like this usually have more than one “name” or alias.",
                    "author": "victory304",
                    "id": "f9msvrw",
                    "parent_id": "t1_f9ms4sm",
                    "score": 15,
                    "created_utc": 1575469512.0,
                    "replies": [
                        {
                            "body": "i actually have a pic of him and his “name” i know the place where he lives and i know some info but its possible that its all fake, whats is also super weird is he kept sending me pictures of enveloppes with crazy amounts of cash in. (that can be legal money right?) \nanyway i just checked our convo and saw he deleted everything luckily i made a screen video of our whole convo. everything is kind of sinking in atm i need to be way more careful  with who i trust and meet. im still trying to figure out if i should go to the police because i have a feeling they wont take me serious and that they will look at me like this dirty whore. because the place where i live is really conservative. but its the right thing to do and i think i will go anyway. and btw im sorry but for what stands POF?",
                            "author": "sugaradriana",
                            "id": "f9muce8",
                            "parent_id": "t1_f9msvrw",
                            "score": 21,
                            "created_utc": 1575470463.0,
                            "replies": [
                                {
                                    "body": "It's a learning experience.  Generally, if it sounds too good to be true (crazy money for a platonic m&g), it probably is.  And of course always meet in public, etc.  Having a friend or at least someone who knows where you are and can call the cops if you don't report in is a good idea, too.\n\nGlad you're safe.",
                                    "author": null,
                                    "id": "f9o8bq3",
                                    "parent_id": "t1_f9muce8",
                                    "score": 5,
                                    "created_utc": 1575498620.0,
                                    "replies": []
                                },
                                {
                                    "body": "Reach out to an organization in your country that combats sex trafficking or protects women or children - they may give you very helpful advice and may go with you to the police so you don’t have to do it alone.",
                                    "author": null,
                                    "id": "f9p1cyt",
                                    "parent_id": "t1_f9muce8",
                                    "score": 1,
                                    "created_utc": 1575518913.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Kinda what I was thinking when first reading this. Creepy, yes. Illegal, highly doubtful.",
            "author": "mraspencer",
            "id": "f9mwzdn",
            "parent_id": "t1_f9mv5g0",
            "score": 11,
            "created_utc": 1575472111.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "f9n8cdt",
                    "parent_id": "t1_f9mwzdn",
                    "score": 15,
                    "created_utc": 1575479179.0,
                    "replies": [
                        {
                            "body": "Well that will make things a tad trickier.",
                            "author": "mraspencer",
                            "id": "f9n8uky",
                            "parent_id": "t1_f9n8cdt",
                            "score": -1,
                            "created_utc": 1575479490.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "im going first thing tomorrow but im afraid that they wont take it seriously",
            "author": "sugaradriana",
            "id": "f9nv0qt",
            "parent_id": "t1_f9nn6r1",
            "score": 5,
            "created_utc": 1575491128.0,
            "replies": []
        },
        {
            "body": "Not the point.",
            "author": "bsbdfw",
            "id": "f9oe0pi",
            "parent_id": "t1_f9ob6cb",
            "score": 1,
            "created_utc": 1575502321.0,
            "replies": [
                {
                    "body": "That's the cool thing about open forums, one may make any point they wish to make.  If something is illegal or not is certainly relevant when OP is asking if the police should be involved.  Right?  Indeed, the age of consent is 15 in France and 16 in Belgium. so there is plenty of legal room to bring someone younger than 18.  But you knew all of that before you commented, right?",
                    "author": "nerojt",
                    "id": "f9pcq7y",
                    "parent_id": "t1_f9oe0pi",
                    "score": 0,
                    "created_utc": 1575529828.0,
                    "replies": [
                        {
                            "body": "Not the point still.",
                            "author": "bsbdfw",
                            "id": "f9qelxm",
                            "parent_id": "t1_f9pcq7y",
                            "score": 1,
                            "created_utc": 1575559863.0,
                            "replies": [
                                {
                                    "body": "OP asks for legal advice, you say bringing up legality is not the point. Got it.",
                                    "author": "nerojt",
                                    "id": "f9qma2c",
                                    "parent_id": "t1_f9qelxm",
                                    "score": 0,
                                    "created_utc": 1575563502.0,
                                    "replies": [
                                        {
                                            "body": "Yeah she asked for legal advice but did she ask what the legal age of her country is? She told us the man asked her to go high school. Didn't specify girls in her age group or 10th grade and higher.",
                                            "author": "bsbdfw",
                                            "id": "f9sstto",
                                            "parent_id": "t1_f9qma2c",
                                            "score": 0,
                                            "created_utc": 1575599721.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "they absolutely do.",
            "author": null,
            "id": "f9osagy",
            "parent_id": "t1_f9ocb34",
            "score": 9,
            "created_utc": 1575512183.0,
            "replies": [
                {
                    "body": "I'm sorry, but where are you from? That's not typically how pimps/traffickers find victims \nAre you American?",
                    "author": "69goodvibes69",
                    "id": "f9ozd2q",
                    "parent_id": "t1_f9osagy",
                    "score": -3,
                    "created_utc": 1575517418.0,
                    "replies": [
                        {
                            "body": "yes i am american.",
                            "author": null,
                            "id": "f9p1kzr",
                            "parent_id": "t1_f9ozd2q",
                            "score": 3,
                            "created_utc": 1575519084.0,
                            "replies": [
                                {
                                    "body": "I can tell.",
                                    "author": "69goodvibes69",
                                    "id": "f9p1zdu",
                                    "parent_id": "t1_f9p1kzr",
                                    "score": -4,
                                    "created_utc": 1575519397.0,
                                    "replies": [
                                        {
                                            "body": "because traffickers use sugar dating to lure victims? is that not a thing worldwide?",
                                            "author": null,
                                            "id": "f9p310w",
                                            "parent_id": "t1_f9p1zdu",
                                            "score": 3,
                                            "created_utc": 1575520232.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Yes they do, I am European, and it happens here, in America and everywhere, just because is not the common thing for you, doesn't mean it doesn't happen a lot.",
            "author": "Paradiseislandgg",
            "id": "f9qbdzm",
            "parent_id": "t1_f9ocb34",
            "score": 1,
            "created_utc": 1575558355.0,
            "replies": [
                {
                    "body": "Are you Western European? \nI'm sorry, but that's not really how traffickers/pimps usually work.. .\nIf it happens \"all the time\", can you please give me articles where it talks about how many times (percentages) pimps/traffickers use this as a technique? \nFrom op's post, this does not sound like trafficking at all",
                    "author": "69goodvibes69",
                    "id": "f9s8463",
                    "parent_id": "t1_f9qbdzm",
                    "score": 0,
                    "created_utc": 1575587404.0,
                    "replies": [
                        {
                            "body": "are u a trafficker why r u trying to argue w people over it it happens all the time",
                            "author": "asswaterv2",
                            "id": "f9s8q0w",
                            "parent_id": "t1_f9s8463",
                            "score": 2,
                            "created_utc": 1575587673.0,
                            "replies": []
                        },
                        {
                            "body": "No, I am spanish, you? why are you arguing about this? are you a pimp or a trafficker? You seem tooo keen to make us change our minds about something that is common knowledge. Please, give me an explanation of why we are wrong? it seems like you are pretty sure of how pimps trafickers work",
                            "author": "Paradiseislandgg",
                            "id": "f9t6xy4",
                            "parent_id": "t1_f9s8463",
                            "score": 0,
                            "created_utc": 1575610861.0,
                            "replies": [
                                {
                                    "body": "If you are Spanish, then yes, you are Western European. How could you possibly consider Spain Eastern European??? Really, that says enough about your mental state. \nI have spoken to pimps from your country (Spain) and other Western European countries who have offered me \"jobs\", most will either offer straight away (but of course lie and say how much money you can make, you don't even need nie/immigration papers), use the \"lover boy\" technique or of course the stereotypical offering a fake job then stealing passport \nThe people I know of who are survivors of forced prostitution , none of them used a sugar dating website \nAlthough there are other dangers that can arise from sugar dating (rape, kidnapping, even murder) trafficking is not a likely one, it may happen but the situation op described does not sound like it",
                                    "author": "69goodvibes69",
                                    "id": "f9uspg0",
                                    "parent_id": "t1_f9t6xy4",
                                    "score": 1,
                                    "created_utc": 1575657013.0,
                                    "replies": [
                                        {
                                            "body": "I misread the western european fact, but anyway, if you have to try to put me down with the \"that says a lot about your mental state\" to make your argument valid, I have literally nothing else to say to you. Whatever you want to think, I don't care anymore.",
                                            "author": "Paradiseislandgg",
                                            "id": "f9ut4xr",
                                            "parent_id": "t1_f9uspg0",
                                            "score": 2,
                                            "created_utc": 1575657236.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Happy Cake Day",
            "author": "perryplats",
            "id": "f9nl7q6",
            "parent_id": "t1_f9nijhe",
            "score": 7,
            "created_utc": 1575486449.0,
            "replies": []
        },
        {
            "body": "It sounds like you did. Your instincts kicked in and self preservation took over, which I am glad for. I’m glad you’re okay and hold on to ANY PHYSICAL PROOF that you have so you can show the cops or whoever. Make copies, take screenshots, and put/save them in multiple places. Email... separate thumb drive, google drive, whatever. Just MULTIPLE PLACES. I’m so glad you questioned what was happening and that you’re okay. I’ve been in almost an identical situation, I just wasn’t asked to bring a younger friend. But the more I said no, the more the money went up. I immediately ejected myself from the situation, blocked him and reported him. Which brings me to my next question. Have you reported him to POF, and do you have any pictures that you can show to the police because people like this usually have more than one “name” or alias.",
            "author": "victory304",
            "id": "f9msvrw",
            "parent_id": "t1_f9ms4sm",
            "score": 15,
            "created_utc": 1575469512.0,
            "replies": [
                {
                    "body": "i actually have a pic of him and his “name” i know the place where he lives and i know some info but its possible that its all fake, whats is also super weird is he kept sending me pictures of enveloppes with crazy amounts of cash in. (that can be legal money right?) \nanyway i just checked our convo and saw he deleted everything luckily i made a screen video of our whole convo. everything is kind of sinking in atm i need to be way more careful  with who i trust and meet. im still trying to figure out if i should go to the police because i have a feeling they wont take me serious and that they will look at me like this dirty whore. because the place where i live is really conservative. but its the right thing to do and i think i will go anyway. and btw im sorry but for what stands POF?",
                    "author": "sugaradriana",
                    "id": "f9muce8",
                    "parent_id": "t1_f9msvrw",
                    "score": 21,
                    "created_utc": 1575470463.0,
                    "replies": [
                        {
                            "body": "It's a learning experience.  Generally, if it sounds too good to be true (crazy money for a platonic m&g), it probably is.  And of course always meet in public, etc.  Having a friend or at least someone who knows where you are and can call the cops if you don't report in is a good idea, too.\n\nGlad you're safe.",
                            "author": null,
                            "id": "f9o8bq3",
                            "parent_id": "t1_f9muce8",
                            "score": 5,
                            "created_utc": 1575498620.0,
                            "replies": []
                        },
                        {
                            "body": "Reach out to an organization in your country that combats sex trafficking or protects women or children - they may give you very helpful advice and may go with you to the police so you don’t have to do it alone.",
                            "author": null,
                            "id": "f9p1cyt",
                            "parent_id": "t1_f9muce8",
                            "score": 1,
                            "created_utc": 1575518913.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "f9n8cdt",
            "parent_id": "t1_f9mwzdn",
            "score": 15,
            "created_utc": 1575479179.0,
            "replies": [
                {
                    "body": "Well that will make things a tad trickier.",
                    "author": "mraspencer",
                    "id": "f9n8uky",
                    "parent_id": "t1_f9n8cdt",
                    "score": -1,
                    "created_utc": 1575479490.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "That's the cool thing about open forums, one may make any point they wish to make.  If something is illegal or not is certainly relevant when OP is asking if the police should be involved.  Right?  Indeed, the age of consent is 15 in France and 16 in Belgium. so there is plenty of legal room to bring someone younger than 18.  But you knew all of that before you commented, right?",
            "author": "nerojt",
            "id": "f9pcq7y",
            "parent_id": "t1_f9oe0pi",
            "score": 0,
            "created_utc": 1575529828.0,
            "replies": [
                {
                    "body": "Not the point still.",
                    "author": "bsbdfw",
                    "id": "f9qelxm",
                    "parent_id": "t1_f9pcq7y",
                    "score": 1,
                    "created_utc": 1575559863.0,
                    "replies": [
                        {
                            "body": "OP asks for legal advice, you say bringing up legality is not the point. Got it.",
                            "author": "nerojt",
                            "id": "f9qma2c",
                            "parent_id": "t1_f9qelxm",
                            "score": 0,
                            "created_utc": 1575563502.0,
                            "replies": [
                                {
                                    "body": "Yeah she asked for legal advice but did she ask what the legal age of her country is? She told us the man asked her to go high school. Didn't specify girls in her age group or 10th grade and higher.",
                                    "author": "bsbdfw",
                                    "id": "f9sstto",
                                    "parent_id": "t1_f9qma2c",
                                    "score": 0,
                                    "created_utc": 1575599721.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I'm sorry, but where are you from? That's not typically how pimps/traffickers find victims \nAre you American?",
            "author": "69goodvibes69",
            "id": "f9ozd2q",
            "parent_id": "t1_f9osagy",
            "score": -3,
            "created_utc": 1575517418.0,
            "replies": [
                {
                    "body": "yes i am american.",
                    "author": null,
                    "id": "f9p1kzr",
                    "parent_id": "t1_f9ozd2q",
                    "score": 3,
                    "created_utc": 1575519084.0,
                    "replies": [
                        {
                            "body": "I can tell.",
                            "author": "69goodvibes69",
                            "id": "f9p1zdu",
                            "parent_id": "t1_f9p1kzr",
                            "score": -4,
                            "created_utc": 1575519397.0,
                            "replies": [
                                {
                                    "body": "because traffickers use sugar dating to lure victims? is that not a thing worldwide?",
                                    "author": null,
                                    "id": "f9p310w",
                                    "parent_id": "t1_f9p1zdu",
                                    "score": 3,
                                    "created_utc": 1575520232.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Are you Western European? \nI'm sorry, but that's not really how traffickers/pimps usually work.. .\nIf it happens \"all the time\", can you please give me articles where it talks about how many times (percentages) pimps/traffickers use this as a technique? \nFrom op's post, this does not sound like trafficking at all",
            "author": "69goodvibes69",
            "id": "f9s8463",
            "parent_id": "t1_f9qbdzm",
            "score": 0,
            "created_utc": 1575587404.0,
            "replies": [
                {
                    "body": "are u a trafficker why r u trying to argue w people over it it happens all the time",
                    "author": "asswaterv2",
                    "id": "f9s8q0w",
                    "parent_id": "t1_f9s8463",
                    "score": 2,
                    "created_utc": 1575587673.0,
                    "replies": []
                },
                {
                    "body": "No, I am spanish, you? why are you arguing about this? are you a pimp or a trafficker? You seem tooo keen to make us change our minds about something that is common knowledge. Please, give me an explanation of why we are wrong? it seems like you are pretty sure of how pimps trafickers work",
                    "author": "Paradiseislandgg",
                    "id": "f9t6xy4",
                    "parent_id": "t1_f9s8463",
                    "score": 0,
                    "created_utc": 1575610861.0,
                    "replies": [
                        {
                            "body": "If you are Spanish, then yes, you are Western European. How could you possibly consider Spain Eastern European??? Really, that says enough about your mental state. \nI have spoken to pimps from your country (Spain) and other Western European countries who have offered me \"jobs\", most will either offer straight away (but of course lie and say how much money you can make, you don't even need nie/immigration papers), use the \"lover boy\" technique or of course the stereotypical offering a fake job then stealing passport \nThe people I know of who are survivors of forced prostitution , none of them used a sugar dating website \nAlthough there are other dangers that can arise from sugar dating (rape, kidnapping, even murder) trafficking is not a likely one, it may happen but the situation op described does not sound like it",
                            "author": "69goodvibes69",
                            "id": "f9uspg0",
                            "parent_id": "t1_f9t6xy4",
                            "score": 1,
                            "created_utc": 1575657013.0,
                            "replies": [
                                {
                                    "body": "I misread the western european fact, but anyway, if you have to try to put me down with the \"that says a lot about your mental state\" to make your argument valid, I have literally nothing else to say to you. Whatever you want to think, I don't care anymore.",
                                    "author": "Paradiseislandgg",
                                    "id": "f9ut4xr",
                                    "parent_id": "t1_f9uspg0",
                                    "score": 2,
                                    "created_utc": 1575657236.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "i actually have a pic of him and his “name” i know the place where he lives and i know some info but its possible that its all fake, whats is also super weird is he kept sending me pictures of enveloppes with crazy amounts of cash in. (that can be legal money right?) \nanyway i just checked our convo and saw he deleted everything luckily i made a screen video of our whole convo. everything is kind of sinking in atm i need to be way more careful  with who i trust and meet. im still trying to figure out if i should go to the police because i have a feeling they wont take me serious and that they will look at me like this dirty whore. because the place where i live is really conservative. but its the right thing to do and i think i will go anyway. and btw im sorry but for what stands POF?",
            "author": "sugaradriana",
            "id": "f9muce8",
            "parent_id": "t1_f9msvrw",
            "score": 21,
            "created_utc": 1575470463.0,
            "replies": [
                {
                    "body": "It's a learning experience.  Generally, if it sounds too good to be true (crazy money for a platonic m&g), it probably is.  And of course always meet in public, etc.  Having a friend or at least someone who knows where you are and can call the cops if you don't report in is a good idea, too.\n\nGlad you're safe.",
                    "author": null,
                    "id": "f9o8bq3",
                    "parent_id": "t1_f9muce8",
                    "score": 5,
                    "created_utc": 1575498620.0,
                    "replies": []
                },
                {
                    "body": "Reach out to an organization in your country that combats sex trafficking or protects women or children - they may give you very helpful advice and may go with you to the police so you don’t have to do it alone.",
                    "author": null,
                    "id": "f9p1cyt",
                    "parent_id": "t1_f9muce8",
                    "score": 1,
                    "created_utc": 1575518913.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Well that will make things a tad trickier.",
            "author": "mraspencer",
            "id": "f9n8uky",
            "parent_id": "t1_f9n8cdt",
            "score": -1,
            "created_utc": 1575479490.0,
            "replies": []
        },
        {
            "body": "Not the point still.",
            "author": "bsbdfw",
            "id": "f9qelxm",
            "parent_id": "t1_f9pcq7y",
            "score": 1,
            "created_utc": 1575559863.0,
            "replies": [
                {
                    "body": "OP asks for legal advice, you say bringing up legality is not the point. Got it.",
                    "author": "nerojt",
                    "id": "f9qma2c",
                    "parent_id": "t1_f9qelxm",
                    "score": 0,
                    "created_utc": 1575563502.0,
                    "replies": [
                        {
                            "body": "Yeah she asked for legal advice but did she ask what the legal age of her country is? She told us the man asked her to go high school. Didn't specify girls in her age group or 10th grade and higher.",
                            "author": "bsbdfw",
                            "id": "f9sstto",
                            "parent_id": "t1_f9qma2c",
                            "score": 0,
                            "created_utc": 1575599721.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "yes i am american.",
            "author": null,
            "id": "f9p1kzr",
            "parent_id": "t1_f9ozd2q",
            "score": 3,
            "created_utc": 1575519084.0,
            "replies": [
                {
                    "body": "I can tell.",
                    "author": "69goodvibes69",
                    "id": "f9p1zdu",
                    "parent_id": "t1_f9p1kzr",
                    "score": -4,
                    "created_utc": 1575519397.0,
                    "replies": [
                        {
                            "body": "because traffickers use sugar dating to lure victims? is that not a thing worldwide?",
                            "author": null,
                            "id": "f9p310w",
                            "parent_id": "t1_f9p1zdu",
                            "score": 3,
                            "created_utc": 1575520232.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "are u a trafficker why r u trying to argue w people over it it happens all the time",
            "author": "asswaterv2",
            "id": "f9s8q0w",
            "parent_id": "t1_f9s8463",
            "score": 2,
            "created_utc": 1575587673.0,
            "replies": []
        },
        {
            "body": "No, I am spanish, you? why are you arguing about this? are you a pimp or a trafficker? You seem tooo keen to make us change our minds about something that is common knowledge. Please, give me an explanation of why we are wrong? it seems like you are pretty sure of how pimps trafickers work",
            "author": "Paradiseislandgg",
            "id": "f9t6xy4",
            "parent_id": "t1_f9s8463",
            "score": 0,
            "created_utc": 1575610861.0,
            "replies": [
                {
                    "body": "If you are Spanish, then yes, you are Western European. How could you possibly consider Spain Eastern European??? Really, that says enough about your mental state. \nI have spoken to pimps from your country (Spain) and other Western European countries who have offered me \"jobs\", most will either offer straight away (but of course lie and say how much money you can make, you don't even need nie/immigration papers), use the \"lover boy\" technique or of course the stereotypical offering a fake job then stealing passport \nThe people I know of who are survivors of forced prostitution , none of them used a sugar dating website \nAlthough there are other dangers that can arise from sugar dating (rape, kidnapping, even murder) trafficking is not a likely one, it may happen but the situation op described does not sound like it",
                    "author": "69goodvibes69",
                    "id": "f9uspg0",
                    "parent_id": "t1_f9t6xy4",
                    "score": 1,
                    "created_utc": 1575657013.0,
                    "replies": [
                        {
                            "body": "I misread the western european fact, but anyway, if you have to try to put me down with the \"that says a lot about your mental state\" to make your argument valid, I have literally nothing else to say to you. Whatever you want to think, I don't care anymore.",
                            "author": "Paradiseislandgg",
                            "id": "f9ut4xr",
                            "parent_id": "t1_f9uspg0",
                            "score": 2,
                            "created_utc": 1575657236.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "It's a learning experience.  Generally, if it sounds too good to be true (crazy money for a platonic m&g), it probably is.  And of course always meet in public, etc.  Having a friend or at least someone who knows where you are and can call the cops if you don't report in is a good idea, too.\n\nGlad you're safe.",
            "author": null,
            "id": "f9o8bq3",
            "parent_id": "t1_f9muce8",
            "score": 5,
            "created_utc": 1575498620.0,
            "replies": []
        },
        {
            "body": "Reach out to an organization in your country that combats sex trafficking or protects women or children - they may give you very helpful advice and may go with you to the police so you don’t have to do it alone.",
            "author": null,
            "id": "f9p1cyt",
            "parent_id": "t1_f9muce8",
            "score": 1,
            "created_utc": 1575518913.0,
            "replies": []
        },
        {
            "body": "OP asks for legal advice, you say bringing up legality is not the point. Got it.",
            "author": "nerojt",
            "id": "f9qma2c",
            "parent_id": "t1_f9qelxm",
            "score": 0,
            "created_utc": 1575563502.0,
            "replies": [
                {
                    "body": "Yeah she asked for legal advice but did she ask what the legal age of her country is? She told us the man asked her to go high school. Didn't specify girls in her age group or 10th grade and higher.",
                    "author": "bsbdfw",
                    "id": "f9sstto",
                    "parent_id": "t1_f9qma2c",
                    "score": 0,
                    "created_utc": 1575599721.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I can tell.",
            "author": "69goodvibes69",
            "id": "f9p1zdu",
            "parent_id": "t1_f9p1kzr",
            "score": -4,
            "created_utc": 1575519397.0,
            "replies": [
                {
                    "body": "because traffickers use sugar dating to lure victims? is that not a thing worldwide?",
                    "author": null,
                    "id": "f9p310w",
                    "parent_id": "t1_f9p1zdu",
                    "score": 3,
                    "created_utc": 1575520232.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "If you are Spanish, then yes, you are Western European. How could you possibly consider Spain Eastern European??? Really, that says enough about your mental state. \nI have spoken to pimps from your country (Spain) and other Western European countries who have offered me \"jobs\", most will either offer straight away (but of course lie and say how much money you can make, you don't even need nie/immigration papers), use the \"lover boy\" technique or of course the stereotypical offering a fake job then stealing passport \nThe people I know of who are survivors of forced prostitution , none of them used a sugar dating website \nAlthough there are other dangers that can arise from sugar dating (rape, kidnapping, even murder) trafficking is not a likely one, it may happen but the situation op described does not sound like it",
            "author": "69goodvibes69",
            "id": "f9uspg0",
            "parent_id": "t1_f9t6xy4",
            "score": 1,
            "created_utc": 1575657013.0,
            "replies": [
                {
                    "body": "I misread the western european fact, but anyway, if you have to try to put me down with the \"that says a lot about your mental state\" to make your argument valid, I have literally nothing else to say to you. Whatever you want to think, I don't care anymore.",
                    "author": "Paradiseislandgg",
                    "id": "f9ut4xr",
                    "parent_id": "t1_f9uspg0",
                    "score": 2,
                    "created_utc": 1575657236.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Yeah she asked for legal advice but did she ask what the legal age of her country is? She told us the man asked her to go high school. Didn't specify girls in her age group or 10th grade and higher.",
            "author": "bsbdfw",
            "id": "f9sstto",
            "parent_id": "t1_f9qma2c",
            "score": 0,
            "created_utc": 1575599721.0,
            "replies": []
        },
        {
            "body": "because traffickers use sugar dating to lure victims? is that not a thing worldwide?",
            "author": null,
            "id": "f9p310w",
            "parent_id": "t1_f9p1zdu",
            "score": 3,
            "created_utc": 1575520232.0,
            "replies": []
        },
        {
            "body": "I misread the western european fact, but anyway, if you have to try to put me down with the \"that says a lot about your mental state\" to make your argument valid, I have literally nothing else to say to you. Whatever you want to think, I don't care anymore.",
            "author": "Paradiseislandgg",
            "id": "f9ut4xr",
            "parent_id": "t1_f9uspg0",
            "score": 2,
            "created_utc": 1575657236.0,
            "replies": []
        }
    ]
}