{
    "title": "I hit the jackpot",
    "post_id": "j1vomg",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/j1vomg/i_hit_the_jackpot/",
    "author": "Sugarclueless",
    "body": "I just wanted to take a moment to gush over my current SR. \n\nAfter an entire summer of searching, I finally found the perfect SD. He is exactly what I had been looking for and he came at a time when I almost lost all hope. I thought what I was looking for was unrealistic. \n\nHe is the perfect gentleman. He pulls my chair out before I sit down, he makes me coffee in the morning and pays attention to exactly what I like. We talk everyday. When we are together, it feels so natural. Our chemistry is on point. He makes me feel like the most precious thing in the world. \n\nWe have spent two weekends together and now we have plans for a week long vacation. I am in heaven. \n\nI just wanted to thank everyone here because after I found this sub (this is a throwaway account) I learned so much on what I can expect and the do’s and the dont’s of sugar dating. \n\nThank you all again for being so wise and sharing your stories! It really has helped me find exactly what I was looking for!! 💕💕✨✨",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/j1vomg/i_hit_the_jackpot/",
    "score": 186,
    "upvote_ratio": 0.98,
    "created_utc": 1601370065.0,
    "num_comments": 49,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "[deleted]",
            "author": null,
            "id": "g71rok7",
            "parent_id": "t3_j1vomg",
            "score": 39,
            "created_utc": 1601378563.0,
            "replies": [
                {
                    "body": "Thank you for your thoughtful reply. You are absolutely right, I have met others who might have spent more on me, but who I didn’t have the same connection with. To me, it’s about so much more than the financial support. At this point, that is an added bonus. I really do care about him and I know he does for me as well. \n\nHere’s to hoping you find someone who appreciates you just as much!",
                    "author": "Sugarclueless",
                    "id": "g71s9px",
                    "parent_id": "t1_g71rok7",
                    "score": 25,
                    "created_utc": 1601379115.0,
                    "replies": [
                        {
                            "body": "Thanks for my first ever award!!",
                            "author": "Sugarclueless",
                            "id": "g7202oi",
                            "parent_id": "t1_g71s9px",
                            "score": 6,
                            "created_utc": 1601384927.0,
                            "replies": [
                                {
                                    "body": "P.S.  I am happy that you found an arrangement that holds a lot of promise for you!  CHEERS!",
                                    "author": "Ok-Gur-1159",
                                    "id": "g7536g9",
                                    "parent_id": "t1_g7202oi",
                                    "score": 1,
                                    "created_utc": 1601438675.0,
                                    "replies": []
                                },
                                {
                                    "body": "I have had this strange run lately, all the SB's I've met or chatted with have focused on monetary negotiations first, without even considering if a connection would work out if the distance is reasonable if there's a mutual attraction, or even if our chemistry would be any good.  \nRight away they want to negotiate and they start off very high paying attention to where you will take it or how low you might go.  \nIMO, I'm staying on the sidelines through this.    \nI've been told how they have found \"terrific\" and \"generous\" men who will provide the financial support they seek . . . only to tell me later how they turned out to be creeps, or how they wanted to have sex with them while talking to their wife on the phone at the same time.  GEEZ!  \nAlright then . . . good luck trophy girl!",
                                    "author": "Ok-Gur-1159",
                                    "id": "g753488",
                                    "parent_id": "t1_g7202oi",
                                    "score": 1,
                                    "created_utc": 1601438634.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "This is so encouraging to hear! All the well wishes to you!",
            "author": "cherrysplits",
            "id": "g72wc12",
            "parent_id": "t3_j1vomg",
            "score": 4,
            "created_utc": 1601398664.0,
            "replies": []
        },
        {
            "body": "Congratulations! Feels so good right?? Enjoy💓",
            "author": "sucregalore",
            "id": "g71m824",
            "parent_id": "t3_j1vomg",
            "score": 7,
            "created_utc": 1601372563.0,
            "replies": [
                {
                    "body": "It really does. Indescribable.",
                    "author": "Sugarclueless",
                    "id": "g71t2l0",
                    "parent_id": "t1_g71m824",
                    "score": 2,
                    "created_utc": 1601379830.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "When I saw the title of this post, I thought it would be a post about hooking a whale.\n\nIt's refreshing to see that there was no mention of material needs. Glad you were able to use this sub to get the information you needed to find an arrangement you wanted. Any SD would be lucky to find a woman like you.",
            "author": "BishopSD",
            "id": "g7200zz",
            "parent_id": "t3_j1vomg",
            "score": 10,
            "created_utc": 1601384902.0,
            "replies": [
                {
                    "body": "Aw thank you so much! I realized later that the title makes it sound like that. But really to me, hitting the jackpot in life isn’t about anything money can buy.",
                    "author": "Sugarclueless",
                    "id": "g720cn2",
                    "parent_id": "t1_g7200zz",
                    "score": 5,
                    "created_utc": 1601385075.0,
                    "replies": []
                },
                {
                    "body": ">When I saw the title of this post, I thought it would be a post about hooking a whale\n\nMaybe, she did find a whale but chose not to post about. Interesting you felt the need to passively aggressively bring up money and material items, which am sure are part of their arrangement. \n\nFor me, it would be refreshing to see guys post about how happy they are to spoil their girl rotten and not lecture and encourage men to refuse giving gifts or money on “platonic” dates or before sex. I read about emotional connection a lot from guys online here, and agree that is important, but rarely read about men who enjoy spoiling financially and find pleasure in setting up their lady friend for a secure financial future. The one-sided benefit seems to focus on men’s needs only....Imagine that...men being selfish. 😉",
                    "author": "sugarbooger1988",
                    "id": "g72uqwi",
                    "parent_id": "t1_g7200zz",
                    "score": 2,
                    "created_utc": 1601398031.0,
                    "replies": [
                        {
                            "body": "I wasn't being passive aggressive in any way. The content of this post genuinely caught me by surprise.  I also read her comment about turning down a higher offer for something she had a better connection with.\n\nIf you want to hear a little story about spoiling, here you go.\n\nI have a new SB I'm seeing and we're still on PPM. We're only a couple weeks into the arrangement and I'm sure many SDs on here will question if I'm not being cautious enough but she's been very affectionate and attentive and I get no inkling of her wanting to be spoiled. She does little unprompted thoughtful things here and there for me as well. She's been stressed about a couple exams this week and was trying to fit me into her schedule by rearranging some things on her end. I told her to focus on her exams and that it's no big deal if we can't meet this week. I also sent over our regular PPM. Additionally, she did a little shopping with the first PPM and I covered the cost for that as well.",
                            "author": "BishopSD",
                            "id": "g730hcd",
                            "parent_id": "t1_g72uqwi",
                            "score": 2,
                            "created_utc": 1601400506.0,
                            "replies": [
                                {
                                    "body": "Ok well that is positive. I’m glad to hear to take care of her even when you don’t see her. I’ve read quite a lot of stories of guys who don’t on here so sorry if I assumed.\n\nI think, it’s also very natural to turn down a higher offer if the attraction is there. I would, too. Well, I would depending on the difference! 😉",
                                    "author": "sugarbooger1988",
                                    "id": "g731r0h",
                                    "parent_id": "t1_g730hcd",
                                    "score": 3,
                                    "created_utc": 1601401123.0,
                                    "replies": [
                                        {
                                            "body": "oh, don't get me wrong. If this was a different SB that did the bare minimum, I probably wouldn't do any of this. It's a two way street.",
                                            "author": "BishopSD",
                                            "id": "g733pj0",
                                            "parent_id": "t1_g731r0h",
                                            "score": 1,
                                            "created_utc": 1601402016.0,
                                            "replies": [
                                                {
                                                    "body": "Oh, don’t worry 😉 \n\nSee, if a man is good to you and spoils nicely, then the girl is generally not going to do the bare minimum. \n\nThat works for any relationship. I let the man take the lead and if he does not display he is very interested, and treat me exceptionally well, then will leave the situation.",
                                                    "author": "sugarbooger1988",
                                                    "id": "g735kg8",
                                                    "parent_id": "t1_g733pj0",
                                                    "score": 3,
                                                    "created_utc": 1601402776.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "g732y4i",
            "parent_id": "t3_j1vomg",
            "score": 3,
            "created_utc": 1601401696.0,
            "replies": [
                {
                    "body": "So Yes, and I’d add that effort, compromise, communication — all the things required for a lasting vanilla relationship — need to be there too if the sugar is to last as well. Gets all the merrier if a substantial age gap 😉",
                    "author": "jacknjilled",
                    "id": "g73zmc9",
                    "parent_id": "t1_g732y4i",
                    "score": 6,
                    "created_utc": 1601416479.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Congrats, I'm jelly, lol.",
            "author": "The_Serra_Angel",
            "id": "g73xrrd",
            "parent_id": "t3_j1vomg",
            "score": 3,
            "created_utc": 1601415521.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "g71kxos",
            "parent_id": "t3_j1vomg",
            "score": 7,
            "created_utc": 1601370996.0,
            "replies": [
                {
                    "body": "Thank you so much! I hope so too 💖",
                    "author": "Sugarclueless",
                    "id": "g71l5wf",
                    "parent_id": "t1_g71kxos",
                    "score": 2,
                    "created_utc": 1601371278.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Wow congratulations you deserve it. It's fantastic when you can find the right SD at last. I've only ever had 2 SR. The first was more meaningful and longterm and just like you I did hit the jackpot just when I was going to remove my online profile. Enjoy Enjoy Enjoy 🇬🇧",
            "author": "Starflower8888",
            "id": "g73a4rv",
            "parent_id": "t3_j1vomg",
            "score": 2,
            "created_utc": 1601404829.0,
            "replies": []
        },
        {
            "body": "Yay!! Love to read stories like this!!! Im happy for both of you and best wishes!!!",
            "author": "moneyanddogs",
            "id": "g73f5zf",
            "parent_id": "t3_j1vomg",
            "score": 2,
            "created_utc": 1601407137.0,
            "replies": []
        },
        {
            "body": "So happy for you girl, it’s really rare hitting the jackpot on a SD where the connection and chemistry is as you have described with yours. You go girl 😊",
            "author": "Admirable_Ad6228",
            "id": "g73hx3m",
            "parent_id": "t3_j1vomg",
            "score": 2,
            "created_utc": 1601408368.0,
            "replies": []
        },
        {
            "body": "I'm so happy for you!! This is super encouraging and inspiring. I'm glad there's still hope!",
            "author": "SolitarySeas",
            "id": "g73vleg",
            "parent_id": "t3_j1vomg",
            "score": 2,
            "created_utc": 1601414406.0,
            "replies": []
        },
        {
            "body": "Girl you are blessed! It’s tough out there! Being appreciated is much wanted and needed in the bowl! I hope I can be as lucky as you!",
            "author": "Malibusugar210",
            "id": "g73zvlw",
            "parent_id": "t3_j1vomg",
            "score": 2,
            "created_utc": 1601416614.0,
            "replies": []
        },
        {
            "body": "Soo Happy For You!! I Hope To Get So Lucky!!✨✨",
            "author": "Maimes231",
            "id": "g7484aa",
            "parent_id": "t3_j1vomg",
            "score": 2,
            "created_utc": 1601421147.0,
            "replies": []
        },
        {
            "body": "You need to change your name/handle because by everything I can see here, you are far from clueless and are doing sugar right. Keep treating each other well and enjoying every moment!",
            "author": "roscoe7585",
            "id": "g74bavl",
            "parent_id": "t3_j1vomg",
            "score": 2,
            "created_utc": 1601422984.0,
            "replies": [
                {
                    "body": "I realize the name may not apply anymore, but at one point I was certainly clueless.",
                    "author": "Sugarclueless",
                    "id": "g75k70p",
                    "parent_id": "t1_g74bavl",
                    "score": 1,
                    "created_utc": 1601454045.0,
                    "replies": [
                        {
                            "body": "Weren't we all...  :)",
                            "author": "roscoe7585",
                            "id": "g763hw9",
                            "parent_id": "t1_g75k70p",
                            "score": 1,
                            "created_utc": 1601472323.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Congratulations 🍾",
            "author": "Ilarasantos",
            "id": "g74fv3q",
            "parent_id": "t3_j1vomg",
            "score": 2,
            "created_utc": 1601425652.0,
            "replies": []
        },
        {
            "body": "\"...He pulls my chair out before I sit down...\" - Thank you mama for beating me with the wooden spoon so much as a kid when I was rude. Your temper at ill-mannered children has gotten me laid more times than I can count as an adult. Never underestimate the power of manners to make a woman horny.",
            "author": "mudpiesnow",
            "id": "g73eooe",
            "parent_id": "t3_j1vomg",
            "score": 2,
            "created_utc": 1601406940.0,
            "replies": []
        },
        {
            "body": "A question is sr exclusive for the daddy?",
            "author": "alialahmad1997",
            "id": "g71yo30",
            "parent_id": "t3_j1vomg",
            "score": 1,
            "created_utc": 1601384053.0,
            "replies": [
                {
                    "body": "Yes, we’ve talked about it and we are both not seeing other people.",
                    "author": "Sugarclueless",
                    "id": "g71zjrr",
                    "parent_id": "t1_g71yo30",
                    "score": 1,
                    "created_utc": 1601384632.0,
                    "replies": [
                        {
                            "body": "The one thing i dont get why would a person prefer to be sugar daddy rather than normal relationship\nIs that he is ugly or big age difference?",
                            "author": "alialahmad1997",
                            "id": "g71zoc5",
                            "parent_id": "t1_g71zjrr",
                            "score": -1,
                            "created_utc": 1601384706.0,
                            "replies": [
                                {
                                    "body": "He’s not ugly. There is the age difference, but I think what he was initially looking for is something a little different than what it has evolved into. We initially went into it with the idea of being travel buddies. It has turned into so much more.",
                                    "author": "Sugarclueless",
                                    "id": "g71zw6k",
                                    "parent_id": "t1_g71zoc5",
                                    "score": 2,
                                    "created_utc": 1601384830.0,
                                    "replies": [
                                        {
                                            "body": "Good luck in your relationship",
                                            "author": "alialahmad1997",
                                            "id": "g73m1va",
                                            "parent_id": "t1_g71zw6k",
                                            "score": 1,
                                            "created_utc": 1601410151.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "Because it has many merits over simple Vanilla dating!  That’s what makes it work.",
                                    "author": "DrMoTheMan",
                                    "id": "g73m2h2",
                                    "parent_id": "t1_g71zoc5",
                                    "score": 1,
                                    "created_utc": 1601410159.0,
                                    "replies": [
                                        {
                                            "body": "From the guy prespective what is tshe benefits?",
                                            "author": "alialahmad1997",
                                            "id": "g73m5hy",
                                            "parent_id": "t1_g73m2h2",
                                            "score": 0,
                                            "created_utc": 1601410201.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "[removed]",
            "author": null,
            "id": "g734ria",
            "parent_id": "t3_j1vomg",
            "score": 1,
            "created_utc": 1601402434.0,
            "replies": [
                {
                    "body": "I see you may have posted a number which is most likely an amount in relations to an arrangement. If this is the case, you are violating Rule#4 - \"No dollar amounts that are in reference to allowance/PPM are allowed.\"\n\n\nIf you are curious about Allowances reported by SLF contributors please see the [Allowance Master Thread 2019-2020](https://www.reddit.com/r/sugarlifestyleforum/comments/dezl91/allowance_master_thread_20192020/?utm_source=reddit&utm_medium=usertext&utm_name=sugarlifestyleforum&utm_content=t3_dnk455)\n\nYour post will not be approved until you remove the amount.  Please read the sub [Rules](https://www.reddit.com/r/sugarlifestyleforum/comments/748zta/updated_and_clarified_rules_for_slf/) prior to posting anything else. \n\nIf you simply posted a number not referencing a monetary amount, please message the MODs to approve your post.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/sugarlifestyleforum) if you have any questions or concerns.*",
                    "author": "AutoModerator",
                    "id": "g734rkw",
                    "parent_id": "t1_g734ria",
                    "score": 1,
                    "created_utc": 1601402435.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "What a refreshing post ... just fantastic ..Enjoy it \n\nI just don't get why the need to use a throwaway account to post such a positive experience?",
            "author": "shamloo77",
            "id": "g71q7j5",
            "parent_id": "t3_j1vomg",
            "score": 1,
            "created_utc": 1601377075.0,
            "replies": [
                {
                    "body": "Thank you! \n\nI had been a long time lurker, but created a sugar specific account to post.",
                    "author": "Sugarclueless",
                    "id": "g71sbpi",
                    "parent_id": "t1_g71q7j5",
                    "score": 3,
                    "created_utc": 1601379166.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Congrats\n\nCan you tell your age and his age?",
            "author": "foxhom3",
            "id": "g71kkn6",
            "parent_id": "t3_j1vomg",
            "score": 1,
            "created_utc": 1601370549.0,
            "replies": [
                {
                    "body": "I’m 32 and he’s 54.",
                    "author": "Sugarclueless",
                    "id": "g71kn7h",
                    "parent_id": "t1_g71kkn6",
                    "score": 9,
                    "created_utc": 1601370641.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "g71wxqa",
                            "parent_id": "t1_g71kn7h",
                            "score": 3,
                            "created_utc": 1601382871.0,
                            "replies": [
                                {
                                    "body": "Similar at >2.5 yrs",
                                    "author": "TXPolyDaddy",
                                    "id": "g720tth",
                                    "parent_id": "t1_g71wxqa",
                                    "score": 1,
                                    "created_utc": 1601385327.0,
                                    "replies": []
                                },
                                {
                                    "body": "I bet she would say the same things about you! 🙂",
                                    "author": "Sugarclueless",
                                    "id": "g721wcy",
                                    "parent_id": "t1_g71wxqa",
                                    "score": 1,
                                    "created_utc": 1601385893.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Good question. I am attempting, from the many similar post both positive and negative,  to deterimne if gentlemanly conduct is age related. I get the feeling it is but no objective proof of course.",
                    "author": "AFSMSgt",
                    "id": "g71n078",
                    "parent_id": "t1_g71kkn6",
                    "score": 1,
                    "created_utc": 1601373465.0,
                    "replies": [
                        {
                            "body": "I think age definitely plays a factor.",
                            "author": "Sugarclueless",
                            "id": "g71tohx",
                            "parent_id": "t1_g71n078",
                            "score": 1,
                            "created_utc": 1601380349.0,
                            "replies": []
                        },
                        {
                            "body": "Absolutely age plays a factor.   Both due to upbringing being substandard and a result of toxic feminist assertion that traditional gentlemen behavior is sexist (holding doors open,  etc).  \n\nThings are progressing exactly per their plans, a nice big group of gender fluid neckbeards that have no clue about how to strike a balance between showing courteous admiration of a young woman and treating her like she is incapable.  (Sorry to mention it but the OP being excited about being treated that way is a big statement about the crap caliber of young males today...)",
                            "author": "TXPolyDaddy",
                            "id": "g720pyy",
                            "parent_id": "t1_g71n078",
                            "score": -4,
                            "created_utc": 1601385270.0,
                            "replies": [
                                {
                                    "body": "You are exactly right. Sadly enough.",
                                    "author": "Sugarclueless",
                                    "id": "g7226dq",
                                    "parent_id": "t1_g720pyy",
                                    "score": 0,
                                    "created_utc": 1601386030.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Yeah. I did all of that and my SB just treated me like an ATM. While I believe that chivalry is good, a lot of SB’s don’t appreciate it",
            "author": "UnearthlyDinosaur",
            "id": "g730o4l",
            "parent_id": "t3_j1vomg",
            "score": 0,
            "created_utc": 1601400597.0,
            "replies": [
                {
                    "body": "I hope you find someone who does.",
                    "author": "Sugarclueless",
                    "id": "g73vtmq",
                    "parent_id": "t1_g730o4l",
                    "score": 2,
                    "created_utc": 1601414522.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Thank you for your thoughtful reply. You are absolutely right, I have met others who might have spent more on me, but who I didn’t have the same connection with. To me, it’s about so much more than the financial support. At this point, that is an added bonus. I really do care about him and I know he does for me as well. \n\nHere’s to hoping you find someone who appreciates you just as much!",
            "author": "Sugarclueless",
            "id": "g71s9px",
            "parent_id": "t1_g71rok7",
            "score": 25,
            "created_utc": 1601379115.0,
            "replies": [
                {
                    "body": "Thanks for my first ever award!!",
                    "author": "Sugarclueless",
                    "id": "g7202oi",
                    "parent_id": "t1_g71s9px",
                    "score": 6,
                    "created_utc": 1601384927.0,
                    "replies": [
                        {
                            "body": "P.S.  I am happy that you found an arrangement that holds a lot of promise for you!  CHEERS!",
                            "author": "Ok-Gur-1159",
                            "id": "g7536g9",
                            "parent_id": "t1_g7202oi",
                            "score": 1,
                            "created_utc": 1601438675.0,
                            "replies": []
                        },
                        {
                            "body": "I have had this strange run lately, all the SB's I've met or chatted with have focused on monetary negotiations first, without even considering if a connection would work out if the distance is reasonable if there's a mutual attraction, or even if our chemistry would be any good.  \nRight away they want to negotiate and they start off very high paying attention to where you will take it or how low you might go.  \nIMO, I'm staying on the sidelines through this.    \nI've been told how they have found \"terrific\" and \"generous\" men who will provide the financial support they seek . . . only to tell me later how they turned out to be creeps, or how they wanted to have sex with them while talking to their wife on the phone at the same time.  GEEZ!  \nAlright then . . . good luck trophy girl!",
                            "author": "Ok-Gur-1159",
                            "id": "g753488",
                            "parent_id": "t1_g7202oi",
                            "score": 1,
                            "created_utc": 1601438634.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "It really does. Indescribable.",
            "author": "Sugarclueless",
            "id": "g71t2l0",
            "parent_id": "t1_g71m824",
            "score": 2,
            "created_utc": 1601379830.0,
            "replies": []
        },
        {
            "body": "Aw thank you so much! I realized later that the title makes it sound like that. But really to me, hitting the jackpot in life isn’t about anything money can buy.",
            "author": "Sugarclueless",
            "id": "g720cn2",
            "parent_id": "t1_g7200zz",
            "score": 5,
            "created_utc": 1601385075.0,
            "replies": []
        },
        {
            "body": ">When I saw the title of this post, I thought it would be a post about hooking a whale\n\nMaybe, she did find a whale but chose not to post about. Interesting you felt the need to passively aggressively bring up money and material items, which am sure are part of their arrangement. \n\nFor me, it would be refreshing to see guys post about how happy they are to spoil their girl rotten and not lecture and encourage men to refuse giving gifts or money on “platonic” dates or before sex. I read about emotional connection a lot from guys online here, and agree that is important, but rarely read about men who enjoy spoiling financially and find pleasure in setting up their lady friend for a secure financial future. The one-sided benefit seems to focus on men’s needs only....Imagine that...men being selfish. 😉",
            "author": "sugarbooger1988",
            "id": "g72uqwi",
            "parent_id": "t1_g7200zz",
            "score": 2,
            "created_utc": 1601398031.0,
            "replies": [
                {
                    "body": "I wasn't being passive aggressive in any way. The content of this post genuinely caught me by surprise.  I also read her comment about turning down a higher offer for something she had a better connection with.\n\nIf you want to hear a little story about spoiling, here you go.\n\nI have a new SB I'm seeing and we're still on PPM. We're only a couple weeks into the arrangement and I'm sure many SDs on here will question if I'm not being cautious enough but she's been very affectionate and attentive and I get no inkling of her wanting to be spoiled. She does little unprompted thoughtful things here and there for me as well. She's been stressed about a couple exams this week and was trying to fit me into her schedule by rearranging some things on her end. I told her to focus on her exams and that it's no big deal if we can't meet this week. I also sent over our regular PPM. Additionally, she did a little shopping with the first PPM and I covered the cost for that as well.",
                    "author": "BishopSD",
                    "id": "g730hcd",
                    "parent_id": "t1_g72uqwi",
                    "score": 2,
                    "created_utc": 1601400506.0,
                    "replies": [
                        {
                            "body": "Ok well that is positive. I’m glad to hear to take care of her even when you don’t see her. I’ve read quite a lot of stories of guys who don’t on here so sorry if I assumed.\n\nI think, it’s also very natural to turn down a higher offer if the attraction is there. I would, too. Well, I would depending on the difference! 😉",
                            "author": "sugarbooger1988",
                            "id": "g731r0h",
                            "parent_id": "t1_g730hcd",
                            "score": 3,
                            "created_utc": 1601401123.0,
                            "replies": [
                                {
                                    "body": "oh, don't get me wrong. If this was a different SB that did the bare minimum, I probably wouldn't do any of this. It's a two way street.",
                                    "author": "BishopSD",
                                    "id": "g733pj0",
                                    "parent_id": "t1_g731r0h",
                                    "score": 1,
                                    "created_utc": 1601402016.0,
                                    "replies": [
                                        {
                                            "body": "Oh, don’t worry 😉 \n\nSee, if a man is good to you and spoils nicely, then the girl is generally not going to do the bare minimum. \n\nThat works for any relationship. I let the man take the lead and if he does not display he is very interested, and treat me exceptionally well, then will leave the situation.",
                                            "author": "sugarbooger1988",
                                            "id": "g735kg8",
                                            "parent_id": "t1_g733pj0",
                                            "score": 3,
                                            "created_utc": 1601402776.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "So Yes, and I’d add that effort, compromise, communication — all the things required for a lasting vanilla relationship — need to be there too if the sugar is to last as well. Gets all the merrier if a substantial age gap 😉",
            "author": "jacknjilled",
            "id": "g73zmc9",
            "parent_id": "t1_g732y4i",
            "score": 6,
            "created_utc": 1601416479.0,
            "replies": []
        },
        {
            "body": "Thank you so much! I hope so too 💖",
            "author": "Sugarclueless",
            "id": "g71l5wf",
            "parent_id": "t1_g71kxos",
            "score": 2,
            "created_utc": 1601371278.0,
            "replies": []
        },
        {
            "body": "I realize the name may not apply anymore, but at one point I was certainly clueless.",
            "author": "Sugarclueless",
            "id": "g75k70p",
            "parent_id": "t1_g74bavl",
            "score": 1,
            "created_utc": 1601454045.0,
            "replies": [
                {
                    "body": "Weren't we all...  :)",
                    "author": "roscoe7585",
                    "id": "g763hw9",
                    "parent_id": "t1_g75k70p",
                    "score": 1,
                    "created_utc": 1601472323.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Yes, we’ve talked about it and we are both not seeing other people.",
            "author": "Sugarclueless",
            "id": "g71zjrr",
            "parent_id": "t1_g71yo30",
            "score": 1,
            "created_utc": 1601384632.0,
            "replies": [
                {
                    "body": "The one thing i dont get why would a person prefer to be sugar daddy rather than normal relationship\nIs that he is ugly or big age difference?",
                    "author": "alialahmad1997",
                    "id": "g71zoc5",
                    "parent_id": "t1_g71zjrr",
                    "score": -1,
                    "created_utc": 1601384706.0,
                    "replies": [
                        {
                            "body": "He’s not ugly. There is the age difference, but I think what he was initially looking for is something a little different than what it has evolved into. We initially went into it with the idea of being travel buddies. It has turned into so much more.",
                            "author": "Sugarclueless",
                            "id": "g71zw6k",
                            "parent_id": "t1_g71zoc5",
                            "score": 2,
                            "created_utc": 1601384830.0,
                            "replies": [
                                {
                                    "body": "Good luck in your relationship",
                                    "author": "alialahmad1997",
                                    "id": "g73m1va",
                                    "parent_id": "t1_g71zw6k",
                                    "score": 1,
                                    "created_utc": 1601410151.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "Because it has many merits over simple Vanilla dating!  That’s what makes it work.",
                            "author": "DrMoTheMan",
                            "id": "g73m2h2",
                            "parent_id": "t1_g71zoc5",
                            "score": 1,
                            "created_utc": 1601410159.0,
                            "replies": [
                                {
                                    "body": "From the guy prespective what is tshe benefits?",
                                    "author": "alialahmad1997",
                                    "id": "g73m5hy",
                                    "parent_id": "t1_g73m2h2",
                                    "score": 0,
                                    "created_utc": 1601410201.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I see you may have posted a number which is most likely an amount in relations to an arrangement. If this is the case, you are violating Rule#4 - \"No dollar amounts that are in reference to allowance/PPM are allowed.\"\n\n\nIf you are curious about Allowances reported by SLF contributors please see the [Allowance Master Thread 2019-2020](https://www.reddit.com/r/sugarlifestyleforum/comments/dezl91/allowance_master_thread_20192020/?utm_source=reddit&utm_medium=usertext&utm_name=sugarlifestyleforum&utm_content=t3_dnk455)\n\nYour post will not be approved until you remove the amount.  Please read the sub [Rules](https://www.reddit.com/r/sugarlifestyleforum/comments/748zta/updated_and_clarified_rules_for_slf/) prior to posting anything else. \n\nIf you simply posted a number not referencing a monetary amount, please message the MODs to approve your post.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/sugarlifestyleforum) if you have any questions or concerns.*",
            "author": "AutoModerator",
            "id": "g734rkw",
            "parent_id": "t1_g734ria",
            "score": 1,
            "created_utc": 1601402435.0,
            "replies": []
        },
        {
            "body": "Thank you! \n\nI had been a long time lurker, but created a sugar specific account to post.",
            "author": "Sugarclueless",
            "id": "g71sbpi",
            "parent_id": "t1_g71q7j5",
            "score": 3,
            "created_utc": 1601379166.0,
            "replies": []
        },
        {
            "body": "I’m 32 and he’s 54.",
            "author": "Sugarclueless",
            "id": "g71kn7h",
            "parent_id": "t1_g71kkn6",
            "score": 9,
            "created_utc": 1601370641.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "g71wxqa",
                    "parent_id": "t1_g71kn7h",
                    "score": 3,
                    "created_utc": 1601382871.0,
                    "replies": [
                        {
                            "body": "Similar at >2.5 yrs",
                            "author": "TXPolyDaddy",
                            "id": "g720tth",
                            "parent_id": "t1_g71wxqa",
                            "score": 1,
                            "created_utc": 1601385327.0,
                            "replies": []
                        },
                        {
                            "body": "I bet she would say the same things about you! 🙂",
                            "author": "Sugarclueless",
                            "id": "g721wcy",
                            "parent_id": "t1_g71wxqa",
                            "score": 1,
                            "created_utc": 1601385893.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Good question. I am attempting, from the many similar post both positive and negative,  to deterimne if gentlemanly conduct is age related. I get the feeling it is but no objective proof of course.",
            "author": "AFSMSgt",
            "id": "g71n078",
            "parent_id": "t1_g71kkn6",
            "score": 1,
            "created_utc": 1601373465.0,
            "replies": [
                {
                    "body": "I think age definitely plays a factor.",
                    "author": "Sugarclueless",
                    "id": "g71tohx",
                    "parent_id": "t1_g71n078",
                    "score": 1,
                    "created_utc": 1601380349.0,
                    "replies": []
                },
                {
                    "body": "Absolutely age plays a factor.   Both due to upbringing being substandard and a result of toxic feminist assertion that traditional gentlemen behavior is sexist (holding doors open,  etc).  \n\nThings are progressing exactly per their plans, a nice big group of gender fluid neckbeards that have no clue about how to strike a balance between showing courteous admiration of a young woman and treating her like she is incapable.  (Sorry to mention it but the OP being excited about being treated that way is a big statement about the crap caliber of young males today...)",
                    "author": "TXPolyDaddy",
                    "id": "g720pyy",
                    "parent_id": "t1_g71n078",
                    "score": -4,
                    "created_utc": 1601385270.0,
                    "replies": [
                        {
                            "body": "You are exactly right. Sadly enough.",
                            "author": "Sugarclueless",
                            "id": "g7226dq",
                            "parent_id": "t1_g720pyy",
                            "score": 0,
                            "created_utc": 1601386030.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I hope you find someone who does.",
            "author": "Sugarclueless",
            "id": "g73vtmq",
            "parent_id": "t1_g730o4l",
            "score": 2,
            "created_utc": 1601414522.0,
            "replies": []
        },
        {
            "body": "Thanks for my first ever award!!",
            "author": "Sugarclueless",
            "id": "g7202oi",
            "parent_id": "t1_g71s9px",
            "score": 6,
            "created_utc": 1601384927.0,
            "replies": [
                {
                    "body": "P.S.  I am happy that you found an arrangement that holds a lot of promise for you!  CHEERS!",
                    "author": "Ok-Gur-1159",
                    "id": "g7536g9",
                    "parent_id": "t1_g7202oi",
                    "score": 1,
                    "created_utc": 1601438675.0,
                    "replies": []
                },
                {
                    "body": "I have had this strange run lately, all the SB's I've met or chatted with have focused on monetary negotiations first, without even considering if a connection would work out if the distance is reasonable if there's a mutual attraction, or even if our chemistry would be any good.  \nRight away they want to negotiate and they start off very high paying attention to where you will take it or how low you might go.  \nIMO, I'm staying on the sidelines through this.    \nI've been told how they have found \"terrific\" and \"generous\" men who will provide the financial support they seek . . . only to tell me later how they turned out to be creeps, or how they wanted to have sex with them while talking to their wife on the phone at the same time.  GEEZ!  \nAlright then . . . good luck trophy girl!",
                    "author": "Ok-Gur-1159",
                    "id": "g753488",
                    "parent_id": "t1_g7202oi",
                    "score": 1,
                    "created_utc": 1601438634.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I wasn't being passive aggressive in any way. The content of this post genuinely caught me by surprise.  I also read her comment about turning down a higher offer for something she had a better connection with.\n\nIf you want to hear a little story about spoiling, here you go.\n\nI have a new SB I'm seeing and we're still on PPM. We're only a couple weeks into the arrangement and I'm sure many SDs on here will question if I'm not being cautious enough but she's been very affectionate and attentive and I get no inkling of her wanting to be spoiled. She does little unprompted thoughtful things here and there for me as well. She's been stressed about a couple exams this week and was trying to fit me into her schedule by rearranging some things on her end. I told her to focus on her exams and that it's no big deal if we can't meet this week. I also sent over our regular PPM. Additionally, she did a little shopping with the first PPM and I covered the cost for that as well.",
            "author": "BishopSD",
            "id": "g730hcd",
            "parent_id": "t1_g72uqwi",
            "score": 2,
            "created_utc": 1601400506.0,
            "replies": [
                {
                    "body": "Ok well that is positive. I’m glad to hear to take care of her even when you don’t see her. I’ve read quite a lot of stories of guys who don’t on here so sorry if I assumed.\n\nI think, it’s also very natural to turn down a higher offer if the attraction is there. I would, too. Well, I would depending on the difference! 😉",
                    "author": "sugarbooger1988",
                    "id": "g731r0h",
                    "parent_id": "t1_g730hcd",
                    "score": 3,
                    "created_utc": 1601401123.0,
                    "replies": [
                        {
                            "body": "oh, don't get me wrong. If this was a different SB that did the bare minimum, I probably wouldn't do any of this. It's a two way street.",
                            "author": "BishopSD",
                            "id": "g733pj0",
                            "parent_id": "t1_g731r0h",
                            "score": 1,
                            "created_utc": 1601402016.0,
                            "replies": [
                                {
                                    "body": "Oh, don’t worry 😉 \n\nSee, if a man is good to you and spoils nicely, then the girl is generally not going to do the bare minimum. \n\nThat works for any relationship. I let the man take the lead and if he does not display he is very interested, and treat me exceptionally well, then will leave the situation.",
                                    "author": "sugarbooger1988",
                                    "id": "g735kg8",
                                    "parent_id": "t1_g733pj0",
                                    "score": 3,
                                    "created_utc": 1601402776.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Weren't we all...  :)",
            "author": "roscoe7585",
            "id": "g763hw9",
            "parent_id": "t1_g75k70p",
            "score": 1,
            "created_utc": 1601472323.0,
            "replies": []
        },
        {
            "body": "The one thing i dont get why would a person prefer to be sugar daddy rather than normal relationship\nIs that he is ugly or big age difference?",
            "author": "alialahmad1997",
            "id": "g71zoc5",
            "parent_id": "t1_g71zjrr",
            "score": -1,
            "created_utc": 1601384706.0,
            "replies": [
                {
                    "body": "He’s not ugly. There is the age difference, but I think what he was initially looking for is something a little different than what it has evolved into. We initially went into it with the idea of being travel buddies. It has turned into so much more.",
                    "author": "Sugarclueless",
                    "id": "g71zw6k",
                    "parent_id": "t1_g71zoc5",
                    "score": 2,
                    "created_utc": 1601384830.0,
                    "replies": [
                        {
                            "body": "Good luck in your relationship",
                            "author": "alialahmad1997",
                            "id": "g73m1va",
                            "parent_id": "t1_g71zw6k",
                            "score": 1,
                            "created_utc": 1601410151.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Because it has many merits over simple Vanilla dating!  That’s what makes it work.",
                    "author": "DrMoTheMan",
                    "id": "g73m2h2",
                    "parent_id": "t1_g71zoc5",
                    "score": 1,
                    "created_utc": 1601410159.0,
                    "replies": [
                        {
                            "body": "From the guy prespective what is tshe benefits?",
                            "author": "alialahmad1997",
                            "id": "g73m5hy",
                            "parent_id": "t1_g73m2h2",
                            "score": 0,
                            "created_utc": 1601410201.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "g71wxqa",
            "parent_id": "t1_g71kn7h",
            "score": 3,
            "created_utc": 1601382871.0,
            "replies": [
                {
                    "body": "Similar at >2.5 yrs",
                    "author": "TXPolyDaddy",
                    "id": "g720tth",
                    "parent_id": "t1_g71wxqa",
                    "score": 1,
                    "created_utc": 1601385327.0,
                    "replies": []
                },
                {
                    "body": "I bet she would say the same things about you! 🙂",
                    "author": "Sugarclueless",
                    "id": "g721wcy",
                    "parent_id": "t1_g71wxqa",
                    "score": 1,
                    "created_utc": 1601385893.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I think age definitely plays a factor.",
            "author": "Sugarclueless",
            "id": "g71tohx",
            "parent_id": "t1_g71n078",
            "score": 1,
            "created_utc": 1601380349.0,
            "replies": []
        },
        {
            "body": "Absolutely age plays a factor.   Both due to upbringing being substandard and a result of toxic feminist assertion that traditional gentlemen behavior is sexist (holding doors open,  etc).  \n\nThings are progressing exactly per their plans, a nice big group of gender fluid neckbeards that have no clue about how to strike a balance between showing courteous admiration of a young woman and treating her like she is incapable.  (Sorry to mention it but the OP being excited about being treated that way is a big statement about the crap caliber of young males today...)",
            "author": "TXPolyDaddy",
            "id": "g720pyy",
            "parent_id": "t1_g71n078",
            "score": -4,
            "created_utc": 1601385270.0,
            "replies": [
                {
                    "body": "You are exactly right. Sadly enough.",
                    "author": "Sugarclueless",
                    "id": "g7226dq",
                    "parent_id": "t1_g720pyy",
                    "score": 0,
                    "created_utc": 1601386030.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "P.S.  I am happy that you found an arrangement that holds a lot of promise for you!  CHEERS!",
            "author": "Ok-Gur-1159",
            "id": "g7536g9",
            "parent_id": "t1_g7202oi",
            "score": 1,
            "created_utc": 1601438675.0,
            "replies": []
        },
        {
            "body": "I have had this strange run lately, all the SB's I've met or chatted with have focused on monetary negotiations first, without even considering if a connection would work out if the distance is reasonable if there's a mutual attraction, or even if our chemistry would be any good.  \nRight away they want to negotiate and they start off very high paying attention to where you will take it or how low you might go.  \nIMO, I'm staying on the sidelines through this.    \nI've been told how they have found \"terrific\" and \"generous\" men who will provide the financial support they seek . . . only to tell me later how they turned out to be creeps, or how they wanted to have sex with them while talking to their wife on the phone at the same time.  GEEZ!  \nAlright then . . . good luck trophy girl!",
            "author": "Ok-Gur-1159",
            "id": "g753488",
            "parent_id": "t1_g7202oi",
            "score": 1,
            "created_utc": 1601438634.0,
            "replies": []
        },
        {
            "body": "Ok well that is positive. I’m glad to hear to take care of her even when you don’t see her. I’ve read quite a lot of stories of guys who don’t on here so sorry if I assumed.\n\nI think, it’s also very natural to turn down a higher offer if the attraction is there. I would, too. Well, I would depending on the difference! 😉",
            "author": "sugarbooger1988",
            "id": "g731r0h",
            "parent_id": "t1_g730hcd",
            "score": 3,
            "created_utc": 1601401123.0,
            "replies": [
                {
                    "body": "oh, don't get me wrong. If this was a different SB that did the bare minimum, I probably wouldn't do any of this. It's a two way street.",
                    "author": "BishopSD",
                    "id": "g733pj0",
                    "parent_id": "t1_g731r0h",
                    "score": 1,
                    "created_utc": 1601402016.0,
                    "replies": [
                        {
                            "body": "Oh, don’t worry 😉 \n\nSee, if a man is good to you and spoils nicely, then the girl is generally not going to do the bare minimum. \n\nThat works for any relationship. I let the man take the lead and if he does not display he is very interested, and treat me exceptionally well, then will leave the situation.",
                            "author": "sugarbooger1988",
                            "id": "g735kg8",
                            "parent_id": "t1_g733pj0",
                            "score": 3,
                            "created_utc": 1601402776.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "He’s not ugly. There is the age difference, but I think what he was initially looking for is something a little different than what it has evolved into. We initially went into it with the idea of being travel buddies. It has turned into so much more.",
            "author": "Sugarclueless",
            "id": "g71zw6k",
            "parent_id": "t1_g71zoc5",
            "score": 2,
            "created_utc": 1601384830.0,
            "replies": [
                {
                    "body": "Good luck in your relationship",
                    "author": "alialahmad1997",
                    "id": "g73m1va",
                    "parent_id": "t1_g71zw6k",
                    "score": 1,
                    "created_utc": 1601410151.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Because it has many merits over simple Vanilla dating!  That’s what makes it work.",
            "author": "DrMoTheMan",
            "id": "g73m2h2",
            "parent_id": "t1_g71zoc5",
            "score": 1,
            "created_utc": 1601410159.0,
            "replies": [
                {
                    "body": "From the guy prespective what is tshe benefits?",
                    "author": "alialahmad1997",
                    "id": "g73m5hy",
                    "parent_id": "t1_g73m2h2",
                    "score": 0,
                    "created_utc": 1601410201.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Similar at >2.5 yrs",
            "author": "TXPolyDaddy",
            "id": "g720tth",
            "parent_id": "t1_g71wxqa",
            "score": 1,
            "created_utc": 1601385327.0,
            "replies": []
        },
        {
            "body": "I bet she would say the same things about you! 🙂",
            "author": "Sugarclueless",
            "id": "g721wcy",
            "parent_id": "t1_g71wxqa",
            "score": 1,
            "created_utc": 1601385893.0,
            "replies": []
        },
        {
            "body": "You are exactly right. Sadly enough.",
            "author": "Sugarclueless",
            "id": "g7226dq",
            "parent_id": "t1_g720pyy",
            "score": 0,
            "created_utc": 1601386030.0,
            "replies": []
        },
        {
            "body": "oh, don't get me wrong. If this was a different SB that did the bare minimum, I probably wouldn't do any of this. It's a two way street.",
            "author": "BishopSD",
            "id": "g733pj0",
            "parent_id": "t1_g731r0h",
            "score": 1,
            "created_utc": 1601402016.0,
            "replies": [
                {
                    "body": "Oh, don’t worry 😉 \n\nSee, if a man is good to you and spoils nicely, then the girl is generally not going to do the bare minimum. \n\nThat works for any relationship. I let the man take the lead and if he does not display he is very interested, and treat me exceptionally well, then will leave the situation.",
                    "author": "sugarbooger1988",
                    "id": "g735kg8",
                    "parent_id": "t1_g733pj0",
                    "score": 3,
                    "created_utc": 1601402776.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Good luck in your relationship",
            "author": "alialahmad1997",
            "id": "g73m1va",
            "parent_id": "t1_g71zw6k",
            "score": 1,
            "created_utc": 1601410151.0,
            "replies": []
        },
        {
            "body": "From the guy prespective what is tshe benefits?",
            "author": "alialahmad1997",
            "id": "g73m5hy",
            "parent_id": "t1_g73m2h2",
            "score": 0,
            "created_utc": 1601410201.0,
            "replies": []
        },
        {
            "body": "Oh, don’t worry 😉 \n\nSee, if a man is good to you and spoils nicely, then the girl is generally not going to do the bare minimum. \n\nThat works for any relationship. I let the man take the lead and if he does not display he is very interested, and treat me exceptionally well, then will leave the situation.",
            "author": "sugarbooger1988",
            "id": "g735kg8",
            "parent_id": "t1_g733pj0",
            "score": 3,
            "created_utc": 1601402776.0,
            "replies": []
        }
    ]
}