{
    "title": "As much I don't want to think about it, the more it seems apparent that Naruto is going to die in Boruto and now I saw this.",
    "post_id": "ii7xe1",
    "post_url": "https://www.reddit.com/r/dankruto/comments/ii7xe1/as_much_i_dont_want_to_think_about_it_the_more_it/",
    "author": "Abin5ur",
    "body": "",
    "url": "https://i.redd.it/wu7qnmd46rj51.jpg",
    "score": 4582,
    "upvote_ratio": 0.98,
    "created_utc": 1598624582.0,
    "num_comments": 161,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "Wait wait. He dodged his fate. They all died before they became hokage. Naruto achieved that.",
            "author": "buddybear98",
            "id": "g359bwc",
            "parent_id": "t3_ii7xe1",
            "score": 716,
            "created_utc": 1598630259.0,
            "replies": [
                {
                    "body": "The necklace wasn't cursed it was Tsunade's love, look what happenned to Jiraiya, they may not have been romantically involved but you know she loved him.",
                    "author": "itsnunyabusiness",
                    "id": "g35fly0",
                    "parent_id": "t1_g359bwc",
                    "score": 402,
                    "created_utc": 1598633252.0,
                    "replies": []
                },
                {
                    "body": "Nice catch.",
                    "author": "manga_pages_by_me",
                    "id": "g35a588",
                    "parent_id": "t1_g359bwc",
                    "score": 83,
                    "created_utc": 1598630648.0,
                    "replies": []
                },
                {
                    "body": "[removed]",
                    "author": null,
                    "id": "g35sjbk",
                    "parent_id": "t1_g359bwc",
                    "score": 166,
                    "created_utc": 1598639335.0,
                    "replies": [
                        {
                            "body": "Good story >>> fanservice with old characters.",
                            "author": null,
                            "id": "g35wc6k",
                            "parent_id": "t1_g35sjbk",
                            "score": 78,
                            "created_utc": 1598641132.0,
                            "replies": [
                                {
                                    "body": "Hot take: Anything killing Naruto at this point is bad story. That boy big powerful and everytime they make a character randomly stronger than Shinobi Jesus it’s bad story.",
                                    "author": "Xandril",
                                    "id": "g36hl1w",
                                    "parent_id": "t1_g35wc6k",
                                    "score": 69,
                                    "created_utc": 1598651345.0,
                                    "replies": [
                                        {
                                            "body": "I don't mind Boruto, but I hate when people say \"Sasuke or Naruto should be killed off to make it more interesting\" \n\nwhy can't the writers find a way to make Boruto interesting without killing an OG character?",
                                            "author": null,
                                            "id": "g36lv73",
                                            "parent_id": "t1_g36hl1w",
                                            "score": 48,
                                            "created_utc": 1598653563.0,
                                            "replies": [
                                                {
                                                    "body": "Kill chocho",
                                                    "author": "MoMoney224",
                                                    "id": "g36ytxs",
                                                    "parent_id": "t1_g36lv73",
                                                    "score": 33,
                                                    "created_utc": 1598660790.0,
                                                    "replies": [
                                                        {
                                                            "body": "I agree with this.",
                                                            "author": "Galan1234",
                                                            "id": "g37c19y",
                                                            "parent_id": "t1_g36ytxs",
                                                            "score": 11,
                                                            "created_utc": 1598668700.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "body": "Devils advocate here, because it's incredibly difficult to write a scenario where Godruto can't solve it for some reason. How do you have stakes in a series where one character basically can't fail? And if he does, it's because of some diablos ex machina, which is also bullshit.",
                                                    "author": "TheHeadlessScholar",
                                                    "id": "g37dq5p",
                                                    "parent_id": "t1_g36lv73",
                                                    "score": 8,
                                                    "created_utc": 1598669752.0,
                                                    "replies": [
                                                        {
                                                            "body": "You could just have them sealed away or incapacitated",
                                                            "author": null,
                                                            "id": "g37fy0l",
                                                            "parent_id": "t1_g37dq5p",
                                                            "score": 4,
                                                            "created_utc": 1598671140.0,
                                                            "replies": []
                                                        },
                                                        {
                                                            "body": "Not really. The stakes don’t have to always be world, nation, or village level. It can be about character development. Just because Naruto and Sasuke are around doesn’t mean all (comparatively) minor conflicts across the world stop. \n\nThe writers are just convinced they need to keep themselves in the same box even tho that box has been examined very thoroughly. \n\nAlthough, if they really wanted to get rid of Naruto they should have used the groundwork Kishi already laid out in regards to Naruto’s healing factor. The didn’t reference it by name but Tsunade’s warning about relying on regeneration is the Hayflick Limit. It wouldn’t even be difficult to argue that even just the four tails state, let alone everything else in his life, would have drastically reduced his lifespan.",
                                                            "author": "Xandril",
                                                            "id": "g3ag7m9",
                                                            "parent_id": "t1_g37dq5p",
                                                            "score": 3,
                                                            "created_utc": 1598738726.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "body": "Isshiki isn't just randomly stronger. He stands at the very top of the Ootsutsuki hierarchy.",
                                            "author": null,
                                            "id": "g37vo1x",
                                            "parent_id": "t1_g36hl1w",
                                            "score": 3,
                                            "created_utc": 1598683114.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "[removed]",
                                    "author": null,
                                    "id": "g35wf2w",
                                    "parent_id": "t1_g35wc6k",
                                    "score": 26,
                                    "created_utc": 1598641169.0,
                                    "replies": [
                                        {
                                            "body": "It definitely don’t got any fan service....... wait",
                                            "author": "robomaster20",
                                            "id": "g35xbit",
                                            "parent_id": "t1_g35wf2w",
                                            "score": 10,
                                            "created_utc": 1598641596.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "An ok story with the old character fanservice would be super acceptable tho",
                                    "author": "Phenoxx",
                                    "id": "g36btjn",
                                    "parent_id": "t1_g35wc6k",
                                    "score": 9,
                                    "created_utc": 1598648394.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "Ah a man of culture. I've seen people talking about having both of them killed for \"character development\"",
                            "author": "HairyResponsibility9",
                            "id": "g35t6lt",
                            "parent_id": "t1_g35sjbk",
                            "score": 43,
                            "created_utc": 1598639644.0,
                            "replies": []
                        },
                        {
                            "body": "Killing Sasuke off would suck too.",
                            "author": "AtlasRafael",
                            "id": "g35zlm7",
                            "parent_id": "t1_g35sjbk",
                            "score": 24,
                            "created_utc": 1598642677.0,
                            "replies": [
                                {
                                    "body": "Ye just imagine, took us 500 episodes to bring him back and now they kill him",
                                    "author": "AGARAN24",
                                    "id": "g36dh6i",
                                    "parent_id": "t1_g35zlm7",
                                    "score": 33,
                                    "created_utc": 1598649235.0,
                                    "replies": [
                                        {
                                            "body": "He’s probably the most complex and developed character. Most unique Shinzo I left as well. Would straight up suck considering he’s got so many hax abilities and is super OP killing him would just be for the plot.",
                                            "author": "AtlasRafael",
                                            "id": "g36dou0",
                                            "parent_id": "t1_g36dh6i",
                                            "score": 18,
                                            "created_utc": 1598649344.0,
                                            "replies": [
                                                {
                                                    "body": "I don't feel like Kishimoto knew exactly what he wanted to do with Sasuke after his final fight with Naruto. Sasuke stopped having a precise goal. So it just became protecting Konoha from the shadows. Now his role is to be Boruto's teacher. \n\nI guess it would be a good ending for Sasuke to sacrifice himself for the village. But imo, his death is not necessary to give Boruto and Sarada development. His relationship with Boruto hasn't even been developed much.",
                                                    "author": null,
                                                    "id": "g36kw0i",
                                                    "parent_id": "t1_g36dou0",
                                                    "score": 10,
                                                    "created_utc": 1598653051.0,
                                                    "replies": [
                                                        {
                                                            "body": "Well, he’s still the villages hidden guardian though. He’s basically a Navy Seal team. \n\nI don’t think either have to die. It would be lame in my opinion. They are definitely too powerful for any new villains, but they could have deteriorated from the Rinnegan or Narutos sage of sixth paths mode. Since there’s not much known of their extended use within humans. Just a way to make them weaker so Boruto and the rest can shine without killing those two.",
                                                            "author": "AtlasRafael",
                                                            "id": "g36vxi5",
                                                            "parent_id": "t1_g36kw0i",
                                                            "score": 6,
                                                            "created_utc": 1598659082.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "body": "He should have died in Shippuden, now who cares if he dies or not.",
                                                    "author": "thedoorsrebel",
                                                    "id": "g36lva9",
                                                    "parent_id": "t1_g36dou0",
                                                    "score": -6,
                                                    "created_utc": 1598653564.0,
                                                    "replies": [
                                                        {
                                                            "body": "I don't know. Maybe the people who liked him as a character? After all, he was the co-protagonist. Naruto's rival. He has fans too. Just because you didn't like him doesn't mean others don't. \n\nAdult Sasuke is cool. 🤷",
                                                            "author": null,
                                                            "id": "g36m3xb",
                                                            "parent_id": "t1_g36lva9",
                                                            "score": 9,
                                                            "created_utc": 1598653691.0,
                                                            "replies": []
                                                        },
                                                        {
                                                            "body": "But that’s the easy way. Killing him is simple. Writing his redemption and changing him into a likeable character who has evolved is more difficult and interesting. If he dies he’s dead. Fin. \n\nHe was one of the most interesting and rounded characters in the series.",
                                                            "author": "AtlasRafael",
                                                            "id": "g36w265",
                                                            "parent_id": "t1_g36lva9",
                                                            "score": 3,
                                                            "created_utc": 1598659157.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Nah to me he was just an entitled brat. He ruined the series for me. You know when I rewatched it I had to stop when the kaguya's fight is over because I know after that the shitty bastard will pull that shit after everything that has happened, threatening the kages, the bijuus. I hate him. He should have died. Now I don't care what he does. It doesn't matter anymore. His time has passed.",
                                                                    "author": "thedoorsrebel",
                                                                    "id": "g36xo4c",
                                                                    "parent_id": "t1_g36w265",
                                                                    "score": 1,
                                                                    "created_utc": 1598660097.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "Entitled brat? Lol do you not know what happened? He’s not entitled at all. \n\nI used to hate him, but he became on of my favorite characters.",
                                                                            "author": "AtlasRafael",
                                                                            "id": "g3749uj",
                                                                            "parent_id": "t1_g36xo4c",
                                                                            "score": 3,
                                                                            "created_utc": 1598664003.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "I could explain a detailed list of why he's. You wouldn't agree because you know all the events I would put in that list but your perception of them was different. We would discuss this in several comments and nobody would change their minds about it. Instead of that, I would save both of us the trouble saying \"agree to disagree\" and move on.",
                                                                                    "author": "thedoorsrebel",
                                                                                    "id": "g374irq",
                                                                                    "parent_id": "t1_g3749uj",
                                                                                    "score": 1,
                                                                                    "created_utc": 1598664150.0,
                                                                                    "replies": [
                                                                                        {
                                                                                            "body": "Fair enough my dude. Not trynna change your mind really. Just sharing my opinion lol.",
                                                                                            "author": "AtlasRafael",
                                                                                            "id": "g37bkdx",
                                                                                            "parent_id": "t1_g374irq",
                                                                                            "score": 1,
                                                                                            "created_utc": 1598668411.0,
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        },
                                                                        {
                                                                            "body": "> He ruined the series for me \n\nsad",
                                                                            "author": null,
                                                                            "id": "g36y6kc",
                                                                            "parent_id": "t1_g36xo4c",
                                                                            "score": 2,
                                                                            "created_utc": 1598660402.0,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "The manga is pretty good in my opinion. Not naruto good, but I'd say boruto manga is better than naruto filler at the very least. I get that people don't like him having tons of power for no reason, but it makes sense for him. Think of the uchiha. They were naturally gifted because of their clan. They had to train yo build up on that, but boruto is kinda the same way. When you also consider that naruto is ashura's reincarnate, making naruto pretty much pure senju, and hinata is main branch hyuga, it makes sense for him to be naturally gifted. Momoshiki said something about the otsutsuki blood being strong in boruto. That's likely a result of his senju blood (son of ashura's reincarnate) and his hyuga blood (son of hinata. Main branch hyuga). Im really just basing the hyuga thing off of otsutsuki typically having byakugan. Even if that weren't important, what is important is that boruto is strong because at the very least he has what could be considered \"main branch\" senju blood, main branch hyuga blood, and the karma.",
                            "author": "Schumeschu",
                            "id": "g36rbcx",
                            "parent_id": "t1_g35sjbk",
                            "score": 5,
                            "created_utc": 1598656498.0,
                            "replies": [
                                {
                                    "body": "[removed]",
                                    "author": null,
                                    "id": "g3704hn",
                                    "parent_id": "t1_g36rbcx",
                                    "score": 2,
                                    "created_utc": 1598661556.0,
                                    "replies": [
                                        {
                                            "body": "The manga and anime are almost entirely different. The manga started out pretty bad but gradually got better over time, to the point where I can look forward to new chapters each month. To be honest, it really only starts getting good when >!Kawaki is finally introduced!< and before that it’s very much just either bad or meh, especially since the first arc is just the movie again. Compared to the anime though, it’s a million times better than the anime.",
                                            "author": "thatguy-66",
                                            "id": "g37e5m2",
                                            "parent_id": "t1_g3704hn",
                                            "score": 2,
                                            "created_utc": 1598670024.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "[deleted]",
                                            "author": null,
                                            "id": "g377f8l",
                                            "parent_id": "t1_g3704hn",
                                            "score": 0,
                                            "created_utc": 1598665897.0,
                                            "replies": [
                                                {
                                                    "body": "[removed]",
                                                    "author": null,
                                                    "id": "g378xbu",
                                                    "parent_id": "t1_g377f8l",
                                                    "score": 0,
                                                    "created_utc": 1598666792.0,
                                                    "replies": [
                                                        {
                                                            "body": "[deleted]",
                                                            "author": null,
                                                            "id": "g37bh0p",
                                                            "parent_id": "t1_g378xbu",
                                                            "score": 0,
                                                            "created_utc": 1598668354.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "body": "The anime has been 99% filler. It's garbage. The manga is the picture of a big Mac and the anime is what you get. His power feels pretty earned from the manga imo. I get that it doesn't matter to you, but I feel like I've heard the argument once or twice . The manga is also decently paced. Think about og naruto. In the manga, naruto leaves with jiraya immediately after sasuke leaves. In the anime there are another 100 episodes. Boruto is pretty much the same way. Idk what else to say without spoiling it, but I just want people to stop hating on boruto so hard. It isnt naruto part one. Far from it. But its pretty good in its own right, and I can't wait for the anime to be finished so I can watch the manga cut of it start to finish.",
                                            "author": "Schumeschu",
                                            "id": "g370xlp",
                                            "parent_id": "t1_g3704hn",
                                            "score": -1,
                                            "created_utc": 1598662031.0,
                                            "replies": [
                                                {
                                                    "body": "I don't think you understand what filler is.",
                                                    "author": null,
                                                    "id": "g37cjng",
                                                    "parent_id": "t1_g370xlp",
                                                    "score": 1,
                                                    "created_utc": 1598669015.0,
                                                    "replies": [
                                                        {
                                                            "body": "I understand what it is. Basically just them waiting for the manga to progress enough content to incorporate it into the anime, while still producing  episodes of the anime. That said I think it's fucking stupid",
                                                            "author": "Schumeschu",
                                                            "id": "g37dda5",
                                                            "parent_id": "t1_g37cjng",
                                                            "score": 0,
                                                            "created_utc": 1598669526.0,
                                                            "replies": [
                                                                {
                                                                    "body": "At least acknowledge the fact that you made a mistake in ur paragraph and just edited it..",
                                                                    "author": null,
                                                                    "id": "g3b8ybk",
                                                                    "parent_id": "t1_g37dda5",
                                                                    "score": 1,
                                                                    "created_utc": 1598753941.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "I wrote manga instead of anime in a context where I was clearly talking about anime. No reason to specify",
                                                                            "author": "Schumeschu",
                                                                            "id": "g3b9ea3",
                                                                            "parent_id": "t1_g3b8ybk",
                                                                            "score": 0,
                                                                            "created_utc": 1598754204.0,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "body": "[removed]",
                                                    "author": null,
                                                    "id": "g371ow9",
                                                    "parent_id": "t1_g370xlp",
                                                    "score": 0,
                                                    "created_utc": 1598662480.0,
                                                    "replies": [
                                                        {
                                                            "body": "Absolutely. But I dont feel like it does many of the old characters dirty.",
                                                            "author": "Schumeschu",
                                                            "id": "g3721n4",
                                                            "parent_id": "t1_g371ow9",
                                                            "score": 1,
                                                            "created_utc": 1598662688.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "Nah Sasuke won’t die, at least for awhile. He’s taking a more active role in the manga.......oh wait......\n\nNO",
                            "author": "AngonceMcGhee",
                            "id": "g35y70p",
                            "parent_id": "t1_g35sjbk",
                            "score": 10,
                            "created_utc": 1598642013.0,
                            "replies": []
                        },
                        {
                            "body": "nah nah, I think he actually does die eventually in the series. I've only watched the boruto movie and the first episode of boruto, but the first episode opened with this dude fighting boruto and saying to him \"I'm gonna send you to the place I sent your father\" while battling on the leaf villages destroyed remains. so it's pretty safe to assume Naruto does die along with the destruction of the village.",
                            "author": "shupaoasado",
                            "id": "g37liji",
                            "parent_id": "t1_g35sjbk",
                            "score": 1,
                            "created_utc": 1598674883.0,
                            "replies": []
                        },
                        {
                            "body": "Did you read the manga?",
                            "author": "Yourboyfibs",
                            "id": "g37moyt",
                            "parent_id": "t1_g35sjbk",
                            "score": 1,
                            "created_utc": 1598675748.0,
                            "replies": []
                        },
                        {
                            "body": "The manga is super dank",
                            "author": "Zoulf",
                            "id": "g36ai3u",
                            "parent_id": "t1_g35sjbk",
                            "score": 1,
                            "created_utc": 1598647810.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "technically he has died before so the meme ain't wrong",
            "author": "BiggieSmalls0",
            "id": "g35aicn",
            "parent_id": "t3_ii7xe1",
            "score": 183,
            "created_utc": 1598630826.0,
            "replies": [
                {
                    "body": "Actually I never thought of that. You are actually right. He died when beast was extracted from him",
                    "author": "Abin5ur",
                    "id": "g35won2",
                    "parent_id": "t1_g35aicn",
                    "score": 77,
                    "created_utc": 1598641293.0,
                    "replies": [
                        {
                            "body": "then Kurama came back and he was alive 10x more OP",
                            "author": "Cyber1969",
                            "id": "g365wd3",
                            "parent_id": "t1_g35won2",
                            "score": 34,
                            "created_utc": 1598645572.0,
                            "replies": [
                                {
                                    "body": "Ah yes. Plot Armour",
                                    "author": "MoogleSan",
                                    "id": "g36b24k",
                                    "parent_id": "t1_g365wd3",
                                    "score": 26,
                                    "created_utc": 1598648085.0,
                                    "replies": []
                                },
                                {
                                    "body": "But because of that Naruto is suffering from a deadly disease that Hagoromo also suffered",
                                    "author": "Abin5ur",
                                    "id": "g36a1lz",
                                    "parent_id": "t1_g365wd3",
                                    "score": 14,
                                    "created_utc": 1598647587.0,
                                    "replies": [
                                        {
                                            "body": "Really what disease?",
                                            "author": "orbter",
                                            "id": "g36gy92",
                                            "parent_id": "t1_g36a1lz",
                                            "score": 10,
                                            "created_utc": 1598651020.0,
                                            "replies": [
                                                {
                                                    "body": "Ligma",
                                                    "author": "randominternetp3rs0n",
                                                    "id": "g36hahu",
                                                    "parent_id": "t1_g36gy92",
                                                    "score": 45,
                                                    "created_utc": 1598651194.0,
                                                    "replies": [
                                                        {
                                                            "body": "Wow man you are so funny",
                                                            "author": "orbter",
                                                            "id": "g36hmr7",
                                                            "parent_id": "t1_g36hahu",
                                                            "score": 4,
                                                            "created_utc": 1598651369.0,
                                                            "replies": [
                                                                {
                                                                    "body": "be honest that was good",
                                                                    "author": "BiggieSmalls0",
                                                                    "id": "g36ibh8",
                                                                    "parent_id": "t1_g36hmr7",
                                                                    "score": 23,
                                                                    "created_utc": 1598651723.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "body": "Well it's not specified yet but it is said in a light novel of Boruto that he is suffering from a deadly disease which is caused due to being a Jinchuriki of a partial 10 tails which can only be cured by the dust of a certain meteor that falls every century or something.",
                                                    "author": "Abin5ur",
                                                    "id": "g36wt53",
                                                    "parent_id": "t1_g36gy92",
                                                    "score": 3,
                                                    "created_utc": 1598659590.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Damn, like Tsunade keep your hands to yourself 😂",
            "author": "RinnTheFinn",
            "id": "g353ni9",
            "parent_id": "t3_ii7xe1",
            "score": 93,
            "created_utc": 1598627490.0,
            "replies": []
        },
        {
            "body": "His fate is worse than death",
            "author": "Chemp_Chemp",
            "id": "g355d4c",
            "parent_id": "t3_ii7xe1",
            "score": 33,
            "created_utc": 1598628341.0,
            "replies": []
        },
        {
            "body": "The kiss of death",
            "author": "Omgitsjackg",
            "id": "g35jfrh",
            "parent_id": "t3_ii7xe1",
            "score": 31,
            "created_utc": 1598635030.0,
            "replies": [
                {
                    "body": "From Mrs. GoldMember",
                    "author": "PlsDontPls",
                    "id": "g3665qx",
                    "parent_id": "t1_g35jfrh",
                    "score": 7,
                    "created_utc": 1598645698.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "She is like a mother to him i liked her very much in naruto",
            "author": "kaushik-t",
            "id": "g35rkec",
            "parent_id": "t3_ii7xe1",
            "score": 22,
            "created_utc": 1598638871.0,
            "replies": []
        },
        {
            "body": "Proof she kissed Jiraiya at least once.",
            "author": null,
            "id": "g35vj81",
            "parent_id": "t3_ii7xe1",
            "score": 33,
            "created_utc": 1598640750.0,
            "replies": [
                {
                    "body": "On his TenTen",
                    "author": "LurkerPatrol",
                    "id": "g36g9yw",
                    "parent_id": "t1_g35vj81",
                    "score": 10,
                    "created_utc": 1598650670.0,
                    "replies": [
                        {
                            "body": "*TonTon",
                            "author": "lavendiere",
                            "id": "g37m9tg",
                            "parent_id": "t1_g36g9yw",
                            "score": 3,
                            "created_utc": 1598675437.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "hopefully more",
                    "author": "shreckforeverafter",
                    "id": "g37hnpm",
                    "parent_id": "t1_g35vj81",
                    "score": 1,
                    "created_utc": 1598672245.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Well he is going to die someday either way",
            "author": "Endketsu",
            "id": "g35s9tm",
            "parent_id": "t3_ii7xe1",
            "score": 14,
            "created_utc": 1598639209.0,
            "replies": [
                {
                    "body": "This is the comment I was looking for",
                    "author": "Dxuian",
                    "id": "g35xfqp",
                    "parent_id": "t1_g35s9tm",
                    "score": 5,
                    "created_utc": 1598641651.0,
                    "replies": []
                },
                {
                    "body": "I pointed this out once and got downvoted to all hell lol",
                    "author": "Commofmedic",
                    "id": "g379yxk",
                    "parent_id": "t1_g35s9tm",
                    "score": 2,
                    "created_utc": 1598667427.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "OH SHIT IKEMOTO DONT DO THIS TO US",
            "author": "Kitsuneuser_67",
            "id": "g358dih",
            "parent_id": "t3_ii7xe1",
            "score": 28,
            "created_utc": 1598629800.0,
            "replies": [
                {
                    "body": "KISHIMOTO DOESN'T WRITE BORUTO",
                    "author": "LordPos",
                    "id": "g35antf",
                    "parent_id": "t1_g358dih",
                    "score": 36,
                    "created_utc": 1598630900.0,
                    "replies": [
                        {
                            "body": "i mean ikemoto not kishimoto lol",
                            "author": "Kitsuneuser_67",
                            "id": "g35ik7o",
                            "parent_id": "t1_g35antf",
                            "score": 20,
                            "created_utc": 1598634622.0,
                            "replies": [
                                {
                                    "body": "Kishimoto gave all the rights to kill the characters.",
                                    "author": null,
                                    "id": "g36b1lv",
                                    "parent_id": "t1_g35ik7o",
                                    "score": 4,
                                    "created_utc": 1598648078.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "alright",
                            "author": "Kitsuneuser_67",
                            "id": "g35ipdk",
                            "parent_id": "t1_g35antf",
                            "score": 13,
                            "created_utc": 1598634688.0,
                            "replies": [
                                {
                                    "body": "What?",
                                    "author": "Kazewatch",
                                    "id": "g366lww",
                                    "parent_id": "t1_g35ipdk",
                                    "score": 2,
                                    "created_utc": 1598645916.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "this comment and reply section makes no sense-",
                    "author": "Kitsuneuser_67",
                    "id": "g36bz09",
                    "parent_id": "t1_g358dih",
                    "score": 1,
                    "created_utc": 1598648469.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Little did we know it brought something much worse, Naruto x Tsunade rule 34",
            "author": "disneychannelismylif",
            "id": "g35xrgu",
            "parent_id": "t3_ii7xe1",
            "score": 14,
            "created_utc": 1598641808.0,
            "replies": [
                {
                    "body": "worse…",
                    "author": "shreckforeverafter",
                    "id": "g37hoye",
                    "parent_id": "t1_g35xrgu",
                    "score": 2,
                    "created_utc": 1598672268.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Either Naruto or Sasuke will probably die in boruto give boruto the same thing Jiraiya’s death did for Naruto\nEdit: I think it will be Naruto so that they can give Konohamaru the title of 8th Hokage",
            "author": "TheCrazyCobra",
            "id": "g35vs9b",
            "parent_id": "t3_ii7xe1",
            "score": 6,
            "created_utc": 1598640871.0,
            "replies": []
        },
        {
            "body": "I’m pretty sure naruto died like 3 times but someone transferred their life to narutos and also kurama saved him once when he tried to escape.",
            "author": "FrickedUpGlitch",
            "id": "g360l7r",
            "parent_id": "t3_ii7xe1",
            "score": 6,
            "created_utc": 1598643142.0,
            "replies": []
        },
        {
            "body": "If naruto dies, boruto goes down as well, people\nwatch boruto just because naruto is there",
            "author": null,
            "id": "g35tvbt",
            "parent_id": "t3_ii7xe1",
            "score": 8,
            "created_utc": 1598639969.0,
            "replies": []
        },
        {
            "body": "Nah I think sauske will die and naruto takes his rinnegan uses Rinne rebirth and boom then due to Sasukes death will give sarada MS",
            "author": "Stayhighuchina_7",
            "id": "g35td8t",
            "parent_id": "t3_ii7xe1",
            "score": 9,
            "created_utc": 1598639731.0,
            "replies": [
                {
                    "body": "That’s something I haven’t thought of yet and I fuck wit that theory.",
                    "author": "Zoulf",
                    "id": "g36atb2",
                    "parent_id": "t1_g35td8t",
                    "score": 3,
                    "created_utc": 1598647963.0,
                    "replies": []
                },
                {
                    "body": "No, Boruto loses control of his Borushiki mode and like Sasuke promised he will try to kill Boruto. He tries and fails, only leaving the scar on Boruto’s eye and Boruto kills Sasuke off.",
                    "author": "Yourboyfibs",
                    "id": "g37mi5f",
                    "parent_id": "t1_g35td8t",
                    "score": 1,
                    "created_utc": 1598675607.0,
                    "replies": [
                        {
                            "body": "I mean you basically said what I said but with more detail and without the sarada ms and that boruto kills sauske and that naruto uses Rinne rebirth but ok I like your theory",
                            "author": "Stayhighuchina_7",
                            "id": "g37mmtg",
                            "parent_id": "t1_g37mi5f",
                            "score": 1,
                            "created_utc": 1598675703.0,
                            "replies": [
                                {
                                    "body": "I like your theory as well",
                                    "author": "Yourboyfibs",
                                    "id": "g37omlj",
                                    "parent_id": "t1_g37mmtg",
                                    "score": 2,
                                    "created_utc": 1598677165.0,
                                    "replies": [
                                        {
                                            "body": "Thanks",
                                            "author": "Stayhighuchina_7",
                                            "id": "g37onm3",
                                            "parent_id": "t1_g37omlj",
                                            "score": 1,
                                            "created_utc": 1598677188.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Why does it look like nawaki has a boner?",
            "author": "NTReatsmysoul",
            "id": "g35dimt",
            "parent_id": "t3_ii7xe1",
            "score": 5,
            "created_utc": 1598632265.0,
            "replies": [
                {
                    "body": "I mean, who wouldn’t?",
                    "author": "Seppel420",
                    "id": "g35qkxp",
                    "parent_id": "t1_g35dimt",
                    "score": 7,
                    "created_utc": 1598638399.0,
                    "replies": [
                        {
                            "body": "Perhaps he was thinking of titfucking his sister in the afterlife",
                            "author": "NTReatsmysoul",
                            "id": "g35skki",
                            "parent_id": "t1_g35qkxp",
                            "score": 4,
                            "created_utc": 1598639352.0,
                            "replies": [
                                {
                                    "body": "r/cursedcomments",
                                    "author": "Abin5ur",
                                    "id": "g35ws3b",
                                    "parent_id": "t1_g35skki",
                                    "score": 4,
                                    "created_utc": 1598641338.0,
                                    "replies": []
                                },
                                {
                                    "body": "Wait what now",
                                    "author": "RiceBoiz29",
                                    "id": "g35yxhm",
                                    "parent_id": "t1_g35skki",
                                    "score": 1,
                                    "created_utc": 1598642360.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "The kiss of death.",
            "author": "lualonso",
            "id": "g35yyho",
            "parent_id": "t3_ii7xe1",
            "score": 3,
            "created_utc": 1598642374.0,
            "replies": []
        },
        {
            "body": "Sasukes not gonna die cuz this story is basically about his journey of redemption...oh wait and then there’s Borutos story too...",
            "author": "kfanatic20",
            "id": "g363lyy",
            "parent_id": "t3_ii7xe1",
            "score": 3,
            "created_utc": 1598644562.0,
            "replies": []
        },
        {
            "body": "Naruto is probably going to die soon in the Boruto manga and I'm not ready. \n\nBtw the manga is fucking lit.",
            "author": "Summerclaw",
            "id": "g364f9l",
            "parent_id": "t3_ii7xe1",
            "score": 3,
            "created_utc": 1598644932.0,
            "replies": [
                {
                    "body": "I don't believe they have the balls to kill Naruto off. It makes more sense to kill Sasuke because Sasuke is trying to make up for his past and he has spent the rest of his life trying to protect the village. So I think it would be a good ending for him to die protecting the village.",
                    "author": null,
                    "id": "g36g71h",
                    "parent_id": "t1_g364f9l",
                    "score": -1,
                    "created_utc": 1598650629.0,
                    "replies": [
                        {
                            "body": "Naruto is apparently dead in the time jump.",
                            "author": "Summerclaw",
                            "id": "g36gtkr",
                            "parent_id": "t1_g36g71h",
                            "score": 0,
                            "created_utc": 1598650952.0,
                            "replies": [
                                {
                                    "body": "I think he is just trapped somewhere.",
                                    "author": null,
                                    "id": "g36j1ik",
                                    "parent_id": "t1_g36gtkr",
                                    "score": 2,
                                    "created_utc": 1598652093.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "To be fair, Naruto was on the brink of death.",
            "author": "autonomousfailure",
            "id": "g368flc",
            "parent_id": "t3_ii7xe1",
            "score": 3,
            "created_utc": 1598646797.0,
            "replies": []
        },
        {
            "body": "If Boruto touches Naruto or Sasuke it becomes filler in my books.",
            "author": "sonfoa",
            "id": "g37436r",
            "parent_id": "t3_ii7xe1",
            "score": 3,
            "created_utc": 1598663892.0,
            "replies": [
                {
                    "body": "*If Boruto touches*\n\n*Naruto or Sasuke it becomes*\n\n*Filler in my books.*\n\n\\- sonfoa\n\n---\n\n^(I detect haikus. And sometimes, successfully.) ^[Learn&#32;more&#32;about&#32;me.](https://www.reddit.com/r/haikusbot/)\n\n^(Opt out of replies: \"haikusbot opt out\" | Delete my comment: \"haikusbot delete\")",
                    "author": "haikusbot",
                    "id": "g3743z9",
                    "parent_id": "t1_g37436r",
                    "score": 3,
                    "created_utc": 1598663906.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Tsunade got the death kiss",
            "author": "Commofmedic",
            "id": "g379tzg",
            "parent_id": "t3_ii7xe1",
            "score": 3,
            "created_utc": 1598667344.0,
            "replies": []
        },
        {
            "body": "Technically Naruto has already died once since his heart stopped when his tailed beast was extracted out of him. The only reason why he lived was because of Sakura, Gaara and also the fact that he's the child of prophecy according to the very accurate Gamamaru. So you could consider Naruto now curse-free. Also, the fact that the necklace was destroyed during the Pain's Assault Arc may indicate that the curse was broken after the necklace was destroyed.",
            "author": "communistvigilante",
            "id": "g37klhe",
            "parent_id": "t3_ii7xe1",
            "score": 3,
            "created_utc": 1598674233.0,
            "replies": []
        },
        {
            "body": "Who dat boi on top panel?",
            "author": null,
            "id": "g35m8v5",
            "parent_id": "t3_ii7xe1",
            "score": 6,
            "created_utc": 1598636351.0,
            "replies": [
                {
                    "body": "Tsunade's younger brother, Nawaki",
                    "author": null,
                    "id": "g35obmt",
                    "parent_id": "t1_g35m8v5",
                    "score": 7,
                    "created_utc": 1598637327.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "If they kill Naruto I’m immediately dropping the anime and manga. Just no also same goes for Kakashi",
            "author": "Peng1GT",
            "id": "g360cg7",
            "parent_id": "t3_ii7xe1",
            "score": 4,
            "created_utc": 1598643029.0,
            "replies": [
                {
                    "body": "I think Kakashi is actually outliving everyone, including Naruto. Because that's kinda his whole character shtick, he outlives all his close friends and family except for Guy. He also hasn't experienced a student death yet either, and the one to hit the hardest would most likely be Naruto.\n\nFits the general tragedy that is his life, and I totally see the writers making Kakashi fill in for the 7th, like the 3rd did for the 4th. I eat up writing parallels like that, and make for the love of God please make Sarada Kakashi's pupil.",
                    "author": "ToniER",
                    "id": "g36hhi6",
                    "parent_id": "t1_g360cg7",
                    "score": 6,
                    "created_utc": 1598651293.0,
                    "replies": [
                        {
                            "body": "Kakashi’s my favorite so I really want him to die the least. I don’t love your idea because it includes Naruto dying but at the same time I do love it because you’re making the best of the situation if it does happen",
                            "author": "Peng1GT",
                            "id": "g36k0rp",
                            "parent_id": "t1_g36hhi6",
                            "score": 2,
                            "created_utc": 1598652602.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "This meme's gonna change a bit in about a month",
            "author": "Rezporga004",
            "id": "g35tagb",
            "parent_id": "t3_ii7xe1",
            "score": 2,
            "created_utc": 1598639695.0,
            "replies": []
        },
        {
            "body": "*REAPER DEATH SEAL! JUTSU!*",
            "author": "BeyondRealm",
            "id": "g35yy9s",
            "parent_id": "t3_ii7xe1",
            "score": 2,
            "created_utc": 1598642371.0,
            "replies": []
        },
        {
            "body": "Well, Naruto does not technically die. But it is similar. Sorry if I spoiled something",
            "author": "shopskasalata1",
            "id": "g35zlf3",
            "parent_id": "t3_ii7xe1",
            "score": 2,
            "created_utc": 1598642675.0,
            "replies": []
        },
        {
            "body": "*Forbidden Kiss*",
            "author": "norasthebest",
            "id": "g36cj2d",
            "parent_id": "t3_ii7xe1",
            "score": 2,
            "created_utc": 1598648750.0,
            "replies": []
        },
        {
            "body": "Legit: is boruto getting better or nah",
            "author": "LurkerPatrol",
            "id": "g36gett",
            "parent_id": "t3_ii7xe1",
            "score": 2,
            "created_utc": 1598650739.0,
            "replies": [
                {
                    "body": "Yes in the manga. The anime has not caught up to it yet.",
                    "author": null,
                    "id": "g36k7uw",
                    "parent_id": "t1_g36gett",
                    "score": 2,
                    "created_utc": 1598652704.0,
                    "replies": []
                },
                {
                    "body": "It's actually getting better but in Manga",
                    "author": "Abin5ur",
                    "id": "g36xedp",
                    "parent_id": "t1_g36gett",
                    "score": 1,
                    "created_utc": 1598659939.0,
                    "replies": []
                },
                {
                    "body": "Manga is fire as hell",
                    "author": "Yourboyfibs",
                    "id": "g37mkst",
                    "parent_id": "t1_g36gett",
                    "score": 1,
                    "created_utc": 1598675661.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Tsunade: the kiss of death",
            "author": "kaitlinnsc",
            "id": "g36guyv",
            "parent_id": "t3_ii7xe1",
            "score": 2,
            "created_utc": 1598650973.0,
            "replies": []
        },
        {
            "body": "Why can't he just get as old as the third hokage??",
            "author": "willy_boi125",
            "id": "g36lz1k",
            "parent_id": "t3_ii7xe1",
            "score": 2,
            "created_utc": 1598653619.0,
            "replies": []
        },
        {
            "body": "She never kissed Jiraiya’s ass but he still died, so its whatever",
            "author": "SleepyATT",
            "id": "g36nzui",
            "parent_id": "t3_ii7xe1",
            "score": 2,
            "created_utc": 1598654684.0,
            "replies": []
        },
        {
            "body": "Naruto got that plot armor he’s only gonna get sealed but my guy sasuke on the other hand, he’s gonna b the one that’s meets the woo",
            "author": "nromer",
            "id": "g36yzde",
            "parent_id": "t3_ii7xe1",
            "score": 2,
            "created_utc": 1598660879.0,
            "replies": []
        },
        {
            "body": "I think sasuke will die sadly",
            "author": "the-weird-fan",
            "id": "g373a3x",
            "parent_id": "t3_ii7xe1",
            "score": 2,
            "created_utc": 1598663414.0,
            "replies": [
                {
                    "body": "Yeah that's so sad that one of the person in the golden duo will die .",
                    "author": "Abin5ur",
                    "id": "g38hwdw",
                    "parent_id": "t1_g373a3x",
                    "score": 1,
                    "created_utc": 1598704938.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "He’s the main character no need to fucking worry",
            "author": "EmptyEmpathy1",
            "id": "g3786sz",
            "parent_id": "t3_ii7xe1",
            "score": 2,
            "created_utc": 1598666355.0,
            "replies": [
                {
                    "body": "Not anymore",
                    "author": "Yourboyfibs",
                    "id": "g37mluf",
                    "parent_id": "t1_g3786sz",
                    "score": 2,
                    "created_utc": 1598675683.0,
                    "replies": []
                },
                {
                    "body": "Yeah he does have the plot armour anymore",
                    "author": "Abin5ur",
                    "id": "g38hzm6",
                    "parent_id": "t1_g3786sz",
                    "score": 1,
                    "created_utc": 1598705004.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Naruto has to die in order for Boruto to gain any true notoriety.  They're in an age of peace so as long as Naruto's around they'll just rely on him again and again.  He has to go tragically and Boruto will have to pick up the pieces.  Whether that means death or Naruto fighting Sasuke for infinity nobody knows but the series is completely pointless if Boruto DOESN'T take his place in shinobi history.",
            "author": "fire_dragon_mamorn",
            "id": "g37fye9",
            "parent_id": "t3_ii7xe1",
            "score": 2,
            "created_utc": 1598671147.0,
            "replies": []
        },
        {
            "body": "But they didn’t have the show named after them",
            "author": "Narutosixpathssage1",
            "id": "g37g91n",
            "parent_id": "t3_ii7xe1",
            "score": 2,
            "created_utc": 1598671335.0,
            "replies": []
        },
        {
            "body": "Terio Shippuden",
            "author": "BigMoe52",
            "id": "g37gmhd",
            "parent_id": "t3_ii7xe1",
            "score": 2,
            "created_utc": 1598671572.0,
            "replies": []
        },
        {
            "body": "Tsunade's kiss of death",
            "author": "itzrely123",
            "id": "g37icgl",
            "parent_id": "t3_ii7xe1",
            "score": 2,
            "created_utc": 1598672701.0,
            "replies": []
        },
        {
            "body": "Oh hell dattebaNO",
            "author": "heyyassbutt",
            "id": "g37k4ra",
            "parent_id": "t3_ii7xe1",
            "score": 2,
            "created_utc": 1598673908.0,
            "replies": []
        },
        {
            "body": "imagine watching Boruto",
            "author": "Burnt_Ramen9",
            "id": "g37pedg",
            "parent_id": "t3_ii7xe1",
            "score": 2,
            "created_utc": 1598677757.0,
            "replies": []
        },
        {
            "body": "Honestly if this happens in Boruto I hope I’m caught up in the manga by then or it would probably hit me pretty hard if I just found out by someone spoiling it for me",
            "author": "Jackson_M_Bueller",
            "id": "g37uy67",
            "parent_id": "t3_ii7xe1",
            "score": 2,
            "created_utc": 1598682457.0,
            "replies": []
        },
        {
            "body": "Does anyone here follow the theory of zoonotic is minato namikaze is Mom",
            "author": "Sasuke_Uchiha1121",
            "id": "g38l1g8",
            "parent_id": "t3_ii7xe1",
            "score": 2,
            "created_utc": 1598707173.0,
            "replies": [
                {
                    "body": "Cuz that would make sense for the death because I luv u curse",
                    "author": "Sasuke_Uchiha1121",
                    "id": "g38l39k",
                    "parent_id": "t1_g38l1g8",
                    "score": 1,
                    "created_utc": 1598707205.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Tsunade kiss of death",
            "author": "RaDiOaCtIvE_rUsSiAn_",
            "id": "g38msqz",
            "parent_id": "t3_ii7xe1",
            "score": 2,
            "created_utc": 1598708333.0,
            "replies": []
        },
        {
            "body": "😂😂😂",
            "author": "SakuraIsTrash_69",
            "id": "g38nxb4",
            "parent_id": "t3_ii7xe1",
            "score": 2,
            "created_utc": 1598709064.0,
            "replies": [
                {
                    "body": "Dude you have used the forbidden language",
                    "author": "Abin5ur",
                    "id": "g39tu3j",
                    "parent_id": "t1_g38nxb4",
                    "score": 1,
                    "created_utc": 1598729629.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Boruto isn't canon :P :)",
            "author": "ObiWanKenobiDaily",
            "id": "g3afnrv",
            "parent_id": "t3_ii7xe1",
            "score": 2,
            "created_utc": 1598738470.0,
            "replies": [
                {
                    "body": "Yeah you can say that if that makes you happy",
                    "author": "Abin5ur",
                    "id": "g3ajzxh",
                    "parent_id": "t1_g3afnrv",
                    "score": 1,
                    "created_utc": 1598740444.0,
                    "replies": [
                        {
                            "body": "Yes, yes it does, and yes, yes I can :P :)",
                            "author": "ObiWanKenobiDaily",
                            "id": "g3akgai",
                            "parent_id": "t1_g3ajzxh",
                            "score": 2,
                            "created_utc": 1598740693.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Some one reposted this please do some copyright no jutsu or something",
            "author": null,
            "id": "g3ddd8o",
            "parent_id": "t3_ii7xe1",
            "score": 2,
            "created_utc": 1598806117.0,
            "replies": [
                {
                    "body": "Can you give link please",
                    "author": "Abin5ur",
                    "id": "g3fht4c",
                    "parent_id": "t1_g3ddd8o",
                    "score": 1,
                    "created_utc": 1598843756.0,
                    "replies": [
                        {
                            "body": "i dont remember but it was in the normal naruto subreddit",
                            "author": null,
                            "id": "g3gx0jg",
                            "parent_id": "t1_g3fht4c",
                            "score": 2,
                            "created_utc": 1598883885.0,
                            "replies": [
                                {
                                    "body": "Ok thanks",
                                    "author": "Abin5ur",
                                    "id": "g3h3dk9",
                                    "parent_id": "t1_g3gx0jg",
                                    "score": 1,
                                    "created_utc": 1598886404.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "The kiss of death",
            "author": "anime_weeb2110",
            "id": "g5x8qrh",
            "parent_id": "t3_ii7xe1",
            "score": 2,
            "created_utc": 1600574292.0,
            "replies": []
        },
        {
            "body": "Kiss of death",
            "author": "hellokotlinbye",
            "id": "g8zirmw",
            "parent_id": "t3_ii7xe1",
            "score": 2,
            "created_utc": 1602839723.0,
            "replies": []
        },
        {
            "body": "The kiss of death",
            "author": "Banppo",
            "id": "ga2nefg",
            "parent_id": "t3_ii7xe1",
            "score": 2,
            "created_utc": 1603645098.0,
            "replies": []
        },
        {
            "body": "reaper death kiss",
            "author": "kb10leo",
            "id": "gi8oewc",
            "parent_id": "t3_ii7xe1",
            "score": 2,
            "created_utc": 1609889409.0,
            "replies": []
        },
        {
            "body": "Atleast Don died a happy man, having Tsunade in her prime",
            "author": "Bene2403",
            "id": "g363qt9",
            "parent_id": "t3_ii7xe1",
            "score": 2,
            "created_utc": 1598644625.0,
            "replies": []
        },
        {
            "body": "He won’t die for a while we know he was still alive a little bit before kawaki and boruto fought because there was no 8th hokage face up",
            "author": "chuck4x",
            "id": "g5i6u0t",
            "parent_id": "t3_ii7xe1",
            "score": 1,
            "created_utc": 1600286320.0,
            "replies": []
        },
        {
            "body": "If we all dont watch Burrito the Naruto never dies. No one does except for those who did in part 1 and shippuden.",
            "author": "randominternetp3rs0n",
            "id": "g36h7bw",
            "parent_id": "t3_ii7xe1",
            "score": 1,
            "created_utc": 1598651149.0,
            "replies": [
                {
                    "body": "For that we should not have watched Shippuden",
                    "author": "Abin5ur",
                    "id": "g36xilq",
                    "parent_id": "t1_g36h7bw",
                    "score": 2,
                    "created_utc": 1598660007.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Sooooo Are we saying that if Naruto dies at any point a few decades after being kissed by Tsunade, it was caused by that kiss? Because he's not immortal, hes gonna die of old age sometime at least. Are people gonna then be like \"There it is! Tsunade made him die of old age 80 years after kissing him! She curses people!\"",
            "author": "TkOHarley",
            "id": "g36fqau",
            "parent_id": "t3_ii7xe1",
            "score": 0,
            "created_utc": 1598650387.0,
            "replies": [
                {
                    "body": "Don't take it too seriously, it's just supposed to be a joke. And well it's looking apparent in the latest chapters of Boruto that someone from the golden duo is gonna die a young death. Well in that episode too when she kissed him and gave the necklace it was said to have a curse to those who aren't the heir of the Senju clan. It's just foreshadowing in a funny way.",
                    "author": "Abin5ur",
                    "id": "g36xai4",
                    "parent_id": "t1_g36fqau",
                    "score": 0,
                    "created_utc": 1598659874.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "g35ry35",
            "parent_id": "t3_ii7xe1",
            "score": -3,
            "created_utc": 1598639053.0,
            "replies": [
                {
                    "body": "\"I'll send you where I sent the seventh Hokage\" could mean multiple things other than death. Especially with the different dimensions and time shenanigans.",
                    "author": "The96thPoet",
                    "id": "g35t3u2",
                    "parent_id": "t1_g35ry35",
                    "score": 7,
                    "created_utc": 1598639607.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "g35tj5j",
                            "parent_id": "t1_g35t3u2",
                            "score": 0,
                            "created_utc": 1598639809.0,
                            "replies": [
                                {
                                    "body": "I feel like if it was actually death, the wording would've been a lot more direct.",
                                    "author": "The96thPoet",
                                    "id": "g35vi3f",
                                    "parent_id": "t1_g35tj5j",
                                    "score": 2,
                                    "created_utc": 1598640735.0,
                                    "replies": [
                                        {
                                            "body": "I don’t think they’ll want to be too direct if it was death either, because it would spoil it and Naruto fans might drop the manga while only on its first panel.",
                                            "author": "claravelle-nazal",
                                            "id": "g3705ai",
                                            "parent_id": "t1_g35vi3f",
                                            "score": 1,
                                            "created_utc": 1598661569.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "R e p o s t ?",
            "author": "MAFPlayzXD",
            "id": "g383b42",
            "parent_id": "t3_ii7xe1",
            "score": 0,
            "created_utc": 1598690678.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "g36zaxe",
            "parent_id": "t3_ii7xe1",
            "score": -1,
            "created_utc": 1598661068.0,
            "replies": [
                {
                    "body": "I didn't find any posts that meet the matching requirements for r/dankruto. \n\nIt might be OC, it might not. Things such as JPEG artifacts and cropping may impact the results.\n\n *Feedback? Hate? Visit r/repostsleuthbot - I'm not perfect, but you can help. Report [ [False Negative](https://www.reddit.com/message/compose/?to=RepostSleuthBot&subject=False%20Negative&message={\"post_id\": \"ii7xe1\", \"meme_template\": 146987}) ]*",
                    "author": "RepostSleuthBot",
                    "id": "g36zexf",
                    "parent_id": "t1_g36zaxe",
                    "score": 2,
                    "created_utc": 1598661134.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "The necklace wasn't cursed it was Tsunade's love, look what happenned to Jiraiya, they may not have been romantically involved but you know she loved him.",
            "author": "itsnunyabusiness",
            "id": "g35fly0",
            "parent_id": "t1_g359bwc",
            "score": 402,
            "created_utc": 1598633252.0,
            "replies": []
        },
        {
            "body": "Nice catch.",
            "author": "manga_pages_by_me",
            "id": "g35a588",
            "parent_id": "t1_g359bwc",
            "score": 83,
            "created_utc": 1598630648.0,
            "replies": []
        },
        {
            "body": "[removed]",
            "author": null,
            "id": "g35sjbk",
            "parent_id": "t1_g359bwc",
            "score": 166,
            "created_utc": 1598639335.0,
            "replies": [
                {
                    "body": "Good story >>> fanservice with old characters.",
                    "author": null,
                    "id": "g35wc6k",
                    "parent_id": "t1_g35sjbk",
                    "score": 78,
                    "created_utc": 1598641132.0,
                    "replies": [
                        {
                            "body": "Hot take: Anything killing Naruto at this point is bad story. That boy big powerful and everytime they make a character randomly stronger than Shinobi Jesus it’s bad story.",
                            "author": "Xandril",
                            "id": "g36hl1w",
                            "parent_id": "t1_g35wc6k",
                            "score": 69,
                            "created_utc": 1598651345.0,
                            "replies": [
                                {
                                    "body": "I don't mind Boruto, but I hate when people say \"Sasuke or Naruto should be killed off to make it more interesting\" \n\nwhy can't the writers find a way to make Boruto interesting without killing an OG character?",
                                    "author": null,
                                    "id": "g36lv73",
                                    "parent_id": "t1_g36hl1w",
                                    "score": 48,
                                    "created_utc": 1598653563.0,
                                    "replies": [
                                        {
                                            "body": "Kill chocho",
                                            "author": "MoMoney224",
                                            "id": "g36ytxs",
                                            "parent_id": "t1_g36lv73",
                                            "score": 33,
                                            "created_utc": 1598660790.0,
                                            "replies": [
                                                {
                                                    "body": "I agree with this.",
                                                    "author": "Galan1234",
                                                    "id": "g37c19y",
                                                    "parent_id": "t1_g36ytxs",
                                                    "score": 11,
                                                    "created_utc": 1598668700.0,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "body": "Devils advocate here, because it's incredibly difficult to write a scenario where Godruto can't solve it for some reason. How do you have stakes in a series where one character basically can't fail? And if he does, it's because of some diablos ex machina, which is also bullshit.",
                                            "author": "TheHeadlessScholar",
                                            "id": "g37dq5p",
                                            "parent_id": "t1_g36lv73",
                                            "score": 8,
                                            "created_utc": 1598669752.0,
                                            "replies": [
                                                {
                                                    "body": "You could just have them sealed away or incapacitated",
                                                    "author": null,
                                                    "id": "g37fy0l",
                                                    "parent_id": "t1_g37dq5p",
                                                    "score": 4,
                                                    "created_utc": 1598671140.0,
                                                    "replies": []
                                                },
                                                {
                                                    "body": "Not really. The stakes don’t have to always be world, nation, or village level. It can be about character development. Just because Naruto and Sasuke are around doesn’t mean all (comparatively) minor conflicts across the world stop. \n\nThe writers are just convinced they need to keep themselves in the same box even tho that box has been examined very thoroughly. \n\nAlthough, if they really wanted to get rid of Naruto they should have used the groundwork Kishi already laid out in regards to Naruto’s healing factor. The didn’t reference it by name but Tsunade’s warning about relying on regeneration is the Hayflick Limit. It wouldn’t even be difficult to argue that even just the four tails state, let alone everything else in his life, would have drastically reduced his lifespan.",
                                                    "author": "Xandril",
                                                    "id": "g3ag7m9",
                                                    "parent_id": "t1_g37dq5p",
                                                    "score": 3,
                                                    "created_utc": 1598738726.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "Isshiki isn't just randomly stronger. He stands at the very top of the Ootsutsuki hierarchy.",
                                    "author": null,
                                    "id": "g37vo1x",
                                    "parent_id": "t1_g36hl1w",
                                    "score": 3,
                                    "created_utc": 1598683114.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "[removed]",
                            "author": null,
                            "id": "g35wf2w",
                            "parent_id": "t1_g35wc6k",
                            "score": 26,
                            "created_utc": 1598641169.0,
                            "replies": [
                                {
                                    "body": "It definitely don’t got any fan service....... wait",
                                    "author": "robomaster20",
                                    "id": "g35xbit",
                                    "parent_id": "t1_g35wf2w",
                                    "score": 10,
                                    "created_utc": 1598641596.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "An ok story with the old character fanservice would be super acceptable tho",
                            "author": "Phenoxx",
                            "id": "g36btjn",
                            "parent_id": "t1_g35wc6k",
                            "score": 9,
                            "created_utc": 1598648394.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Ah a man of culture. I've seen people talking about having both of them killed for \"character development\"",
                    "author": "HairyResponsibility9",
                    "id": "g35t6lt",
                    "parent_id": "t1_g35sjbk",
                    "score": 43,
                    "created_utc": 1598639644.0,
                    "replies": []
                },
                {
                    "body": "Killing Sasuke off would suck too.",
                    "author": "AtlasRafael",
                    "id": "g35zlm7",
                    "parent_id": "t1_g35sjbk",
                    "score": 24,
                    "created_utc": 1598642677.0,
                    "replies": [
                        {
                            "body": "Ye just imagine, took us 500 episodes to bring him back and now they kill him",
                            "author": "AGARAN24",
                            "id": "g36dh6i",
                            "parent_id": "t1_g35zlm7",
                            "score": 33,
                            "created_utc": 1598649235.0,
                            "replies": [
                                {
                                    "body": "He’s probably the most complex and developed character. Most unique Shinzo I left as well. Would straight up suck considering he’s got so many hax abilities and is super OP killing him would just be for the plot.",
                                    "author": "AtlasRafael",
                                    "id": "g36dou0",
                                    "parent_id": "t1_g36dh6i",
                                    "score": 18,
                                    "created_utc": 1598649344.0,
                                    "replies": [
                                        {
                                            "body": "I don't feel like Kishimoto knew exactly what he wanted to do with Sasuke after his final fight with Naruto. Sasuke stopped having a precise goal. So it just became protecting Konoha from the shadows. Now his role is to be Boruto's teacher. \n\nI guess it would be a good ending for Sasuke to sacrifice himself for the village. But imo, his death is not necessary to give Boruto and Sarada development. His relationship with Boruto hasn't even been developed much.",
                                            "author": null,
                                            "id": "g36kw0i",
                                            "parent_id": "t1_g36dou0",
                                            "score": 10,
                                            "created_utc": 1598653051.0,
                                            "replies": [
                                                {
                                                    "body": "Well, he’s still the villages hidden guardian though. He’s basically a Navy Seal team. \n\nI don’t think either have to die. It would be lame in my opinion. They are definitely too powerful for any new villains, but they could have deteriorated from the Rinnegan or Narutos sage of sixth paths mode. Since there’s not much known of their extended use within humans. Just a way to make them weaker so Boruto and the rest can shine without killing those two.",
                                                    "author": "AtlasRafael",
                                                    "id": "g36vxi5",
                                                    "parent_id": "t1_g36kw0i",
                                                    "score": 6,
                                                    "created_utc": 1598659082.0,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "body": "He should have died in Shippuden, now who cares if he dies or not.",
                                            "author": "thedoorsrebel",
                                            "id": "g36lva9",
                                            "parent_id": "t1_g36dou0",
                                            "score": -6,
                                            "created_utc": 1598653564.0,
                                            "replies": [
                                                {
                                                    "body": "I don't know. Maybe the people who liked him as a character? After all, he was the co-protagonist. Naruto's rival. He has fans too. Just because you didn't like him doesn't mean others don't. \n\nAdult Sasuke is cool. 🤷",
                                                    "author": null,
                                                    "id": "g36m3xb",
                                                    "parent_id": "t1_g36lva9",
                                                    "score": 9,
                                                    "created_utc": 1598653691.0,
                                                    "replies": []
                                                },
                                                {
                                                    "body": "But that’s the easy way. Killing him is simple. Writing his redemption and changing him into a likeable character who has evolved is more difficult and interesting. If he dies he’s dead. Fin. \n\nHe was one of the most interesting and rounded characters in the series.",
                                                    "author": "AtlasRafael",
                                                    "id": "g36w265",
                                                    "parent_id": "t1_g36lva9",
                                                    "score": 3,
                                                    "created_utc": 1598659157.0,
                                                    "replies": [
                                                        {
                                                            "body": "Nah to me he was just an entitled brat. He ruined the series for me. You know when I rewatched it I had to stop when the kaguya's fight is over because I know after that the shitty bastard will pull that shit after everything that has happened, threatening the kages, the bijuus. I hate him. He should have died. Now I don't care what he does. It doesn't matter anymore. His time has passed.",
                                                            "author": "thedoorsrebel",
                                                            "id": "g36xo4c",
                                                            "parent_id": "t1_g36w265",
                                                            "score": 1,
                                                            "created_utc": 1598660097.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Entitled brat? Lol do you not know what happened? He’s not entitled at all. \n\nI used to hate him, but he became on of my favorite characters.",
                                                                    "author": "AtlasRafael",
                                                                    "id": "g3749uj",
                                                                    "parent_id": "t1_g36xo4c",
                                                                    "score": 3,
                                                                    "created_utc": 1598664003.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "I could explain a detailed list of why he's. You wouldn't agree because you know all the events I would put in that list but your perception of them was different. We would discuss this in several comments and nobody would change their minds about it. Instead of that, I would save both of us the trouble saying \"agree to disagree\" and move on.",
                                                                            "author": "thedoorsrebel",
                                                                            "id": "g374irq",
                                                                            "parent_id": "t1_g3749uj",
                                                                            "score": 1,
                                                                            "created_utc": 1598664150.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "Fair enough my dude. Not trynna change your mind really. Just sharing my opinion lol.",
                                                                                    "author": "AtlasRafael",
                                                                                    "id": "g37bkdx",
                                                                                    "parent_id": "t1_g374irq",
                                                                                    "score": 1,
                                                                                    "created_utc": 1598668411.0,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "body": "> He ruined the series for me \n\nsad",
                                                                    "author": null,
                                                                    "id": "g36y6kc",
                                                                    "parent_id": "t1_g36xo4c",
                                                                    "score": 2,
                                                                    "created_utc": 1598660402.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "The manga is pretty good in my opinion. Not naruto good, but I'd say boruto manga is better than naruto filler at the very least. I get that people don't like him having tons of power for no reason, but it makes sense for him. Think of the uchiha. They were naturally gifted because of their clan. They had to train yo build up on that, but boruto is kinda the same way. When you also consider that naruto is ashura's reincarnate, making naruto pretty much pure senju, and hinata is main branch hyuga, it makes sense for him to be naturally gifted. Momoshiki said something about the otsutsuki blood being strong in boruto. That's likely a result of his senju blood (son of ashura's reincarnate) and his hyuga blood (son of hinata. Main branch hyuga). Im really just basing the hyuga thing off of otsutsuki typically having byakugan. Even if that weren't important, what is important is that boruto is strong because at the very least he has what could be considered \"main branch\" senju blood, main branch hyuga blood, and the karma.",
                    "author": "Schumeschu",
                    "id": "g36rbcx",
                    "parent_id": "t1_g35sjbk",
                    "score": 5,
                    "created_utc": 1598656498.0,
                    "replies": [
                        {
                            "body": "[removed]",
                            "author": null,
                            "id": "g3704hn",
                            "parent_id": "t1_g36rbcx",
                            "score": 2,
                            "created_utc": 1598661556.0,
                            "replies": [
                                {
                                    "body": "The manga and anime are almost entirely different. The manga started out pretty bad but gradually got better over time, to the point where I can look forward to new chapters each month. To be honest, it really only starts getting good when >!Kawaki is finally introduced!< and before that it’s very much just either bad or meh, especially since the first arc is just the movie again. Compared to the anime though, it’s a million times better than the anime.",
                                    "author": "thatguy-66",
                                    "id": "g37e5m2",
                                    "parent_id": "t1_g3704hn",
                                    "score": 2,
                                    "created_utc": 1598670024.0,
                                    "replies": []
                                },
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "g377f8l",
                                    "parent_id": "t1_g3704hn",
                                    "score": 0,
                                    "created_utc": 1598665897.0,
                                    "replies": [
                                        {
                                            "body": "[removed]",
                                            "author": null,
                                            "id": "g378xbu",
                                            "parent_id": "t1_g377f8l",
                                            "score": 0,
                                            "created_utc": 1598666792.0,
                                            "replies": [
                                                {
                                                    "body": "[deleted]",
                                                    "author": null,
                                                    "id": "g37bh0p",
                                                    "parent_id": "t1_g378xbu",
                                                    "score": 0,
                                                    "created_utc": 1598668354.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "The anime has been 99% filler. It's garbage. The manga is the picture of a big Mac and the anime is what you get. His power feels pretty earned from the manga imo. I get that it doesn't matter to you, but I feel like I've heard the argument once or twice . The manga is also decently paced. Think about og naruto. In the manga, naruto leaves with jiraya immediately after sasuke leaves. In the anime there are another 100 episodes. Boruto is pretty much the same way. Idk what else to say without spoiling it, but I just want people to stop hating on boruto so hard. It isnt naruto part one. Far from it. But its pretty good in its own right, and I can't wait for the anime to be finished so I can watch the manga cut of it start to finish.",
                                    "author": "Schumeschu",
                                    "id": "g370xlp",
                                    "parent_id": "t1_g3704hn",
                                    "score": -1,
                                    "created_utc": 1598662031.0,
                                    "replies": [
                                        {
                                            "body": "I don't think you understand what filler is.",
                                            "author": null,
                                            "id": "g37cjng",
                                            "parent_id": "t1_g370xlp",
                                            "score": 1,
                                            "created_utc": 1598669015.0,
                                            "replies": [
                                                {
                                                    "body": "I understand what it is. Basically just them waiting for the manga to progress enough content to incorporate it into the anime, while still producing  episodes of the anime. That said I think it's fucking stupid",
                                                    "author": "Schumeschu",
                                                    "id": "g37dda5",
                                                    "parent_id": "t1_g37cjng",
                                                    "score": 0,
                                                    "created_utc": 1598669526.0,
                                                    "replies": [
                                                        {
                                                            "body": "At least acknowledge the fact that you made a mistake in ur paragraph and just edited it..",
                                                            "author": null,
                                                            "id": "g3b8ybk",
                                                            "parent_id": "t1_g37dda5",
                                                            "score": 1,
                                                            "created_utc": 1598753941.0,
                                                            "replies": [
                                                                {
                                                                    "body": "I wrote manga instead of anime in a context where I was clearly talking about anime. No reason to specify",
                                                                    "author": "Schumeschu",
                                                                    "id": "g3b9ea3",
                                                                    "parent_id": "t1_g3b8ybk",
                                                                    "score": 0,
                                                                    "created_utc": 1598754204.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "body": "[removed]",
                                            "author": null,
                                            "id": "g371ow9",
                                            "parent_id": "t1_g370xlp",
                                            "score": 0,
                                            "created_utc": 1598662480.0,
                                            "replies": [
                                                {
                                                    "body": "Absolutely. But I dont feel like it does many of the old characters dirty.",
                                                    "author": "Schumeschu",
                                                    "id": "g3721n4",
                                                    "parent_id": "t1_g371ow9",
                                                    "score": 1,
                                                    "created_utc": 1598662688.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Nah Sasuke won’t die, at least for awhile. He’s taking a more active role in the manga.......oh wait......\n\nNO",
                    "author": "AngonceMcGhee",
                    "id": "g35y70p",
                    "parent_id": "t1_g35sjbk",
                    "score": 10,
                    "created_utc": 1598642013.0,
                    "replies": []
                },
                {
                    "body": "nah nah, I think he actually does die eventually in the series. I've only watched the boruto movie and the first episode of boruto, but the first episode opened with this dude fighting boruto and saying to him \"I'm gonna send you to the place I sent your father\" while battling on the leaf villages destroyed remains. so it's pretty safe to assume Naruto does die along with the destruction of the village.",
                    "author": "shupaoasado",
                    "id": "g37liji",
                    "parent_id": "t1_g35sjbk",
                    "score": 1,
                    "created_utc": 1598674883.0,
                    "replies": []
                },
                {
                    "body": "Did you read the manga?",
                    "author": "Yourboyfibs",
                    "id": "g37moyt",
                    "parent_id": "t1_g35sjbk",
                    "score": 1,
                    "created_utc": 1598675748.0,
                    "replies": []
                },
                {
                    "body": "The manga is super dank",
                    "author": "Zoulf",
                    "id": "g36ai3u",
                    "parent_id": "t1_g35sjbk",
                    "score": 1,
                    "created_utc": 1598647810.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Actually I never thought of that. You are actually right. He died when beast was extracted from him",
            "author": "Abin5ur",
            "id": "g35won2",
            "parent_id": "t1_g35aicn",
            "score": 77,
            "created_utc": 1598641293.0,
            "replies": [
                {
                    "body": "then Kurama came back and he was alive 10x more OP",
                    "author": "Cyber1969",
                    "id": "g365wd3",
                    "parent_id": "t1_g35won2",
                    "score": 34,
                    "created_utc": 1598645572.0,
                    "replies": [
                        {
                            "body": "Ah yes. Plot Armour",
                            "author": "MoogleSan",
                            "id": "g36b24k",
                            "parent_id": "t1_g365wd3",
                            "score": 26,
                            "created_utc": 1598648085.0,
                            "replies": []
                        },
                        {
                            "body": "But because of that Naruto is suffering from a deadly disease that Hagoromo also suffered",
                            "author": "Abin5ur",
                            "id": "g36a1lz",
                            "parent_id": "t1_g365wd3",
                            "score": 14,
                            "created_utc": 1598647587.0,
                            "replies": [
                                {
                                    "body": "Really what disease?",
                                    "author": "orbter",
                                    "id": "g36gy92",
                                    "parent_id": "t1_g36a1lz",
                                    "score": 10,
                                    "created_utc": 1598651020.0,
                                    "replies": [
                                        {
                                            "body": "Ligma",
                                            "author": "randominternetp3rs0n",
                                            "id": "g36hahu",
                                            "parent_id": "t1_g36gy92",
                                            "score": 45,
                                            "created_utc": 1598651194.0,
                                            "replies": [
                                                {
                                                    "body": "Wow man you are so funny",
                                                    "author": "orbter",
                                                    "id": "g36hmr7",
                                                    "parent_id": "t1_g36hahu",
                                                    "score": 4,
                                                    "created_utc": 1598651369.0,
                                                    "replies": [
                                                        {
                                                            "body": "be honest that was good",
                                                            "author": "BiggieSmalls0",
                                                            "id": "g36ibh8",
                                                            "parent_id": "t1_g36hmr7",
                                                            "score": 23,
                                                            "created_utc": 1598651723.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "body": "Well it's not specified yet but it is said in a light novel of Boruto that he is suffering from a deadly disease which is caused due to being a Jinchuriki of a partial 10 tails which can only be cured by the dust of a certain meteor that falls every century or something.",
                                            "author": "Abin5ur",
                                            "id": "g36wt53",
                                            "parent_id": "t1_g36gy92",
                                            "score": 3,
                                            "created_utc": 1598659590.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "From Mrs. GoldMember",
            "author": "PlsDontPls",
            "id": "g3665qx",
            "parent_id": "t1_g35jfrh",
            "score": 7,
            "created_utc": 1598645698.0,
            "replies": []
        },
        {
            "body": "On his TenTen",
            "author": "LurkerPatrol",
            "id": "g36g9yw",
            "parent_id": "t1_g35vj81",
            "score": 10,
            "created_utc": 1598650670.0,
            "replies": [
                {
                    "body": "*TonTon",
                    "author": "lavendiere",
                    "id": "g37m9tg",
                    "parent_id": "t1_g36g9yw",
                    "score": 3,
                    "created_utc": 1598675437.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "hopefully more",
            "author": "shreckforeverafter",
            "id": "g37hnpm",
            "parent_id": "t1_g35vj81",
            "score": 1,
            "created_utc": 1598672245.0,
            "replies": []
        },
        {
            "body": "This is the comment I was looking for",
            "author": "Dxuian",
            "id": "g35xfqp",
            "parent_id": "t1_g35s9tm",
            "score": 5,
            "created_utc": 1598641651.0,
            "replies": []
        },
        {
            "body": "I pointed this out once and got downvoted to all hell lol",
            "author": "Commofmedic",
            "id": "g379yxk",
            "parent_id": "t1_g35s9tm",
            "score": 2,
            "created_utc": 1598667427.0,
            "replies": []
        },
        {
            "body": "KISHIMOTO DOESN'T WRITE BORUTO",
            "author": "LordPos",
            "id": "g35antf",
            "parent_id": "t1_g358dih",
            "score": 36,
            "created_utc": 1598630900.0,
            "replies": [
                {
                    "body": "i mean ikemoto not kishimoto lol",
                    "author": "Kitsuneuser_67",
                    "id": "g35ik7o",
                    "parent_id": "t1_g35antf",
                    "score": 20,
                    "created_utc": 1598634622.0,
                    "replies": [
                        {
                            "body": "Kishimoto gave all the rights to kill the characters.",
                            "author": null,
                            "id": "g36b1lv",
                            "parent_id": "t1_g35ik7o",
                            "score": 4,
                            "created_utc": 1598648078.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "alright",
                    "author": "Kitsuneuser_67",
                    "id": "g35ipdk",
                    "parent_id": "t1_g35antf",
                    "score": 13,
                    "created_utc": 1598634688.0,
                    "replies": [
                        {
                            "body": "What?",
                            "author": "Kazewatch",
                            "id": "g366lww",
                            "parent_id": "t1_g35ipdk",
                            "score": 2,
                            "created_utc": 1598645916.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "this comment and reply section makes no sense-",
            "author": "Kitsuneuser_67",
            "id": "g36bz09",
            "parent_id": "t1_g358dih",
            "score": 1,
            "created_utc": 1598648469.0,
            "replies": []
        },
        {
            "body": "worse…",
            "author": "shreckforeverafter",
            "id": "g37hoye",
            "parent_id": "t1_g35xrgu",
            "score": 2,
            "created_utc": 1598672268.0,
            "replies": []
        },
        {
            "body": "That’s something I haven’t thought of yet and I fuck wit that theory.",
            "author": "Zoulf",
            "id": "g36atb2",
            "parent_id": "t1_g35td8t",
            "score": 3,
            "created_utc": 1598647963.0,
            "replies": []
        },
        {
            "body": "No, Boruto loses control of his Borushiki mode and like Sasuke promised he will try to kill Boruto. He tries and fails, only leaving the scar on Boruto’s eye and Boruto kills Sasuke off.",
            "author": "Yourboyfibs",
            "id": "g37mi5f",
            "parent_id": "t1_g35td8t",
            "score": 1,
            "created_utc": 1598675607.0,
            "replies": [
                {
                    "body": "I mean you basically said what I said but with more detail and without the sarada ms and that boruto kills sauske and that naruto uses Rinne rebirth but ok I like your theory",
                    "author": "Stayhighuchina_7",
                    "id": "g37mmtg",
                    "parent_id": "t1_g37mi5f",
                    "score": 1,
                    "created_utc": 1598675703.0,
                    "replies": [
                        {
                            "body": "I like your theory as well",
                            "author": "Yourboyfibs",
                            "id": "g37omlj",
                            "parent_id": "t1_g37mmtg",
                            "score": 2,
                            "created_utc": 1598677165.0,
                            "replies": [
                                {
                                    "body": "Thanks",
                                    "author": "Stayhighuchina_7",
                                    "id": "g37onm3",
                                    "parent_id": "t1_g37omlj",
                                    "score": 1,
                                    "created_utc": 1598677188.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I mean, who wouldn’t?",
            "author": "Seppel420",
            "id": "g35qkxp",
            "parent_id": "t1_g35dimt",
            "score": 7,
            "created_utc": 1598638399.0,
            "replies": [
                {
                    "body": "Perhaps he was thinking of titfucking his sister in the afterlife",
                    "author": "NTReatsmysoul",
                    "id": "g35skki",
                    "parent_id": "t1_g35qkxp",
                    "score": 4,
                    "created_utc": 1598639352.0,
                    "replies": [
                        {
                            "body": "r/cursedcomments",
                            "author": "Abin5ur",
                            "id": "g35ws3b",
                            "parent_id": "t1_g35skki",
                            "score": 4,
                            "created_utc": 1598641338.0,
                            "replies": []
                        },
                        {
                            "body": "Wait what now",
                            "author": "RiceBoiz29",
                            "id": "g35yxhm",
                            "parent_id": "t1_g35skki",
                            "score": 1,
                            "created_utc": 1598642360.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I don't believe they have the balls to kill Naruto off. It makes more sense to kill Sasuke because Sasuke is trying to make up for his past and he has spent the rest of his life trying to protect the village. So I think it would be a good ending for him to die protecting the village.",
            "author": null,
            "id": "g36g71h",
            "parent_id": "t1_g364f9l",
            "score": -1,
            "created_utc": 1598650629.0,
            "replies": [
                {
                    "body": "Naruto is apparently dead in the time jump.",
                    "author": "Summerclaw",
                    "id": "g36gtkr",
                    "parent_id": "t1_g36g71h",
                    "score": 0,
                    "created_utc": 1598650952.0,
                    "replies": [
                        {
                            "body": "I think he is just trapped somewhere.",
                            "author": null,
                            "id": "g36j1ik",
                            "parent_id": "t1_g36gtkr",
                            "score": 2,
                            "created_utc": 1598652093.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "*If Boruto touches*\n\n*Naruto or Sasuke it becomes*\n\n*Filler in my books.*\n\n\\- sonfoa\n\n---\n\n^(I detect haikus. And sometimes, successfully.) ^[Learn&#32;more&#32;about&#32;me.](https://www.reddit.com/r/haikusbot/)\n\n^(Opt out of replies: \"haikusbot opt out\" | Delete my comment: \"haikusbot delete\")",
            "author": "haikusbot",
            "id": "g3743z9",
            "parent_id": "t1_g37436r",
            "score": 3,
            "created_utc": 1598663906.0,
            "replies": []
        },
        {
            "body": "Tsunade's younger brother, Nawaki",
            "author": null,
            "id": "g35obmt",
            "parent_id": "t1_g35m8v5",
            "score": 7,
            "created_utc": 1598637327.0,
            "replies": []
        },
        {
            "body": "I think Kakashi is actually outliving everyone, including Naruto. Because that's kinda his whole character shtick, he outlives all his close friends and family except for Guy. He also hasn't experienced a student death yet either, and the one to hit the hardest would most likely be Naruto.\n\nFits the general tragedy that is his life, and I totally see the writers making Kakashi fill in for the 7th, like the 3rd did for the 4th. I eat up writing parallels like that, and make for the love of God please make Sarada Kakashi's pupil.",
            "author": "ToniER",
            "id": "g36hhi6",
            "parent_id": "t1_g360cg7",
            "score": 6,
            "created_utc": 1598651293.0,
            "replies": [
                {
                    "body": "Kakashi’s my favorite so I really want him to die the least. I don’t love your idea because it includes Naruto dying but at the same time I do love it because you’re making the best of the situation if it does happen",
                    "author": "Peng1GT",
                    "id": "g36k0rp",
                    "parent_id": "t1_g36hhi6",
                    "score": 2,
                    "created_utc": 1598652602.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Yes in the manga. The anime has not caught up to it yet.",
            "author": null,
            "id": "g36k7uw",
            "parent_id": "t1_g36gett",
            "score": 2,
            "created_utc": 1598652704.0,
            "replies": []
        },
        {
            "body": "It's actually getting better but in Manga",
            "author": "Abin5ur",
            "id": "g36xedp",
            "parent_id": "t1_g36gett",
            "score": 1,
            "created_utc": 1598659939.0,
            "replies": []
        },
        {
            "body": "Manga is fire as hell",
            "author": "Yourboyfibs",
            "id": "g37mkst",
            "parent_id": "t1_g36gett",
            "score": 1,
            "created_utc": 1598675661.0,
            "replies": []
        },
        {
            "body": "Yeah that's so sad that one of the person in the golden duo will die .",
            "author": "Abin5ur",
            "id": "g38hwdw",
            "parent_id": "t1_g373a3x",
            "score": 1,
            "created_utc": 1598704938.0,
            "replies": []
        },
        {
            "body": "Not anymore",
            "author": "Yourboyfibs",
            "id": "g37mluf",
            "parent_id": "t1_g3786sz",
            "score": 2,
            "created_utc": 1598675683.0,
            "replies": []
        },
        {
            "body": "Yeah he does have the plot armour anymore",
            "author": "Abin5ur",
            "id": "g38hzm6",
            "parent_id": "t1_g3786sz",
            "score": 1,
            "created_utc": 1598705004.0,
            "replies": []
        },
        {
            "body": "Cuz that would make sense for the death because I luv u curse",
            "author": "Sasuke_Uchiha1121",
            "id": "g38l39k",
            "parent_id": "t1_g38l1g8",
            "score": 1,
            "created_utc": 1598707205.0,
            "replies": []
        },
        {
            "body": "Dude you have used the forbidden language",
            "author": "Abin5ur",
            "id": "g39tu3j",
            "parent_id": "t1_g38nxb4",
            "score": 1,
            "created_utc": 1598729629.0,
            "replies": []
        },
        {
            "body": "Yeah you can say that if that makes you happy",
            "author": "Abin5ur",
            "id": "g3ajzxh",
            "parent_id": "t1_g3afnrv",
            "score": 1,
            "created_utc": 1598740444.0,
            "replies": [
                {
                    "body": "Yes, yes it does, and yes, yes I can :P :)",
                    "author": "ObiWanKenobiDaily",
                    "id": "g3akgai",
                    "parent_id": "t1_g3ajzxh",
                    "score": 2,
                    "created_utc": 1598740693.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Can you give link please",
            "author": "Abin5ur",
            "id": "g3fht4c",
            "parent_id": "t1_g3ddd8o",
            "score": 1,
            "created_utc": 1598843756.0,
            "replies": [
                {
                    "body": "i dont remember but it was in the normal naruto subreddit",
                    "author": null,
                    "id": "g3gx0jg",
                    "parent_id": "t1_g3fht4c",
                    "score": 2,
                    "created_utc": 1598883885.0,
                    "replies": [
                        {
                            "body": "Ok thanks",
                            "author": "Abin5ur",
                            "id": "g3h3dk9",
                            "parent_id": "t1_g3gx0jg",
                            "score": 1,
                            "created_utc": 1598886404.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "For that we should not have watched Shippuden",
            "author": "Abin5ur",
            "id": "g36xilq",
            "parent_id": "t1_g36h7bw",
            "score": 2,
            "created_utc": 1598660007.0,
            "replies": []
        },
        {
            "body": "Don't take it too seriously, it's just supposed to be a joke. And well it's looking apparent in the latest chapters of Boruto that someone from the golden duo is gonna die a young death. Well in that episode too when she kissed him and gave the necklace it was said to have a curse to those who aren't the heir of the Senju clan. It's just foreshadowing in a funny way.",
            "author": "Abin5ur",
            "id": "g36xai4",
            "parent_id": "t1_g36fqau",
            "score": 0,
            "created_utc": 1598659874.0,
            "replies": []
        },
        {
            "body": "\"I'll send you where I sent the seventh Hokage\" could mean multiple things other than death. Especially with the different dimensions and time shenanigans.",
            "author": "The96thPoet",
            "id": "g35t3u2",
            "parent_id": "t1_g35ry35",
            "score": 7,
            "created_utc": 1598639607.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "g35tj5j",
                    "parent_id": "t1_g35t3u2",
                    "score": 0,
                    "created_utc": 1598639809.0,
                    "replies": [
                        {
                            "body": "I feel like if it was actually death, the wording would've been a lot more direct.",
                            "author": "The96thPoet",
                            "id": "g35vi3f",
                            "parent_id": "t1_g35tj5j",
                            "score": 2,
                            "created_utc": 1598640735.0,
                            "replies": [
                                {
                                    "body": "I don’t think they’ll want to be too direct if it was death either, because it would spoil it and Naruto fans might drop the manga while only on its first panel.",
                                    "author": "claravelle-nazal",
                                    "id": "g3705ai",
                                    "parent_id": "t1_g35vi3f",
                                    "score": 1,
                                    "created_utc": 1598661569.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I didn't find any posts that meet the matching requirements for r/dankruto. \n\nIt might be OC, it might not. Things such as JPEG artifacts and cropping may impact the results.\n\n *Feedback? Hate? Visit r/repostsleuthbot - I'm not perfect, but you can help. Report [ [False Negative](https://www.reddit.com/message/compose/?to=RepostSleuthBot&subject=False%20Negative&message={\"post_id\": \"ii7xe1\", \"meme_template\": 146987}) ]*",
            "author": "RepostSleuthBot",
            "id": "g36zexf",
            "parent_id": "t1_g36zaxe",
            "score": 2,
            "created_utc": 1598661134.0,
            "replies": []
        },
        {
            "body": "Good story >>> fanservice with old characters.",
            "author": null,
            "id": "g35wc6k",
            "parent_id": "t1_g35sjbk",
            "score": 78,
            "created_utc": 1598641132.0,
            "replies": [
                {
                    "body": "Hot take: Anything killing Naruto at this point is bad story. That boy big powerful and everytime they make a character randomly stronger than Shinobi Jesus it’s bad story.",
                    "author": "Xandril",
                    "id": "g36hl1w",
                    "parent_id": "t1_g35wc6k",
                    "score": 69,
                    "created_utc": 1598651345.0,
                    "replies": [
                        {
                            "body": "I don't mind Boruto, but I hate when people say \"Sasuke or Naruto should be killed off to make it more interesting\" \n\nwhy can't the writers find a way to make Boruto interesting without killing an OG character?",
                            "author": null,
                            "id": "g36lv73",
                            "parent_id": "t1_g36hl1w",
                            "score": 48,
                            "created_utc": 1598653563.0,
                            "replies": [
                                {
                                    "body": "Kill chocho",
                                    "author": "MoMoney224",
                                    "id": "g36ytxs",
                                    "parent_id": "t1_g36lv73",
                                    "score": 33,
                                    "created_utc": 1598660790.0,
                                    "replies": [
                                        {
                                            "body": "I agree with this.",
                                            "author": "Galan1234",
                                            "id": "g37c19y",
                                            "parent_id": "t1_g36ytxs",
                                            "score": 11,
                                            "created_utc": 1598668700.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "Devils advocate here, because it's incredibly difficult to write a scenario where Godruto can't solve it for some reason. How do you have stakes in a series where one character basically can't fail? And if he does, it's because of some diablos ex machina, which is also bullshit.",
                                    "author": "TheHeadlessScholar",
                                    "id": "g37dq5p",
                                    "parent_id": "t1_g36lv73",
                                    "score": 8,
                                    "created_utc": 1598669752.0,
                                    "replies": [
                                        {
                                            "body": "You could just have them sealed away or incapacitated",
                                            "author": null,
                                            "id": "g37fy0l",
                                            "parent_id": "t1_g37dq5p",
                                            "score": 4,
                                            "created_utc": 1598671140.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "Not really. The stakes don’t have to always be world, nation, or village level. It can be about character development. Just because Naruto and Sasuke are around doesn’t mean all (comparatively) minor conflicts across the world stop. \n\nThe writers are just convinced they need to keep themselves in the same box even tho that box has been examined very thoroughly. \n\nAlthough, if they really wanted to get rid of Naruto they should have used the groundwork Kishi already laid out in regards to Naruto’s healing factor. The didn’t reference it by name but Tsunade’s warning about relying on regeneration is the Hayflick Limit. It wouldn’t even be difficult to argue that even just the four tails state, let alone everything else in his life, would have drastically reduced his lifespan.",
                                            "author": "Xandril",
                                            "id": "g3ag7m9",
                                            "parent_id": "t1_g37dq5p",
                                            "score": 3,
                                            "created_utc": 1598738726.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "Isshiki isn't just randomly stronger. He stands at the very top of the Ootsutsuki hierarchy.",
                            "author": null,
                            "id": "g37vo1x",
                            "parent_id": "t1_g36hl1w",
                            "score": 3,
                            "created_utc": 1598683114.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "[removed]",
                    "author": null,
                    "id": "g35wf2w",
                    "parent_id": "t1_g35wc6k",
                    "score": 26,
                    "created_utc": 1598641169.0,
                    "replies": [
                        {
                            "body": "It definitely don’t got any fan service....... wait",
                            "author": "robomaster20",
                            "id": "g35xbit",
                            "parent_id": "t1_g35wf2w",
                            "score": 10,
                            "created_utc": 1598641596.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "An ok story with the old character fanservice would be super acceptable tho",
                    "author": "Phenoxx",
                    "id": "g36btjn",
                    "parent_id": "t1_g35wc6k",
                    "score": 9,
                    "created_utc": 1598648394.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Ah a man of culture. I've seen people talking about having both of them killed for \"character development\"",
            "author": "HairyResponsibility9",
            "id": "g35t6lt",
            "parent_id": "t1_g35sjbk",
            "score": 43,
            "created_utc": 1598639644.0,
            "replies": []
        },
        {
            "body": "Killing Sasuke off would suck too.",
            "author": "AtlasRafael",
            "id": "g35zlm7",
            "parent_id": "t1_g35sjbk",
            "score": 24,
            "created_utc": 1598642677.0,
            "replies": [
                {
                    "body": "Ye just imagine, took us 500 episodes to bring him back and now they kill him",
                    "author": "AGARAN24",
                    "id": "g36dh6i",
                    "parent_id": "t1_g35zlm7",
                    "score": 33,
                    "created_utc": 1598649235.0,
                    "replies": [
                        {
                            "body": "He’s probably the most complex and developed character. Most unique Shinzo I left as well. Would straight up suck considering he’s got so many hax abilities and is super OP killing him would just be for the plot.",
                            "author": "AtlasRafael",
                            "id": "g36dou0",
                            "parent_id": "t1_g36dh6i",
                            "score": 18,
                            "created_utc": 1598649344.0,
                            "replies": [
                                {
                                    "body": "I don't feel like Kishimoto knew exactly what he wanted to do with Sasuke after his final fight with Naruto. Sasuke stopped having a precise goal. So it just became protecting Konoha from the shadows. Now his role is to be Boruto's teacher. \n\nI guess it would be a good ending for Sasuke to sacrifice himself for the village. But imo, his death is not necessary to give Boruto and Sarada development. His relationship with Boruto hasn't even been developed much.",
                                    "author": null,
                                    "id": "g36kw0i",
                                    "parent_id": "t1_g36dou0",
                                    "score": 10,
                                    "created_utc": 1598653051.0,
                                    "replies": [
                                        {
                                            "body": "Well, he’s still the villages hidden guardian though. He’s basically a Navy Seal team. \n\nI don’t think either have to die. It would be lame in my opinion. They are definitely too powerful for any new villains, but they could have deteriorated from the Rinnegan or Narutos sage of sixth paths mode. Since there’s not much known of their extended use within humans. Just a way to make them weaker so Boruto and the rest can shine without killing those two.",
                                            "author": "AtlasRafael",
                                            "id": "g36vxi5",
                                            "parent_id": "t1_g36kw0i",
                                            "score": 6,
                                            "created_utc": 1598659082.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "He should have died in Shippuden, now who cares if he dies or not.",
                                    "author": "thedoorsrebel",
                                    "id": "g36lva9",
                                    "parent_id": "t1_g36dou0",
                                    "score": -6,
                                    "created_utc": 1598653564.0,
                                    "replies": [
                                        {
                                            "body": "I don't know. Maybe the people who liked him as a character? After all, he was the co-protagonist. Naruto's rival. He has fans too. Just because you didn't like him doesn't mean others don't. \n\nAdult Sasuke is cool. 🤷",
                                            "author": null,
                                            "id": "g36m3xb",
                                            "parent_id": "t1_g36lva9",
                                            "score": 9,
                                            "created_utc": 1598653691.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "But that’s the easy way. Killing him is simple. Writing his redemption and changing him into a likeable character who has evolved is more difficult and interesting. If he dies he’s dead. Fin. \n\nHe was one of the most interesting and rounded characters in the series.",
                                            "author": "AtlasRafael",
                                            "id": "g36w265",
                                            "parent_id": "t1_g36lva9",
                                            "score": 3,
                                            "created_utc": 1598659157.0,
                                            "replies": [
                                                {
                                                    "body": "Nah to me he was just an entitled brat. He ruined the series for me. You know when I rewatched it I had to stop when the kaguya's fight is over because I know after that the shitty bastard will pull that shit after everything that has happened, threatening the kages, the bijuus. I hate him. He should have died. Now I don't care what he does. It doesn't matter anymore. His time has passed.",
                                                    "author": "thedoorsrebel",
                                                    "id": "g36xo4c",
                                                    "parent_id": "t1_g36w265",
                                                    "score": 1,
                                                    "created_utc": 1598660097.0,
                                                    "replies": [
                                                        {
                                                            "body": "Entitled brat? Lol do you not know what happened? He’s not entitled at all. \n\nI used to hate him, but he became on of my favorite characters.",
                                                            "author": "AtlasRafael",
                                                            "id": "g3749uj",
                                                            "parent_id": "t1_g36xo4c",
                                                            "score": 3,
                                                            "created_utc": 1598664003.0,
                                                            "replies": [
                                                                {
                                                                    "body": "I could explain a detailed list of why he's. You wouldn't agree because you know all the events I would put in that list but your perception of them was different. We would discuss this in several comments and nobody would change their minds about it. Instead of that, I would save both of us the trouble saying \"agree to disagree\" and move on.",
                                                                    "author": "thedoorsrebel",
                                                                    "id": "g374irq",
                                                                    "parent_id": "t1_g3749uj",
                                                                    "score": 1,
                                                                    "created_utc": 1598664150.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "Fair enough my dude. Not trynna change your mind really. Just sharing my opinion lol.",
                                                                            "author": "AtlasRafael",
                                                                            "id": "g37bkdx",
                                                                            "parent_id": "t1_g374irq",
                                                                            "score": 1,
                                                                            "created_utc": 1598668411.0,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "body": "> He ruined the series for me \n\nsad",
                                                            "author": null,
                                                            "id": "g36y6kc",
                                                            "parent_id": "t1_g36xo4c",
                                                            "score": 2,
                                                            "created_utc": 1598660402.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "The manga is pretty good in my opinion. Not naruto good, but I'd say boruto manga is better than naruto filler at the very least. I get that people don't like him having tons of power for no reason, but it makes sense for him. Think of the uchiha. They were naturally gifted because of their clan. They had to train yo build up on that, but boruto is kinda the same way. When you also consider that naruto is ashura's reincarnate, making naruto pretty much pure senju, and hinata is main branch hyuga, it makes sense for him to be naturally gifted. Momoshiki said something about the otsutsuki blood being strong in boruto. That's likely a result of his senju blood (son of ashura's reincarnate) and his hyuga blood (son of hinata. Main branch hyuga). Im really just basing the hyuga thing off of otsutsuki typically having byakugan. Even if that weren't important, what is important is that boruto is strong because at the very least he has what could be considered \"main branch\" senju blood, main branch hyuga blood, and the karma.",
            "author": "Schumeschu",
            "id": "g36rbcx",
            "parent_id": "t1_g35sjbk",
            "score": 5,
            "created_utc": 1598656498.0,
            "replies": [
                {
                    "body": "[removed]",
                    "author": null,
                    "id": "g3704hn",
                    "parent_id": "t1_g36rbcx",
                    "score": 2,
                    "created_utc": 1598661556.0,
                    "replies": [
                        {
                            "body": "The manga and anime are almost entirely different. The manga started out pretty bad but gradually got better over time, to the point where I can look forward to new chapters each month. To be honest, it really only starts getting good when >!Kawaki is finally introduced!< and before that it’s very much just either bad or meh, especially since the first arc is just the movie again. Compared to the anime though, it’s a million times better than the anime.",
                            "author": "thatguy-66",
                            "id": "g37e5m2",
                            "parent_id": "t1_g3704hn",
                            "score": 2,
                            "created_utc": 1598670024.0,
                            "replies": []
                        },
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "g377f8l",
                            "parent_id": "t1_g3704hn",
                            "score": 0,
                            "created_utc": 1598665897.0,
                            "replies": [
                                {
                                    "body": "[removed]",
                                    "author": null,
                                    "id": "g378xbu",
                                    "parent_id": "t1_g377f8l",
                                    "score": 0,
                                    "created_utc": 1598666792.0,
                                    "replies": [
                                        {
                                            "body": "[deleted]",
                                            "author": null,
                                            "id": "g37bh0p",
                                            "parent_id": "t1_g378xbu",
                                            "score": 0,
                                            "created_utc": 1598668354.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "The anime has been 99% filler. It's garbage. The manga is the picture of a big Mac and the anime is what you get. His power feels pretty earned from the manga imo. I get that it doesn't matter to you, but I feel like I've heard the argument once or twice . The manga is also decently paced. Think about og naruto. In the manga, naruto leaves with jiraya immediately after sasuke leaves. In the anime there are another 100 episodes. Boruto is pretty much the same way. Idk what else to say without spoiling it, but I just want people to stop hating on boruto so hard. It isnt naruto part one. Far from it. But its pretty good in its own right, and I can't wait for the anime to be finished so I can watch the manga cut of it start to finish.",
                            "author": "Schumeschu",
                            "id": "g370xlp",
                            "parent_id": "t1_g3704hn",
                            "score": -1,
                            "created_utc": 1598662031.0,
                            "replies": [
                                {
                                    "body": "I don't think you understand what filler is.",
                                    "author": null,
                                    "id": "g37cjng",
                                    "parent_id": "t1_g370xlp",
                                    "score": 1,
                                    "created_utc": 1598669015.0,
                                    "replies": [
                                        {
                                            "body": "I understand what it is. Basically just them waiting for the manga to progress enough content to incorporate it into the anime, while still producing  episodes of the anime. That said I think it's fucking stupid",
                                            "author": "Schumeschu",
                                            "id": "g37dda5",
                                            "parent_id": "t1_g37cjng",
                                            "score": 0,
                                            "created_utc": 1598669526.0,
                                            "replies": [
                                                {
                                                    "body": "At least acknowledge the fact that you made a mistake in ur paragraph and just edited it..",
                                                    "author": null,
                                                    "id": "g3b8ybk",
                                                    "parent_id": "t1_g37dda5",
                                                    "score": 1,
                                                    "created_utc": 1598753941.0,
                                                    "replies": [
                                                        {
                                                            "body": "I wrote manga instead of anime in a context where I was clearly talking about anime. No reason to specify",
                                                            "author": "Schumeschu",
                                                            "id": "g3b9ea3",
                                                            "parent_id": "t1_g3b8ybk",
                                                            "score": 0,
                                                            "created_utc": 1598754204.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "[removed]",
                                    "author": null,
                                    "id": "g371ow9",
                                    "parent_id": "t1_g370xlp",
                                    "score": 0,
                                    "created_utc": 1598662480.0,
                                    "replies": [
                                        {
                                            "body": "Absolutely. But I dont feel like it does many of the old characters dirty.",
                                            "author": "Schumeschu",
                                            "id": "g3721n4",
                                            "parent_id": "t1_g371ow9",
                                            "score": 1,
                                            "created_utc": 1598662688.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Nah Sasuke won’t die, at least for awhile. He’s taking a more active role in the manga.......oh wait......\n\nNO",
            "author": "AngonceMcGhee",
            "id": "g35y70p",
            "parent_id": "t1_g35sjbk",
            "score": 10,
            "created_utc": 1598642013.0,
            "replies": []
        },
        {
            "body": "nah nah, I think he actually does die eventually in the series. I've only watched the boruto movie and the first episode of boruto, but the first episode opened with this dude fighting boruto and saying to him \"I'm gonna send you to the place I sent your father\" while battling on the leaf villages destroyed remains. so it's pretty safe to assume Naruto does die along with the destruction of the village.",
            "author": "shupaoasado",
            "id": "g37liji",
            "parent_id": "t1_g35sjbk",
            "score": 1,
            "created_utc": 1598674883.0,
            "replies": []
        },
        {
            "body": "Did you read the manga?",
            "author": "Yourboyfibs",
            "id": "g37moyt",
            "parent_id": "t1_g35sjbk",
            "score": 1,
            "created_utc": 1598675748.0,
            "replies": []
        },
        {
            "body": "The manga is super dank",
            "author": "Zoulf",
            "id": "g36ai3u",
            "parent_id": "t1_g35sjbk",
            "score": 1,
            "created_utc": 1598647810.0,
            "replies": []
        },
        {
            "body": "then Kurama came back and he was alive 10x more OP",
            "author": "Cyber1969",
            "id": "g365wd3",
            "parent_id": "t1_g35won2",
            "score": 34,
            "created_utc": 1598645572.0,
            "replies": [
                {
                    "body": "Ah yes. Plot Armour",
                    "author": "MoogleSan",
                    "id": "g36b24k",
                    "parent_id": "t1_g365wd3",
                    "score": 26,
                    "created_utc": 1598648085.0,
                    "replies": []
                },
                {
                    "body": "But because of that Naruto is suffering from a deadly disease that Hagoromo also suffered",
                    "author": "Abin5ur",
                    "id": "g36a1lz",
                    "parent_id": "t1_g365wd3",
                    "score": 14,
                    "created_utc": 1598647587.0,
                    "replies": [
                        {
                            "body": "Really what disease?",
                            "author": "orbter",
                            "id": "g36gy92",
                            "parent_id": "t1_g36a1lz",
                            "score": 10,
                            "created_utc": 1598651020.0,
                            "replies": [
                                {
                                    "body": "Ligma",
                                    "author": "randominternetp3rs0n",
                                    "id": "g36hahu",
                                    "parent_id": "t1_g36gy92",
                                    "score": 45,
                                    "created_utc": 1598651194.0,
                                    "replies": [
                                        {
                                            "body": "Wow man you are so funny",
                                            "author": "orbter",
                                            "id": "g36hmr7",
                                            "parent_id": "t1_g36hahu",
                                            "score": 4,
                                            "created_utc": 1598651369.0,
                                            "replies": [
                                                {
                                                    "body": "be honest that was good",
                                                    "author": "BiggieSmalls0",
                                                    "id": "g36ibh8",
                                                    "parent_id": "t1_g36hmr7",
                                                    "score": 23,
                                                    "created_utc": 1598651723.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "Well it's not specified yet but it is said in a light novel of Boruto that he is suffering from a deadly disease which is caused due to being a Jinchuriki of a partial 10 tails which can only be cured by the dust of a certain meteor that falls every century or something.",
                                    "author": "Abin5ur",
                                    "id": "g36wt53",
                                    "parent_id": "t1_g36gy92",
                                    "score": 3,
                                    "created_utc": 1598659590.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "*TonTon",
            "author": "lavendiere",
            "id": "g37m9tg",
            "parent_id": "t1_g36g9yw",
            "score": 3,
            "created_utc": 1598675437.0,
            "replies": []
        },
        {
            "body": "i mean ikemoto not kishimoto lol",
            "author": "Kitsuneuser_67",
            "id": "g35ik7o",
            "parent_id": "t1_g35antf",
            "score": 20,
            "created_utc": 1598634622.0,
            "replies": [
                {
                    "body": "Kishimoto gave all the rights to kill the characters.",
                    "author": null,
                    "id": "g36b1lv",
                    "parent_id": "t1_g35ik7o",
                    "score": 4,
                    "created_utc": 1598648078.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "alright",
            "author": "Kitsuneuser_67",
            "id": "g35ipdk",
            "parent_id": "t1_g35antf",
            "score": 13,
            "created_utc": 1598634688.0,
            "replies": [
                {
                    "body": "What?",
                    "author": "Kazewatch",
                    "id": "g366lww",
                    "parent_id": "t1_g35ipdk",
                    "score": 2,
                    "created_utc": 1598645916.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I mean you basically said what I said but with more detail and without the sarada ms and that boruto kills sauske and that naruto uses Rinne rebirth but ok I like your theory",
            "author": "Stayhighuchina_7",
            "id": "g37mmtg",
            "parent_id": "t1_g37mi5f",
            "score": 1,
            "created_utc": 1598675703.0,
            "replies": [
                {
                    "body": "I like your theory as well",
                    "author": "Yourboyfibs",
                    "id": "g37omlj",
                    "parent_id": "t1_g37mmtg",
                    "score": 2,
                    "created_utc": 1598677165.0,
                    "replies": [
                        {
                            "body": "Thanks",
                            "author": "Stayhighuchina_7",
                            "id": "g37onm3",
                            "parent_id": "t1_g37omlj",
                            "score": 1,
                            "created_utc": 1598677188.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Perhaps he was thinking of titfucking his sister in the afterlife",
            "author": "NTReatsmysoul",
            "id": "g35skki",
            "parent_id": "t1_g35qkxp",
            "score": 4,
            "created_utc": 1598639352.0,
            "replies": [
                {
                    "body": "r/cursedcomments",
                    "author": "Abin5ur",
                    "id": "g35ws3b",
                    "parent_id": "t1_g35skki",
                    "score": 4,
                    "created_utc": 1598641338.0,
                    "replies": []
                },
                {
                    "body": "Wait what now",
                    "author": "RiceBoiz29",
                    "id": "g35yxhm",
                    "parent_id": "t1_g35skki",
                    "score": 1,
                    "created_utc": 1598642360.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Naruto is apparently dead in the time jump.",
            "author": "Summerclaw",
            "id": "g36gtkr",
            "parent_id": "t1_g36g71h",
            "score": 0,
            "created_utc": 1598650952.0,
            "replies": [
                {
                    "body": "I think he is just trapped somewhere.",
                    "author": null,
                    "id": "g36j1ik",
                    "parent_id": "t1_g36gtkr",
                    "score": 2,
                    "created_utc": 1598652093.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Kakashi’s my favorite so I really want him to die the least. I don’t love your idea because it includes Naruto dying but at the same time I do love it because you’re making the best of the situation if it does happen",
            "author": "Peng1GT",
            "id": "g36k0rp",
            "parent_id": "t1_g36hhi6",
            "score": 2,
            "created_utc": 1598652602.0,
            "replies": []
        },
        {
            "body": "Yes, yes it does, and yes, yes I can :P :)",
            "author": "ObiWanKenobiDaily",
            "id": "g3akgai",
            "parent_id": "t1_g3ajzxh",
            "score": 2,
            "created_utc": 1598740693.0,
            "replies": []
        },
        {
            "body": "i dont remember but it was in the normal naruto subreddit",
            "author": null,
            "id": "g3gx0jg",
            "parent_id": "t1_g3fht4c",
            "score": 2,
            "created_utc": 1598883885.0,
            "replies": [
                {
                    "body": "Ok thanks",
                    "author": "Abin5ur",
                    "id": "g3h3dk9",
                    "parent_id": "t1_g3gx0jg",
                    "score": 1,
                    "created_utc": 1598886404.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "g35tj5j",
            "parent_id": "t1_g35t3u2",
            "score": 0,
            "created_utc": 1598639809.0,
            "replies": [
                {
                    "body": "I feel like if it was actually death, the wording would've been a lot more direct.",
                    "author": "The96thPoet",
                    "id": "g35vi3f",
                    "parent_id": "t1_g35tj5j",
                    "score": 2,
                    "created_utc": 1598640735.0,
                    "replies": [
                        {
                            "body": "I don’t think they’ll want to be too direct if it was death either, because it would spoil it and Naruto fans might drop the manga while only on its first panel.",
                            "author": "claravelle-nazal",
                            "id": "g3705ai",
                            "parent_id": "t1_g35vi3f",
                            "score": 1,
                            "created_utc": 1598661569.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Hot take: Anything killing Naruto at this point is bad story. That boy big powerful and everytime they make a character randomly stronger than Shinobi Jesus it’s bad story.",
            "author": "Xandril",
            "id": "g36hl1w",
            "parent_id": "t1_g35wc6k",
            "score": 69,
            "created_utc": 1598651345.0,
            "replies": [
                {
                    "body": "I don't mind Boruto, but I hate when people say \"Sasuke or Naruto should be killed off to make it more interesting\" \n\nwhy can't the writers find a way to make Boruto interesting without killing an OG character?",
                    "author": null,
                    "id": "g36lv73",
                    "parent_id": "t1_g36hl1w",
                    "score": 48,
                    "created_utc": 1598653563.0,
                    "replies": [
                        {
                            "body": "Kill chocho",
                            "author": "MoMoney224",
                            "id": "g36ytxs",
                            "parent_id": "t1_g36lv73",
                            "score": 33,
                            "created_utc": 1598660790.0,
                            "replies": [
                                {
                                    "body": "I agree with this.",
                                    "author": "Galan1234",
                                    "id": "g37c19y",
                                    "parent_id": "t1_g36ytxs",
                                    "score": 11,
                                    "created_utc": 1598668700.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "Devils advocate here, because it's incredibly difficult to write a scenario where Godruto can't solve it for some reason. How do you have stakes in a series where one character basically can't fail? And if he does, it's because of some diablos ex machina, which is also bullshit.",
                            "author": "TheHeadlessScholar",
                            "id": "g37dq5p",
                            "parent_id": "t1_g36lv73",
                            "score": 8,
                            "created_utc": 1598669752.0,
                            "replies": [
                                {
                                    "body": "You could just have them sealed away or incapacitated",
                                    "author": null,
                                    "id": "g37fy0l",
                                    "parent_id": "t1_g37dq5p",
                                    "score": 4,
                                    "created_utc": 1598671140.0,
                                    "replies": []
                                },
                                {
                                    "body": "Not really. The stakes don’t have to always be world, nation, or village level. It can be about character development. Just because Naruto and Sasuke are around doesn’t mean all (comparatively) minor conflicts across the world stop. \n\nThe writers are just convinced they need to keep themselves in the same box even tho that box has been examined very thoroughly. \n\nAlthough, if they really wanted to get rid of Naruto they should have used the groundwork Kishi already laid out in regards to Naruto’s healing factor. The didn’t reference it by name but Tsunade’s warning about relying on regeneration is the Hayflick Limit. It wouldn’t even be difficult to argue that even just the four tails state, let alone everything else in his life, would have drastically reduced his lifespan.",
                                    "author": "Xandril",
                                    "id": "g3ag7m9",
                                    "parent_id": "t1_g37dq5p",
                                    "score": 3,
                                    "created_utc": 1598738726.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Isshiki isn't just randomly stronger. He stands at the very top of the Ootsutsuki hierarchy.",
                    "author": null,
                    "id": "g37vo1x",
                    "parent_id": "t1_g36hl1w",
                    "score": 3,
                    "created_utc": 1598683114.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[removed]",
            "author": null,
            "id": "g35wf2w",
            "parent_id": "t1_g35wc6k",
            "score": 26,
            "created_utc": 1598641169.0,
            "replies": [
                {
                    "body": "It definitely don’t got any fan service....... wait",
                    "author": "robomaster20",
                    "id": "g35xbit",
                    "parent_id": "t1_g35wf2w",
                    "score": 10,
                    "created_utc": 1598641596.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "An ok story with the old character fanservice would be super acceptable tho",
            "author": "Phenoxx",
            "id": "g36btjn",
            "parent_id": "t1_g35wc6k",
            "score": 9,
            "created_utc": 1598648394.0,
            "replies": []
        },
        {
            "body": "Ye just imagine, took us 500 episodes to bring him back and now they kill him",
            "author": "AGARAN24",
            "id": "g36dh6i",
            "parent_id": "t1_g35zlm7",
            "score": 33,
            "created_utc": 1598649235.0,
            "replies": [
                {
                    "body": "He’s probably the most complex and developed character. Most unique Shinzo I left as well. Would straight up suck considering he’s got so many hax abilities and is super OP killing him would just be for the plot.",
                    "author": "AtlasRafael",
                    "id": "g36dou0",
                    "parent_id": "t1_g36dh6i",
                    "score": 18,
                    "created_utc": 1598649344.0,
                    "replies": [
                        {
                            "body": "I don't feel like Kishimoto knew exactly what he wanted to do with Sasuke after his final fight with Naruto. Sasuke stopped having a precise goal. So it just became protecting Konoha from the shadows. Now his role is to be Boruto's teacher. \n\nI guess it would be a good ending for Sasuke to sacrifice himself for the village. But imo, his death is not necessary to give Boruto and Sarada development. His relationship with Boruto hasn't even been developed much.",
                            "author": null,
                            "id": "g36kw0i",
                            "parent_id": "t1_g36dou0",
                            "score": 10,
                            "created_utc": 1598653051.0,
                            "replies": [
                                {
                                    "body": "Well, he’s still the villages hidden guardian though. He’s basically a Navy Seal team. \n\nI don’t think either have to die. It would be lame in my opinion. They are definitely too powerful for any new villains, but they could have deteriorated from the Rinnegan or Narutos sage of sixth paths mode. Since there’s not much known of their extended use within humans. Just a way to make them weaker so Boruto and the rest can shine without killing those two.",
                                    "author": "AtlasRafael",
                                    "id": "g36vxi5",
                                    "parent_id": "t1_g36kw0i",
                                    "score": 6,
                                    "created_utc": 1598659082.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "He should have died in Shippuden, now who cares if he dies or not.",
                            "author": "thedoorsrebel",
                            "id": "g36lva9",
                            "parent_id": "t1_g36dou0",
                            "score": -6,
                            "created_utc": 1598653564.0,
                            "replies": [
                                {
                                    "body": "I don't know. Maybe the people who liked him as a character? After all, he was the co-protagonist. Naruto's rival. He has fans too. Just because you didn't like him doesn't mean others don't. \n\nAdult Sasuke is cool. 🤷",
                                    "author": null,
                                    "id": "g36m3xb",
                                    "parent_id": "t1_g36lva9",
                                    "score": 9,
                                    "created_utc": 1598653691.0,
                                    "replies": []
                                },
                                {
                                    "body": "But that’s the easy way. Killing him is simple. Writing his redemption and changing him into a likeable character who has evolved is more difficult and interesting. If he dies he’s dead. Fin. \n\nHe was one of the most interesting and rounded characters in the series.",
                                    "author": "AtlasRafael",
                                    "id": "g36w265",
                                    "parent_id": "t1_g36lva9",
                                    "score": 3,
                                    "created_utc": 1598659157.0,
                                    "replies": [
                                        {
                                            "body": "Nah to me he was just an entitled brat. He ruined the series for me. You know when I rewatched it I had to stop when the kaguya's fight is over because I know after that the shitty bastard will pull that shit after everything that has happened, threatening the kages, the bijuus. I hate him. He should have died. Now I don't care what he does. It doesn't matter anymore. His time has passed.",
                                            "author": "thedoorsrebel",
                                            "id": "g36xo4c",
                                            "parent_id": "t1_g36w265",
                                            "score": 1,
                                            "created_utc": 1598660097.0,
                                            "replies": [
                                                {
                                                    "body": "Entitled brat? Lol do you not know what happened? He’s not entitled at all. \n\nI used to hate him, but he became on of my favorite characters.",
                                                    "author": "AtlasRafael",
                                                    "id": "g3749uj",
                                                    "parent_id": "t1_g36xo4c",
                                                    "score": 3,
                                                    "created_utc": 1598664003.0,
                                                    "replies": [
                                                        {
                                                            "body": "I could explain a detailed list of why he's. You wouldn't agree because you know all the events I would put in that list but your perception of them was different. We would discuss this in several comments and nobody would change their minds about it. Instead of that, I would save both of us the trouble saying \"agree to disagree\" and move on.",
                                                            "author": "thedoorsrebel",
                                                            "id": "g374irq",
                                                            "parent_id": "t1_g3749uj",
                                                            "score": 1,
                                                            "created_utc": 1598664150.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Fair enough my dude. Not trynna change your mind really. Just sharing my opinion lol.",
                                                                    "author": "AtlasRafael",
                                                                    "id": "g37bkdx",
                                                                    "parent_id": "t1_g374irq",
                                                                    "score": 1,
                                                                    "created_utc": 1598668411.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "body": "> He ruined the series for me \n\nsad",
                                                    "author": null,
                                                    "id": "g36y6kc",
                                                    "parent_id": "t1_g36xo4c",
                                                    "score": 2,
                                                    "created_utc": 1598660402.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "[removed]",
            "author": null,
            "id": "g3704hn",
            "parent_id": "t1_g36rbcx",
            "score": 2,
            "created_utc": 1598661556.0,
            "replies": [
                {
                    "body": "The manga and anime are almost entirely different. The manga started out pretty bad but gradually got better over time, to the point where I can look forward to new chapters each month. To be honest, it really only starts getting good when >!Kawaki is finally introduced!< and before that it’s very much just either bad or meh, especially since the first arc is just the movie again. Compared to the anime though, it’s a million times better than the anime.",
                    "author": "thatguy-66",
                    "id": "g37e5m2",
                    "parent_id": "t1_g3704hn",
                    "score": 2,
                    "created_utc": 1598670024.0,
                    "replies": []
                },
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "g377f8l",
                    "parent_id": "t1_g3704hn",
                    "score": 0,
                    "created_utc": 1598665897.0,
                    "replies": [
                        {
                            "body": "[removed]",
                            "author": null,
                            "id": "g378xbu",
                            "parent_id": "t1_g377f8l",
                            "score": 0,
                            "created_utc": 1598666792.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "g37bh0p",
                                    "parent_id": "t1_g378xbu",
                                    "score": 0,
                                    "created_utc": 1598668354.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "The anime has been 99% filler. It's garbage. The manga is the picture of a big Mac and the anime is what you get. His power feels pretty earned from the manga imo. I get that it doesn't matter to you, but I feel like I've heard the argument once or twice . The manga is also decently paced. Think about og naruto. In the manga, naruto leaves with jiraya immediately after sasuke leaves. In the anime there are another 100 episodes. Boruto is pretty much the same way. Idk what else to say without spoiling it, but I just want people to stop hating on boruto so hard. It isnt naruto part one. Far from it. But its pretty good in its own right, and I can't wait for the anime to be finished so I can watch the manga cut of it start to finish.",
                    "author": "Schumeschu",
                    "id": "g370xlp",
                    "parent_id": "t1_g3704hn",
                    "score": -1,
                    "created_utc": 1598662031.0,
                    "replies": [
                        {
                            "body": "I don't think you understand what filler is.",
                            "author": null,
                            "id": "g37cjng",
                            "parent_id": "t1_g370xlp",
                            "score": 1,
                            "created_utc": 1598669015.0,
                            "replies": [
                                {
                                    "body": "I understand what it is. Basically just them waiting for the manga to progress enough content to incorporate it into the anime, while still producing  episodes of the anime. That said I think it's fucking stupid",
                                    "author": "Schumeschu",
                                    "id": "g37dda5",
                                    "parent_id": "t1_g37cjng",
                                    "score": 0,
                                    "created_utc": 1598669526.0,
                                    "replies": [
                                        {
                                            "body": "At least acknowledge the fact that you made a mistake in ur paragraph and just edited it..",
                                            "author": null,
                                            "id": "g3b8ybk",
                                            "parent_id": "t1_g37dda5",
                                            "score": 1,
                                            "created_utc": 1598753941.0,
                                            "replies": [
                                                {
                                                    "body": "I wrote manga instead of anime in a context where I was clearly talking about anime. No reason to specify",
                                                    "author": "Schumeschu",
                                                    "id": "g3b9ea3",
                                                    "parent_id": "t1_g3b8ybk",
                                                    "score": 0,
                                                    "created_utc": 1598754204.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "[removed]",
                            "author": null,
                            "id": "g371ow9",
                            "parent_id": "t1_g370xlp",
                            "score": 0,
                            "created_utc": 1598662480.0,
                            "replies": [
                                {
                                    "body": "Absolutely. But I dont feel like it does many of the old characters dirty.",
                                    "author": "Schumeschu",
                                    "id": "g3721n4",
                                    "parent_id": "t1_g371ow9",
                                    "score": 1,
                                    "created_utc": 1598662688.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Ah yes. Plot Armour",
            "author": "MoogleSan",
            "id": "g36b24k",
            "parent_id": "t1_g365wd3",
            "score": 26,
            "created_utc": 1598648085.0,
            "replies": []
        },
        {
            "body": "But because of that Naruto is suffering from a deadly disease that Hagoromo also suffered",
            "author": "Abin5ur",
            "id": "g36a1lz",
            "parent_id": "t1_g365wd3",
            "score": 14,
            "created_utc": 1598647587.0,
            "replies": [
                {
                    "body": "Really what disease?",
                    "author": "orbter",
                    "id": "g36gy92",
                    "parent_id": "t1_g36a1lz",
                    "score": 10,
                    "created_utc": 1598651020.0,
                    "replies": [
                        {
                            "body": "Ligma",
                            "author": "randominternetp3rs0n",
                            "id": "g36hahu",
                            "parent_id": "t1_g36gy92",
                            "score": 45,
                            "created_utc": 1598651194.0,
                            "replies": [
                                {
                                    "body": "Wow man you are so funny",
                                    "author": "orbter",
                                    "id": "g36hmr7",
                                    "parent_id": "t1_g36hahu",
                                    "score": 4,
                                    "created_utc": 1598651369.0,
                                    "replies": [
                                        {
                                            "body": "be honest that was good",
                                            "author": "BiggieSmalls0",
                                            "id": "g36ibh8",
                                            "parent_id": "t1_g36hmr7",
                                            "score": 23,
                                            "created_utc": 1598651723.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "Well it's not specified yet but it is said in a light novel of Boruto that he is suffering from a deadly disease which is caused due to being a Jinchuriki of a partial 10 tails which can only be cured by the dust of a certain meteor that falls every century or something.",
                            "author": "Abin5ur",
                            "id": "g36wt53",
                            "parent_id": "t1_g36gy92",
                            "score": 3,
                            "created_utc": 1598659590.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Kishimoto gave all the rights to kill the characters.",
            "author": null,
            "id": "g36b1lv",
            "parent_id": "t1_g35ik7o",
            "score": 4,
            "created_utc": 1598648078.0,
            "replies": []
        },
        {
            "body": "What?",
            "author": "Kazewatch",
            "id": "g366lww",
            "parent_id": "t1_g35ipdk",
            "score": 2,
            "created_utc": 1598645916.0,
            "replies": []
        },
        {
            "body": "I like your theory as well",
            "author": "Yourboyfibs",
            "id": "g37omlj",
            "parent_id": "t1_g37mmtg",
            "score": 2,
            "created_utc": 1598677165.0,
            "replies": [
                {
                    "body": "Thanks",
                    "author": "Stayhighuchina_7",
                    "id": "g37onm3",
                    "parent_id": "t1_g37omlj",
                    "score": 1,
                    "created_utc": 1598677188.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "r/cursedcomments",
            "author": "Abin5ur",
            "id": "g35ws3b",
            "parent_id": "t1_g35skki",
            "score": 4,
            "created_utc": 1598641338.0,
            "replies": []
        },
        {
            "body": "Wait what now",
            "author": "RiceBoiz29",
            "id": "g35yxhm",
            "parent_id": "t1_g35skki",
            "score": 1,
            "created_utc": 1598642360.0,
            "replies": []
        },
        {
            "body": "I think he is just trapped somewhere.",
            "author": null,
            "id": "g36j1ik",
            "parent_id": "t1_g36gtkr",
            "score": 2,
            "created_utc": 1598652093.0,
            "replies": []
        },
        {
            "body": "Ok thanks",
            "author": "Abin5ur",
            "id": "g3h3dk9",
            "parent_id": "t1_g3gx0jg",
            "score": 1,
            "created_utc": 1598886404.0,
            "replies": []
        },
        {
            "body": "I feel like if it was actually death, the wording would've been a lot more direct.",
            "author": "The96thPoet",
            "id": "g35vi3f",
            "parent_id": "t1_g35tj5j",
            "score": 2,
            "created_utc": 1598640735.0,
            "replies": [
                {
                    "body": "I don’t think they’ll want to be too direct if it was death either, because it would spoil it and Naruto fans might drop the manga while only on its first panel.",
                    "author": "claravelle-nazal",
                    "id": "g3705ai",
                    "parent_id": "t1_g35vi3f",
                    "score": 1,
                    "created_utc": 1598661569.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I don't mind Boruto, but I hate when people say \"Sasuke or Naruto should be killed off to make it more interesting\" \n\nwhy can't the writers find a way to make Boruto interesting without killing an OG character?",
            "author": null,
            "id": "g36lv73",
            "parent_id": "t1_g36hl1w",
            "score": 48,
            "created_utc": 1598653563.0,
            "replies": [
                {
                    "body": "Kill chocho",
                    "author": "MoMoney224",
                    "id": "g36ytxs",
                    "parent_id": "t1_g36lv73",
                    "score": 33,
                    "created_utc": 1598660790.0,
                    "replies": [
                        {
                            "body": "I agree with this.",
                            "author": "Galan1234",
                            "id": "g37c19y",
                            "parent_id": "t1_g36ytxs",
                            "score": 11,
                            "created_utc": 1598668700.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Devils advocate here, because it's incredibly difficult to write a scenario where Godruto can't solve it for some reason. How do you have stakes in a series where one character basically can't fail? And if he does, it's because of some diablos ex machina, which is also bullshit.",
                    "author": "TheHeadlessScholar",
                    "id": "g37dq5p",
                    "parent_id": "t1_g36lv73",
                    "score": 8,
                    "created_utc": 1598669752.0,
                    "replies": [
                        {
                            "body": "You could just have them sealed away or incapacitated",
                            "author": null,
                            "id": "g37fy0l",
                            "parent_id": "t1_g37dq5p",
                            "score": 4,
                            "created_utc": 1598671140.0,
                            "replies": []
                        },
                        {
                            "body": "Not really. The stakes don’t have to always be world, nation, or village level. It can be about character development. Just because Naruto and Sasuke are around doesn’t mean all (comparatively) minor conflicts across the world stop. \n\nThe writers are just convinced they need to keep themselves in the same box even tho that box has been examined very thoroughly. \n\nAlthough, if they really wanted to get rid of Naruto they should have used the groundwork Kishi already laid out in regards to Naruto’s healing factor. The didn’t reference it by name but Tsunade’s warning about relying on regeneration is the Hayflick Limit. It wouldn’t even be difficult to argue that even just the four tails state, let alone everything else in his life, would have drastically reduced his lifespan.",
                            "author": "Xandril",
                            "id": "g3ag7m9",
                            "parent_id": "t1_g37dq5p",
                            "score": 3,
                            "created_utc": 1598738726.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Isshiki isn't just randomly stronger. He stands at the very top of the Ootsutsuki hierarchy.",
            "author": null,
            "id": "g37vo1x",
            "parent_id": "t1_g36hl1w",
            "score": 3,
            "created_utc": 1598683114.0,
            "replies": []
        },
        {
            "body": "It definitely don’t got any fan service....... wait",
            "author": "robomaster20",
            "id": "g35xbit",
            "parent_id": "t1_g35wf2w",
            "score": 10,
            "created_utc": 1598641596.0,
            "replies": []
        },
        {
            "body": "He’s probably the most complex and developed character. Most unique Shinzo I left as well. Would straight up suck considering he’s got so many hax abilities and is super OP killing him would just be for the plot.",
            "author": "AtlasRafael",
            "id": "g36dou0",
            "parent_id": "t1_g36dh6i",
            "score": 18,
            "created_utc": 1598649344.0,
            "replies": [
                {
                    "body": "I don't feel like Kishimoto knew exactly what he wanted to do with Sasuke after his final fight with Naruto. Sasuke stopped having a precise goal. So it just became protecting Konoha from the shadows. Now his role is to be Boruto's teacher. \n\nI guess it would be a good ending for Sasuke to sacrifice himself for the village. But imo, his death is not necessary to give Boruto and Sarada development. His relationship with Boruto hasn't even been developed much.",
                    "author": null,
                    "id": "g36kw0i",
                    "parent_id": "t1_g36dou0",
                    "score": 10,
                    "created_utc": 1598653051.0,
                    "replies": [
                        {
                            "body": "Well, he’s still the villages hidden guardian though. He’s basically a Navy Seal team. \n\nI don’t think either have to die. It would be lame in my opinion. They are definitely too powerful for any new villains, but they could have deteriorated from the Rinnegan or Narutos sage of sixth paths mode. Since there’s not much known of their extended use within humans. Just a way to make them weaker so Boruto and the rest can shine without killing those two.",
                            "author": "AtlasRafael",
                            "id": "g36vxi5",
                            "parent_id": "t1_g36kw0i",
                            "score": 6,
                            "created_utc": 1598659082.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "He should have died in Shippuden, now who cares if he dies or not.",
                    "author": "thedoorsrebel",
                    "id": "g36lva9",
                    "parent_id": "t1_g36dou0",
                    "score": -6,
                    "created_utc": 1598653564.0,
                    "replies": [
                        {
                            "body": "I don't know. Maybe the people who liked him as a character? After all, he was the co-protagonist. Naruto's rival. He has fans too. Just because you didn't like him doesn't mean others don't. \n\nAdult Sasuke is cool. 🤷",
                            "author": null,
                            "id": "g36m3xb",
                            "parent_id": "t1_g36lva9",
                            "score": 9,
                            "created_utc": 1598653691.0,
                            "replies": []
                        },
                        {
                            "body": "But that’s the easy way. Killing him is simple. Writing his redemption and changing him into a likeable character who has evolved is more difficult and interesting. If he dies he’s dead. Fin. \n\nHe was one of the most interesting and rounded characters in the series.",
                            "author": "AtlasRafael",
                            "id": "g36w265",
                            "parent_id": "t1_g36lva9",
                            "score": 3,
                            "created_utc": 1598659157.0,
                            "replies": [
                                {
                                    "body": "Nah to me he was just an entitled brat. He ruined the series for me. You know when I rewatched it I had to stop when the kaguya's fight is over because I know after that the shitty bastard will pull that shit after everything that has happened, threatening the kages, the bijuus. I hate him. He should have died. Now I don't care what he does. It doesn't matter anymore. His time has passed.",
                                    "author": "thedoorsrebel",
                                    "id": "g36xo4c",
                                    "parent_id": "t1_g36w265",
                                    "score": 1,
                                    "created_utc": 1598660097.0,
                                    "replies": [
                                        {
                                            "body": "Entitled brat? Lol do you not know what happened? He’s not entitled at all. \n\nI used to hate him, but he became on of my favorite characters.",
                                            "author": "AtlasRafael",
                                            "id": "g3749uj",
                                            "parent_id": "t1_g36xo4c",
                                            "score": 3,
                                            "created_utc": 1598664003.0,
                                            "replies": [
                                                {
                                                    "body": "I could explain a detailed list of why he's. You wouldn't agree because you know all the events I would put in that list but your perception of them was different. We would discuss this in several comments and nobody would change their minds about it. Instead of that, I would save both of us the trouble saying \"agree to disagree\" and move on.",
                                                    "author": "thedoorsrebel",
                                                    "id": "g374irq",
                                                    "parent_id": "t1_g3749uj",
                                                    "score": 1,
                                                    "created_utc": 1598664150.0,
                                                    "replies": [
                                                        {
                                                            "body": "Fair enough my dude. Not trynna change your mind really. Just sharing my opinion lol.",
                                                            "author": "AtlasRafael",
                                                            "id": "g37bkdx",
                                                            "parent_id": "t1_g374irq",
                                                            "score": 1,
                                                            "created_utc": 1598668411.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "body": "> He ruined the series for me \n\nsad",
                                            "author": null,
                                            "id": "g36y6kc",
                                            "parent_id": "t1_g36xo4c",
                                            "score": 2,
                                            "created_utc": 1598660402.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "The manga and anime are almost entirely different. The manga started out pretty bad but gradually got better over time, to the point where I can look forward to new chapters each month. To be honest, it really only starts getting good when >!Kawaki is finally introduced!< and before that it’s very much just either bad or meh, especially since the first arc is just the movie again. Compared to the anime though, it’s a million times better than the anime.",
            "author": "thatguy-66",
            "id": "g37e5m2",
            "parent_id": "t1_g3704hn",
            "score": 2,
            "created_utc": 1598670024.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "g377f8l",
            "parent_id": "t1_g3704hn",
            "score": 0,
            "created_utc": 1598665897.0,
            "replies": [
                {
                    "body": "[removed]",
                    "author": null,
                    "id": "g378xbu",
                    "parent_id": "t1_g377f8l",
                    "score": 0,
                    "created_utc": 1598666792.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "g37bh0p",
                            "parent_id": "t1_g378xbu",
                            "score": 0,
                            "created_utc": 1598668354.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "The anime has been 99% filler. It's garbage. The manga is the picture of a big Mac and the anime is what you get. His power feels pretty earned from the manga imo. I get that it doesn't matter to you, but I feel like I've heard the argument once or twice . The manga is also decently paced. Think about og naruto. In the manga, naruto leaves with jiraya immediately after sasuke leaves. In the anime there are another 100 episodes. Boruto is pretty much the same way. Idk what else to say without spoiling it, but I just want people to stop hating on boruto so hard. It isnt naruto part one. Far from it. But its pretty good in its own right, and I can't wait for the anime to be finished so I can watch the manga cut of it start to finish.",
            "author": "Schumeschu",
            "id": "g370xlp",
            "parent_id": "t1_g3704hn",
            "score": -1,
            "created_utc": 1598662031.0,
            "replies": [
                {
                    "body": "I don't think you understand what filler is.",
                    "author": null,
                    "id": "g37cjng",
                    "parent_id": "t1_g370xlp",
                    "score": 1,
                    "created_utc": 1598669015.0,
                    "replies": [
                        {
                            "body": "I understand what it is. Basically just them waiting for the manga to progress enough content to incorporate it into the anime, while still producing  episodes of the anime. That said I think it's fucking stupid",
                            "author": "Schumeschu",
                            "id": "g37dda5",
                            "parent_id": "t1_g37cjng",
                            "score": 0,
                            "created_utc": 1598669526.0,
                            "replies": [
                                {
                                    "body": "At least acknowledge the fact that you made a mistake in ur paragraph and just edited it..",
                                    "author": null,
                                    "id": "g3b8ybk",
                                    "parent_id": "t1_g37dda5",
                                    "score": 1,
                                    "created_utc": 1598753941.0,
                                    "replies": [
                                        {
                                            "body": "I wrote manga instead of anime in a context where I was clearly talking about anime. No reason to specify",
                                            "author": "Schumeschu",
                                            "id": "g3b9ea3",
                                            "parent_id": "t1_g3b8ybk",
                                            "score": 0,
                                            "created_utc": 1598754204.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "[removed]",
                    "author": null,
                    "id": "g371ow9",
                    "parent_id": "t1_g370xlp",
                    "score": 0,
                    "created_utc": 1598662480.0,
                    "replies": [
                        {
                            "body": "Absolutely. But I dont feel like it does many of the old characters dirty.",
                            "author": "Schumeschu",
                            "id": "g3721n4",
                            "parent_id": "t1_g371ow9",
                            "score": 1,
                            "created_utc": 1598662688.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Really what disease?",
            "author": "orbter",
            "id": "g36gy92",
            "parent_id": "t1_g36a1lz",
            "score": 10,
            "created_utc": 1598651020.0,
            "replies": [
                {
                    "body": "Ligma",
                    "author": "randominternetp3rs0n",
                    "id": "g36hahu",
                    "parent_id": "t1_g36gy92",
                    "score": 45,
                    "created_utc": 1598651194.0,
                    "replies": [
                        {
                            "body": "Wow man you are so funny",
                            "author": "orbter",
                            "id": "g36hmr7",
                            "parent_id": "t1_g36hahu",
                            "score": 4,
                            "created_utc": 1598651369.0,
                            "replies": [
                                {
                                    "body": "be honest that was good",
                                    "author": "BiggieSmalls0",
                                    "id": "g36ibh8",
                                    "parent_id": "t1_g36hmr7",
                                    "score": 23,
                                    "created_utc": 1598651723.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Well it's not specified yet but it is said in a light novel of Boruto that he is suffering from a deadly disease which is caused due to being a Jinchuriki of a partial 10 tails which can only be cured by the dust of a certain meteor that falls every century or something.",
                    "author": "Abin5ur",
                    "id": "g36wt53",
                    "parent_id": "t1_g36gy92",
                    "score": 3,
                    "created_utc": 1598659590.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Thanks",
            "author": "Stayhighuchina_7",
            "id": "g37onm3",
            "parent_id": "t1_g37omlj",
            "score": 1,
            "created_utc": 1598677188.0,
            "replies": []
        },
        {
            "body": "I don’t think they’ll want to be too direct if it was death either, because it would spoil it and Naruto fans might drop the manga while only on its first panel.",
            "author": "claravelle-nazal",
            "id": "g3705ai",
            "parent_id": "t1_g35vi3f",
            "score": 1,
            "created_utc": 1598661569.0,
            "replies": []
        },
        {
            "body": "Kill chocho",
            "author": "MoMoney224",
            "id": "g36ytxs",
            "parent_id": "t1_g36lv73",
            "score": 33,
            "created_utc": 1598660790.0,
            "replies": [
                {
                    "body": "I agree with this.",
                    "author": "Galan1234",
                    "id": "g37c19y",
                    "parent_id": "t1_g36ytxs",
                    "score": 11,
                    "created_utc": 1598668700.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Devils advocate here, because it's incredibly difficult to write a scenario where Godruto can't solve it for some reason. How do you have stakes in a series where one character basically can't fail? And if he does, it's because of some diablos ex machina, which is also bullshit.",
            "author": "TheHeadlessScholar",
            "id": "g37dq5p",
            "parent_id": "t1_g36lv73",
            "score": 8,
            "created_utc": 1598669752.0,
            "replies": [
                {
                    "body": "You could just have them sealed away or incapacitated",
                    "author": null,
                    "id": "g37fy0l",
                    "parent_id": "t1_g37dq5p",
                    "score": 4,
                    "created_utc": 1598671140.0,
                    "replies": []
                },
                {
                    "body": "Not really. The stakes don’t have to always be world, nation, or village level. It can be about character development. Just because Naruto and Sasuke are around doesn’t mean all (comparatively) minor conflicts across the world stop. \n\nThe writers are just convinced they need to keep themselves in the same box even tho that box has been examined very thoroughly. \n\nAlthough, if they really wanted to get rid of Naruto they should have used the groundwork Kishi already laid out in regards to Naruto’s healing factor. The didn’t reference it by name but Tsunade’s warning about relying on regeneration is the Hayflick Limit. It wouldn’t even be difficult to argue that even just the four tails state, let alone everything else in his life, would have drastically reduced his lifespan.",
                    "author": "Xandril",
                    "id": "g3ag7m9",
                    "parent_id": "t1_g37dq5p",
                    "score": 3,
                    "created_utc": 1598738726.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I don't feel like Kishimoto knew exactly what he wanted to do with Sasuke after his final fight with Naruto. Sasuke stopped having a precise goal. So it just became protecting Konoha from the shadows. Now his role is to be Boruto's teacher. \n\nI guess it would be a good ending for Sasuke to sacrifice himself for the village. But imo, his death is not necessary to give Boruto and Sarada development. His relationship with Boruto hasn't even been developed much.",
            "author": null,
            "id": "g36kw0i",
            "parent_id": "t1_g36dou0",
            "score": 10,
            "created_utc": 1598653051.0,
            "replies": [
                {
                    "body": "Well, he’s still the villages hidden guardian though. He’s basically a Navy Seal team. \n\nI don’t think either have to die. It would be lame in my opinion. They are definitely too powerful for any new villains, but they could have deteriorated from the Rinnegan or Narutos sage of sixth paths mode. Since there’s not much known of their extended use within humans. Just a way to make them weaker so Boruto and the rest can shine without killing those two.",
                    "author": "AtlasRafael",
                    "id": "g36vxi5",
                    "parent_id": "t1_g36kw0i",
                    "score": 6,
                    "created_utc": 1598659082.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "He should have died in Shippuden, now who cares if he dies or not.",
            "author": "thedoorsrebel",
            "id": "g36lva9",
            "parent_id": "t1_g36dou0",
            "score": -6,
            "created_utc": 1598653564.0,
            "replies": [
                {
                    "body": "I don't know. Maybe the people who liked him as a character? After all, he was the co-protagonist. Naruto's rival. He has fans too. Just because you didn't like him doesn't mean others don't. \n\nAdult Sasuke is cool. 🤷",
                    "author": null,
                    "id": "g36m3xb",
                    "parent_id": "t1_g36lva9",
                    "score": 9,
                    "created_utc": 1598653691.0,
                    "replies": []
                },
                {
                    "body": "But that’s the easy way. Killing him is simple. Writing his redemption and changing him into a likeable character who has evolved is more difficult and interesting. If he dies he’s dead. Fin. \n\nHe was one of the most interesting and rounded characters in the series.",
                    "author": "AtlasRafael",
                    "id": "g36w265",
                    "parent_id": "t1_g36lva9",
                    "score": 3,
                    "created_utc": 1598659157.0,
                    "replies": [
                        {
                            "body": "Nah to me he was just an entitled brat. He ruined the series for me. You know when I rewatched it I had to stop when the kaguya's fight is over because I know after that the shitty bastard will pull that shit after everything that has happened, threatening the kages, the bijuus. I hate him. He should have died. Now I don't care what he does. It doesn't matter anymore. His time has passed.",
                            "author": "thedoorsrebel",
                            "id": "g36xo4c",
                            "parent_id": "t1_g36w265",
                            "score": 1,
                            "created_utc": 1598660097.0,
                            "replies": [
                                {
                                    "body": "Entitled brat? Lol do you not know what happened? He’s not entitled at all. \n\nI used to hate him, but he became on of my favorite characters.",
                                    "author": "AtlasRafael",
                                    "id": "g3749uj",
                                    "parent_id": "t1_g36xo4c",
                                    "score": 3,
                                    "created_utc": 1598664003.0,
                                    "replies": [
                                        {
                                            "body": "I could explain a detailed list of why he's. You wouldn't agree because you know all the events I would put in that list but your perception of them was different. We would discuss this in several comments and nobody would change their minds about it. Instead of that, I would save both of us the trouble saying \"agree to disagree\" and move on.",
                                            "author": "thedoorsrebel",
                                            "id": "g374irq",
                                            "parent_id": "t1_g3749uj",
                                            "score": 1,
                                            "created_utc": 1598664150.0,
                                            "replies": [
                                                {
                                                    "body": "Fair enough my dude. Not trynna change your mind really. Just sharing my opinion lol.",
                                                    "author": "AtlasRafael",
                                                    "id": "g37bkdx",
                                                    "parent_id": "t1_g374irq",
                                                    "score": 1,
                                                    "created_utc": 1598668411.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "> He ruined the series for me \n\nsad",
                                    "author": null,
                                    "id": "g36y6kc",
                                    "parent_id": "t1_g36xo4c",
                                    "score": 2,
                                    "created_utc": 1598660402.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "[removed]",
            "author": null,
            "id": "g378xbu",
            "parent_id": "t1_g377f8l",
            "score": 0,
            "created_utc": 1598666792.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "g37bh0p",
                    "parent_id": "t1_g378xbu",
                    "score": 0,
                    "created_utc": 1598668354.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I don't think you understand what filler is.",
            "author": null,
            "id": "g37cjng",
            "parent_id": "t1_g370xlp",
            "score": 1,
            "created_utc": 1598669015.0,
            "replies": [
                {
                    "body": "I understand what it is. Basically just them waiting for the manga to progress enough content to incorporate it into the anime, while still producing  episodes of the anime. That said I think it's fucking stupid",
                    "author": "Schumeschu",
                    "id": "g37dda5",
                    "parent_id": "t1_g37cjng",
                    "score": 0,
                    "created_utc": 1598669526.0,
                    "replies": [
                        {
                            "body": "At least acknowledge the fact that you made a mistake in ur paragraph and just edited it..",
                            "author": null,
                            "id": "g3b8ybk",
                            "parent_id": "t1_g37dda5",
                            "score": 1,
                            "created_utc": 1598753941.0,
                            "replies": [
                                {
                                    "body": "I wrote manga instead of anime in a context where I was clearly talking about anime. No reason to specify",
                                    "author": "Schumeschu",
                                    "id": "g3b9ea3",
                                    "parent_id": "t1_g3b8ybk",
                                    "score": 0,
                                    "created_utc": 1598754204.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "[removed]",
            "author": null,
            "id": "g371ow9",
            "parent_id": "t1_g370xlp",
            "score": 0,
            "created_utc": 1598662480.0,
            "replies": [
                {
                    "body": "Absolutely. But I dont feel like it does many of the old characters dirty.",
                    "author": "Schumeschu",
                    "id": "g3721n4",
                    "parent_id": "t1_g371ow9",
                    "score": 1,
                    "created_utc": 1598662688.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Ligma",
            "author": "randominternetp3rs0n",
            "id": "g36hahu",
            "parent_id": "t1_g36gy92",
            "score": 45,
            "created_utc": 1598651194.0,
            "replies": [
                {
                    "body": "Wow man you are so funny",
                    "author": "orbter",
                    "id": "g36hmr7",
                    "parent_id": "t1_g36hahu",
                    "score": 4,
                    "created_utc": 1598651369.0,
                    "replies": [
                        {
                            "body": "be honest that was good",
                            "author": "BiggieSmalls0",
                            "id": "g36ibh8",
                            "parent_id": "t1_g36hmr7",
                            "score": 23,
                            "created_utc": 1598651723.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Well it's not specified yet but it is said in a light novel of Boruto that he is suffering from a deadly disease which is caused due to being a Jinchuriki of a partial 10 tails which can only be cured by the dust of a certain meteor that falls every century or something.",
            "author": "Abin5ur",
            "id": "g36wt53",
            "parent_id": "t1_g36gy92",
            "score": 3,
            "created_utc": 1598659590.0,
            "replies": []
        },
        {
            "body": "I agree with this.",
            "author": "Galan1234",
            "id": "g37c19y",
            "parent_id": "t1_g36ytxs",
            "score": 11,
            "created_utc": 1598668700.0,
            "replies": []
        },
        {
            "body": "You could just have them sealed away or incapacitated",
            "author": null,
            "id": "g37fy0l",
            "parent_id": "t1_g37dq5p",
            "score": 4,
            "created_utc": 1598671140.0,
            "replies": []
        },
        {
            "body": "Not really. The stakes don’t have to always be world, nation, or village level. It can be about character development. Just because Naruto and Sasuke are around doesn’t mean all (comparatively) minor conflicts across the world stop. \n\nThe writers are just convinced they need to keep themselves in the same box even tho that box has been examined very thoroughly. \n\nAlthough, if they really wanted to get rid of Naruto they should have used the groundwork Kishi already laid out in regards to Naruto’s healing factor. The didn’t reference it by name but Tsunade’s warning about relying on regeneration is the Hayflick Limit. It wouldn’t even be difficult to argue that even just the four tails state, let alone everything else in his life, would have drastically reduced his lifespan.",
            "author": "Xandril",
            "id": "g3ag7m9",
            "parent_id": "t1_g37dq5p",
            "score": 3,
            "created_utc": 1598738726.0,
            "replies": []
        },
        {
            "body": "Well, he’s still the villages hidden guardian though. He’s basically a Navy Seal team. \n\nI don’t think either have to die. It would be lame in my opinion. They are definitely too powerful for any new villains, but they could have deteriorated from the Rinnegan or Narutos sage of sixth paths mode. Since there’s not much known of their extended use within humans. Just a way to make them weaker so Boruto and the rest can shine without killing those two.",
            "author": "AtlasRafael",
            "id": "g36vxi5",
            "parent_id": "t1_g36kw0i",
            "score": 6,
            "created_utc": 1598659082.0,
            "replies": []
        },
        {
            "body": "I don't know. Maybe the people who liked him as a character? After all, he was the co-protagonist. Naruto's rival. He has fans too. Just because you didn't like him doesn't mean others don't. \n\nAdult Sasuke is cool. 🤷",
            "author": null,
            "id": "g36m3xb",
            "parent_id": "t1_g36lva9",
            "score": 9,
            "created_utc": 1598653691.0,
            "replies": []
        },
        {
            "body": "But that’s the easy way. Killing him is simple. Writing his redemption and changing him into a likeable character who has evolved is more difficult and interesting. If he dies he’s dead. Fin. \n\nHe was one of the most interesting and rounded characters in the series.",
            "author": "AtlasRafael",
            "id": "g36w265",
            "parent_id": "t1_g36lva9",
            "score": 3,
            "created_utc": 1598659157.0,
            "replies": [
                {
                    "body": "Nah to me he was just an entitled brat. He ruined the series for me. You know when I rewatched it I had to stop when the kaguya's fight is over because I know after that the shitty bastard will pull that shit after everything that has happened, threatening the kages, the bijuus. I hate him. He should have died. Now I don't care what he does. It doesn't matter anymore. His time has passed.",
                    "author": "thedoorsrebel",
                    "id": "g36xo4c",
                    "parent_id": "t1_g36w265",
                    "score": 1,
                    "created_utc": 1598660097.0,
                    "replies": [
                        {
                            "body": "Entitled brat? Lol do you not know what happened? He’s not entitled at all. \n\nI used to hate him, but he became on of my favorite characters.",
                            "author": "AtlasRafael",
                            "id": "g3749uj",
                            "parent_id": "t1_g36xo4c",
                            "score": 3,
                            "created_utc": 1598664003.0,
                            "replies": [
                                {
                                    "body": "I could explain a detailed list of why he's. You wouldn't agree because you know all the events I would put in that list but your perception of them was different. We would discuss this in several comments and nobody would change their minds about it. Instead of that, I would save both of us the trouble saying \"agree to disagree\" and move on.",
                                    "author": "thedoorsrebel",
                                    "id": "g374irq",
                                    "parent_id": "t1_g3749uj",
                                    "score": 1,
                                    "created_utc": 1598664150.0,
                                    "replies": [
                                        {
                                            "body": "Fair enough my dude. Not trynna change your mind really. Just sharing my opinion lol.",
                                            "author": "AtlasRafael",
                                            "id": "g37bkdx",
                                            "parent_id": "t1_g374irq",
                                            "score": 1,
                                            "created_utc": 1598668411.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "> He ruined the series for me \n\nsad",
                            "author": null,
                            "id": "g36y6kc",
                            "parent_id": "t1_g36xo4c",
                            "score": 2,
                            "created_utc": 1598660402.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "g37bh0p",
            "parent_id": "t1_g378xbu",
            "score": 0,
            "created_utc": 1598668354.0,
            "replies": []
        },
        {
            "body": "I understand what it is. Basically just them waiting for the manga to progress enough content to incorporate it into the anime, while still producing  episodes of the anime. That said I think it's fucking stupid",
            "author": "Schumeschu",
            "id": "g37dda5",
            "parent_id": "t1_g37cjng",
            "score": 0,
            "created_utc": 1598669526.0,
            "replies": [
                {
                    "body": "At least acknowledge the fact that you made a mistake in ur paragraph and just edited it..",
                    "author": null,
                    "id": "g3b8ybk",
                    "parent_id": "t1_g37dda5",
                    "score": 1,
                    "created_utc": 1598753941.0,
                    "replies": [
                        {
                            "body": "I wrote manga instead of anime in a context where I was clearly talking about anime. No reason to specify",
                            "author": "Schumeschu",
                            "id": "g3b9ea3",
                            "parent_id": "t1_g3b8ybk",
                            "score": 0,
                            "created_utc": 1598754204.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Absolutely. But I dont feel like it does many of the old characters dirty.",
            "author": "Schumeschu",
            "id": "g3721n4",
            "parent_id": "t1_g371ow9",
            "score": 1,
            "created_utc": 1598662688.0,
            "replies": []
        },
        {
            "body": "Wow man you are so funny",
            "author": "orbter",
            "id": "g36hmr7",
            "parent_id": "t1_g36hahu",
            "score": 4,
            "created_utc": 1598651369.0,
            "replies": [
                {
                    "body": "be honest that was good",
                    "author": "BiggieSmalls0",
                    "id": "g36ibh8",
                    "parent_id": "t1_g36hmr7",
                    "score": 23,
                    "created_utc": 1598651723.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Nah to me he was just an entitled brat. He ruined the series for me. You know when I rewatched it I had to stop when the kaguya's fight is over because I know after that the shitty bastard will pull that shit after everything that has happened, threatening the kages, the bijuus. I hate him. He should have died. Now I don't care what he does. It doesn't matter anymore. His time has passed.",
            "author": "thedoorsrebel",
            "id": "g36xo4c",
            "parent_id": "t1_g36w265",
            "score": 1,
            "created_utc": 1598660097.0,
            "replies": [
                {
                    "body": "Entitled brat? Lol do you not know what happened? He’s not entitled at all. \n\nI used to hate him, but he became on of my favorite characters.",
                    "author": "AtlasRafael",
                    "id": "g3749uj",
                    "parent_id": "t1_g36xo4c",
                    "score": 3,
                    "created_utc": 1598664003.0,
                    "replies": [
                        {
                            "body": "I could explain a detailed list of why he's. You wouldn't agree because you know all the events I would put in that list but your perception of them was different. We would discuss this in several comments and nobody would change their minds about it. Instead of that, I would save both of us the trouble saying \"agree to disagree\" and move on.",
                            "author": "thedoorsrebel",
                            "id": "g374irq",
                            "parent_id": "t1_g3749uj",
                            "score": 1,
                            "created_utc": 1598664150.0,
                            "replies": [
                                {
                                    "body": "Fair enough my dude. Not trynna change your mind really. Just sharing my opinion lol.",
                                    "author": "AtlasRafael",
                                    "id": "g37bkdx",
                                    "parent_id": "t1_g374irq",
                                    "score": 1,
                                    "created_utc": 1598668411.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "> He ruined the series for me \n\nsad",
                    "author": null,
                    "id": "g36y6kc",
                    "parent_id": "t1_g36xo4c",
                    "score": 2,
                    "created_utc": 1598660402.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "At least acknowledge the fact that you made a mistake in ur paragraph and just edited it..",
            "author": null,
            "id": "g3b8ybk",
            "parent_id": "t1_g37dda5",
            "score": 1,
            "created_utc": 1598753941.0,
            "replies": [
                {
                    "body": "I wrote manga instead of anime in a context where I was clearly talking about anime. No reason to specify",
                    "author": "Schumeschu",
                    "id": "g3b9ea3",
                    "parent_id": "t1_g3b8ybk",
                    "score": 0,
                    "created_utc": 1598754204.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "be honest that was good",
            "author": "BiggieSmalls0",
            "id": "g36ibh8",
            "parent_id": "t1_g36hmr7",
            "score": 23,
            "created_utc": 1598651723.0,
            "replies": []
        },
        {
            "body": "Entitled brat? Lol do you not know what happened? He’s not entitled at all. \n\nI used to hate him, but he became on of my favorite characters.",
            "author": "AtlasRafael",
            "id": "g3749uj",
            "parent_id": "t1_g36xo4c",
            "score": 3,
            "created_utc": 1598664003.0,
            "replies": [
                {
                    "body": "I could explain a detailed list of why he's. You wouldn't agree because you know all the events I would put in that list but your perception of them was different. We would discuss this in several comments and nobody would change their minds about it. Instead of that, I would save both of us the trouble saying \"agree to disagree\" and move on.",
                    "author": "thedoorsrebel",
                    "id": "g374irq",
                    "parent_id": "t1_g3749uj",
                    "score": 1,
                    "created_utc": 1598664150.0,
                    "replies": [
                        {
                            "body": "Fair enough my dude. Not trynna change your mind really. Just sharing my opinion lol.",
                            "author": "AtlasRafael",
                            "id": "g37bkdx",
                            "parent_id": "t1_g374irq",
                            "score": 1,
                            "created_utc": 1598668411.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "> He ruined the series for me \n\nsad",
            "author": null,
            "id": "g36y6kc",
            "parent_id": "t1_g36xo4c",
            "score": 2,
            "created_utc": 1598660402.0,
            "replies": []
        },
        {
            "body": "I wrote manga instead of anime in a context where I was clearly talking about anime. No reason to specify",
            "author": "Schumeschu",
            "id": "g3b9ea3",
            "parent_id": "t1_g3b8ybk",
            "score": 0,
            "created_utc": 1598754204.0,
            "replies": []
        },
        {
            "body": "I could explain a detailed list of why he's. You wouldn't agree because you know all the events I would put in that list but your perception of them was different. We would discuss this in several comments and nobody would change their minds about it. Instead of that, I would save both of us the trouble saying \"agree to disagree\" and move on.",
            "author": "thedoorsrebel",
            "id": "g374irq",
            "parent_id": "t1_g3749uj",
            "score": 1,
            "created_utc": 1598664150.0,
            "replies": [
                {
                    "body": "Fair enough my dude. Not trynna change your mind really. Just sharing my opinion lol.",
                    "author": "AtlasRafael",
                    "id": "g37bkdx",
                    "parent_id": "t1_g374irq",
                    "score": 1,
                    "created_utc": 1598668411.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Fair enough my dude. Not trynna change your mind really. Just sharing my opinion lol.",
            "author": "AtlasRafael",
            "id": "g37bkdx",
            "parent_id": "t1_g374irq",
            "score": 1,
            "created_utc": 1598668411.0,
            "replies": []
        }
    ]
}