{
    "title": "Don't be a pussy about asking for money",
    "post_id": "bk1kxs",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/bk1kxs/dont_be_a_pussy_about_asking_for_money/",
    "author": "KineticEngineer",
    "body": "...or, in the man's case, about offering money. I think there is one fundamental skill that some posters here lack, and it is this:\n\n* Be able to hear NO without having an ego reaction.\n\nIf you are rejected, all it means is that you are incompatible with someone. It does not make you ugly, unlovable, less of a woman or a man, or anything else. It's just a fact about expectations of two people not matching. Salespeople usually develop this skill to a high level, because you have 99 people tell you no, and you have to talk to person 100 as though he's the first person you've spoken to today. But non-sales people, especially \"sweet introverts,\" can take a NO as though it means they are horrible and their life is over. Well, get over it. Whatever you need to make that happen, get over it.\n\nWomen are afraid to ask for money because what if it spoils the date. Men are afraid to offer money, even if they have it, because if she says she wants more, it means that he is too ugly and worthless to get a date even if he pays for it.  Well, all y'all need to toughen up. Ask for something you'd be happy giving or receiving. You can always negotiate after you ask. But if you don't ask at all, it's your own damn fault if nobody ever deals with the topic ever.\n\nNOT GOOD ENOUGH:\n\n1. I would like to spoil you.\n2. I would like an allowance.\n\nGOOD ENOUGH:\n\n1. How about $X per meeting or per month, provided in Y way?\n\nDo not allow wiggle room. Be specific and clear. It is perfectly fine to be disappointed if the other person says no. But if you feel a stronger emotion, you probably need to work on that. You are reacting to something that is more than the actual situation.\n\nWHEN TO ASK:\n\nI have a preference, but other people here, whose posts seem real -- but of course none of us here can verify anything -- have very different preferences about this. So I don't want to give some how-to guide. There is no bible, and no Sugar Oracle. Your approach might be totally different from mine. But whatever you do, chill out and think like a business person, especially when it comes to asking for money.\n\nThank you for reading my rant.",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/bk1kxs/dont_be_a_pussy_about_asking_for_money/",
    "score": 164,
    "upvote_ratio": 0.96,
    "created_utc": 1556839194.0,
    "num_comments": 75,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "This x’s 10000!! I’ve learned the hard way that closed mouths don’t get fed and now I’m always upfront with what I expect and I’m not scared to ask for allowance when allowance is due. \n\nAlso, you should’ve ended this with “thank you for coming to my TED Talk” 😂",
            "author": "Jade_1295",
            "id": "emd6gzv",
            "parent_id": "t3_bk1kxs",
            "score": 38,
            "created_utc": 1556842399.0,
            "replies": [
                {
                    "body": "Can u give tips to get into this mindset? I think ive grown comfy in my arrangement and am settling for less",
                    "author": "mamivivi",
                    "id": "emd7vc2",
                    "parent_id": "t1_emd6gzv",
                    "score": 8,
                    "created_utc": 1556843322.0,
                    "replies": [
                        {
                            "body": "> I think ive grown comfy in my arrangement\n\nIf you're \"comfy,\" I don't see why you need to change anything? If you're unhappy, that's one thing. But finding an SD you actually enjoy (I'm presuming you're an SB based on your username), can be a struggle. But, generally speaking, if you ask for more in an established arrangement, you risk losing the arrangement altogether. If you're fine with that, you just need to not tie his ability/desire to spend more on an arrangement to who you are as a person. For most SDs most of the time, our allowance is determined more by what is going on inside of us than any particular attribute(s) of the SB. You shouldn't think it is about you because, usually, it isn't.",
                            "author": "This_is_Not_My_Handl",
                            "id": "emf6zqn",
                            "parent_id": "t1_emd7vc2",
                            "score": 3,
                            "created_utc": 1556901666.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "When I was still a sugar newbie I encountered a couple of guys who would state how they would definitely provide an ‘allowance / financial support / take care’ of me - all the right words but without naming an actual amount. \n\nDue to being unaware, I went through with some dates without gathering specifics - which came with the realisation that these guys more often than not were defining $30 as an ‘allowance’ or dinner at a casual gastrobar as ‘financial support / taking care’ of me. \n\nThey were either oblivious to and thought it was perfectly acceptable or were deliberately trying to manipulate me. \n\nThis is why I ALWAYS discuss expectations now to make sure everyone is clear and comfortable with what they’re getting into and what they’re in for.",
            "author": "youcalyptusplatypus",
            "id": "emdqwvq",
            "parent_id": "t3_bk1kxs",
            "score": 22,
            "created_utc": 1556856407.0,
            "replies": [
                {
                    "body": "This is why hearing \"SDs\" say talking about money before/during a M&G is a turn off is annoying.",
                    "author": "bsbdfw",
                    "id": "emfqapv",
                    "parent_id": "t1_emdqwvq",
                    "score": 9,
                    "created_utc": 1556914456.0,
                    "replies": []
                },
                {
                    "body": "Im a guy and they were just being assholes lol. Im so sorry.",
                    "author": "Mechfire11",
                    "id": "eme1hkw",
                    "parent_id": "t1_emdqwvq",
                    "score": 9,
                    "created_utc": 1556866640.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I agree. I use to put exactly how much I was offering in my SA profile until they changed the rules. \n\nNow on my profile I just tell women how much I use to spend on my golf hobby every month then I mention I don't play golf anymore. They can figure out the rest. \n\nI don't mind a woman stating exactly how much she's looking for in a message or at the meet and greet. I expect it because it's only fair. Unless a woman shows up  wearing a burka I know exactly what I'm getting from her in the looks department. So it's only fair that she know what she's getting from me in the financial department.",
            "author": null,
            "id": "emd50mk",
            "parent_id": "t3_bk1kxs",
            "score": 52,
            "created_utc": 1556841393.0,
            "replies": [
                {
                    "body": "Your approach is amazing. If only every SD (or their profile, at least) were like you.",
                    "author": null,
                    "id": "eme71y1",
                    "parent_id": "t1_emd50mk",
                    "score": 13,
                    "created_utc": 1556873340.0,
                    "replies": [
                        {
                            "body": "The thing is, I used to state my allowance in my opening message and I found that I find much happier SRs with SBs if we don't discuss $ until the m&g. I let them know I provide a cash allowance but save the details until after I've hooked her on my charm and wit.",
                            "author": "This_is_Not_My_Handl",
                            "id": "emf7s65",
                            "parent_id": "t1_eme71y1",
                            "score": 2,
                            "created_utc": 1556902186.0,
                            "replies": [
                                {
                                    "body": "That's cool that it works for you! I kind of gave up on going on m& g's before discussing numbers, unless they seemed especially charming while messaging. Guess you can use that to your advantage for sure!",
                                    "author": null,
                                    "id": "emfi5q9",
                                    "parent_id": "t1_emf7s65",
                                    "score": 6,
                                    "created_utc": 1556909184.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "The problem with doing that is the risk of overpaying.",
                            "author": null,
                            "id": "emeqebl",
                            "parent_id": "t1_eme71y1",
                            "score": -5,
                            "created_utc": 1556890838.0,
                            "replies": [
                                {
                                    "body": "\"overpaying\" has many benefits in an SR. Less ghosting, flaking, less bad treatment and communication, more willingness to keep you satisfied - oh, and also, a little thing called helping your SB better their life. Is that really overpaying if you can buy all those things for a few more $$$ each time to meet?",
                                    "author": null,
                                    "id": "emf2tgr",
                                    "parent_id": "t1_emeqebl",
                                    "score": 14,
                                    "created_utc": 1556898916.0,
                                    "replies": [
                                        {
                                            "body": ">Less ghosting, flaking, less bad treatment and communication, more willingness to keep you satisfied \n\nThat's just a myth as money doesn't automatically get you a better SR.\n\nIn fact, vetting is way cheaper and effective at getting the benefits you mention.\n\n>oh, and also, a little thing called helping your SB better their life.\n\nI never get this, SRs aren't charity, they are mutually beneficial.\n\nI can think of a million better ways to do charity than giving money to an SB..",
                                            "author": null,
                                            "id": "emgrktk",
                                            "parent_id": "t1_emf2tgr",
                                            "score": -1,
                                            "created_utc": 1556945755.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "You always have the option of saying no at the M&G. There are a lot of risks in the world and in sugar and \"overpaying\" is about the most minimal. What Don has done is to provide certainty to prospects that if there is a relationship the allowance is a knowable amount early on.  My guess is that most SB who would find the allowance acceptable would put him at the top of their  \"investigate further quickly \" list .  Probably a welcome change for the SB suffering through seemingly endless \"experience daddies\",  or well with the allowance you can fly anywhere you want (within the state of RI)  or I am so important  you don't need an allowance.  \n\n\n\n Value lies in the eye of the beholder (I would pay a lot for most modern art - that is pay to exclude it from my home and business) others swoon over the same stuff)",
                                    "author": "pinotandsugar",
                                    "id": "emezy68",
                                    "parent_id": "t1_emeqebl",
                                    "score": 10,
                                    "created_utc": 1556897055.0,
                                    "replies": [
                                        {
                                            "body": "\n> What Don has done is to provide certainty to prospects that if there is a relationship the allowance is a knowable amount early on.\n\nStating what I am offering also helps me avoid  the uncomfortable conversation of putting a price on an individual lady's worth.\n\nImagine you're a SB expecting men to offer you 5X and then I offer only 4X. You might see it as an insult when really it's not. It's just what my budget is. I'm just barely rich but I have no family or obligations so I can afford to offer a competitive allowance.  But I do have a limit and I prefer the women know this upfront. \n\nActually, I understate what I'm offering by just a little bit. Then I up the offer to what it should be if the meet and greet goes well. That way I get to give a little flattery by telling them they're the best potential SB I've met and I'm willing to offer a little more.",
                                            "author": null,
                                            "id": "emfaqpb",
                                            "parent_id": "t1_emezy68",
                                            "score": 9,
                                            "created_utc": 1556904176.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "100% agree with this",
                                            "author": null,
                                            "id": "emf2gg6",
                                            "parent_id": "t1_emezy68",
                                            "score": 3,
                                            "created_utc": 1556898681.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "For me there is no overpaying because I offer what I want to pay. I don't negotiate. If she wants more, I say no unless she's bringing something extra to the relationship. If she wants less I say no. Because I don't want a discount SB .",
                                    "author": null,
                                    "id": "emf9m9b",
                                    "parent_id": "t1_emeqebl",
                                    "score": 11,
                                    "created_utc": 1556903424.0,
                                    "replies": []
                                },
                                {
                                    "body": "> risk of overpaying\n\nI guess I don't understand how this is a thing. Is this the SD equivalent of SBs worrying they're settling for too little? Like, they would be happy but for the people telling them they shouldn't be? I mean, if you put in your profile what your budget is, you only need to meet with people you're happy to spend that budget on. It can be whatever you want. It's not like the golf story has to be true.",
                                    "author": "This_is_Not_My_Handl",
                                    "id": "emf7j9b",
                                    "parent_id": "t1_emeqebl",
                                    "score": 6,
                                    "created_utc": 1556902021.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Love this approach!",
                    "author": "deep-blue-nothing",
                    "id": "emd78oh",
                    "parent_id": "t1_emd50mk",
                    "score": 7,
                    "created_utc": 1556842896.0,
                    "replies": []
                },
                {
                    "body": "Very detailed response. I like this (your) way of thinking. I don't usually see this type of answer anywhere irl",
                    "author": "mamivivi",
                    "id": "emd7qye",
                    "parent_id": "t1_emd50mk",
                    "score": 4,
                    "created_utc": 1556843240.0,
                    "replies": [
                        {
                            "body": "Good agreements make for good relationships .......",
                            "author": "pinotandsugar",
                            "id": "emdu2df",
                            "parent_id": "t1_emd7qye",
                            "score": 4,
                            "created_utc": 1556859132.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Thanks for making me stop whining to myself and see that I need to toughen up!! Great post.",
            "author": "SugarDavina",
            "id": "emd7yye",
            "parent_id": "t3_bk1kxs",
            "score": 10,
            "created_utc": 1556843391.0,
            "replies": [
                {
                    "body": "I think I saw your photo. You're Inara of Bohemia, right? Toughen up and you'll do great. I've seen a lot of profiles over the years, and your look is attractive and rare.",
                    "author": "KineticEngineer",
                    "id": "emd8gq1",
                    "parent_id": "t1_emd7yye",
                    "score": 6,
                    "created_utc": 1556843729.0,
                    "replies": [
                        {
                            "body": "Damn guy I thought my Helen of Troy allusion in the picture thread was strong, but hats off...breaking out the Whedon references. 🎩",
                            "author": null,
                            "id": "emdsmru",
                            "parent_id": "t1_emd8gq1",
                            "score": 3,
                            "created_utc": 1556857856.0,
                            "replies": [
                                {
                                    "body": "Eh, more kind of you than I deserved. Too obscure. I'm sure she understood your comment, and she definitely didn't understand mine.",
                                    "author": "KineticEngineer",
                                    "id": "emdtk77",
                                    "parent_id": "t1_emdsmru",
                                    "score": 1,
                                    "created_utc": 1556858679.0,
                                    "replies": [
                                        {
                                            "body": "I should have complimented the original post, too.  Most informative/discussion-sparking of the day.\n\nAnd this is reddit, where obscure pop culture references rule.",
                                            "author": null,
                                            "id": "emdtuh1",
                                            "parent_id": "t1_emdtk77",
                                            "score": 1,
                                            "created_utc": 1556858927.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "As I’m not sure what/who Inara of Bohemia is, I think you got the wrong person. I’ll still take the compliment though, thanks! 😝",
                            "author": "SugarDavina",
                            "id": "emd8oui",
                            "parent_id": "t1_emd8gq1",
                            "score": 1,
                            "created_utc": 1556843881.0,
                            "replies": [
                                {
                                    "body": "Inara was a character on Firefly, a dark-haired professional companion. Bohemian clothing you may know better as boho chic. Sorry for my personal shorthand (or longhand). It's what I thought to myself when I saw your pic.",
                                    "author": "KineticEngineer",
                                    "id": "emd8vrq",
                                    "parent_id": "t1_emd8oui",
                                    "score": 2,
                                    "created_utc": 1556844008.0,
                                    "replies": [
                                        {
                                            "body": "Oh my god you’re comparing me to Morena Baccarin? 😱 I am most flattered!! I like your shorthand (and longhand), so no worries. Again thank you for the compliment, and for the post!",
                                            "author": "SugarDavina",
                                            "id": "emd9etz",
                                            "parent_id": "t1_emd8vrq",
                                            "score": 5,
                                            "created_utc": 1556844355.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "emd5bce",
            "parent_id": "t3_bk1kxs",
            "score": 16,
            "created_utc": 1556841597.0,
            "replies": [
                {
                    "body": "I would block and move on. This is a huge red flag and you are going to continually have to worry about him scamming you.",
                    "author": "MsDReid",
                    "id": "emd5u5w",
                    "parent_id": "t1_emd5bce",
                    "score": 20,
                    "created_utc": 1556841962.0,
                    "replies": []
                },
                {
                    "body": "Im dealing w same bs... i just think it's time to move on. I want to be his sb but he never has time. Im always scared to ask and its lowballs. Idk dealing kinda sticky",
                    "author": "mamivivi",
                    "id": "emd7gn2",
                    "parent_id": "t1_emd5bce",
                    "score": 6,
                    "created_utc": 1556843046.0,
                    "replies": [
                        {
                            "body": ">\"\"  take it or leave it. \"\"\"\n\nthere's only one reply      Adios",
                            "author": "pinotandsugar",
                            "id": "emdu48q",
                            "parent_id": "t1_emd7gn2",
                            "score": 4,
                            "created_utc": 1556859181.0,
                            "replies": [
                                {
                                    "body": "I don't think you *say* take it or leave it. But I think that is a perfectly reasonable mentality. Just don't get pissed when the other person leaves it.",
                                    "author": "This_is_Not_My_Handl",
                                    "id": "emf822u",
                                    "parent_id": "t1_emdu48q",
                                    "score": 2,
                                    "created_utc": 1556902370.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "I don't negotiate. I ask for her number. If I like it, we move forward. If not, I move on. Usually, she doesn't have a number and accepts mine. I believe if you're negotiating, it's because you lack genuine chemistry.",
                    "author": "This_is_Not_My_Handl",
                    "id": "emf7wbd",
                    "parent_id": "t1_emd5bce",
                    "score": -1,
                    "created_utc": 1556902263.0,
                    "replies": []
                },
                {
                    "body": ">  take it or leave it.\n\nThere are better ways to phrase this but at least he is clear about what he is willing to pay. There is no ambiguity.",
                    "author": "GSSD",
                    "id": "emeom7h",
                    "parent_id": "t1_emd5bce",
                    "score": 0,
                    "created_utc": 1556889642.0,
                    "replies": [
                        {
                            "body": "I am speculating OP is paraphrasing. If either person actually *says* take it or leave it, that person can fuck right off. But there is nothing wrong with the mentality.",
                            "author": "This_is_Not_My_Handl",
                            "id": "emf85kb",
                            "parent_id": "t1_emeom7h",
                            "score": 3,
                            "created_utc": 1556902435.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Good post, I think a lot of new SBs and SDs need to get this.",
            "author": "snake_pod",
            "id": "emde5wu",
            "parent_id": "t3_bk1kxs",
            "score": 7,
            "created_utc": 1556847480.0,
            "replies": []
        },
        {
            "body": "Yes! THIS 😍",
            "author": "Serwe8",
            "id": "emd2w4o",
            "parent_id": "t3_bk1kxs",
            "score": 6,
            "created_utc": 1556839998.0,
            "replies": []
        },
        {
            "body": "Amen to that!",
            "author": "azucarExotica",
            "id": "emd6w0h",
            "parent_id": "t3_bk1kxs",
            "score": 5,
            "created_utc": 1556842669.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "emd8lv5",
            "parent_id": "t3_bk1kxs",
            "score": 4,
            "created_utc": 1556843826.0,
            "replies": [
                {
                    "body": "I started talking money before M&G once I realized how much time was wasted coordinating with people who weren't even remotely on the same page in terms of expectations.  I know there are some who want to gauge their \"offer\" based on the meet, but IME that's the exception and most are willing to talk about \"what details will look like if we hit it off when we meet\".",
                    "author": "MousieSweets",
                    "id": "emd9kd6",
                    "parent_id": "t1_emd8lv5",
                    "score": 6,
                    "created_utc": 1556844459.0,
                    "replies": []
                },
                {
                    "body": "It seems as though opinions are widely split on the forum about this.",
                    "author": "KineticEngineer",
                    "id": "emd90o1",
                    "parent_id": "t1_emd8lv5",
                    "score": 2,
                    "created_utc": 1556844096.0,
                    "replies": []
                },
                {
                    "body": "I've done it both ways. I vastly prefer waiting for the m&g to discuss numbers but I make it clear that my allowance is cash early in messaging (and not experience or any other such nonsense).",
                    "author": "This_is_Not_My_Handl",
                    "id": "emf8kux",
                    "parent_id": "t1_emd8lv5",
                    "score": 1,
                    "created_utc": 1556902721.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "emd2w5g",
            "parent_id": "t3_bk1kxs",
            "score": 4,
            "created_utc": 1556839998.0,
            "replies": [
                {
                    "body": "Your ego is so fat, it needs its own area code.",
                    "author": "KineticEngineer",
                    "id": "emd37nw",
                    "parent_id": "t1_emd2w5g",
                    "score": 14,
                    "created_utc": 1556840201.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Excellent advice to us all.",
            "author": "GSSD",
            "id": "emeoo6v",
            "parent_id": "t3_bk1kxs",
            "score": 5,
            "created_utc": 1556889680.0,
            "replies": []
        },
        {
            "body": "I'm so new to this and intimidated by both. I guess i need to let go of lot of hang ups before I can be happy here.",
            "author": "bbypizza",
            "id": "eme253n",
            "parent_id": "t3_bk1kxs",
            "score": 3,
            "created_utc": 1556867409.0,
            "replies": []
        },
        {
            "body": "Thanks! This is good mature advice. With your permission I will include it in my Bootcamp for Sugar Babies",
            "author": "doctorcoolpop",
            "id": "emd8i0d",
            "parent_id": "t3_bk1kxs",
            "score": 4,
            "created_utc": 1556843753.0,
            "replies": [
                {
                    "body": "I have no idea what that is, but feel free.",
                    "author": "KineticEngineer",
                    "id": "emd8nnm",
                    "parent_id": "t1_emd8i0d",
                    "score": 4,
                    "created_utc": 1556843859.0,
                    "replies": [
                        {
                            "body": "It's just an idea I have",
                            "author": "doctorcoolpop",
                            "id": "emd9dn4",
                            "parent_id": "t1_emd8nnm",
                            "score": 3,
                            "created_utc": 1556844333.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "emd66ju",
            "parent_id": "t3_bk1kxs",
            "score": 2,
            "created_utc": 1556842203.0,
            "replies": [
                {
                    "body": "I agree with you. But gotta walk before you can run, you know?",
                    "author": "KineticEngineer",
                    "id": "emd7he4",
                    "parent_id": "t1_emd66ju",
                    "score": 4,
                    "created_utc": 1556843061.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Your \"when to ask\" section struck a chord with me, I've been noticing the same schism on the forum.  Seems like SDs have the stronger opinions about it.",
            "author": "bothsidesoftheplanet",
            "id": "emdmaqw",
            "parent_id": "t3_bk1kxs",
            "score": 1,
            "created_utc": 1556852802.0,
            "replies": []
        },
        {
            "body": "Great post. So true.",
            "author": "liliflower85",
            "id": "emewrju",
            "parent_id": "t3_bk1kxs",
            "score": 1,
            "created_utc": 1556895097.0,
            "replies": []
        },
        {
            "body": "Absolutely right!\n\nWish I was better at it myself. I get worn down sometimes by the unrealistic #s sometimes and ask what they want so I can assess whether I can even come close.",
            "author": "Bassrat54",
            "id": "emdgeti",
            "parent_id": "t3_bk1kxs",
            "score": 1,
            "created_utc": 1556848970.0,
            "replies": [
                {
                    "body": "The truly unrealistic ones usually out themselves well before the M&G.  They can't wait to tell you exactly what their \"last SD gave me\" and then proceed to claim they were getting 6-figures a year, yet all their pictures show them in bare feet and cut off jean shorts.",
                    "author": null,
                    "id": "emdji5j",
                    "parent_id": "t1_emdgeti",
                    "score": 1,
                    "created_utc": 1556850922.0,
                    "replies": [
                        {
                            "body": ">The truly unrealistic ones usually out themselves well before the M&G.\n\nThis has been my experience as well. They either say my last SD gave me this, or without any provocation just offer up the amount they're looking for per date, even before moving to text. This is one of the reasons I've been able to go on so meet and greets without discussing allowance in advance. Because 99% of the time the ones that will meet you without discussing money are either reasonable with what they want (meaning close the the area average), or they are willing to accept your offer if they have no idea what's an acceptable amount.  Only once did I meet someone whose monthly was way out of line with what I was willing to give. She was a good negotiator, and even offered to see me 4 additional times per month to get that amount. Other then that, every POT that I met, that made it past the meet and greet into a 2nd date, all ended up agreeing, what I was willing to offer.",
                            "author": "ruphun",
                            "id": "emeat7s",
                            "parent_id": "t1_emdji5j",
                            "score": -1,
                            "created_utc": 1556877986.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "This SD I met says he only likes to spend money on traveling/vacations but he is so dreamy I don't even mind. Tonight we had an amazing dinner, wine and conversation, I just cannot wait to get intimate with him 😍😍",
            "author": "sugasuga24",
            "id": "emdi3j2",
            "parent_id": "t3_bk1kxs",
            "score": -1,
            "created_utc": 1556850062.0,
            "replies": [
                {
                    "body": "How is that a SD though? I've dated vanilla guys who always pay when we're traveling and don't even let me pay for things like dinner lol",
                    "author": "calisugar",
                    "id": "emdvt8p",
                    "parent_id": "t1_emdi3j2",
                    "score": 4,
                    "created_utc": 1556860650.0,
                    "replies": [
                        {
                            "body": ">How is that a SD though?\n\nthe difference is, most vanillas arent going to do that all the time, and its not always going to be first class, to premier destinations.\n\n&#x200B;\n\nThat type of SD is called an Experience Daddy. It's another form of sugar dating. Some women care more about going to the trendiest restaurants, and A-List events, going on yachts and private jets, then getting an allowance. We have a few members on this sub reddit that are experience SD/SB.",
                            "author": "ruphun",
                            "id": "emeb191",
                            "parent_id": "t1_emdvt8p",
                            "score": 1,
                            "created_utc": 1556878277.0,
                            "replies": [
                                {
                                    "body": "They will do that all the time cause how’s they are. They were raised to take care of their women. These normal guys might stay in 5 star hotels, but they aren’t flying us first class or getting invited to the hottest events, so you’re right about that. It’s a big reason why I’ve been single for yearssss. I don’t want to feel bad or guilty for living my life and doing these things without him, so I never cared to get serious.\n\nBut an experience daddy?! You’ve got to be kidding me... If by experience you mean he’s done this before and it’s your first time then yeah lol. Ask yourself, what would be the difference for him between an “experience” baby and a girl he is a vanilla dating? Without the allowance, there is no difference!!! He would still be flying her first class and taking her to events as his date... just like he would with any vanilla girlfriend. Y’all are being manipulated and you don’t even realize it. If you want to get invited to A-list events, yacht parties and private jets... then move to a large metropolitan city and network into these circles (usually models). If you’re attractive and outgoing, you’ll get invited. Sex isn’t expected. They need us. You’re just there to have fun and make them look good. \n\nMen who have access to these events and use that to bait you into sleeping with them are the worst. They are master manipulators. The more inexperienced, younger, and naive you are, the better. They know that lifestyle is enticing to new girls. At the end of the day, you’re getting the short end of the stick because he’s using these experiences as leverage for sugar. Which is worst than vanilla dating. At least with vanilla dating, he isn’t doing things because he’s expecting something in return. He’s doing it because he wants to and not because he’s going to use it against you later. \n\nEdit: Sorry thought you were a SB, so my post is written that way, but everything still applies",
                                    "author": "calisugar",
                                    "id": "emek4d9",
                                    "parent_id": "t1_emeb191",
                                    "score": 4,
                                    "created_utc": 1556886567.0,
                                    "replies": [
                                        {
                                            "body": "Hopefully some of the Experience SD and SB that post on this forum will share their input.  The truth of the matter is not every SB is some destitute college woman. Some actually have good paying jobs and forego the allowance to experience things they can’t afford or don’t want to splurge on themselves. Typically experience daddies also give gifts and take them shopping too. Speaking from personal experience I’ve been in a SR like this previously, as well as allowance based ones too.",
                                            "author": "ruphun",
                                            "id": "emeotwn",
                                            "parent_id": "t1_emek4d9",
                                            "score": 0,
                                            "created_utc": 1556889785.0,
                                            "replies": [
                                                {
                                                    "body": "So have you and your SB partied on yachts and traveled on private jets? And how was being an experience SD any different than being a vanilla boyfriend, for you? Wouldn't you treat your girlfriend with experiences and gifts as well? Or does the sugar daddy title only depend on how desperate a woman is? Seems like you're just getting the best of both worlds. Free sex without having to deal with the messy commitment parts of a relationship.\n\nYou don't have to be a destitute college student to appreciate money. A financially stable SB will put up with less BS because she's not broke or desperate, but it doesn't mean she can't use the money. She can always put the money into savings or a retirement fund or splurge on gifts for herself. If gifts and shopping are her compensation, then it seems like the \"experience SD\" is just a workaround for SD's with fragile egos",
                                                    "author": "calisugar",
                                                    "id": "emeu70i",
                                                    "parent_id": "t1_emeotwn",
                                                    "score": 4,
                                                    "created_utc": 1556893477.0,
                                                    "replies": [
                                                        {
                                                            "body": "[deleted]",
                                                            "author": null,
                                                            "id": "emexjua",
                                                            "parent_id": "t1_emeu70i",
                                                            "score": 0,
                                                            "created_utc": 1556895575.0,
                                                            "replies": [
                                                                {
                                                                    "body": "I'm okay with that. I'm not okay with men taking advantage of young desperate girls by selling an illusion. u/ruphun claims he was an \"experience SD\" yet he didn't even fit the description he gave me himself (jets and yachts)",
                                                                    "author": "calisugar",
                                                                    "id": "emf9tkn",
                                                                    "parent_id": "t1_emexjua",
                                                                    "score": 5,
                                                                    "created_utc": 1556903559.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "[deleted]",
                                                                            "author": null,
                                                                            "id": "emffjev",
                                                                            "parent_id": "t1_emf9tkn",
                                                                            "score": 0,
                                                                            "created_utc": 1556907426.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "It's called dating. Simple as that. Experience SDs are not a thing.",
                                                                                    "author": "calisugar",
                                                                                    "id": "emfgc3l",
                                                                                    "parent_id": "t1_emffjev",
                                                                                    "score": 4,
                                                                                    "created_utc": 1556907963.0,
                                                                                    "replies": [
                                                                                        {
                                                                                            "body": "[deleted]",
                                                                                            "author": null,
                                                                                            "id": "emfgn3e",
                                                                                            "parent_id": "t1_emfgc3l",
                                                                                            "score": -1,
                                                                                            "created_utc": 1556908169.0,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "body": "I've dated a couple people, but not seriously. Not serious enough to call my boyfriend and never became an official couple.",
                                                                                                    "author": "calisugar",
                                                                                                    "id": "emfh0or",
                                                                                                    "parent_id": "t1_emfgn3e",
                                                                                                    "score": 2,
                                                                                                    "created_utc": 1556908424.0,
                                                                                                    "replies": []
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "body": "Some women don’t want an allowance plain and simple. They prefer to be treated like a spoiled GF rather then a SB. Yes it’s like being in a friends with benefits type relationship but with additional perks for her.",
                                                            "author": "ruphun",
                                                            "id": "emevh96",
                                                            "parent_id": "t1_emeu70i",
                                                            "score": 0,
                                                            "created_utc": 1556894297.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Unless you would vanilla date him, I would be careful. That's a popular manipulation tactic.",
                    "author": "dancingqw33n17",
                    "id": "eme5vls",
                    "parent_id": "t1_emdi3j2",
                    "score": 4,
                    "created_utc": 1556871880.0,
                    "replies": [
                        {
                            "body": "Well he doesn't want to vanilla date but that's okay because either do I. He was upfront about what he wanted so if I wasn't cool with that it would be up to me to search elsewhere. I really don't get a manipulative vibe from him though, he is a gentleman and hasn't even asked for pictures or made me feel I have to sleep with him, but I want to....he is very much handsome, intelligent, classy and only 12 years older than I. My last wasn't the best looking but we seemed to connect until he started acting manipulative and showed his true colours. We actually had a ppm arrangement so now I get the impression that not every SD who offers ppm or allowance is going to be the best for me, even though the financial aspect would be helpful.",
                            "author": "sugasuga24",
                            "id": "emeebup",
                            "parent_id": "t1_eme5vls",
                            "score": 0,
                            "created_utc": 1556881759.0,
                            "replies": [
                                {
                                    "body": "Not asking for a bunch of pics and being polite is pretty normal, so please don't take too much from that. I have a experience/gifts/trips SD, so I'm not saying it from a judgemental place. Since he's really good to me, I noticed a pattern with the guys who aren't. One is claiming to ONLY do vacations. \n\nIf you still need or just want a PPM/allowance, don't settle because there's assholes every where. There's this myth that rich= mean, and that's not true. My vanilla bf in college was manipulative and he made $16 an hr",
                                    "author": "dancingqw33n17",
                                    "id": "emermon",
                                    "parent_id": "t1_emeebup",
                                    "score": 5,
                                    "created_utc": 1556891710.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "[removed]",
            "author": null,
            "id": "emeab7p",
            "parent_id": "t3_bk1kxs",
            "score": -4,
            "created_utc": 1556877349.0,
            "replies": [
                {
                    "body": "You forgot the /s...",
                    "author": null,
                    "id": "emekay2",
                    "parent_id": "t1_emeab7p",
                    "score": 3,
                    "created_utc": 1556886702.0,
                    "replies": []
                },
                {
                    "body": "Services? You’re obviously a John not a SD",
                    "author": "biggiemalls",
                    "id": "emeiauu",
                    "parent_id": "t1_emeab7p",
                    "score": 2,
                    "created_utc": 1556885138.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[removed]",
            "author": null,
            "id": "emdeyo7",
            "parent_id": "t3_bk1kxs",
            "score": -14,
            "created_utc": 1556847998.0,
            "replies": [
                {
                    "body": "BS , this is just Negotiation  for someone’s time and interest . Nothing to do with prostitution",
                    "author": "elan1345",
                    "id": "emdsk91",
                    "parent_id": "t1_emdeyo7",
                    "score": 9,
                    "created_utc": 1556857791.0,
                    "replies": [
                        {
                            "body": "It’s as if many posters on this sub completely missed the community discussion last week on the prostitution-escort-sugar-gold-trophy spectrum.",
                            "author": "FlexEconGuy",
                            "id": "emebhi6",
                            "parent_id": "t1_emdsk91",
                            "score": 1,
                            "created_utc": 1556878830.0,
                            "replies": [
                                {
                                    "body": "Could you point me to that?",
                                    "author": "biggiemalls",
                                    "id": "emeika7",
                                    "parent_id": "t1_emebhi6",
                                    "score": 1,
                                    "created_utc": 1556885353.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Can u give tips to get into this mindset? I think ive grown comfy in my arrangement and am settling for less",
            "author": "mamivivi",
            "id": "emd7vc2",
            "parent_id": "t1_emd6gzv",
            "score": 8,
            "created_utc": 1556843322.0,
            "replies": [
                {
                    "body": "> I think ive grown comfy in my arrangement\n\nIf you're \"comfy,\" I don't see why you need to change anything? If you're unhappy, that's one thing. But finding an SD you actually enjoy (I'm presuming you're an SB based on your username), can be a struggle. But, generally speaking, if you ask for more in an established arrangement, you risk losing the arrangement altogether. If you're fine with that, you just need to not tie his ability/desire to spend more on an arrangement to who you are as a person. For most SDs most of the time, our allowance is determined more by what is going on inside of us than any particular attribute(s) of the SB. You shouldn't think it is about you because, usually, it isn't.",
                    "author": "This_is_Not_My_Handl",
                    "id": "emf6zqn",
                    "parent_id": "t1_emd7vc2",
                    "score": 3,
                    "created_utc": 1556901666.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "This is why hearing \"SDs\" say talking about money before/during a M&G is a turn off is annoying.",
            "author": "bsbdfw",
            "id": "emfqapv",
            "parent_id": "t1_emdqwvq",
            "score": 9,
            "created_utc": 1556914456.0,
            "replies": []
        },
        {
            "body": "Im a guy and they were just being assholes lol. Im so sorry.",
            "author": "Mechfire11",
            "id": "eme1hkw",
            "parent_id": "t1_emdqwvq",
            "score": 9,
            "created_utc": 1556866640.0,
            "replies": []
        },
        {
            "body": "Your approach is amazing. If only every SD (or their profile, at least) were like you.",
            "author": null,
            "id": "eme71y1",
            "parent_id": "t1_emd50mk",
            "score": 13,
            "created_utc": 1556873340.0,
            "replies": [
                {
                    "body": "The thing is, I used to state my allowance in my opening message and I found that I find much happier SRs with SBs if we don't discuss $ until the m&g. I let them know I provide a cash allowance but save the details until after I've hooked her on my charm and wit.",
                    "author": "This_is_Not_My_Handl",
                    "id": "emf7s65",
                    "parent_id": "t1_eme71y1",
                    "score": 2,
                    "created_utc": 1556902186.0,
                    "replies": [
                        {
                            "body": "That's cool that it works for you! I kind of gave up on going on m& g's before discussing numbers, unless they seemed especially charming while messaging. Guess you can use that to your advantage for sure!",
                            "author": null,
                            "id": "emfi5q9",
                            "parent_id": "t1_emf7s65",
                            "score": 6,
                            "created_utc": 1556909184.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "The problem with doing that is the risk of overpaying.",
                    "author": null,
                    "id": "emeqebl",
                    "parent_id": "t1_eme71y1",
                    "score": -5,
                    "created_utc": 1556890838.0,
                    "replies": [
                        {
                            "body": "\"overpaying\" has many benefits in an SR. Less ghosting, flaking, less bad treatment and communication, more willingness to keep you satisfied - oh, and also, a little thing called helping your SB better their life. Is that really overpaying if you can buy all those things for a few more $$$ each time to meet?",
                            "author": null,
                            "id": "emf2tgr",
                            "parent_id": "t1_emeqebl",
                            "score": 14,
                            "created_utc": 1556898916.0,
                            "replies": [
                                {
                                    "body": ">Less ghosting, flaking, less bad treatment and communication, more willingness to keep you satisfied \n\nThat's just a myth as money doesn't automatically get you a better SR.\n\nIn fact, vetting is way cheaper and effective at getting the benefits you mention.\n\n>oh, and also, a little thing called helping your SB better their life.\n\nI never get this, SRs aren't charity, they are mutually beneficial.\n\nI can think of a million better ways to do charity than giving money to an SB..",
                                    "author": null,
                                    "id": "emgrktk",
                                    "parent_id": "t1_emf2tgr",
                                    "score": -1,
                                    "created_utc": 1556945755.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "You always have the option of saying no at the M&G. There are a lot of risks in the world and in sugar and \"overpaying\" is about the most minimal. What Don has done is to provide certainty to prospects that if there is a relationship the allowance is a knowable amount early on.  My guess is that most SB who would find the allowance acceptable would put him at the top of their  \"investigate further quickly \" list .  Probably a welcome change for the SB suffering through seemingly endless \"experience daddies\",  or well with the allowance you can fly anywhere you want (within the state of RI)  or I am so important  you don't need an allowance.  \n\n\n\n Value lies in the eye of the beholder (I would pay a lot for most modern art - that is pay to exclude it from my home and business) others swoon over the same stuff)",
                            "author": "pinotandsugar",
                            "id": "emezy68",
                            "parent_id": "t1_emeqebl",
                            "score": 10,
                            "created_utc": 1556897055.0,
                            "replies": [
                                {
                                    "body": "\n> What Don has done is to provide certainty to prospects that if there is a relationship the allowance is a knowable amount early on.\n\nStating what I am offering also helps me avoid  the uncomfortable conversation of putting a price on an individual lady's worth.\n\nImagine you're a SB expecting men to offer you 5X and then I offer only 4X. You might see it as an insult when really it's not. It's just what my budget is. I'm just barely rich but I have no family or obligations so I can afford to offer a competitive allowance.  But I do have a limit and I prefer the women know this upfront. \n\nActually, I understate what I'm offering by just a little bit. Then I up the offer to what it should be if the meet and greet goes well. That way I get to give a little flattery by telling them they're the best potential SB I've met and I'm willing to offer a little more.",
                                    "author": null,
                                    "id": "emfaqpb",
                                    "parent_id": "t1_emezy68",
                                    "score": 9,
                                    "created_utc": 1556904176.0,
                                    "replies": []
                                },
                                {
                                    "body": "100% agree with this",
                                    "author": null,
                                    "id": "emf2gg6",
                                    "parent_id": "t1_emezy68",
                                    "score": 3,
                                    "created_utc": 1556898681.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "For me there is no overpaying because I offer what I want to pay. I don't negotiate. If she wants more, I say no unless she's bringing something extra to the relationship. If she wants less I say no. Because I don't want a discount SB .",
                            "author": null,
                            "id": "emf9m9b",
                            "parent_id": "t1_emeqebl",
                            "score": 11,
                            "created_utc": 1556903424.0,
                            "replies": []
                        },
                        {
                            "body": "> risk of overpaying\n\nI guess I don't understand how this is a thing. Is this the SD equivalent of SBs worrying they're settling for too little? Like, they would be happy but for the people telling them they shouldn't be? I mean, if you put in your profile what your budget is, you only need to meet with people you're happy to spend that budget on. It can be whatever you want. It's not like the golf story has to be true.",
                            "author": "This_is_Not_My_Handl",
                            "id": "emf7j9b",
                            "parent_id": "t1_emeqebl",
                            "score": 6,
                            "created_utc": 1556902021.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Love this approach!",
            "author": "deep-blue-nothing",
            "id": "emd78oh",
            "parent_id": "t1_emd50mk",
            "score": 7,
            "created_utc": 1556842896.0,
            "replies": []
        },
        {
            "body": "Very detailed response. I like this (your) way of thinking. I don't usually see this type of answer anywhere irl",
            "author": "mamivivi",
            "id": "emd7qye",
            "parent_id": "t1_emd50mk",
            "score": 4,
            "created_utc": 1556843240.0,
            "replies": [
                {
                    "body": "Good agreements make for good relationships .......",
                    "author": "pinotandsugar",
                    "id": "emdu2df",
                    "parent_id": "t1_emd7qye",
                    "score": 4,
                    "created_utc": 1556859132.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I think I saw your photo. You're Inara of Bohemia, right? Toughen up and you'll do great. I've seen a lot of profiles over the years, and your look is attractive and rare.",
            "author": "KineticEngineer",
            "id": "emd8gq1",
            "parent_id": "t1_emd7yye",
            "score": 6,
            "created_utc": 1556843729.0,
            "replies": [
                {
                    "body": "Damn guy I thought my Helen of Troy allusion in the picture thread was strong, but hats off...breaking out the Whedon references. 🎩",
                    "author": null,
                    "id": "emdsmru",
                    "parent_id": "t1_emd8gq1",
                    "score": 3,
                    "created_utc": 1556857856.0,
                    "replies": [
                        {
                            "body": "Eh, more kind of you than I deserved. Too obscure. I'm sure she understood your comment, and she definitely didn't understand mine.",
                            "author": "KineticEngineer",
                            "id": "emdtk77",
                            "parent_id": "t1_emdsmru",
                            "score": 1,
                            "created_utc": 1556858679.0,
                            "replies": [
                                {
                                    "body": "I should have complimented the original post, too.  Most informative/discussion-sparking of the day.\n\nAnd this is reddit, where obscure pop culture references rule.",
                                    "author": null,
                                    "id": "emdtuh1",
                                    "parent_id": "t1_emdtk77",
                                    "score": 1,
                                    "created_utc": 1556858927.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "As I’m not sure what/who Inara of Bohemia is, I think you got the wrong person. I’ll still take the compliment though, thanks! 😝",
                    "author": "SugarDavina",
                    "id": "emd8oui",
                    "parent_id": "t1_emd8gq1",
                    "score": 1,
                    "created_utc": 1556843881.0,
                    "replies": [
                        {
                            "body": "Inara was a character on Firefly, a dark-haired professional companion. Bohemian clothing you may know better as boho chic. Sorry for my personal shorthand (or longhand). It's what I thought to myself when I saw your pic.",
                            "author": "KineticEngineer",
                            "id": "emd8vrq",
                            "parent_id": "t1_emd8oui",
                            "score": 2,
                            "created_utc": 1556844008.0,
                            "replies": [
                                {
                                    "body": "Oh my god you’re comparing me to Morena Baccarin? 😱 I am most flattered!! I like your shorthand (and longhand), so no worries. Again thank you for the compliment, and for the post!",
                                    "author": "SugarDavina",
                                    "id": "emd9etz",
                                    "parent_id": "t1_emd8vrq",
                                    "score": 5,
                                    "created_utc": 1556844355.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I would block and move on. This is a huge red flag and you are going to continually have to worry about him scamming you.",
            "author": "MsDReid",
            "id": "emd5u5w",
            "parent_id": "t1_emd5bce",
            "score": 20,
            "created_utc": 1556841962.0,
            "replies": []
        },
        {
            "body": "Im dealing w same bs... i just think it's time to move on. I want to be his sb but he never has time. Im always scared to ask and its lowballs. Idk dealing kinda sticky",
            "author": "mamivivi",
            "id": "emd7gn2",
            "parent_id": "t1_emd5bce",
            "score": 6,
            "created_utc": 1556843046.0,
            "replies": [
                {
                    "body": ">\"\"  take it or leave it. \"\"\"\n\nthere's only one reply      Adios",
                    "author": "pinotandsugar",
                    "id": "emdu48q",
                    "parent_id": "t1_emd7gn2",
                    "score": 4,
                    "created_utc": 1556859181.0,
                    "replies": [
                        {
                            "body": "I don't think you *say* take it or leave it. But I think that is a perfectly reasonable mentality. Just don't get pissed when the other person leaves it.",
                            "author": "This_is_Not_My_Handl",
                            "id": "emf822u",
                            "parent_id": "t1_emdu48q",
                            "score": 2,
                            "created_utc": 1556902370.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I don't negotiate. I ask for her number. If I like it, we move forward. If not, I move on. Usually, she doesn't have a number and accepts mine. I believe if you're negotiating, it's because you lack genuine chemistry.",
            "author": "This_is_Not_My_Handl",
            "id": "emf7wbd",
            "parent_id": "t1_emd5bce",
            "score": -1,
            "created_utc": 1556902263.0,
            "replies": []
        },
        {
            "body": ">  take it or leave it.\n\nThere are better ways to phrase this but at least he is clear about what he is willing to pay. There is no ambiguity.",
            "author": "GSSD",
            "id": "emeom7h",
            "parent_id": "t1_emd5bce",
            "score": 0,
            "created_utc": 1556889642.0,
            "replies": [
                {
                    "body": "I am speculating OP is paraphrasing. If either person actually *says* take it or leave it, that person can fuck right off. But there is nothing wrong with the mentality.",
                    "author": "This_is_Not_My_Handl",
                    "id": "emf85kb",
                    "parent_id": "t1_emeom7h",
                    "score": 3,
                    "created_utc": 1556902435.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I started talking money before M&G once I realized how much time was wasted coordinating with people who weren't even remotely on the same page in terms of expectations.  I know there are some who want to gauge their \"offer\" based on the meet, but IME that's the exception and most are willing to talk about \"what details will look like if we hit it off when we meet\".",
            "author": "MousieSweets",
            "id": "emd9kd6",
            "parent_id": "t1_emd8lv5",
            "score": 6,
            "created_utc": 1556844459.0,
            "replies": []
        },
        {
            "body": "It seems as though opinions are widely split on the forum about this.",
            "author": "KineticEngineer",
            "id": "emd90o1",
            "parent_id": "t1_emd8lv5",
            "score": 2,
            "created_utc": 1556844096.0,
            "replies": []
        },
        {
            "body": "I've done it both ways. I vastly prefer waiting for the m&g to discuss numbers but I make it clear that my allowance is cash early in messaging (and not experience or any other such nonsense).",
            "author": "This_is_Not_My_Handl",
            "id": "emf8kux",
            "parent_id": "t1_emd8lv5",
            "score": 1,
            "created_utc": 1556902721.0,
            "replies": []
        },
        {
            "body": "Your ego is so fat, it needs its own area code.",
            "author": "KineticEngineer",
            "id": "emd37nw",
            "parent_id": "t1_emd2w5g",
            "score": 14,
            "created_utc": 1556840201.0,
            "replies": []
        },
        {
            "body": "I have no idea what that is, but feel free.",
            "author": "KineticEngineer",
            "id": "emd8nnm",
            "parent_id": "t1_emd8i0d",
            "score": 4,
            "created_utc": 1556843859.0,
            "replies": [
                {
                    "body": "It's just an idea I have",
                    "author": "doctorcoolpop",
                    "id": "emd9dn4",
                    "parent_id": "t1_emd8nnm",
                    "score": 3,
                    "created_utc": 1556844333.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I agree with you. But gotta walk before you can run, you know?",
            "author": "KineticEngineer",
            "id": "emd7he4",
            "parent_id": "t1_emd66ju",
            "score": 4,
            "created_utc": 1556843061.0,
            "replies": []
        },
        {
            "body": "The truly unrealistic ones usually out themselves well before the M&G.  They can't wait to tell you exactly what their \"last SD gave me\" and then proceed to claim they were getting 6-figures a year, yet all their pictures show them in bare feet and cut off jean shorts.",
            "author": null,
            "id": "emdji5j",
            "parent_id": "t1_emdgeti",
            "score": 1,
            "created_utc": 1556850922.0,
            "replies": [
                {
                    "body": ">The truly unrealistic ones usually out themselves well before the M&G.\n\nThis has been my experience as well. They either say my last SD gave me this, or without any provocation just offer up the amount they're looking for per date, even before moving to text. This is one of the reasons I've been able to go on so meet and greets without discussing allowance in advance. Because 99% of the time the ones that will meet you without discussing money are either reasonable with what they want (meaning close the the area average), or they are willing to accept your offer if they have no idea what's an acceptable amount.  Only once did I meet someone whose monthly was way out of line with what I was willing to give. She was a good negotiator, and even offered to see me 4 additional times per month to get that amount. Other then that, every POT that I met, that made it past the meet and greet into a 2nd date, all ended up agreeing, what I was willing to offer.",
                    "author": "ruphun",
                    "id": "emeat7s",
                    "parent_id": "t1_emdji5j",
                    "score": -1,
                    "created_utc": 1556877986.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "How is that a SD though? I've dated vanilla guys who always pay when we're traveling and don't even let me pay for things like dinner lol",
            "author": "calisugar",
            "id": "emdvt8p",
            "parent_id": "t1_emdi3j2",
            "score": 4,
            "created_utc": 1556860650.0,
            "replies": [
                {
                    "body": ">How is that a SD though?\n\nthe difference is, most vanillas arent going to do that all the time, and its not always going to be first class, to premier destinations.\n\n&#x200B;\n\nThat type of SD is called an Experience Daddy. It's another form of sugar dating. Some women care more about going to the trendiest restaurants, and A-List events, going on yachts and private jets, then getting an allowance. We have a few members on this sub reddit that are experience SD/SB.",
                    "author": "ruphun",
                    "id": "emeb191",
                    "parent_id": "t1_emdvt8p",
                    "score": 1,
                    "created_utc": 1556878277.0,
                    "replies": [
                        {
                            "body": "They will do that all the time cause how’s they are. They were raised to take care of their women. These normal guys might stay in 5 star hotels, but they aren’t flying us first class or getting invited to the hottest events, so you’re right about that. It’s a big reason why I’ve been single for yearssss. I don’t want to feel bad or guilty for living my life and doing these things without him, so I never cared to get serious.\n\nBut an experience daddy?! You’ve got to be kidding me... If by experience you mean he’s done this before and it’s your first time then yeah lol. Ask yourself, what would be the difference for him between an “experience” baby and a girl he is a vanilla dating? Without the allowance, there is no difference!!! He would still be flying her first class and taking her to events as his date... just like he would with any vanilla girlfriend. Y’all are being manipulated and you don’t even realize it. If you want to get invited to A-list events, yacht parties and private jets... then move to a large metropolitan city and network into these circles (usually models). If you’re attractive and outgoing, you’ll get invited. Sex isn’t expected. They need us. You’re just there to have fun and make them look good. \n\nMen who have access to these events and use that to bait you into sleeping with them are the worst. They are master manipulators. The more inexperienced, younger, and naive you are, the better. They know that lifestyle is enticing to new girls. At the end of the day, you’re getting the short end of the stick because he’s using these experiences as leverage for sugar. Which is worst than vanilla dating. At least with vanilla dating, he isn’t doing things because he’s expecting something in return. He’s doing it because he wants to and not because he’s going to use it against you later. \n\nEdit: Sorry thought you were a SB, so my post is written that way, but everything still applies",
                            "author": "calisugar",
                            "id": "emek4d9",
                            "parent_id": "t1_emeb191",
                            "score": 4,
                            "created_utc": 1556886567.0,
                            "replies": [
                                {
                                    "body": "Hopefully some of the Experience SD and SB that post on this forum will share their input.  The truth of the matter is not every SB is some destitute college woman. Some actually have good paying jobs and forego the allowance to experience things they can’t afford or don’t want to splurge on themselves. Typically experience daddies also give gifts and take them shopping too. Speaking from personal experience I’ve been in a SR like this previously, as well as allowance based ones too.",
                                    "author": "ruphun",
                                    "id": "emeotwn",
                                    "parent_id": "t1_emek4d9",
                                    "score": 0,
                                    "created_utc": 1556889785.0,
                                    "replies": [
                                        {
                                            "body": "So have you and your SB partied on yachts and traveled on private jets? And how was being an experience SD any different than being a vanilla boyfriend, for you? Wouldn't you treat your girlfriend with experiences and gifts as well? Or does the sugar daddy title only depend on how desperate a woman is? Seems like you're just getting the best of both worlds. Free sex without having to deal with the messy commitment parts of a relationship.\n\nYou don't have to be a destitute college student to appreciate money. A financially stable SB will put up with less BS because she's not broke or desperate, but it doesn't mean she can't use the money. She can always put the money into savings or a retirement fund or splurge on gifts for herself. If gifts and shopping are her compensation, then it seems like the \"experience SD\" is just a workaround for SD's with fragile egos",
                                            "author": "calisugar",
                                            "id": "emeu70i",
                                            "parent_id": "t1_emeotwn",
                                            "score": 4,
                                            "created_utc": 1556893477.0,
                                            "replies": [
                                                {
                                                    "body": "[deleted]",
                                                    "author": null,
                                                    "id": "emexjua",
                                                    "parent_id": "t1_emeu70i",
                                                    "score": 0,
                                                    "created_utc": 1556895575.0,
                                                    "replies": [
                                                        {
                                                            "body": "I'm okay with that. I'm not okay with men taking advantage of young desperate girls by selling an illusion. u/ruphun claims he was an \"experience SD\" yet he didn't even fit the description he gave me himself (jets and yachts)",
                                                            "author": "calisugar",
                                                            "id": "emf9tkn",
                                                            "parent_id": "t1_emexjua",
                                                            "score": 5,
                                                            "created_utc": 1556903559.0,
                                                            "replies": [
                                                                {
                                                                    "body": "[deleted]",
                                                                    "author": null,
                                                                    "id": "emffjev",
                                                                    "parent_id": "t1_emf9tkn",
                                                                    "score": 0,
                                                                    "created_utc": 1556907426.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "It's called dating. Simple as that. Experience SDs are not a thing.",
                                                                            "author": "calisugar",
                                                                            "id": "emfgc3l",
                                                                            "parent_id": "t1_emffjev",
                                                                            "score": 4,
                                                                            "created_utc": 1556907963.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "[deleted]",
                                                                                    "author": null,
                                                                                    "id": "emfgn3e",
                                                                                    "parent_id": "t1_emfgc3l",
                                                                                    "score": -1,
                                                                                    "created_utc": 1556908169.0,
                                                                                    "replies": [
                                                                                        {
                                                                                            "body": "I've dated a couple people, but not seriously. Not serious enough to call my boyfriend and never became an official couple.",
                                                                                            "author": "calisugar",
                                                                                            "id": "emfh0or",
                                                                                            "parent_id": "t1_emfgn3e",
                                                                                            "score": 2,
                                                                                            "created_utc": 1556908424.0,
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "body": "Some women don’t want an allowance plain and simple. They prefer to be treated like a spoiled GF rather then a SB. Yes it’s like being in a friends with benefits type relationship but with additional perks for her.",
                                                    "author": "ruphun",
                                                    "id": "emevh96",
                                                    "parent_id": "t1_emeu70i",
                                                    "score": 0,
                                                    "created_utc": 1556894297.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Unless you would vanilla date him, I would be careful. That's a popular manipulation tactic.",
            "author": "dancingqw33n17",
            "id": "eme5vls",
            "parent_id": "t1_emdi3j2",
            "score": 4,
            "created_utc": 1556871880.0,
            "replies": [
                {
                    "body": "Well he doesn't want to vanilla date but that's okay because either do I. He was upfront about what he wanted so if I wasn't cool with that it would be up to me to search elsewhere. I really don't get a manipulative vibe from him though, he is a gentleman and hasn't even asked for pictures or made me feel I have to sleep with him, but I want to....he is very much handsome, intelligent, classy and only 12 years older than I. My last wasn't the best looking but we seemed to connect until he started acting manipulative and showed his true colours. We actually had a ppm arrangement so now I get the impression that not every SD who offers ppm or allowance is going to be the best for me, even though the financial aspect would be helpful.",
                    "author": "sugasuga24",
                    "id": "emeebup",
                    "parent_id": "t1_eme5vls",
                    "score": 0,
                    "created_utc": 1556881759.0,
                    "replies": [
                        {
                            "body": "Not asking for a bunch of pics and being polite is pretty normal, so please don't take too much from that. I have a experience/gifts/trips SD, so I'm not saying it from a judgemental place. Since he's really good to me, I noticed a pattern with the guys who aren't. One is claiming to ONLY do vacations. \n\nIf you still need or just want a PPM/allowance, don't settle because there's assholes every where. There's this myth that rich= mean, and that's not true. My vanilla bf in college was manipulative and he made $16 an hr",
                            "author": "dancingqw33n17",
                            "id": "emermon",
                            "parent_id": "t1_emeebup",
                            "score": 5,
                            "created_utc": 1556891710.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "You forgot the /s...",
            "author": null,
            "id": "emekay2",
            "parent_id": "t1_emeab7p",
            "score": 3,
            "created_utc": 1556886702.0,
            "replies": []
        },
        {
            "body": "Services? You’re obviously a John not a SD",
            "author": "biggiemalls",
            "id": "emeiauu",
            "parent_id": "t1_emeab7p",
            "score": 2,
            "created_utc": 1556885138.0,
            "replies": []
        },
        {
            "body": "BS , this is just Negotiation  for someone’s time and interest . Nothing to do with prostitution",
            "author": "elan1345",
            "id": "emdsk91",
            "parent_id": "t1_emdeyo7",
            "score": 9,
            "created_utc": 1556857791.0,
            "replies": [
                {
                    "body": "It’s as if many posters on this sub completely missed the community discussion last week on the prostitution-escort-sugar-gold-trophy spectrum.",
                    "author": "FlexEconGuy",
                    "id": "emebhi6",
                    "parent_id": "t1_emdsk91",
                    "score": 1,
                    "created_utc": 1556878830.0,
                    "replies": [
                        {
                            "body": "Could you point me to that?",
                            "author": "biggiemalls",
                            "id": "emeika7",
                            "parent_id": "t1_emebhi6",
                            "score": 1,
                            "created_utc": 1556885353.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "> I think ive grown comfy in my arrangement\n\nIf you're \"comfy,\" I don't see why you need to change anything? If you're unhappy, that's one thing. But finding an SD you actually enjoy (I'm presuming you're an SB based on your username), can be a struggle. But, generally speaking, if you ask for more in an established arrangement, you risk losing the arrangement altogether. If you're fine with that, you just need to not tie his ability/desire to spend more on an arrangement to who you are as a person. For most SDs most of the time, our allowance is determined more by what is going on inside of us than any particular attribute(s) of the SB. You shouldn't think it is about you because, usually, it isn't.",
            "author": "This_is_Not_My_Handl",
            "id": "emf6zqn",
            "parent_id": "t1_emd7vc2",
            "score": 3,
            "created_utc": 1556901666.0,
            "replies": []
        },
        {
            "body": "The thing is, I used to state my allowance in my opening message and I found that I find much happier SRs with SBs if we don't discuss $ until the m&g. I let them know I provide a cash allowance but save the details until after I've hooked her on my charm and wit.",
            "author": "This_is_Not_My_Handl",
            "id": "emf7s65",
            "parent_id": "t1_eme71y1",
            "score": 2,
            "created_utc": 1556902186.0,
            "replies": [
                {
                    "body": "That's cool that it works for you! I kind of gave up on going on m& g's before discussing numbers, unless they seemed especially charming while messaging. Guess you can use that to your advantage for sure!",
                    "author": null,
                    "id": "emfi5q9",
                    "parent_id": "t1_emf7s65",
                    "score": 6,
                    "created_utc": 1556909184.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "The problem with doing that is the risk of overpaying.",
            "author": null,
            "id": "emeqebl",
            "parent_id": "t1_eme71y1",
            "score": -5,
            "created_utc": 1556890838.0,
            "replies": [
                {
                    "body": "\"overpaying\" has many benefits in an SR. Less ghosting, flaking, less bad treatment and communication, more willingness to keep you satisfied - oh, and also, a little thing called helping your SB better their life. Is that really overpaying if you can buy all those things for a few more $$$ each time to meet?",
                    "author": null,
                    "id": "emf2tgr",
                    "parent_id": "t1_emeqebl",
                    "score": 14,
                    "created_utc": 1556898916.0,
                    "replies": [
                        {
                            "body": ">Less ghosting, flaking, less bad treatment and communication, more willingness to keep you satisfied \n\nThat's just a myth as money doesn't automatically get you a better SR.\n\nIn fact, vetting is way cheaper and effective at getting the benefits you mention.\n\n>oh, and also, a little thing called helping your SB better their life.\n\nI never get this, SRs aren't charity, they are mutually beneficial.\n\nI can think of a million better ways to do charity than giving money to an SB..",
                            "author": null,
                            "id": "emgrktk",
                            "parent_id": "t1_emf2tgr",
                            "score": -1,
                            "created_utc": 1556945755.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "You always have the option of saying no at the M&G. There are a lot of risks in the world and in sugar and \"overpaying\" is about the most minimal. What Don has done is to provide certainty to prospects that if there is a relationship the allowance is a knowable amount early on.  My guess is that most SB who would find the allowance acceptable would put him at the top of their  \"investigate further quickly \" list .  Probably a welcome change for the SB suffering through seemingly endless \"experience daddies\",  or well with the allowance you can fly anywhere you want (within the state of RI)  or I am so important  you don't need an allowance.  \n\n\n\n Value lies in the eye of the beholder (I would pay a lot for most modern art - that is pay to exclude it from my home and business) others swoon over the same stuff)",
                    "author": "pinotandsugar",
                    "id": "emezy68",
                    "parent_id": "t1_emeqebl",
                    "score": 10,
                    "created_utc": 1556897055.0,
                    "replies": [
                        {
                            "body": "\n> What Don has done is to provide certainty to prospects that if there is a relationship the allowance is a knowable amount early on.\n\nStating what I am offering also helps me avoid  the uncomfortable conversation of putting a price on an individual lady's worth.\n\nImagine you're a SB expecting men to offer you 5X and then I offer only 4X. You might see it as an insult when really it's not. It's just what my budget is. I'm just barely rich but I have no family or obligations so I can afford to offer a competitive allowance.  But I do have a limit and I prefer the women know this upfront. \n\nActually, I understate what I'm offering by just a little bit. Then I up the offer to what it should be if the meet and greet goes well. That way I get to give a little flattery by telling them they're the best potential SB I've met and I'm willing to offer a little more.",
                            "author": null,
                            "id": "emfaqpb",
                            "parent_id": "t1_emezy68",
                            "score": 9,
                            "created_utc": 1556904176.0,
                            "replies": []
                        },
                        {
                            "body": "100% agree with this",
                            "author": null,
                            "id": "emf2gg6",
                            "parent_id": "t1_emezy68",
                            "score": 3,
                            "created_utc": 1556898681.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "For me there is no overpaying because I offer what I want to pay. I don't negotiate. If she wants more, I say no unless she's bringing something extra to the relationship. If she wants less I say no. Because I don't want a discount SB .",
                    "author": null,
                    "id": "emf9m9b",
                    "parent_id": "t1_emeqebl",
                    "score": 11,
                    "created_utc": 1556903424.0,
                    "replies": []
                },
                {
                    "body": "> risk of overpaying\n\nI guess I don't understand how this is a thing. Is this the SD equivalent of SBs worrying they're settling for too little? Like, they would be happy but for the people telling them they shouldn't be? I mean, if you put in your profile what your budget is, you only need to meet with people you're happy to spend that budget on. It can be whatever you want. It's not like the golf story has to be true.",
                    "author": "This_is_Not_My_Handl",
                    "id": "emf7j9b",
                    "parent_id": "t1_emeqebl",
                    "score": 6,
                    "created_utc": 1556902021.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Good agreements make for good relationships .......",
            "author": "pinotandsugar",
            "id": "emdu2df",
            "parent_id": "t1_emd7qye",
            "score": 4,
            "created_utc": 1556859132.0,
            "replies": []
        },
        {
            "body": "Damn guy I thought my Helen of Troy allusion in the picture thread was strong, but hats off...breaking out the Whedon references. 🎩",
            "author": null,
            "id": "emdsmru",
            "parent_id": "t1_emd8gq1",
            "score": 3,
            "created_utc": 1556857856.0,
            "replies": [
                {
                    "body": "Eh, more kind of you than I deserved. Too obscure. I'm sure she understood your comment, and she definitely didn't understand mine.",
                    "author": "KineticEngineer",
                    "id": "emdtk77",
                    "parent_id": "t1_emdsmru",
                    "score": 1,
                    "created_utc": 1556858679.0,
                    "replies": [
                        {
                            "body": "I should have complimented the original post, too.  Most informative/discussion-sparking of the day.\n\nAnd this is reddit, where obscure pop culture references rule.",
                            "author": null,
                            "id": "emdtuh1",
                            "parent_id": "t1_emdtk77",
                            "score": 1,
                            "created_utc": 1556858927.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "As I’m not sure what/who Inara of Bohemia is, I think you got the wrong person. I’ll still take the compliment though, thanks! 😝",
            "author": "SugarDavina",
            "id": "emd8oui",
            "parent_id": "t1_emd8gq1",
            "score": 1,
            "created_utc": 1556843881.0,
            "replies": [
                {
                    "body": "Inara was a character on Firefly, a dark-haired professional companion. Bohemian clothing you may know better as boho chic. Sorry for my personal shorthand (or longhand). It's what I thought to myself when I saw your pic.",
                    "author": "KineticEngineer",
                    "id": "emd8vrq",
                    "parent_id": "t1_emd8oui",
                    "score": 2,
                    "created_utc": 1556844008.0,
                    "replies": [
                        {
                            "body": "Oh my god you’re comparing me to Morena Baccarin? 😱 I am most flattered!! I like your shorthand (and longhand), so no worries. Again thank you for the compliment, and for the post!",
                            "author": "SugarDavina",
                            "id": "emd9etz",
                            "parent_id": "t1_emd8vrq",
                            "score": 5,
                            "created_utc": 1556844355.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": ">\"\"  take it or leave it. \"\"\"\n\nthere's only one reply      Adios",
            "author": "pinotandsugar",
            "id": "emdu48q",
            "parent_id": "t1_emd7gn2",
            "score": 4,
            "created_utc": 1556859181.0,
            "replies": [
                {
                    "body": "I don't think you *say* take it or leave it. But I think that is a perfectly reasonable mentality. Just don't get pissed when the other person leaves it.",
                    "author": "This_is_Not_My_Handl",
                    "id": "emf822u",
                    "parent_id": "t1_emdu48q",
                    "score": 2,
                    "created_utc": 1556902370.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I am speculating OP is paraphrasing. If either person actually *says* take it or leave it, that person can fuck right off. But there is nothing wrong with the mentality.",
            "author": "This_is_Not_My_Handl",
            "id": "emf85kb",
            "parent_id": "t1_emeom7h",
            "score": 3,
            "created_utc": 1556902435.0,
            "replies": []
        },
        {
            "body": "It's just an idea I have",
            "author": "doctorcoolpop",
            "id": "emd9dn4",
            "parent_id": "t1_emd8nnm",
            "score": 3,
            "created_utc": 1556844333.0,
            "replies": []
        },
        {
            "body": ">The truly unrealistic ones usually out themselves well before the M&G.\n\nThis has been my experience as well. They either say my last SD gave me this, or without any provocation just offer up the amount they're looking for per date, even before moving to text. This is one of the reasons I've been able to go on so meet and greets without discussing allowance in advance. Because 99% of the time the ones that will meet you without discussing money are either reasonable with what they want (meaning close the the area average), or they are willing to accept your offer if they have no idea what's an acceptable amount.  Only once did I meet someone whose monthly was way out of line with what I was willing to give. She was a good negotiator, and even offered to see me 4 additional times per month to get that amount. Other then that, every POT that I met, that made it past the meet and greet into a 2nd date, all ended up agreeing, what I was willing to offer.",
            "author": "ruphun",
            "id": "emeat7s",
            "parent_id": "t1_emdji5j",
            "score": -1,
            "created_utc": 1556877986.0,
            "replies": []
        },
        {
            "body": ">How is that a SD though?\n\nthe difference is, most vanillas arent going to do that all the time, and its not always going to be first class, to premier destinations.\n\n&#x200B;\n\nThat type of SD is called an Experience Daddy. It's another form of sugar dating. Some women care more about going to the trendiest restaurants, and A-List events, going on yachts and private jets, then getting an allowance. We have a few members on this sub reddit that are experience SD/SB.",
            "author": "ruphun",
            "id": "emeb191",
            "parent_id": "t1_emdvt8p",
            "score": 1,
            "created_utc": 1556878277.0,
            "replies": [
                {
                    "body": "They will do that all the time cause how’s they are. They were raised to take care of their women. These normal guys might stay in 5 star hotels, but they aren’t flying us first class or getting invited to the hottest events, so you’re right about that. It’s a big reason why I’ve been single for yearssss. I don’t want to feel bad or guilty for living my life and doing these things without him, so I never cared to get serious.\n\nBut an experience daddy?! You’ve got to be kidding me... If by experience you mean he’s done this before and it’s your first time then yeah lol. Ask yourself, what would be the difference for him between an “experience” baby and a girl he is a vanilla dating? Without the allowance, there is no difference!!! He would still be flying her first class and taking her to events as his date... just like he would with any vanilla girlfriend. Y’all are being manipulated and you don’t even realize it. If you want to get invited to A-list events, yacht parties and private jets... then move to a large metropolitan city and network into these circles (usually models). If you’re attractive and outgoing, you’ll get invited. Sex isn’t expected. They need us. You’re just there to have fun and make them look good. \n\nMen who have access to these events and use that to bait you into sleeping with them are the worst. They are master manipulators. The more inexperienced, younger, and naive you are, the better. They know that lifestyle is enticing to new girls. At the end of the day, you’re getting the short end of the stick because he’s using these experiences as leverage for sugar. Which is worst than vanilla dating. At least with vanilla dating, he isn’t doing things because he’s expecting something in return. He’s doing it because he wants to and not because he’s going to use it against you later. \n\nEdit: Sorry thought you were a SB, so my post is written that way, but everything still applies",
                    "author": "calisugar",
                    "id": "emek4d9",
                    "parent_id": "t1_emeb191",
                    "score": 4,
                    "created_utc": 1556886567.0,
                    "replies": [
                        {
                            "body": "Hopefully some of the Experience SD and SB that post on this forum will share their input.  The truth of the matter is not every SB is some destitute college woman. Some actually have good paying jobs and forego the allowance to experience things they can’t afford or don’t want to splurge on themselves. Typically experience daddies also give gifts and take them shopping too. Speaking from personal experience I’ve been in a SR like this previously, as well as allowance based ones too.",
                            "author": "ruphun",
                            "id": "emeotwn",
                            "parent_id": "t1_emek4d9",
                            "score": 0,
                            "created_utc": 1556889785.0,
                            "replies": [
                                {
                                    "body": "So have you and your SB partied on yachts and traveled on private jets? And how was being an experience SD any different than being a vanilla boyfriend, for you? Wouldn't you treat your girlfriend with experiences and gifts as well? Or does the sugar daddy title only depend on how desperate a woman is? Seems like you're just getting the best of both worlds. Free sex without having to deal with the messy commitment parts of a relationship.\n\nYou don't have to be a destitute college student to appreciate money. A financially stable SB will put up with less BS because she's not broke or desperate, but it doesn't mean she can't use the money. She can always put the money into savings or a retirement fund or splurge on gifts for herself. If gifts and shopping are her compensation, then it seems like the \"experience SD\" is just a workaround for SD's with fragile egos",
                                    "author": "calisugar",
                                    "id": "emeu70i",
                                    "parent_id": "t1_emeotwn",
                                    "score": 4,
                                    "created_utc": 1556893477.0,
                                    "replies": [
                                        {
                                            "body": "[deleted]",
                                            "author": null,
                                            "id": "emexjua",
                                            "parent_id": "t1_emeu70i",
                                            "score": 0,
                                            "created_utc": 1556895575.0,
                                            "replies": [
                                                {
                                                    "body": "I'm okay with that. I'm not okay with men taking advantage of young desperate girls by selling an illusion. u/ruphun claims he was an \"experience SD\" yet he didn't even fit the description he gave me himself (jets and yachts)",
                                                    "author": "calisugar",
                                                    "id": "emf9tkn",
                                                    "parent_id": "t1_emexjua",
                                                    "score": 5,
                                                    "created_utc": 1556903559.0,
                                                    "replies": [
                                                        {
                                                            "body": "[deleted]",
                                                            "author": null,
                                                            "id": "emffjev",
                                                            "parent_id": "t1_emf9tkn",
                                                            "score": 0,
                                                            "created_utc": 1556907426.0,
                                                            "replies": [
                                                                {
                                                                    "body": "It's called dating. Simple as that. Experience SDs are not a thing.",
                                                                    "author": "calisugar",
                                                                    "id": "emfgc3l",
                                                                    "parent_id": "t1_emffjev",
                                                                    "score": 4,
                                                                    "created_utc": 1556907963.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "[deleted]",
                                                                            "author": null,
                                                                            "id": "emfgn3e",
                                                                            "parent_id": "t1_emfgc3l",
                                                                            "score": -1,
                                                                            "created_utc": 1556908169.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "I've dated a couple people, but not seriously. Not serious enough to call my boyfriend and never became an official couple.",
                                                                                    "author": "calisugar",
                                                                                    "id": "emfh0or",
                                                                                    "parent_id": "t1_emfgn3e",
                                                                                    "score": 2,
                                                                                    "created_utc": 1556908424.0,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "body": "Some women don’t want an allowance plain and simple. They prefer to be treated like a spoiled GF rather then a SB. Yes it’s like being in a friends with benefits type relationship but with additional perks for her.",
                                            "author": "ruphun",
                                            "id": "emevh96",
                                            "parent_id": "t1_emeu70i",
                                            "score": 0,
                                            "created_utc": 1556894297.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Well he doesn't want to vanilla date but that's okay because either do I. He was upfront about what he wanted so if I wasn't cool with that it would be up to me to search elsewhere. I really don't get a manipulative vibe from him though, he is a gentleman and hasn't even asked for pictures or made me feel I have to sleep with him, but I want to....he is very much handsome, intelligent, classy and only 12 years older than I. My last wasn't the best looking but we seemed to connect until he started acting manipulative and showed his true colours. We actually had a ppm arrangement so now I get the impression that not every SD who offers ppm or allowance is going to be the best for me, even though the financial aspect would be helpful.",
            "author": "sugasuga24",
            "id": "emeebup",
            "parent_id": "t1_eme5vls",
            "score": 0,
            "created_utc": 1556881759.0,
            "replies": [
                {
                    "body": "Not asking for a bunch of pics and being polite is pretty normal, so please don't take too much from that. I have a experience/gifts/trips SD, so I'm not saying it from a judgemental place. Since he's really good to me, I noticed a pattern with the guys who aren't. One is claiming to ONLY do vacations. \n\nIf you still need or just want a PPM/allowance, don't settle because there's assholes every where. There's this myth that rich= mean, and that's not true. My vanilla bf in college was manipulative and he made $16 an hr",
                    "author": "dancingqw33n17",
                    "id": "emermon",
                    "parent_id": "t1_emeebup",
                    "score": 5,
                    "created_utc": 1556891710.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "It’s as if many posters on this sub completely missed the community discussion last week on the prostitution-escort-sugar-gold-trophy spectrum.",
            "author": "FlexEconGuy",
            "id": "emebhi6",
            "parent_id": "t1_emdsk91",
            "score": 1,
            "created_utc": 1556878830.0,
            "replies": [
                {
                    "body": "Could you point me to that?",
                    "author": "biggiemalls",
                    "id": "emeika7",
                    "parent_id": "t1_emebhi6",
                    "score": 1,
                    "created_utc": 1556885353.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "That's cool that it works for you! I kind of gave up on going on m& g's before discussing numbers, unless they seemed especially charming while messaging. Guess you can use that to your advantage for sure!",
            "author": null,
            "id": "emfi5q9",
            "parent_id": "t1_emf7s65",
            "score": 6,
            "created_utc": 1556909184.0,
            "replies": []
        },
        {
            "body": "\"overpaying\" has many benefits in an SR. Less ghosting, flaking, less bad treatment and communication, more willingness to keep you satisfied - oh, and also, a little thing called helping your SB better their life. Is that really overpaying if you can buy all those things for a few more $$$ each time to meet?",
            "author": null,
            "id": "emf2tgr",
            "parent_id": "t1_emeqebl",
            "score": 14,
            "created_utc": 1556898916.0,
            "replies": [
                {
                    "body": ">Less ghosting, flaking, less bad treatment and communication, more willingness to keep you satisfied \n\nThat's just a myth as money doesn't automatically get you a better SR.\n\nIn fact, vetting is way cheaper and effective at getting the benefits you mention.\n\n>oh, and also, a little thing called helping your SB better their life.\n\nI never get this, SRs aren't charity, they are mutually beneficial.\n\nI can think of a million better ways to do charity than giving money to an SB..",
                    "author": null,
                    "id": "emgrktk",
                    "parent_id": "t1_emf2tgr",
                    "score": -1,
                    "created_utc": 1556945755.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "You always have the option of saying no at the M&G. There are a lot of risks in the world and in sugar and \"overpaying\" is about the most minimal. What Don has done is to provide certainty to prospects that if there is a relationship the allowance is a knowable amount early on.  My guess is that most SB who would find the allowance acceptable would put him at the top of their  \"investigate further quickly \" list .  Probably a welcome change for the SB suffering through seemingly endless \"experience daddies\",  or well with the allowance you can fly anywhere you want (within the state of RI)  or I am so important  you don't need an allowance.  \n\n\n\n Value lies in the eye of the beholder (I would pay a lot for most modern art - that is pay to exclude it from my home and business) others swoon over the same stuff)",
            "author": "pinotandsugar",
            "id": "emezy68",
            "parent_id": "t1_emeqebl",
            "score": 10,
            "created_utc": 1556897055.0,
            "replies": [
                {
                    "body": "\n> What Don has done is to provide certainty to prospects that if there is a relationship the allowance is a knowable amount early on.\n\nStating what I am offering also helps me avoid  the uncomfortable conversation of putting a price on an individual lady's worth.\n\nImagine you're a SB expecting men to offer you 5X and then I offer only 4X. You might see it as an insult when really it's not. It's just what my budget is. I'm just barely rich but I have no family or obligations so I can afford to offer a competitive allowance.  But I do have a limit and I prefer the women know this upfront. \n\nActually, I understate what I'm offering by just a little bit. Then I up the offer to what it should be if the meet and greet goes well. That way I get to give a little flattery by telling them they're the best potential SB I've met and I'm willing to offer a little more.",
                    "author": null,
                    "id": "emfaqpb",
                    "parent_id": "t1_emezy68",
                    "score": 9,
                    "created_utc": 1556904176.0,
                    "replies": []
                },
                {
                    "body": "100% agree with this",
                    "author": null,
                    "id": "emf2gg6",
                    "parent_id": "t1_emezy68",
                    "score": 3,
                    "created_utc": 1556898681.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "For me there is no overpaying because I offer what I want to pay. I don't negotiate. If she wants more, I say no unless she's bringing something extra to the relationship. If she wants less I say no. Because I don't want a discount SB .",
            "author": null,
            "id": "emf9m9b",
            "parent_id": "t1_emeqebl",
            "score": 11,
            "created_utc": 1556903424.0,
            "replies": []
        },
        {
            "body": "> risk of overpaying\n\nI guess I don't understand how this is a thing. Is this the SD equivalent of SBs worrying they're settling for too little? Like, they would be happy but for the people telling them they shouldn't be? I mean, if you put in your profile what your budget is, you only need to meet with people you're happy to spend that budget on. It can be whatever you want. It's not like the golf story has to be true.",
            "author": "This_is_Not_My_Handl",
            "id": "emf7j9b",
            "parent_id": "t1_emeqebl",
            "score": 6,
            "created_utc": 1556902021.0,
            "replies": []
        },
        {
            "body": "Eh, more kind of you than I deserved. Too obscure. I'm sure she understood your comment, and she definitely didn't understand mine.",
            "author": "KineticEngineer",
            "id": "emdtk77",
            "parent_id": "t1_emdsmru",
            "score": 1,
            "created_utc": 1556858679.0,
            "replies": [
                {
                    "body": "I should have complimented the original post, too.  Most informative/discussion-sparking of the day.\n\nAnd this is reddit, where obscure pop culture references rule.",
                    "author": null,
                    "id": "emdtuh1",
                    "parent_id": "t1_emdtk77",
                    "score": 1,
                    "created_utc": 1556858927.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Inara was a character on Firefly, a dark-haired professional companion. Bohemian clothing you may know better as boho chic. Sorry for my personal shorthand (or longhand). It's what I thought to myself when I saw your pic.",
            "author": "KineticEngineer",
            "id": "emd8vrq",
            "parent_id": "t1_emd8oui",
            "score": 2,
            "created_utc": 1556844008.0,
            "replies": [
                {
                    "body": "Oh my god you’re comparing me to Morena Baccarin? 😱 I am most flattered!! I like your shorthand (and longhand), so no worries. Again thank you for the compliment, and for the post!",
                    "author": "SugarDavina",
                    "id": "emd9etz",
                    "parent_id": "t1_emd8vrq",
                    "score": 5,
                    "created_utc": 1556844355.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I don't think you *say* take it or leave it. But I think that is a perfectly reasonable mentality. Just don't get pissed when the other person leaves it.",
            "author": "This_is_Not_My_Handl",
            "id": "emf822u",
            "parent_id": "t1_emdu48q",
            "score": 2,
            "created_utc": 1556902370.0,
            "replies": []
        },
        {
            "body": "They will do that all the time cause how’s they are. They were raised to take care of their women. These normal guys might stay in 5 star hotels, but they aren’t flying us first class or getting invited to the hottest events, so you’re right about that. It’s a big reason why I’ve been single for yearssss. I don’t want to feel bad or guilty for living my life and doing these things without him, so I never cared to get serious.\n\nBut an experience daddy?! You’ve got to be kidding me... If by experience you mean he’s done this before and it’s your first time then yeah lol. Ask yourself, what would be the difference for him between an “experience” baby and a girl he is a vanilla dating? Without the allowance, there is no difference!!! He would still be flying her first class and taking her to events as his date... just like he would with any vanilla girlfriend. Y’all are being manipulated and you don’t even realize it. If you want to get invited to A-list events, yacht parties and private jets... then move to a large metropolitan city and network into these circles (usually models). If you’re attractive and outgoing, you’ll get invited. Sex isn’t expected. They need us. You’re just there to have fun and make them look good. \n\nMen who have access to these events and use that to bait you into sleeping with them are the worst. They are master manipulators. The more inexperienced, younger, and naive you are, the better. They know that lifestyle is enticing to new girls. At the end of the day, you’re getting the short end of the stick because he’s using these experiences as leverage for sugar. Which is worst than vanilla dating. At least with vanilla dating, he isn’t doing things because he’s expecting something in return. He’s doing it because he wants to and not because he’s going to use it against you later. \n\nEdit: Sorry thought you were a SB, so my post is written that way, but everything still applies",
            "author": "calisugar",
            "id": "emek4d9",
            "parent_id": "t1_emeb191",
            "score": 4,
            "created_utc": 1556886567.0,
            "replies": [
                {
                    "body": "Hopefully some of the Experience SD and SB that post on this forum will share their input.  The truth of the matter is not every SB is some destitute college woman. Some actually have good paying jobs and forego the allowance to experience things they can’t afford or don’t want to splurge on themselves. Typically experience daddies also give gifts and take them shopping too. Speaking from personal experience I’ve been in a SR like this previously, as well as allowance based ones too.",
                    "author": "ruphun",
                    "id": "emeotwn",
                    "parent_id": "t1_emek4d9",
                    "score": 0,
                    "created_utc": 1556889785.0,
                    "replies": [
                        {
                            "body": "So have you and your SB partied on yachts and traveled on private jets? And how was being an experience SD any different than being a vanilla boyfriend, for you? Wouldn't you treat your girlfriend with experiences and gifts as well? Or does the sugar daddy title only depend on how desperate a woman is? Seems like you're just getting the best of both worlds. Free sex without having to deal with the messy commitment parts of a relationship.\n\nYou don't have to be a destitute college student to appreciate money. A financially stable SB will put up with less BS because she's not broke or desperate, but it doesn't mean she can't use the money. She can always put the money into savings or a retirement fund or splurge on gifts for herself. If gifts and shopping are her compensation, then it seems like the \"experience SD\" is just a workaround for SD's with fragile egos",
                            "author": "calisugar",
                            "id": "emeu70i",
                            "parent_id": "t1_emeotwn",
                            "score": 4,
                            "created_utc": 1556893477.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "emexjua",
                                    "parent_id": "t1_emeu70i",
                                    "score": 0,
                                    "created_utc": 1556895575.0,
                                    "replies": [
                                        {
                                            "body": "I'm okay with that. I'm not okay with men taking advantage of young desperate girls by selling an illusion. u/ruphun claims he was an \"experience SD\" yet he didn't even fit the description he gave me himself (jets and yachts)",
                                            "author": "calisugar",
                                            "id": "emf9tkn",
                                            "parent_id": "t1_emexjua",
                                            "score": 5,
                                            "created_utc": 1556903559.0,
                                            "replies": [
                                                {
                                                    "body": "[deleted]",
                                                    "author": null,
                                                    "id": "emffjev",
                                                    "parent_id": "t1_emf9tkn",
                                                    "score": 0,
                                                    "created_utc": 1556907426.0,
                                                    "replies": [
                                                        {
                                                            "body": "It's called dating. Simple as that. Experience SDs are not a thing.",
                                                            "author": "calisugar",
                                                            "id": "emfgc3l",
                                                            "parent_id": "t1_emffjev",
                                                            "score": 4,
                                                            "created_utc": 1556907963.0,
                                                            "replies": [
                                                                {
                                                                    "body": "[deleted]",
                                                                    "author": null,
                                                                    "id": "emfgn3e",
                                                                    "parent_id": "t1_emfgc3l",
                                                                    "score": -1,
                                                                    "created_utc": 1556908169.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "I've dated a couple people, but not seriously. Not serious enough to call my boyfriend and never became an official couple.",
                                                                            "author": "calisugar",
                                                                            "id": "emfh0or",
                                                                            "parent_id": "t1_emfgn3e",
                                                                            "score": 2,
                                                                            "created_utc": 1556908424.0,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "Some women don’t want an allowance plain and simple. They prefer to be treated like a spoiled GF rather then a SB. Yes it’s like being in a friends with benefits type relationship but with additional perks for her.",
                                    "author": "ruphun",
                                    "id": "emevh96",
                                    "parent_id": "t1_emeu70i",
                                    "score": 0,
                                    "created_utc": 1556894297.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Not asking for a bunch of pics and being polite is pretty normal, so please don't take too much from that. I have a experience/gifts/trips SD, so I'm not saying it from a judgemental place. Since he's really good to me, I noticed a pattern with the guys who aren't. One is claiming to ONLY do vacations. \n\nIf you still need or just want a PPM/allowance, don't settle because there's assholes every where. There's this myth that rich= mean, and that's not true. My vanilla bf in college was manipulative and he made $16 an hr",
            "author": "dancingqw33n17",
            "id": "emermon",
            "parent_id": "t1_emeebup",
            "score": 5,
            "created_utc": 1556891710.0,
            "replies": []
        },
        {
            "body": "Could you point me to that?",
            "author": "biggiemalls",
            "id": "emeika7",
            "parent_id": "t1_emebhi6",
            "score": 1,
            "created_utc": 1556885353.0,
            "replies": []
        },
        {
            "body": ">Less ghosting, flaking, less bad treatment and communication, more willingness to keep you satisfied \n\nThat's just a myth as money doesn't automatically get you a better SR.\n\nIn fact, vetting is way cheaper and effective at getting the benefits you mention.\n\n>oh, and also, a little thing called helping your SB better their life.\n\nI never get this, SRs aren't charity, they are mutually beneficial.\n\nI can think of a million better ways to do charity than giving money to an SB..",
            "author": null,
            "id": "emgrktk",
            "parent_id": "t1_emf2tgr",
            "score": -1,
            "created_utc": 1556945755.0,
            "replies": []
        },
        {
            "body": "\n> What Don has done is to provide certainty to prospects that if there is a relationship the allowance is a knowable amount early on.\n\nStating what I am offering also helps me avoid  the uncomfortable conversation of putting a price on an individual lady's worth.\n\nImagine you're a SB expecting men to offer you 5X and then I offer only 4X. You might see it as an insult when really it's not. It's just what my budget is. I'm just barely rich but I have no family or obligations so I can afford to offer a competitive allowance.  But I do have a limit and I prefer the women know this upfront. \n\nActually, I understate what I'm offering by just a little bit. Then I up the offer to what it should be if the meet and greet goes well. That way I get to give a little flattery by telling them they're the best potential SB I've met and I'm willing to offer a little more.",
            "author": null,
            "id": "emfaqpb",
            "parent_id": "t1_emezy68",
            "score": 9,
            "created_utc": 1556904176.0,
            "replies": []
        },
        {
            "body": "100% agree with this",
            "author": null,
            "id": "emf2gg6",
            "parent_id": "t1_emezy68",
            "score": 3,
            "created_utc": 1556898681.0,
            "replies": []
        },
        {
            "body": "I should have complimented the original post, too.  Most informative/discussion-sparking of the day.\n\nAnd this is reddit, where obscure pop culture references rule.",
            "author": null,
            "id": "emdtuh1",
            "parent_id": "t1_emdtk77",
            "score": 1,
            "created_utc": 1556858927.0,
            "replies": []
        },
        {
            "body": "Oh my god you’re comparing me to Morena Baccarin? 😱 I am most flattered!! I like your shorthand (and longhand), so no worries. Again thank you for the compliment, and for the post!",
            "author": "SugarDavina",
            "id": "emd9etz",
            "parent_id": "t1_emd8vrq",
            "score": 5,
            "created_utc": 1556844355.0,
            "replies": []
        },
        {
            "body": "Hopefully some of the Experience SD and SB that post on this forum will share their input.  The truth of the matter is not every SB is some destitute college woman. Some actually have good paying jobs and forego the allowance to experience things they can’t afford or don’t want to splurge on themselves. Typically experience daddies also give gifts and take them shopping too. Speaking from personal experience I’ve been in a SR like this previously, as well as allowance based ones too.",
            "author": "ruphun",
            "id": "emeotwn",
            "parent_id": "t1_emek4d9",
            "score": 0,
            "created_utc": 1556889785.0,
            "replies": [
                {
                    "body": "So have you and your SB partied on yachts and traveled on private jets? And how was being an experience SD any different than being a vanilla boyfriend, for you? Wouldn't you treat your girlfriend with experiences and gifts as well? Or does the sugar daddy title only depend on how desperate a woman is? Seems like you're just getting the best of both worlds. Free sex without having to deal with the messy commitment parts of a relationship.\n\nYou don't have to be a destitute college student to appreciate money. A financially stable SB will put up with less BS because she's not broke or desperate, but it doesn't mean she can't use the money. She can always put the money into savings or a retirement fund or splurge on gifts for herself. If gifts and shopping are her compensation, then it seems like the \"experience SD\" is just a workaround for SD's with fragile egos",
                    "author": "calisugar",
                    "id": "emeu70i",
                    "parent_id": "t1_emeotwn",
                    "score": 4,
                    "created_utc": 1556893477.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "emexjua",
                            "parent_id": "t1_emeu70i",
                            "score": 0,
                            "created_utc": 1556895575.0,
                            "replies": [
                                {
                                    "body": "I'm okay with that. I'm not okay with men taking advantage of young desperate girls by selling an illusion. u/ruphun claims he was an \"experience SD\" yet he didn't even fit the description he gave me himself (jets and yachts)",
                                    "author": "calisugar",
                                    "id": "emf9tkn",
                                    "parent_id": "t1_emexjua",
                                    "score": 5,
                                    "created_utc": 1556903559.0,
                                    "replies": [
                                        {
                                            "body": "[deleted]",
                                            "author": null,
                                            "id": "emffjev",
                                            "parent_id": "t1_emf9tkn",
                                            "score": 0,
                                            "created_utc": 1556907426.0,
                                            "replies": [
                                                {
                                                    "body": "It's called dating. Simple as that. Experience SDs are not a thing.",
                                                    "author": "calisugar",
                                                    "id": "emfgc3l",
                                                    "parent_id": "t1_emffjev",
                                                    "score": 4,
                                                    "created_utc": 1556907963.0,
                                                    "replies": [
                                                        {
                                                            "body": "[deleted]",
                                                            "author": null,
                                                            "id": "emfgn3e",
                                                            "parent_id": "t1_emfgc3l",
                                                            "score": -1,
                                                            "created_utc": 1556908169.0,
                                                            "replies": [
                                                                {
                                                                    "body": "I've dated a couple people, but not seriously. Not serious enough to call my boyfriend and never became an official couple.",
                                                                    "author": "calisugar",
                                                                    "id": "emfh0or",
                                                                    "parent_id": "t1_emfgn3e",
                                                                    "score": 2,
                                                                    "created_utc": 1556908424.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "Some women don’t want an allowance plain and simple. They prefer to be treated like a spoiled GF rather then a SB. Yes it’s like being in a friends with benefits type relationship but with additional perks for her.",
                            "author": "ruphun",
                            "id": "emevh96",
                            "parent_id": "t1_emeu70i",
                            "score": 0,
                            "created_utc": 1556894297.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "So have you and your SB partied on yachts and traveled on private jets? And how was being an experience SD any different than being a vanilla boyfriend, for you? Wouldn't you treat your girlfriend with experiences and gifts as well? Or does the sugar daddy title only depend on how desperate a woman is? Seems like you're just getting the best of both worlds. Free sex without having to deal with the messy commitment parts of a relationship.\n\nYou don't have to be a destitute college student to appreciate money. A financially stable SB will put up with less BS because she's not broke or desperate, but it doesn't mean she can't use the money. She can always put the money into savings or a retirement fund or splurge on gifts for herself. If gifts and shopping are her compensation, then it seems like the \"experience SD\" is just a workaround for SD's with fragile egos",
            "author": "calisugar",
            "id": "emeu70i",
            "parent_id": "t1_emeotwn",
            "score": 4,
            "created_utc": 1556893477.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "emexjua",
                    "parent_id": "t1_emeu70i",
                    "score": 0,
                    "created_utc": 1556895575.0,
                    "replies": [
                        {
                            "body": "I'm okay with that. I'm not okay with men taking advantage of young desperate girls by selling an illusion. u/ruphun claims he was an \"experience SD\" yet he didn't even fit the description he gave me himself (jets and yachts)",
                            "author": "calisugar",
                            "id": "emf9tkn",
                            "parent_id": "t1_emexjua",
                            "score": 5,
                            "created_utc": 1556903559.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "emffjev",
                                    "parent_id": "t1_emf9tkn",
                                    "score": 0,
                                    "created_utc": 1556907426.0,
                                    "replies": [
                                        {
                                            "body": "It's called dating. Simple as that. Experience SDs are not a thing.",
                                            "author": "calisugar",
                                            "id": "emfgc3l",
                                            "parent_id": "t1_emffjev",
                                            "score": 4,
                                            "created_utc": 1556907963.0,
                                            "replies": [
                                                {
                                                    "body": "[deleted]",
                                                    "author": null,
                                                    "id": "emfgn3e",
                                                    "parent_id": "t1_emfgc3l",
                                                    "score": -1,
                                                    "created_utc": 1556908169.0,
                                                    "replies": [
                                                        {
                                                            "body": "I've dated a couple people, but not seriously. Not serious enough to call my boyfriend and never became an official couple.",
                                                            "author": "calisugar",
                                                            "id": "emfh0or",
                                                            "parent_id": "t1_emfgn3e",
                                                            "score": 2,
                                                            "created_utc": 1556908424.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Some women don’t want an allowance plain and simple. They prefer to be treated like a spoiled GF rather then a SB. Yes it’s like being in a friends with benefits type relationship but with additional perks for her.",
                    "author": "ruphun",
                    "id": "emevh96",
                    "parent_id": "t1_emeu70i",
                    "score": 0,
                    "created_utc": 1556894297.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "emexjua",
            "parent_id": "t1_emeu70i",
            "score": 0,
            "created_utc": 1556895575.0,
            "replies": [
                {
                    "body": "I'm okay with that. I'm not okay with men taking advantage of young desperate girls by selling an illusion. u/ruphun claims he was an \"experience SD\" yet he didn't even fit the description he gave me himself (jets and yachts)",
                    "author": "calisugar",
                    "id": "emf9tkn",
                    "parent_id": "t1_emexjua",
                    "score": 5,
                    "created_utc": 1556903559.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "emffjev",
                            "parent_id": "t1_emf9tkn",
                            "score": 0,
                            "created_utc": 1556907426.0,
                            "replies": [
                                {
                                    "body": "It's called dating. Simple as that. Experience SDs are not a thing.",
                                    "author": "calisugar",
                                    "id": "emfgc3l",
                                    "parent_id": "t1_emffjev",
                                    "score": 4,
                                    "created_utc": 1556907963.0,
                                    "replies": [
                                        {
                                            "body": "[deleted]",
                                            "author": null,
                                            "id": "emfgn3e",
                                            "parent_id": "t1_emfgc3l",
                                            "score": -1,
                                            "created_utc": 1556908169.0,
                                            "replies": [
                                                {
                                                    "body": "I've dated a couple people, but not seriously. Not serious enough to call my boyfriend and never became an official couple.",
                                                    "author": "calisugar",
                                                    "id": "emfh0or",
                                                    "parent_id": "t1_emfgn3e",
                                                    "score": 2,
                                                    "created_utc": 1556908424.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Some women don’t want an allowance plain and simple. They prefer to be treated like a spoiled GF rather then a SB. Yes it’s like being in a friends with benefits type relationship but with additional perks for her.",
            "author": "ruphun",
            "id": "emevh96",
            "parent_id": "t1_emeu70i",
            "score": 0,
            "created_utc": 1556894297.0,
            "replies": []
        },
        {
            "body": "I'm okay with that. I'm not okay with men taking advantage of young desperate girls by selling an illusion. u/ruphun claims he was an \"experience SD\" yet he didn't even fit the description he gave me himself (jets and yachts)",
            "author": "calisugar",
            "id": "emf9tkn",
            "parent_id": "t1_emexjua",
            "score": 5,
            "created_utc": 1556903559.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "emffjev",
                    "parent_id": "t1_emf9tkn",
                    "score": 0,
                    "created_utc": 1556907426.0,
                    "replies": [
                        {
                            "body": "It's called dating. Simple as that. Experience SDs are not a thing.",
                            "author": "calisugar",
                            "id": "emfgc3l",
                            "parent_id": "t1_emffjev",
                            "score": 4,
                            "created_utc": 1556907963.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "emfgn3e",
                                    "parent_id": "t1_emfgc3l",
                                    "score": -1,
                                    "created_utc": 1556908169.0,
                                    "replies": [
                                        {
                                            "body": "I've dated a couple people, but not seriously. Not serious enough to call my boyfriend and never became an official couple.",
                                            "author": "calisugar",
                                            "id": "emfh0or",
                                            "parent_id": "t1_emfgn3e",
                                            "score": 2,
                                            "created_utc": 1556908424.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "emffjev",
            "parent_id": "t1_emf9tkn",
            "score": 0,
            "created_utc": 1556907426.0,
            "replies": [
                {
                    "body": "It's called dating. Simple as that. Experience SDs are not a thing.",
                    "author": "calisugar",
                    "id": "emfgc3l",
                    "parent_id": "t1_emffjev",
                    "score": 4,
                    "created_utc": 1556907963.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "emfgn3e",
                            "parent_id": "t1_emfgc3l",
                            "score": -1,
                            "created_utc": 1556908169.0,
                            "replies": [
                                {
                                    "body": "I've dated a couple people, but not seriously. Not serious enough to call my boyfriend and never became an official couple.",
                                    "author": "calisugar",
                                    "id": "emfh0or",
                                    "parent_id": "t1_emfgn3e",
                                    "score": 2,
                                    "created_utc": 1556908424.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "It's called dating. Simple as that. Experience SDs are not a thing.",
            "author": "calisugar",
            "id": "emfgc3l",
            "parent_id": "t1_emffjev",
            "score": 4,
            "created_utc": 1556907963.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "emfgn3e",
                    "parent_id": "t1_emfgc3l",
                    "score": -1,
                    "created_utc": 1556908169.0,
                    "replies": [
                        {
                            "body": "I've dated a couple people, but not seriously. Not serious enough to call my boyfriend and never became an official couple.",
                            "author": "calisugar",
                            "id": "emfh0or",
                            "parent_id": "t1_emfgn3e",
                            "score": 2,
                            "created_utc": 1556908424.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "emfgn3e",
            "parent_id": "t1_emfgc3l",
            "score": -1,
            "created_utc": 1556908169.0,
            "replies": [
                {
                    "body": "I've dated a couple people, but not seriously. Not serious enough to call my boyfriend and never became an official couple.",
                    "author": "calisugar",
                    "id": "emfh0or",
                    "parent_id": "t1_emfgn3e",
                    "score": 2,
                    "created_utc": 1556908424.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I've dated a couple people, but not seriously. Not serious enough to call my boyfriend and never became an official couple.",
            "author": "calisugar",
            "id": "emfh0or",
            "parent_id": "t1_emfgn3e",
            "score": 2,
            "created_utc": 1556908424.0,
            "replies": []
        }
    ]
}