{
    "title": "Expectation vs. Reality- SB edition",
    "post_id": "hyyn47",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/hyyn47/expectation_vs_reality_sb_edition/",
    "author": "azucarbebe22",
    "body": "https://imgur.com/a/79vnvfQ\n\nBefore I got into the bowl, I thought all SBs looked like the girl on the left in the photo. And of course, some of them do, but what I’ve learned is that there is demand for all kinds of women in the bowl. With that being said, we get a lot of questions like “I have XYZ body characteristic, will I be successful in the bowl?” But no one ever tells anyone what successful SB’s actually look like, so you have no point of reference. I’ve been lucky enough to have some success in the bowl, so I wanted to post a picture of myself to give some perspective and hopefully encourage anyone who thinks/feels like I did (that they don’t have a chance!) before I got into the bowl. If I can ever help you in any way, please don’t hesitate to reach out! Always happy to spread good vibes and positivity and kindness and have conversations with advice or otherwise.",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/hyyn47/expectation_vs_reality_sb_edition/",
    "score": 239,
    "upvote_ratio": 0.94,
    "created_utc": 1595876926.0,
    "num_comments": 110,
    "links": [
        [
            "https://imgur.com/a/79vnvfQ"
        ]
    ],
    "comments": [
        {
            "body": "[deleted]",
            "author": null,
            "id": "fzg8te2",
            "parent_id": "t3_hyyn47",
            "score": 124,
            "created_utc": 1595887739.0,
            "replies": [
                {
                    "body": "This is my favorite comment",
                    "author": "babylina",
                    "id": "fzgf0zj",
                    "parent_id": "t1_fzg8te2",
                    "score": 34,
                    "created_utc": 1595890934.0,
                    "replies": []
                },
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "fzgj9mv",
                    "parent_id": "t1_fzg8te2",
                    "score": 27,
                    "created_utc": 1595893207.0,
                    "replies": [
                        {
                            "body": "Wanting “to see them all”: I honestly wonder if this is what causes a potential SD from connecting with the right SB for him. 🤔🤣",
                            "author": "BeautyGr8ce",
                            "id": "fzgl8u5",
                            "parent_id": "t1_fzgj9mv",
                            "score": 14,
                            "created_utc": 1595894283.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "fzgmww4",
                                    "parent_id": "t1_fzgl8u5",
                                    "score": 10,
                                    "created_utc": 1595895208.0,
                                    "replies": [
                                        {
                                            "body": "Good for you! \n...But potentially fewer legit SDs in the bowl. 😆 Catch-22 can be such a B...",
                                            "author": "BeautyGr8ce",
                                            "id": "fzgrxhe",
                                            "parent_id": "t1_fzgmww4",
                                            "score": 1,
                                            "created_utc": 1595898055.0,
                                            "replies": [
                                                {
                                                    "body": "[deleted]",
                                                    "author": null,
                                                    "id": "fzgu18j",
                                                    "parent_id": "t1_fzgrxhe",
                                                    "score": 2,
                                                    "created_utc": 1595899245.0,
                                                    "replies": [
                                                        {
                                                            "body": "Ohhh. That’s nice 😊 I’m sure you two will be appreciated in this sugar-drought period.",
                                                            "author": "BeautyGr8ce",
                                                            "id": "fzgucqf",
                                                            "parent_id": "t1_fzgu18j",
                                                            "score": 1,
                                                            "created_utc": 1595899427.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "So I’ll go out on a limb and admit I reached out to an SA account of a woman very much like the picture on the left. She responded and I explained I would be making several trips to Florida to her town over the next year. 2018 a total of 16 week long trips for business. I traded my pic and she was interested. I’m 45M, over 6ft and no six pack abs. Still she was interested. We spoke on the phone she 24f and really hit it off. We agreed on the arrangement and enjoyed 16 fun filled weeks, mostly evenings of dinner but a few weekends of her showing me around her town and plenty of beach time. She dressed like a model every time we were together. I was amazed at how she had learned to put her best self forward all the time. Ironically she didn’t see herself as confident.Normally I would have assumed the girl on the left would not be interested in a good ole country gentleman but she luved being treated like a southern belle and we are goods friends now. I just need to land another project in Florida.",
            "author": "zztop1999",
            "id": "fzgkyhy",
            "parent_id": "t3_hyyn47",
            "score": 41,
            "created_utc": 1595894126.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "fzg5a56",
            "parent_id": "t3_hyyn47",
            "score": 55,
            "created_utc": 1595885971.0,
            "replies": [
                {
                    "body": "This. Both women in the photo are pretty close in terms of physical attractiveness. The left has a \"dolled up\" photo while the right has a more \"candid\" one.",
                    "author": "emptyoverflow",
                    "id": "fznrzsu",
                    "parent_id": "t1_fzg5a56",
                    "score": 6,
                    "created_utc": 1596056227.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "There’s something slightly **stinky** about the responses to this post. \n\nThe girl on the left has already been judged. Apparently, she has a dull personality, an attitude to match, and her expectations are high and she has below average intelligence. \n\nIf that’s true, then the converse is true. You’re saying that the girl on the right has low expectations. Does that not sound like a mindfuck to anyone? Since when is having high expectations a bad thing?! \n\nSomehow the “I wouldn’t be interested with the girl on the left” posts come across as disingenuous \n\nCue the downvotes!",
            "author": "SugarSpicenNice-",
            "id": "fzfw9o3",
            "parent_id": "t3_hyyn47",
            "score": 170,
            "created_utc": 1595881572.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "fzfx8l3",
                    "parent_id": "t1_fzfw9o3",
                    "score": 63,
                    "created_utc": 1595882038.0,
                    "replies": [
                        {
                            "body": "Some of these dudes are far more jaded than the \"pros\" they're always dog piling on and it doesn't take more than 5 inches of sight to see.",
                            "author": "2catsandacomputer",
                            "id": "fzj56wl",
                            "parent_id": "t1_fzfx8l3",
                            "score": 8,
                            "created_utc": 1595956887.0,
                            "replies": []
                        },
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "fzgetwh",
                            "parent_id": "t1_fzfx8l3",
                            "score": 4,
                            "created_utc": 1595890831.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "fzgffbu",
                                    "parent_id": "t1_fzgetwh",
                                    "score": 17,
                                    "created_utc": 1595891149.0,
                                    "replies": [
                                        {
                                            "body": "[deleted]",
                                            "author": null,
                                            "id": "fzgjsc5",
                                            "parent_id": "t1_fzgffbu",
                                            "score": 24,
                                            "created_utc": 1595893489.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "[deleted]",
                                            "author": null,
                                            "id": "fzgl7h1",
                                            "parent_id": "t1_fzgffbu",
                                            "score": 0,
                                            "created_utc": 1595894262.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "It’s just society convincing women that we have to compete with each other. It’s unfortunately always been this way.",
                    "author": "MsDReid",
                    "id": "fzgpy5s",
                    "parent_id": "t1_fzfw9o3",
                    "score": 17,
                    "created_utc": 1595896920.0,
                    "replies": []
                },
                {
                    "body": "Yeah it’s interesting. I don’t think you should be downvoted for pointing this out. I made this post because of my prior assumptions, so it’s kind of interesting to hear all of the assumptions that other people make. I think we should unpack it! I assume it’s based on previous interactions with girls who look like me and girls who look like the girl on the left, but of course there are exceptions to every rule and it’s unfair to make a judgement based on appearance. But people do. I will say that I’ve talked to at least one POT who preferred the type of girl on the left.",
                    "author": "azucarbebe22",
                    "id": "fzfzvih",
                    "parent_id": "t1_fzfw9o3",
                    "score": 17,
                    "created_utc": 1595883294.0,
                    "replies": [
                        {
                            "body": "I really want to clarify that I’m not attacking you in anyway. I understand why you made this post and I made sure to be extremely specific about what I thought was wrong—some of the responses! \n\nThe random hate DMs that I’m getting are entertaining though!",
                            "author": "SugarSpicenNice-",
                            "id": "fzgdgsv",
                            "parent_id": "t1_fzfzvih",
                            "score": 8,
                            "created_utc": 1595890112.0,
                            "replies": [
                                {
                                    "body": "Hate DM's are from people who do not have the courage to attack one publicly and be judged for it.\n\nI could not be bothered to have a discussion with cowards.",
                                    "author": "GDarn",
                                    "id": "fzi937e",
                                    "parent_id": "t1_fzgdgsv",
                                    "score": 5,
                                    "created_utc": 1595939818.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "I literally met a POT the other day that expected the left and didn’t even give me the time of day to get to know me so I hear you loud and clear",
                            "author": null,
                            "id": "fzjf1zk",
                            "parent_id": "t1_fzfzvih",
                            "score": 1,
                            "created_utc": 1595961550.0,
                            "replies": [
                                {
                                    "body": "I’ve had the same experience a couple of times!",
                                    "author": "azucarbebe22",
                                    "id": "fzjfgrh",
                                    "parent_id": "t1_fzjf1zk",
                                    "score": 1,
                                    "created_utc": 1595961744.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "The women here say rude things because they aren't as cute and the men say rude things because they couldn't afford her or have her interested in them.",
                    "author": "Kurtpackage",
                    "id": "fzgf3k7",
                    "parent_id": "t1_fzfw9o3",
                    "score": 18,
                    "created_utc": 1595890973.0,
                    "replies": [
                        {
                            "body": "I don't see any women here saying she isn't cute. Normally it's the men negging over women being petty. \"oh you're just a girl next door type. Let me know if you don't find success I'd be interested!” like...you guys think she's attractive enough *for you*, but not attractive enough to find success *without* you? 🙄",
                            "author": "2catsandacomputer",
                            "id": "fzj5lr6",
                            "parent_id": "t1_fzgf3k7",
                            "score": 5,
                            "created_utc": 1595957081.0,
                            "replies": [
                                {
                                    "body": "Ya, the \"negging\" is a blanket approach that sometimes can work but when it's so contrived, any worthwhile woman will see right through it.\n\nTeasing on the otherhand, I love and women seem to as well - being playful is fun.",
                                    "author": "Kurtpackage",
                                    "id": "fzk1pxz",
                                    "parent_id": "t1_fzj5lr6",
                                    "score": 3,
                                    "created_utc": 1595972542.0,
                                    "replies": [
                                        {
                                            "body": "Thanks for being a good sport and realizing I meant \"you\" as a collective, not an individual :)",
                                            "author": "2catsandacomputer",
                                            "id": "fzk5bp7",
                                            "parent_id": "t1_fzk1pxz",
                                            "score": 1,
                                            "created_utc": 1595974370.0,
                                            "replies": [
                                                {
                                                    "body": "I'm always a good sport! ;)",
                                                    "author": "Kurtpackage",
                                                    "id": "fzk7g83",
                                                    "parent_id": "t1_fzk5bp7",
                                                    "score": 1,
                                                    "created_utc": 1595975469.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I really hate some of the comments here. The point isn't to bash the girl on the left, for whatever reason. If a SD wants a Barbie doll, that's fine, just don't be an asshole when you meet a girl and she isn't exactly that. If you have a preference and you stick to it that's fine. \nWe all see her: the dress is beautiful, her makeup is snatched, I 𝙡𝙤𝙫𝙚 the dramatic earrings and the flower in her hair! 😍\n\n𝘿𝙊 𝙉𝙊𝙏 𝙎𝙃𝘼𝙈𝙀 𝙋𝙋𝙇 𝙒𝙃𝙊 𝙅𝙐𝙎𝙏 𝙒𝘼𝙉𝙏 𝙏𝙊 𝙇𝙊𝙊𝙆 𝙏𝙃𝙀𝙄𝙍 𝘽𝙀𝙎𝙏 𝙊𝙉 𝙏𝙃𝙀 𝙊𝙐𝙏𝙎𝙄𝘿𝙀 𝘼𝙉𝘿 𝙐𝙍 𝙐𝙉𝘾𝙊𝙈𝙁𝙊𝙍𝙏𝘼𝘽𝙇𝙀 𝙒𝙄𝙏𝙃 𝙏𝙃𝘼𝙏 \n\nBut no one is perfect, everyone has flaws. I would not be able to pull that off. My boobs are too big, I have a tummy, my thighs are too thick and I have a booty. That being said, there are things I can do and I can wear as an individual that make me feel good and make me feel like I look good. And 𝙮𝙤𝙪𝙧 opinion of what's attractive or appealing or 𝙣𝙤𝙩 𝙬𝙤𝙧𝙩𝙝 𝙩𝙝𝙚 𝙢𝙤𝙣𝙚𝙮 has nothing to do with what another person thinks or favors. \n\nIf you don't like what's been posted don't take the time to type out something as ugly as you probably are.",
            "author": "TheClearHaribo",
            "id": "fzg5ias",
            "parent_id": "t3_hyyn47",
            "score": 41,
            "created_utc": 1595886082.0,
            "replies": [
                {
                    "body": "I don't particularly want to spend money on getting coins to buy awards so that I can give them out, but if I did I'd give you the \"faith in humanity\" award, because GODDAMN DO YOU DESERVE IT with this comment.\nYou are absolutely right, everybody has their own type and if someone wants to look like a whole damn goddess, we will not yank them down just because we're too self conscious about ourselves to allow others to exceed us. We should applaud them for their confidence and love of looking their best.\nAt the same time, we shouldn't beat people up when they don't want to try as hard as everyone else, maybe they're just happy with the way they are and it is not our job to give them crap for it. Instead, if we must say something, we can give them praise for how confident they must be in just being themself, or maybe try to flatter them into trying a new look, but we should not force them to do anything they aren't comfortable with.\n\nMy tits aren't too big, nor too small, my hips are wide, I've got a booty, my thighs are phat as fuck, and I've got a pocket tummy that sticks out...I can barely fit into my pants anymore and I've since had to size up. I never wear makeup (mostly bc I have no idea how to apply it, but also bc it makes my skin flare up due to allergies of certain chemicals), but I still get guys. There is hope for everyone one way or another, and we shouldn't shame people for how they choose to show themselves. If you're not into it? Look away, simple as that.",
                    "author": "SolitarySeas",
                    "id": "fzgm84a",
                    "parent_id": "t1_fzg5ias",
                    "score": 9,
                    "created_utc": 1595894828.0,
                    "replies": [
                        {
                            "body": "Omigosh, I get it with the makeup. I have rheumatoid arthritis so sometimes my skin is okay with makeup and perfume and body glitter and some days it's just breaking out so I simply can't put that stuff on. \nI was really debating whether or not to post this because I thought it wouldn't matter but it rly bothered me that some are bashing this post. One of the comments was saying that she just wanted attention. \n\n👁👄👁 𝙏𝙝𝙖𝙩'𝙨 𝙬𝙝𝙮 𝙖𝙡𝙡 𝙤𝙛 𝙪𝙨 𝙖𝙧𝙚 𝙝𝙚𝙧𝙚. 𝘼 𝙎𝘽 𝙬𝙤𝙪𝙡𝙙 𝙝𝙖𝙫𝙚 𝙩𝙤 𝙬𝙖𝙣𝙩 𝙮𝙤𝙪 𝙛𝙤𝙧 𝙝𝙚𝙧/𝙝𝙞𝙢 𝙩𝙤 𝙡𝙞𝙠𝙚 𝙪𝙧 𝙥𝙧𝙤𝙛𝙞𝙡𝙚 𝙖𝙣𝙙 𝙩𝙝𝙚 𝙎𝘿 𝙬𝙤𝙪𝙡𝙙 𝙝𝙖𝙫𝙚 𝙩𝙤 𝙬𝙖𝙣𝙩 𝙮𝙤𝙪 𝙗𝙖𝙘𝙠. 𝙏𝙝𝙚𝙮'𝙙 𝙝𝙖𝙫𝙚 𝙩𝙤 𝙬𝙖𝙣𝙣𝙖 𝙋𝘼𝙔 𝘼𝙏𝙏𝙀𝙉𝙏𝙄𝙊𝙉 𝙩𝙤 𝙮𝙤𝙪. \n\nJust seems dumb. Everyone has things that make them sexy and desirable and interesting and it's stuff like that that sticks out and makes ppl want to talk to you and get closer, in vanilla relationships and in the Sugar Bowl. Most comments and posts I've seen have been helpful and kind and respectful(some are funny) so let's not mess that up.",
                            "author": "TheClearHaribo",
                            "id": "fzgpszx",
                            "parent_id": "t1_fzgm84a",
                            "score": 3,
                            "created_utc": 1595896840.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Its about internalizing both girls and becoming both at the same time. Be the classy, fancy most beautiful version of yourself, but do not compare yourself to others :)  hard concept being a woman, but we must learn!",
            "author": null,
            "id": "fzhg66h",
            "parent_id": "t3_hyyn47",
            "score": 9,
            "created_utc": 1595913255.0,
            "replies": []
        },
        {
            "body": "I want that dress. Where did that dress come from?",
            "author": "raychelpotter",
            "id": "fzg4969",
            "parent_id": "t3_hyyn47",
            "score": 15,
            "created_utc": 1595885463.0,
            "replies": [
                {
                    "body": "House of CB has similar",
                    "author": "babylina",
                    "id": "fzgewgc",
                    "parent_id": "t1_fzg4969",
                    "score": 7,
                    "created_utc": 1595890868.0,
                    "replies": [
                        {
                            "body": "looking up now:)",
                            "author": "raychelpotter",
                            "id": "fzh91q0",
                            "parent_id": "t1_fzgewgc",
                            "score": 4,
                            "created_utc": 1595908243.0,
                            "replies": [
                                {
                                    "body": "oh yes it does. Nice and thank you",
                                    "author": "raychelpotter",
                                    "id": "fzh96sc",
                                    "parent_id": "t1_fzh91q0",
                                    "score": 3,
                                    "created_utc": 1595908333.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "I love house of cb",
                            "author": "princessindo",
                            "id": "fzhg2yq",
                            "parent_id": "t1_fzgewgc",
                            "score": 3,
                            "created_utc": 1595913184.0,
                            "replies": []
                        },
                        {
                            "body": "Found some fabulous dresses! Not the one pictured but still found a few I would love to wear for my SD...until he unzips it and it slides off my body 🤷‍♀️🦋",
                            "author": "MyBeautifulLife4Me",
                            "id": "fzgpkmo",
                            "parent_id": "t1_fzgewgc",
                            "score": 2,
                            "created_utc": 1595896708.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Adorable dress",
                    "author": "MyBeautifulLife4Me",
                    "id": "fzgpgpa",
                    "parent_id": "t1_fzg4969",
                    "score": 3,
                    "created_utc": 1595896645.0,
                    "replies": []
                },
                {
                    "body": "Let me know if you find it!",
                    "author": "azucarbebe22",
                    "id": "fzg6nc5",
                    "parent_id": "t1_fzg4969",
                    "score": 4,
                    "created_utc": 1595886647.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "fzg0qgp",
            "parent_id": "t3_hyyn47",
            "score": 18,
            "created_utc": 1595883710.0,
            "replies": [
                {
                    "body": "This was sexy. I am the same way.",
                    "author": "babylina",
                    "id": "fzgfi4g",
                    "parent_id": "t1_fzg0qgp",
                    "score": 3,
                    "created_utc": 1595891191.0,
                    "replies": []
                },
                {
                    "body": "Who doesn’t love laughter!?",
                    "author": "genericMaker",
                    "id": "fzglhpi",
                    "parent_id": "t1_fzg0qgp",
                    "score": 3,
                    "created_utc": 1595894419.0,
                    "replies": []
                },
                {
                    "body": "This is amazing!!! Love it.",
                    "author": "azucarbebe22",
                    "id": "fzg15pf",
                    "parent_id": "t1_fzg0qgp",
                    "score": 1,
                    "created_utc": 1595883915.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "fzg33u2",
                            "parent_id": "t1_fzg15pf",
                            "score": 6,
                            "created_utc": 1595884895.0,
                            "replies": [
                                {
                                    "body": "Yes!!! I would love to take you up on that.",
                                    "author": "azucarbebe22",
                                    "id": "fzg3s2d",
                                    "parent_id": "t1_fzg33u2",
                                    "score": 3,
                                    "created_utc": 1595885229.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Best part is I can do both! Just need 20 mins with my makeup bag and some spanx and baybeeee you got yourself a stew goin!",
            "author": "babylina",
            "id": "fzgf3jh",
            "parent_id": "t3_hyyn47",
            "score": 13,
            "created_utc": 1595890973.0,
            "replies": []
        },
        {
            "body": "So what all of you are saying is, if the left was at a price you can afford you’d choose her in a heartbeat. But you’re willing to choose average for less. Got it.",
            "author": "lilah25",
            "id": "fzfyxne",
            "parent_id": "t3_hyyn47",
            "score": 31,
            "created_utc": 1595882845.0,
            "replies": [
                {
                    "body": "Basically. \n\nI'm sure OP is lovely but if both girls messaged a SD and were asking for the same allowance, any SD who says he wouldn't go for left over right is lying through their teeth - discounting the baseless assumptions about her personality.\n\nBut the great thing is that L and R are not competing in the same pool at all. The kind of guys that can afford a model are not the ones in OP's inbox so there really is no direct competition. So I understand her message (altho the medium is questionable).",
                    "author": "blonde-throwaway",
                    "id": "fzgdwaz",
                    "parent_id": "t1_fzfyxne",
                    "score": 27,
                    "created_utc": 1595890340.0,
                    "replies": [
                        {
                            "body": ">if both girls messaged a SD and were asking for the same allowance, any SD who says he wouldn't go for left over right is lying through their teeth - discounting the baseless assumptions about her personality.\n\nIsn't it amazing how you claim to know what **everyone** thinks?\n\nI reach out to POT's based on what I can glimpse about their personality and character, and I reached out to profiles with no pictures before.\n\nLooks matter, of course, but to claim (like you seem to above) that they are the one thing that matters is just wrong.\n\nI met amazingly beautiful people I had no chemistry with, average looking people I had great chemistry with, and every possible combination thereof. Chemistry and mutual attraction is far more important that mere looks.\n\nAnd on the allowance, I only discuss it on a second M&G, and I have not yet passed on someone I hit it off with because of the financial part of a relationship.",
                            "author": "GDarn",
                            "id": "fzi9pdd",
                            "parent_id": "t1_fzgdwaz",
                            "score": -2,
                            "created_utc": 1595940250.0,
                            "replies": [
                                {
                                    "body": ">I reach out to POT's based on what I can glimpse about their personality and character\n\nSo you judge this girls personality and character based on ONE picture and no other information? Wrong.\n\n>But to claim (like you seem to above) that they are the one thing that matters is just wrong.\n\nPlease point out where I said looks are all that matters. Ceteris paribus, men will go for the left over the right. Like I said, *ignoring baseless assumptions about her personality.* \n\n>I met amazingly beautiful people I had no chemistry with, average looking people I had great chemistry with, and every possible combination thereof. \n\nSo what is your actual point? If you're saying that every possible combination exists then why is meeting a beautiful person with great chemistry being discounted all over this thread?",
                                    "author": "blonde-throwaway",
                                    "id": "fzibzpy",
                                    "parent_id": "t1_fzi9pdd",
                                    "score": 5,
                                    "created_utc": 1595941763.0,
                                    "replies": [
                                        {
                                            "body": "\n>So you judge this girls personality and character based on ONE picture and no other information? Wrong.\n\nOf course that would be impossible.\n\nI think our disconnect seems to be that you appear to make the assumption that an arrangement is offered before chemistry and mutual attraction is established, which for me takes at least one in person meeting, during which one can get a pretty clear idea of one's personality and character.\n\n>If you're saying that every possible combination exists then why is meeting a beautiful person with great chemistry being discounted all over this thread?\n\nNo idea why people say that, nor do I know why you seem to think I either support those assertions, since my comment makes it clear I do not.\n\n>Please point out where I said looks are all that matters. Ceteris paribus, men will go for the left over the right. \n\nExcept that other things are never equal when talking about people.\n\nYou stating that decisions are made based on a picture and no other information seems to imply that looks are all that matter.\n\nIf that's not what it means, what did it mean?",
                                            "author": "GDarn",
                                            "id": "fzifwwp",
                                            "parent_id": "t1_fzibzpy",
                                            "score": -1,
                                            "created_utc": 1595944141.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Depends on where you live too. A St. Louis 10 is like a New York 6",
            "author": "Doyoulikewaffles94",
            "id": "fzjhp2v",
            "parent_id": "t3_hyyn47",
            "score": 5,
            "created_utc": 1595962809.0,
            "replies": [
                {
                    "body": "Thissss.",
                    "author": "azucarbebe22",
                    "id": "fzjkddk",
                    "parent_id": "t1_fzjhp2v",
                    "score": 2,
                    "created_utc": 1595964103.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "> but what I’ve learned is that there is demand for all kinds of women in the bowl.\n\nBut did you - really ?\n\nWhile the two pictures are obviously different women - I'd say physical appearance wise they are pretty similiar?  Both are fit/slim/in shape ?\n\nWhich is why I think its disingenuous to say there are people looking for \"all kinds\", when you actually put two very similiar (in terms of body type) women.\n\nA large percentage (I'd say majority) of women that post on SLF that are having trouble (and aren't looking for platonic, online only, etc) - are NOT slim/fit.",
            "author": "SDstartingOut",
            "id": "fzg1v8e",
            "parent_id": "t3_hyyn47",
            "score": 25,
            "created_utc": 1595884270.0,
            "replies": [
                {
                    "body": "I was too scared to say this. Both are pretty. White. Slim. Young. Lol.",
                    "author": "raychelpotter",
                    "id": "fzg4p2k",
                    "parent_id": "t1_fzg1v8e",
                    "score": 38,
                    "created_utc": 1595885683.0,
                    "replies": [
                        {
                            "body": "> I was too scared to say this. Both are pretty. White. Slim. Young. Lol.\n\nI firmly believe that at a macro level, skin color is mostly irrelevant in that situation.\n\nYoung, Slim, and pretty.  That combination can find an SD in most locations/areas.",
                            "author": "SDstartingOut",
                            "id": "fzg52e2",
                            "parent_id": "t1_fzg4p2k",
                            "score": 4,
                            "created_utc": 1595885866.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "fzio1z4",
                                    "parent_id": "t1_fzg52e2",
                                    "score": 4,
                                    "created_utc": 1595948517.0,
                                    "replies": [
                                        {
                                            "body": "> I've seen a few comments from black SBs/ aspiring SBs who were pretty disheartened\n\nTo be fair - people who put minimal effort in (of all colors & sexes) come posting here that they are having trouble.  \n\nThat said - what you describe specifically - did they fit that description:  Young, Slim, and pretty.  \n\nThe world is not boolean (I don't want to say black & white...), there is more then Easy & Hard.  We are also not talking about location, expectations, etc - which cause further variances.  But at its' most basic level - slim, fit, conventionally attractive women - of all races - have success.  \n\nNow, if we start talking overweight/curvy, do white women have an advantage?  I don't know.  I think when you start talking that body type - ALL women have difficulty.",
                                            "author": "SDstartingOut",
                                            "id": "fziqnm4",
                                            "parent_id": "t1_fzio1z4",
                                            "score": 2,
                                            "created_utc": 1595949848.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "I’m sorry, I can’t help my own body shape!! 😅 I am so intimidated by the woman on the left, to me that is the societal standard of beauty and that’s why that’s what I thought of as what an SB would look like. And me? Well, that’s just me. I’d love to see other SBs do similar posts so we can see some variety!",
                    "author": "azucarbebe22",
                    "id": "fzg2f22",
                    "parent_id": "t1_fzg1v8e",
                    "score": 9,
                    "created_utc": 1595884549.0,
                    "replies": [
                        {
                            "body": "> I am so intimidated by the woman on the left, to me that is the societal standard of beauty and that’s why that’s what I thought of as what an SB would look like\n\nIsn't that just makeup, clothing, and professional photography (with some possible airbrushing) ?",
                            "author": "SDstartingOut",
                            "id": "fzg5a9f",
                            "parent_id": "t1_fzg2f22",
                            "score": 18,
                            "created_utc": 1595885973.0,
                            "replies": [
                                {
                                    "body": "I wouldn’t know 😂 I can’t do any of it despite some of my best efforts. I look the same with or without makeup.",
                                    "author": "azucarbebe22",
                                    "id": "fzg5wk4",
                                    "parent_id": "t1_fzg5a9f",
                                    "score": -3,
                                    "created_utc": 1595886276.0,
                                    "replies": [
                                        {
                                            "body": "Homegirl on the left has had some work done, definitely her lips, most likely her nose and jawline. Fillers are so common these days, they take 20 minutes and you have brand new face. I also felt like I couldn't live up to the standards, especially here in LA, and then you realize it's all fake lol So dont worry if your best efforts dont look like that",
                                            "author": "Meowohmeow20",
                                            "id": "fzg6y0f",
                                            "parent_id": "t1_fzg5wk4",
                                            "score": 8,
                                            "created_utc": 1595886795.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "Honestly you are very similar to the woman on the left. With good makeup, clothes, and a serious face you could take a similar picture with a similar effect.\n\nNext you object to men saying they wouldnt be interested in the woman on the left. Why? Looking at that picture the thought that enters my mind is that she's high maintenance, others will make their own judgements. Clothes do ultimately say a lot about a person, especially women because women have soooo much more choice in what they wear (sure a man can wear cyberpunk clothes but its not socially acceptable).\n\nIts rather silly when you object to men saying they'd prefer you for valid reasons isnt it?",
                            "author": "ICanOnlyGetSoElect",
                            "id": "fzge3aj",
                            "parent_id": "t1_fzg2f22",
                            "score": 1,
                            "created_utc": 1595890440.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "fziocmc",
                                    "parent_id": "t1_fzge3aj",
                                    "score": 7,
                                    "created_utc": 1595948669.0,
                                    "replies": [
                                        {
                                            "body": "We'll just have to disagree on that then.",
                                            "author": "ICanOnlyGetSoElect",
                                            "id": "fziqlge",
                                            "parent_id": "t1_fziocmc",
                                            "score": -2,
                                            "created_utc": 1595949817.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "What must it be like to be an SLF SD and not even be able to imagine that there are well put together, charming and intelligent SBs available,  because you have nothing to offer so you haven’t encountered them? No one is fooled by these pandering responses 😂",
            "author": "specialsnowflakeee",
            "id": "fzfzzal",
            "parent_id": "t3_hyyn47",
            "score": 21,
            "created_utc": 1595883344.0,
            "replies": [
                {
                    "body": "The ones who fit that description certainly aren't meeting for ppms...",
                    "author": null,
                    "id": "fzgduhd",
                    "parent_id": "t1_fzfzzal",
                    "score": 8,
                    "created_utc": 1595890313.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I know the girl on the left (not actually but a girl as hot as her. As in a actual model). And few can afford her but she gets lots of attention and makes a lot in the bowl",
            "author": "throwawayFA93",
            "id": "fzfstj8",
            "parent_id": "t3_hyyn47",
            "score": 13,
            "created_utc": 1595879920.0,
            "replies": []
        },
        {
            "body": "I’m sorry that this discussion is getting derailed from my original purpose. I am in a SR- the point of this post was not validation or anything about me. This was meant to be a positive post that demonstrates that whether you are the girl on the left or on the right, there is room for you in the bowl. For those on the edge, give it a try! Many women are self-conscious because they don’t look like the girl on the left- I know I was! But the point is, it takes all kinds. And you don’t have to look like the girl on the left or the right, just be the best version of you ☺️",
            "author": "azucarbebe22",
            "id": "fzg0kqf",
            "parent_id": "t3_hyyn47",
            "score": 15,
            "created_utc": 1595883632.0,
            "replies": [
                {
                    "body": "I actually prefer the girl on the right.  The more down to earth genuine girl. Unfortunately when I see a girl on the left I actually raise my guard up that she could be a potential scammer. I am surebits not always like that but I guess its just been my experience.",
                    "author": "ffreshindo",
                    "id": "fzm8di2",
                    "parent_id": "t1_fzg0kqf",
                    "score": 0,
                    "created_utc": 1596027791.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "fzgri2b",
            "parent_id": "t3_hyyn47",
            "score": 3,
            "created_utc": 1595897808.0,
            "replies": [
                {
                    "body": "Absolutely. My SDs boosted my confidence 1000%. I’m pretty self confident in general, I was a competitive swimmer growing up so used to people seeing my body and kind of feel like my body “is what it is”.",
                    "author": "azucarbebe22",
                    "id": "fzgtte1",
                    "parent_id": "t1_fzgri2b",
                    "score": 1,
                    "created_utc": 1595899120.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I’d take the girl on the left if I were an SD",
            "author": "BaddBunneyy",
            "id": "fzfz2tz",
            "parent_id": "t3_hyyn47",
            "score": 16,
            "created_utc": 1595882915.0,
            "replies": []
        },
        {
            "body": "Dear SLF,\n\nI am so much more down to earth, wholesome, refreshing, and \"girl next door\" compared to this girl in the photo on the left. Please tell me all about how you'd choose me over her since I won't hurt your pockets as much as a girl like that one would. I know that pictures should only be posted on Picture Thursday, but I desperately needed this attention and validation TODAY and not another day or second later. Thank you so much for facilitating that, SLF!\n\nxoxo,\n\nOP",
            "author": "Dear_SLF",
            "id": "fzfybuy",
            "parent_id": "t3_hyyn47",
            "score": 28,
            "created_utc": 1595882558.0,
            "replies": [
                {
                    "body": "Sorry I wasn’t aware of Picture Thursday ☺️",
                    "author": "azucarbebe22",
                    "id": "fzg0218",
                    "parent_id": "t1_fzfybuy",
                    "score": 13,
                    "created_utc": 1595883381.0,
                    "replies": [
                        {
                            "body": "Me either! I liked your post and am sorry *some* people are shitting on you for it.",
                            "author": null,
                            "id": "fzg1nrv",
                            "parent_id": "t1_fzg0218",
                            "score": 11,
                            "created_utc": 1595884166.0,
                            "replies": [
                                {
                                    "body": "❤️❤️❤️ Thank you!",
                                    "author": "azucarbebe22",
                                    "id": "fzg1t4z",
                                    "parent_id": "t1_fzg1nrv",
                                    "score": 9,
                                    "created_utc": 1595884240.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Many SBs can benefit from your experience and wisdom. Fact is, success can be found for a wider array of \"types\" than is commonly thought. Yes, the \"models\" get the most attention but everyone brings their own qualities to the table. The variety is almost as rich as humanity itself. Almost. Granted, not everybody will work well in the bowl. That said, you have a terrific photo and I can see why you have been successful.",
            "author": "Intrepid_Seeker",
            "id": "fzfnzvs",
            "parent_id": "t3_hyyn47",
            "score": 7,
            "created_utc": 1595877668.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "fzg55v5",
            "parent_id": "t3_hyyn47",
            "score": 9,
            "created_utc": 1595885913.0,
            "replies": [
                {
                    "body": "And you are exactly who am hoping this post inspires.",
                    "author": "azucarbebe22",
                    "id": "fzg6h01",
                    "parent_id": "t1_fzg55v5",
                    "score": 10,
                    "created_utc": 1595886558.0,
                    "replies": []
                },
                {
                    "body": "I had a soft tummy til like three months ago!! I started doing Emi Wong’s ab workouts on YouTube- they’re easy, no jumping, and have been pretty effective for me!",
                    "author": "azucarbebe22",
                    "id": "fzg6ezj",
                    "parent_id": "t1_fzg55v5",
                    "score": 6,
                    "created_utc": 1595886531.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Your confidence shines through and it is attractive! I can see why you're successful in the bowl 😍",
            "author": "n0cturnalbaby",
            "id": "fzfpew8",
            "parent_id": "t3_hyyn47",
            "score": 6,
            "created_utc": 1595878328.0,
            "replies": [
                {
                    "body": "Thank you, that is very nice of you to say!! 😘😁",
                    "author": "azucarbebe22",
                    "id": "fzfqajk",
                    "parent_id": "t1_fzfpew8",
                    "score": 4,
                    "created_utc": 1595878738.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Spread those good vibes like peanut butter! Xoxo",
            "author": null,
            "id": "fzfqg0r",
            "parent_id": "t3_hyyn47",
            "score": 6,
            "created_utc": 1595878810.0,
            "replies": [
                {
                    "body": "🌞🌞🌞",
                    "author": "azucarbebe22",
                    "id": "fzfquou",
                    "parent_id": "t1_fzfqg0r",
                    "score": 1,
                    "created_utc": 1595878999.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "You’re so beautiful! Along with looking extremely happy in your photo.",
            "author": "box_pandoras",
            "id": "fzfujm9",
            "parent_id": "t3_hyyn47",
            "score": 7,
            "created_utc": 1595880745.0,
            "replies": [
                {
                    "body": "Thank you so much!! Believe it or not, I was very hesitant to post this photo- I hope it accomplishes my goal of encouraging others!",
                    "author": "azucarbebe22",
                    "id": "fzg1ht2",
                    "parent_id": "t1_fzfujm9",
                    "score": 1,
                    "created_utc": 1595884082.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "You are so cute, and I love that you’ve done this ❤️",
            "author": "throwawaysugarbaby12",
            "id": "fzfplcp",
            "parent_id": "t3_hyyn47",
            "score": 6,
            "created_utc": 1595878410.0,
            "replies": [
                {
                    "body": "Thank you so much ❤️❤️❤️",
                    "author": "azucarbebe22",
                    "id": "fzfpq3k",
                    "parent_id": "t1_fzfplcp",
                    "score": 4,
                    "created_utc": 1595878472.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "thank you for this",
            "author": "cherryribs",
            "id": "fzgbaiz",
            "parent_id": "t3_hyyn47",
            "score": 5,
            "created_utc": 1595888990.0,
            "replies": []
        },
        {
            "body": "I have **nothing** bad to say about the girl on the left.\n\nBut I would immediately find myself drawn to the girl on the right ;) There's something very appealing about that smile.",
            "author": "marker3000",
            "id": "fzg5u1u",
            "parent_id": "t3_hyyn47",
            "score": 5,
            "created_utc": 1595886243.0,
            "replies": [
                {
                    "body": "For the love of all that is holy, what earned this the wrath of the downvote cabal?\n\nThis place has its own kind of toxic. \n\nTime for a break.",
                    "author": "marker3000",
                    "id": "fzggt9o",
                    "parent_id": "t1_fzg5u1u",
                    "score": 4,
                    "created_utc": 1595891891.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "It’s all about the lighting, angle, and posing.",
            "author": null,
            "id": "fzj79nd",
            "parent_id": "t3_hyyn47",
            "score": 2,
            "created_utc": 1595957858.0,
            "replies": []
        },
        {
            "body": "The reason most SD who won’t contact the girl in the left, is because she is clearly high maintenance and they can’t afford the upkeep.\n\nOtherwise if they could, they will all probably go for one like that.",
            "author": "Lilipuss25",
            "id": "fzhumly",
            "parent_id": "t3_hyyn47",
            "score": 2,
            "created_utc": 1595926671.0,
            "replies": []
        },
        {
            "body": "Honestly I am more into the girl on the right than the left.",
            "author": "Paul_Drake",
            "id": "fzfmmft",
            "parent_id": "t3_hyyn47",
            "score": 0,
            "created_utc": 1595877015.0,
            "replies": [
                {
                    "body": "Agreed i would take the girl on the right 7 days out of the week and twice on Sunday.",
                    "author": "pintodinosaur",
                    "id": "fzfnnno",
                    "parent_id": "t1_fzfmmft",
                    "score": -1,
                    "created_utc": 1595877508.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "A lot of SB's miss the most important factor; personality.  I've been \"in the bowl\" for a long time and have met SB's in the hundreds over the years.  They have ranged from decent looking to 10+ and the ones that have stayed in my memories are the ones with real personality.  I had the pleasure of having an arrangement with one that was one of those 10+'s but after meeting her I realized that her best quality was the chemistry that we had.  She messaged me one day, we met the next and it was like we knew each other our entire lives.  It was the perfect arrangement.  I met one other that was very close and we had a great time but she went flaky over Covid 19 so there went that one. I've met others in this same category (10+) that had the personality of a lamp post.  They believed that a pretty face was all it took and they were wrong.  I've met some that were average in the looks department at best but they also were great fun and interesting to talk to.  To me that's the most important part.  SB's need to realize this and know that looks aren't everything, it takes more, at least for me it does.",
            "author": "Fishngator",
            "id": "fzgwjjj",
            "parent_id": "t3_hyyn47",
            "score": 1,
            "created_utc": 1595900695.0,
            "replies": []
        },
        {
            "body": "And that’s why a M&G matters. Pics are only an appetizer, and the whole package is what should matter on both sides.\n\nBut, it’s a free country and consenting adults can choose what they want to do.",
            "author": "solomon2609",
            "id": "fzghkkm",
            "parent_id": "t3_hyyn47",
            "score": 1,
            "created_utc": 1595892297.0,
            "replies": []
        },
        {
            "body": "Through years of experience, I far prefer a SB that’s an eight in looks, and a ten in personality to a SB who is ten in looks and a five in personality.",
            "author": "Funmountainguy",
            "id": "fzfnphc",
            "parent_id": "t3_hyyn47",
            "score": -1,
            "created_utc": 1595877532.0,
            "replies": []
        },
        {
            "body": "I have sugar dated 10/10 women, every time it's the worst experience. I look for a solid 5-7 with a fun personality. The one on the left I would never message.",
            "author": null,
            "id": "fzfwyj1",
            "parent_id": "t3_hyyn47",
            "score": -3,
            "created_utc": 1595881903.0,
            "replies": [
                {
                    "body": "Same here, though I don't use a numerical quotient, but if I did, I'd be happy with a 3-4 in a SD with an amazing intellect, who was respectful, generous and kind, over a young guy who thought he was Gods gift to women, or someone physically 'hot', but  was rude and crude and a brute with no social grace.",
                    "author": "Janemonroe",
                    "id": "fzgeqvh",
                    "parent_id": "t1_fzfwyj1",
                    "score": 5,
                    "created_utc": 1595890787.0,
                    "replies": []
                }
            ]
        },
        {
            "body": ">I thought all SBs looked like the girl on the left in the photo\n\nThe media really does a number on young girls; I wish it weren't so.  The person you refer to is clearly ill... like Karen Carpenter was.",
            "author": "TY2022",
            "id": "fzg2wmr",
            "parent_id": "t3_hyyn47",
            "score": -1,
            "created_utc": 1595884794.0,
            "replies": [
                {
                    "body": "That woman is not anorexic to the point of dying . Wtf ?? I’m just as slim as that woman and I’m perfectly healthy . Don’t make this weird",
                    "author": "Driftwould92",
                    "id": "fzgjd7l",
                    "parent_id": "t1_fzg2wmr",
                    "score": 9,
                    "created_utc": 1595893261.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Set your Tinder location to Minsk, Belarus and 92% of the women are the photo on the left (holding a giant bouquet* of flowers.)\n\n* Always an odd number of flowers, never even.",
            "author": "LaGriffeDuLion",
            "id": "fzgjcvt",
            "parent_id": "t3_hyyn47",
            "score": 0,
            "created_utc": 1595893255.0,
            "replies": []
        },
        {
            "body": "Girl on the left.....most likely will have high expectations and an attitude to match\n\nGirls on the right.....looks like she is fun to be around\n\nThe SBs that have works best for me are average in looks but above average in intelligence, personality, and want to learn or experience something new",
            "author": "js2066",
            "id": "fzfoeib",
            "parent_id": "t3_hyyn47",
            "score": -10,
            "created_utc": 1595877859.0,
            "replies": [
                {
                    "body": "Girls on the right + hair dye + new dress + posing + breathe in + SUNGLASSES = Girl on the left. \n\n\nAs a girl who's done modeling, seeing myself and fellow girl models dressing up, I'd say these are  EASILY achievable \nHehehe",
                    "author": "komeonebabe",
                    "id": "fzfui4b",
                    "parent_id": "t1_fzfoeib",
                    "score": 15,
                    "created_utc": 1595880725.0,
                    "replies": [
                        {
                            "body": "Haha!! Good to know. I’m a failure at all things beauty products and posing 😂 my Instagram game is nonexistent.",
                            "author": "azucarbebe22",
                            "id": "fzg0rad",
                            "parent_id": "t1_fzfui4b",
                            "score": 4,
                            "created_utc": 1595883720.0,
                            "replies": [
                                {
                                    "body": "Dont worrt, it takes very short to get good ;) ;)",
                                    "author": "komeonebabe",
                                    "id": "fzg4x4n",
                                    "parent_id": "t1_fzg0rad",
                                    "score": 3,
                                    "created_utc": 1595885793.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "fzfyydv",
                    "parent_id": "t1_fzfoeib",
                    "score": 21,
                    "created_utc": 1595882855.0,
                    "replies": [
                        {
                            "body": "In my experience that isn't true at all.  \n\nIt depends on what you are looking for in an SR, I have always found a better match with the types on the right.  They are more appreciative and willing to equally contribute to the SR.  The stereotypical girl on the left has unreal expectations or expectations that I am not willing to meet.  \n\nThis has nothing to do with attractiveness, but rather how you are putting yourself out there for people to interpret.",
                            "author": "js2066",
                            "id": "fzg0ayq",
                            "parent_id": "t1_fzfyydv",
                            "score": -9,
                            "created_utc": 1595883501.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Completely agree.  They are also much more fun in bed.",
                    "author": "Funmountainguy",
                    "id": "fzfq34x",
                    "parent_id": "t1_fzfoeib",
                    "score": -9,
                    "created_utc": 1595878641.0,
                    "replies": [
                        {
                            "body": "Wow, I didn't know you could tell how good someone is in bed by their pictures. Learn something new everyday.",
                            "author": "atypicalsb",
                            "id": "fzfw4bh",
                            "parent_id": "t1_fzfq34x",
                            "score": 17,
                            "created_utc": 1595881500.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Yep I agree. Give me the cute girl next door with intelligence and energy any day of the week.",
                    "author": null,
                    "id": "fzfrtjr",
                    "parent_id": "t1_fzfoeib",
                    "score": -7,
                    "created_utc": 1595879453.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I wouldn't even bother to contact the girl on the left.  I'm not looking for a high maintenance SB at all.",
            "author": "-Horatio-",
            "id": "fzfrnye",
            "parent_id": "t3_hyyn47",
            "score": -7,
            "created_utc": 1595879380.0,
            "replies": []
        },
        {
            "body": "You’re a doll. Thanks for the encouragement. ☺️",
            "author": null,
            "id": "fzgi9hz",
            "parent_id": "t3_hyyn47",
            "score": 0,
            "created_utc": 1595892671.0,
            "replies": []
        },
        {
            "body": "You look adorable!   I would be tickled to have a SB that looked like you!",
            "author": "NaughtyBoy4Fun",
            "id": "fzhgk2g",
            "parent_id": "t3_hyyn47",
            "score": 0,
            "created_utc": 1595913558.0,
            "replies": []
        },
        {
            "body": "Everybody is looking for something different. I prefer the pic on the right. She looks more genuine/real and the other just looks made up/fake. When the actual face to face happens, things may be totally different but that's my perspective on the pics.",
            "author": "-sixtnine-",
            "id": "fzif4qy",
            "parent_id": "t3_hyyn47",
            "score": 0,
            "created_utc": 1595943689.0,
            "replies": []
        },
        {
            "body": "My reaction to this post is the importance of your profile pictures.\n\nMy first impression of the woman on the left (before I even open her profile) \n\n* looking away from the camera which implies a lack of interest (and by subconscious extension, a lack of interest in me)\n* lack of smile/resting bitch face.  My impression is that she is not someone I would want to spend a lot of time with. \n* beautiful dress although my personal preference would have a more subdued print.  I could picture myself on a date with her at a dinner or show. \n* personal preference - I hate her earrings.  My preference is for jewelry to provide a graceful accent and not be a overpowering focal point\n* personal preference - I hate the sunglasses as pictured.  I see sunglasses as a functional tool to be used outside to protect your vision.\n\nBefore I even open her profile I have decided that she would be nice eye candy but our personal preferences would not line up for a long term arrangement.  It would take a strong  profile to change my mind. \n\nMy first impression if the woman on the left. \n\n* she is smiling and looking at the camera (me).  My impression is that she would be fun to spend time with. \n* picture shows her body well. From the one picture I would question how she would look dressed up.  I can picture myself on a casual date with her. \n* she could have picked a better background for the picture. \n\nBefore I open her profile my impression of her is \"the girl next door\".  I definitely would want to open her profile to learn more about her.  I would start from a slightly positive impression.",
            "author": "Bflat2012",
            "id": "fzjheff",
            "parent_id": "t3_hyyn47",
            "score": 0,
            "created_utc": 1595962666.0,
            "replies": []
        },
        {
            "body": "Based solely on the pictures, the young woman on the left looks beautiful but not someone I would necessarily reach out to on SA, the woman in the right, she looks like my type of woman, naturally beautiful and someone who knows how to have fun. Just my preference.",
            "author": "Daddyg2019",
            "id": "fzgqxft",
            "parent_id": "t3_hyyn47",
            "score": 0,
            "created_utc": 1595897482.0,
            "replies": []
        },
        {
            "body": "Agree with all the other posts that you are the more desirable SB.",
            "author": "EMPOWER_not_enable",
            "id": "fzfqisy",
            "parent_id": "t3_hyyn47",
            "score": -3,
            "created_utc": 1595878846.0,
            "replies": []
        },
        {
            "body": "Oh seeking arrangements. Miss those days but I did end up with a pretty 19 year old live in girlfriend thanks to the bowl.",
            "author": "Color_Me_Blue",
            "id": "fzgmdei",
            "parent_id": "t3_hyyn47",
            "score": -2,
            "created_utc": 1595894910.0,
            "replies": []
        },
        {
            "body": "Two things to say here: I live in Montreal and I had girls like the one in the left being okay with a monthly allowance of 2k for about once or twice a week. And had girls like you asking for 5k monthly. It varies, and so many factors makes the whole scene very different. Also I'm a somewhat-tall fit hispanic interesting person, some girls would rather have me with a lower allowance than faking the whole thing with a fat-ass 60yr millionaire. \n\nRegardless, great post :)",
            "author": "MadChirimoya",
            "id": "fzid3cv",
            "parent_id": "t3_hyyn47",
            "score": -1,
            "created_utc": 1595942457.0,
            "replies": []
        },
        {
            "body": "Mine usually have the same looks, they just post pictures of them that are 50 lbs less.",
            "author": "gamrguypb",
            "id": "fzj4yor",
            "parent_id": "t3_hyyn47",
            "score": -1,
            "created_utc": 1595956781.0,
            "replies": []
        },
        {
            "body": "Yay! Dming you if I come across anything needing a second opinion 🤗",
            "author": null,
            "id": "fzlrdrs",
            "parent_id": "t3_hyyn47",
            "score": -1,
            "created_utc": 1596013063.0,
            "replies": []
        },
        {
            "body": "I'd pick girl on the right all day long.",
            "author": "GSSD",
            "id": "fzj42cm",
            "parent_id": "t3_hyyn47",
            "score": -2,
            "created_utc": 1595956362.0,
            "replies": []
        },
        {
            "body": "This is my favorite comment",
            "author": "babylina",
            "id": "fzgf0zj",
            "parent_id": "t1_fzg8te2",
            "score": 34,
            "created_utc": 1595890934.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "fzgj9mv",
            "parent_id": "t1_fzg8te2",
            "score": 27,
            "created_utc": 1595893207.0,
            "replies": [
                {
                    "body": "Wanting “to see them all”: I honestly wonder if this is what causes a potential SD from connecting with the right SB for him. 🤔🤣",
                    "author": "BeautyGr8ce",
                    "id": "fzgl8u5",
                    "parent_id": "t1_fzgj9mv",
                    "score": 14,
                    "created_utc": 1595894283.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "fzgmww4",
                            "parent_id": "t1_fzgl8u5",
                            "score": 10,
                            "created_utc": 1595895208.0,
                            "replies": [
                                {
                                    "body": "Good for you! \n...But potentially fewer legit SDs in the bowl. 😆 Catch-22 can be such a B...",
                                    "author": "BeautyGr8ce",
                                    "id": "fzgrxhe",
                                    "parent_id": "t1_fzgmww4",
                                    "score": 1,
                                    "created_utc": 1595898055.0,
                                    "replies": [
                                        {
                                            "body": "[deleted]",
                                            "author": null,
                                            "id": "fzgu18j",
                                            "parent_id": "t1_fzgrxhe",
                                            "score": 2,
                                            "created_utc": 1595899245.0,
                                            "replies": [
                                                {
                                                    "body": "Ohhh. That’s nice 😊 I’m sure you two will be appreciated in this sugar-drought period.",
                                                    "author": "BeautyGr8ce",
                                                    "id": "fzgucqf",
                                                    "parent_id": "t1_fzgu18j",
                                                    "score": 1,
                                                    "created_utc": 1595899427.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "This. Both women in the photo are pretty close in terms of physical attractiveness. The left has a \"dolled up\" photo while the right has a more \"candid\" one.",
            "author": "emptyoverflow",
            "id": "fznrzsu",
            "parent_id": "t1_fzg5a56",
            "score": 6,
            "created_utc": 1596056227.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "fzfx8l3",
            "parent_id": "t1_fzfw9o3",
            "score": 63,
            "created_utc": 1595882038.0,
            "replies": [
                {
                    "body": "Some of these dudes are far more jaded than the \"pros\" they're always dog piling on and it doesn't take more than 5 inches of sight to see.",
                    "author": "2catsandacomputer",
                    "id": "fzj56wl",
                    "parent_id": "t1_fzfx8l3",
                    "score": 8,
                    "created_utc": 1595956887.0,
                    "replies": []
                },
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "fzgetwh",
                    "parent_id": "t1_fzfx8l3",
                    "score": 4,
                    "created_utc": 1595890831.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "fzgffbu",
                            "parent_id": "t1_fzgetwh",
                            "score": 17,
                            "created_utc": 1595891149.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "fzgjsc5",
                                    "parent_id": "t1_fzgffbu",
                                    "score": 24,
                                    "created_utc": 1595893489.0,
                                    "replies": []
                                },
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "fzgl7h1",
                                    "parent_id": "t1_fzgffbu",
                                    "score": 0,
                                    "created_utc": 1595894262.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "It’s just society convincing women that we have to compete with each other. It’s unfortunately always been this way.",
            "author": "MsDReid",
            "id": "fzgpy5s",
            "parent_id": "t1_fzfw9o3",
            "score": 17,
            "created_utc": 1595896920.0,
            "replies": []
        },
        {
            "body": "Yeah it’s interesting. I don’t think you should be downvoted for pointing this out. I made this post because of my prior assumptions, so it’s kind of interesting to hear all of the assumptions that other people make. I think we should unpack it! I assume it’s based on previous interactions with girls who look like me and girls who look like the girl on the left, but of course there are exceptions to every rule and it’s unfair to make a judgement based on appearance. But people do. I will say that I’ve talked to at least one POT who preferred the type of girl on the left.",
            "author": "azucarbebe22",
            "id": "fzfzvih",
            "parent_id": "t1_fzfw9o3",
            "score": 17,
            "created_utc": 1595883294.0,
            "replies": [
                {
                    "body": "I really want to clarify that I’m not attacking you in anyway. I understand why you made this post and I made sure to be extremely specific about what I thought was wrong—some of the responses! \n\nThe random hate DMs that I’m getting are entertaining though!",
                    "author": "SugarSpicenNice-",
                    "id": "fzgdgsv",
                    "parent_id": "t1_fzfzvih",
                    "score": 8,
                    "created_utc": 1595890112.0,
                    "replies": [
                        {
                            "body": "Hate DM's are from people who do not have the courage to attack one publicly and be judged for it.\n\nI could not be bothered to have a discussion with cowards.",
                            "author": "GDarn",
                            "id": "fzi937e",
                            "parent_id": "t1_fzgdgsv",
                            "score": 5,
                            "created_utc": 1595939818.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "I literally met a POT the other day that expected the left and didn’t even give me the time of day to get to know me so I hear you loud and clear",
                    "author": null,
                    "id": "fzjf1zk",
                    "parent_id": "t1_fzfzvih",
                    "score": 1,
                    "created_utc": 1595961550.0,
                    "replies": [
                        {
                            "body": "I’ve had the same experience a couple of times!",
                            "author": "azucarbebe22",
                            "id": "fzjfgrh",
                            "parent_id": "t1_fzjf1zk",
                            "score": 1,
                            "created_utc": 1595961744.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "The women here say rude things because they aren't as cute and the men say rude things because they couldn't afford her or have her interested in them.",
            "author": "Kurtpackage",
            "id": "fzgf3k7",
            "parent_id": "t1_fzfw9o3",
            "score": 18,
            "created_utc": 1595890973.0,
            "replies": [
                {
                    "body": "I don't see any women here saying she isn't cute. Normally it's the men negging over women being petty. \"oh you're just a girl next door type. Let me know if you don't find success I'd be interested!” like...you guys think she's attractive enough *for you*, but not attractive enough to find success *without* you? 🙄",
                    "author": "2catsandacomputer",
                    "id": "fzj5lr6",
                    "parent_id": "t1_fzgf3k7",
                    "score": 5,
                    "created_utc": 1595957081.0,
                    "replies": [
                        {
                            "body": "Ya, the \"negging\" is a blanket approach that sometimes can work but when it's so contrived, any worthwhile woman will see right through it.\n\nTeasing on the otherhand, I love and women seem to as well - being playful is fun.",
                            "author": "Kurtpackage",
                            "id": "fzk1pxz",
                            "parent_id": "t1_fzj5lr6",
                            "score": 3,
                            "created_utc": 1595972542.0,
                            "replies": [
                                {
                                    "body": "Thanks for being a good sport and realizing I meant \"you\" as a collective, not an individual :)",
                                    "author": "2catsandacomputer",
                                    "id": "fzk5bp7",
                                    "parent_id": "t1_fzk1pxz",
                                    "score": 1,
                                    "created_utc": 1595974370.0,
                                    "replies": [
                                        {
                                            "body": "I'm always a good sport! ;)",
                                            "author": "Kurtpackage",
                                            "id": "fzk7g83",
                                            "parent_id": "t1_fzk5bp7",
                                            "score": 1,
                                            "created_utc": 1595975469.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I don't particularly want to spend money on getting coins to buy awards so that I can give them out, but if I did I'd give you the \"faith in humanity\" award, because GODDAMN DO YOU DESERVE IT with this comment.\nYou are absolutely right, everybody has their own type and if someone wants to look like a whole damn goddess, we will not yank them down just because we're too self conscious about ourselves to allow others to exceed us. We should applaud them for their confidence and love of looking their best.\nAt the same time, we shouldn't beat people up when they don't want to try as hard as everyone else, maybe they're just happy with the way they are and it is not our job to give them crap for it. Instead, if we must say something, we can give them praise for how confident they must be in just being themself, or maybe try to flatter them into trying a new look, but we should not force them to do anything they aren't comfortable with.\n\nMy tits aren't too big, nor too small, my hips are wide, I've got a booty, my thighs are phat as fuck, and I've got a pocket tummy that sticks out...I can barely fit into my pants anymore and I've since had to size up. I never wear makeup (mostly bc I have no idea how to apply it, but also bc it makes my skin flare up due to allergies of certain chemicals), but I still get guys. There is hope for everyone one way or another, and we shouldn't shame people for how they choose to show themselves. If you're not into it? Look away, simple as that.",
            "author": "SolitarySeas",
            "id": "fzgm84a",
            "parent_id": "t1_fzg5ias",
            "score": 9,
            "created_utc": 1595894828.0,
            "replies": [
                {
                    "body": "Omigosh, I get it with the makeup. I have rheumatoid arthritis so sometimes my skin is okay with makeup and perfume and body glitter and some days it's just breaking out so I simply can't put that stuff on. \nI was really debating whether or not to post this because I thought it wouldn't matter but it rly bothered me that some are bashing this post. One of the comments was saying that she just wanted attention. \n\n👁👄👁 𝙏𝙝𝙖𝙩'𝙨 𝙬𝙝𝙮 𝙖𝙡𝙡 𝙤𝙛 𝙪𝙨 𝙖𝙧𝙚 𝙝𝙚𝙧𝙚. 𝘼 𝙎𝘽 𝙬𝙤𝙪𝙡𝙙 𝙝𝙖𝙫𝙚 𝙩𝙤 𝙬𝙖𝙣𝙩 𝙮𝙤𝙪 𝙛𝙤𝙧 𝙝𝙚𝙧/𝙝𝙞𝙢 𝙩𝙤 𝙡𝙞𝙠𝙚 𝙪𝙧 𝙥𝙧𝙤𝙛𝙞𝙡𝙚 𝙖𝙣𝙙 𝙩𝙝𝙚 𝙎𝘿 𝙬𝙤𝙪𝙡𝙙 𝙝𝙖𝙫𝙚 𝙩𝙤 𝙬𝙖𝙣𝙩 𝙮𝙤𝙪 𝙗𝙖𝙘𝙠. 𝙏𝙝𝙚𝙮'𝙙 𝙝𝙖𝙫𝙚 𝙩𝙤 𝙬𝙖𝙣𝙣𝙖 𝙋𝘼𝙔 𝘼𝙏𝙏𝙀𝙉𝙏𝙄𝙊𝙉 𝙩𝙤 𝙮𝙤𝙪. \n\nJust seems dumb. Everyone has things that make them sexy and desirable and interesting and it's stuff like that that sticks out and makes ppl want to talk to you and get closer, in vanilla relationships and in the Sugar Bowl. Most comments and posts I've seen have been helpful and kind and respectful(some are funny) so let's not mess that up.",
                    "author": "TheClearHaribo",
                    "id": "fzgpszx",
                    "parent_id": "t1_fzgm84a",
                    "score": 3,
                    "created_utc": 1595896840.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "House of CB has similar",
            "author": "babylina",
            "id": "fzgewgc",
            "parent_id": "t1_fzg4969",
            "score": 7,
            "created_utc": 1595890868.0,
            "replies": [
                {
                    "body": "looking up now:)",
                    "author": "raychelpotter",
                    "id": "fzh91q0",
                    "parent_id": "t1_fzgewgc",
                    "score": 4,
                    "created_utc": 1595908243.0,
                    "replies": [
                        {
                            "body": "oh yes it does. Nice and thank you",
                            "author": "raychelpotter",
                            "id": "fzh96sc",
                            "parent_id": "t1_fzh91q0",
                            "score": 3,
                            "created_utc": 1595908333.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "I love house of cb",
                    "author": "princessindo",
                    "id": "fzhg2yq",
                    "parent_id": "t1_fzgewgc",
                    "score": 3,
                    "created_utc": 1595913184.0,
                    "replies": []
                },
                {
                    "body": "Found some fabulous dresses! Not the one pictured but still found a few I would love to wear for my SD...until he unzips it and it slides off my body 🤷‍♀️🦋",
                    "author": "MyBeautifulLife4Me",
                    "id": "fzgpkmo",
                    "parent_id": "t1_fzgewgc",
                    "score": 2,
                    "created_utc": 1595896708.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Adorable dress",
            "author": "MyBeautifulLife4Me",
            "id": "fzgpgpa",
            "parent_id": "t1_fzg4969",
            "score": 3,
            "created_utc": 1595896645.0,
            "replies": []
        },
        {
            "body": "Let me know if you find it!",
            "author": "azucarbebe22",
            "id": "fzg6nc5",
            "parent_id": "t1_fzg4969",
            "score": 4,
            "created_utc": 1595886647.0,
            "replies": []
        },
        {
            "body": "This was sexy. I am the same way.",
            "author": "babylina",
            "id": "fzgfi4g",
            "parent_id": "t1_fzg0qgp",
            "score": 3,
            "created_utc": 1595891191.0,
            "replies": []
        },
        {
            "body": "Who doesn’t love laughter!?",
            "author": "genericMaker",
            "id": "fzglhpi",
            "parent_id": "t1_fzg0qgp",
            "score": 3,
            "created_utc": 1595894419.0,
            "replies": []
        },
        {
            "body": "This is amazing!!! Love it.",
            "author": "azucarbebe22",
            "id": "fzg15pf",
            "parent_id": "t1_fzg0qgp",
            "score": 1,
            "created_utc": 1595883915.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "fzg33u2",
                    "parent_id": "t1_fzg15pf",
                    "score": 6,
                    "created_utc": 1595884895.0,
                    "replies": [
                        {
                            "body": "Yes!!! I would love to take you up on that.",
                            "author": "azucarbebe22",
                            "id": "fzg3s2d",
                            "parent_id": "t1_fzg33u2",
                            "score": 3,
                            "created_utc": 1595885229.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Basically. \n\nI'm sure OP is lovely but if both girls messaged a SD and were asking for the same allowance, any SD who says he wouldn't go for left over right is lying through their teeth - discounting the baseless assumptions about her personality.\n\nBut the great thing is that L and R are not competing in the same pool at all. The kind of guys that can afford a model are not the ones in OP's inbox so there really is no direct competition. So I understand her message (altho the medium is questionable).",
            "author": "blonde-throwaway",
            "id": "fzgdwaz",
            "parent_id": "t1_fzfyxne",
            "score": 27,
            "created_utc": 1595890340.0,
            "replies": [
                {
                    "body": ">if both girls messaged a SD and were asking for the same allowance, any SD who says he wouldn't go for left over right is lying through their teeth - discounting the baseless assumptions about her personality.\n\nIsn't it amazing how you claim to know what **everyone** thinks?\n\nI reach out to POT's based on what I can glimpse about their personality and character, and I reached out to profiles with no pictures before.\n\nLooks matter, of course, but to claim (like you seem to above) that they are the one thing that matters is just wrong.\n\nI met amazingly beautiful people I had no chemistry with, average looking people I had great chemistry with, and every possible combination thereof. Chemistry and mutual attraction is far more important that mere looks.\n\nAnd on the allowance, I only discuss it on a second M&G, and I have not yet passed on someone I hit it off with because of the financial part of a relationship.",
                    "author": "GDarn",
                    "id": "fzi9pdd",
                    "parent_id": "t1_fzgdwaz",
                    "score": -2,
                    "created_utc": 1595940250.0,
                    "replies": [
                        {
                            "body": ">I reach out to POT's based on what I can glimpse about their personality and character\n\nSo you judge this girls personality and character based on ONE picture and no other information? Wrong.\n\n>But to claim (like you seem to above) that they are the one thing that matters is just wrong.\n\nPlease point out where I said looks are all that matters. Ceteris paribus, men will go for the left over the right. Like I said, *ignoring baseless assumptions about her personality.* \n\n>I met amazingly beautiful people I had no chemistry with, average looking people I had great chemistry with, and every possible combination thereof. \n\nSo what is your actual point? If you're saying that every possible combination exists then why is meeting a beautiful person with great chemistry being discounted all over this thread?",
                            "author": "blonde-throwaway",
                            "id": "fzibzpy",
                            "parent_id": "t1_fzi9pdd",
                            "score": 5,
                            "created_utc": 1595941763.0,
                            "replies": [
                                {
                                    "body": "\n>So you judge this girls personality and character based on ONE picture and no other information? Wrong.\n\nOf course that would be impossible.\n\nI think our disconnect seems to be that you appear to make the assumption that an arrangement is offered before chemistry and mutual attraction is established, which for me takes at least one in person meeting, during which one can get a pretty clear idea of one's personality and character.\n\n>If you're saying that every possible combination exists then why is meeting a beautiful person with great chemistry being discounted all over this thread?\n\nNo idea why people say that, nor do I know why you seem to think I either support those assertions, since my comment makes it clear I do not.\n\n>Please point out where I said looks are all that matters. Ceteris paribus, men will go for the left over the right. \n\nExcept that other things are never equal when talking about people.\n\nYou stating that decisions are made based on a picture and no other information seems to imply that looks are all that matter.\n\nIf that's not what it means, what did it mean?",
                                    "author": "GDarn",
                                    "id": "fzifwwp",
                                    "parent_id": "t1_fzibzpy",
                                    "score": -1,
                                    "created_utc": 1595944141.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Thissss.",
            "author": "azucarbebe22",
            "id": "fzjkddk",
            "parent_id": "t1_fzjhp2v",
            "score": 2,
            "created_utc": 1595964103.0,
            "replies": []
        },
        {
            "body": "I was too scared to say this. Both are pretty. White. Slim. Young. Lol.",
            "author": "raychelpotter",
            "id": "fzg4p2k",
            "parent_id": "t1_fzg1v8e",
            "score": 38,
            "created_utc": 1595885683.0,
            "replies": [
                {
                    "body": "> I was too scared to say this. Both are pretty. White. Slim. Young. Lol.\n\nI firmly believe that at a macro level, skin color is mostly irrelevant in that situation.\n\nYoung, Slim, and pretty.  That combination can find an SD in most locations/areas.",
                    "author": "SDstartingOut",
                    "id": "fzg52e2",
                    "parent_id": "t1_fzg4p2k",
                    "score": 4,
                    "created_utc": 1595885866.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "fzio1z4",
                            "parent_id": "t1_fzg52e2",
                            "score": 4,
                            "created_utc": 1595948517.0,
                            "replies": [
                                {
                                    "body": "> I've seen a few comments from black SBs/ aspiring SBs who were pretty disheartened\n\nTo be fair - people who put minimal effort in (of all colors & sexes) come posting here that they are having trouble.  \n\nThat said - what you describe specifically - did they fit that description:  Young, Slim, and pretty.  \n\nThe world is not boolean (I don't want to say black & white...), there is more then Easy & Hard.  We are also not talking about location, expectations, etc - which cause further variances.  But at its' most basic level - slim, fit, conventionally attractive women - of all races - have success.  \n\nNow, if we start talking overweight/curvy, do white women have an advantage?  I don't know.  I think when you start talking that body type - ALL women have difficulty.",
                                    "author": "SDstartingOut",
                                    "id": "fziqnm4",
                                    "parent_id": "t1_fzio1z4",
                                    "score": 2,
                                    "created_utc": 1595949848.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I’m sorry, I can’t help my own body shape!! 😅 I am so intimidated by the woman on the left, to me that is the societal standard of beauty and that’s why that’s what I thought of as what an SB would look like. And me? Well, that’s just me. I’d love to see other SBs do similar posts so we can see some variety!",
            "author": "azucarbebe22",
            "id": "fzg2f22",
            "parent_id": "t1_fzg1v8e",
            "score": 9,
            "created_utc": 1595884549.0,
            "replies": [
                {
                    "body": "> I am so intimidated by the woman on the left, to me that is the societal standard of beauty and that’s why that’s what I thought of as what an SB would look like\n\nIsn't that just makeup, clothing, and professional photography (with some possible airbrushing) ?",
                    "author": "SDstartingOut",
                    "id": "fzg5a9f",
                    "parent_id": "t1_fzg2f22",
                    "score": 18,
                    "created_utc": 1595885973.0,
                    "replies": [
                        {
                            "body": "I wouldn’t know 😂 I can’t do any of it despite some of my best efforts. I look the same with or without makeup.",
                            "author": "azucarbebe22",
                            "id": "fzg5wk4",
                            "parent_id": "t1_fzg5a9f",
                            "score": -3,
                            "created_utc": 1595886276.0,
                            "replies": [
                                {
                                    "body": "Homegirl on the left has had some work done, definitely her lips, most likely her nose and jawline. Fillers are so common these days, they take 20 minutes and you have brand new face. I also felt like I couldn't live up to the standards, especially here in LA, and then you realize it's all fake lol So dont worry if your best efforts dont look like that",
                                    "author": "Meowohmeow20",
                                    "id": "fzg6y0f",
                                    "parent_id": "t1_fzg5wk4",
                                    "score": 8,
                                    "created_utc": 1595886795.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Honestly you are very similar to the woman on the left. With good makeup, clothes, and a serious face you could take a similar picture with a similar effect.\n\nNext you object to men saying they wouldnt be interested in the woman on the left. Why? Looking at that picture the thought that enters my mind is that she's high maintenance, others will make their own judgements. Clothes do ultimately say a lot about a person, especially women because women have soooo much more choice in what they wear (sure a man can wear cyberpunk clothes but its not socially acceptable).\n\nIts rather silly when you object to men saying they'd prefer you for valid reasons isnt it?",
                    "author": "ICanOnlyGetSoElect",
                    "id": "fzge3aj",
                    "parent_id": "t1_fzg2f22",
                    "score": 1,
                    "created_utc": 1595890440.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "fziocmc",
                            "parent_id": "t1_fzge3aj",
                            "score": 7,
                            "created_utc": 1595948669.0,
                            "replies": [
                                {
                                    "body": "We'll just have to disagree on that then.",
                                    "author": "ICanOnlyGetSoElect",
                                    "id": "fziqlge",
                                    "parent_id": "t1_fziocmc",
                                    "score": -2,
                                    "created_utc": 1595949817.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "The ones who fit that description certainly aren't meeting for ppms...",
            "author": null,
            "id": "fzgduhd",
            "parent_id": "t1_fzfzzal",
            "score": 8,
            "created_utc": 1595890313.0,
            "replies": []
        },
        {
            "body": "I actually prefer the girl on the right.  The more down to earth genuine girl. Unfortunately when I see a girl on the left I actually raise my guard up that she could be a potential scammer. I am surebits not always like that but I guess its just been my experience.",
            "author": "ffreshindo",
            "id": "fzm8di2",
            "parent_id": "t1_fzg0kqf",
            "score": 0,
            "created_utc": 1596027791.0,
            "replies": []
        },
        {
            "body": "Absolutely. My SDs boosted my confidence 1000%. I’m pretty self confident in general, I was a competitive swimmer growing up so used to people seeing my body and kind of feel like my body “is what it is”.",
            "author": "azucarbebe22",
            "id": "fzgtte1",
            "parent_id": "t1_fzgri2b",
            "score": 1,
            "created_utc": 1595899120.0,
            "replies": []
        },
        {
            "body": "Sorry I wasn’t aware of Picture Thursday ☺️",
            "author": "azucarbebe22",
            "id": "fzg0218",
            "parent_id": "t1_fzfybuy",
            "score": 13,
            "created_utc": 1595883381.0,
            "replies": [
                {
                    "body": "Me either! I liked your post and am sorry *some* people are shitting on you for it.",
                    "author": null,
                    "id": "fzg1nrv",
                    "parent_id": "t1_fzg0218",
                    "score": 11,
                    "created_utc": 1595884166.0,
                    "replies": [
                        {
                            "body": "❤️❤️❤️ Thank you!",
                            "author": "azucarbebe22",
                            "id": "fzg1t4z",
                            "parent_id": "t1_fzg1nrv",
                            "score": 9,
                            "created_utc": 1595884240.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "And you are exactly who am hoping this post inspires.",
            "author": "azucarbebe22",
            "id": "fzg6h01",
            "parent_id": "t1_fzg55v5",
            "score": 10,
            "created_utc": 1595886558.0,
            "replies": []
        },
        {
            "body": "I had a soft tummy til like three months ago!! I started doing Emi Wong’s ab workouts on YouTube- they’re easy, no jumping, and have been pretty effective for me!",
            "author": "azucarbebe22",
            "id": "fzg6ezj",
            "parent_id": "t1_fzg55v5",
            "score": 6,
            "created_utc": 1595886531.0,
            "replies": []
        },
        {
            "body": "Thank you, that is very nice of you to say!! 😘😁",
            "author": "azucarbebe22",
            "id": "fzfqajk",
            "parent_id": "t1_fzfpew8",
            "score": 4,
            "created_utc": 1595878738.0,
            "replies": []
        },
        {
            "body": "🌞🌞🌞",
            "author": "azucarbebe22",
            "id": "fzfquou",
            "parent_id": "t1_fzfqg0r",
            "score": 1,
            "created_utc": 1595878999.0,
            "replies": []
        },
        {
            "body": "Thank you so much!! Believe it or not, I was very hesitant to post this photo- I hope it accomplishes my goal of encouraging others!",
            "author": "azucarbebe22",
            "id": "fzg1ht2",
            "parent_id": "t1_fzfujm9",
            "score": 1,
            "created_utc": 1595884082.0,
            "replies": []
        },
        {
            "body": "Thank you so much ❤️❤️❤️",
            "author": "azucarbebe22",
            "id": "fzfpq3k",
            "parent_id": "t1_fzfplcp",
            "score": 4,
            "created_utc": 1595878472.0,
            "replies": []
        },
        {
            "body": "For the love of all that is holy, what earned this the wrath of the downvote cabal?\n\nThis place has its own kind of toxic. \n\nTime for a break.",
            "author": "marker3000",
            "id": "fzggt9o",
            "parent_id": "t1_fzg5u1u",
            "score": 4,
            "created_utc": 1595891891.0,
            "replies": []
        },
        {
            "body": "Agreed i would take the girl on the right 7 days out of the week and twice on Sunday.",
            "author": "pintodinosaur",
            "id": "fzfnnno",
            "parent_id": "t1_fzfmmft",
            "score": -1,
            "created_utc": 1595877508.0,
            "replies": []
        },
        {
            "body": "Same here, though I don't use a numerical quotient, but if I did, I'd be happy with a 3-4 in a SD with an amazing intellect, who was respectful, generous and kind, over a young guy who thought he was Gods gift to women, or someone physically 'hot', but  was rude and crude and a brute with no social grace.",
            "author": "Janemonroe",
            "id": "fzgeqvh",
            "parent_id": "t1_fzfwyj1",
            "score": 5,
            "created_utc": 1595890787.0,
            "replies": []
        },
        {
            "body": "That woman is not anorexic to the point of dying . Wtf ?? I’m just as slim as that woman and I’m perfectly healthy . Don’t make this weird",
            "author": "Driftwould92",
            "id": "fzgjd7l",
            "parent_id": "t1_fzg2wmr",
            "score": 9,
            "created_utc": 1595893261.0,
            "replies": []
        },
        {
            "body": "Girls on the right + hair dye + new dress + posing + breathe in + SUNGLASSES = Girl on the left. \n\n\nAs a girl who's done modeling, seeing myself and fellow girl models dressing up, I'd say these are  EASILY achievable \nHehehe",
            "author": "komeonebabe",
            "id": "fzfui4b",
            "parent_id": "t1_fzfoeib",
            "score": 15,
            "created_utc": 1595880725.0,
            "replies": [
                {
                    "body": "Haha!! Good to know. I’m a failure at all things beauty products and posing 😂 my Instagram game is nonexistent.",
                    "author": "azucarbebe22",
                    "id": "fzg0rad",
                    "parent_id": "t1_fzfui4b",
                    "score": 4,
                    "created_utc": 1595883720.0,
                    "replies": [
                        {
                            "body": "Dont worrt, it takes very short to get good ;) ;)",
                            "author": "komeonebabe",
                            "id": "fzg4x4n",
                            "parent_id": "t1_fzg0rad",
                            "score": 3,
                            "created_utc": 1595885793.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "fzfyydv",
            "parent_id": "t1_fzfoeib",
            "score": 21,
            "created_utc": 1595882855.0,
            "replies": [
                {
                    "body": "In my experience that isn't true at all.  \n\nIt depends on what you are looking for in an SR, I have always found a better match with the types on the right.  They are more appreciative and willing to equally contribute to the SR.  The stereotypical girl on the left has unreal expectations or expectations that I am not willing to meet.  \n\nThis has nothing to do with attractiveness, but rather how you are putting yourself out there for people to interpret.",
                    "author": "js2066",
                    "id": "fzg0ayq",
                    "parent_id": "t1_fzfyydv",
                    "score": -9,
                    "created_utc": 1595883501.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Completely agree.  They are also much more fun in bed.",
            "author": "Funmountainguy",
            "id": "fzfq34x",
            "parent_id": "t1_fzfoeib",
            "score": -9,
            "created_utc": 1595878641.0,
            "replies": [
                {
                    "body": "Wow, I didn't know you could tell how good someone is in bed by their pictures. Learn something new everyday.",
                    "author": "atypicalsb",
                    "id": "fzfw4bh",
                    "parent_id": "t1_fzfq34x",
                    "score": 17,
                    "created_utc": 1595881500.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Yep I agree. Give me the cute girl next door with intelligence and energy any day of the week.",
            "author": null,
            "id": "fzfrtjr",
            "parent_id": "t1_fzfoeib",
            "score": -7,
            "created_utc": 1595879453.0,
            "replies": []
        },
        {
            "body": "Wanting “to see them all”: I honestly wonder if this is what causes a potential SD from connecting with the right SB for him. 🤔🤣",
            "author": "BeautyGr8ce",
            "id": "fzgl8u5",
            "parent_id": "t1_fzgj9mv",
            "score": 14,
            "created_utc": 1595894283.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "fzgmww4",
                    "parent_id": "t1_fzgl8u5",
                    "score": 10,
                    "created_utc": 1595895208.0,
                    "replies": [
                        {
                            "body": "Good for you! \n...But potentially fewer legit SDs in the bowl. 😆 Catch-22 can be such a B...",
                            "author": "BeautyGr8ce",
                            "id": "fzgrxhe",
                            "parent_id": "t1_fzgmww4",
                            "score": 1,
                            "created_utc": 1595898055.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "fzgu18j",
                                    "parent_id": "t1_fzgrxhe",
                                    "score": 2,
                                    "created_utc": 1595899245.0,
                                    "replies": [
                                        {
                                            "body": "Ohhh. That’s nice 😊 I’m sure you two will be appreciated in this sugar-drought period.",
                                            "author": "BeautyGr8ce",
                                            "id": "fzgucqf",
                                            "parent_id": "t1_fzgu18j",
                                            "score": 1,
                                            "created_utc": 1595899427.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Some of these dudes are far more jaded than the \"pros\" they're always dog piling on and it doesn't take more than 5 inches of sight to see.",
            "author": "2catsandacomputer",
            "id": "fzj56wl",
            "parent_id": "t1_fzfx8l3",
            "score": 8,
            "created_utc": 1595956887.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "fzgetwh",
            "parent_id": "t1_fzfx8l3",
            "score": 4,
            "created_utc": 1595890831.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "fzgffbu",
                    "parent_id": "t1_fzgetwh",
                    "score": 17,
                    "created_utc": 1595891149.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "fzgjsc5",
                            "parent_id": "t1_fzgffbu",
                            "score": 24,
                            "created_utc": 1595893489.0,
                            "replies": []
                        },
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "fzgl7h1",
                            "parent_id": "t1_fzgffbu",
                            "score": 0,
                            "created_utc": 1595894262.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I really want to clarify that I’m not attacking you in anyway. I understand why you made this post and I made sure to be extremely specific about what I thought was wrong—some of the responses! \n\nThe random hate DMs that I’m getting are entertaining though!",
            "author": "SugarSpicenNice-",
            "id": "fzgdgsv",
            "parent_id": "t1_fzfzvih",
            "score": 8,
            "created_utc": 1595890112.0,
            "replies": [
                {
                    "body": "Hate DM's are from people who do not have the courage to attack one publicly and be judged for it.\n\nI could not be bothered to have a discussion with cowards.",
                    "author": "GDarn",
                    "id": "fzi937e",
                    "parent_id": "t1_fzgdgsv",
                    "score": 5,
                    "created_utc": 1595939818.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I literally met a POT the other day that expected the left and didn’t even give me the time of day to get to know me so I hear you loud and clear",
            "author": null,
            "id": "fzjf1zk",
            "parent_id": "t1_fzfzvih",
            "score": 1,
            "created_utc": 1595961550.0,
            "replies": [
                {
                    "body": "I’ve had the same experience a couple of times!",
                    "author": "azucarbebe22",
                    "id": "fzjfgrh",
                    "parent_id": "t1_fzjf1zk",
                    "score": 1,
                    "created_utc": 1595961744.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I don't see any women here saying she isn't cute. Normally it's the men negging over women being petty. \"oh you're just a girl next door type. Let me know if you don't find success I'd be interested!” like...you guys think she's attractive enough *for you*, but not attractive enough to find success *without* you? 🙄",
            "author": "2catsandacomputer",
            "id": "fzj5lr6",
            "parent_id": "t1_fzgf3k7",
            "score": 5,
            "created_utc": 1595957081.0,
            "replies": [
                {
                    "body": "Ya, the \"negging\" is a blanket approach that sometimes can work but when it's so contrived, any worthwhile woman will see right through it.\n\nTeasing on the otherhand, I love and women seem to as well - being playful is fun.",
                    "author": "Kurtpackage",
                    "id": "fzk1pxz",
                    "parent_id": "t1_fzj5lr6",
                    "score": 3,
                    "created_utc": 1595972542.0,
                    "replies": [
                        {
                            "body": "Thanks for being a good sport and realizing I meant \"you\" as a collective, not an individual :)",
                            "author": "2catsandacomputer",
                            "id": "fzk5bp7",
                            "parent_id": "t1_fzk1pxz",
                            "score": 1,
                            "created_utc": 1595974370.0,
                            "replies": [
                                {
                                    "body": "I'm always a good sport! ;)",
                                    "author": "Kurtpackage",
                                    "id": "fzk7g83",
                                    "parent_id": "t1_fzk5bp7",
                                    "score": 1,
                                    "created_utc": 1595975469.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Omigosh, I get it with the makeup. I have rheumatoid arthritis so sometimes my skin is okay with makeup and perfume and body glitter and some days it's just breaking out so I simply can't put that stuff on. \nI was really debating whether or not to post this because I thought it wouldn't matter but it rly bothered me that some are bashing this post. One of the comments was saying that she just wanted attention. \n\n👁👄👁 𝙏𝙝𝙖𝙩'𝙨 𝙬𝙝𝙮 𝙖𝙡𝙡 𝙤𝙛 𝙪𝙨 𝙖𝙧𝙚 𝙝𝙚𝙧𝙚. 𝘼 𝙎𝘽 𝙬𝙤𝙪𝙡𝙙 𝙝𝙖𝙫𝙚 𝙩𝙤 𝙬𝙖𝙣𝙩 𝙮𝙤𝙪 𝙛𝙤𝙧 𝙝𝙚𝙧/𝙝𝙞𝙢 𝙩𝙤 𝙡𝙞𝙠𝙚 𝙪𝙧 𝙥𝙧𝙤𝙛𝙞𝙡𝙚 𝙖𝙣𝙙 𝙩𝙝𝙚 𝙎𝘿 𝙬𝙤𝙪𝙡𝙙 𝙝𝙖𝙫𝙚 𝙩𝙤 𝙬𝙖𝙣𝙩 𝙮𝙤𝙪 𝙗𝙖𝙘𝙠. 𝙏𝙝𝙚𝙮'𝙙 𝙝𝙖𝙫𝙚 𝙩𝙤 𝙬𝙖𝙣𝙣𝙖 𝙋𝘼𝙔 𝘼𝙏𝙏𝙀𝙉𝙏𝙄𝙊𝙉 𝙩𝙤 𝙮𝙤𝙪. \n\nJust seems dumb. Everyone has things that make them sexy and desirable and interesting and it's stuff like that that sticks out and makes ppl want to talk to you and get closer, in vanilla relationships and in the Sugar Bowl. Most comments and posts I've seen have been helpful and kind and respectful(some are funny) so let's not mess that up.",
            "author": "TheClearHaribo",
            "id": "fzgpszx",
            "parent_id": "t1_fzgm84a",
            "score": 3,
            "created_utc": 1595896840.0,
            "replies": []
        },
        {
            "body": "looking up now:)",
            "author": "raychelpotter",
            "id": "fzh91q0",
            "parent_id": "t1_fzgewgc",
            "score": 4,
            "created_utc": 1595908243.0,
            "replies": [
                {
                    "body": "oh yes it does. Nice and thank you",
                    "author": "raychelpotter",
                    "id": "fzh96sc",
                    "parent_id": "t1_fzh91q0",
                    "score": 3,
                    "created_utc": 1595908333.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I love house of cb",
            "author": "princessindo",
            "id": "fzhg2yq",
            "parent_id": "t1_fzgewgc",
            "score": 3,
            "created_utc": 1595913184.0,
            "replies": []
        },
        {
            "body": "Found some fabulous dresses! Not the one pictured but still found a few I would love to wear for my SD...until he unzips it and it slides off my body 🤷‍♀️🦋",
            "author": "MyBeautifulLife4Me",
            "id": "fzgpkmo",
            "parent_id": "t1_fzgewgc",
            "score": 2,
            "created_utc": 1595896708.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "fzg33u2",
            "parent_id": "t1_fzg15pf",
            "score": 6,
            "created_utc": 1595884895.0,
            "replies": [
                {
                    "body": "Yes!!! I would love to take you up on that.",
                    "author": "azucarbebe22",
                    "id": "fzg3s2d",
                    "parent_id": "t1_fzg33u2",
                    "score": 3,
                    "created_utc": 1595885229.0,
                    "replies": []
                }
            ]
        },
        {
            "body": ">if both girls messaged a SD and were asking for the same allowance, any SD who says he wouldn't go for left over right is lying through their teeth - discounting the baseless assumptions about her personality.\n\nIsn't it amazing how you claim to know what **everyone** thinks?\n\nI reach out to POT's based on what I can glimpse about their personality and character, and I reached out to profiles with no pictures before.\n\nLooks matter, of course, but to claim (like you seem to above) that they are the one thing that matters is just wrong.\n\nI met amazingly beautiful people I had no chemistry with, average looking people I had great chemistry with, and every possible combination thereof. Chemistry and mutual attraction is far more important that mere looks.\n\nAnd on the allowance, I only discuss it on a second M&G, and I have not yet passed on someone I hit it off with because of the financial part of a relationship.",
            "author": "GDarn",
            "id": "fzi9pdd",
            "parent_id": "t1_fzgdwaz",
            "score": -2,
            "created_utc": 1595940250.0,
            "replies": [
                {
                    "body": ">I reach out to POT's based on what I can glimpse about their personality and character\n\nSo you judge this girls personality and character based on ONE picture and no other information? Wrong.\n\n>But to claim (like you seem to above) that they are the one thing that matters is just wrong.\n\nPlease point out where I said looks are all that matters. Ceteris paribus, men will go for the left over the right. Like I said, *ignoring baseless assumptions about her personality.* \n\n>I met amazingly beautiful people I had no chemistry with, average looking people I had great chemistry with, and every possible combination thereof. \n\nSo what is your actual point? If you're saying that every possible combination exists then why is meeting a beautiful person with great chemistry being discounted all over this thread?",
                    "author": "blonde-throwaway",
                    "id": "fzibzpy",
                    "parent_id": "t1_fzi9pdd",
                    "score": 5,
                    "created_utc": 1595941763.0,
                    "replies": [
                        {
                            "body": "\n>So you judge this girls personality and character based on ONE picture and no other information? Wrong.\n\nOf course that would be impossible.\n\nI think our disconnect seems to be that you appear to make the assumption that an arrangement is offered before chemistry and mutual attraction is established, which for me takes at least one in person meeting, during which one can get a pretty clear idea of one's personality and character.\n\n>If you're saying that every possible combination exists then why is meeting a beautiful person with great chemistry being discounted all over this thread?\n\nNo idea why people say that, nor do I know why you seem to think I either support those assertions, since my comment makes it clear I do not.\n\n>Please point out where I said looks are all that matters. Ceteris paribus, men will go for the left over the right. \n\nExcept that other things are never equal when talking about people.\n\nYou stating that decisions are made based on a picture and no other information seems to imply that looks are all that matter.\n\nIf that's not what it means, what did it mean?",
                            "author": "GDarn",
                            "id": "fzifwwp",
                            "parent_id": "t1_fzibzpy",
                            "score": -1,
                            "created_utc": 1595944141.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "> I was too scared to say this. Both are pretty. White. Slim. Young. Lol.\n\nI firmly believe that at a macro level, skin color is mostly irrelevant in that situation.\n\nYoung, Slim, and pretty.  That combination can find an SD in most locations/areas.",
            "author": "SDstartingOut",
            "id": "fzg52e2",
            "parent_id": "t1_fzg4p2k",
            "score": 4,
            "created_utc": 1595885866.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "fzio1z4",
                    "parent_id": "t1_fzg52e2",
                    "score": 4,
                    "created_utc": 1595948517.0,
                    "replies": [
                        {
                            "body": "> I've seen a few comments from black SBs/ aspiring SBs who were pretty disheartened\n\nTo be fair - people who put minimal effort in (of all colors & sexes) come posting here that they are having trouble.  \n\nThat said - what you describe specifically - did they fit that description:  Young, Slim, and pretty.  \n\nThe world is not boolean (I don't want to say black & white...), there is more then Easy & Hard.  We are also not talking about location, expectations, etc - which cause further variances.  But at its' most basic level - slim, fit, conventionally attractive women - of all races - have success.  \n\nNow, if we start talking overweight/curvy, do white women have an advantage?  I don't know.  I think when you start talking that body type - ALL women have difficulty.",
                            "author": "SDstartingOut",
                            "id": "fziqnm4",
                            "parent_id": "t1_fzio1z4",
                            "score": 2,
                            "created_utc": 1595949848.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "> I am so intimidated by the woman on the left, to me that is the societal standard of beauty and that’s why that’s what I thought of as what an SB would look like\n\nIsn't that just makeup, clothing, and professional photography (with some possible airbrushing) ?",
            "author": "SDstartingOut",
            "id": "fzg5a9f",
            "parent_id": "t1_fzg2f22",
            "score": 18,
            "created_utc": 1595885973.0,
            "replies": [
                {
                    "body": "I wouldn’t know 😂 I can’t do any of it despite some of my best efforts. I look the same with or without makeup.",
                    "author": "azucarbebe22",
                    "id": "fzg5wk4",
                    "parent_id": "t1_fzg5a9f",
                    "score": -3,
                    "created_utc": 1595886276.0,
                    "replies": [
                        {
                            "body": "Homegirl on the left has had some work done, definitely her lips, most likely her nose and jawline. Fillers are so common these days, they take 20 minutes and you have brand new face. I also felt like I couldn't live up to the standards, especially here in LA, and then you realize it's all fake lol So dont worry if your best efforts dont look like that",
                            "author": "Meowohmeow20",
                            "id": "fzg6y0f",
                            "parent_id": "t1_fzg5wk4",
                            "score": 8,
                            "created_utc": 1595886795.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Honestly you are very similar to the woman on the left. With good makeup, clothes, and a serious face you could take a similar picture with a similar effect.\n\nNext you object to men saying they wouldnt be interested in the woman on the left. Why? Looking at that picture the thought that enters my mind is that she's high maintenance, others will make their own judgements. Clothes do ultimately say a lot about a person, especially women because women have soooo much more choice in what they wear (sure a man can wear cyberpunk clothes but its not socially acceptable).\n\nIts rather silly when you object to men saying they'd prefer you for valid reasons isnt it?",
            "author": "ICanOnlyGetSoElect",
            "id": "fzge3aj",
            "parent_id": "t1_fzg2f22",
            "score": 1,
            "created_utc": 1595890440.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "fziocmc",
                    "parent_id": "t1_fzge3aj",
                    "score": 7,
                    "created_utc": 1595948669.0,
                    "replies": [
                        {
                            "body": "We'll just have to disagree on that then.",
                            "author": "ICanOnlyGetSoElect",
                            "id": "fziqlge",
                            "parent_id": "t1_fziocmc",
                            "score": -2,
                            "created_utc": 1595949817.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Me either! I liked your post and am sorry *some* people are shitting on you for it.",
            "author": null,
            "id": "fzg1nrv",
            "parent_id": "t1_fzg0218",
            "score": 11,
            "created_utc": 1595884166.0,
            "replies": [
                {
                    "body": "❤️❤️❤️ Thank you!",
                    "author": "azucarbebe22",
                    "id": "fzg1t4z",
                    "parent_id": "t1_fzg1nrv",
                    "score": 9,
                    "created_utc": 1595884240.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Haha!! Good to know. I’m a failure at all things beauty products and posing 😂 my Instagram game is nonexistent.",
            "author": "azucarbebe22",
            "id": "fzg0rad",
            "parent_id": "t1_fzfui4b",
            "score": 4,
            "created_utc": 1595883720.0,
            "replies": [
                {
                    "body": "Dont worrt, it takes very short to get good ;) ;)",
                    "author": "komeonebabe",
                    "id": "fzg4x4n",
                    "parent_id": "t1_fzg0rad",
                    "score": 3,
                    "created_utc": 1595885793.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "In my experience that isn't true at all.  \n\nIt depends on what you are looking for in an SR, I have always found a better match with the types on the right.  They are more appreciative and willing to equally contribute to the SR.  The stereotypical girl on the left has unreal expectations or expectations that I am not willing to meet.  \n\nThis has nothing to do with attractiveness, but rather how you are putting yourself out there for people to interpret.",
            "author": "js2066",
            "id": "fzg0ayq",
            "parent_id": "t1_fzfyydv",
            "score": -9,
            "created_utc": 1595883501.0,
            "replies": []
        },
        {
            "body": "Wow, I didn't know you could tell how good someone is in bed by their pictures. Learn something new everyday.",
            "author": "atypicalsb",
            "id": "fzfw4bh",
            "parent_id": "t1_fzfq34x",
            "score": 17,
            "created_utc": 1595881500.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "fzgmww4",
            "parent_id": "t1_fzgl8u5",
            "score": 10,
            "created_utc": 1595895208.0,
            "replies": [
                {
                    "body": "Good for you! \n...But potentially fewer legit SDs in the bowl. 😆 Catch-22 can be such a B...",
                    "author": "BeautyGr8ce",
                    "id": "fzgrxhe",
                    "parent_id": "t1_fzgmww4",
                    "score": 1,
                    "created_utc": 1595898055.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "fzgu18j",
                            "parent_id": "t1_fzgrxhe",
                            "score": 2,
                            "created_utc": 1595899245.0,
                            "replies": [
                                {
                                    "body": "Ohhh. That’s nice 😊 I’m sure you two will be appreciated in this sugar-drought period.",
                                    "author": "BeautyGr8ce",
                                    "id": "fzgucqf",
                                    "parent_id": "t1_fzgu18j",
                                    "score": 1,
                                    "created_utc": 1595899427.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "fzgffbu",
            "parent_id": "t1_fzgetwh",
            "score": 17,
            "created_utc": 1595891149.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "fzgjsc5",
                    "parent_id": "t1_fzgffbu",
                    "score": 24,
                    "created_utc": 1595893489.0,
                    "replies": []
                },
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "fzgl7h1",
                    "parent_id": "t1_fzgffbu",
                    "score": 0,
                    "created_utc": 1595894262.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Hate DM's are from people who do not have the courage to attack one publicly and be judged for it.\n\nI could not be bothered to have a discussion with cowards.",
            "author": "GDarn",
            "id": "fzi937e",
            "parent_id": "t1_fzgdgsv",
            "score": 5,
            "created_utc": 1595939818.0,
            "replies": []
        },
        {
            "body": "I’ve had the same experience a couple of times!",
            "author": "azucarbebe22",
            "id": "fzjfgrh",
            "parent_id": "t1_fzjf1zk",
            "score": 1,
            "created_utc": 1595961744.0,
            "replies": []
        },
        {
            "body": "Ya, the \"negging\" is a blanket approach that sometimes can work but when it's so contrived, any worthwhile woman will see right through it.\n\nTeasing on the otherhand, I love and women seem to as well - being playful is fun.",
            "author": "Kurtpackage",
            "id": "fzk1pxz",
            "parent_id": "t1_fzj5lr6",
            "score": 3,
            "created_utc": 1595972542.0,
            "replies": [
                {
                    "body": "Thanks for being a good sport and realizing I meant \"you\" as a collective, not an individual :)",
                    "author": "2catsandacomputer",
                    "id": "fzk5bp7",
                    "parent_id": "t1_fzk1pxz",
                    "score": 1,
                    "created_utc": 1595974370.0,
                    "replies": [
                        {
                            "body": "I'm always a good sport! ;)",
                            "author": "Kurtpackage",
                            "id": "fzk7g83",
                            "parent_id": "t1_fzk5bp7",
                            "score": 1,
                            "created_utc": 1595975469.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "oh yes it does. Nice and thank you",
            "author": "raychelpotter",
            "id": "fzh96sc",
            "parent_id": "t1_fzh91q0",
            "score": 3,
            "created_utc": 1595908333.0,
            "replies": []
        },
        {
            "body": "Yes!!! I would love to take you up on that.",
            "author": "azucarbebe22",
            "id": "fzg3s2d",
            "parent_id": "t1_fzg33u2",
            "score": 3,
            "created_utc": 1595885229.0,
            "replies": []
        },
        {
            "body": ">I reach out to POT's based on what I can glimpse about their personality and character\n\nSo you judge this girls personality and character based on ONE picture and no other information? Wrong.\n\n>But to claim (like you seem to above) that they are the one thing that matters is just wrong.\n\nPlease point out where I said looks are all that matters. Ceteris paribus, men will go for the left over the right. Like I said, *ignoring baseless assumptions about her personality.* \n\n>I met amazingly beautiful people I had no chemistry with, average looking people I had great chemistry with, and every possible combination thereof. \n\nSo what is your actual point? If you're saying that every possible combination exists then why is meeting a beautiful person with great chemistry being discounted all over this thread?",
            "author": "blonde-throwaway",
            "id": "fzibzpy",
            "parent_id": "t1_fzi9pdd",
            "score": 5,
            "created_utc": 1595941763.0,
            "replies": [
                {
                    "body": "\n>So you judge this girls personality and character based on ONE picture and no other information? Wrong.\n\nOf course that would be impossible.\n\nI think our disconnect seems to be that you appear to make the assumption that an arrangement is offered before chemistry and mutual attraction is established, which for me takes at least one in person meeting, during which one can get a pretty clear idea of one's personality and character.\n\n>If you're saying that every possible combination exists then why is meeting a beautiful person with great chemistry being discounted all over this thread?\n\nNo idea why people say that, nor do I know why you seem to think I either support those assertions, since my comment makes it clear I do not.\n\n>Please point out where I said looks are all that matters. Ceteris paribus, men will go for the left over the right. \n\nExcept that other things are never equal when talking about people.\n\nYou stating that decisions are made based on a picture and no other information seems to imply that looks are all that matter.\n\nIf that's not what it means, what did it mean?",
                    "author": "GDarn",
                    "id": "fzifwwp",
                    "parent_id": "t1_fzibzpy",
                    "score": -1,
                    "created_utc": 1595944141.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "fzio1z4",
            "parent_id": "t1_fzg52e2",
            "score": 4,
            "created_utc": 1595948517.0,
            "replies": [
                {
                    "body": "> I've seen a few comments from black SBs/ aspiring SBs who were pretty disheartened\n\nTo be fair - people who put minimal effort in (of all colors & sexes) come posting here that they are having trouble.  \n\nThat said - what you describe specifically - did they fit that description:  Young, Slim, and pretty.  \n\nThe world is not boolean (I don't want to say black & white...), there is more then Easy & Hard.  We are also not talking about location, expectations, etc - which cause further variances.  But at its' most basic level - slim, fit, conventionally attractive women - of all races - have success.  \n\nNow, if we start talking overweight/curvy, do white women have an advantage?  I don't know.  I think when you start talking that body type - ALL women have difficulty.",
                    "author": "SDstartingOut",
                    "id": "fziqnm4",
                    "parent_id": "t1_fzio1z4",
                    "score": 2,
                    "created_utc": 1595949848.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I wouldn’t know 😂 I can’t do any of it despite some of my best efforts. I look the same with or without makeup.",
            "author": "azucarbebe22",
            "id": "fzg5wk4",
            "parent_id": "t1_fzg5a9f",
            "score": -3,
            "created_utc": 1595886276.0,
            "replies": [
                {
                    "body": "Homegirl on the left has had some work done, definitely her lips, most likely her nose and jawline. Fillers are so common these days, they take 20 minutes and you have brand new face. I also felt like I couldn't live up to the standards, especially here in LA, and then you realize it's all fake lol So dont worry if your best efforts dont look like that",
                    "author": "Meowohmeow20",
                    "id": "fzg6y0f",
                    "parent_id": "t1_fzg5wk4",
                    "score": 8,
                    "created_utc": 1595886795.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "fziocmc",
            "parent_id": "t1_fzge3aj",
            "score": 7,
            "created_utc": 1595948669.0,
            "replies": [
                {
                    "body": "We'll just have to disagree on that then.",
                    "author": "ICanOnlyGetSoElect",
                    "id": "fziqlge",
                    "parent_id": "t1_fziocmc",
                    "score": -2,
                    "created_utc": 1595949817.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "❤️❤️❤️ Thank you!",
            "author": "azucarbebe22",
            "id": "fzg1t4z",
            "parent_id": "t1_fzg1nrv",
            "score": 9,
            "created_utc": 1595884240.0,
            "replies": []
        },
        {
            "body": "Dont worrt, it takes very short to get good ;) ;)",
            "author": "komeonebabe",
            "id": "fzg4x4n",
            "parent_id": "t1_fzg0rad",
            "score": 3,
            "created_utc": 1595885793.0,
            "replies": []
        },
        {
            "body": "Good for you! \n...But potentially fewer legit SDs in the bowl. 😆 Catch-22 can be such a B...",
            "author": "BeautyGr8ce",
            "id": "fzgrxhe",
            "parent_id": "t1_fzgmww4",
            "score": 1,
            "created_utc": 1595898055.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "fzgu18j",
                    "parent_id": "t1_fzgrxhe",
                    "score": 2,
                    "created_utc": 1595899245.0,
                    "replies": [
                        {
                            "body": "Ohhh. That’s nice 😊 I’m sure you two will be appreciated in this sugar-drought period.",
                            "author": "BeautyGr8ce",
                            "id": "fzgucqf",
                            "parent_id": "t1_fzgu18j",
                            "score": 1,
                            "created_utc": 1595899427.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "fzgjsc5",
            "parent_id": "t1_fzgffbu",
            "score": 24,
            "created_utc": 1595893489.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "fzgl7h1",
            "parent_id": "t1_fzgffbu",
            "score": 0,
            "created_utc": 1595894262.0,
            "replies": []
        },
        {
            "body": "Thanks for being a good sport and realizing I meant \"you\" as a collective, not an individual :)",
            "author": "2catsandacomputer",
            "id": "fzk5bp7",
            "parent_id": "t1_fzk1pxz",
            "score": 1,
            "created_utc": 1595974370.0,
            "replies": [
                {
                    "body": "I'm always a good sport! ;)",
                    "author": "Kurtpackage",
                    "id": "fzk7g83",
                    "parent_id": "t1_fzk5bp7",
                    "score": 1,
                    "created_utc": 1595975469.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "\n>So you judge this girls personality and character based on ONE picture and no other information? Wrong.\n\nOf course that would be impossible.\n\nI think our disconnect seems to be that you appear to make the assumption that an arrangement is offered before chemistry and mutual attraction is established, which for me takes at least one in person meeting, during which one can get a pretty clear idea of one's personality and character.\n\n>If you're saying that every possible combination exists then why is meeting a beautiful person with great chemistry being discounted all over this thread?\n\nNo idea why people say that, nor do I know why you seem to think I either support those assertions, since my comment makes it clear I do not.\n\n>Please point out where I said looks are all that matters. Ceteris paribus, men will go for the left over the right. \n\nExcept that other things are never equal when talking about people.\n\nYou stating that decisions are made based on a picture and no other information seems to imply that looks are all that matter.\n\nIf that's not what it means, what did it mean?",
            "author": "GDarn",
            "id": "fzifwwp",
            "parent_id": "t1_fzibzpy",
            "score": -1,
            "created_utc": 1595944141.0,
            "replies": []
        },
        {
            "body": "> I've seen a few comments from black SBs/ aspiring SBs who were pretty disheartened\n\nTo be fair - people who put minimal effort in (of all colors & sexes) come posting here that they are having trouble.  \n\nThat said - what you describe specifically - did they fit that description:  Young, Slim, and pretty.  \n\nThe world is not boolean (I don't want to say black & white...), there is more then Easy & Hard.  We are also not talking about location, expectations, etc - which cause further variances.  But at its' most basic level - slim, fit, conventionally attractive women - of all races - have success.  \n\nNow, if we start talking overweight/curvy, do white women have an advantage?  I don't know.  I think when you start talking that body type - ALL women have difficulty.",
            "author": "SDstartingOut",
            "id": "fziqnm4",
            "parent_id": "t1_fzio1z4",
            "score": 2,
            "created_utc": 1595949848.0,
            "replies": []
        },
        {
            "body": "Homegirl on the left has had some work done, definitely her lips, most likely her nose and jawline. Fillers are so common these days, they take 20 minutes and you have brand new face. I also felt like I couldn't live up to the standards, especially here in LA, and then you realize it's all fake lol So dont worry if your best efforts dont look like that",
            "author": "Meowohmeow20",
            "id": "fzg6y0f",
            "parent_id": "t1_fzg5wk4",
            "score": 8,
            "created_utc": 1595886795.0,
            "replies": []
        },
        {
            "body": "We'll just have to disagree on that then.",
            "author": "ICanOnlyGetSoElect",
            "id": "fziqlge",
            "parent_id": "t1_fziocmc",
            "score": -2,
            "created_utc": 1595949817.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "fzgu18j",
            "parent_id": "t1_fzgrxhe",
            "score": 2,
            "created_utc": 1595899245.0,
            "replies": [
                {
                    "body": "Ohhh. That’s nice 😊 I’m sure you two will be appreciated in this sugar-drought period.",
                    "author": "BeautyGr8ce",
                    "id": "fzgucqf",
                    "parent_id": "t1_fzgu18j",
                    "score": 1,
                    "created_utc": 1595899427.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I'm always a good sport! ;)",
            "author": "Kurtpackage",
            "id": "fzk7g83",
            "parent_id": "t1_fzk5bp7",
            "score": 1,
            "created_utc": 1595975469.0,
            "replies": []
        },
        {
            "body": "Ohhh. That’s nice 😊 I’m sure you two will be appreciated in this sugar-drought period.",
            "author": "BeautyGr8ce",
            "id": "fzgucqf",
            "parent_id": "t1_fzgu18j",
            "score": 1,
            "created_utc": 1595899427.0,
            "replies": []
        }
    ]
}