{
    "title": "Got called an esc0rt who uses men for money by a SD",
    "post_id": "ru6eeu",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/ru6eeu/got_called_an_esc0rt_who_uses_men_for_money_by_a/",
    "author": "sxella206",
    "body": "I was using SA and found a man who called men who are SD “old lonely men who can’t find a girlfriend, so they pay women to like them”. \n\nHe then said “women love believing they aren’t esc0rts because the money they receive is for tuition or because the payment is monthly😂”\n“Women pretend that their SD is their casual boyfriend who spoils them when they’re just using an old man for money, so no I will not be giving you gifts nor money. I just need a submissive woman who enjoys fine dining and is fun to be with”\n\nRude, misogynistic and arrogant. There’s Tindr for a reason why come on SA to put down fellow SD and SB? Sounds like a narcissist who came here to trigger people(it did work). He’s a diamond user btw and his description is “not your regular SD”",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/ru6eeu/got_called_an_esc0rt_who_uses_men_for_money_by_a/",
    "score": 123,
    "upvote_ratio": 0.92,
    "created_utc": 1641116588.0,
    "num_comments": 92,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "Those guys don’t bother me at all it’s clearly projection like why are you on here bud? Also, I am an SB but I have no issue saying I have sex for money because I do know without that neither one of us would be there. I’m not calling you anything just saying none of what he said would bother me he sounds like a complete loser. Just feel sorry for these people they obviously have no life at all to spend money and time doing that.",
            "author": "atlbabie",
            "id": "hqxosvt",
            "parent_id": "t3_ru6eeu",
            "score": 19,
            "created_utc": 1641132868.0,
            "replies": []
        },
        {
            "body": "And that's exactly why he needs to be Diamond, and why Diamond means 'red flag: Something's off'! \n\nIn this case a wannabee 'Dom', getting off on degrading women and having found his perfect disguise for that.",
            "author": "A-touchofreality",
            "id": "hqx4rb7",
            "parent_id": "t3_ru6eeu",
            "score": 47,
            "created_utc": 1641118303.0,
            "replies": [
                {
                    "body": "Wait it’s a red flag? I thought it was a good thing if someone’s a diamond because it means they’re serious/not a scammer and I heard it’s not cheap to become one.",
                    "author": "sxella206",
                    "id": "hqx4v0u",
                    "parent_id": "t1_hqx4rb7",
                    "score": 16,
                    "created_utc": 1641118387.0,
                    "replies": [
                        {
                            "body": "Just means they paid more. Premium is $90/30 days, Diamond is $250/30 days.\n\nThinking about it now, I guess this guy probably figures if he gets out of paying even one PPM he's ahead of the game for his extra $150/month.",
                            "author": null,
                            "id": "hqxoiwq",
                            "parent_id": "t1_hqx4v0u",
                            "score": 19,
                            "created_utc": 1641132712.0,
                            "replies": [
                                {
                                    "body": "They are willing to pay $160 per month additional  to look more prosperous.  That's a great investment for those wanting to defraud SB's  or abuse SB's ,  especially those with limited experience.",
                                    "author": "pinotandsugar",
                                    "id": "hr04hkt",
                                    "parent_id": "t1_hqxoiwq",
                                    "score": 8,
                                    "created_utc": 1641167679.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": ">Wait it’s a red flag? I thought it was a good thing if someone’s a diamond because it means they’re serious/not a scammer and I heard it’s not cheap to become one.\n\nI've heard lots of stories from SBs on here that many bad actors are \"diamond\" in part to try to \"prove\" they are serious with diamond status.",
                            "author": "BinghamtonSD",
                            "id": "hqz2rgg",
                            "parent_id": "t1_hqx4v0u",
                            "score": 5,
                            "created_utc": 1641153134.0,
                            "replies": []
                        },
                        {
                            "body": "Honestly… that’s what I thought too 😥",
                            "author": "JCourageous",
                            "id": "hqx6zug",
                            "parent_id": "t1_hqx4v0u",
                            "score": 2,
                            "created_utc": 1641120166.0,
                            "replies": [
                                {
                                    "body": "Ok, let me ask you some questions:\n\n1. Why on earth would a SD, on a site where the ratio is so much in his favour with 4 SBs for every SD, need to become a 'Diamond member?\n2. Why would a seriously wealthy man paint a red sign on his forehead and attract all kinds of unwanted attention, whereas usually very wealthy people prefer to stay under the radar just to avoid this kind of attention they encounter everyday in  daily life?\n3. What's investing $250 for a scammers syndicate that operates 24/7 with a team of 'operators' from Nigeria, to get in contact with a lot of naive and money hungry girls to scam? That's an easy ROI!\n\nIf a SD needs to become a Diamond member somethings off, and usually it's one of the answers on the above questions.",
                                    "author": "A-touchofreality",
                                    "id": "hqxa2a2",
                                    "parent_id": "t1_hqx6zug",
                                    "score": 29,
                                    "created_utc": 1641122718.0,
                                    "replies": [
                                        {
                                            "body": "This makes so much sense. I thought if someone is going to be diamond it’s to prove that they aren’t going to scam, but are serious about SA. I thought they were more of the safer option since I’ve had too many scammers bother me. Thank you!",
                                            "author": "sxella206",
                                            "id": "hqxgd7p",
                                            "parent_id": "t1_hqxa2a2",
                                            "score": 10,
                                            "created_utc": 1641127597.0,
                                            "replies": [
                                                {
                                                    "body": "Someone who is ready to roll into a platonic meet and greet is really the only way to cut through the majority of the scammers",
                                                    "author": "YakiMe",
                                                    "id": "hqxhcb1",
                                                    "parent_id": "t1_hqxgd7p",
                                                    "score": 7,
                                                    "created_utc": 1641128289.0,
                                                    "replies": []
                                                },
                                                {
                                                    "body": "Same for me.. very awkward conversation with someone who left a very bitter aftertaste who was also diamond. I thought it was a good thing but reading this here makes total sense.",
                                                    "author": "mymelancholybaby279",
                                                    "id": "hqxsr70",
                                                    "parent_id": "t1_hqxgd7p",
                                                    "score": 1,
                                                    "created_utc": 1641134929.0,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "body": "100% not my experience. I was on SA for a couple of months, weeding out scammers and sending umpteen messages to women I was interested in. Tons of work. I was going to either leave the platform or upgrade to Diamond for one month as a Hail Mary. \n\nInstantly, I received messages from higher-caliber, legitimate SB potentials. I received fewer scam messages, too. I had three M&G’s in two weeks and my only problem was selecting the best possible fit out of three great women.\n\nI only have my own anecdotal evidence to suggest this, but I think there’s a different algorithm/rule-set for diamond members. \n\nIf this is true, it’s annoying AF because prior to Diamond I was paying an already hefty fee for premium and not receiving the value I (and others) deserve. \n\nTo answer “A-touchofreality”… \n\n1. If you factor in scammers, escorts, non-active users, and people outside of your filters it’s not a 4:1 ratio. Not even close.\n\n2. I’m “seriously wealthy” and have a blurred picture, which I share with people I vet.\n\n3. $250 is a lot given how many scammer accounts get shut down.",
                                            "author": "LordWildmore",
                                            "id": "hqy7tzh",
                                            "parent_id": "t1_hqxa2a2",
                                            "score": 9,
                                            "created_utc": 1641141601.0,
                                            "replies": [
                                                {
                                                    "body": ">I was paying an already hefty fee for premium  \n>  \n>$250 is a lot given how many scammer accounts get shut down.  \n>  \n>I’m “seriously wealthy” \n\nSir, with all due respect, seriously wealthy people don't talk about 'hefty fee's' when spending $90, or consider '$250 is a lot'.",
                                                    "author": "A-touchofreality",
                                                    "id": "hqzqpuk",
                                                    "parent_id": "t1_hqy7tzh",
                                                    "score": 7,
                                                    "created_utc": 1641162265.0,
                                                    "replies": [
                                                        {
                                                            "body": "I said, “a lot” in the context of a scammer’s bottom line. \n\nYou must not know any wealthy people or the ones you know inherited their money. I worked hard to build wealth and wasting money is for fools. I‘ll eat in the finest restaurants and drink expensive bourbon, but even if I was a billionaire I’d still shun waste and avoid companies trying to get over on me.",
                                                            "author": "LordWildmore",
                                                            "id": "hqzsrhs",
                                                            "parent_id": "t1_hqzqpuk",
                                                            "score": 4,
                                                            "created_utc": 1641163056.0,
                                                            "replies": [
                                                                {
                                                                    "body": "*> You must not know any wealthy people or the ones you know inherited their money.*\n\nNice *ASS*umption, but this comment only confirms my previous statement about your 'serious wealth'.",
                                                                    "author": "A-touchofreality",
                                                                    "id": "hr8dvve",
                                                                    "parent_id": "t1_hqzsrhs",
                                                                    "score": 1,
                                                                    "created_utc": 1641315251.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "body": "Really interesting discussion... I had weighed diamond when I first started, because I thought it would weed out spam and save time, but I just turned my profile to private and instead messaged POTs directly as many here suggested, and I had pretty good success, and never felt like I needed diamond. Though I wonder if our experiences are different because NYC is apparently SB mecca, so the ratio is actually that favorable.",
                                                    "author": "noobNYCsd",
                                                    "id": "hqyd98g",
                                                    "parent_id": "t1_hqy7tzh",
                                                    "score": 2,
                                                    "created_utc": 1641143717.0,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "body": "I know someone who’s worth 6bil on there and he’s a diamond member. I believe you have to show your proof of income and your ssn. Ive only had one bad experience with a diamond member who stood me up on a date, but also turns out my friend was stood up by the same man. Serial stander-upper. Besides that many of the men I met on there who are diamond members are very sexy, respectful and sexually positive.",
                                            "author": "Prophetess111",
                                            "id": "hqy9u55",
                                            "parent_id": "t1_hqxa2a2",
                                            "score": 4,
                                            "created_utc": 1641142393.0,
                                            "replies": [
                                                {
                                                    "body": "> I believe you have to show your proof of income and your ssn.\n\nAnd you seriously think someone who owns 6bil is going to give proof of income and SSN to a site such as SA?! \n\nROFLAO.",
                                                    "author": "A-touchofreality",
                                                    "id": "hqzpnoe",
                                                    "parent_id": "t1_hqy9u55",
                                                    "score": 3,
                                                    "created_utc": 1641161852.0,
                                                    "replies": [
                                                        {
                                                            "body": "I’m confused as to what you mean but he’s very prominent and famously rich so it’s not a big deal to him to show his income.",
                                                            "author": "Prophetess111",
                                                            "id": "i024jr3",
                                                            "parent_id": "t1_hqzpnoe",
                                                            "score": 1,
                                                            "created_utc": 1646880483.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Sure, perfectly normal for 'very prominent and famously rich people' to show a site such as SA a their income! That is, if SA indeed would be so stupid as to ask for it, which of course they don't. LOL, you obviously have no clue how seriously rich people think and act.\n\nSo go after them 'rich and verified' Diamond members tiger!\n\n(Don't forget to read the scam sticky first though! Because you sound utterly naif)",
                                                                    "author": "A-touchofreality",
                                                                    "id": "i0343rr",
                                                                    "parent_id": "t1_i024jr3",
                                                                    "score": 1,
                                                                    "created_utc": 1646902536.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "body": "It’s says “more than 100 Million” on his Diamond profile",
                                                            "author": "Prophetess111",
                                                            "id": "i024m4x",
                                                            "parent_id": "t1_hqzpnoe",
                                                            "score": 1,
                                                            "created_utc": 1646880514.0,
                                                            "replies": [
                                                                {
                                                                    "body": "It could also say he has a green coloured shine-in-the-dark dick on his Diamond profile. \n\nBut dream on!",
                                                                    "author": "A-touchofreality",
                                                                    "id": "i033mkl",
                                                                    "parent_id": "t1_i024m4x",
                                                                    "score": 1,
                                                                    "created_utc": 1646902128.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "body": "And here I was, thinking that I was a cheapskate for having premium membership! Never had trouble finding a SB with premium though so you are right about that.",
                                            "author": "chemistryromance",
                                            "id": "hqzazpf",
                                            "parent_id": "t1_hqxa2a2",
                                            "score": 2,
                                            "created_utc": 1641156104.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "This!",
                                            "author": "purpleyogi",
                                            "id": "hqy2hi1",
                                            "parent_id": "t1_hqxa2a2",
                                            "score": 1,
                                            "created_utc": 1641139402.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "I never knew this before, so thank you for this advice!! Always thought “diamond” was a positive sign.",
                                            "author": "Myrtle_Snow333",
                                            "id": "hqyramn",
                                            "parent_id": "t1_hqxa2a2",
                                            "score": 1,
                                            "created_utc": 1641148948.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": ">Diamond means 'red flag: Something's off'!\n\nNot in all cases. My whale of a SD was a diamond when we started chatting. He's spoilt me more than any other SD and he truely, absolutely is a gentleman. Truely I mean that in the most utmost of ways.... I was swept off my feet through conversation & the stimulation + the giving... my love language is gifting - big, small tokens that show appreciation... he always one ups things. He always gives me plenty of space and he gets rather happy when I of my free decision do things for him.. baking, wearing something ik he's seen on his TV crush lol - etc ☺\n\nThe only \"off\" is hes terminal, unknown of whether hes got a year, months, few years. Its a mystery. We wish we had met earlier and he had looked into sugar the past few years also... never dived though :)",
                    "author": "WorldwideLoving",
                    "id": "hqyhuff",
                    "parent_id": "t1_hqx4rb7",
                    "score": 6,
                    "created_utc": 1641145457.0,
                    "replies": []
                },
                {
                    "body": "He is demeaning SDs too. He is an equal opportunity demeaner.",
                    "author": "Monte_Sailor",
                    "id": "hqyuz4d",
                    "parent_id": "t1_hqx4rb7",
                    "score": 2,
                    "created_utc": 1641150277.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I’ve had a VERY similar interaction before (wonder if it’s the same guy 🤪). \nThe interaction honestly hurt my feelings and really messed with my head—that being said: don’t let the bastards get you down. He likes negging women and wants a free relationship experience that’s entirely on his own terms. \nHe sucks",
            "author": "c0rnstarr",
            "id": "hqxqkrb",
            "parent_id": "t3_ru6eeu",
            "score": 10,
            "created_utc": 1641133825.0,
            "replies": [
                {
                    "body": "I didn’t get offended personally just offended that he feels the need to pay for a membership come on a SA site to put down the majority of those who use it. “If that makes me an escort so what, you’re the one using your money to attract women because you can’t get none” should have been my response but I reported instead lol",
                    "author": "sxella206",
                    "id": "hr0zh3k",
                    "parent_id": "t1_hqxqkrb",
                    "score": 1,
                    "created_utc": 1641180652.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "hqx3emz",
            "parent_id": "t3_ru6eeu",
            "score": 17,
            "created_utc": 1641117172.0,
            "replies": [
                {
                    "body": "Maybe I have a different understanding than others, but I personally like to causally date older men, so I do enjoy the sex part and getting spoiled is a bonus out of it. I don’t see that as being an escort, but if that makes me one, I don’t mind. What I do mind is his level of arrogance and how he felt the need to not only insult everyone on the site, but make himself seem better than other SD.",
                    "author": "sxella206",
                    "id": "hqx3rs3",
                    "parent_id": "t1_hqx3emz",
                    "score": 10,
                    "created_utc": 1641117481.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "hqxcupm",
                            "parent_id": "t1_hqx3rs3",
                            "score": 3,
                            "created_utc": 1641124969.0,
                            "replies": [
                                {
                                    "body": "I understand your point and I know there’s gonna be pay for sex women on there. What bothered me was how condescending he was, he could have put it in better terms, while not putting down others. Also the fact that he paid a pricy membership on SA when Tindr and bumble would have been a better match for him. He also bragged about how much money he made and how successful he was, it’s obvious he will get women who want his money.",
                                    "author": "sxella206",
                                    "id": "hqxg0ha",
                                    "parent_id": "t1_hqxcupm",
                                    "score": 5,
                                    "created_utc": 1641127340.0,
                                    "replies": [
                                        {
                                            "body": "To be honest he sounds like one of those Narcissistic sociopaths that end up on being a person of interest for a first 48 or unsolved crime documentary .  I’d stay away gives me the chills just reading the conversation.  Men that view women that way don’t usually treat them well.",
                                            "author": "Tequila-porfavor",
                                            "id": "hqxv026",
                                            "parent_id": "t1_hqxg0ha",
                                            "score": 4,
                                            "created_utc": 1641136030.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "[deleted]",
                                            "author": null,
                                            "id": "hqxhy6h",
                                            "parent_id": "t1_hqxg0ha",
                                            "score": 1,
                                            "created_utc": 1641128705.0,
                                            "replies": [
                                                {
                                                    "body": "Agreeing but extending, the fact that SR exist at all  speaks to the differentiation from escort work. While it is certainly true that one is a value proxy for the other, it absolutely not the same. The difference in quality of relationship between SB and an escort is huge, in my experience. And it is this quality of relationship I am investing in, the sex is a byproduct of the affection. I choose to invest in this because the SB is lending their prime years and should be compensated. Escorts are still relevant at appropriate times.",
                                                    "author": "Ill_Ad_3573",
                                                    "id": "hqxw613",
                                                    "parent_id": "t1_hqxhy6h",
                                                    "score": 3,
                                                    "created_utc": 1641136593.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "Yup, you are agreeing with his misogynist, hateful crap. You do not get to decide what a woman is, anymore than he does. So just stop it. Plus your definition of what an escort is and does, like his, is simply \"not please me as I wish to be pleased.\" While I see how that serves you, it has very little basis in reality.",
                                    "author": "ziggy440",
                                    "id": "hr10vdj",
                                    "parent_id": "t1_hqxcupm",
                                    "score": 2,
                                    "created_utc": 1641181274.0,
                                    "replies": [
                                        {
                                            "body": "[deleted]",
                                            "author": null,
                                            "id": "hr2bi6u",
                                            "parent_id": "t1_hr10vdj",
                                            "score": 0,
                                            "created_utc": 1641211714.0,
                                            "replies": [
                                                {
                                                    "body": "You are the one declaring whether a woman is an escort or not based on your, sole judgment. Period. And you encourage and enable others, including the manipulative asshole the OP met, to do the same. You should stop doing that because it's wrong, and because it perpetuates a male view of women as good or bad based on male judgment of them. I don't expect you to understand that, but please try.\n\nWhat you probably mean when you say SB, I'm guessing, is that you prefer a GFE SB and you recognize one based on how she makes you feel. That's fine. But that does not mean someone who does not do what you like, make you feel how you like to feel, does not belong in the bowl or isn't a good SB. Despite your sense of entitlement.\n\nAs for what I am - I'm no one to you because I don't give you the feeling you want and that you feel your deserve. And I guess I don't belong in the bowl either because I believe it can be whatever people want it to be, from platonic to just hook ups, so long as everyone plays nice and is as honest as they can be about what they seek. And you, my friend do not belong in my bowl, because with your judgments you are not playing nice.\n\nHere's hoping some of this sinks in.",
                                                    "author": "ziggy440",
                                                    "id": "hr2u3gg",
                                                    "parent_id": "t1_hr2bi6u",
                                                    "score": 2,
                                                    "created_utc": 1641221841.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Preach!",
                    "author": "YakiMe",
                    "id": "hqxh4d0",
                    "parent_id": "t1_hqx3emz",
                    "score": 1,
                    "created_utc": 1641128133.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "When the would-be client doesn't get the merchandise because he won't pay for it, he likes to shame the merchandise. \"I didn't want that anyway\". \"I'm too good for that.\"\n\nWhat he didn't seem to understand is that you're not merchandise, nor an escort. \n\nYou have to try to ignore these people. They are part of a broader negging culture.\n\nAlso, \"Diamond\" members are more like CZ. I thought everyone knew this?",
            "author": "marker3000",
            "id": "hqxfzie",
            "parent_id": "t3_ru6eeu",
            "score": 15,
            "created_utc": 1641127318.0,
            "replies": [
                {
                    "body": "Not everyone will know this information about diamond members as there are new people to the bowl always. Including me. People don’t start out knowing the ins and outs or red flags but this is why this forum is so great.",
                    "author": "Intelligent_Signal86",
                    "id": "hqydypu",
                    "parent_id": "t1_hqxfzie",
                    "score": 5,
                    "created_utc": 1641143980.0,
                    "replies": []
                },
                {
                    "body": "I’m still new to these sites, I thought I studied a lot but looks like I need to study about this more. Also what does CZ mean?",
                    "author": "sxella206",
                    "id": "hqxhb8t",
                    "parent_id": "t1_hqxfzie",
                    "score": 3,
                    "created_utc": 1641128268.0,
                    "replies": [
                        {
                            "body": "CZ = cubic zirconia “lab-created diamond also known as fake diamond”",
                            "author": null,
                            "id": "hqxvsor",
                            "parent_id": "t1_hqxhb8t",
                            "score": 5,
                            "created_utc": 1641136413.0,
                            "replies": [
                                {
                                    "body": "Totally agree with this one. What should be remembered is that some SD's take work practices into this grey area.",
                                    "author": "Coastal_Bull",
                                    "id": "hqy0iif",
                                    "parent_id": "t1_hqxvsor",
                                    "score": 1,
                                    "created_utc": 1641138554.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "He wasn't lying when he said 'Not your regular SD'!",
            "author": "chemistryromance",
            "id": "hqx5evz",
            "parent_id": "t3_ru6eeu",
            "score": 7,
            "created_utc": 1641118845.0,
            "replies": []
        },
        {
            "body": ">Rude, misogynistic and arrogant.\n\nMay I add ignorant and condescending to your list? Somehow he thinks that sharing these particular views of his will make him more attractive to POT SBs? I must be doing it wrong.",
            "author": null,
            "id": "hqxhf5o",
            "parent_id": "t3_ru6eeu",
            "score": 6,
            "created_utc": 1641128345.0,
            "replies": [
                {
                    "body": "Him going off on other SD really showed his personality because SD did nothing to him but he still felt the need to put them down. His whole “I’m not like other guys” translates to “I’m not like other guys I’m worse”",
                    "author": "sxella206",
                    "id": "hqxhr7g",
                    "parent_id": "t1_hqxhf5o",
                    "score": 5,
                    "created_utc": 1641128576.0,
                    "replies": [
                        {
                            "body": "In my experience this is always the young (still too old for you too vanilla date) attractive (average at best, and way below what you'd date vanilla) ones. They fail to realize that women can compartmentalize... we can have fun open minded partnerships with men our age all while sugar dating men that can add monetary value and wisdom to our lives. We don't need weird in-between things with \"younger\" closed minded jerk SDs who add no value to our lives.",
                            "author": "InterDevochka",
                            "id": "hqz1a98",
                            "parent_id": "t1_hqxhr7g",
                            "score": 3,
                            "created_utc": 1641152592.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "This is why I have a rule that I next rude profiles, even if what they are saying doesn't apply to me personally. He could have simply said that he doesn't want an arrangement and is looking for a regular relationship, but he went out his way to be mean. He's on the wrong site for that anyway",
            "author": null,
            "id": "hqx6mnh",
            "parent_id": "t3_ru6eeu",
            "score": 9,
            "created_utc": 1641119863.0,
            "replies": [
                {
                    "body": "Exactly. Why be with someone who's disrespectful to *anyone*, let alone you? I also take note of how people treat service staff, like servers in restaurants. There's no reason to be rude or condescending to anyone, and I don't want to be in the company of anyone who is.",
                    "author": null,
                    "id": "hqxh495",
                    "parent_id": "t1_hqx6mnh",
                    "score": 5,
                    "created_utc": 1641128131.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I had a very similar talk with a potential SD. He was just like the man you described. I mentioned in my profile what I like being spoiled. I was asked if I do escorting, and I said no. Then I was asked if I like receiving gifts. I said that all women love being spoiled when dating someone. I was called a money-sucking slut and that I should earn my own money because I have two hands hahaha",
            "author": "m4dw0r1d",
            "id": "hqxk6z1",
            "parent_id": "t3_ru6eeu",
            "score": 3,
            "created_utc": 1641130168.0,
            "replies": [
                {
                    "body": "Money sucking slut is my new band name",
                    "author": null,
                    "id": "hqxltd6",
                    "parent_id": "t1_hqxk6z1",
                    "score": 7,
                    "created_utc": 1641131153.0,
                    "replies": [
                        {
                            "body": "Let’s establish a company of SBs called “Money-sucking Sluts & Co” lol",
                            "author": "m4dw0r1d",
                            "id": "hqxqa6s",
                            "parent_id": "t1_hqxltd6",
                            "score": 5,
                            "created_utc": 1641133672.0,
                            "replies": [
                                {
                                    "body": "Money-sucking sluts is my new cam name lmao.",
                                    "author": "Head-Sail-9856",
                                    "id": "hqyuspq",
                                    "parent_id": "t1_hqxqa6s",
                                    "score": 2,
                                    "created_utc": 1641150212.0,
                                    "replies": [
                                        {
                                            "body": "I’m so happy to inspire you, gals hahaha",
                                            "author": "m4dw0r1d",
                                            "id": "hqyxwjw",
                                            "parent_id": "t1_hqyuspq",
                                            "score": 2,
                                            "created_utc": 1641151338.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Yet he’s on the site 😂 he took all the time to create a profile. That’s hilarious!",
                    "author": "Intelligent_Signal86",
                    "id": "hqyeb6p",
                    "parent_id": "t1_hqxk6z1",
                    "score": 2,
                    "created_utc": 1641144113.0,
                    "replies": [
                        {
                            "body": "Yeah… Meawhile he wrote “Get ready to be spoiled” in his profile. I called him a hypocrite hahahah",
                            "author": "m4dw0r1d",
                            "id": "hqynhee",
                            "parent_id": "t1_hqyeb6p",
                            "score": 2,
                            "created_utc": 1641147580.0,
                            "replies": [
                                {
                                    "body": "HAHA the nerve!",
                                    "author": "Intelligent_Signal86",
                                    "id": "hrbfq3x",
                                    "parent_id": "t1_hqynhee",
                                    "score": 1,
                                    "created_utc": 1641360156.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "I saw a profile that said “if you call yourself a princess or spoilt then move along and don’t waste my time”. Being on a SA site and bragging about money will attract women who like money. Delusional really, they love to be victims.",
                    "author": "sxella206",
                    "id": "hqzft4n",
                    "parent_id": "t1_hqxk6z1",
                    "score": 2,
                    "created_utc": 1641157808.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "alot of chads are getting mad that alot of young women are moving to the p4p model instead of giving it away on tinder. these toolbags still think they're in college or highschool and are getting a dose of reality",
            "author": "vtec__",
            "id": "hqye4h6",
            "parent_id": "t3_ru6eeu",
            "score": 3,
            "created_utc": 1641144042.0,
            "replies": []
        },
        {
            "body": "While I agree that there isnt a huge difference between a SB and a pro (usually) his comments are rude and deserves an F off. Prick.",
            "author": "Feisty_Pear8536",
            "id": "hr1dkab",
            "parent_id": "t3_ru6eeu",
            "score": 3,
            "created_utc": 1641187450.0,
            "replies": []
        },
        {
            "body": "Sounds like a troll and a douchebag.. 🙄🙄",
            "author": "420Beautiful",
            "id": "hqxecqv",
            "parent_id": "t3_ru6eeu",
            "score": 2,
            "created_utc": 1641126116.0,
            "replies": []
        },
        {
            "body": "This guy's game is to shame women and see which ones accept it. \n\nSadly it probably works, at least well enough for him to continue paying for Diamond status.",
            "author": null,
            "id": "hqxnxlq",
            "parent_id": "t3_ru6eeu",
            "score": 2,
            "created_utc": 1641132376.0,
            "replies": []
        },
        {
            "body": "Fuck ‘em (or you know, don’t 😂)",
            "author": "NorthernGirlHere",
            "id": "hr0x744",
            "parent_id": "t3_ru6eeu",
            "score": 2,
            "created_utc": 1641179647.0,
            "replies": [
                {
                    "body": "This made me laugh😂😂😂",
                    "author": "sxella206",
                    "id": "hr10omr",
                    "parent_id": "t1_hr0x744",
                    "score": 1,
                    "created_utc": 1641181189.0,
                    "replies": [
                        {
                            "body": "😏😂",
                            "author": "NorthernGirlHere",
                            "id": "hr124d7",
                            "parent_id": "t1_hr10omr",
                            "score": 1,
                            "created_utc": 1641181831.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "These so called \"doms\", always seem to be soft men. I don't get it",
            "author": "saltgrindr",
            "id": "hqx6gbj",
            "parent_id": "t3_ru6eeu",
            "score": 4,
            "created_utc": 1641119720.0,
            "replies": [
                {
                    "body": "I call them the McDomly doms ..they've watched 50 Shades and suddenly think they're Dominant. It's like someone thinking they're a Witch because they've watched Harry Potter. 🤣",
                    "author": "LadyMorgan2018",
                    "id": "hqy9ffp",
                    "parent_id": "t1_hqx6gbj",
                    "score": 4,
                    "created_utc": 1641142233.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Because he thinks negging will work on SA. Report him on the platform. That's not at all the spirit of of arrangements that parties are seeking on SA, and that issue needs to be nipped in the bud before it spreads like cancer.",
            "author": "SephoraRothschild",
            "id": "hqy3jwm",
            "parent_id": "t3_ru6eeu",
            "score": 3,
            "created_utc": 1641139841.0,
            "replies": []
        },
        {
            "body": "He’s a D*ICK! Ignore him & don’t let it get to you. Block.",
            "author": "sasssysash",
            "id": "hqx32gb",
            "parent_id": "t3_ru6eeu",
            "score": 2,
            "created_utc": 1641116897.0,
            "replies": [
                {
                    "body": "I reported him for sure",
                    "author": "sxella206",
                    "id": "hqx3ulm",
                    "parent_id": "t1_hqx32gb",
                    "score": 3,
                    "created_utc": 1641117547.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Im active in the kink world and in most sub/dom relationships the sub has waaayyy more power. Ie, the dom is only in charge because the sub said so. Yeah subs might get off on serving, pleasing, being punished etc. but they hold the power of “no” in a way doms just don’t. Also, *all* good doms put a great deal of effort into knowing, nurturing, and protecting a sub. No good dom would jump straight to humiliation language the way this guy did unless some sort of consent or discussion was had prior.\n\nThis guy isn’t looking for a sub. He’s looking for someone who doesn’t know their value and is easy to abuse and use.",
            "author": "airroe",
            "id": "hqyprky",
            "parent_id": "t3_ru6eeu",
            "score": 2,
            "created_utc": 1641148402.0,
            "replies": [
                {
                    "body": "That’s exactly what I thought. A sub and dom relationship seems abusive to others but it’s consensual and we both have to care for one another despite what we’re doing. I don’t think he was into the sub/dom part he just wanted someone to put up with his shit",
                    "author": "sxella206",
                    "id": "hr0zxc0",
                    "parent_id": "t1_hqyprky",
                    "score": 2,
                    "created_utc": 1641180853.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Someone on the internet said something mean to you... Poor Sugar Baby.... \n\nI'll make it all better, what kinda monthly allowance are we talking...?",
            "author": "princelydeeds",
            "id": "hqxxgpn",
            "parent_id": "t3_ru6eeu",
            "score": -2,
            "created_utc": 1641137197.0,
            "replies": []
        },
        {
            "body": "What a dickheead",
            "author": "ready4anytng",
            "id": "hqx3nt5",
            "parent_id": "t3_ru6eeu",
            "score": 1,
            "created_utc": 1641117389.0,
            "replies": []
        },
        {
            "body": "He sure was an ass... now, of if you think about it, are really honest about what this is and put nicer words on it... and I know everyone, including me will say 'no it isn't the case for me or my SB/SD'... he was not all that wrong 🤷🏼‍♂️😊",
            "author": "PThrowAwaySoon",
            "id": "hqygn8w",
            "parent_id": "t3_ru6eeu",
            "score": 1,
            "created_utc": 1641144992.0,
            "replies": [
                {
                    "body": "The thing is he was putting the demographic who use the site down. What’s the point of throwing your money onto diamond if you’re cheap and technically hate the users on the site. He was bragging about how successful he is and all his businesses then gets upset he attracts women who want money. Sounds like money is all he offers",
                    "author": "sxella206",
                    "id": "hqzga8u",
                    "parent_id": "t1_hqygn8w",
                    "score": 1,
                    "created_utc": 1641157976.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Narcissism is at an all-time high in society overall (for various reasons), and so there is more toxic trash than ever in the sugar world (both SD's and SB's). It's noticeably more toxic than it was ten years ago, and unfortunately you saw an example of that.\n\nSo as always when dealing with narcs: do not engage, and do not feed their trolling and manipulation. You've got to have that keyboard trigger-finger ready, and block those toxic people as quickly as possible. The toxicity comes from all directions these days:  SA, Facebook, reddit (including this forum), Twitter, etc. \n\nAnd dealing with narcs on a consistent basis is not good for mental health (I learned this over the last few years, as I made great improvements in my own mental health). So in the interest of self-protection, you almost have to assume that everyone is a toxic narc, and only change that assumption after they have proven otherwise.",
            "author": "Nomad_Bill",
            "id": "hqyh3wf",
            "parent_id": "t3_ru6eeu",
            "score": 1,
            "created_utc": 1641145172.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "hqzql4s",
                    "parent_id": "t1_hqyh3wf",
                    "score": 2,
                    "created_utc": 1641162214.0,
                    "replies": [
                        {
                            "body": "Well said!.... Yes, I use the gray rock method often.\n\nAnd yes, I had trauma from dealing with past family narcs. It took awhile to figure out, and fix later on.",
                            "author": "Nomad_Bill",
                            "id": "hqzrm4m",
                            "parent_id": "t1_hqzql4s",
                            "score": 1,
                            "created_utc": 1641162617.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "He is not your SD, nor a SD. \n\nProbably just a dusty trying to shame woman and preying on the woman who will accept to fuck him for free to prove they aren't escort",
            "author": "WiseRequirement9277",
            "id": "hqyibgs",
            "parent_id": "t3_ru6eeu",
            "score": 1,
            "created_utc": 1641145638.0,
            "replies": []
        },
        {
            "body": "\"\"\"I just need a submissive woman who enjoys fine dining and is fun to be with”\"\"\n\nHis way of bargaining for an SB who will expect less and give more. \n\nRegardless of how he integrates it into his wording,  the self proclaimed SD who weaves \"escort\" into the early conversation is unlikely to work out well for the traditional SB",
            "author": "pinotandsugar",
            "id": "hqyn450",
            "parent_id": "t3_ru6eeu",
            "score": 1,
            "created_utc": 1641147443.0,
            "replies": []
        },
        {
            "body": "i just think the guy's been hurt too many times over trusting women and his experiences led him to hate instead",
            "author": "therewasguy",
            "id": "hqyomsw",
            "parent_id": "t3_ru6eeu",
            "score": 1,
            "created_utc": 1641147997.0,
            "replies": []
        },
        {
            "body": "He's definitely not normal.",
            "author": "GACyberCool",
            "id": "hqz0h6s",
            "parent_id": "t3_ru6eeu",
            "score": 1,
            "created_utc": 1641152292.0,
            "replies": []
        },
        {
            "body": "Recently met a potential SD on the site and he said he is generous but doesn't want any negotiations or a pay for play. Should I give this guy a chance?",
            "author": "shygirl-123",
            "id": "hqztrvi",
            "parent_id": "t3_ru6eeu",
            "score": 1,
            "created_utc": 1641163449.0,
            "replies": [
                {
                    "body": "You should ask that question on your own post so people who’ve been in this game for a while can help you, since I’m still new and I don’t want to give you advice that can ruin your experience. Or you can comment this on the thread “A-touchofreality” created under my post since she’s giving out advice and so are other SD and SB. Good luck?",
                    "author": "sxella206",
                    "id": "hr10hac",
                    "parent_id": "t1_hqztrvi",
                    "score": 2,
                    "created_utc": 1641181098.0,
                    "replies": [
                        {
                            "body": "I'll do that. Thanks",
                            "author": "shygirl-123",
                            "id": "hr10vlk",
                            "parent_id": "t1_hr10hac",
                            "score": 1,
                            "created_utc": 1641181276.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "AND WHAT ABOUT IT !!! as u should bestie!",
            "author": "ethereallysmall",
            "id": "hr04951",
            "parent_id": "t3_ru6eeu",
            "score": 1,
            "created_utc": 1641167584.0,
            "replies": []
        },
        {
            "body": "NLOG 🤢🤢🤢🤢",
            "author": "hugbugification",
            "id": "hr05c9n",
            "parent_id": "t3_ru6eeu",
            "score": 1,
            "created_utc": 1641168025.0,
            "replies": []
        },
        {
            "body": "I had a similar man like that like he said that he wasn’t a sd and almost insult all the women in this platform like… why are you here then go to tinder and cie",
            "author": "maigrinini",
            "id": "hr090ku",
            "parent_id": "t3_ru6eeu",
            "score": 1,
            "created_utc": 1641169519.0,
            "replies": [
                {
                    "body": "Probably because money is the only thing that’s good about him and “gold diggers” “escorts” will chase him and he’ll try to find the ones who are softer and can fall for his trap. Since his tinder is probably dead😂",
                    "author": "sxella206",
                    "id": "hr10mii",
                    "parent_id": "t1_hr090ku",
                    "score": 2,
                    "created_utc": 1641181163.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "He's just trying to eliminate the competition...and suggest that you needn't ask him for money.\n\nBasically someone broke...trying to make a virtue out of his inability to pay.\n\nYour answer in these situations could be along the lines of: \"But ugly guys like you have the same difficulty finding a girlfriend too.\" Or you can just next and block.",
            "author": "Mangotingthroneway",
            "id": "hr0vnnw",
            "parent_id": "t3_ru6eeu",
            "score": 1,
            "created_utc": 1641178977.0,
            "replies": []
        },
        {
            "body": "what a Pathetic Loser 🤣🤣",
            "author": "TlMEGH0ST",
            "id": "hr0z0el",
            "parent_id": "t3_ru6eeu",
            "score": 1,
            "created_utc": 1641180448.0,
            "replies": []
        },
        {
            "body": "I'd send him ROFL emojis and block him",
            "author": "CordeliaBeta",
            "id": "hr20fnp",
            "parent_id": "t3_ru6eeu",
            "score": 1,
            "created_utc": 1641203299.0,
            "replies": []
        },
        {
            "body": "Typical non SD who can't get a date even on Tinder.",
            "author": "GSSD",
            "id": "hr2s11m",
            "parent_id": "t3_ru6eeu",
            "score": 1,
            "created_utc": 1641220885.0,
            "replies": []
        },
        {
            "body": "Okay, so when you say someone is acting like an escort, it's not you saying she is acting like an escort, it's just you stating facts. That seems like a weird way to deny responsibility for your words and opinions. And if I say your are exhibiting toxic, sexist behavior it's not me saying it, it's just a fact. Does that work for you, or is your opinion a fact and mine just an argumentative opinion?\n\nI am not going to get into an argument with you about what the difference is between an escort and a SB, because as I said at the start, you and I do not have the right to decide that.\n\nHow would you describe what you consider a SB if not someone who acts like she is your GF? And why is it okay for you to call SBs who don't do that for you escorts, but it's objectionable for me to call the kind of SB you, and I, prefer GFE?\n\nMy point here isn't complicated - you should not call people whose approach to sugar you don't like derogatory names and try to marginalize them. Just stop, please. Their approach is as valid as yours and if they consider it sugar, it's sugar. You don't get to decide what is and is not sugar, which are good girls and bad girls. If you don't like what they are doing just look elsewhere.",
            "author": "ziggy440",
            "id": "hr35ltq",
            "parent_id": "t3_ru6eeu",
            "score": 1,
            "created_utc": 1641226698.0,
            "replies": []
        },
        {
            "body": "Wait it’s a red flag? I thought it was a good thing if someone’s a diamond because it means they’re serious/not a scammer and I heard it’s not cheap to become one.",
            "author": "sxella206",
            "id": "hqx4v0u",
            "parent_id": "t1_hqx4rb7",
            "score": 16,
            "created_utc": 1641118387.0,
            "replies": [
                {
                    "body": "Just means they paid more. Premium is $90/30 days, Diamond is $250/30 days.\n\nThinking about it now, I guess this guy probably figures if he gets out of paying even one PPM he's ahead of the game for his extra $150/month.",
                    "author": null,
                    "id": "hqxoiwq",
                    "parent_id": "t1_hqx4v0u",
                    "score": 19,
                    "created_utc": 1641132712.0,
                    "replies": [
                        {
                            "body": "They are willing to pay $160 per month additional  to look more prosperous.  That's a great investment for those wanting to defraud SB's  or abuse SB's ,  especially those with limited experience.",
                            "author": "pinotandsugar",
                            "id": "hr04hkt",
                            "parent_id": "t1_hqxoiwq",
                            "score": 8,
                            "created_utc": 1641167679.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": ">Wait it’s a red flag? I thought it was a good thing if someone’s a diamond because it means they’re serious/not a scammer and I heard it’s not cheap to become one.\n\nI've heard lots of stories from SBs on here that many bad actors are \"diamond\" in part to try to \"prove\" they are serious with diamond status.",
                    "author": "BinghamtonSD",
                    "id": "hqz2rgg",
                    "parent_id": "t1_hqx4v0u",
                    "score": 5,
                    "created_utc": 1641153134.0,
                    "replies": []
                },
                {
                    "body": "Honestly… that’s what I thought too 😥",
                    "author": "JCourageous",
                    "id": "hqx6zug",
                    "parent_id": "t1_hqx4v0u",
                    "score": 2,
                    "created_utc": 1641120166.0,
                    "replies": [
                        {
                            "body": "Ok, let me ask you some questions:\n\n1. Why on earth would a SD, on a site where the ratio is so much in his favour with 4 SBs for every SD, need to become a 'Diamond member?\n2. Why would a seriously wealthy man paint a red sign on his forehead and attract all kinds of unwanted attention, whereas usually very wealthy people prefer to stay under the radar just to avoid this kind of attention they encounter everyday in  daily life?\n3. What's investing $250 for a scammers syndicate that operates 24/7 with a team of 'operators' from Nigeria, to get in contact with a lot of naive and money hungry girls to scam? That's an easy ROI!\n\nIf a SD needs to become a Diamond member somethings off, and usually it's one of the answers on the above questions.",
                            "author": "A-touchofreality",
                            "id": "hqxa2a2",
                            "parent_id": "t1_hqx6zug",
                            "score": 29,
                            "created_utc": 1641122718.0,
                            "replies": [
                                {
                                    "body": "This makes so much sense. I thought if someone is going to be diamond it’s to prove that they aren’t going to scam, but are serious about SA. I thought they were more of the safer option since I’ve had too many scammers bother me. Thank you!",
                                    "author": "sxella206",
                                    "id": "hqxgd7p",
                                    "parent_id": "t1_hqxa2a2",
                                    "score": 10,
                                    "created_utc": 1641127597.0,
                                    "replies": [
                                        {
                                            "body": "Someone who is ready to roll into a platonic meet and greet is really the only way to cut through the majority of the scammers",
                                            "author": "YakiMe",
                                            "id": "hqxhcb1",
                                            "parent_id": "t1_hqxgd7p",
                                            "score": 7,
                                            "created_utc": 1641128289.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "Same for me.. very awkward conversation with someone who left a very bitter aftertaste who was also diamond. I thought it was a good thing but reading this here makes total sense.",
                                            "author": "mymelancholybaby279",
                                            "id": "hqxsr70",
                                            "parent_id": "t1_hqxgd7p",
                                            "score": 1,
                                            "created_utc": 1641134929.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "100% not my experience. I was on SA for a couple of months, weeding out scammers and sending umpteen messages to women I was interested in. Tons of work. I was going to either leave the platform or upgrade to Diamond for one month as a Hail Mary. \n\nInstantly, I received messages from higher-caliber, legitimate SB potentials. I received fewer scam messages, too. I had three M&G’s in two weeks and my only problem was selecting the best possible fit out of three great women.\n\nI only have my own anecdotal evidence to suggest this, but I think there’s a different algorithm/rule-set for diamond members. \n\nIf this is true, it’s annoying AF because prior to Diamond I was paying an already hefty fee for premium and not receiving the value I (and others) deserve. \n\nTo answer “A-touchofreality”… \n\n1. If you factor in scammers, escorts, non-active users, and people outside of your filters it’s not a 4:1 ratio. Not even close.\n\n2. I’m “seriously wealthy” and have a blurred picture, which I share with people I vet.\n\n3. $250 is a lot given how many scammer accounts get shut down.",
                                    "author": "LordWildmore",
                                    "id": "hqy7tzh",
                                    "parent_id": "t1_hqxa2a2",
                                    "score": 9,
                                    "created_utc": 1641141601.0,
                                    "replies": [
                                        {
                                            "body": ">I was paying an already hefty fee for premium  \n>  \n>$250 is a lot given how many scammer accounts get shut down.  \n>  \n>I’m “seriously wealthy” \n\nSir, with all due respect, seriously wealthy people don't talk about 'hefty fee's' when spending $90, or consider '$250 is a lot'.",
                                            "author": "A-touchofreality",
                                            "id": "hqzqpuk",
                                            "parent_id": "t1_hqy7tzh",
                                            "score": 7,
                                            "created_utc": 1641162265.0,
                                            "replies": [
                                                {
                                                    "body": "I said, “a lot” in the context of a scammer’s bottom line. \n\nYou must not know any wealthy people or the ones you know inherited their money. I worked hard to build wealth and wasting money is for fools. I‘ll eat in the finest restaurants and drink expensive bourbon, but even if I was a billionaire I’d still shun waste and avoid companies trying to get over on me.",
                                                    "author": "LordWildmore",
                                                    "id": "hqzsrhs",
                                                    "parent_id": "t1_hqzqpuk",
                                                    "score": 4,
                                                    "created_utc": 1641163056.0,
                                                    "replies": [
                                                        {
                                                            "body": "*> You must not know any wealthy people or the ones you know inherited their money.*\n\nNice *ASS*umption, but this comment only confirms my previous statement about your 'serious wealth'.",
                                                            "author": "A-touchofreality",
                                                            "id": "hr8dvve",
                                                            "parent_id": "t1_hqzsrhs",
                                                            "score": 1,
                                                            "created_utc": 1641315251.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "body": "Really interesting discussion... I had weighed diamond when I first started, because I thought it would weed out spam and save time, but I just turned my profile to private and instead messaged POTs directly as many here suggested, and I had pretty good success, and never felt like I needed diamond. Though I wonder if our experiences are different because NYC is apparently SB mecca, so the ratio is actually that favorable.",
                                            "author": "noobNYCsd",
                                            "id": "hqyd98g",
                                            "parent_id": "t1_hqy7tzh",
                                            "score": 2,
                                            "created_utc": 1641143717.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "I know someone who’s worth 6bil on there and he’s a diamond member. I believe you have to show your proof of income and your ssn. Ive only had one bad experience with a diamond member who stood me up on a date, but also turns out my friend was stood up by the same man. Serial stander-upper. Besides that many of the men I met on there who are diamond members are very sexy, respectful and sexually positive.",
                                    "author": "Prophetess111",
                                    "id": "hqy9u55",
                                    "parent_id": "t1_hqxa2a2",
                                    "score": 4,
                                    "created_utc": 1641142393.0,
                                    "replies": [
                                        {
                                            "body": "> I believe you have to show your proof of income and your ssn.\n\nAnd you seriously think someone who owns 6bil is going to give proof of income and SSN to a site such as SA?! \n\nROFLAO.",
                                            "author": "A-touchofreality",
                                            "id": "hqzpnoe",
                                            "parent_id": "t1_hqy9u55",
                                            "score": 3,
                                            "created_utc": 1641161852.0,
                                            "replies": [
                                                {
                                                    "body": "I’m confused as to what you mean but he’s very prominent and famously rich so it’s not a big deal to him to show his income.",
                                                    "author": "Prophetess111",
                                                    "id": "i024jr3",
                                                    "parent_id": "t1_hqzpnoe",
                                                    "score": 1,
                                                    "created_utc": 1646880483.0,
                                                    "replies": [
                                                        {
                                                            "body": "Sure, perfectly normal for 'very prominent and famously rich people' to show a site such as SA a their income! That is, if SA indeed would be so stupid as to ask for it, which of course they don't. LOL, you obviously have no clue how seriously rich people think and act.\n\nSo go after them 'rich and verified' Diamond members tiger!\n\n(Don't forget to read the scam sticky first though! Because you sound utterly naif)",
                                                            "author": "A-touchofreality",
                                                            "id": "i0343rr",
                                                            "parent_id": "t1_i024jr3",
                                                            "score": 1,
                                                            "created_utc": 1646902536.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "body": "It’s says “more than 100 Million” on his Diamond profile",
                                                    "author": "Prophetess111",
                                                    "id": "i024m4x",
                                                    "parent_id": "t1_hqzpnoe",
                                                    "score": 1,
                                                    "created_utc": 1646880514.0,
                                                    "replies": [
                                                        {
                                                            "body": "It could also say he has a green coloured shine-in-the-dark dick on his Diamond profile. \n\nBut dream on!",
                                                            "author": "A-touchofreality",
                                                            "id": "i033mkl",
                                                            "parent_id": "t1_i024m4x",
                                                            "score": 1,
                                                            "created_utc": 1646902128.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "And here I was, thinking that I was a cheapskate for having premium membership! Never had trouble finding a SB with premium though so you are right about that.",
                                    "author": "chemistryromance",
                                    "id": "hqzazpf",
                                    "parent_id": "t1_hqxa2a2",
                                    "score": 2,
                                    "created_utc": 1641156104.0,
                                    "replies": []
                                },
                                {
                                    "body": "This!",
                                    "author": "purpleyogi",
                                    "id": "hqy2hi1",
                                    "parent_id": "t1_hqxa2a2",
                                    "score": 1,
                                    "created_utc": 1641139402.0,
                                    "replies": []
                                },
                                {
                                    "body": "I never knew this before, so thank you for this advice!! Always thought “diamond” was a positive sign.",
                                    "author": "Myrtle_Snow333",
                                    "id": "hqyramn",
                                    "parent_id": "t1_hqxa2a2",
                                    "score": 1,
                                    "created_utc": 1641148948.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": ">Diamond means 'red flag: Something's off'!\n\nNot in all cases. My whale of a SD was a diamond when we started chatting. He's spoilt me more than any other SD and he truely, absolutely is a gentleman. Truely I mean that in the most utmost of ways.... I was swept off my feet through conversation & the stimulation + the giving... my love language is gifting - big, small tokens that show appreciation... he always one ups things. He always gives me plenty of space and he gets rather happy when I of my free decision do things for him.. baking, wearing something ik he's seen on his TV crush lol - etc ☺\n\nThe only \"off\" is hes terminal, unknown of whether hes got a year, months, few years. Its a mystery. We wish we had met earlier and he had looked into sugar the past few years also... never dived though :)",
            "author": "WorldwideLoving",
            "id": "hqyhuff",
            "parent_id": "t1_hqx4rb7",
            "score": 6,
            "created_utc": 1641145457.0,
            "replies": []
        },
        {
            "body": "He is demeaning SDs too. He is an equal opportunity demeaner.",
            "author": "Monte_Sailor",
            "id": "hqyuz4d",
            "parent_id": "t1_hqx4rb7",
            "score": 2,
            "created_utc": 1641150277.0,
            "replies": []
        },
        {
            "body": "I didn’t get offended personally just offended that he feels the need to pay for a membership come on a SA site to put down the majority of those who use it. “If that makes me an escort so what, you’re the one using your money to attract women because you can’t get none” should have been my response but I reported instead lol",
            "author": "sxella206",
            "id": "hr0zh3k",
            "parent_id": "t1_hqxqkrb",
            "score": 1,
            "created_utc": 1641180652.0,
            "replies": []
        },
        {
            "body": "Maybe I have a different understanding than others, but I personally like to causally date older men, so I do enjoy the sex part and getting spoiled is a bonus out of it. I don’t see that as being an escort, but if that makes me one, I don’t mind. What I do mind is his level of arrogance and how he felt the need to not only insult everyone on the site, but make himself seem better than other SD.",
            "author": "sxella206",
            "id": "hqx3rs3",
            "parent_id": "t1_hqx3emz",
            "score": 10,
            "created_utc": 1641117481.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "hqxcupm",
                    "parent_id": "t1_hqx3rs3",
                    "score": 3,
                    "created_utc": 1641124969.0,
                    "replies": [
                        {
                            "body": "I understand your point and I know there’s gonna be pay for sex women on there. What bothered me was how condescending he was, he could have put it in better terms, while not putting down others. Also the fact that he paid a pricy membership on SA when Tindr and bumble would have been a better match for him. He also bragged about how much money he made and how successful he was, it’s obvious he will get women who want his money.",
                            "author": "sxella206",
                            "id": "hqxg0ha",
                            "parent_id": "t1_hqxcupm",
                            "score": 5,
                            "created_utc": 1641127340.0,
                            "replies": [
                                {
                                    "body": "To be honest he sounds like one of those Narcissistic sociopaths that end up on being a person of interest for a first 48 or unsolved crime documentary .  I’d stay away gives me the chills just reading the conversation.  Men that view women that way don’t usually treat them well.",
                                    "author": "Tequila-porfavor",
                                    "id": "hqxv026",
                                    "parent_id": "t1_hqxg0ha",
                                    "score": 4,
                                    "created_utc": 1641136030.0,
                                    "replies": []
                                },
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "hqxhy6h",
                                    "parent_id": "t1_hqxg0ha",
                                    "score": 1,
                                    "created_utc": 1641128705.0,
                                    "replies": [
                                        {
                                            "body": "Agreeing but extending, the fact that SR exist at all  speaks to the differentiation from escort work. While it is certainly true that one is a value proxy for the other, it absolutely not the same. The difference in quality of relationship between SB and an escort is huge, in my experience. And it is this quality of relationship I am investing in, the sex is a byproduct of the affection. I choose to invest in this because the SB is lending their prime years and should be compensated. Escorts are still relevant at appropriate times.",
                                            "author": "Ill_Ad_3573",
                                            "id": "hqxw613",
                                            "parent_id": "t1_hqxhy6h",
                                            "score": 3,
                                            "created_utc": 1641136593.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "Yup, you are agreeing with his misogynist, hateful crap. You do not get to decide what a woman is, anymore than he does. So just stop it. Plus your definition of what an escort is and does, like his, is simply \"not please me as I wish to be pleased.\" While I see how that serves you, it has very little basis in reality.",
                            "author": "ziggy440",
                            "id": "hr10vdj",
                            "parent_id": "t1_hqxcupm",
                            "score": 2,
                            "created_utc": 1641181274.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "hr2bi6u",
                                    "parent_id": "t1_hr10vdj",
                                    "score": 0,
                                    "created_utc": 1641211714.0,
                                    "replies": [
                                        {
                                            "body": "You are the one declaring whether a woman is an escort or not based on your, sole judgment. Period. And you encourage and enable others, including the manipulative asshole the OP met, to do the same. You should stop doing that because it's wrong, and because it perpetuates a male view of women as good or bad based on male judgment of them. I don't expect you to understand that, but please try.\n\nWhat you probably mean when you say SB, I'm guessing, is that you prefer a GFE SB and you recognize one based on how she makes you feel. That's fine. But that does not mean someone who does not do what you like, make you feel how you like to feel, does not belong in the bowl or isn't a good SB. Despite your sense of entitlement.\n\nAs for what I am - I'm no one to you because I don't give you the feeling you want and that you feel your deserve. And I guess I don't belong in the bowl either because I believe it can be whatever people want it to be, from platonic to just hook ups, so long as everyone plays nice and is as honest as they can be about what they seek. And you, my friend do not belong in my bowl, because with your judgments you are not playing nice.\n\nHere's hoping some of this sinks in.",
                                            "author": "ziggy440",
                                            "id": "hr2u3gg",
                                            "parent_id": "t1_hr2bi6u",
                                            "score": 2,
                                            "created_utc": 1641221841.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Preach!",
            "author": "YakiMe",
            "id": "hqxh4d0",
            "parent_id": "t1_hqx3emz",
            "score": 1,
            "created_utc": 1641128133.0,
            "replies": []
        },
        {
            "body": "Not everyone will know this information about diamond members as there are new people to the bowl always. Including me. People don’t start out knowing the ins and outs or red flags but this is why this forum is so great.",
            "author": "Intelligent_Signal86",
            "id": "hqydypu",
            "parent_id": "t1_hqxfzie",
            "score": 5,
            "created_utc": 1641143980.0,
            "replies": []
        },
        {
            "body": "I’m still new to these sites, I thought I studied a lot but looks like I need to study about this more. Also what does CZ mean?",
            "author": "sxella206",
            "id": "hqxhb8t",
            "parent_id": "t1_hqxfzie",
            "score": 3,
            "created_utc": 1641128268.0,
            "replies": [
                {
                    "body": "CZ = cubic zirconia “lab-created diamond also known as fake diamond”",
                    "author": null,
                    "id": "hqxvsor",
                    "parent_id": "t1_hqxhb8t",
                    "score": 5,
                    "created_utc": 1641136413.0,
                    "replies": [
                        {
                            "body": "Totally agree with this one. What should be remembered is that some SD's take work practices into this grey area.",
                            "author": "Coastal_Bull",
                            "id": "hqy0iif",
                            "parent_id": "t1_hqxvsor",
                            "score": 1,
                            "created_utc": 1641138554.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Him going off on other SD really showed his personality because SD did nothing to him but he still felt the need to put them down. His whole “I’m not like other guys” translates to “I’m not like other guys I’m worse”",
            "author": "sxella206",
            "id": "hqxhr7g",
            "parent_id": "t1_hqxhf5o",
            "score": 5,
            "created_utc": 1641128576.0,
            "replies": [
                {
                    "body": "In my experience this is always the young (still too old for you too vanilla date) attractive (average at best, and way below what you'd date vanilla) ones. They fail to realize that women can compartmentalize... we can have fun open minded partnerships with men our age all while sugar dating men that can add monetary value and wisdom to our lives. We don't need weird in-between things with \"younger\" closed minded jerk SDs who add no value to our lives.",
                    "author": "InterDevochka",
                    "id": "hqz1a98",
                    "parent_id": "t1_hqxhr7g",
                    "score": 3,
                    "created_utc": 1641152592.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Exactly. Why be with someone who's disrespectful to *anyone*, let alone you? I also take note of how people treat service staff, like servers in restaurants. There's no reason to be rude or condescending to anyone, and I don't want to be in the company of anyone who is.",
            "author": null,
            "id": "hqxh495",
            "parent_id": "t1_hqx6mnh",
            "score": 5,
            "created_utc": 1641128131.0,
            "replies": []
        },
        {
            "body": "Money sucking slut is my new band name",
            "author": null,
            "id": "hqxltd6",
            "parent_id": "t1_hqxk6z1",
            "score": 7,
            "created_utc": 1641131153.0,
            "replies": [
                {
                    "body": "Let’s establish a company of SBs called “Money-sucking Sluts & Co” lol",
                    "author": "m4dw0r1d",
                    "id": "hqxqa6s",
                    "parent_id": "t1_hqxltd6",
                    "score": 5,
                    "created_utc": 1641133672.0,
                    "replies": [
                        {
                            "body": "Money-sucking sluts is my new cam name lmao.",
                            "author": "Head-Sail-9856",
                            "id": "hqyuspq",
                            "parent_id": "t1_hqxqa6s",
                            "score": 2,
                            "created_utc": 1641150212.0,
                            "replies": [
                                {
                                    "body": "I’m so happy to inspire you, gals hahaha",
                                    "author": "m4dw0r1d",
                                    "id": "hqyxwjw",
                                    "parent_id": "t1_hqyuspq",
                                    "score": 2,
                                    "created_utc": 1641151338.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Yet he’s on the site 😂 he took all the time to create a profile. That’s hilarious!",
            "author": "Intelligent_Signal86",
            "id": "hqyeb6p",
            "parent_id": "t1_hqxk6z1",
            "score": 2,
            "created_utc": 1641144113.0,
            "replies": [
                {
                    "body": "Yeah… Meawhile he wrote “Get ready to be spoiled” in his profile. I called him a hypocrite hahahah",
                    "author": "m4dw0r1d",
                    "id": "hqynhee",
                    "parent_id": "t1_hqyeb6p",
                    "score": 2,
                    "created_utc": 1641147580.0,
                    "replies": [
                        {
                            "body": "HAHA the nerve!",
                            "author": "Intelligent_Signal86",
                            "id": "hrbfq3x",
                            "parent_id": "t1_hqynhee",
                            "score": 1,
                            "created_utc": 1641360156.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I saw a profile that said “if you call yourself a princess or spoilt then move along and don’t waste my time”. Being on a SA site and bragging about money will attract women who like money. Delusional really, they love to be victims.",
            "author": "sxella206",
            "id": "hqzft4n",
            "parent_id": "t1_hqxk6z1",
            "score": 2,
            "created_utc": 1641157808.0,
            "replies": []
        },
        {
            "body": "This made me laugh😂😂😂",
            "author": "sxella206",
            "id": "hr10omr",
            "parent_id": "t1_hr0x744",
            "score": 1,
            "created_utc": 1641181189.0,
            "replies": [
                {
                    "body": "😏😂",
                    "author": "NorthernGirlHere",
                    "id": "hr124d7",
                    "parent_id": "t1_hr10omr",
                    "score": 1,
                    "created_utc": 1641181831.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I call them the McDomly doms ..they've watched 50 Shades and suddenly think they're Dominant. It's like someone thinking they're a Witch because they've watched Harry Potter. 🤣",
            "author": "LadyMorgan2018",
            "id": "hqy9ffp",
            "parent_id": "t1_hqx6gbj",
            "score": 4,
            "created_utc": 1641142233.0,
            "replies": []
        },
        {
            "body": "I reported him for sure",
            "author": "sxella206",
            "id": "hqx3ulm",
            "parent_id": "t1_hqx32gb",
            "score": 3,
            "created_utc": 1641117547.0,
            "replies": []
        },
        {
            "body": "That’s exactly what I thought. A sub and dom relationship seems abusive to others but it’s consensual and we both have to care for one another despite what we’re doing. I don’t think he was into the sub/dom part he just wanted someone to put up with his shit",
            "author": "sxella206",
            "id": "hr0zxc0",
            "parent_id": "t1_hqyprky",
            "score": 2,
            "created_utc": 1641180853.0,
            "replies": []
        },
        {
            "body": "The thing is he was putting the demographic who use the site down. What’s the point of throwing your money onto diamond if you’re cheap and technically hate the users on the site. He was bragging about how successful he is and all his businesses then gets upset he attracts women who want money. Sounds like money is all he offers",
            "author": "sxella206",
            "id": "hqzga8u",
            "parent_id": "t1_hqygn8w",
            "score": 1,
            "created_utc": 1641157976.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "hqzql4s",
            "parent_id": "t1_hqyh3wf",
            "score": 2,
            "created_utc": 1641162214.0,
            "replies": [
                {
                    "body": "Well said!.... Yes, I use the gray rock method often.\n\nAnd yes, I had trauma from dealing with past family narcs. It took awhile to figure out, and fix later on.",
                    "author": "Nomad_Bill",
                    "id": "hqzrm4m",
                    "parent_id": "t1_hqzql4s",
                    "score": 1,
                    "created_utc": 1641162617.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "You should ask that question on your own post so people who’ve been in this game for a while can help you, since I’m still new and I don’t want to give you advice that can ruin your experience. Or you can comment this on the thread “A-touchofreality” created under my post since she’s giving out advice and so are other SD and SB. Good luck?",
            "author": "sxella206",
            "id": "hr10hac",
            "parent_id": "t1_hqztrvi",
            "score": 2,
            "created_utc": 1641181098.0,
            "replies": [
                {
                    "body": "I'll do that. Thanks",
                    "author": "shygirl-123",
                    "id": "hr10vlk",
                    "parent_id": "t1_hr10hac",
                    "score": 1,
                    "created_utc": 1641181276.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Probably because money is the only thing that’s good about him and “gold diggers” “escorts” will chase him and he’ll try to find the ones who are softer and can fall for his trap. Since his tinder is probably dead😂",
            "author": "sxella206",
            "id": "hr10mii",
            "parent_id": "t1_hr090ku",
            "score": 2,
            "created_utc": 1641181163.0,
            "replies": []
        },
        {
            "body": "Just means they paid more. Premium is $90/30 days, Diamond is $250/30 days.\n\nThinking about it now, I guess this guy probably figures if he gets out of paying even one PPM he's ahead of the game for his extra $150/month.",
            "author": null,
            "id": "hqxoiwq",
            "parent_id": "t1_hqx4v0u",
            "score": 19,
            "created_utc": 1641132712.0,
            "replies": [
                {
                    "body": "They are willing to pay $160 per month additional  to look more prosperous.  That's a great investment for those wanting to defraud SB's  or abuse SB's ,  especially those with limited experience.",
                    "author": "pinotandsugar",
                    "id": "hr04hkt",
                    "parent_id": "t1_hqxoiwq",
                    "score": 8,
                    "created_utc": 1641167679.0,
                    "replies": []
                }
            ]
        },
        {
            "body": ">Wait it’s a red flag? I thought it was a good thing if someone’s a diamond because it means they’re serious/not a scammer and I heard it’s not cheap to become one.\n\nI've heard lots of stories from SBs on here that many bad actors are \"diamond\" in part to try to \"prove\" they are serious with diamond status.",
            "author": "BinghamtonSD",
            "id": "hqz2rgg",
            "parent_id": "t1_hqx4v0u",
            "score": 5,
            "created_utc": 1641153134.0,
            "replies": []
        },
        {
            "body": "Honestly… that’s what I thought too 😥",
            "author": "JCourageous",
            "id": "hqx6zug",
            "parent_id": "t1_hqx4v0u",
            "score": 2,
            "created_utc": 1641120166.0,
            "replies": [
                {
                    "body": "Ok, let me ask you some questions:\n\n1. Why on earth would a SD, on a site where the ratio is so much in his favour with 4 SBs for every SD, need to become a 'Diamond member?\n2. Why would a seriously wealthy man paint a red sign on his forehead and attract all kinds of unwanted attention, whereas usually very wealthy people prefer to stay under the radar just to avoid this kind of attention they encounter everyday in  daily life?\n3. What's investing $250 for a scammers syndicate that operates 24/7 with a team of 'operators' from Nigeria, to get in contact with a lot of naive and money hungry girls to scam? That's an easy ROI!\n\nIf a SD needs to become a Diamond member somethings off, and usually it's one of the answers on the above questions.",
                    "author": "A-touchofreality",
                    "id": "hqxa2a2",
                    "parent_id": "t1_hqx6zug",
                    "score": 29,
                    "created_utc": 1641122718.0,
                    "replies": [
                        {
                            "body": "This makes so much sense. I thought if someone is going to be diamond it’s to prove that they aren’t going to scam, but are serious about SA. I thought they were more of the safer option since I’ve had too many scammers bother me. Thank you!",
                            "author": "sxella206",
                            "id": "hqxgd7p",
                            "parent_id": "t1_hqxa2a2",
                            "score": 10,
                            "created_utc": 1641127597.0,
                            "replies": [
                                {
                                    "body": "Someone who is ready to roll into a platonic meet and greet is really the only way to cut through the majority of the scammers",
                                    "author": "YakiMe",
                                    "id": "hqxhcb1",
                                    "parent_id": "t1_hqxgd7p",
                                    "score": 7,
                                    "created_utc": 1641128289.0,
                                    "replies": []
                                },
                                {
                                    "body": "Same for me.. very awkward conversation with someone who left a very bitter aftertaste who was also diamond. I thought it was a good thing but reading this here makes total sense.",
                                    "author": "mymelancholybaby279",
                                    "id": "hqxsr70",
                                    "parent_id": "t1_hqxgd7p",
                                    "score": 1,
                                    "created_utc": 1641134929.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "100% not my experience. I was on SA for a couple of months, weeding out scammers and sending umpteen messages to women I was interested in. Tons of work. I was going to either leave the platform or upgrade to Diamond for one month as a Hail Mary. \n\nInstantly, I received messages from higher-caliber, legitimate SB potentials. I received fewer scam messages, too. I had three M&G’s in two weeks and my only problem was selecting the best possible fit out of three great women.\n\nI only have my own anecdotal evidence to suggest this, but I think there’s a different algorithm/rule-set for diamond members. \n\nIf this is true, it’s annoying AF because prior to Diamond I was paying an already hefty fee for premium and not receiving the value I (and others) deserve. \n\nTo answer “A-touchofreality”… \n\n1. If you factor in scammers, escorts, non-active users, and people outside of your filters it’s not a 4:1 ratio. Not even close.\n\n2. I’m “seriously wealthy” and have a blurred picture, which I share with people I vet.\n\n3. $250 is a lot given how many scammer accounts get shut down.",
                            "author": "LordWildmore",
                            "id": "hqy7tzh",
                            "parent_id": "t1_hqxa2a2",
                            "score": 9,
                            "created_utc": 1641141601.0,
                            "replies": [
                                {
                                    "body": ">I was paying an already hefty fee for premium  \n>  \n>$250 is a lot given how many scammer accounts get shut down.  \n>  \n>I’m “seriously wealthy” \n\nSir, with all due respect, seriously wealthy people don't talk about 'hefty fee's' when spending $90, or consider '$250 is a lot'.",
                                    "author": "A-touchofreality",
                                    "id": "hqzqpuk",
                                    "parent_id": "t1_hqy7tzh",
                                    "score": 7,
                                    "created_utc": 1641162265.0,
                                    "replies": [
                                        {
                                            "body": "I said, “a lot” in the context of a scammer’s bottom line. \n\nYou must not know any wealthy people or the ones you know inherited their money. I worked hard to build wealth and wasting money is for fools. I‘ll eat in the finest restaurants and drink expensive bourbon, but even if I was a billionaire I’d still shun waste and avoid companies trying to get over on me.",
                                            "author": "LordWildmore",
                                            "id": "hqzsrhs",
                                            "parent_id": "t1_hqzqpuk",
                                            "score": 4,
                                            "created_utc": 1641163056.0,
                                            "replies": [
                                                {
                                                    "body": "*> You must not know any wealthy people or the ones you know inherited their money.*\n\nNice *ASS*umption, but this comment only confirms my previous statement about your 'serious wealth'.",
                                                    "author": "A-touchofreality",
                                                    "id": "hr8dvve",
                                                    "parent_id": "t1_hqzsrhs",
                                                    "score": 1,
                                                    "created_utc": 1641315251.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "Really interesting discussion... I had weighed diamond when I first started, because I thought it would weed out spam and save time, but I just turned my profile to private and instead messaged POTs directly as many here suggested, and I had pretty good success, and never felt like I needed diamond. Though I wonder if our experiences are different because NYC is apparently SB mecca, so the ratio is actually that favorable.",
                                    "author": "noobNYCsd",
                                    "id": "hqyd98g",
                                    "parent_id": "t1_hqy7tzh",
                                    "score": 2,
                                    "created_utc": 1641143717.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "I know someone who’s worth 6bil on there and he’s a diamond member. I believe you have to show your proof of income and your ssn. Ive only had one bad experience with a diamond member who stood me up on a date, but also turns out my friend was stood up by the same man. Serial stander-upper. Besides that many of the men I met on there who are diamond members are very sexy, respectful and sexually positive.",
                            "author": "Prophetess111",
                            "id": "hqy9u55",
                            "parent_id": "t1_hqxa2a2",
                            "score": 4,
                            "created_utc": 1641142393.0,
                            "replies": [
                                {
                                    "body": "> I believe you have to show your proof of income and your ssn.\n\nAnd you seriously think someone who owns 6bil is going to give proof of income and SSN to a site such as SA?! \n\nROFLAO.",
                                    "author": "A-touchofreality",
                                    "id": "hqzpnoe",
                                    "parent_id": "t1_hqy9u55",
                                    "score": 3,
                                    "created_utc": 1641161852.0,
                                    "replies": [
                                        {
                                            "body": "I’m confused as to what you mean but he’s very prominent and famously rich so it’s not a big deal to him to show his income.",
                                            "author": "Prophetess111",
                                            "id": "i024jr3",
                                            "parent_id": "t1_hqzpnoe",
                                            "score": 1,
                                            "created_utc": 1646880483.0,
                                            "replies": [
                                                {
                                                    "body": "Sure, perfectly normal for 'very prominent and famously rich people' to show a site such as SA a their income! That is, if SA indeed would be so stupid as to ask for it, which of course they don't. LOL, you obviously have no clue how seriously rich people think and act.\n\nSo go after them 'rich and verified' Diamond members tiger!\n\n(Don't forget to read the scam sticky first though! Because you sound utterly naif)",
                                                    "author": "A-touchofreality",
                                                    "id": "i0343rr",
                                                    "parent_id": "t1_i024jr3",
                                                    "score": 1,
                                                    "created_utc": 1646902536.0,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "body": "It’s says “more than 100 Million” on his Diamond profile",
                                            "author": "Prophetess111",
                                            "id": "i024m4x",
                                            "parent_id": "t1_hqzpnoe",
                                            "score": 1,
                                            "created_utc": 1646880514.0,
                                            "replies": [
                                                {
                                                    "body": "It could also say he has a green coloured shine-in-the-dark dick on his Diamond profile. \n\nBut dream on!",
                                                    "author": "A-touchofreality",
                                                    "id": "i033mkl",
                                                    "parent_id": "t1_i024m4x",
                                                    "score": 1,
                                                    "created_utc": 1646902128.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "And here I was, thinking that I was a cheapskate for having premium membership! Never had trouble finding a SB with premium though so you are right about that.",
                            "author": "chemistryromance",
                            "id": "hqzazpf",
                            "parent_id": "t1_hqxa2a2",
                            "score": 2,
                            "created_utc": 1641156104.0,
                            "replies": []
                        },
                        {
                            "body": "This!",
                            "author": "purpleyogi",
                            "id": "hqy2hi1",
                            "parent_id": "t1_hqxa2a2",
                            "score": 1,
                            "created_utc": 1641139402.0,
                            "replies": []
                        },
                        {
                            "body": "I never knew this before, so thank you for this advice!! Always thought “diamond” was a positive sign.",
                            "author": "Myrtle_Snow333",
                            "id": "hqyramn",
                            "parent_id": "t1_hqxa2a2",
                            "score": 1,
                            "created_utc": 1641148948.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "hqxcupm",
            "parent_id": "t1_hqx3rs3",
            "score": 3,
            "created_utc": 1641124969.0,
            "replies": [
                {
                    "body": "I understand your point and I know there’s gonna be pay for sex women on there. What bothered me was how condescending he was, he could have put it in better terms, while not putting down others. Also the fact that he paid a pricy membership on SA when Tindr and bumble would have been a better match for him. He also bragged about how much money he made and how successful he was, it’s obvious he will get women who want his money.",
                    "author": "sxella206",
                    "id": "hqxg0ha",
                    "parent_id": "t1_hqxcupm",
                    "score": 5,
                    "created_utc": 1641127340.0,
                    "replies": [
                        {
                            "body": "To be honest he sounds like one of those Narcissistic sociopaths that end up on being a person of interest for a first 48 or unsolved crime documentary .  I’d stay away gives me the chills just reading the conversation.  Men that view women that way don’t usually treat them well.",
                            "author": "Tequila-porfavor",
                            "id": "hqxv026",
                            "parent_id": "t1_hqxg0ha",
                            "score": 4,
                            "created_utc": 1641136030.0,
                            "replies": []
                        },
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "hqxhy6h",
                            "parent_id": "t1_hqxg0ha",
                            "score": 1,
                            "created_utc": 1641128705.0,
                            "replies": [
                                {
                                    "body": "Agreeing but extending, the fact that SR exist at all  speaks to the differentiation from escort work. While it is certainly true that one is a value proxy for the other, it absolutely not the same. The difference in quality of relationship between SB and an escort is huge, in my experience. And it is this quality of relationship I am investing in, the sex is a byproduct of the affection. I choose to invest in this because the SB is lending their prime years and should be compensated. Escorts are still relevant at appropriate times.",
                                    "author": "Ill_Ad_3573",
                                    "id": "hqxw613",
                                    "parent_id": "t1_hqxhy6h",
                                    "score": 3,
                                    "created_utc": 1641136593.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Yup, you are agreeing with his misogynist, hateful crap. You do not get to decide what a woman is, anymore than he does. So just stop it. Plus your definition of what an escort is and does, like his, is simply \"not please me as I wish to be pleased.\" While I see how that serves you, it has very little basis in reality.",
                    "author": "ziggy440",
                    "id": "hr10vdj",
                    "parent_id": "t1_hqxcupm",
                    "score": 2,
                    "created_utc": 1641181274.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "hr2bi6u",
                            "parent_id": "t1_hr10vdj",
                            "score": 0,
                            "created_utc": 1641211714.0,
                            "replies": [
                                {
                                    "body": "You are the one declaring whether a woman is an escort or not based on your, sole judgment. Period. And you encourage and enable others, including the manipulative asshole the OP met, to do the same. You should stop doing that because it's wrong, and because it perpetuates a male view of women as good or bad based on male judgment of them. I don't expect you to understand that, but please try.\n\nWhat you probably mean when you say SB, I'm guessing, is that you prefer a GFE SB and you recognize one based on how she makes you feel. That's fine. But that does not mean someone who does not do what you like, make you feel how you like to feel, does not belong in the bowl or isn't a good SB. Despite your sense of entitlement.\n\nAs for what I am - I'm no one to you because I don't give you the feeling you want and that you feel your deserve. And I guess I don't belong in the bowl either because I believe it can be whatever people want it to be, from platonic to just hook ups, so long as everyone plays nice and is as honest as they can be about what they seek. And you, my friend do not belong in my bowl, because with your judgments you are not playing nice.\n\nHere's hoping some of this sinks in.",
                                    "author": "ziggy440",
                                    "id": "hr2u3gg",
                                    "parent_id": "t1_hr2bi6u",
                                    "score": 2,
                                    "created_utc": 1641221841.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "CZ = cubic zirconia “lab-created diamond also known as fake diamond”",
            "author": null,
            "id": "hqxvsor",
            "parent_id": "t1_hqxhb8t",
            "score": 5,
            "created_utc": 1641136413.0,
            "replies": [
                {
                    "body": "Totally agree with this one. What should be remembered is that some SD's take work practices into this grey area.",
                    "author": "Coastal_Bull",
                    "id": "hqy0iif",
                    "parent_id": "t1_hqxvsor",
                    "score": 1,
                    "created_utc": 1641138554.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "In my experience this is always the young (still too old for you too vanilla date) attractive (average at best, and way below what you'd date vanilla) ones. They fail to realize that women can compartmentalize... we can have fun open minded partnerships with men our age all while sugar dating men that can add monetary value and wisdom to our lives. We don't need weird in-between things with \"younger\" closed minded jerk SDs who add no value to our lives.",
            "author": "InterDevochka",
            "id": "hqz1a98",
            "parent_id": "t1_hqxhr7g",
            "score": 3,
            "created_utc": 1641152592.0,
            "replies": []
        },
        {
            "body": "Let’s establish a company of SBs called “Money-sucking Sluts & Co” lol",
            "author": "m4dw0r1d",
            "id": "hqxqa6s",
            "parent_id": "t1_hqxltd6",
            "score": 5,
            "created_utc": 1641133672.0,
            "replies": [
                {
                    "body": "Money-sucking sluts is my new cam name lmao.",
                    "author": "Head-Sail-9856",
                    "id": "hqyuspq",
                    "parent_id": "t1_hqxqa6s",
                    "score": 2,
                    "created_utc": 1641150212.0,
                    "replies": [
                        {
                            "body": "I’m so happy to inspire you, gals hahaha",
                            "author": "m4dw0r1d",
                            "id": "hqyxwjw",
                            "parent_id": "t1_hqyuspq",
                            "score": 2,
                            "created_utc": 1641151338.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Yeah… Meawhile he wrote “Get ready to be spoiled” in his profile. I called him a hypocrite hahahah",
            "author": "m4dw0r1d",
            "id": "hqynhee",
            "parent_id": "t1_hqyeb6p",
            "score": 2,
            "created_utc": 1641147580.0,
            "replies": [
                {
                    "body": "HAHA the nerve!",
                    "author": "Intelligent_Signal86",
                    "id": "hrbfq3x",
                    "parent_id": "t1_hqynhee",
                    "score": 1,
                    "created_utc": 1641360156.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "😏😂",
            "author": "NorthernGirlHere",
            "id": "hr124d7",
            "parent_id": "t1_hr10omr",
            "score": 1,
            "created_utc": 1641181831.0,
            "replies": []
        },
        {
            "body": "Well said!.... Yes, I use the gray rock method often.\n\nAnd yes, I had trauma from dealing with past family narcs. It took awhile to figure out, and fix later on.",
            "author": "Nomad_Bill",
            "id": "hqzrm4m",
            "parent_id": "t1_hqzql4s",
            "score": 1,
            "created_utc": 1641162617.0,
            "replies": []
        },
        {
            "body": "I'll do that. Thanks",
            "author": "shygirl-123",
            "id": "hr10vlk",
            "parent_id": "t1_hr10hac",
            "score": 1,
            "created_utc": 1641181276.0,
            "replies": []
        },
        {
            "body": "They are willing to pay $160 per month additional  to look more prosperous.  That's a great investment for those wanting to defraud SB's  or abuse SB's ,  especially those with limited experience.",
            "author": "pinotandsugar",
            "id": "hr04hkt",
            "parent_id": "t1_hqxoiwq",
            "score": 8,
            "created_utc": 1641167679.0,
            "replies": []
        },
        {
            "body": "Ok, let me ask you some questions:\n\n1. Why on earth would a SD, on a site where the ratio is so much in his favour with 4 SBs for every SD, need to become a 'Diamond member?\n2. Why would a seriously wealthy man paint a red sign on his forehead and attract all kinds of unwanted attention, whereas usually very wealthy people prefer to stay under the radar just to avoid this kind of attention they encounter everyday in  daily life?\n3. What's investing $250 for a scammers syndicate that operates 24/7 with a team of 'operators' from Nigeria, to get in contact with a lot of naive and money hungry girls to scam? That's an easy ROI!\n\nIf a SD needs to become a Diamond member somethings off, and usually it's one of the answers on the above questions.",
            "author": "A-touchofreality",
            "id": "hqxa2a2",
            "parent_id": "t1_hqx6zug",
            "score": 29,
            "created_utc": 1641122718.0,
            "replies": [
                {
                    "body": "This makes so much sense. I thought if someone is going to be diamond it’s to prove that they aren’t going to scam, but are serious about SA. I thought they were more of the safer option since I’ve had too many scammers bother me. Thank you!",
                    "author": "sxella206",
                    "id": "hqxgd7p",
                    "parent_id": "t1_hqxa2a2",
                    "score": 10,
                    "created_utc": 1641127597.0,
                    "replies": [
                        {
                            "body": "Someone who is ready to roll into a platonic meet and greet is really the only way to cut through the majority of the scammers",
                            "author": "YakiMe",
                            "id": "hqxhcb1",
                            "parent_id": "t1_hqxgd7p",
                            "score": 7,
                            "created_utc": 1641128289.0,
                            "replies": []
                        },
                        {
                            "body": "Same for me.. very awkward conversation with someone who left a very bitter aftertaste who was also diamond. I thought it was a good thing but reading this here makes total sense.",
                            "author": "mymelancholybaby279",
                            "id": "hqxsr70",
                            "parent_id": "t1_hqxgd7p",
                            "score": 1,
                            "created_utc": 1641134929.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "100% not my experience. I was on SA for a couple of months, weeding out scammers and sending umpteen messages to women I was interested in. Tons of work. I was going to either leave the platform or upgrade to Diamond for one month as a Hail Mary. \n\nInstantly, I received messages from higher-caliber, legitimate SB potentials. I received fewer scam messages, too. I had three M&G’s in two weeks and my only problem was selecting the best possible fit out of three great women.\n\nI only have my own anecdotal evidence to suggest this, but I think there’s a different algorithm/rule-set for diamond members. \n\nIf this is true, it’s annoying AF because prior to Diamond I was paying an already hefty fee for premium and not receiving the value I (and others) deserve. \n\nTo answer “A-touchofreality”… \n\n1. If you factor in scammers, escorts, non-active users, and people outside of your filters it’s not a 4:1 ratio. Not even close.\n\n2. I’m “seriously wealthy” and have a blurred picture, which I share with people I vet.\n\n3. $250 is a lot given how many scammer accounts get shut down.",
                    "author": "LordWildmore",
                    "id": "hqy7tzh",
                    "parent_id": "t1_hqxa2a2",
                    "score": 9,
                    "created_utc": 1641141601.0,
                    "replies": [
                        {
                            "body": ">I was paying an already hefty fee for premium  \n>  \n>$250 is a lot given how many scammer accounts get shut down.  \n>  \n>I’m “seriously wealthy” \n\nSir, with all due respect, seriously wealthy people don't talk about 'hefty fee's' when spending $90, or consider '$250 is a lot'.",
                            "author": "A-touchofreality",
                            "id": "hqzqpuk",
                            "parent_id": "t1_hqy7tzh",
                            "score": 7,
                            "created_utc": 1641162265.0,
                            "replies": [
                                {
                                    "body": "I said, “a lot” in the context of a scammer’s bottom line. \n\nYou must not know any wealthy people or the ones you know inherited their money. I worked hard to build wealth and wasting money is for fools. I‘ll eat in the finest restaurants and drink expensive bourbon, but even if I was a billionaire I’d still shun waste and avoid companies trying to get over on me.",
                                    "author": "LordWildmore",
                                    "id": "hqzsrhs",
                                    "parent_id": "t1_hqzqpuk",
                                    "score": 4,
                                    "created_utc": 1641163056.0,
                                    "replies": [
                                        {
                                            "body": "*> You must not know any wealthy people or the ones you know inherited their money.*\n\nNice *ASS*umption, but this comment only confirms my previous statement about your 'serious wealth'.",
                                            "author": "A-touchofreality",
                                            "id": "hr8dvve",
                                            "parent_id": "t1_hqzsrhs",
                                            "score": 1,
                                            "created_utc": 1641315251.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "Really interesting discussion... I had weighed diamond when I first started, because I thought it would weed out spam and save time, but I just turned my profile to private and instead messaged POTs directly as many here suggested, and I had pretty good success, and never felt like I needed diamond. Though I wonder if our experiences are different because NYC is apparently SB mecca, so the ratio is actually that favorable.",
                            "author": "noobNYCsd",
                            "id": "hqyd98g",
                            "parent_id": "t1_hqy7tzh",
                            "score": 2,
                            "created_utc": 1641143717.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "I know someone who’s worth 6bil on there and he’s a diamond member. I believe you have to show your proof of income and your ssn. Ive only had one bad experience with a diamond member who stood me up on a date, but also turns out my friend was stood up by the same man. Serial stander-upper. Besides that many of the men I met on there who are diamond members are very sexy, respectful and sexually positive.",
                    "author": "Prophetess111",
                    "id": "hqy9u55",
                    "parent_id": "t1_hqxa2a2",
                    "score": 4,
                    "created_utc": 1641142393.0,
                    "replies": [
                        {
                            "body": "> I believe you have to show your proof of income and your ssn.\n\nAnd you seriously think someone who owns 6bil is going to give proof of income and SSN to a site such as SA?! \n\nROFLAO.",
                            "author": "A-touchofreality",
                            "id": "hqzpnoe",
                            "parent_id": "t1_hqy9u55",
                            "score": 3,
                            "created_utc": 1641161852.0,
                            "replies": [
                                {
                                    "body": "I’m confused as to what you mean but he’s very prominent and famously rich so it’s not a big deal to him to show his income.",
                                    "author": "Prophetess111",
                                    "id": "i024jr3",
                                    "parent_id": "t1_hqzpnoe",
                                    "score": 1,
                                    "created_utc": 1646880483.0,
                                    "replies": [
                                        {
                                            "body": "Sure, perfectly normal for 'very prominent and famously rich people' to show a site such as SA a their income! That is, if SA indeed would be so stupid as to ask for it, which of course they don't. LOL, you obviously have no clue how seriously rich people think and act.\n\nSo go after them 'rich and verified' Diamond members tiger!\n\n(Don't forget to read the scam sticky first though! Because you sound utterly naif)",
                                            "author": "A-touchofreality",
                                            "id": "i0343rr",
                                            "parent_id": "t1_i024jr3",
                                            "score": 1,
                                            "created_utc": 1646902536.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "It’s says “more than 100 Million” on his Diamond profile",
                                    "author": "Prophetess111",
                                    "id": "i024m4x",
                                    "parent_id": "t1_hqzpnoe",
                                    "score": 1,
                                    "created_utc": 1646880514.0,
                                    "replies": [
                                        {
                                            "body": "It could also say he has a green coloured shine-in-the-dark dick on his Diamond profile. \n\nBut dream on!",
                                            "author": "A-touchofreality",
                                            "id": "i033mkl",
                                            "parent_id": "t1_i024m4x",
                                            "score": 1,
                                            "created_utc": 1646902128.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "And here I was, thinking that I was a cheapskate for having premium membership! Never had trouble finding a SB with premium though so you are right about that.",
                    "author": "chemistryromance",
                    "id": "hqzazpf",
                    "parent_id": "t1_hqxa2a2",
                    "score": 2,
                    "created_utc": 1641156104.0,
                    "replies": []
                },
                {
                    "body": "This!",
                    "author": "purpleyogi",
                    "id": "hqy2hi1",
                    "parent_id": "t1_hqxa2a2",
                    "score": 1,
                    "created_utc": 1641139402.0,
                    "replies": []
                },
                {
                    "body": "I never knew this before, so thank you for this advice!! Always thought “diamond” was a positive sign.",
                    "author": "Myrtle_Snow333",
                    "id": "hqyramn",
                    "parent_id": "t1_hqxa2a2",
                    "score": 1,
                    "created_utc": 1641148948.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I understand your point and I know there’s gonna be pay for sex women on there. What bothered me was how condescending he was, he could have put it in better terms, while not putting down others. Also the fact that he paid a pricy membership on SA when Tindr and bumble would have been a better match for him. He also bragged about how much money he made and how successful he was, it’s obvious he will get women who want his money.",
            "author": "sxella206",
            "id": "hqxg0ha",
            "parent_id": "t1_hqxcupm",
            "score": 5,
            "created_utc": 1641127340.0,
            "replies": [
                {
                    "body": "To be honest he sounds like one of those Narcissistic sociopaths that end up on being a person of interest for a first 48 or unsolved crime documentary .  I’d stay away gives me the chills just reading the conversation.  Men that view women that way don’t usually treat them well.",
                    "author": "Tequila-porfavor",
                    "id": "hqxv026",
                    "parent_id": "t1_hqxg0ha",
                    "score": 4,
                    "created_utc": 1641136030.0,
                    "replies": []
                },
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "hqxhy6h",
                    "parent_id": "t1_hqxg0ha",
                    "score": 1,
                    "created_utc": 1641128705.0,
                    "replies": [
                        {
                            "body": "Agreeing but extending, the fact that SR exist at all  speaks to the differentiation from escort work. While it is certainly true that one is a value proxy for the other, it absolutely not the same. The difference in quality of relationship between SB and an escort is huge, in my experience. And it is this quality of relationship I am investing in, the sex is a byproduct of the affection. I choose to invest in this because the SB is lending their prime years and should be compensated. Escorts are still relevant at appropriate times.",
                            "author": "Ill_Ad_3573",
                            "id": "hqxw613",
                            "parent_id": "t1_hqxhy6h",
                            "score": 3,
                            "created_utc": 1641136593.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Yup, you are agreeing with his misogynist, hateful crap. You do not get to decide what a woman is, anymore than he does. So just stop it. Plus your definition of what an escort is and does, like his, is simply \"not please me as I wish to be pleased.\" While I see how that serves you, it has very little basis in reality.",
            "author": "ziggy440",
            "id": "hr10vdj",
            "parent_id": "t1_hqxcupm",
            "score": 2,
            "created_utc": 1641181274.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "hr2bi6u",
                    "parent_id": "t1_hr10vdj",
                    "score": 0,
                    "created_utc": 1641211714.0,
                    "replies": [
                        {
                            "body": "You are the one declaring whether a woman is an escort or not based on your, sole judgment. Period. And you encourage and enable others, including the manipulative asshole the OP met, to do the same. You should stop doing that because it's wrong, and because it perpetuates a male view of women as good or bad based on male judgment of them. I don't expect you to understand that, but please try.\n\nWhat you probably mean when you say SB, I'm guessing, is that you prefer a GFE SB and you recognize one based on how she makes you feel. That's fine. But that does not mean someone who does not do what you like, make you feel how you like to feel, does not belong in the bowl or isn't a good SB. Despite your sense of entitlement.\n\nAs for what I am - I'm no one to you because I don't give you the feeling you want and that you feel your deserve. And I guess I don't belong in the bowl either because I believe it can be whatever people want it to be, from platonic to just hook ups, so long as everyone plays nice and is as honest as they can be about what they seek. And you, my friend do not belong in my bowl, because with your judgments you are not playing nice.\n\nHere's hoping some of this sinks in.",
                            "author": "ziggy440",
                            "id": "hr2u3gg",
                            "parent_id": "t1_hr2bi6u",
                            "score": 2,
                            "created_utc": 1641221841.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Totally agree with this one. What should be remembered is that some SD's take work practices into this grey area.",
            "author": "Coastal_Bull",
            "id": "hqy0iif",
            "parent_id": "t1_hqxvsor",
            "score": 1,
            "created_utc": 1641138554.0,
            "replies": []
        },
        {
            "body": "Money-sucking sluts is my new cam name lmao.",
            "author": "Head-Sail-9856",
            "id": "hqyuspq",
            "parent_id": "t1_hqxqa6s",
            "score": 2,
            "created_utc": 1641150212.0,
            "replies": [
                {
                    "body": "I’m so happy to inspire you, gals hahaha",
                    "author": "m4dw0r1d",
                    "id": "hqyxwjw",
                    "parent_id": "t1_hqyuspq",
                    "score": 2,
                    "created_utc": 1641151338.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "HAHA the nerve!",
            "author": "Intelligent_Signal86",
            "id": "hrbfq3x",
            "parent_id": "t1_hqynhee",
            "score": 1,
            "created_utc": 1641360156.0,
            "replies": []
        },
        {
            "body": "This makes so much sense. I thought if someone is going to be diamond it’s to prove that they aren’t going to scam, but are serious about SA. I thought they were more of the safer option since I’ve had too many scammers bother me. Thank you!",
            "author": "sxella206",
            "id": "hqxgd7p",
            "parent_id": "t1_hqxa2a2",
            "score": 10,
            "created_utc": 1641127597.0,
            "replies": [
                {
                    "body": "Someone who is ready to roll into a platonic meet and greet is really the only way to cut through the majority of the scammers",
                    "author": "YakiMe",
                    "id": "hqxhcb1",
                    "parent_id": "t1_hqxgd7p",
                    "score": 7,
                    "created_utc": 1641128289.0,
                    "replies": []
                },
                {
                    "body": "Same for me.. very awkward conversation with someone who left a very bitter aftertaste who was also diamond. I thought it was a good thing but reading this here makes total sense.",
                    "author": "mymelancholybaby279",
                    "id": "hqxsr70",
                    "parent_id": "t1_hqxgd7p",
                    "score": 1,
                    "created_utc": 1641134929.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "100% not my experience. I was on SA for a couple of months, weeding out scammers and sending umpteen messages to women I was interested in. Tons of work. I was going to either leave the platform or upgrade to Diamond for one month as a Hail Mary. \n\nInstantly, I received messages from higher-caliber, legitimate SB potentials. I received fewer scam messages, too. I had three M&G’s in two weeks and my only problem was selecting the best possible fit out of three great women.\n\nI only have my own anecdotal evidence to suggest this, but I think there’s a different algorithm/rule-set for diamond members. \n\nIf this is true, it’s annoying AF because prior to Diamond I was paying an already hefty fee for premium and not receiving the value I (and others) deserve. \n\nTo answer “A-touchofreality”… \n\n1. If you factor in scammers, escorts, non-active users, and people outside of your filters it’s not a 4:1 ratio. Not even close.\n\n2. I’m “seriously wealthy” and have a blurred picture, which I share with people I vet.\n\n3. $250 is a lot given how many scammer accounts get shut down.",
            "author": "LordWildmore",
            "id": "hqy7tzh",
            "parent_id": "t1_hqxa2a2",
            "score": 9,
            "created_utc": 1641141601.0,
            "replies": [
                {
                    "body": ">I was paying an already hefty fee for premium  \n>  \n>$250 is a lot given how many scammer accounts get shut down.  \n>  \n>I’m “seriously wealthy” \n\nSir, with all due respect, seriously wealthy people don't talk about 'hefty fee's' when spending $90, or consider '$250 is a lot'.",
                    "author": "A-touchofreality",
                    "id": "hqzqpuk",
                    "parent_id": "t1_hqy7tzh",
                    "score": 7,
                    "created_utc": 1641162265.0,
                    "replies": [
                        {
                            "body": "I said, “a lot” in the context of a scammer’s bottom line. \n\nYou must not know any wealthy people or the ones you know inherited their money. I worked hard to build wealth and wasting money is for fools. I‘ll eat in the finest restaurants and drink expensive bourbon, but even if I was a billionaire I’d still shun waste and avoid companies trying to get over on me.",
                            "author": "LordWildmore",
                            "id": "hqzsrhs",
                            "parent_id": "t1_hqzqpuk",
                            "score": 4,
                            "created_utc": 1641163056.0,
                            "replies": [
                                {
                                    "body": "*> You must not know any wealthy people or the ones you know inherited their money.*\n\nNice *ASS*umption, but this comment only confirms my previous statement about your 'serious wealth'.",
                                    "author": "A-touchofreality",
                                    "id": "hr8dvve",
                                    "parent_id": "t1_hqzsrhs",
                                    "score": 1,
                                    "created_utc": 1641315251.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Really interesting discussion... I had weighed diamond when I first started, because I thought it would weed out spam and save time, but I just turned my profile to private and instead messaged POTs directly as many here suggested, and I had pretty good success, and never felt like I needed diamond. Though I wonder if our experiences are different because NYC is apparently SB mecca, so the ratio is actually that favorable.",
                    "author": "noobNYCsd",
                    "id": "hqyd98g",
                    "parent_id": "t1_hqy7tzh",
                    "score": 2,
                    "created_utc": 1641143717.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I know someone who’s worth 6bil on there and he’s a diamond member. I believe you have to show your proof of income and your ssn. Ive only had one bad experience with a diamond member who stood me up on a date, but also turns out my friend was stood up by the same man. Serial stander-upper. Besides that many of the men I met on there who are diamond members are very sexy, respectful and sexually positive.",
            "author": "Prophetess111",
            "id": "hqy9u55",
            "parent_id": "t1_hqxa2a2",
            "score": 4,
            "created_utc": 1641142393.0,
            "replies": [
                {
                    "body": "> I believe you have to show your proof of income and your ssn.\n\nAnd you seriously think someone who owns 6bil is going to give proof of income and SSN to a site such as SA?! \n\nROFLAO.",
                    "author": "A-touchofreality",
                    "id": "hqzpnoe",
                    "parent_id": "t1_hqy9u55",
                    "score": 3,
                    "created_utc": 1641161852.0,
                    "replies": [
                        {
                            "body": "I’m confused as to what you mean but he’s very prominent and famously rich so it’s not a big deal to him to show his income.",
                            "author": "Prophetess111",
                            "id": "i024jr3",
                            "parent_id": "t1_hqzpnoe",
                            "score": 1,
                            "created_utc": 1646880483.0,
                            "replies": [
                                {
                                    "body": "Sure, perfectly normal for 'very prominent and famously rich people' to show a site such as SA a their income! That is, if SA indeed would be so stupid as to ask for it, which of course they don't. LOL, you obviously have no clue how seriously rich people think and act.\n\nSo go after them 'rich and verified' Diamond members tiger!\n\n(Don't forget to read the scam sticky first though! Because you sound utterly naif)",
                                    "author": "A-touchofreality",
                                    "id": "i0343rr",
                                    "parent_id": "t1_i024jr3",
                                    "score": 1,
                                    "created_utc": 1646902536.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "It’s says “more than 100 Million” on his Diamond profile",
                            "author": "Prophetess111",
                            "id": "i024m4x",
                            "parent_id": "t1_hqzpnoe",
                            "score": 1,
                            "created_utc": 1646880514.0,
                            "replies": [
                                {
                                    "body": "It could also say he has a green coloured shine-in-the-dark dick on his Diamond profile. \n\nBut dream on!",
                                    "author": "A-touchofreality",
                                    "id": "i033mkl",
                                    "parent_id": "t1_i024m4x",
                                    "score": 1,
                                    "created_utc": 1646902128.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "And here I was, thinking that I was a cheapskate for having premium membership! Never had trouble finding a SB with premium though so you are right about that.",
            "author": "chemistryromance",
            "id": "hqzazpf",
            "parent_id": "t1_hqxa2a2",
            "score": 2,
            "created_utc": 1641156104.0,
            "replies": []
        },
        {
            "body": "This!",
            "author": "purpleyogi",
            "id": "hqy2hi1",
            "parent_id": "t1_hqxa2a2",
            "score": 1,
            "created_utc": 1641139402.0,
            "replies": []
        },
        {
            "body": "I never knew this before, so thank you for this advice!! Always thought “diamond” was a positive sign.",
            "author": "Myrtle_Snow333",
            "id": "hqyramn",
            "parent_id": "t1_hqxa2a2",
            "score": 1,
            "created_utc": 1641148948.0,
            "replies": []
        },
        {
            "body": "To be honest he sounds like one of those Narcissistic sociopaths that end up on being a person of interest for a first 48 or unsolved crime documentary .  I’d stay away gives me the chills just reading the conversation.  Men that view women that way don’t usually treat them well.",
            "author": "Tequila-porfavor",
            "id": "hqxv026",
            "parent_id": "t1_hqxg0ha",
            "score": 4,
            "created_utc": 1641136030.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "hqxhy6h",
            "parent_id": "t1_hqxg0ha",
            "score": 1,
            "created_utc": 1641128705.0,
            "replies": [
                {
                    "body": "Agreeing but extending, the fact that SR exist at all  speaks to the differentiation from escort work. While it is certainly true that one is a value proxy for the other, it absolutely not the same. The difference in quality of relationship between SB and an escort is huge, in my experience. And it is this quality of relationship I am investing in, the sex is a byproduct of the affection. I choose to invest in this because the SB is lending their prime years and should be compensated. Escorts are still relevant at appropriate times.",
                    "author": "Ill_Ad_3573",
                    "id": "hqxw613",
                    "parent_id": "t1_hqxhy6h",
                    "score": 3,
                    "created_utc": 1641136593.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "hr2bi6u",
            "parent_id": "t1_hr10vdj",
            "score": 0,
            "created_utc": 1641211714.0,
            "replies": [
                {
                    "body": "You are the one declaring whether a woman is an escort or not based on your, sole judgment. Period. And you encourage and enable others, including the manipulative asshole the OP met, to do the same. You should stop doing that because it's wrong, and because it perpetuates a male view of women as good or bad based on male judgment of them. I don't expect you to understand that, but please try.\n\nWhat you probably mean when you say SB, I'm guessing, is that you prefer a GFE SB and you recognize one based on how she makes you feel. That's fine. But that does not mean someone who does not do what you like, make you feel how you like to feel, does not belong in the bowl or isn't a good SB. Despite your sense of entitlement.\n\nAs for what I am - I'm no one to you because I don't give you the feeling you want and that you feel your deserve. And I guess I don't belong in the bowl either because I believe it can be whatever people want it to be, from platonic to just hook ups, so long as everyone plays nice and is as honest as they can be about what they seek. And you, my friend do not belong in my bowl, because with your judgments you are not playing nice.\n\nHere's hoping some of this sinks in.",
                    "author": "ziggy440",
                    "id": "hr2u3gg",
                    "parent_id": "t1_hr2bi6u",
                    "score": 2,
                    "created_utc": 1641221841.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I’m so happy to inspire you, gals hahaha",
            "author": "m4dw0r1d",
            "id": "hqyxwjw",
            "parent_id": "t1_hqyuspq",
            "score": 2,
            "created_utc": 1641151338.0,
            "replies": []
        },
        {
            "body": "Someone who is ready to roll into a platonic meet and greet is really the only way to cut through the majority of the scammers",
            "author": "YakiMe",
            "id": "hqxhcb1",
            "parent_id": "t1_hqxgd7p",
            "score": 7,
            "created_utc": 1641128289.0,
            "replies": []
        },
        {
            "body": "Same for me.. very awkward conversation with someone who left a very bitter aftertaste who was also diamond. I thought it was a good thing but reading this here makes total sense.",
            "author": "mymelancholybaby279",
            "id": "hqxsr70",
            "parent_id": "t1_hqxgd7p",
            "score": 1,
            "created_utc": 1641134929.0,
            "replies": []
        },
        {
            "body": ">I was paying an already hefty fee for premium  \n>  \n>$250 is a lot given how many scammer accounts get shut down.  \n>  \n>I’m “seriously wealthy” \n\nSir, with all due respect, seriously wealthy people don't talk about 'hefty fee's' when spending $90, or consider '$250 is a lot'.",
            "author": "A-touchofreality",
            "id": "hqzqpuk",
            "parent_id": "t1_hqy7tzh",
            "score": 7,
            "created_utc": 1641162265.0,
            "replies": [
                {
                    "body": "I said, “a lot” in the context of a scammer’s bottom line. \n\nYou must not know any wealthy people or the ones you know inherited their money. I worked hard to build wealth and wasting money is for fools. I‘ll eat in the finest restaurants and drink expensive bourbon, but even if I was a billionaire I’d still shun waste and avoid companies trying to get over on me.",
                    "author": "LordWildmore",
                    "id": "hqzsrhs",
                    "parent_id": "t1_hqzqpuk",
                    "score": 4,
                    "created_utc": 1641163056.0,
                    "replies": [
                        {
                            "body": "*> You must not know any wealthy people or the ones you know inherited their money.*\n\nNice *ASS*umption, but this comment only confirms my previous statement about your 'serious wealth'.",
                            "author": "A-touchofreality",
                            "id": "hr8dvve",
                            "parent_id": "t1_hqzsrhs",
                            "score": 1,
                            "created_utc": 1641315251.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Really interesting discussion... I had weighed diamond when I first started, because I thought it would weed out spam and save time, but I just turned my profile to private and instead messaged POTs directly as many here suggested, and I had pretty good success, and never felt like I needed diamond. Though I wonder if our experiences are different because NYC is apparently SB mecca, so the ratio is actually that favorable.",
            "author": "noobNYCsd",
            "id": "hqyd98g",
            "parent_id": "t1_hqy7tzh",
            "score": 2,
            "created_utc": 1641143717.0,
            "replies": []
        },
        {
            "body": "> I believe you have to show your proof of income and your ssn.\n\nAnd you seriously think someone who owns 6bil is going to give proof of income and SSN to a site such as SA?! \n\nROFLAO.",
            "author": "A-touchofreality",
            "id": "hqzpnoe",
            "parent_id": "t1_hqy9u55",
            "score": 3,
            "created_utc": 1641161852.0,
            "replies": [
                {
                    "body": "I’m confused as to what you mean but he’s very prominent and famously rich so it’s not a big deal to him to show his income.",
                    "author": "Prophetess111",
                    "id": "i024jr3",
                    "parent_id": "t1_hqzpnoe",
                    "score": 1,
                    "created_utc": 1646880483.0,
                    "replies": [
                        {
                            "body": "Sure, perfectly normal for 'very prominent and famously rich people' to show a site such as SA a their income! That is, if SA indeed would be so stupid as to ask for it, which of course they don't. LOL, you obviously have no clue how seriously rich people think and act.\n\nSo go after them 'rich and verified' Diamond members tiger!\n\n(Don't forget to read the scam sticky first though! Because you sound utterly naif)",
                            "author": "A-touchofreality",
                            "id": "i0343rr",
                            "parent_id": "t1_i024jr3",
                            "score": 1,
                            "created_utc": 1646902536.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "It’s says “more than 100 Million” on his Diamond profile",
                    "author": "Prophetess111",
                    "id": "i024m4x",
                    "parent_id": "t1_hqzpnoe",
                    "score": 1,
                    "created_utc": 1646880514.0,
                    "replies": [
                        {
                            "body": "It could also say he has a green coloured shine-in-the-dark dick on his Diamond profile. \n\nBut dream on!",
                            "author": "A-touchofreality",
                            "id": "i033mkl",
                            "parent_id": "t1_i024m4x",
                            "score": 1,
                            "created_utc": 1646902128.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Agreeing but extending, the fact that SR exist at all  speaks to the differentiation from escort work. While it is certainly true that one is a value proxy for the other, it absolutely not the same. The difference in quality of relationship between SB and an escort is huge, in my experience. And it is this quality of relationship I am investing in, the sex is a byproduct of the affection. I choose to invest in this because the SB is lending their prime years and should be compensated. Escorts are still relevant at appropriate times.",
            "author": "Ill_Ad_3573",
            "id": "hqxw613",
            "parent_id": "t1_hqxhy6h",
            "score": 3,
            "created_utc": 1641136593.0,
            "replies": []
        },
        {
            "body": "You are the one declaring whether a woman is an escort or not based on your, sole judgment. Period. And you encourage and enable others, including the manipulative asshole the OP met, to do the same. You should stop doing that because it's wrong, and because it perpetuates a male view of women as good or bad based on male judgment of them. I don't expect you to understand that, but please try.\n\nWhat you probably mean when you say SB, I'm guessing, is that you prefer a GFE SB and you recognize one based on how she makes you feel. That's fine. But that does not mean someone who does not do what you like, make you feel how you like to feel, does not belong in the bowl or isn't a good SB. Despite your sense of entitlement.\n\nAs for what I am - I'm no one to you because I don't give you the feeling you want and that you feel your deserve. And I guess I don't belong in the bowl either because I believe it can be whatever people want it to be, from platonic to just hook ups, so long as everyone plays nice and is as honest as they can be about what they seek. And you, my friend do not belong in my bowl, because with your judgments you are not playing nice.\n\nHere's hoping some of this sinks in.",
            "author": "ziggy440",
            "id": "hr2u3gg",
            "parent_id": "t1_hr2bi6u",
            "score": 2,
            "created_utc": 1641221841.0,
            "replies": []
        },
        {
            "body": "I said, “a lot” in the context of a scammer’s bottom line. \n\nYou must not know any wealthy people or the ones you know inherited their money. I worked hard to build wealth and wasting money is for fools. I‘ll eat in the finest restaurants and drink expensive bourbon, but even if I was a billionaire I’d still shun waste and avoid companies trying to get over on me.",
            "author": "LordWildmore",
            "id": "hqzsrhs",
            "parent_id": "t1_hqzqpuk",
            "score": 4,
            "created_utc": 1641163056.0,
            "replies": [
                {
                    "body": "*> You must not know any wealthy people or the ones you know inherited their money.*\n\nNice *ASS*umption, but this comment only confirms my previous statement about your 'serious wealth'.",
                    "author": "A-touchofreality",
                    "id": "hr8dvve",
                    "parent_id": "t1_hqzsrhs",
                    "score": 1,
                    "created_utc": 1641315251.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I’m confused as to what you mean but he’s very prominent and famously rich so it’s not a big deal to him to show his income.",
            "author": "Prophetess111",
            "id": "i024jr3",
            "parent_id": "t1_hqzpnoe",
            "score": 1,
            "created_utc": 1646880483.0,
            "replies": [
                {
                    "body": "Sure, perfectly normal for 'very prominent and famously rich people' to show a site such as SA a their income! That is, if SA indeed would be so stupid as to ask for it, which of course they don't. LOL, you obviously have no clue how seriously rich people think and act.\n\nSo go after them 'rich and verified' Diamond members tiger!\n\n(Don't forget to read the scam sticky first though! Because you sound utterly naif)",
                    "author": "A-touchofreality",
                    "id": "i0343rr",
                    "parent_id": "t1_i024jr3",
                    "score": 1,
                    "created_utc": 1646902536.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "It’s says “more than 100 Million” on his Diamond profile",
            "author": "Prophetess111",
            "id": "i024m4x",
            "parent_id": "t1_hqzpnoe",
            "score": 1,
            "created_utc": 1646880514.0,
            "replies": [
                {
                    "body": "It could also say he has a green coloured shine-in-the-dark dick on his Diamond profile. \n\nBut dream on!",
                    "author": "A-touchofreality",
                    "id": "i033mkl",
                    "parent_id": "t1_i024m4x",
                    "score": 1,
                    "created_utc": 1646902128.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "*> You must not know any wealthy people or the ones you know inherited their money.*\n\nNice *ASS*umption, but this comment only confirms my previous statement about your 'serious wealth'.",
            "author": "A-touchofreality",
            "id": "hr8dvve",
            "parent_id": "t1_hqzsrhs",
            "score": 1,
            "created_utc": 1641315251.0,
            "replies": []
        },
        {
            "body": "Sure, perfectly normal for 'very prominent and famously rich people' to show a site such as SA a their income! That is, if SA indeed would be so stupid as to ask for it, which of course they don't. LOL, you obviously have no clue how seriously rich people think and act.\n\nSo go after them 'rich and verified' Diamond members tiger!\n\n(Don't forget to read the scam sticky first though! Because you sound utterly naif)",
            "author": "A-touchofreality",
            "id": "i0343rr",
            "parent_id": "t1_i024jr3",
            "score": 1,
            "created_utc": 1646902536.0,
            "replies": []
        },
        {
            "body": "It could also say he has a green coloured shine-in-the-dark dick on his Diamond profile. \n\nBut dream on!",
            "author": "A-touchofreality",
            "id": "i033mkl",
            "parent_id": "t1_i024m4x",
            "score": 1,
            "created_utc": 1646902128.0,
            "replies": []
        }
    ]
}